{"name": "MOGA Rebel iOS Game Controller", "name_review": "MOGA Rebel iOS Game Controller Review", "ref": "https://me.ign.com/en/moga-rebel-ios-game-controller-ipad/94442/review/moga-rebel-ios-game-controller-review", "text": "Apple's move to standardize iPhone and iPad gamepads with iOS 7 was supposed to have legitimized the use of physical controllers with touch devices. But the initial certified peripherals were high on price and generally lacking in build quality, and a year later, compatibility is hardly a universal feature among top games. Unfortunately, that last issue remains, but MOGA thankfully learned some lessons from last year's so-so Ace Power device and incorporated that knowledge into the new Rebel. It's easily the smartest iOS option released to date: unlike the form-fitting iPhone controller shells and wireless iPad-centric pads that pick one iOS device or the other, the Bluetooth-connected Rebel is designed as an equal companion for both. That's thanks to a pullout plastic arm that can hold a phone in placeand hide away when not needed. It's the most unique feature of the MOGA Rebel, and it's a great one. The arm snaps into place on the controller when using it with the iPad, making it look much like a full-sized, third-party Xbox pad. Pull out your iPhone or iPod touch and you can simply extend the arm upwards, fit your device between the expandable rubberized grips, and have it sit snugly in place while you game with a real controller in hand. The ~S.M.R.T. Lock~ acronym doesn't seem to stand for anything, but it really is an intelligent solution for cross-device compatibility. The gamepad itself is pretty solid, with nicely responsive buttons, although the analog sticks and triggers all feel a little loose. However, the Rebel suffers somewhat from feeling oddly insubstantial, as it's super light and the plastic feels a little low-grade. Compare it to the weighty and super-sturdy new-gen console controllers and the difference is huge. Even with the grip arm, I'm not sure why a controller of this build quality comes with an $80 price tag. Still, if you can handle forking over that much for an accessory, youll get good use out of it. The built-in 680 mAh battery pack provides plenty of juice; I played for several hours without losing the charge. The MOGA Rebel also works with a list of 100+ notable games, including console and PC ports like Star Wars: Knights of the Old Republic and Terraria, plus mobile hits like Oceanhorn and Asphalt 8: Airborne. There is one caveat about this controller: iOS 8 has introduced controller-centric bugs in its early days of release, and some should-be-compatible games simply don't recognize the Rebel, or the input is laggy. BioShockpictured on the controller's packagingwouldn't work at all with the Rebel on my iPhone 6 or iOS 8-equipped iPad Air, but it ran fine on the tablet before the OS upgrade, along with my iOS 7-equipped iPhone 5s. This issue doesnt appear to be MOGA's fault at all, but the timing is terrible, given its near-concurrent release with the new iPhones and iOS 8. When I spoke with the company, they said they were working with Apple to resolve the issue, but unfortunately didn't have an exact time frame of when that would happen. Pros For all iOS devicesSolid inputsNice battery life Cons Insubstantial feelPricey The MOGA Rebel is the best iOS gamepad out today, thanks to an inventive, retractable grip arm that makes it an ideal fit for both iPhone and iPad. But while a very good controller overall, the build feels a little less than premium, particularly considering its high price. Also, those using iOS 8 should be aware that there are some iOS 8-related compatibility bugs for now.", "date": "Oct. 12, 2014,"}