{"name": "Destroy All Humans 2: Reprobed", "name_review": "Destroy All Humans! 2: Reprobed Review", "ref": "https://me.ign.com/en/destroy-all-humans-2-reprobed/200850/review/destroy-all-humans-2-reprobed-review", "text": "There was a time, back in the PlayStation 2 and original Xbox era, when a lot of sequels were what kids today would call just a bunch of DLC stuck together. Thats basically what weve got with Destroy All Humans! 2: Reprobed  a loyal, graphically updated remake of a 2006 sequel that goes to new locations, adds a handful of new weapons and enemy types, revamps the upgrade system, and extends the story. Even so, it plays so similarly to 2020s Destroy All Humans! Reprobed that it feels like a clone of what I played two years ago  except its comedy act has already worn a bit thin.Bearing that in mind, I have pretty much the same praise and the same complaints about the quality of this remake. The gameplay has held up fairly well in that its pretty satisfying to bounce around with a jetpack blasting people with a Palpatine-like lightning gun and popping their heads to collect the brains inside. Cartoony character models and 4K textures look respectable when making out details like Cryptos pointy teeth, and the dynamic lighting effects cast by various ray guns are a nice touch. Its the animations and lip syncing that seem behind the times; stiff movements and strange gesticulations during cutscenes remind us of a world before motion-capture animation became the norm and give everyone an action figure look  you can't unsee the barely articulated fingers. Its also noticeable that there arent that many unique faces among NPCs, and its fairly common to come face to face with a doppleganger every minute or two when youve possessed a human body (which works very much like the first games HoloBob disguise).There are a few other hints that this is an old game thats been upgraded, as well: for one, theres not a single cryptocurrency joke in a 2022 comedy game where the main characters name is literally Crypto. But more egregious than that, when you arrive on the Japan map youll hear prolific voice actors like Yuri Lowenthal and Steve Blum playing some Japanese caricatures they would probably wince at today. This, more than Cryptos newly amped-up horniness, is very likely what inspired the warning you get when you start a new game, which cautions that the story, words, and images contained within may be shocking to the modern human brain.There's not a single cryptocurrency joke.Skipping ahead 10 years after the first game to 1969, Cryptos new enemies are buffoonish Soviet KGB agents whove discovered the Furon presence on Earth. Joining him are his old boss Pox (voiced by Invader Zims hilariously shouty Richard Horvitz) and hypersexualized KGB defector Natalya Ivanova, who is there largely to inspire a constant barrage of sleazy jokes from Crypto. Naturally, absolutely nothing is taken seriously, but that doesnt stop Destroy All Humans 2 from spending a lot longer on dialogue than its humor justifies. Listening to an alien imitating Jack Nicholson riff at length on the fashion sense of hippies, call a Soviet Ivan for the umpteenth time, or rattle off pickup lines like If I told you you have a great body would you hold it against me? wasnt exactly cutting-edge comedy back in 2006, much less today. Mercifully, you can skip most of it easily once you get tired of it.What We Said About Destroy All Humans! ReprobedBlasting through the bright and cheery 1950s world of Destroy All Humans! is a simple but satisfying kind of fun, and theres a lot to be said for that. Just like the original, this remasters comedy is a little hit or miss but its attitude is in full force all the way through thanks to some overpowered alien abilities that let you mow down the puny human resistance like an overlord.  Dan Stapleton, July 27, 2020Score: 7Read our full Destroy All Humans! Reprobed review By modern open-world standards  yes, even compared to the latest Saints Row  Destroy All Humans 2s five modestly sized maps are barebones in terms of interactivity and things to do beyond destroying simple-minded humans. They are based on San Francisco, London, Tokyo, Tunguska, and a secret base circa 1969, but outside of payphones virtually nothing is interactable, and they dont have the abduction and rampage challenge missions the first game does. Local color comes from scanning the thoughts of pedestrians, which contain some of the best jokes youll find  many make reference to 50s pop culture and current events, while others are just about going commando. I do give Destroy All Humans 2 credit for letting us destroy nearly any building (though theyll come back if you reload the map), and theyre largely bright and colorful playgrounds to blast enemies in.That fighting could be a bit more engaging, though. I started out on the second-highest difficulty and found myself feeling nearly invincible out of the gate. I died once in the opening couple of hours as I learned how Cryptos recharging shields worked, but after remembering that his high mobility meant I could simply fly away when I was in danger I didnt lose another fight until about a dozen hours later. At around that point the challenge finally kicks up a notch and some of the bosses actually fight back in a meaningful way. Even so, my final death count was just 16 after around 25 hours played, and that counts a couple of boss fights where I died multiple times as I experimented and figured out how they worked. There are some mutators you can enable to make everything harder (or easier, or just to give people big heads), but not until youve already beaten a mission for the first time and want to replay it.Even in large numbers human enemies simply don't stand a chance.The main reason its usually so easy is that the vast majority of fights in missions are against human enemies, and even in large numbers they simply dont stand a chance  even before you start upgrading your arsenal to more efficiently eradicate them. The fact that you can quickly and easily grab nearly any enemy with psychokinesis and launch them into low Earth orbit even faster than you could blast them with a ray gun  and without spending ammo  makes nearly every encounter trivial and the consequences of being spotted by the police basically irrelevant. (It is notably hilarious that British police will immediately open fire when youre noticed; UK police dont typically carry guns.) Admittedly, thats in keeping with the theme of being a technologically advanced alien invader, but the power-fantasy appeal of these slaughters wears off a lot quicker after having done all of this in the first game already.Combat never actually gets all that interesting, but it becomes a little more demanding when you start to encounter beefier enemies who are shielded or vulnerable to a specific weapon, requiring you to switch between them instead of picking a gun you like and pulling the trigger til it goes click. The new weapons dont do much to change things up  the Dislocator disc amusingly bounces targets around randomly but isnt terribly efficient at killing them, and the others mostly amount to new area-of-effect attacks. By far my most used was Gastro, a summonable flying sidekick who shoots enemies for you; hes handy when the going gets tough.What saves the missions from being almost entirely made up of simple firefights (often requiring you to scan brains to find your target first) are the secondary objectives that pop up. Maybe youre prompted to use a specific weapon to kill some specific enemies, or avoid touching the ground when traveling across the city. A lot of these are mundane, but every so often there was something that changed up the straightforward objectives and made me work a little to get a perfect score on the mission and earn the maximum upgrade points.Body-snatching isnt used nearly as often as it is in the first game  in fact, just about the only time you need to do it is to get missions from people who only speak to a specific character or, for example, a generic black ninja. I admit I didnt really miss the light stealth of the first games missions, but I never quite got over the disappointment of not being able to use the weapons or abilities of a character Id possessed.The flying saucer gameplay is still not great.Also mostly unchanged is the flying saucer gameplay, which is still not great. Aside from blowing things up, most of the other tasks its used for are moving large objects from place to place, or as an inconvenient form of fast travel between unlocked landing zones. Also, every time you come to a new area youre encouraged to unlock upgrades by flying around and hoovering up dozens of humans of various stripes, such as police or ninjas or KGB agents. Given how simple it is to deflect incoming missiles and obliterate targets on the ground, the only challenge is searching the map for the specific kinds of humans you need  once you know where they are, it becomes almost as dull as actual vacuuming. You could likely burn through the main missions fairly quickly, but I did every side mission I could find  which was quite a lot. Many of them revolve around converting people to your alien god-worshiping cult, and those generally have you impersonating humans to get a mission  usually killing other humans  after listening to another excessively long introduction that repeats the name Arkvoodle way too many times. These missions are certainly useful for feeding the expanded upgrade system (each weapon now has six upgrades instead of three) but it was a little anticlimactic to find that all of this missionary work amounted to a new weapon unlock and didnt tie into the main story.Its kind of a shame Destroy All Humans 2 doesnt support online co-op, but split-screen is suitably retro and lets you and a friend double down on destruction. (It can also be done over Steams Remote Play Together streaming feature if youre on PC.) Theres no friendly fire and you cant pick each other up, which limits opportunities for goofing on each other, but few games arent improved by running around with a friend. Theres also a Duel mode where you compete to see who can break the most stuff the fastest, which is fun but very much like what you do when youre just playing co-op in the campaign, and a PK Tennis game thats sort of like the regular sport but harder to control. I dont see that last one one taking off, to be honest.Bugs werent too bad, but its definitely not the smoothest ride Ive ever had even among open-world games. I saw things like being unable to get out of the flying saucer until I restarted the mission, vehicles suddenly launching themselves into the sky without being touched, character models from gameplay persisting into a cutscene and standing around like a confused extra whod walked into the shot, and a handful of crashes in my 25 hours played (which Im only forgiving of because the aggressive autosave system meant they didnt cost me more than a few moments progress). Destroy All Humans! 2: Reprobed does a fine job of updating the 2006 original to look like a modern game, but that game was a fairly unambitious sequel that didnt do much to evolve its gameplay. And while Id be fine with a somewhat repetitive story that breaks up its missions with comedy, this is some solid C+ material that only occasionally lands a chuckle  and more often some serious cringes. Split-screen co-op makes it more enjoyable to blast through and combat does eventually get tougher when bulkier enemies join the fray, but by and large its more of the same B-movie sci-fi homage without a lot of brain-popping new ideas.", "date": "Aug. 26, 2022,"}