{"name": "Costume Quest 2", "name_review": "Costume Quest 2 Review", "ref": "https://me.ign.com/en/costume-quest-2/94033/review/costume-quest-2-review", "text": "Imagine you threw a Halloween party and your friend showed up with a slight variation of the same costume he or she had last year. You might be a bit disappointed by the lack of imagination, but something like that can be forgiven if the partier keeps folks laughing all night. Costume Quest 2 is like that. It sticks very close to the 2010 original's candy-collecting template, but I overlooked all that once this endearing roleplaying games characters and time-travel humor grabbed hold of me. Unfortunately, it also has a drinking problem. Thats not a metaphor: Costume Quest 2 literally has a drinking problem in how frequently it forces you to run back to drinking fountains to heal up. As much as the combat has improved from the scant battle tactics in the original by way of countering, a rock-paper-scissors elemental system, costume upgrades, and a better buff system, Costume Quest 2s straightforward fights dont allow you in very many ways. The problem reared its head around two-thirds of the way through the six-hour story, when enemies get a lot stronger. Running back and forth turned the last third of Costume Quest 2 into far more of a slog than it should have been. I'm not sure why the change was made to get rid of the original Costume Quest's post-battle full health regeneration, but it wasn't for the better. Costume Quest 2's combat as a whole, however, deserves commendation; it's not quite at the level of epics like Persona 4, but battles never got repetitive like they do in the original. Due to the ability to add a second attack if the first is timed right, and the option to charge a block for one character and turn it into a counter (trading off that you might not react in time if the enemy attacks one of the other two), there's a lot more to think about. The aforementioned buff system, now implemented via ~Creepy Treat Cards,~ offers a bit more freedom than Costume Quest's Battle Stamps. While the original required you attach a single attribute to each character with only 24 modifiers to play with, there are 45 different Creepy Treat Cards which can be used by any character at any time in battle with a three-to-five battle cooldown period. Most importantly, Creepy Treat Cards aren't mandatory like Battle Stamps, so you can forgo them for extra challenge, though there's a far bigger one in the form of the inanimate HP-sponge Candy Corn costume that trades a third of your attack options in each battle for a clever quip about the Halloween staple and a hard-earned Achievement/Trophy at the end of your Quest. But again, everything is slowed down by those runs back to the fountain. They were annoying enough when I knew where to go to heal up, but when you enter a new part of Costume Quest 2's world, you won't have a map. You can buy a new map, but when you do, you still have to figure out where you are on that map, because it doesnt tell you. While that's not an issue with some of the more wide-open areas in the beginning, more than one of the future-set stages included far more twists and turns than the map could detail, largely because of developer Double Fine's insistence to making maps look like a child's drawings. Another minor issue comes in the form of Costume Quest 2's itchy trigger finger. On more than one occasion each, I accidentally skipped a cutscene (that could not be replayed due to autosaving) with a single wayward button tap or accepted loss in a battle by mistakenly scrolling over to the ~run away~ battle option. A simple ~are you sure?~ prompt in each situation would have done wonders. Yet Costume Quest 2 won me over with the colorful locales and endearing characters that popped up during Reynold and Wren's second quest to save Halloween. The time travel and resulting dystopian locations like an oppressive school and a Metropolis-style slum are great, even if the objectives haven't found therein evolved much beyond the knocking on doors and getting tricks or treats we did in the original. The formula worked then, and it works now, though without the benefit of novelty. It replenishes that somewhat with a main villain, a sugar-hating dentist, who actually has personality. That's a big improvement over the originals forgettable candy-stealing monsters. The time traveling also allows you to see multiple forms of the same NPCs, which helps to even make the most common-seeming bystander a bit more memorable. That, and constant references back to old Double Fine games and Earthbound, which is one of the biggest influences for Costume Quest, make Costume Quest 2 a cute and lighthearted seasonal RPG despite a few dips in the action due to trips to the fountain. Pros Cute and funnyImproved combatSubtle fanservice Cons Healing sucksRecycled ideas Costume Quest 2's combat and story are both surprisingly good for an RPG that concludes in roughly a half-dozen hours. A few weird design choices in regards to the health system and navigation meant that just a bit too much of that time was spent backtracking and squinting at a map, but its humor and personality shine through to make this a good Halloween bounty.", "date": "Oct. 8, 2014,"}