{"name": "Total War: Warhammer 3 Single-Player", "name_review": "Total War: Warhammer 3 Single-Player Review", "ref": "https://me.ign.com/en/total-war-warhammer-3-single-player/194488/review/total-war-warhammer-3-single-player-review", "text": "Note: This review covers the single-player campaign of Total War: Warhammer 3. Keep an eye out for our multiplayer review soon after launch.We've finally come to the end of the sweeping dark fantasy trilogy that began six years ago, and Total War: Warhammer 3 is a worthy capstone. With interesting campaign mechanics that build up rivalries between its memorable main cast and several new armies that don't play like anything we've seen in Total War before, it excels on just about every level, strategic and tactical. And a collection of little quality-of-life changes carried over from other recent Total War games tie the single-player campaign up with a nice little bloodsoaked bow.The main campaign in Warhammer 3 is very story-driven, even more so than Warhammer 2's Eye of the Vortex. And that can be both a good and bad thing. Having completed it three times now, I don't think it has the endlessly replayable sandbox potential of the Mortal Empires campaign available to owners of the first two games. And while Warhammer 3 will eventually get its own version of that, Creative Assembly has said we might be waiting a while for it. Currently, you can't even play as any of the Warhammer 1 and 2 races in skirmish battles, though they do appear on the campaign map as enemies to be vanquished.So if you're looking to just pick a faction and conquer the world at your own pace, you're better off sticking with Mortal Empires for now. The pacing of this new campaign is almost too hectic, as you race against the other major factions to claim four Daemon Prince souls and free, slay, or perhaps even devour the bear god Ursun. You can set your own goals to an extent, but you're not exactly going to have free hands to pursue them. There are some upsides to that, like allowing your lesser generals to build up reputations and niches of their own while Skarbrand or Miao Ying are off fighting through the Chaos Realms half the time. Or better yet, having your faction leader return in a blaze of vengeance from a foray into Hell to reclaim settlements you lost in their absence. But I also felt like I was constantly being herded toward the final battle by forces beyond my control, which can harsh my buzz if I'm just having fun smashing some puny humans.Those mechanics allow for a type of scenario Total War has never attempted.This urging takes shape as something that's halfway between a traditional Total War experience and a single-player campaign in an RTS like Warcraft 3, and looked at from that perspective its excellent. Each Chaos realm you must assault has its own unique challenge to solve that reflects the character of the dark deity who owns it, and culminates in an exciting new type of battle that has you fighting your way through some truly harrowing, horde-style maps using your ability to build defenses and call in reinforcements. Those mechanics allow for a type of scenario Total War has never attempted, and its refreshing to see the time-tested formula used in new ways. We Built This CityRegular siege battles have been reworked to use these systems as well, which makes them much more tactically interesting and keeps them from all playing out exactly the same, as could happen in Warhammer 2. However, there are probably too many ways to breach the walls now, making outer fortifications feel like more of a speed bump than a real obstacle as an attacker or useful resource as a defender. It can be exciting to have to fall back steadily through a city as a siege progresses, but I'd like these giant defensive structures I built to at least keep out some of the less determined invaders.What We Said About Total War: Warhammer 2I feel like a broken record saying this is the best Total War game so far, since Ive felt that way about each major release since Attila. But it really is true: Creative Assemblys designers are honing their campaign and faction design consistently from game to game, and that progression is clearly on display in Total War Warhammer 2. Theres not as much progress as Id have liked to see in the politics and diplomacy systems, which show only modest improvements. But each of the four factions is a distinct and fun-to-play addition to the growing roster. The story and objective-driven campaign is a league above anything weve seen in the entire Total War series before in both design and presentation. Im anxious to see how it all fits together when the combined Moral Empires campaign is released to owners of both games later this year. - Leana Hafer, September 25, 2017Score: 9.1Read the full Total War: Warhammer 2 ReviewThe battle maps all look gorgeous, though. Well, except the ones that are supposed to be horrifying, like the putrid swamps of Nurgle or impossible spiraling towers of Tzeentch, which are appropriately breathtaking in their own way. The campaign map, though, looks a bit less detailed than Warhammer 2. Some of the ground textures are noticeably lower-res, and especially some of the trees and vegetation seem to have had their polygon budget gutted, even on max settings. The map is also considerably bigger than even Mortal Empires, so I can understand if this had to be done for performance reasons. And it does run very well on my Ryzen 7 3700X/RTX 2060 Super-driven system, only rarely dropping below 30fps at 1080p with everything cranked up.I'd miss the heck out of these if I went back to Warhammer 2.While the campaign map itself wasn't always dazzling, the new diplomatic options and quality-of-life features it brings are some of the best parts of Warhammer 3. They're the easiest upgrades to forget about when you quickly get used to them, but I'd miss the heck out of them if I went back to Warhammer 2. The brilliant Quick Deal button we first saw in Total War: Three Kingdoms makes it easy to see who would be willing to sign a trade agreement without having to open every faction's embassy individually. A ~Balance Deal~ button cuts down on what must have added up to hours I used to have to spend just to see how much gold I could get out of a peace treaty by trying different amounts over and over. Now we can cut out the haggling and get down to business. On top of that, alliances are much more rewarding than what weve seen in the previous two games, since here you can construct outposts in allied settlements that let you recruit their units as a return on your investment. So if you're playing as the Daemons of Khorne and you need some ranged firepower to complement your extremely melee-focused horde of bloodthirsty ravagers, making friends with Tzeentch will give you four army slots that can be spent on his units. There's also a useful new favors system that can allow you to, among other cool things, just borrow an entire army stack from an ally temporarily.All of the newcomer factions in Warhammer 3 are creative, fresh, and interesting.Even without cross-faction recruitment, all of the newcomer factions in Warhammer 3 are creative, fresh, and interesting in and of themselves. Slaanesh can seduce units to his side in battle and even beguile entire factions. Cathay can send caravans off to the far-flung corners of the world and they send back exciting random events and the chance to have heroes from other factions join your caravan. And Khorne spawns free armies when razing a settlement, which can then go on to raze more settlements and spawn more free armies, creating the most gleefully aggro faction in a world with a lot of very aggro factions. One of the hardest decisions was simply deciding which one I wanted to try out next.My Little ApocalypseAnd thats just on the strategic map; they each have a distinct and novel feel on the battlefield, too. Tzeentch's units have barriers that recharge when they're out of combat, encouraging hit-and-run tactics. Cathay's harmony system rewards you for keeping ranged and melee troops together, making them the ultimate combined arms formation army. The Ogre Kingdoms have infantry that can carry around cast iron artillery guns like it's no big deal, which has led to some of my most hilarious and joyfully lopsided victories. The real star of the campaign, though, is the Daemons of Chaos faction. Theyre able to recruit from the rosters of all four Chaos gods, and you can customize your murderous Prince of the Apocalypse with wonderfully deadly body parts, from scythe hands to cloven hooves to enormous crow wings, all giving different bonuses. You even get to name him! Ragnarr, my large adult Daemon son, devoted himself to Khorne and ended up with a sword that deals roughly one billion armor-piercing damage, as well as an ability that healed him every time someone died nearby. There's nothing quite like taking a warm, soothing shower in the arterial blood spraying from your vivisected foes. The customization and sense of ownership made them easily my favorite faction. And you get introduced to the would-be Prince in a riveting prologue that might be the best Total War tutorial for complete newcomers I've ever seen. Total War: Warhammer 3s single-player mode presents us with a tense, challenging, multilayered campaign driven along by a compelling story and a memorable cast of rivals. The Chaos Realms cleverly draw these larger-than-life figures together, so even those from remote corners of the world will be able to test each other's mettle. And while the size of the faction list currently feels a bit disappointing coming from Mortal Empires, all of the newly introduced factions are inventive and just plain fun on the campaign and battle maps. The true test of Warhammer 3 is still to come, when we'll get to play with all the factions from all three games on the massive combined map. But even if that's the main reason you're interested in it, there's plenty of excitement to be had already.", "date": "Feb. 14, 2022,"}