{"name": "Fallout 4 VR", "name_review": "Fallout 4 VR Review", "ref": "https://me.ign.com/en/fallout-4-vr/141311/review/fallout-4-vr-review", "text": "Walking through the ruins of Boston in Fallout 4 VR is a sobering experience that makes the post-nuclear world feel that much more real. Fallout 4 clearly wasnt built for this, as the troublesome Pip Boy menu system demonstrates all too well, but you can get around and defend yourself well enough that if you love Fallout and have a high-end PC and an HTC Vive, its hard to say no to. Given the sky-high system requirements of a GeForce GTX 1070 or AMD FX 8350, its not all that surprising that Fallout 4 looks pretty respectable in VR. Far fewer knobs had to be turned to their lowest setting here than in Skyrim VR on the PlayStation 4, and while Fallout 4 was never a cutting-edge game when it comes to graphics, character models, textures, and draw distances are only a little bit below where I remembered them. I did have a few stutters on hardware above the requirements (a GTX 1080), but those appear to be limited to certain areas  such as Vault 111, which doesnt make the best first impression. But it soon smoothed out, and for the most part played as expected. The menu options allow for a fairly flexible VR experience. By default its set for teleportation, with the indicator turning from blue to green if its far enough away from you to burn your stamina. Switching from teleportation to smooth movement makes for a nice walk through the wasteland, if you can stomach it. I wasnt able to get smooth turning to work, though there appears to be a menu setting for it, and that left me with the incremental turning when I was at the limits of my Vives cord. If you thought Fallout was gory before, you haven't seen anything yet.Because the combat in Fallout is focused on shooting, picking up a gun and blasting mole rats and raiders feels pretty good. Not quite as smooth as a made-for-VR shooter like Robo Recall or Superhot VR, but not bad. And you can pistol-whip enemies, too. When a gaggle of feral ghouls gets up in your face, activating VATS to stop them in their tracks for a few auto-aimed headshots is a lifesaver. And if you thought Fallout was gory before, you havent seen anything until the blood and eyeballs are spraying right at you. That said, the sense of presence isnt great when interacting with the world. Thats largely because your hands arent modeled in the world unless youre using them as bludgeoning weapons, so when you reach out and grab a piece of junk to look at it you dont see a hand grasping it  it just floats above your fist or gun or Vive controller model. Its also disappointing that, like in Skyrim VR on PlayStation VR, youre not able to pick up and move around corpses (or pieces thereof) like you can in the normal version of Fallout 4. Id guess thats out of fear of causing frame rate issues when the physics go bonkers, which is understandable but disappointing. There are some cool VR-focused UI touches, like keeping the compass down below your line of sight, letting you take in the view around you without a trace of floating HUD until you look down or at your gun hand. And when you raise your left wrist your Pip Boy grows dramatically so you dont have to keep your arm right in your face to read it. Some thought has gone into this adaptation. But actually using the Pip Boy? That's pretty rough.But actually using the Pip Boy? Thats pretty rough. Youd think it would use a virtual touch interface like a wrist-mounted iPad, but you actually have to flip through the categories and subcategories and scroll through the lists by swiping and clicking the left touchpad, which is not a great way to do it. To be fair, Fallout 4s menus arent a great experience with any controller, but in Fallout 4 VR the Vives trackpads make it tough enough to scroll through lists without accidentally switching categories that I got tired of holding my arm up while trying to swap my gear around. And you have to use it a lot, which bogs Fallout 4 down quite a bit in a very frustrating way. Considering how cumbersome the inventory management is to use, its a very strange design choice that the action doesnt pause when youre looking at your Pip Boy like it does in the normal game. That makes you much more vulnerable in a fight, since you cant call time out whenever you like, and youre completely dependant on the quick-access favorites menu to heal yourself while under fire. So consider keep the difficulty low until you figure things out. A couple of warnings before you jump in: while Fallout 4 VR does run on the Rift, the controls are all but unplayable right now, so maybe hold off on that. It also doesnt include any of the DLC, which is kind of a bummer considering that content is over a year old. And, right now, there is zero support for mods  even your saved games from Fallout 4 wont transfer over to Fallout 4 VR for some reason. But, of course, theres still a ton of excellent content built in, and exploring it up close is impressive. For more on that, check out my Fallout 4 review. Fallout 4 VR lets you experience the post-nuclear future in a much more intimate way. Its adaptation to the Vives hand-tracked Touch controls works fairly well for moving and shooting, but poorly for using the Pip Boys clunky interface, and thats something youll need to do frequently. But its worth putting up with to come face to face with Fallout 4s characters, monsters, and settings.", "date": "Dec. 17, 2017,"}