{"name": "Motorola Moto G (2014)", "name_review": "Motorola Moto G (2014) Review", "ref": "https://me.ign.com/en/motorola-moto-g-2014-1/93409/review/motorola-moto-g-2014-review", "text": "Last year, Motorola proved that a good smartphone doesn't need to come with a high price tag, a lengthy contract, or even service through a major wireless provider. 2013's Moto G was a wise choice for shoppers on a budget, providing a quality constructed handset with a near-stock version of Android and mid-range specs that kept things moving along quite nicelyall for under $200 USD. For its encore performance, the new $180 Moto G is bigger than its predecessor and includes a few upgradesbut are the changes good enough to, once again, make potential buyers think twice before dropping their hard-earned money for a pricey, post-paid smartphone? It's certainly possible, but only if folks are willing to make a few sacrifices. Like the company's new flagship Moto X smartphone, the Moto G now sports a larger screen, increasing in size to 5 inches from the 4.5-inch display that came with last year's model. The resolution hasn't changed, though, so you're still looking at a 1,280 x 720 screen, but at this size, the pixel density has dropped from 329 ppi to 293 ppi. Individual pixels can be seen if you really look for them, but it shouldn't be a problem for most users. Along with the bigger display, the Moto G sports a few other visible changes. The new model is obviously taller and wider than its predecessor, but is roughly the same thickness and weight. Because of its larger dimensions, the new Moto G isn't quite as comfortable to hold as last year's model, and the slippery white plastic that came with our review unit is a huge downgrade from the soft plastic that came with the Moto G we reviewed a year ago. The new Moto G also comes with horizontal grills for the speakers and microphone, mimicking the new Moto X, although they aren't made with nearly as nice of a materialan understandable tradeoff, considering this is a budget device. On the rear is a center aligned camera that perfectly lines up with the Motorola logo, keeping the same sense of balance found on the high-end version of the company's phone. Powering the device are a 1.2 GHz quad-core Qualcomm Snapdragon 400 CPU and 1GB of RAMthe same internals in 2013's Moto G. It's disappointing to not see any upgrades in this department, and although no major hiccups were experienced during my time with the phone, Android devices tend to slow down a bit as time goes on and more apps are installed. As a result, the older hardware may cause issues later down the line. When we ran benchmark tests, the new Moto G was comparable to devices that came out years ago, and regularly achieved scores lower than its predecessor. In real-world usage, animations in Android 4.4.4 felt slow, but at least they weren't choppy. The phone handled waves of enemies in Kingdom Rush Frontiers and alien invaders in XCOM: Enemy Unknown just fine, with no glaring performance issues. If you're the type to play larger games like the aforementioned, take caution because the Moto G only includes 8GB of built-in storageI had to clear up quite a bit of space just to install XCOM. Fortunately, the device does include a microSD card slot, which is something you'd definitely want to take advantage of since only about 5.5GB of space is available for users to begin with. The 2,070 mAh battery, on the other hand, cannot be removed, but battery life was good enough that its likely that you wouldn't need to take advantage of a swappable unit anyway. The phone was more than capable of getting me through a full day with moderate use, and easily made its way to a second day on light usage. L to R: Moto X (2014), Moto G (2014), Moto G (2013) A big feature missing from the new Moto G is LTE connectivity. If wireless speeds are important to you, you may want to look at the LTE-equipped 2013 model instead, or else you'll be stuck with HSPA+ speeds. This might not be a problem if you're the traveling type looking for a global phone that will keep you connected while on the go, but in areas where high-speed coverage is prevalent, the slower technology can be bothersome. The new Moto G's camera has been updated from a 5-megapixel shooter to an 8-megapixel version, but picture quality is still best reserved for sharing on social networks that tend to lower photo quality for everyone. While posting pictures to Instagram is just fine, you'll be missing out on clarity and quality color reproduction when viewing your shots at higher resolutions or when making larger prints. Interestingly, the Moto G produced more accurate colors than the new Moto X when it came to low light shots. For software, the Moto G includes a near-stock version of Android with only a few tweaks here and there by Motorola. You won't see some of the fancier features found on the Moto X like Moto Display or Moto Voice, but it does include Moto Assist, which enables the phone to take certain actions when you may be on the road or at home. For example, the phone can be set up to read out text messages while you're driving or announce calls when you're at your house or apartment and might be away from the handset. Pros Affordable.Good battery life.Stock Android. Cons No LTE.Subpar camera.Same internals that powered last year's model. If you're looking for a quality device with a larger display, while making sure you have plenty of cash in your bank account, the Moto G is still a great choice. It may not have the high-tech features, impressive camera, or nice build materials of a flagship device, but it does cost a fraction of the price.<br/><br/> If you're on a budget and want a new phone with high-speed wireless coverage, though, you may want to look at last year's Moto G instead. Although a smaller phone, it has the same internal specs and screen resolution, and the LTE model can be picked up for as low as $200 unsubsidized.", "date": "Sept. 30, 2014"}