{"name": "Wasteland 2", "name_review": "Wasteland 2 Review", "ref": "https://me.ign.com/en/wasteland-2/90011/review/wasteland-2-review", "text": "Post-apocalyptic stories usually agree on one thing: technological progress in such dire straits tends to slow to a glacial crawl. The heroes prowl about the wastes with tech that should have been outdated decades ago, and they refashion it to meet the needs of their generation and pray that it holds up. Wasteland 2 is a little like that. Perhaps intentionally, it looks like a relic of the RPG glory days that coincided with the Clinton administration and the popularity of the Spice Girls, and it clings to traditions that seem quaint in these days of big budgets and accessibility. But much like its dusty survivors, Wasteland 2 finds strength in cherishing the past. It even manages to highlight a few ways in which the old ways of the isometric, turn-based roleplaying games really were better after all. A surprisingly competent live-action cutscene introduces us to a band of grizzly-bearded biker types and hard-eyed women. Our heroes are the Desert Rangers; they're not The Avengers. They're imperfect and flawed, and much of the following story gains its momentum from the surrounding populaces' unwillingness to trust them after past failings. That flashy cutscene is one of Wasteland 2's few nods to the sensibilities of the modern era. Everything afterwards reveals an old-fashioned drive to make you work for your satisfaction. For example, it disavows heavy voice acting for quests in favor of reams of text. If youre in a hurry, youll see only the highlighted key words and objectives you need to complete your mission. However, I liked how it rewarded my taking the time and attention to read carefully with not just a considerable dose of dark humor and descriptive depth, but also a wealth of choices that depend on the passive skills of your party members. It's a world where a character with the ~hard ass~ trait can usually bully necessary items out of wary townsfolk without a fight. Thanks to good writing, it's a world that often feels real. On the other hand, much as in Divinity: Original Sin, Wasteland 2's quest objectives are often frustratingly unclear, and I did run into the occasional bug that impeded my quest progress if I deviated from what must have been the proper sequence of events. What voice work there is in Wasteland 2 is wisely put to effective use. A memorable early quest forces you to choose to save either the inhabitants of Hightown or the Ag Center, for instance, and you'll have to listen to the tragic fate of the town you didn't choose over the radio. The voice work in such cases is uncommonly good; in fact, it's rather disturbing. It's also just a preamble to the stuff you'll hear once your group advances to places filled with the oh-so-proper factions like the ~Mannerites~ in California, and they help to emphasize that your choices have meaning and that there's a world that exists beyond the immediate action in front of you. Something always needs doing, and there's always a sense that you've let somebody down in this harsh landscape. When the 50-hour journey is over, these choices are whats most memorable about Wasteland 2. Another way inXile's RPG distinguishes itself is in its welcome break from most modern games by placing the emphasis on an initial four-person team instead of an individual hero. You can start with pre-made characters with role-suggestive names like Big Bert and Pills, but they lack the rich personalities of the supporting cast in a game like Dragon Age: Origins, and their skills occasionally overlap. You're thus better served by creating your own party. Even then, you'll find yourself limited; the tiny number of points available for the daunting number of skill trees means you'll always have to forgo some skill that might make a particular encounter simpler or entirely avoidable. The design complements the harsh world that surrounds them, yes, but at times developer inXile seems to go to excessive lengths to give characters with every skill something to do. Way too many chests are rigged with explosives, for instance, which means that every time you encounter one you'll have to switch to your teammate with Perception to see if it's safe. It becomes a bit of a predictable chore. Wasteland 2 does better with player-specific skills once the business of combat starts. It's turn-based, most directly in the tradition of the old Fallout games (which were spiritual successors of the original 1988 Wasteland). A handy tutorial ensures it's easy to pick up for younger RPG fans who weren't around when this type of game enjoyed its heyday. In keeping with the setting, ammo is scarce and the rustbucket armaments you're toting have an almost comical tendency to jam and suck up action points in the process of repairing them, which means it's best to have each party member specialized in a different set of weaponry. It means guns, while powerful, usually aren't as reliable as good, old-fashioned beatin' sticks, and a well-placed thwack will often excel where assault rifles fail. Gaps in your partys skill sheets would be a huge handicap, but inXile wisely allows you to fill in the blanks with additional companions you'll pick up along the 50-hour journey. Be forewarned, though, that they're prone to ditching you, turning on you, or attacking other NPCs out of turn if they're not fond of some of your decisions. That's usually not a problem, but the roster of roughly 15 available companions is so meager that each death from a party member that goes rogue almost certainly necessitates a reload (You can't save in combat, which I do appreciate from an anti-cheating standpoint, but it does make it tough). It's a decent system that makes most fights interesting and liable to change fortunes in an instant, but playing in long stretches made me fall into a predictable routine that dangerously teeters toward monotony. If you can't sweet talk or growl your way out of trouble, you'll always have to fight. The strategy involved rarely gets more complicated than ducking behind crates that are prone to explosions and simple destruction more often than not, and the lottery of pleasing long-distance gun kills versus ill-timed jams and point-blank misses never reaches the satisfaction so recently found in Divinity: Original Sin's flamboyant magic shows. Likewise, if pretty graphics are what you're after, that's the CRPG to play. Put bluntly, Wasteland 2 looks like it was designed sometime after the release of Fallout 2 in 1998 and then given a modernization treatment similar to what Overhaul Games recently did for Baldur's Gate. Even Wastelands overworld maps here seem deficient in that regard; you're limited to dragging a Desert Rangers badge across a bleak landscape punctuated only by green clouds of fallout. But slick, modern looks clearly aren't a priority for inXile, and to its credit, its strengths are such that they never feel necessary. Wasteland creator Brian Fargo and his new studio set out to make a CRPG that could stand as a true heir to the Wasteland of 26 years ago and the two Fallout games that followed, and in that regard it succeeds. If you're looking to scratch a 26-year itch, few games do it better. Pros Excellent story writingMeaningful choicesRich party design options Cons Some unclear objectivesHeavy focus on specific skills Wasteland 2 might not be the prettiest CRPG to hit digital shelves this year, but it captures the harsh hypothetical realities of the post-apocalyptic American Southwest with excellent writing, decisions with terrifying consequences, and background voice work that reinforce the human suffering that results from them. It's a game about the power of choices, and the few remaining glitches and issues with its combat do little to diminish its power.", "date": "Sept. 24, 2014"}