{"name": "Endless Legend", "name_review": "Endless Legend Review", "ref": "https://me.ign.com/en/endless-legend/90003/review/endless-legend-review", "text": "Endless Legend is lush. Simply put, its one of the best-looking turn-based strategy games Ive ever seen. The graphical style is both dense and pleasantly abstract, from the closest zoom, to the full-map view. Its science-fantasy setting has a pleasant amount of lore, both magical and futuristic. As an overall experience its fantastic, though its bookended by a cluttered tech tree and some apparent early-game imbalances. This is a Civilization-style turn-based grand strategy game, where you build cities, explore a map, meet rivals, engage in diplomacy, and achieve some form of military, technological, or diplomatic victory, although its not a direct clone and puts its own spin on those game mechanics--which can be initially confusing. Also, like its fellow fantasy grand strategy games, like Fallen Enchantress or Age Of Wonders, Endless Legend includes hero units who grow stronger, and tactical combat--the former is fairly perfunctory, but the latter is quite fascinating. Still, what sets Endless Legend apart from its peers is its overall tone and the entire experience of playing it, instead of any one specific game mechanic. Endless Legends setting grabbed my attention immediately. It draws its science-fiction elements from developer Amplitudes previous game, Endless Space, but mixes in a huge dose of fantasy as well. There are eight factions, including the elf-like Wildwalkers, who come into conflict with groups like the Vaulters, whose goal is a return to spacefaring. The combination of these two styles -the science fantasy aspect - shows up in factions like the Broken Lords, a group of noble futuristic vampire-like beings who subsist on what everyone else uses as currency, instead of using food. Endless Legend does well in adhering to Civilization V-style design of factions, where each one is distinct enough to encourage entirely different play styles in each new campaign. For example, technologically-inclined and Warhammer-ish Vaulter faction has a scientific and industrial bonus, heavily-armored troops, and the ability to pick a holy resource that grants even greater bonuses. Theyre a relatively versatile faction compared to the Roving Clans, whose generic name belies their specific gameplay rules. The Roving Clans are the merchants of Auriga, and so receive bonuses to their moneymaking and diplomacy, and the roving part of their background means that they alone can move their cities around their provinces and also have armies filled with cavalry. But this comes at a cost: the Roving Clans cannot declare war, preventing the more aggressive playstyles. Ultimately though, Its the look and feel that makes Endless Legend seem so special. It takes visual inspiration from the Game Of Thrones intro, most clearly in that when you build or expand your cities they rise from the ground, piece by piece. Zooming the strategic view out to a certain point fades the details away, turning the screen into an abstract, brown-paper map. Its an effect thats been done before, but Endless Legend makes it look especially good, maintaining a continuity of abstraction and information regardless of the level of detail. Gaps between cities are filled with both interesting terrain and various resources to exploit. Each map is divided into provinces, and each province has its own terrain styleice, high plains, dark forests, deserts, etc. This level of detail and variety makes Endless Legend stand in stark contrast to Endless Space, which suffered from being far too sparse. Those visual flourishes also make it easy to spot the tactical value of an area. Hills are represented as raised steps instead of smoother bumps, which calls attention to the importance of topography for decision-making in combat -- you can put archers on impassable cliffs to fire down on enemies. Instead of seeming in any way realistic, Endless Legend instead makes me feel like a powerful lord, making decisions on a strategic map in my council chambers, pushing little wooden troops around. In perhaps the cleverest touch, combat works in exactly this fashion, on this map, instead of breaking battle out into its own screen. Theres still a combat mode, and stacks of armies, but when forces bump into one another they begin tactical combat on the world map itself. Fantasy-themed strategy games have often been bogged down by detached, time-consuming tactical combat modes, but this reconnects the tactical combat to the campaign setting. Battles never get too time-consuming either, because all players give their orders to all units at the start of the combat phase, and theres a limit of only six phases per fight. All of this lends Endless Legend an amazing harmony between its rarely seen setting, its lush aesthetic style, its map, and its strategic and tactical decision-making processes. Just sitting and playing it is a wonderful experience overall, in a way that reminds of some of my favorite game worlds of all time, like Ultima VII, World of Warcraft, and Kingdoms of Amalur: Reckoning. To add to the overall experience, the music is both lovely and thematically appropriate, especially the faction music that plays at the start of each campaign. Big-picture strategic depth is Endless Legends potentially weakest point, unfortunately. I dont mean to suggest that its a poor strategy game - its not - but my first weeks worth of games has yet to really gel in several ways. Its density extends into the endgame decision-making, where having too many decisions, as opposed to fewer, more interesting ones hampered my sense of progress. For example, Endless Legends technology system isnt a straightforward tree, like Civilization - and it shouldnt be, because this isnt known Earth history. Instead, its divided into eras which are filled with a dozen or so technologies. Research enough from the previous era, and you can start on the next. The catch is that the previous eras technologies are still there, available to research. So what ends up happening is that the overall number of technologies available just gets bigger and bigger, which makes the later sections of Endless Legend feel muddled. Im also less than thrilled with the hero customization process, which also offers a bunch of different choices that struggle to make themselves feel important. Another problem I have with Endless Legend is that even relative to other games of this type, success seems to hinge far too much on getting a great set of resources to put your first city next to, and building cheap armies to pull off early rushes. It seems like too powerful of an option, leading to quickly aborted games, or having to hold back a little to get a good long game going.  Those issues aside, Endless Legend possesses many of the mechanics of its fellow grand strategy games, and generally does them well. For example, each hex on the map clearly shows what resources are available for a nearby city, so you have to pick your placement carefully, just like Civ. But unlike Civ, you build specific buildings to expand the citys reach, which damage both local and overall happiness. There are also benefits to both expanding the city as far as possible to get more resources, while consolidating it levels it up and grants its own improvements; the entire process is filled with good strategic balances. Pros Fantastic styleGorgeous, functional mapScience-fantasy settingGreat music Cons Endgame progression Endless Legend plays out on one of the greatest, most beautiful maps in strategy gaming history. It combines style, substance, and setting into a marvelous overall experience for both empire management and tactical combat. It struggles slightly with strategic depth, but this is a science fiction and fantasy strategy game with tremendous soul.", "date": "Sept. 24, 2014"}