{"name": "d4", "name_review": "D4: Dark Dreams Don’t Die Review", "ref": "https://me.ign.com/en/d4/89910/review/d4-dark-dreams-dont-die-review", "text": "D4 brings a bizarre murder mystery story to life, with all the pizzazz one would expect from Access Games, the studio behind cult classic Deadly Premonition. It casts us as David Young, a detective investigating the murder of his wife; driven by her final words Look for D and the ability to use certain objects to travel into the past. Can he find the killer? And can he change the past and save his wife? Its a strong set-up for this new episodic series, and I greatly enjoyed this initial chapter, which includes a prologue and two episodes. The three or four hours of gameplay here is enough to lay the groundwork for the intriguing wider story, while also introducing a host of quirky characters and establishing a mystery within the mystery. D4 is a more contained whodunit than Deadly Premonition. Where that game was set in an open-world and was very much a horror experience by way of Twin Peaks, D4 is much more like a locked box: a mystery with few settings, driven by characters and dialogue, with only a handful of quicktime action sequences. With a peculiar design style and aesthetic, D4 is offbeat, obtuse, and charming at best, and horrible to control and crammed with wilfully superfluous elements at worst. And thats kind of the point. D4s vibe is all its own, with an intriguing story that very much lays the groundwork for twists and revelations in future instalments. That story sees Young use his newfound power to jump aboard an airliner just in time to interrogate a man who deals in a dangerous drug thats implicated in his wifes death. He represents his own mystery, as Young knows the plane will be struck by lightning and hell disappear, seemingly into thin air. A host of questions are left unanswered by the end, but theres still enough closure to be satisfying. D4 boasts a slick, painterly aesthetic. So how does it play? Well, youre a detective, so you spend most of your time talking to people of interest and thoroughly exploring each location, trying to learn everything you can. You have a couple of control options, but despite being initially designed to be played with Kinect (controller support was added later) Id definitely recommend sticking with a controller. Playing this game with Kinect is like trying to drink a bottle of wine using your hands as a cup, when theres a glass right there. Kinect is just too unreliable, and there are just too many things to interact with. Who wants to spend their entire game sitting upright on the couch with a hand in the air? Its a shame D4 wasnt just designed for a controller from the start though, as its still pretty clunky even when using one. The action sequences actually ARE better with Kinect, but there aren't many. Given the gameplay is driven by quick-time action and Heavy Rain-style gestures, and there are no real puzzles to speak of, D4 really does live or die on its characters and personality. Thankfully, it delivers.Young isnt as eccentric a lead as one might expect  no split personality or coffee-grounds fortunetelling here - but he gets more interesting as you tease out details about his past life and relationship with his murdered wife. Elsewhere, we have a cast that runs the gamut from a grizzled law-enforcement officer to a flamboyant fashion designer with a romantic attachment to a mannequin. Perhaps the best characters, however, are the most enigmatic, like Roland Walker, a towering giant in a crisp white suit, medical mask, and perpetually cocked head. He speaks in slow, drawn-out sentences and can only be seen by Young. The Twin Peaks influences most certainly remain. Duncan and Sukey play several fun roles within D4. Each episode is essentially linear, but also quite dense. There are secrets to find, reading material to absorb, countless objects to interact with, and numerous sub-cases that open up more conversational options. A great deal of this is tangential at best, but I found it hard to resist the lure of trying to unlock every line of dialogue, find every medal, and observe every interactive item within the world. This last element is a particularly neat inclusion. If you hover the cursor over something before choosing to interact with it, short, often-pithy observations from Young pop up around it, providing further information and injecting humour into moment to moment play. There are other nods to his prowess as a detective, including an alternate vision mode  Batmans Detective Mode, essentially  which lets you see objects and people that can be interacted with, as well as highlighting certain clues. Its a good, quick way to ensure youre not missing anything, and can be recharged by quenching Youngs thirst. You'll spend a lot of time observing stuff. A more bizarre inclusion is stamina. Pretty much every object you interact with uses up stamina - whether thats turning on a faucet, opening a door or reading a magazine. Want to top it back up? Eat! Its classic Access Games - a system for the sake of a system! Game director Swery and his team seem to be poking fun at the conventions of gaming: the need to quantify and limit things. Most amusing of all, they ultimately have no real meaning, given youll always have plenty of credits to buy any food and drinks required. You could absolutely say the same thing about the ability to change character outfits, or the medals hidden about the place  theyre an arbitrary treasure hunt, there without context or acknowledgement, because hey, games need collectables, right? Statement or not, in the end I couldnt help but enjoy the superfluous elements  they just add to the oddball texture of D4. Pictured: oddball texture. Pros Entertaining dialogueIntriguing wider storyGreat presentation Cons Kinect controlsNo real detective work D4 is an intriguing experience, and brimming with personality. Its also the most polished game from Access to date, with a genuinely first-rate presentation. Wannabe gumshoes may not get a great deal out of it, as it largely leads you along through its introductory episode, but the characters and story are strong enough that its compelling nonetheless. D4 is even better second time around too, when most of the pieces are already in place and you can interpret every piece of information in context. Now, bring on the next part.", "date": "Sept. 23, 2014"}