{"name": "Disney Infinity: 2.0 Edition", "name_review": "Disney Infinity 2.0: Marvel Super Heroes Review", "ref": "https://me.ign.com/en/disney-infinity-2-0/89751/review/disney-infinity-20-marvel-super-heroes-review", "text": "Last years Disney Infinity brought toys to life without ever forgetting the fun of playing with toys. In that version, its not unusual to find Mr. Incredible riding the Muppet mobile around Cinderellas castle firing a toilet-paper gun. The core playsets, meanwhile, are great in a different way - they expose kids to a variety of gameplay experiences, from hack-and-slash combat to naval warfare, skateboarding, and stealth. For Disney Infinity 2.0, I expected a major advancement in gameplay on top of the addition of Marvels mightiest heroes to the party. The name certainly implies it. But while it brings some smart improvements and Toy Box mode continues to evolve and impress, elsewhere this sorta-sequel feels more like a downgrade. Nowhere is this felt more keenly than in the story mode. The starter pack contains a single play set (a self-contained, structured adventure) based on The Avengers, and physical toys of Iron Man, Thor, and Black Widow. The toys look great  Infinitys style continues to do a brilliant job of unifying all of its characters. But when I stopped playing with them and went to play with their in-game counterparts,I quickly missed the variety of having three distinct worlds, each with their own mechanics, to explore. Infinity 1.0 bundled Pirates of the Caribbean, Monsters University, and The Incredibles all into the starter pack, so 2.0s starting point is noticeably less than expected. Marvels Universe is unquestionably rich enough to compensate, yet The Avengers set disappoints  its small, bland, and repetitive. On the bright side, the one advantage of having a single set is it allows co-operative play without the need to buy any additional toys. The plot centres on Loki invading Manhattan, unleashing an army of Frost Giants hellbent on bringing about a new ice age. And while the city certainly feels cold and lifeless, it has absolutely nothing to do with the ice slowly encrusting Stark Tower. Finishing the campaign took me somewhere between four and five hours, yet it felt much longer  not in a good way. Manhattan is such an integral part of Marvels universe, yet here it feels badly served. Parts of the city are off-limits  you cant fly through Central Park, for example  and I couldnt find the Baxter Building or the Daily Bugle. It never feels like Marvels Manhattan. Its drab and lifeless; Ive only played the PlayStation 4 version so far, and the environments lack detail and the cutscenes are rough around the edges. The feeling of emptiness is compounded by the missions lack of variety. Invariably, they involve reaching a waypoint and pummelling wave after wave of Frost Giant. And thats pretty much it for the duration. Variety manifests solely in the number and size of enemies you encounter; sometimes they have shields, sometimes spears, and now and then, if youre lucky, you have to destroy weather machines or protect generators at the same time. The original Infinity sets encourage exploration by hiding new building items and collectibles, which would then rollover into creation mode, just out of reach. I also remember customising Jack Sparrows ship and rigging a variety of traps around Monster Universitys campus. Those playful elements, which a year ago I thought central to the Disney Infinity experience, have mysteriously evaporated. This is all the more frustrating since improvements have definitely been made to the characters and combat. Each character now possess a skill tree that allows players to unlock new abilities, so you can specialize them in ranged attacks, melee, healing, or speed. While the perks similar across character, each one is character appropriate: Iron Man fires missiles, Thor charge Mjolnir with lightning, and Black Widow accesses SHIELDs secret cloaking technology. It adds variety but also helps make these characters feel more distinctive. Combat is another area that has received a lot of attention. Theres way more variety and the potential for real depth is present: characters possess counters, moves designed to break down an opponents defense, and special moves. But it never has the opportunity to shine; the control scheme just isnt appropriate, as most of it is mapped to a single button, and theres an absence of worthy, intelligent adversaries to unleash it upon. Even the climactic battle with Loki himself is indistinguishable from earlier encounters. But play sets are just one part of the Disney Infinity experience. Toy Box, where everything you collect and all your toys exist side-by-side, is a huge attraction. And strangely, its where Infinity really embraces the Marvel license with an enthusiasm thats never evident in the play set. You can decorate your worlds with easter eggs and loads of Marvel paraphernalia; theres everything from the Infinity Gauntlet to the Book of Vishanti. Having hundreds of items available to build with is always going to present problems, yet a redesigned interface and the ability to favourite particular items make building much more fluid. Its also much easier to get started in Toy Box than it is in 1.0. Theres a whole range of new tools which will randomly generate everything from terrain to cities and even race tracks. Tiny helpers can be tasked with building themed areas, such as pirate towns or tree houses. However, at the more complex end of Infinitys creation suite are the Creativi-Toys  a series of logic gates that allow, in theory, more sophisticated experiences to be built. The number and variety of these has increased, yet the interactive tutorial has vanished. I found it really difficult to get to grips with these tools, and often found myself resorting to trial and error. Thankfully, the originals eagerness to embrace different genres finds a home here in the form of Toy Box games  these are physical tokens, two of which come in the starter pack. Escape from the Kyln is a top-down Gauntlet-like adventure, while Assault on Asgard is an introduction to Tower Defense. Its great this aspect of Disney Infinity lives on somewhere, but I would have loved to have seen these games directly inform the play set. I dont want kids growing up thinking that all single-player campaigns involve escort missions, mindless button-mashing, and Frost Giants. Toy Box is still the place where Disney Infinity really shines. Its where youll find Thor and Mike Wazowski can racing horses across the desert and Mickey Mouse and Iron Man paintballing in Halloween Town. Pros Improved combatToy Box more accessible Cons No play set varietyRepetitive missionsLifeless city Uneven and undercooked, Disney Infinity 2.0 isnt the major upgrade I expected. It lacks the playful fun and diversity that made Infinity 1.0 so great last year. A few things are better  characters, old and new, feel more distinct and combat has been improved, and The Toy Box has made creation more inviting and less overwhelming. Disney Infinity 2.0 feels very much like a franchise thats still finding its way, but I hope it doesnt forget that what made it fun wasnt the cool characters it had at its disposal but the way in which it played with them.", "date": "Sept. 21, 2014"}