{"name": "minecraft", "name_review": "Minecraft PS4 and Xbox One Review", "ref": "https://me.ign.com/en/minecraft/88608/review/minecraft-ps4-and-xbox-one-review", "text": "Minecraft has become a phenomenon over the past five years, and now the PlayStation 4 and Xbox One are some of the best places to play it. Though it may look primitive at a glance, your options in this virtual sandbox world are limited only by your imagination. Cobbling together a first home out of dirt and stone feels great; building a castle with a moat, a dining hall, and a working underground rail system feels even greater. That sense of creative progression, coupled with the inherent danger of exploring underground caverns full of monsters, makes Minecraft exciting, rewarding, tense, and one of gamings most expressive creative outlets. Minecrafts randomly generated worlds are composed of these big blocky cubes of dirt, stone, sand, and dozens of other materials. The blocks are colorful, distinct, and memorable thanks to simple but charming textures. What makes them great is how they enable creativity. Piece by piece youll rearrange and refine the pristine, primordial world into whatever you want. It could be a mountainside home, a huge tree house, a skyscraper, or any other creation you can envision. This is a power we rarely see in games, and the freedom it offers is, at first, daunting. In Survival mode, each block must be chipped at and collected by hand from an open world. What initially feels like a tedious task becomes the basis for Minecrafts rewarding core gameplay. I had to gather, transport, and place each piece of my home myself, so it was impossible not to feel a fierce sense of pride and ownership over it and all my other creations, big and small. Land Grab When the sun goes down, Minecrafts bad guys come for you. They are scary and dangerous for maybe an hour. Once you obtain the simple items needed to ward them off, they become almost completely non-threatening. This feels immediately disappointing. Why have enemies at all if they become laughable in no time? But later, as my ambitions for building outgrew my resources on hand, my quest for new materials drove me deeper underground. Down there I realized those same enemies that are easy to defeat on the surface felt far more challenging to fight in the confines of a rocky corridor where they could ambush me. The amount of danger I was in was tied to how far from my base I roamed. Losing everything I carried to a Creeper who got the drop on me was a heartbreaking lesson, but the excitement of exploring new places and the risk it entails provided a constant tension. All the while, gathering new blocks and items sent my mind reeling with more ideas for landscaping and home decoration. Those goals dont change when you bring friends in, but whether youre cooperating or trying to outdo each other with larger, grander creations, having other people there makes Minecraft more rewarding. The PS4 and Xbox One versions of Minecraft allow two- to four-player split-screen play, and theres an online mode that accommodates up to eight. Joining other peoples worlds is easy, too, thanks to a simple, easy-to-use lobby. Unlike in the sometimes-cramped PS3 and 360 versions, the improved power of the new-generation consoles can handle vast worlds. They're 36 times larger, in fact, and there's plenty of room to spread out and build, even in a full eight-player game. Learn a Craft If you thought Minecraft was just about stacking blocks, the tutorial will wipe away that perception quickly. The quick and comprehensive introduction fully explains the basics of gathering, building, and crafting, and different stations around the tutorial world teach you how to enchant items, brew potions, start a garden, set up working electrical circuits, ride a boat, build golems, and more. Theres a huge number of activities going on here. The crafting interface conveniently includes recipes for every item, and it highlights the items you dont yet have in your inventory. With dozens and dozens of combinations available, the built-in recipes keeps you playing rather than hunting through wiki guides and memorizing recipes. Minecrafts many items and systems are too numerous to list in entirety, but a few stand out. As you kill things and mine certain materials, youll earn experience orbs which can be spent on enchantments. It makes mining and fighting things faster, easier, and more fun. The same can be said for potions, which heal you, grant resistance to fire, and more. Light RPG elements like these add depth to Minecraft without bloating the interface with skill trees or stat screens. Don't Suffer For Your Art Under all that adventuring is Minecrafts brilliant builder toy. Creative Mode basically enables all the cheat codes and lets you play with it freely, turning off monster damage, letting you fly, and giving you endless supplies of all the materials to build to your hearts content. Without having to work and fight for them, my creations in this mode felt a little hollow. Still, Creative Mode is as much fun as a bottomless tub of LEGOs, and between the fun of flexing my own imagination and checking out the amazing projects other people have constructed, its full of possibilities. Pros Charming blocky lookCrafting tutorialPromotes creativityGreat multiplayerHuge world size                        Minecraft                    .", "date": "Sept. 6, 2014,"}