{"name": "Azure Striker: Gunvolt", "name_review": "Azure Striker Gunvolt Review", "ref": "https://me.ign.com/en/azure-striker-gunvolt/99715/review/azure-striker-gunvolt-review", "text": "Several years ago, Japanese developer Inti Creates captured the essence of the late-'80s with its spot-on entries in the classic Mega Man series, Mega Man 9 and 10. Its latest, Azure Striker Gunvolt, is an original game that represents a natural evolution of that appreciation of retro gaming, done in the style of Mega Man X. While it's in no way, shape, or form as good as X, it's certainly fun in its own right, and like Mega Man 9 and 10 before it, it provides a nostalgic trip for anyone who still finds value in games from an era gone by. The most unique aspect of Azure Striker Gunvolt is its combat. Gunvolt's titular protagonist is armed with a pistol, but you won't be using it in typical fashion. Regardless of which gun he's equipped with -- there are several -- they simply won't do much damage. What these pistols will do is ~tag~ enemies when fired. Once an enemy is tagged, Gunvolt is able to unleash his true power, shocking robotic thugs with electrical pulses called Flashfields that automatically gravitate towards those who are marked. This novel style of play is decidedly more complex than Mega Man X's. Thankfully, this different approach to killing things doesn't harm the speed and fluidity of Azure Striker Gunvolt, which constantly goads you to keep on moving. It's not nearly as fast as Sonic, nor is it as deliberate as Castlevania. Gunvolt nails a comfortable space right in the middle. Unfortunately, while marking and destroying robots is incredibly satisfying, the disappointingly small roster of enemies diminished that satisfaction as I advanced. The lack of diversity between the robotic fodder Gunvolt is expected to obliterate is actually staggering, with only small groupings of land-based and aerial foes to deal with. Ive seen more enemy diversity in early NES games. Not surprisingly, level structure takes a page or two out of the book of design from -- you guessed it -- Mega Man X. You can visit most stages in any order you'd like, fighting a member of a cast of well-designed bosses at the end of each. Each Sumeragi agent employs his or her own unique set of skills and battle styles, skills and styles that, along with their respective stages, have an industrial design reminiscent of many early-to-mid-'90s platformers, though some designs do blur together in a sort of sameness. I especially dug fighting the Sumeragi agent Elise, who splits into two like Gemini Man in Mega Man 3, and Daytona, who seals his lair with fire, lessening the space you have to maneuver. Unfortunately, Gunvolt's story doesnt do it any favors. It's confusing, frankly, and full of tropes, not all that unlike the 16-bit era games that inspired it. I like Gunvolt and his friends from a design perspective, with their 90s sci-fi aesthetic and interesting personalities, but I would have liked to hear less from them, especially as dialogue -- while skippable -- gets in the way of gameplay more often than not. Still, I have to give it up for Azure Striker Gunvolt's rock-solid translation. Dialogue doesn't read stilted or awkwardly, even if it does obstruct progress, so if you want to jump into the lore, you can do so with a higher level of polish than many games coming out of Japan. Access to special skills -- like an enormous lightning burst or a gigantic energy sword -- is also given, but things arent quite Mega Man-esque, as a leveling system dictates which skills you learn (while also giving Gunvolt more and more hit points). But unlike classic platformers like Mega Man, Metroid, and Castlevania, the unlockable skills dont interact with the levels in any interesting or necessary ways. In fact, I used one skill pretty much continuously throughout the game -- a curative move that slightly healed me when activated with 3DS touch screen -- and never felt the need to switch. It's cool that there are skills to exploit, but levels need to be designed to prompt me to try new things by making some skills advantageous or disadventagous in certain circumstances, or theyre pointless. With only three skill points to use at a time, and with those points regenerating slowly, some of the more powerful skills wipe out your meter completely; thats a real head-scratcher of a design decision that made me gun shy about trying them at all. Indeed, for as fun as Azure Striker Gunvolt is to play, it definitely suffers from its fair share of questionable design choices. For starters, while I absolutely adore the customization options available -- you can equip items to both eyes and you can wear both rings and pendants with special powers -- I was dismayed by the fact that there wasn't much availability in terms of actually owning these items. Necessary components are so exceedingly rare that during the five or so hours it took me to beat the campaign, I never once had anything to equip on either eye. I only ever had the components to build two items -- both rings -- the entire game. Worse yet, those rings both essentially did the same thing! To have anything to build and equip, I would have to play stages over and over again, mastering each and raising my high score, when all I really wanted to do was move on with the campaign. How disappointing. Still, for as incredibly short-sighted as the customization and equipping options are in Azure Striker Gunvolt, there's still plenty to keep you engaged for multiple playthroughs. I loved the old-school inspired scoring system, which revolves around injuring enemies consecutively without being hit (this is called Kudos in-game). There's also a system that gauges how quickly you work through a given stage, with better times and higher scores in turn awarding rarer items for synthesis. And if you want to get deep into the nitty-gritty, an optional Challenges list, unique for each stage, provides for more difficult goals to accomplish in each one, again rewarding components for your success. There's real depth here, should you decide to start digging. Then again, to see your way through the end, you don't have to do any of ancillary activities at all. Pros Fun, unique combatGreat boss designsNon-linear Cons Muddled customizationPoor enemy diversity I had a lot of fun playing Azure Striker Gunvolt, even if some questionable design decisions hamstrung it in some unfortunate ways. Inspired by Mega Man X -- especially in terms of its level design, visual aesthetic, and accompanying soundtrack -- Inti Creates still managed to craft something uniquely its own, especially when it comes to its novel combat. With just the right pace, an appropriate level of challenge, and some customization options that make it much more than just another old-school side-scroller, Azure Striker Gunvolt comes heavily recommended to those that want to relive a sliver of the platformer golden era.", "date": "Aug. 28, 2014,"}