{"name": "airmech", "name_review": "AirMech Arena Review", "ref": "https://me.ign.com/en/airmech/87627/review/airmech-arena-review", "text": "AirMech Arena is like jumping into a Saturday morning Transformers cartoon and leading an army into battle. Taking the unit management and base building from a real-time strategy game and the constant base push of a MOBA, AirMech stands as an interesting hybrid with some fun modes and a fair free-to-play structure. All that makes it especially disappointing that the multiplayer servers dont work. Like virtually all MOBAs and many RTS games, AirMech Arena is primarily built as a multiplayer game -- which is unfortunate, because its servers dont work properly. In every mode, when starting a match with other humans -- even as a spectator -- I almost always experienced server connection issues (and had others report the same). Single-player modes naturally dont see this issue, but theyre not as fun or as challenging because bots aren't nearly as creative as human opponents. This alone makes it difficult to recommend, even though it does some cool stuff. AirMech Arena shares simple yet fun mechanics across its modes: swiftly transform between a cool, cartoony aircraft and a mech, construct bases, and build and transport units around the map to attack the enemy base. Learning these fundamentals is quick and easy, especially because the controls make ordering any one of over 60 types of tanks, mechanized foot soldiers, and other specialized units simple. Directing the units with the D-pad to stand guard, advance on an enemy base, or patrol an area can be a little tedious, as it requires you to assign the units task before its deployed or fly over to it and pick it up off the ground to change its assignment. Strangely, the top and bottom portions of the HUD were cut off. (I tried two different TVs, and no menu option to fix it was available.) It was still playable, but it wouldve been nice to see my level progress bar and a portion of my fortress health bar. Theres plenty of satisfying strategy to dig into. Deciding when to focus efforts on building units as an aircraft and when to get involved on the front lines as a mech is exciting. When you're losing control of the map, sometimes it's best to build a ton of turrets around your base, transform to mech mode, and mow down enemy waves. Going on the offensive, you can let your automated defenses hold the line while you build and transport tons of heavy-hitting tanks to the doorstep of an enemy base. A here-is-how-to-walk tutorial is available in the menu, but by default youre immediately dropped into the much more interesting Challenge mode. Over 15 single-player levels, it effectively schooled me in building units, finding the best tactic for capturing bases, and taking down opponents. After that, I was ready to go into real combat. The other two modes each have their own feel, which kept me interested in purchasing new units to adapt to the modes. Skirmish requires a balanced loadout of units to push across the map to the enemy base, and can be played with up to three players on each team. Survival has up to four players and borrows from tower defense games in its winding maze of maps. It requires units that can handle large waves of enemies, such as the the larger tanks and turrets, instead of the foot soldiers that are helpful in capturing bases which arent as helpful in protecting your base. In Skirmish its easy to tell when your tactics outmatch an opponents, and that feels great. By focusing my efforts on quickly capturing bases with smaller units instead of slowly building up an army of tanks, I gain map control early on in the game. But when theyre one step ahead of you, its still satisfying to figure out new ways to use your loadout of units and turn the match in your favor. The dynamic changes when teammates are introduced in the co-op mode. Discussing objectives with teammates is important to know which units to build and where to take them. Unlike a MOBA character, pilots dont have direct support or carry roles, or special abilities. Instead each pilot is differentiated by a small bonus, such as faster unit build times or AirMech speed, so teamwork is important to build an effective strategy, which can be a little annoying if your teammates dont cooperate. The variety of maps and number of teammates you choose to play with changes the dynamic of each match even more. AirMech Arena emphasizes the importance of adapting your strategy to each game you play, and that keeps the gameplay interesting. All of the modes, online or offline, earn XP for your account and Kudos, one of the in-game currencies. As a free-to-play game, the item store is a focal part of AirMech Arena, and the developer makes that obvious. Instead of a pushy campaign for your money with popups or unreasonable prices on microtransactions, Carbon Games campaign for your money is in the controllers Back button. By pressing it in one of the menus, you are instantly transported to a storefront that has purchasable units, pilots, AirMechs, skins, and other cosmetic items. While most AirMechs and units can be purchased with the earnable Kudos, keys for random item drop boxes and premium cosmetic items, such as the jetpack cat that follows your AirMech around the map, require at least some form of payment. I was satisfied with what I could purchase with Kudos, and didnt feel I was in a pay-to-win situation. Pros Tons of contentFun gameplayGood F2P model Cons Connectivity issuesInterface cut off Terrible servers make it difficult to want to go back to play more AirMech Arena. Its ideas are interesting, playing against bots can be fun for a time, and the in-game purchases are fair and dont feel oppressive. But when youre ready to fight against waves of enemies with friends in Survival or boost your levels in ranked matches, rampant server issues turn fun experiences into sources of frustration.", "date": "Aug. 25, 2014,"}