{"name": "counterspy", "name_review": "CounterSpy Review", "ref": "https://me.ign.com/en/counterspy/87277/review/counterspy-review", "text": "It seems strange -- even counter-intuitive -- but as one of my history professors used to say, learning history is five percent memorizing dates, times, and other facts, and 95 percent interpreting what you actually think happened. It's hardly a science. That's why CounterSpy, a PlayStation 4, PlayStation 3, and PlayStation Vita side-scrolling espionage game from developer Dynamighty hit home with me, at least when it comes to its bold subject matter. It makes no biased judgments, and it chooses no winners and losers. The real threat of nuclear war was perpetually scary, yet CounterSpy makes light of the era in unique ways by focusing on the Cold War's overall absurdity. CounterSpy may take place during the heart of the Cold War, but unlike most historical fiction written by the victors, it hates both sides equally. It refuses to even call the opposing nations by their actual names. Instead, the Americans are the Imperialists and the Soviets are the Socialists. This is a not-so-subtle ode to the way the two sides thought about one another, and it's an ingenious way to reduce decades-long smoldering into tight caricatures. Slinking through the desert. This approach is taken to its zenith by forcing us into a third, unforeseen party known as C.O.U.N.T.E.R. Cleverly, this shadowy organization allies itself with neither side. Instead, its goal is what (in hindsight) any reasonable person shouldve been doing during that time: sabotaging the Imperialists' and Socialists' nuclear programs before they inevitably destroy each other (and the entire planet). CounterSpy does a great job of nailing the look and sound of its setting, at least in terms of how those of us who didnt live through it think it all looked and sounded. Heavily inspired by the likes of James Bond and countless other Cold War-esque novels, comics, movies, and TV shows, its art and sound direction are its strongest points, especially because of how much they contribute to giving CounterSpy a real feeling of place and time. Less powerful -- though still fun -- is its gameplay. In this regard, this side-scroller seems to have been most influenced by the Metroidvania school of design, though its take is heavily reductive. Instead of giving us sprawling complexes to explore for hours, CounterSpy opts to provide bite-sized mini-maps that can be completed in 10 or 15 minutes each. (The entire experience shouldn't take more than three or four hours to complete.) Each stage is procedurally generated -- a nice touch considering you'll be playing on these otherwise-tiny maps over and over again -- and each level is littered with collectibles to find, including all-important Launch Plans you need in order to shut down both sides nukes. This approach is brilliantly heightened by CounterSpys procedural nature, and how both sides' complexes change on the fly to give you different experiences. For instance, one foray through an Imperialist base might net you three Launch Plans (if you can find them, that is), as well as some weapons blueprints and some cash. But if you opt to go after the Socialists instead, you may get a ton of money, a weapons blueprint, some skill formulas... and only a single Launch Plan. Shhhh! Balancing these two conflicting goals -- making your character stronger or forcing your way to the endgame -- isnt necessarily essential in CounterSpy, because you can actually have it both ways, or simply go in one direction or the other. This choice isn't at the core of what makes CounterSpy tick, but it's there, and it's a nice touch. Unfortunately, the more you play through these procedurally generated maps, the more CounterSpy's sometimes glaring problems come to the forefront and test your patience. CounterSpy's special gameplay hook is its ever-changing perspectives. It's a side-scroller until you pop into cover, at which point your perspective will shift to an over-the-shoulder perspective, showing you terrain that you couldnt see from the side. This is a really lovely idea that, for the most part, works well, but CounterSpy's controls can be awfully finicky. Aiming can be a bit of a chore, especially since you can't reveal yourself to enemy soldiers for very long or you'll be seen. I found myself, at times, in obnoxious control loops as I tried to come into and out of cover or attempted to engage in some heated firefights, which are never as fun as simply sneaking around. In short, gunplay could certainly be better. It's not broken -- or even bad -- but it's not nearly as tight and responsive as I would have liked, regardless of which weapon is being used. (If you're curious, the silenced Diplomatic Pistol was typically my go-to, as it was nice and quiet, allowing me to pop some enemy heads without anyone hearing blasts.) Speaking of the Diplomatic Pistol, I was a fan of not only CounterSpy's set of weapons and skills, but of working my way through various environments to find them. Concocting full blueprints and formulas from disparate parts made me feel like I was accomplishing something special in a sort of metagame, and it gave me a real sensation of power when I could equip better weapons and more useful skills. Destruction. Unfortunately, having to go back to maps over and over again, especially when things ramped up in difficulty near the end, exposed CounterSpy's frustratingly inconsistent AI. I was puzzled as to why sometimes enemies spotted me and other times they didn't, especially when I was basically doing the same moves over and over again. There was no predictability to the experience, which caused its fair share of annoyances. This is an issue for a stealth game. What's most frustrating about these AI problems is that it conflicts with an otherwise brilliant mechanic in CounterSpy, which revolves around its DEFCON meter. This meter, which ranges from one to five, is affixed to the individual sides, and goes up or down depending on how stealthily and successfully you've worked your way through previous stages. I absolutely adored this idea, because it gave weight and consequence to how you did previously, and it could make or break how you'd be doing in the present. But with so much of it contingent on occasionally finicky controls and inconsistent AI, keeping your DEFCON counter in check required more patience than skill. And that bummed me out. Pros Fantastic conceptGorgeous artGreat soundtrack Cons Occasional control issuesInconsistent AI CounterSpy is a good game with its heart in the right place. Its Cold War premise is brilliant, its art is beautiful, and its music is lovely. When it comes to gameplay, the stealth action sputters a bit in its inconsistent AI and inaccurate aiming, but it still delivers a fun experience.<br/><br/> Cross-buy and cross-save between PS4, PS3, and Vita is a great bonus, but it's worth noting that the Vita versions load times are noticeably long, and the framerate on the handheld can be less than desirable.<br/> <figure><img alt=~~ class=~image SCREENSHOT~ data-model=~image~ data-pk=~109869~ src=~http://im.ziffdavisinternational.com/ign_me/screenshot/default/counter_34qy.jpg~ /> <figcaption>&nbsp;</figcaption> </figure>", "date": "Aug. 19, 2014,"}