{"name": "watchdogs", "name_review": "Watch Dogs Review", "ref": "https://me.ign.com/en/watchdogs/25255/review/watch-dogs-review", "text": "In its opening scene, Watch Dogs refers to hackers as modern-day magicians. Thats a good analogy for the bag of powerful but mostly scripted tricks we get to use as we run amok in this huge and impressively detailed map of Chicago. With the push of a button, you can trigger environmental traps that smash pursuing cars, empty a citizens bank account, or even remotely activate a grenade in an enemys pocket. Hackings not as dynamic as it appears at first, but the illusion gives us a bit more to do than there is most third-person action games, and it puts on a great show. Our hero, Aiden Pearce, is an empty trenchcoat as far as personality goes. Its remarked at one point that hes suppressing his personality, so it must be intentional, but it doesnt make him a strong character. Fortunately the supporting cast is much more interesting. An enthusiastic and cavalier fixer, a gang leader who I affectionately refer to as Avon Barksdale: Superhacker, and a soft-spoken mob boss steal the show and make it a likeable and well-acted group. Character animations are elegantly done, too. Watch Dogs completely open map is another big strength: its huge, diverse, and intricately detailed. The rural area of Pawnee balances out Chicagos urban sprawl, and it all looks great, especially at sunset or during a rainstorm. Everything runs at a smooth 30 frames per second, however, after playing for a few hours I did start to experience frequent slowdowns when new mission objectives were loading up. Fortunately they never happened when anything interesting was going on, but theyre definitely noticeable and get progressively worse as the story goes on. This techno-thriller fiction is all about the power of information in a super-connected city, and one of its cleverest and most distinctive tweaks to the open world genre is how much information it gives you. Scanning a pedestrian or thug pops up a brief, randomly generated personal history  some fact about their hobbies or lifestyle, plus their age, occupation, and income. Its a small thing, but its surprisingly effective at humanizing them. I actually felt a pang of guilt when I accidentally ran someone down and then saw that they were on the waiting list for a liver transplant, and as a result this is one of the few open-world action games where I rarely went on a violent rampage. And that had very little to do with the meaningless reputation meter, which appears to have no consequences whatsoever. Over more than 20 hours, the straightforward revenge story becomes more and more complex until its bursting with intrigue... only to take a strange turn for the mundane when the motivations behind it all are revealed. For a game that deals with themes like surveillance society and media manipulation, Watch Dogs villains just arent thinking very big. It can last a lot longer than 20 hours though, because Watch Dogs is extremely good at distracting attention away from the main story with a steady stream of side quests and minigames. Im a big fan of the gang hideout missions, which really let you test your stealth skills as you take down well-guarded targets (though its kinda strange that they ask you to keep the gang leader alive but are cool with murdering everyone else). Most of the other activities can get repetitive, like the pre-crime interventions that always result in the same foot chase, but there are so many types, from criminal convoy ambushes to chess and poker to drinking, that they dont get old quickly if you mix up what you play. Oh, and the simple but delightful Spider Tank rampage shouldnt be missed. There was definitely some tender love and care put into the way that monstrosity moves. I admire Ubisofts restraint in including only one hacking puzzle minigame in a game about an uberhacker hero, and its both clever and used infrequently enough that it doesnt become annoying. Theres also the ability to take over any surveillance camera you can see, even some worn by guards, and its put to good use in puzzles where you leap from camera to camera as you attempt to get line of sight on a terminal you want to hack. Unless you opt out, youre also regularly prompted to jump into multiplayer activities, like a simple race through the streets or a much more interesting cat-and-mouse game of tailing and hacking another random player. Its a setup with a lot of room for creativity and hilarious experimentation as you try to hide or blend in with the civilians. Theres also the highly entertaining capture-the-flag style Decryption game, where one player desperately tries to evade the rest, and a challenging race where you have to evade traps and cops triggered by a player using the free iPad app. Watch Dogs missions are much more stealth-focused than most open-world action games, which gives them some good variety. A smooth cover system and the obligatory time-slowing power (it seems like everybody can slow down time these days) make silenced headshots easy to score, and the wet splattering sound it produces is a great, gross reward. I do wish there were fewer missions that auto-fail you if youre discovered, and that there were better rewards for using gadgets like the powerful blackout tool (knocking out the power in the area is kind of a stealth nuke) to ghost through an area without being spotted or knocking anyone out. The best missions give you the option to stealth or fight through, and that makes Aiden feel smarter than a typical guns-blazing maniac. After the bullets do start to fly, the cover-based gunplay feels good, even if the arsenal is pretty conventional. The standout is the pump-action grenade launcher, which makes short work of both thugs in armor and vehicles (its essential for taking out fleeing hackers in multiplayer). What often makes the firefights in Watch Dogs memorable is how you can fool enemies by moving around behind cover, causing them to fire at your last known position instead of where you are now. That allows you to get in some good flanking moves, and makes the enemies feel more like foolish humans than all-seeing robots. When you get in a car and drive, Watch Dogs is some good arcadey fun. Cartoonish crash physics and roads littered with tons of breakable objects make smashing through shortcuts spectacular and hilarious. However, car chases gradually become more and more disappointing and tedious because of their lack of combat options. You cant fire out the window as you drive, so all you can do is drive around hacking things to trigger hazards. Half the time you dont even see the car or trap involved in the wreck. And enemy cars are so rubber-bandy that its impossible to simply outrun them even in the speediest of cars - you have to hack things to end the chase. Pros Great open worldHacking powersMission variety Cons Weak car chasesAuto-fail stealth missions One-button hacking might be overly simplistic, but it does give you abilities that make playing through Aidens story feel powerful and fun. Doing side missions and multiplayer as you make your way through the dark and lengthy story makes it feel like a huge adventure, and stealth options let you play smart if you prefer. Car chases aside, Watch Dogs is fundamentally very well made, and has more than enough unique ideas to make it a great and memorable open-world action game.", "date": "May 27, 2014,"}