{"name": "transistor", "name_review": "Transistor Review", "ref": "https://me.ign.com/en/transistor/81368/review/transistor-review", "text": "Transistor is a wildly smart action-RPG that places all of its trust into your intelligence. Nothing from its cyberpunk story rife with mysteries, to its deep combat that encourages experimentation, is ever spelled out for you, which I personally loved. For its second game, developer Supergiant takes everything that felt right about Bastions world and storytelling, trims much of the fat, and adds depth to combat that turns each encounter in its six hours into a life-or-death puzzle. Transistor maintains the same hand-drawn style as Bastion -- its heavily influenced by the expressive character design of classic anime. Its gorgeous world feels like Blade Runner infused with Cowboy Bebop, in the best possible way. I love how none of the characters in Transistor fall into typical video game or science fiction conventions. Your hero Red is a lounge singer whose voice has been stolen as a part of a nefarious plot; Her partner in crime is a talking sword that acts as your chorus. Even the strange cabal of enemies have their own motivations that keep things from becoming black and white. By the end of a few boss battles, I felt genuine remorse when I had to lay the killing blow. Transistor starts in the middle of the action, and its up to you to piece together whats happened before, and whats to come. It respects your ability to fill in the blanks, and relies on subtlety in a way that few games ever do. Music is also intrinsic in Transistors DNA. From Reds former profession, to the various concert halls you visit along your adventure, to the incredible music that uses both a score as well as songs that exist inside the game world itself, Transistor is infused with the spirit of jazz. Even small actions, like being able to stop and have Red hum along to whatever song is currently playing is a creative, and evocative way of tying music to the core gameplay. For as gorgeous as Transistor is, the combat shines just as brightly. The battle mechanics are some of the most rewarding Ive played in years. This is thanks in part to your ability to freeze time and plan out a series of moves. Once youve locked in your choices, restarting time and watching the success or folly of your actions never gets old. Watching Red freeze the world, teleport behind an enemy, slice them up with a series of melee attacks, then quickly teleport away before delivering a crushing energy spear never gets old. Transistor marries the quick reactions necessary in an action game with the careful planning of a strategy game in a really amazing way. Leveling up generally allows you to choose between a pair of skills, like deadly spears or more defensive abilities like temporary stealth. But Transistors real depth comes from the fact that each ability can be used actively, passively, or to augment and strengthen another skill. For example, a grenade-like skill can be used as an active weapon, or makes enemies explode when you poke them with your lance, or to provide status buffs to your character. Transistor encourages experimentation and combat mastery by giving you tidbits of backstory as you use different combinations of abilities, and by allowing you to fully respec your character at any checkpoint. Alongside this, youre also able to enter magical doors that transport you to your own personal beachside cabana that allows you to escape the ever-growing insanity of the outside world. It gives you a moment to take a breather, play through a series of challenge rooms, listen to the incredible soundtrack, and play with a strong contender for cutest digital dog of 2014. My only gripe with combat comes from the lack of camera control. Buildings in the foreground have a tendency to block small slices of battle arenas, and the last thing you want in the middle of a tense fight is to lose sight of your character. Though this only happened a few times throughout the campaign, it was enough to take me out of the experience on each occasion. The PlayStation 4 and PC versions are nearly identical save for one feature: On PS4, you can choose to have the swords voice come out of the speaker on the controller. While it seems gimmicky on paper, I found myself playing through the entire game this way, and really appreciating the immersion it added to my experience. Pros Beautiful worldIncredible musicDeep combatOriginal story Cons Visuals obscure combat Transistors the kind of game that made me immediately jump back in to take on New Game Plus. I wanted to continue exploring the excellent combat in new, more challenging scenarios. I wanted to double back on the areas that Id missed the first time through, and try to fill in the gaps of the fantastic story. But most of all, I wasnt ready to leave Red or her world behind", "date": "May 20, 2014,"}