{"name": "Have a Nice Death", "name_review": "Have a Nice Death Review", "ref": "https://me.ign.com/en/have-a-nice-death/206475/review/have-a-nice-death-review", "text": "Playing as a scion of the hereafter fighting his way through the realms beneath in a roguelike graveyard shift might sound familiar. I also played Hades. But Have a Nice Death let me take control of your boy, Death himself, who runs a very different kind of quirky, new underworld order. Full of dark and dry workplace humor, this clerical reimagining of life after death as a soulless corporation forms the backdrop for some wicked hard, frantic, side-scrolling combat. And at its best, it's a killer time, even if the progression systems don't do the best job of providing ongoing motivation. Slaying my way through randomized levels and laying the smackdown on the various, rank-and-file deadbeats was the highlight of this Stygian adventure, with fast and responsive combat featuring a lot of different techniques to master. A variety of swappable scythes with multiple special attacks each are just the beginning. You can also unalive the undead with magic spells and secondary weapons found randomly throughout the levels  from a big, beefy hammer to a sorcery that summons a flock of hungry crows. In addition to responsive jumps, dashes, and powerful ~frenzy~ finishers, no dust-up is lacking for variety. Each chapter, based on a different method of death, from war to food poisoning, is distinct and full of new enemy types. One moment I was swatting away slimy seagulls who died in an oil spill, and the next I was doing aerial combat with bubble-headed nerds who suffocated on chewing gum. The designs, both visually and in terms of how they attack, are consistently creative and charming. And the excellent soundtrack compliments all of the mayhem very well. These are some incredibly unforgiving fights. Along the descent into darkness, you'll be collecting red, green, and blue Curse cards, which sounds bad, but these are actually the main passive bonuses you can stack during a run, like adding bleed to your weapons or getting health back when you defeat a boss. And its in the offices of those brutal Thanagers and Sorrows that the difficulty really kicks in. These are some incredibly unforgiving fights, and given your very limited defensive options, they can be very frustrating. Memorizing patterns is essential, as the margin for error is too small to really get by winging it, which can be aggravating when your run ends to a miniboss you haven't seen in a while due to the randomized floors. OFF WITH THEIR HEADS For capital D-Death, lowercase-d death isn't that big of a deal, of course, as you'll simply get sent back down to your office to live again and hopefully take revenge on your disobedient underlings. And you get to hear a catchy little jingle every time, too. The main issue I ran into is that the long-term progression systems don't really give you a feeling of momentum that would have been quite welcome considering the steep difficulty curve. Almost everything you earn goes away as soon as you're slain. Let me put it like this: You can kind of break up the types of persistent upgrades you get in a roguelike into three categories. First, you have straight-up permanent increases to your stats. Second would be things like rerolls that don't necessarily make you stronger directly, but increase your chances of having a good run with good items. Finally, you have unlocks that merely add more abilities or passives into the pool of available drops. Have A Nice Death focuses heavily on that last category, and there is very little meaningful power to earn in the other two. One of the level up perks gives you a whole one percent increased chance to find rare weapons. That just feels like a joke! It took me over 100 runs to even see the final boss, and I was feeling worn down well before that. I don't mind really punishing games, usually. I like to be challenged, and I'll always be a prisoner to my ambition. But at least in something like Hades or even Elden Ring, I feel like my many defeats are all building to something and I'll eventually overcome the challenges before me by getting stronger little by little, alongside my skills improving. It takes the sting out of those lose-lose days when it seems like the first boss is just kicking my ass every time I see him. And without much of that persistent progression to look forward to, I found my enthusiasm to keep going in Have A Nice Death was often on a downward trajectory. It took me over 100 runs to even see the final boss, and I was feeling worn down well before that. CURSED NIGHT You can eventually unlock elevators that let you skip a lot of normal stages and go directly to some of the big bosses, but this ends up hurting more than it helps as you miss out on all the currency and upgrades you would have earned on those floors. So it's not really a way of building momentum, but rather another way to make everything more challenging. That said, every elevator does give you a choice of which type of level to visit next, with the exception of the ones that lead to area bosses, which can have a major impact on how well kitted-out you'll be for the tougher challenges. Knowing which floors are more valuable in which situations, thus, becomes a huge help. And I definitely appreciated that extra bit of control over each run's progression. If you're really feeling stuck, you can activate an optional ~Self-Fulfillment Mode~ that gives you some extra healing items and slightly nerfs normal enemies, but it doesn't change the boss fights at all and I found it to not be that much help. It's definitely not an ~Easy Mode.~ Even when I was feeling stuck, at least I was always being rewarded with new lore. The afterlife's various departments are in turmoil, and as you seek out lowly ghosts and dissident department heads to make them afraid of you again, you'll unlock entertaining snippets about how this postmortem corporate bureaucracy works. Similar to Hades, you'll also get new dialogue with the various friendly characters like your pumpkin-headed receptionist. Some of them even have humorous long-term storylines to follow. These made me chuckle more than once, and at the heart of it all is a powerful conspiracy to uncover. Some of the jokes can feel a bit tired, like they've been used in every workplace comedy ever. They even directly reference the stapler in jello gag from The Office. But the off-beat setting and quirky tone keep things interesting. Have A Nice Death is a punishing but satisfying roguelike with some diabolically tough boss fights. The darkly dorky setting and office humor lend it more than enough charm to make me want to discover more of its world. But it's made significantly more frustrating than it probably needs to be by very stingy long-term progression and limited defensive abilities in comparison to its huge array of fun-to-use offensive weapons. When I wasn't feeling the discouraging void inside dragging me down, I was reveling in the hundreds of ways I could make these visually and mechanically memorable undead wish they never lived at all.", "date": "March 22, 2023"}