{"name": "Sir, You are Being Hunted", "name_review": "Sir, You Are Being Hunted Review", "ref": "https://me.ign.com/en/sir-you-are-being-hunted-134139/24238/review/sir-you-are-being-hunted-review", "text": "Most stealth games are about observing guards movement patterns and finding the predictable hole left open by a designer for you to exploit. What makes Sir, You Are Being Hunted different and interesting is that enemy patrols are randomized, both from the start and after every death. Success becomes about learning to exploit behaviors dynamically. That leads to both a more believable and unpredictable stealth experience, but also a feeling of repetition that stems from a lack of hand-crafted scenarios. A vague setup about an experiment gone wrong, followed by a reminder that we should really eat something, is most of the story. What really matters is that youre alone and outgunned on a randomized island chain where darkly comic British robots have murdered everyone, and its highly advisable that you get out of there by performing repetitive but increasingly difficult MacGuffin fetch quests before they kill you as well. A little creepy, but also goofy. Its impressive that the most common bots that patrol the islands can have the demeanor and intelligence of the gangly and awkward Star Wars prequel battle droids crossed with a Monty Python sketch, yet still manage to be menacing. A low-detail art style casts hard-to-miss red beams from their eyes that bounce as they walk, and - especially during the dark half of the rapid day-night cycle - theyre ominous when spotted in the distance. Soon after arriving on the islands, I scavenged a pistol and hand ax from one of the many deserted homes. Considering that gameplay is largely about hiding from enemies, its a bit disappointing that you cant take refuge in any of the abandoned houses on the deserted islands  you can only loot them like big crates. Managing your loot in your very limited inventory space, Tetris-style, creates one of the most important decisions you make in Sir. Picking up a new weapon or very useful gadget (like the almost-mandatory scanner that points you toward the objects you need) means sacrificing the amount of ammo, bandages, and food items you can carry. Fortunately the hunger system is largely irrelevant - food is so prevalent I was never close to starving, but I did need to keep an eye on it for healing purposes. Once armed, I began to feel more like the hunter than the hunted. I stalked my metal prey using the tall grass as cover, sneaking up on pairs of robots until I was right on top of them. Combat requires tactics; ammo is scarce, reload times are long and frequent, and wounds can cause you to bleed out if youre not carrying enough bandages. I learned to bait them into firing both their shotgun barrels from an ineffective distance, then charge in for the kill with my ax. Who's hunting who? That Rambo-like confidence didnt last. After Id gathered a few mysterious objects on a fetch quest, groups of three or four bots appeared with enough collective firepower to make me feel fragile. Shooting and looting bots wont necessarily return as much ammo as they take to kill, and even if it did, the limited inventory space would make it hard to carry both a good supply of bullets and bandages. Dying in Sir becomes very easy to do, and save points are few and far enough between that direct conflicts soon become something to avoid. Stealth becomes the only viable way to survive, and it gives you a few good tools to create distractions with thrown objects like bottles and rocks, and noisy gizmos like alarm clocks with adjustable timers. What we have here is a standoff. Then Sir makes sneaking harder to do by introducing new enemies: balloons with searchlights, fast-moving robo-hounds that are harder to elude and can knock you down, and more. I wont go into detail on those, because the most tense and affecting moments of my first 10-hour trip through Sir was the introduction of new enemies  catching a glimpse of some unfamiliar silhouette in the distance, hearing their distinctive and creepy sounds, and wondering uneasily whether I had enough firepower to kill it if it spotted me. As the density of robot patrols increases, deciding to fire a gun becomes a much riskier proposition; both because ammo is precious and the noise will draw other bots to the scene  often more than you have bullets in your pack to fight. One of them in particular is unkillable, even by the tremendously powerful and fantastic-sounding blunderbuss, forcing a retreat. Of course, if youre patient and thoughtful, stealthing them is still very doable. Especially under the cover of darkness, hiding in the grass makes you nearly invisible even when the robots are almost on top of you. But being that patient is tough. Most of the (many) times I died were a result of thinking I could get away with cutting corners. And yet, it still got me there. Even with the randomization of both bots and geography, though, I have to doubt the long-term replayability of Sir. Though there are five themes, ranging from rural farmland and swamps to sparse industrial areas, one island is functionally very much like the next. Replaying a second time with different starting equipment didnt feel like a significantly different experience. Theres always going to be a drive to be stealthier, sure, but the repetitive goal of sneaking up and grabbing an item could use a bit more variety. The randomization comes with a few quirks as well, such as a boat that serves as a portal between islands showing up in a completely landlocked lake (it still worked fine). Later, a boat transported me to a dock that led directly into an unscalable cliff (that was less fun to work around, given what lurks in the water). Pros Great atmosphereRandomized patrolsTactical, meaningful combat Cons Repetitive objectivesSimilar environments As a stealth game, Sir, You Are Being Hunted is a refreshingly different and unscripted approach with a haunting but still light-hearted atmosphere. Its challenge ramps up well and it rewards patient planning in the short term, though after youve successfully swiped a few well-guarded items the randomized terrain and different starting equipment cant reinvigorate the experience enough to make the second playthrough nearly as engaging as the first.", "date": "May 4, 2014, 3"}