{"name": "Windjammers 2", "name_review": "Windjammers 2 Review", "ref": "https://me.ign.com/en/windjammers-2/193550/review/windjammers-2-review", "text": "Windjammers 2 answers the question: what do you get when you combine air hockey with a 2D fighting game? The result, as it turns out, is an absolute blast to play. Changing very little from the original Windjammers that came out on the NeoGeo 27 years ago, the sequel is simple, sweat-inducing, and extremely addictive. Even though it lacks a few key features youd expect from something designed to be so highly competitive in this day and age and fumbles its attempt at telling any kind of story, Windjammers 2 is a more-than-worthy successor to the retro classic that came before it.At a glance, Windjammers 2 looks to be little more than a game of Pong  and in a lot of ways thats not far off. You frantically move your character around your side of the screen, doing your best at deflecting the frisbee back towards your opponent and scoring points if you manage to snake it past their defenses. But this simple starting point is made a lot more complex by introducing an arsenal of diverse tactics and awesome mind games that draw heavily on the fighting game genre. Of course if youve played 1994s Windjammers (which is available to this day on PlayStation and the Switch) then this concept should sound very familiar to you, because Windjammers 2 remains incredibly loyal to that design, with only a handful of gameplay tweaks, new characters, and improved graphics to distinguish it from the original. Given how few changes there are, its impressive how well the old formula holds up a quarter century later, and the small additions that have been added are all solid improvements. The ability to jump in the air and spike the disc down into your opponents court, for example, is particularly useful.I never felt like I was the victim of unfair tactics or an exploit of some kind.The truly remarkable thing about Windjammers 2 is that any move made against you has a logical counter to it, so I never felt like I was the victim of unfair tactics or an exploit of some kind. If someone is staying back and defending their goal, you can use the drop shot to bunt the frisbee right over their goal and punish them for their babysitting. If someone makes a curve shot that veers just out of your reach you can use your power toss to knock it into the air, giving you time to recover it and mount a counter attack. Instead of raging, losing a match just made me bow my head and consider how I could respond better next time, and thats the hallmark of an incredibly well-balanced meta.Almost as impressive is how Windjammers 2 manages to maintain much of its predecessors art style, which makes use of hand-drawn characters and a top-down perspective that somehow still shows a lot of each person. And this commitment to an old-school vibe certainly pays off with extremely expressive characters and over-the-top animations that made me feel like I was right in the middle of the action despite having a birds eye view.When it comes to gameplay improvements, the star of the show is the Super Meter which charges up a little every time you throw the disc. When its fully charged you can unleash a powerful disc throw that moves quickly and can be difficult to predict. Alternatively, you can use your full Super Meter to counter any attack being thrown at you and avoid what would have otherwise been points scored against you. It adds an element of danger and excitement as you see your own or your enemys meter flashing at the bottom of the screen and know somethings about to go down.The new characters have actually become some of my favorites.There are also a few new characters that mix things up a bit, including Raposa, a skateboard-riding Brazilian kid whos the fastest-moving character available, and Ho, a stoic warrior with a special ability that makes the disc do an anime-style vanishing dash in your direction. The new characters have actually become some of my favorites since their special abilities are usually more over-the-top and creative than the 6 characters from the original. Similarly, the new maps make for some unique experiences, like ones that are a bit wider or longer than the standard size and force you to adopt new strategies to win, or one particularly amusing stage where a point value for each scored goal is randomly selected via a slot machine-like gamble each volley.In other areas, though, its disappointing to see so few additions or updates have been made, especially when it comes to everything that isnt gameplay. The biggest example is the omission of a spectator mode or a training mode, features that are quite common in highly competitive games nowadays and which would go a long way in supporting what is sure to be a passionate competitive community. Theres also no tutorial mode whatsoever, aside from an extremely vague How to Play manual that does very little to explain the many complexities of frisbee-tossing combat. I can understand wanting to remain loyal to the moment-to-moment gameplay, but a lot of the ecosystem surrounding it feels very outdated in a bad way. If Windjammers 2 wants to attract younger gamers in addition to the older set who remember the original, it couldve done a lot more to welcome them in.All modes are essentially the same thing for different purposes.Another missed opportunity is that Windjammers 2 has only three game modes  Arcade, Versus, and Online  and all of those are essentially the same mode for different purposes. Arcade serves as a solo campaign of sorts, though it amounts to little more than a tournament-style series of bouts before a very short epilogue sequence for each character that often left me with more questions than answers. Its a little odd that a story was included at all, given how little effort is put into it. Unless youre just trying to get some practice in against computer-controlled opponents, the juice really isnt worth the squeeze with Arcade Mode, and its definitely the weakest of the bunch.Versus Mode gets straight to the point and lets you play one-off matches against computer players with custom rulesets or local human friends that you trust wont throw you out the window when things get heated (because they very well might). It provides pretty much everything youd expect, but there is one glaring omission: the ability to instantly play a rematch. Instead, youre brought back to the character select screen and have to set up a new match all over again. I know that doesnt sound like a big deal, but matches often end quickly enough that I found myself clicking through all the settings to get back to playing every couple of minutes, and thats really irritating when your blood is running hot and you want to get back into a game so you can show your buddy Kevin that his victory was just beginners luck (not cool, Kevin).Finally, theres the Online Mode, which allows you to finally play a game of anime frisbee with people from across the world wide web. It comes packaged with two matchmade playlists: Quick Match and Ranked Match, the former which just pits you against any available player and the latter matches you against similarly skilled players and gives you a chance to climb up or down the ranking ladder with your victories or defeats. The online mode works well enough but, at least on the Nintendo Switch where I played, wait times can be a bit long and frankly the online UI and overall experience is pretty clunky. That said, it works well enough to get the job done and I experienced minimal input lag in the online games I played, so its a good time. Windjammers 2 is a worthy sequel to a retro classic that manages to improve upon the highly competitive arena with new characters, levels, and abilities that make this fighting game version of Pong incredibly addictive. It lacks some key features like a spectator mode or any kind of tutorial to walk new players through all the complexities of combat and makes a limp attempt at telling a story about its characters, but its so much fun to play that its easy to forgive those whiffs.", "date": "Jan. 20, 2022,"}