{"name": "Metal Gear Solid: Ground Zeroes", "name_review": "Metal Gear Solid V: Ground Zeroes Review", "ref": "https://me.ign.com/en/metal-gear-solid-ground-zeroes/78369/review/metal-gear-solid-v-ground-zeroes-review", "text": "As Metal Gear games go, Metal Gear Solid 5: Ground Zeroes is a stripped down affair. It avoids lengthy cutscenes, climactic boss fights, and the usual frayed and tangled plot strands in favour of smart, tactical gameplay. While its central campaign is indeed as short as you mightve heard at around two hours, its multitude of options make for an engaging and tense experience that encourages replayability for hours afterward. Besides a somewhat clumsily delivered ending, this is Metal Gear for modern tastes; lean, mean, and wickedly fun. The prologue to the upcoming full-bodied Metal Gear Solid 5: The Phantom Pain (expected in 2015), Ground Zeroes takes its structural and tonal cues from Peace Walker, 2010s largely overlooked but wonderful PSP game. Ground Zeroes central plot focuses on Metal Gears usual concerns of high concept political conspiracies and conflicted triple agents, but contrary to the norm, there is very little of it. The plot that is here is darker in tone than what weve come to expect. There has been some talk of Creative Director Hideo Kojimas desires to move Metal Gear into a grittier and more provocative territory, and the gristle and grime on display in the game's unflinching cut scenes and audio tapes certainly suggests this is the case. While I do appreciate these ambitions - particularly because the series has been known to veer into cartoonish territory - I found its ending, which features unusually provocative cruelty, to be awkwardly handled. I suspect Kojima was going for heartbreaking, but the final blow (and I really found no issue until then) felt unearned; a look what we dared to do! statement shoehorned in for shock value and very little else. But the story is over quickly. When I rushed through it, I was done in less than an hour, but taking my time to smell the roses I finished it in three. The length might bother those coming to Ground Zeroes looking for a full-fledged Metal Gear game, but it does prove itself to be more than a glorified Phantom Pain tutorial with five sizeable side missions and a number of accessible and ingenious ways in which to play most of them. You just have to be ready to look for it. For the first time in a Metal Gear game, Boss adventure is a non-linear one, played out in the US Naval Prison Facility known as Omega Base. Its a small sandbox, where the corridors and rooms littered with conveniently placed containers weve grown so familiar with have been replaced with a sprawling, functional ecosystem, full of impressively open industrial areas and heavily populated camps surrounded by raging sea. Ground Zeroes at its most visually impressive on the PlayStation 4, but Omega Base is wonderfully realized regardless of the console you choose to play on. Its a detailed, considered world presented sharply and cleanly, and its testament to its character that it feels like an entirely different locale depending on a change in weather. The central campaigns Omega Base is a rain-soaked John Carpenter-esque isolated prison full of hidden secrets and threats, while many side-ops cast it in brutal sunlight, highlighting incredible detail on the flora and fauna but threatening to expose your every move. Picking a lock in broad daylight is a tense undertaking. Ground Zeroes is so adept at generating tension that at times it felt like I was playing a survival horror game. While Boss has never been more flexible; able to roll and jump and shoot in line with todays top third-person action-adventure games, enemies are smart and plentiful. In the harsh light of day - and played on Hard mode - they possess cruel 20/20 vision, and react to every little movement or shifting shadow by becoming more efficacious in their patrolling. Youre given a couple of helpful technological perks to counter this: a pair of binoculars allowing you to tag enemies to track their movements a la Far Cry, and Boss iDroid (its 1975 and Apple is apparently still ubiquitous), which aggregates your map and mission information. The binos in particular are invaluable when it comes to avoiding unexpected confrontations, but largely - and thrillingly - its up to you to utilise your terrain in whatever way you wish to get through the area unscathed. If you want to, you can do this all guns blazing. Ground Zeroes happily caters to more chaotic minds, and with regenerating health and a new reflex mode that briefly slows down time when Boss is spotted allowing for a bullet to the offending head, Shoot First, Ask Questions Later isnt the death sentence it was in previous games. But take this approach, and prepare to be penalised. Stealth is still Metal Gears raison detre, and as per the Metal Gear norm Ground Zeroes ranks you after each mission, marking you down for every fatality and rewarding you with unlockable items and high scores for a no-kill, no-detection playthrough. While you can blunder through fairly effortlessly from beginning to end, the brutal sting of a D ranking is a reminder that youre nothing but a second-rate soldier. In a lesser game such punishment might irritate, but Ground Zeroes offers up so many infiltration options I found the stealth approach by far the most satisfying way to play. One excellent side op, for example, challenges Boss to communicate with an undercover agent in among the rabble. Do you put everyone else to sleep with a tranq gun? Do you follow him from a distance in a vehicle, then leap out and pull him into a neck lock when his back is turned? Do you put him to sleep, before dragging him into the shadows and kicking him awake? Boss is at his most graceful when hes darting in and out of hiding; the neck lock, tranq dart, and silent takedown become a beautifully perverted dance to both execute and watch. You'll be carrying bodies in Ground Zeroes. A lot. A couple of side op missions fall down because they encourage a louder approach. An on-rails helicopter mission that has Boss protecting an endangered VIP from above is generic, while another blow up three things mission disintegrates into brainless action pap. I admit I found a certain catharsis in all the wanton destruction after sneaking around so much, but I was not compelled to play either mission again. Otherwise, I was happily enticed by Ground Zeroes world for a good eight to ten hours. Finding each XOF patch to unlock the console-specific side missions - which are both brief, but full of nostalgic pleasure - was a surprisingly tense and entertaining way to replay the main mission, while beating in-game trials, speed runs and finding rare unlockables became seductive prospects once I had familiarised myself with Omega Base. Score-chasers might be the only ones to find long-lasting appeal in Ground Zeroes, but theres certainly plenty of content here to satisfy. Pros Highly replaybleEnticing open worldTough enemiesStrong PC features Cons Tone-deaf ending Metal Gear Solid 5: Ground Zeroes is a short but challenging game, and those willing to cast aside conventional expectations will find a lot more here than first glance might suggest. Aside from its problematic ending, Ground Zeroes mostly represents a new, more sophisticated era for Metal Gear, particularly given its attention to what matters on PC. A Big Boss/Snake adventure has never looked or played better, and in it lies incredible promise for its enormous big brother -- Metal Gear Solid V: The Phantom Pain.", "date": "March 18, 2014"}