{"name": "80 Days", "name_review": "80 Days Review", "ref": "https://me.ign.com/en/80-days/99714/review/80-days-review", "text": "True to its literary source material, 80 Days greatest asset is words. The mobile adventure game masterfully captures the awe-inspiring wonder of adventure seen in Jules Vernes classic novel, Around the World in 80 Days. It achieves this while exploring a deeper realization of his story in fascinating new ways. 80 Days is presented as a stylized choose-your-own-adventure novel in which your responses to people and events steer your journey in a unique direction, toward an uncertain fate. Along the way theres a satisfying, surprisingly strategic balance in what youre doing and where youre going, all supported by a smart, energetic story of global and personal discovery. As Passepartout, the French assistant to the English gambler Phileas Fogg, it's your job to manage Fogg's money, schedule, and health in his quest to win a wager: Travel around the world, London to London, in just 80 days. Collecting an item in Europe thats valuable in Asia is an example of its many interesting risk/reward opportunities, which arise every few minutes: you might sell it for a profit that funds speedier travel at the expense of going out of your way. Or, if Foggs health starts to deteriorate, you may need to decide between buying expensive, warmer clothes, or staying more nights at a hotel, which may lead to missing a train that only runs a few days a week. These decisions are tense, exhilarating, and unexpected. I adored rolling the dice on a risky detour, even if it set me back a full week, because of the way I role-played my particular Passepartout. He was never satisfied simply with the task at hand; instead, the need to constantly explore cities, soak in sights, and discover people and cultures took priority. During my travels with Fogg I was robbed by Jesse James, arrested by dirty lawmen, and mesmerized by the 19th-century worlds growing understanding of robotics. I led the mutiny of a ship, sold valuable weapons to other nations, rode the Orient Express, and utterly bankrupted Fogg. I didn't actually see any of this unfold, but I have vivid memories of these events. 80 Days descriptive, beautiful, and concise prose realizes its memorable world brilliantly. Text rolls out over gorgeous, shadowy illustrations of St. Petersburg, San Francisco, Hong Kong, Cairo, and other iconic cities. It explores steampunk and sci-fi elements without making a to-do about any particular setting or theme. Every scene has equal merit as a chapter in your story, and each explores the depth of the world and the sort of man Passepartout is. Id choose how he responded from a short list of three to five options -- sometimes with insecurity, other times with confidence, often enough with aggression to get into trouble. Sometimes a massive gamble paid off; sometimes it ruined me. Other times, a decision presented exciting new opportunities to explore more of a rich, beautiful, and imaginative world. Wherever the story went, I felt ownership and responsibility over my journey. I love 80 Days most for giving me the sense that Im crafting a story, rather than relive something Ive already read -- and theres something marvelous about seeing where else Around the World in 80 Days could have gone, and in hearing the very different places it's taken others. Pros Fantastic writingDeep worldGreat storiesSmart risk/reward choicesSurprisingly strategic I completed my first circumnavigation of the Earth in just over 80 Days' time limit, but only barely. If we hadnt taken a boat headed for Hawaii, if I didnt gamble with the ship's engines by pushing them to the brink of explosion, perhaps I could have made it. I eagerly started again immediately, with a whole new set of text-based adventure decisions -- Foggs enthusiasm, and 80 Days absence of punishment or actual sense of failure, had me excited to do it all over again. I had a spectacular, unforgettable adventure story to show for my three-hour adventure, and couldnt wait to learn more about the world, its characters, and the human desire to discover.", "date": "Jan. 10, 2014,"}