{"name": "Nobody Saves the World", "name_review": "Nobody Saves the World Review", "ref": "https://me.ign.com/en/nobody-saves-the-world/193462/review/nobody-saves-the-world-review", "text": "How much I enjoyed Nobody Saves the World was constantly in flux as I played, which is somewhat appropriate given the transforming nature of its hero. The latest from Drinkbox Studios is a fun but uneven top-down action-RPG that has you somewhat clumsily swapping between 15 different unlockable forms, mixing and matching their abilities to overcome challenging dungeons. Its a clever premise thats bolstered by fantastic playstyle customization options and all the charm and humor Ive come to expect from the developers of Guacamelee. After a slow start its good fun for a long stretch before the campaign loses steam once the chase of unlocking all the forms starts to come to an end.Nobody Saves the Worlds straightforward story opens with the onset of a disastrous calamity: everything has inexplicably been covered in gross fungus, monsters are everywhere, and the worlds most powerful wizard, Nostramagus, has gone missing. Its up to you, a pale-bodied amnesiac named Nobody armed with Nostramagus magic wand, to  as the title would suggest  save the world. Its serviceable as an excuse to send you all across the overworld, clearing out dungeons and collecting shards of a magical gem as you go. The one real highlight is Randy the Rad, Nostramaguss obnoxious apprentice who becomes increasingly unhinged as his plots to stop you and steal the glory routinely backfire on him in a variety of amusing ways. Its that magic wand that allows you to transform into a total of 15 wildly different forms, from a lowly rat to a muscle-bound bodybuilder, or even an undead necromancer. Each of them has their own traits and abilities, such as the horses hind leg kick, the Rangers chargeable bow and arrow, and the Bodybuilders barbell push, which makes them feel markedly different from one another to play. No matter which form youre in, combat starts out simple to a fault, but eventually becomes interesting thanks to the expansive customization options that grow with every new form you unlock and upgrade. Take, for example, the basic melee-class Knight. When you first get him all he has is a single sword slash, so all combat for him is basically just running up to enemies and holding the A button until everything dies. But level him up to the next rank and youll unlock his stomp, which gives an area-of-effect attack. Level him up again and youll get the ability to block and counter attack. Combat starts out simple to a fault, but eventually becomes interesting.On its own, that isnt a very impressive list of abilities, and if your only character was the Knight things would get very boring very quickly. But whats unique about Nobody Saves the World is that you can take those unlockable abilities and mix-and-match them to any other character. So you could equip the Knight with the horses gallop ability to make him run super fast and crash through enemies, or you could put the Knights shield block on the Ranger to give her a way to defend against enemies that get close. Every form has their own stats, movement speed, and signature attack that cant be changed and gives them an identity, but everything else is completely mutable.In that way, youre not just unlocking a new form, youre unlocking all of the potential tools that forms abilities provide for your ever-growing collection. There are some really fun synergies to discover as well  I wont spoil many, but try the Rangers passive ability to add poison to every attack and combining it with the Monks Holy Rain that hits every enemy on the screen. And if thats not enough, you could even top it all off with the Rats ability to detonate any enemies affected by poison. There are some really satisfying and powerful combos that you can eventually pull off, and the difficulty curve rises nicely to make sure that you have to use them in order to get through some of the tougher battles.My only substantial issue with this mix-and-match mechanic is that managing your transformations is way more difficult than it should be. Quick-swapping between so many transformations on the fly is a pain because time doesnt slow down when you bring up the radial menu, you cant register any favorite forms on to single button shortcuts, theres no way to easily place transformations into specific slots on the radial menu and, worst of all, theres no way to quickly revert to a previous form. So much of the challenge and fun of Nobody Saves the World comes from finding the best synergies between your forms, so its a shame that the controls dont make it easier to quickly switch between them.Questing on the SideWhen I wasnt tackling the many dungeons and demi-dungeons I was exploring the respectably large overworld, searching for hidden flasks of mana juice for permanent mana pool upgrades and side-questing for its many inhabitants. The sidequests of Nobody Saves the World are shallow but amusing nonetheless, and offer some nice breaks from the constant fighting that happens throughout the overworld and within dungeons. One is as simple as talking to a horse while in horse form so you can finally find love, while another has you working for the thieves guild and breaking the one-per-customer rule at a discount bargain store by transforming into four different humanoids. Others present challenging minigames that really put your mastery of certain forms to the test. My favorite of these had me destroying a series of dummies that could only be damaged by specific damage types in a limited amount of time. This started off easy and could be done with pretty much any form with any loadout that matched the damage type, but toward the end I really needed to think about what abilities I had that could hit the dummies fast enough, and come up with a plan that could allow me to cover all the required damage types. The Sweet CenterThe middle of Nobody Saves the World is great fun. Once I was about three or four hours in I had enough forms and powers unlocked to make meaningful customization choices, enemies frequently spawned with wards that would require me to switch up my damage type in order to hurt them, and the dungeons introduced really clever modifiers that forced me to think about my loadout and consider equipping certain passive and abilities that I might never have used otherwise. Like, for example, a dungeon that made it so that every hit dealt 9999 damage, both to me and to my enemies; or one that littered the floor with landmines and put me against baddies that could slow me down; or one that made all enemy corpses explode. The middle of Nobody Saves the World is great fun.Of course, getting to the point where you have that expansive set of tools and get to use them in creative ways to solve clever combat puzzles and encounters is much less fun. The early hours of Nobody Saves the World expose how weak the combat is when you are without that toolkit. Theres a distinct lack of challenge and depth, both of which are filled in later on  but in those first two or three hours it just feels like a bunch of grinding without much reward.On the other end of that, the last stretch of the 15-hour adventure starts to suffer from a feeling that the well has run dry. I ran out of new forms to chase, I felt like I had seen and experimented with all of the ability synergies that made sense, and I felt like I had easy answers for just about everything. It wasnt until I got to New Game+ that things started to feel fresh again, as it allows you to start over with all of your buffed-up forms unlocked right away, all the enemies are balanced exactly to your level, and every dungeon has a unique set of new modifiers designed to add on another layer of challenge. Its a great post-game hill to climb and has helped bring back a lot of the excitement that I had in the middle of my first playthrough.Nobodies Save the WorldNobody Saves the World also features two player online co-op, which works well mechanically but comes with a few significant caveats. One player serves as the host, while the other person essentially jumps in as a clone with all of the same forms, upgrades, and abilities that the host player has access to. This means that theres no way for the second player to have access to their own save file, and thus, no way to actually make progress in their own game without creating their own co-op game as the host. The other frustration about co-op is that when one player pauses, it pauses for the other player as well. Its incredibly jarring to be playing online as the only person watching your own screen, and then all of a sudden see the menu pop up as your partner navigates over to the transformation tree to swap in a new transformation. Even with those issues, though, Nobody Saves the World does benefit from the company of a second player. The host is able to level up two forms at a time (or one form twice as fast), there are even more synergies to experiment with, and theres appropriately balanced difficulty adjustments to account for the fact that theres twice as much damage hitting enemies at all times. Plus, everythings better with friends. When Nobody Saves the World is at its best, which it is for a majority of the 15-hour campaign, it's a joy to play. Granted, its transformation menu needs a lot of work to make it useful on the fly, but theres a wide variety of fun and humorous sidequests, excellent customization options that encourage experimentation between your various forms and the abilities they can equip, and clever dungeon designs that really demand you explore the full depth of that customization. That delicious center is unfortunately bookended by a slow beginning and a drawn-out end, but theyre worth pushing through and past to experience what is truly a unique and charming action-RPG.", "date": "Jan. 18, 2022,"}