{"name": "republique", "name_review": "République Review", "ref": "https://me.ign.com/en/republique/81683/review/republique-review", "text": "Rpublique is a fusion of everything its creators adore. Developer Camouflaj owes its pacing and puzzle design to Resident Evil, its core stealth philosophies and self-aware humor to Metal Gear Solid, and its world-building to Orwells Ninteen Eighty-Four. Independent of its inspirations, Rpublique does a remarkable job of creating its own identity. Clever presentation, appropriate use of the mobile platform, and generally smart game design add up to something thats special, new, and necessary. Rpubliques first episode, Exordium, is a subtle, satisfying story-based adventure with strong characterization in a marvelous dystopian world. It ponders paranoia, surveillance, oppression, censorship, revolution, and more, all in the first three hours of a larger, evolving story that pays off with a powerful cliffhanger ending. Hope, Rpubliques young heroine, is a fugitive who turns to you for help, and the presentation of how you engage with her and the regime she wants to bring down is a strangely self-aware approach to mobile game design. It also works. Your mobile device is a window into her world. Youll use it to remotely access security cameras, watch Hopes back as she takes down or sneaks by guards, and answer her phone calls in her attempt to escape a containment facility called Metamorphosis. Youll use security cameras to scout areas and guide Hope to safety, and its a refreshing approach to stealth. She takes cover, retrieves items, knocks out guards, and gets around fascinating, dystopian locales with simple, one-touch commands. Its an intuitive slow-paced system, but because youre engaging in so much, so often, the exploration and combat is surprisingly satisfying. Time freezes when you bounce from one camera to the next, allowing you to analyze a space, read hacked emails, answer phone calls, and find strangely self-aware secrets in the form of hilarious video game industry inside jokes. Hope never got caught lurking around because I wasnt quick enough, and the possibility that she could be detected at any minute made for moments of quiet tension I loved. I always felt relieved when she made it through to the next area undetected, and I always wanted Hope to get there, because every room in Rpublique has fascinating things to say. Metamorphosis is a lonely place whose populace exclusively comprises prisoners and guards. Within its walls, the player is important enough to have control over the entirety of its surveillance and security systems. This, separate from the grander story about toppling a totalitarian regime, poses the provocative philosophical question of Who watches the watchmen? I kept wondering, Who am I? As the player, what is my role, why am I helping Hope, and are my intentions pure? The uncertainty of this all-seeing presences intent is another fascinating mystery layered atop a character story it was easy to invest in. Hope has meaningful life goals, and shes interesting because shes more than her anti-Big Brother cause. Exordium introduces enough about her to empathise with her motivations. Shed like to learn, to love, and to live, and shes on her way to accomplishing this by subverting the system. Facial capture helps sell Hope's desperation. The story here, at a base level, examines subjects like Orwellian oppression and an uprising happening within a the regimes walls. Its the confidential information you discover about those two sides that defines Rpubliques greatness. Rpubliques storytelling requires a lot of start-and-stop, which some may find tedious and dull. I embrace BioShocks audio diaries and Metal Gears codec conversations, so seeking out additional context was something I pined for in Rpublique. I always wanted to know more about these characters and their relationships. The terrific performances create a persuasive compassion in Hope. The believable anxiety with Jennifer Hales Mireille and Khary Paytons Derringer creates a dark, awkward disrespect between Metamorphosis ethically questionable security leaders. Im excited to see that relationship come undone, certain characters true intentions, and other plot points I dont dare spoil. You can open doors for Hope, or lock them to trap enemies. Discovery exposes the history of Hopes enemies, the uncertain demise of a revolutionary leader, and the depths of Rpubliques societal structure. Metamorphosis secrets are hidden in recordings, imagery, and overheard conversations within the walls of its gorgeous antique architecture. Using your last screwdriver to open a vent may lead to valuable and limited tasers for taking out guards. Youll just need to be tolerant of Rpubliques Resident Evil-style backtracking and limited resources -- something thats going to play into future episodes, for sure, since it locks you out of a ton of areas early on. Your espionage exposes conspiracies within conspiracies, and for mystery nerds, Rpubliques strong first chapter unravels into something that could be incredible. Pros Superb, deep worldInteresting heroineMemorable charactersRewarding secrets Cons Occasional tedium The more you put into Rpublique, the more youll get out of it. Retracing steps can be tedious, but the story payoff and gameplay rewards make it worth the trouble. Leaping from one camera to the next is a fulfilling, oddly voyeuristic way to explore this superb, deep world, too. Its sense of omniscience felt empowering, while the remaining mystery of who I am, and where Im taking Hope, adds convincing intrigue. Rpublique is off to a great start, and I hope it can keep this refreshing momentum going for the rest of its episodes.", "date": "Dec. 20, 2013,"}