{"name": "Assassin's Creed Pirates", "name_review": "Assassin's Creed Pirates Review", "ref": "https://me.ign.com/en/assassins-creed-pirates/74757/review/assassins-creed-pirates-review", "text": "Assassin's Creed Pirates, a nautical-focused mobile spinoff of Assassin's Creed IV: Black Flag, introduces a potentially interesting gameplay loop that never quite evolves throughout the course of your adventure. As you can probably guess, you'll find yourself charting the various corners of the Caribbean, expanding your crew and armada, and engaging in all manners of violent and stealthy seafaring. But while the core ideas of Pirates could make for an interesting complementary experience to its AAA brother, I was quickly bored with my newfound life of piracy. Pirates impressive looks on on mobile platforms manage to capture a little bit of the magic that I felt from behind the wheel of a ship in Black Flag. Whether you're sailing around a fully 3D world, or charting your course via an interesting cartography-heavy overhead map, it's a solid visual experience for the most part. The only dips in visual quality come during the frequent conversations, which play out via static portraits that ramble on to each other for endless stretches. The story here isn't particularly interesting, and were it not for the sake of this review, I would've been skipping through these exposition dumps with reckless abandon. The main gameplay loop in Pirates involves exploring an area, winning ship battles and races to earn various forms of loot, and then spending it to upgrade your character, crew, and ship. Exploring is simple, and usually done by dragging your finger across a map to chart the course of your ship. Initially, the map is covered in a fog of war, but in typical Assassin's Creed fashion, discovering a lighthouse illuminates the surrounding areas. I'm a sucker for being given the tools to fully map out an area, so this portion of Pirates really resonated with me. While the raw act of exploration is fun, the main problem with Pirates is its shallow, boring ship battles that quickly devolve into wildly unrealistic chores. Where Black Flag empowers you with a bombastic sensory overload and dense, challenging battles, Pirates bends reality and turns these skirmishes into little more than games of rock-paper-scissors. You line up a shot, fire it at your enemy, and wait a mandatory handful of second for your cannons to cool down. Every shot or two, your enemy gets a chance to counterattack, which you need to dodge by either swiping to the left or to the right. The way your ship deftly speeds up or suddenly grinds to a halt is absolutely silly to watch the first time, and more than a bit annoying to watch the 100th time. You do get to upgrade your ship throughout Pirates, but this core loop of ~attack, dodge, attack, dodge~ never really evolves, which is a shame. Thankfully, the actual act of upgrading is quite addicting, and handled in a tasteful manner. You'll gather resources after downing a ship or winning a race, and you can then pop into a menu and choose what you want to spend your money and resources on. The upgrade progression in Pirates is natural, and Ubisoft never butts in with invitations to speed ahead by paying real-world money. Watching my crew grow, eventually populating the deck of my ship, was gratifying, and assigning each one a passive or active skill, like speeding up my cannons recharge or allowing me to move swiftly even in strong winds, made my ship feel like my own. But again, no matter how much I might enjoy filling in the dark corners of a map or watching my armada grow, the fact that I continually had to engage in the same tedious ship battles made my four hour tour with Assassin's Creed Pirates feel like a never-ending voyage. It's also worth noting that those expecting anything resembling a traditional Assassin's Creed experience should probably look elsewhere -- you won't be leaving your ship at any point in Pirates, so don't expect any airborne assassinations or basilica ascensions. Pros Impressive visualsFun exploration Cons Incredibly boring combatForgettable storySquandered concept The nautical elements of AC III and Black Flag are arguably the strongest facets of those games, and those themes are rife for exploration in a standalone title. While Assassin's Creed Pirates manages to capture a bit of that sea-faring magic, it never quite delivers the pirate experience I wanted. Unless you're willing to grind through an endless wave of banal ship battles, you're better off sticking to its bigger, better, and much less frustrating console and PC brethren.", "date": "Dec. 13, 2013,"}