{"name": "X Rebirth", "name_review": "X Rebirth Review", "ref": "https://me.ign.com/en/x-rebirth/17946/review/x-rebirth-review", "text": "There are two major sets of problems with Egosoft's X Rebirth. First, its cursed with a tremendous number of technical issues, making it unstable and glitchy while hamstringing its performance, even on my mid-range gaming PC. Those failings may change with time and patches, but the second and more significant set of problems will not: from conception to execution, X Rebirth consistently misses the mark about what is valuable and interesting in an open-ended space sim. Its consumed by minutiae and a terrible interface for managing it, turning what could have been a lightspeed journey among the stars into something more akin to a numbing, monotonous trudge across a crowded mall parking lot on a hot summer day. X Rebirth is unconscionably padded out with time-wasting quest lines that involve almost nothing but travel from one boring, ugly space station to another. Pick any mission, and the odds are good that you'll have to spend 10 minutes traveling along the ~space highways~  more on this in a second  and then another five minutes flying around at regular speed, staring at different parts of a station like some kind of wall-eyed aquarium fish trying to find specks of food. That feeling of being in an aquarium is not helped by the fact that everything seems awash in neon nebular space gas. Space, as presented in X Rebirth, is not black and empty but is incredibly busy with gas trails, shiny asteroids, and ginormous space stations with billboards on them. It's striking at first, but eventually wearying. If everything looks big, bright and spectacular...then eventually, nothing does. Getting close to things and staring at them is a major part of X Rebirth. It's how you find missions, commercial transactions, landing bays, and even hackable objects. This is because X Rebirth doesn't believe in menus, opting instead for hyper-immersion. Why open a menu and select the option you want when you can spend five minutes flying around an enormous space refinery looking for that escort mission you glimpsed fleetingly a few minutes earlier? Why design a sensible and intuitive trade interface when you can fly within 10 feet of a briefcase icon and place a larger order for energy cells? And in between space stations, you can ride the space highways where you go faster by tail-gating other ships, so you can spend your trip among the stars staring at someone's space-bumper. When you finally reach your destination, you can dock and go explore the ship or space station in first-person perspective, which sounds more exciting than it actually is. There's only a handful of stock station layouts, so wherever you go in the galaxy, it feels like you're right back where you started, talking to the same slack-faced drones. There's a even a bizarre layout where you can go buy weapons and goods from vendors who are plainly inside what is supposed to be a prison. X Rebirth just offers the wrong kind of immersion. It's all the petty chores and frustrations of everyday with none of the excitement promised by the sci-fi setting. Doing anything in X Rebirth is like spending twenty minutes looking for your car keys and wallet before getting stuck in gridlock on your way to a store that probably doesn't even have what you want. If it sounds like I'm focusing on nitpicks rather than the real game~  the one with all the trading and ship-ownership and the story of a galaxy on the brink of war  it's because this is the real game. This stuff, the endless wandering, the lousy menus, the dumb first-person sequences, has taken up four fifths of my time with X Rebirth, while the ~good stuff~ never actually arrives. Admittedly, it's been slow going due to the one-crash-per-hour instability it averaged before the last two updates, but the bottom line is that X Rebirth wastes your time far more effectively than it delivers any kind of rewards. Even when combat does break out, it's about on par with the original Wing Commander series, which was great in its day, but just doesnt cut it now. Your ship is painfully slow, so a lot of fights come down to watching your enemy fly away, turn around, and then come back for a head-on firing pass. The trick is having better gun and shield upgrades so that you can survive these ~shoot each other in the face~ contests. There's a story, but it's really not worth playing for. You play an everyman, Ren Otani, who stumbles across a super-ship from the last war and gets it up and running. Then he meets Yisha, a terribly voice-acted copilot who gets him involved in a resistance movement against an evil mining corporation and look, you fly around space looking at things and talking to people, okay? There's a quest chain that basically culminates with you editing the mining corporations WIkipedia page. It's a dragged-out tutorial with awful voice acting. But really, what damns Rebirth is that its interface is designed around poorly conceived gamepad controls that constrain every other control option. While you can use mouse and keyboard, youre still forced to navigate through layer upon layer of simplified menus. And where a few efficient keyboard shortcuts could have taken care of communications, navigation, and targeting, instead we get a weird contextual HUD that never actually tells me what I want to know, an unusable map interface, and an absurdly deep chains of radial menus. To top it all off, X Rebirth failed to recognize my Saitek x52 flight stick and throttle, interpreting it instead as a 360 pad and ignoring most of the buttons. I know that joysticks aren't as common as they were during the X-Wing vs. TIE Fighter era, but its still an option a lot of space sim fans want. This will start to look familiar... Pros A universe of options Cons Tedious, pointless travelPerformance and stabilityTerrible interfaceCliched campaign No matter what happens with stability and bug-fixing patches, its poor controls, awful interface, and dull pacing ensure that X Rebirth will remain unpleasant for all but the most forgiving, die-hard space jockeys. X Rebirth doesnt give players the power to navigate the inherent complexities of the genre, and instead forces them to crawl at a snail's pace around the galaxy, hunting for vendors and grinding out fetch-quests.", "date": "Dec. 3, 2013,"}