{"name": "Xbox One X", "name_review": "Xbox One X Review", "ref": "https://me.ign.com/en/xbox-project-scorpio/139674/review/xbox-one-x-review", "text": "Microsofts positioned the $500 Xbox One X as the most powerful console ever made. Thats a claim that's easily backed up by stunning visual and performance upgrades for both its first-party games and select enhanced multi-platform games. That gives the One X a noticeable advantage over its closest competitor, the $400 PS4 Pro. The catch of this slender, cool, and dead-quiet console is that its value is dependent on developers updating their games to make the most of it. Like the One S, the One X can be laid horizontally or vertically and has an internal power supply, so theres no bulky power brick to deal with. Its black matte plastic casing is sleek, but not quite as attractive as the semi-perforated shell and striking white finish Microsoft presented with the One S. And if youre already enjoying those quality of life changes having owned an One S, youll be happy to know the transition from the One S to the One X is literally as simple as pulling your cables from the former and plugging them into their near-identically corresponding inputs on the latter. Like with the One S, theres no port for the Kinect (RIP) on the One X, so if you want to use one for old times sake youll need Microsofts $40 USB adapter and occupy one of the One Xs three USB 3.0 ports. Whats under the hood is much more admirable: a 2.3 GHz processor, 6-teraflop GPU, and 12GB high-speed GDDR5 memory all give it a significant advantage over the PS4 Pro. (Microsoft claims its 40% more powerful). And at just 11.8 inches long, 9.4 inches wide, and 2.4 inches high, the One X packs it all into an efficiently compact space thats around 15% smaller than the PS4 Pro, and yet about 15% heavier at 8.4 pounds. Its also as remarkably quiet as the One S, even when its working hard, and never got warm enough that overheating in a confined space would be a concern. In fact, the Xbox One X runs only a few degrees warmer than the One S during 4K-enhanced gameplay: both the One S and One X averaged within 106 and 112 degrees fahrenheit, while the PS4 Pro stabilized around 124 degrees during our testing. But how much better do all those impressive-sounding numbers make your games? Its a complicated question, and unfortunately theres no one-size-fits-all answer. While any Xbox One game you load up will take advantage of the One Xs power to run better than it does on the One S, and Microsoft has a list of over 100 existing and upcoming games that are or will be enhanced, the level of that enhancement depends on how much support each respective developer has put in. So, mileage will vary. The good news is that Microsofts most popular first-party games have received the royal treatment. The First Family Gears of War 4 is a prime example. It supports native 4K resolution and high-definition textures to match, HDR10 for improved color depth and contrast on supported televisions, plus enhanced graphical features which are most evident in lighting and particles. Maybe most importantly of all, the frame rate in the Campaign and Horde modes is boosted so you can get up to (but not locked) 60 frames per second if you select the performance option in the menu. When all of that is working together, Gears of War 4 on the One X is dramatically smoother, and a sharper, deeper visual experience than it is on the One S. And even without HDR or if youre hooked up to a 1080p display, its an obvious upgrade thanks to those improved effects and supersampling, which shrinks a 4K image down to 1080 in order to smooth out visible jagged edges. Forza Motorsport 7 is a stunning showcase of the One X in native 4K at a steady 60 frames per second with HDR. Its a beautiful experience. Likewise, Killer Instinct looks and runs great at 4K and 60 frames per second, though its stylized art doesnt benefit as much from the higher-resolution treatment as Gears of War 4 does. In this same vein, older Xbox One games and even an assortment of backward-compatible 360 games show improvement relative to older consoles (though obviously the One X cant work miracles like improving an old games texture resolution on its own). Its great to see your old favorites in a new light - games like Halo 3, Fallout 3, and Oblivion all run nicely - but naturally they wont blow your hair back with the same gusty force of Gears of War 4. Outside of Microsoft's own games, results can be inconsistent. Testing enhanced versions of Assassins Creed Origins and Middle-earth: Shadow of War in both their high-resolution and performance modes reveal noticeable improvements even over the PS4 Pro, with cleaner textures, improved shadows, a modest reduction in load times and better performance, depending on the setting. However, games like World of Tanks, Disneyland Adventures, and Super Luckys Tale mostly get things like minor visual enhancements and frame rate improvements over the One S. Whats worrisome is that we know from the example of the past years worth of PS4 Pro support that the quality of any improvements to enhanced games is left completely up to the developers. Will a game run in 4K? Will it have HD textures? Will it have any other improvements to take advantage of the One Xs graphical superpowers? Its hard to know, unless the changes are specifically spelled out in the store (as is the case with Square Enix and Rise of the Tomb Raider). Its clear after testing that the One X is the best console for cross-platform games, but the inconsistency of third-party enhancement makes it almost as much of a guessing game as the PS4 Pro. Size Matters Yet when a game does take full advantage of everything the One X can do, theres a downside: 4K textures are huge. The enhanced versions of both Gears of War 4 and Forza Motorsport 7 weigh in at around a chubby 103 and 95 gigabytes each, respectively, which is roughly double their install size on the One S. And the enhanced Quantum Break nearly breaks the scales at 178 gigabytes thanks to huge amounts of 4K video. The One X has a one-terabyte internal hard drive (with no larger option), but at this rate thats going to be consumed just as quickly as the original Xbox Ones 500GB. Storage space can be easily expanded with any USB hard drive, but if you dont already own one thats an extra expense you have to account for on top of this already premium-priced console. These monster-sized files can also have an impact on install and load times because so much data needs to be transferred to and from the 5400rpm hard drive. For example, loading the first campaign level of the native 4K-enhanced version of Gears of War 4 took the One X roughly 20 seconds, compared to 10 seconds for the standard version on a One S. However, Assassins Creed Origins and Shadow of War both regularly loaded faster on the One X than on the PS4 Pro, while loading times on other unenhanced games appeared inconsistent. At The Movies Like the One S before it, the One X is now the most appealing console for home theater enthusiasts thanks to its ultra-HD Blu-ray drive and Dolby Atmos audio support. That ability to play 4K movies off of physical media is something the competing PS4 Pro strangely doesnt offer. Beyond that, the One X includes a number of cool upgrades like 4K support for DVR game clips (which are downsized to 1080p if youre uploading directly, but can be exported to a hard drive at 4K if you want to edit and upload from a PC.) Its design also allows easy transfer of data between your Xbox consoles through an external hard drive or your home network. And, with such a focus on visuals, the handy TV calibration and compatibility features help you to ensure your display is hitting the right notes for HDR enhanced games. The long-standing issues with the sluggish dashboard are rectified with the newly updated UI, which runs snappier on the One X. The Xbox One X is a very impressive collection of hardware crammed into a sleek case. It runs cool and quiet as it delivers performance a step above any of its console competitors. Its hard to believe Microsoft exclusives like Gears of War 4 can look so good and run so smoothly on a box that costs less than half of what youd pay for a high-end gaming PC. Plus, it caters to home theater enthusiasts with 4K UHD Blu-ray playback and Atmos sound. Though much of the Xbox One X's impact depends on developer support and the quality of your display, it delivers exactly what was promised: the most powerful console you can buy right now, by a significant margin, with plenty of potential left to tap.", "date": "Nov. 8, 2017,"}