{"name": "Just Dance 2014", "name_review": "Just Dance 2014 PS4 Review", "ref": "https://me.ign.com/en/just-dance-2014/81402/review/just-dance-2014-ps4-review", "text": "I had wondered what new consoles could possibly bring to a series like Just Dance. It has evolved in complexity over time, adding a plethora of online and community features to the loud, fun tracklist and choreography that made its name, but this is hardly a technologically advanced game - so it's perhaps not surprising that the PS4 version is exactly the same as the PS3 version, save for the option to dance without the Move controller. It's actually lacking a few features present on Wii U, and with more than one person in the room the PS4's camera sometimes had a little trouble keeping track. It's still a lot of fun, of course, especially with the right people, but if you were expecting big changes, you'll be disappointed. If what you want from a dance game is instruction on how to become a better dancer, Just Dance is not the one for you. For that you probably want Dance Centrals detailed choreography breakdowns and practice moves. But as a party game, for me Just Dance wins out every time. Its gloriously silly, colourful, riotous fun, and it has the magical power to make people want to dance before the usually mandatory two glasses of wine. Technically its never been the most accomplished dance game around, but its always been the most fun, and Just Dance 2014 continues its fine tradition of wonderfully outlandish costumes, easy-to-follow moves, and energetic personality whilst ramping up the production values and choice of modes. Track-list wise, Just Dance sticks closer to modern pop than any previous entry in the series  its 47-song list is dominated by the likes of One Direction, Katy Perry, Nicky Minaj and  finally  Lady Gaga, but theres some ABBA, Village People, Bob Marley and, um, Daft Punk for variety. When Just Dance started off it couldnt afford original songs, let alone original current songs, but now its bursting with them. Theres no way any of this stuff would make its way onto my iPod, as Im tediously earnest in my musical taste, but its still fun to dance to. It is, as ever, the choreography that makes Just Dance 2014. There are no motion-captured 3D models here  instead there are videos of real dancers, captured in all their vivacity and energy, inviting you to mirror their moves. It plays a clever psychological trick: because youre following the moves like youre looking in a mirror, it makes you feel like you might actually look like the professional dancer, even though what you actually look like (gifted dancers excluded) is a drunk person flailing at your TV in your living room, gut peeking ever so slightly over your trousers when you stretch your arms towards the ceiling. The routines  accessible, silly, and endearingly creative  regularly made me laugh out loud. Its the songs designed for two, three, or four that really shine. Theres a Ghostbusters routine where one of you is Slimer, a Ke$ha song that has one person riding around on the others back for a while, three-person choreography for Careless Whisper, an I Kissed a Girl routine that is sure to lead to some epic house-party awkwardness, and ludicrous alternate mash-up versions for several songs where the most outlandish moves and costumes dwell. Costumes include a giant panda suit, a hippo head with a little bowler hat perched on top, a Gundam robot vs. a cat-eared anime girl, Russian hats, bouncing wigs, gold chains, sheer dresses, awesome bodysuits, and smart waistcoats with skinny ties. In The Summertime features four dancers dressed as giant pieces of fruit. Its a party foul that some of the best stuff, including most of the On Stage choreography designed for three or four people, is hidden behind an unlock barrier; the more you dance, the more versions of songs you unlock, including Battle mode mashups. The On Stage versions are a particular reward  they cast one dancer as the star and the others as backing dancers, and provide a stage for particularly ostentatious dancers to shine. Theyre also brimming with sexual tension, an essential element of any classic party game from Truth or Dare to Twister. One evening of dancing with friends was enough to unlock most of what we wanted, but nothing bums out a party like Sorry, we cant play that one yet. The Just Sweat workout mode hasnt changed much since Just Dance 2, but the online features have gotten better and better. Theres a constantly rolling global dance-off called the World Dancefloor that you can join at anytime, dancing along with everyone else in the world to a pre-determined tracklist. Its good for alleviating the decision paralysis that comes with a track list this big, along with the Recommended suggestions that pop up on the menu screens. Just Dance 2014 has been out on Wii U, Wii, PS3 and Xbox 360 for a while already, and this version is functionally no different - the Xbox One version, which we'll be reviewing as soon as we can get it, offers six-person dances, but this PS4 version doesn't. You can dance with up to four using the PS4's camera or Move controllers, but using just the camera is not advisable. It took several songs before we figured out a good position for the camera that stopped it from losing track of us mid-dance, and even then it often confused two people for one person or switched players around, making the scoring completely irrelevant. With the Move, it works better, but I was really hoping we wouldn't have to mess around with peripherals. The camera's issues make this the worst of the Just Dance 2014 versions, along with the Xbox 360. Without something in your hands the relationship between what your body is doing and what Just Dance is telling you feels even more disconnected. This is a problem that Just Dance has always had: the relationship between what youre doing and how it scores you is pretty loose. It makes for enthusiasm and positioning, but its hardly precise. In all honesty, though, who on Earth cares? Just Dance is better at getting people and dancing than anything since alcohol, and my friends at least arent serious enough dancers to get twitchy about the scoring system. You could sit there on the couch and twitch the Wii remote if you wanted, but what would be the point? THE VERDICT It's disappointing that the PS4 version of Just Dance brings nothing new to the table, and that it doesn't work as well with just the camera as it does with the Move, but it's still a lot of fun.. Its wildly silly, creative and colourful, relying on daft, characterful choreography and to evoke a party atmosphere that puts everyone at ease. Theres not a lot here that wasnt in Just Dance 4, or even Just Dance 3, but the series talent for getting people up and dancing is still unmatched. Dancing is fun no matter what, but this game is a master facilitator of that fun, a catalyst for laughter. Pros Daft, accessible choreographyModern pop-heavy soundtrack Cons Not much newDoesn't work perfectly with just the cameraModern pop-heavy soundtrack It's disappointing that the PS4 version of Just Dance brings nothing new to the table, and that it doesn't work as well with just the camera as it does with the Move, but it's still a lot of fun.. Its wildly silly, creative and colourful, relying on daft, characterful choreography and to evoke a party atmosphere that puts everyone at ease. Theres not a lot here that wasnt in Just Dance 4, or even Just Dance 3, but the series talent for getting people up and dancing is still unmatched. Dancing is fun no matter what, but this game is a master facilitator of that fun, a catalyst for laughter.", "date": "Nov. 24, 2013,"}