{"name": "Dead Rising 3", "name_review": "Dead Rising 3 Review", "ref": "https://me.ign.com/en/dead-rising-3/73769/review/dead-rising-3-review", "text": "When I finally completed Dead Rising 3, the kill counter in the corner of my screen read 26,978. Also I was wearing a luchador mask for some reason. But anyway, thats a really big number. Its like killing one zombie per second for seven and a half hours, though I played far longer than that. The fact that Im still ready and willing to go for another round with a co-op buddy is a good sign that Dead Rising 3 is packing enough variety and goofy action to make it a good time. Notice that I didnt say it was pretty. Dead Rising 3 runs at an upscaled 720p resolution, it doesnt have amazing textures outside of its cinematics, and it suffers from regular framerate stutters and occasional walls that pop in after youve driven into them. It doesnt look a whole lot better than what youve probably played on Xbox 360 or PlayStation 3. Army of the Dead Instead, its big on quantity. I have never seen this many zombies on screen at once in any game. Up close, there are enough distinct character models that I didnt really feel like I was killing the same one 27,000 times, and I love the many ways in which they fall apart. You can chop them in half (horizontally or vertically!) blow off limbs and heads, and even take out chunks of torso. They put on quite a show. Theyre fun and easy to kill - easy enough that charging into the horde and bashing away with a sweet new weapon is a great way to build up experience. But youve got to know when to quit, because the zombie horde never will. Especially at night, when zombies are at their angriest, fear kicked in whenever I was stuck in the middle of a horde and my health dwindled into the red zone. But, since you can now save anywhere (unless youre playing in Nightmare mode) the worst part about dying in Dead Rising 3 isnt losing progress. Its finger-tapping your way through the 45-second loading times. Combat is a simple system of light and heavy attacks, but its the over-the-top animations and different effects of 300-plus weapons that really sustain it over the course of a 30-hour game. I never really got a chance to get sick of any one weapon, since they all break after a short period of use, and that forces you to mix it up. Getting to use something like the Freedom Bear automated machine gun turret takes effort, and that makes them feel special. I love how most of Dead Rising 3s collectibles are blueprints for crafting new weaponry instead of meaningless achievement padding. The recipes get positively goofy, like turning microwaves into laser beams, strapping a car battery to a mask of Street Fighters Blanka to create area-of-effect electricity attacks, and yes, turning a flashlight into a full-on lightsaber. Theres also a character upgrade system thats extensive and well done, with most options on the menu providing real benefits that you can feel right away instead of minor stat boosts. The Non-Zombies Whats weird about the story - or weirdest, I should say - is that main character Nick Ramos cant decide whether he knows hes in a zombie movie parody or not. One minute hes lamenting that he had to take human life, the next hes putting on a sombrero and turning a leaf blower into a gun that launches sex toys at lethal velocity. The inconsistency feels weird if you play it straight, but the big laughs come when you mess with his wardrobe and he attempts to be dramatic while wearing an afro wig and a miniskirt. Beyond that, its pretty much zombie cliche all the way (though in a parody that's kind of the point). Oh, and theres no timed hunt for Zombrex this time, but you do have to push the story along every so often or the town blows up. The acting is respectable, even with minor characters. Each companion has their own sidequest fetch job you have to do, like tracking down lost items or escorting them to a location, but along with their color commentary when theyre on your team, those background stories gives them great context and personality. There's Dwayne, the cop who wants access to the police station's armory, Kelsey, the country girl who needs help finding her family, Troy, the reformed gangster muscle who can't beat you so he joins you, and many more. I didn't even see a third of them, but all are fully voice acted. That character development makes it more memorable when you get them permanently killed. Fortunately, you dont have to babysit them too much - if you run from a fight, they'll generally run with you - and its hilarious to gear them all up with weapons and watch them go to work. But, after many hours of having fun with them, I decided I was better off finishing the campaign solo. Companions get in your way a lot, blocking doors, making items hard to pick up, and standing next to that zombie you're trying to bash. They won't turn on you if you accidentally hit them too many times like Dead Rising 2's companions, at least. The other notable characters are the Psychos, which are optional boss battles. They arent all that impressively designed, but they are the most interesting and grotesque villains, like an organ-harvesting doctor or a hideously obese woman in a Rascal scooter who murders anyone who gets close to her buffet. Post-Apocalypse Gridlock Dead Rising 3s open-world map is full of interesting and distinctively detailed locations to explore, including tons of shops, homes, tennis courts, a police station, and lots more. In places, it genuinely feels like a world hit by a sudden zombie outbreak. Its biggest problem, though, is that its not very large, especially when youre traveling by car, and it attempts to mask that issue by placing lots of roadblocks everywhere in order to lengthen your route. But the map is often either wrong about whether a route is drivable, or just tough to read. There's no line guiding you to your destination, either, and getting on and off of the freeway in the northern half of the map in particular is a nightmare. I had to spend way too much time in the map screen trying to figure out how to get where I was going, and even more trying to figure out where I went wrong. Everything works the same way in the drop-in co-op, except better because there are two of you. Ive already had some great moments, like when my partner plowed through a crowd of zombies in a van to save me when I got in too deep, and driving some of the craftable vehicles that come equipped with turrets. (Weirdly, you can't shoot out the passenger-side window of a regular car.) Im looking forward to playing a lot more of that. Dead Rising 3 doesnt get by on its looks, but its meaty zombie-slaying combat and nearly endless supply of undead and ridiculous weapons go a long way. Through its lengthy campaign, I was always eager to see what crazy zombie-squishing contraption would come along next. It rarely disappointed, except when navigating its snarled map and waiting out its load times took me out of the fight took too long. Pros Tons of zombiesGreat weaponsFun co-op Cons Twisted map Dead Rising 3 on PC is as expected: the same great game it is on Xbox One, but prettier. On the other side of that coin, it includes the same issues with the map design feeling maze-like and confusing, but no other game does huge hordes of zombies quite like this one.", "date": "Nov. 18, 2013,"}