{"name": "Fights in Tight Spaces", "name_review": "Fights in Tight Spaces Review", "ref": "https://me.ign.com/en/fights-in-tight-spaces/192206/review/fights-in-tight-spaces-review", "text": "If you both play action games and have seen the movie Kingsman: The Secret Service, it's a scientific fact that youve fantasized about playing a game where you systematically dispatch gaggles of enemies in stylish fashion. Then again, the game in your head probably didnt look like Fights in Tight Spaces. Yet despite its deck-building and turn-based mechanics, you may have a hard time finding a better game that captures the moment-to-moment threat assessment and problem-solving aspects that make the best cinematic fight scenes so thrilling.As Agent 11, top dirt-doer for a high stakes espionage firm, you're tasked with infiltrating and eliminating international gangs by any means necessary. Youll do this by moving from one end of a big map themed like one of six criminal organizations to the other, stopping at points along the way that represent different kinds of encounters. That could be things like an underwhelming narrative scenario that ends in making banal decisions with a slight chance of reward, a scarce but always welcome medical pit stop, or (most frequently) a small diorama of a room where the beatings happen. How you dish out punishment depends on the starter deck you choose before embarking on your journey. Each one represents a different fighting style, like one focused heavily on counter attacking, or an aggressive style of flashy, high risk/reward techniques. These do a good job at getting you started with identifiably varied strategies. Unfortunately, most of them are locked behind progression, meaning if you dont like the styles available, youll just have to suffer through it until you gain enough experience points to hopefully unlock something you might dig more. This was a real gut punch for me, because I didnt manage to find a style I truly loved until several hours in.As you progress from battle to battle, youll be able to select and add new cards to your deck, each of which come from a total pool of unlocked cards that are not restricted to any particular style  things like spinning kicks or crafty movement tricks. Secondary objectives also offer smaller rewards that can sometimes include big cash bonuses or health upgrades. Beating zone bosses grants a more substantial upgrade to your abilities that can really up your game. Those range from a ramping bonus to damage every few rounds to upping my total combo pool, and I found that I really came to rely on these boons around the endgame missions. Unfortunately that meant I would sorely miss them any time I used the option to skip earlier missions and get straight to the last one I died on. This makes starting from the beginning on each run both a no brainer and a bit of a bummer.Spending your momentum wisely and to its fullest is ideal.Battles themselves are meticulous, with a lot of moving parts to keep track of. Your hand of cards is dealt and discarded every turn, so spending your momentum wisely and to its fullest is ideal. Every successful attack ticks up your combo meter, which can passively boost the effectiveness of offensive cards, or act as a cost to play certain cards in and of itself. Even though enemy actions are transparent, their numbers and the randomness of card battling can often put you in a pickle outside of your control. Thankfully, this rarely feels completely unfair, but knowing that the grind can unlock cards in the future that are just objectively better than the ones you have available to you now does spoil some of the fun at times.The enemies you'll be pummeling are varied, each usually having one signature action that is easy to avoid by itself. But as their quantity and variety increase, maps start to resemble minefields of targeting icons that can be a true test to navigate. Each stage has its own factions worth of minions to clobber, and repetition makes learning their capabilities and anticipating their attacks feel more and more like second nature. Things get undeniably tough towards the end, but Fights in Tight Spaces' unconventional difficulty options can ease that pain somewhat. It doesn't change the enemy compositions or health and damage totals, but it does add some deck-altering quirks that can guarantee you draw certain useful cards. The difference between the Casual and Casual Plus modes can almost feel like different games too, as being able to take back bad turns or retry failed missions can dramatically affect your chances at succeeding on a run. The turn-based tactics part of battle, where positioning and thinking ahead are paramount, feels most rewarding when you use obstacles like walls to tack on extra damage, or make enemies hit each other with their attacks. On some stages, you can straight up kick enemies over ledges or out of windows to eliminate them instantly. Every turn feels like a tense push and pull between the options in your hand, your place in a room, and the bad guys who need their faces punched. When its working at its best and you're slipping in attacks effortlessly and trapping gangsters in corners, dribbling them against the wall like basketballs, Fights in Tight Spaces creates the same sort of transcendent flow state that the a long combat chains in action games are famous for. This largely makes up for the only moderate synergy I found between cards on the whole. There are definitely hands where you play a card in front of another to power it up, or special attacks that do bonus damage to enemies that youve previously put a debuff on. But I did occasionally miss the opportunity for the overwhelming super turns that other staples of this genre can be known for. Visually, this game is quite a striking take on the elegant black and white with splashes of color motif. The nebulous shapes in the white void of the background approximate walls and fixtures just enough to be representative but not distracting. Foes are color-coded and have just enough unique detail that youll never get two mixed up. The combat animations are a bit stilted, understandably, but I enjoyed the wide range of iconic martial arts references they invoked. Replay mode also cleverly allows you to watch your whole match without the HUD, doing its best to make your tactical dance feel more like a movie clip, though with largely middling results as the choppy animations are more distracting without all the gameplay in between breaking up all the action. Against popular thinking, the slower, methodical pace of Fights in Tight Spaces recreates that feeling of systematically dismantling a room full of goons that all the best action movies present so well, and that video games often struggle to properly simulate. The blend of tactical movement and positioning adds depth where the fairly limited deck synergy lacks it. And while the overarching progression can feel like an arduous grind at times, the compelling pugilistic dance in each isolated skirmish stays rewarding from the very first punch.", "date": "Dec. 4, 2021,"}