{"name": "dishonored", "name_review": "Dishonored: The Brigmore Witches DLC Review", "ref": "https://me.ign.com/en/dishonored/70466/review/dishonored-the-brigmore-witches-dlc-review", "text": "Theres nothing quite as dull as a hero whos as pure as the driven snow; conversely, the best villains have qualities that we can admire, or flashes of humanity we can identify with. Thats the main strength of The Brigmore Witches (the second half of the DLC-based story begun in The Knife of Dunwall): its centered around Daud, the mercenary assassin who murdered the Empress in the opening minutes of Dishonoreds story. Its a neat concept that sheds light on his internal struggle and the events leading up to his inevitable  and possibly fatal  confrontation with Corvo Attano. Now, exploring a villainous figure like Daud and giving him a little more substance is all well and good if you actually manage to do that. In The Knife of Dunwall, Daud felt like a bit of a nothing character. We were told he was conflicted, but those missions lacked any clear purpose, with only enigmatic clues around the name Delilah driving the story. It was very much setting the scene, with no real payoff. Why, why, why, Delilah? The Brigmore Witches is that payoff. We get a better sense that Dauds motivation is actually noble on some level, and while its up to you whether the path to his goal will be littered with corpses or entirely bloodless, theres a clear direction here. You have a target  Delilah  and you know where she is. You just have to get there. That task takes up two thirds of The Brigmore Witches, and from a story point of view its largely busywork. The short of it? Daud needs a smuggler with a boat to get to Brigmore Manor. Said smuggler is in jail. Daud breaks her out, only to find a rival gang has stolen a vital MacGuffin from the boat. He goes to get this back, which leads to fetching some stuff for them. You get the idea. Its an excuse for the action, which doesnt push much beyond tried-and-true Dishonored game design. The jail setting, for instance, is a return to Coldridge Prison (where Corvo was imprisoned after the death of the Empress) and is quite a confined design, with only a handful of interconnected areas. Playing cat and mouse across the multiple levels of the cell blocks is good fun, but holds few surprises. About the biggest variable in this mission is the ability to impersonate an Overseer and stroll in the front door if you so choose. The second mission, on the other hand, spans dockyards, factories, city streets and sewers, but is essentially a series of fetch quests, whether you deal with the rival gangs that occupy the neighbourhood through diplomacy or explosive violence. Even so, its dense with secrets and collectables, and Dauds actions can have a profound effect on how it all plays out. The Hatters. No idea where that name came from. The mission structure may not push the envelope, but the moment-to-moment gameplay really shines. Daud is very much in the same mould as Corvo, but with a few tricks of his own. The ability to summon assassins (introduced in The Knife of Dunwall) is one, while this set of missions introduces a couple of new tools and abilities. Shaping Dauds abilities to suit your play style is absolutely one of the main draws here, and it was refreshing to be able to use completely different sets of powers and weapons in my stealth playthrough versus my kill em all and let God sort em out run. Theres a new power called Pull, which, as you might expect, is a form of telekinesis. You can use it to nab items from a distance, or  more interestingly  reel in guards then choke them out or kill them. Two new gadgets offer up cool non-lethal options, too: stun mines function much like arc mines  storing two or three charges with which they can zap enemies  but instead of vaporising your foes, enemies are merely knocked out. Baffle Dust, on the other hand, is an upgrade for Choke Dust, leaving targets disorientated for a period of time. The Bone Charm system  perks that can be equipped to further augment your abilities  has been bulked out a little too. The Brigmore Witches introduces Corrupted Charms, which have both a positive and negative effect. To be honest, given how many normal Bone Charms there are  which have no downside  these werent all that compelling an addition. Even so, theres plenty of depth in general and plenty of room for individual expression. The hounds of Brigmore Manor. The quest culminates in a tense final mission at Brigmore Manor, where youre exploring a dilapidated mansion and facing off against powerful witches and undead hounds. The conclusion, however, is a little uneven. Delilahs story is appropriately sinister, giving us further insight into this corrupt and power-obsessed world, but I cant help but be disappointed with how Dauds confrontation with Corvo is handled. Instead of using your Dishonored save game  and the choice you made as Corvo  it instead judges Daud on his actions in the DLC, making it sort of an alternate reality. Surely we should have to live with our original actions as Corvo? In such a dark world, it would have been entirely fitting for us to be at the whim of Corvo  not to be judged on our actions but on our version of Corvos entirely independent choice of moral code, or lack thereof, and response to knowing only his side of the story. Imagine playing through Dauds story and not harming a soul, only to be summarily executed? Or how about being spared despite cutting a bloody swathe across Dunwall? For a character like Daud, who embarks on a redemptive path after years of amoral slaughter, surely his fate should be beyond his control? THE VERDICT The Brigmore Witches doesnt break much new ground, but the stealth-or-slaughter gameplay is as compelling as ever, as is exploring each new playground. Daud also grows into his role, with a clearer sense of purpose and momentum that helps drive the story forward. While the final confrontation with Corvo is a little disappointing, Delilahs story is excellent and adds another facet to Dishonoreds original tale.", "date": "Aug. 14, 2013,"}