{"name": "Omerta: City of Gangsters", "name_review": "Omerta: City of Gangsters Review", "ref": "https://me.ign.com/en/omerta-city-of-gangsters-134706/64000/review/omerta-city-of-gangsters-review", "text": "There's already a good game out there that focuses on making a fortune off of properties in early 20th century Atlantic City--it's called Monopoly. In theory, at least, Omerta: City of Gangsters isn't too different from the Parker Brothers favorite. Both games have you buying and upgrading houses along Baltic Avenue and the Boardwalk, both feature cutthroat territorial acquisitions, and at times both at least present the threat of spending some time in jail. Toss in a few gangsters, some XCOM-styled turn-based combat, and some smart capitalizing on the current popularity of Boardwalk Empire, and you'd think you'd have a moxie-stuffed contender that'd let us find out what Uncle Pennybags could have accomplished with a Tommy gun. The problem is that Omerta plays like a gangster's dream. Not a nightmare, mind you, stuffed with traitorous consiglieri and rival gangs gobbling up territory, but a dreamworld where cops forgive shootouts on the scale of the Saint Valentine's Day Massacre for a stack of chump change. It's so easy it's like playing Monopoly with yourself. Nice presentation, but the gameplay isn't as impressive. It takes a while for this feeling to settle in. Omerta starts out promisingly enough, casting you in the role of a young Sicilian ~fresh off the boat~ (who nevertheless sounds better acquainted with Brooklyn than Palermo), and it hints at RPG depth in the way it determines your stats and weaponry through a series of questions. Did you have to leave Sicily because you slept with a Don's wife? Somehow that flash of genius nets you +1 to Cunning and +1 to Smarts. Use a knife in a fight over a Sicilian girl? Congratulations, you can use it to slice someone on Illinois Avenue. It's a shame, then, that all these numbers end up having as much significance as the sham pizza joints you open later. In my entire playthrough I never once felt as though I would have been better off if I'd put my points elsewhere. The story itself, like watered down whisky, loses its kick. One would think the city itself would hog the spotlight in a game like this, but Omerta's Atlantic City enjoys none of the subtle relationships between buildings that made Haemimont's Tropico games so enjoyable. Each mission plays much the same: upgrade your hideout for increased production, open ~premises~ such as breweries to enable production, open ~joints~ such as speakeasies to sell your goods and wait for the cash to roll in. Setting up a bookie parlor in the same mission where youve built a boxing arena constitutes one of Omerta's few concessions to management strategy; for most of the game, you can open joints wherever you feel like it and watch the cash roll in. The constable with the cold relations will never get suspicious of all the people visiting the hidden speakeasy next to his house, and because theres no risk involved in transporting goods, you can place your distillery on the complete other side of town from your speakeasy. In time, you wonder why you're bothering at all. Once you're done with a mission, your cash vanishes and you start over from scratch in the next one. It's not as though a rival gang's going to move in and steal your breweries as you expand your empire, and the absence of this threat robs the 1920s gangster scene of its romanticism. Your earnings from ~dirty~ money and ~clean~ money dont really mean anything; Omerta makes it so easy to launder money that the only reason to pursue clean money is the forced satisfaction of roleplay. Money pours from your speakeasies and bookies like beer from a broken keg, slowing only when you pay your henchmen's meager salaries or when you speed up missions by buying alcohol and firearms to sell to a gallery of racial stereotypes all over town. And if your ~heat~ bar fills and the police launch an investigation? No worries; just slide them $500 and they'll turn away and reset the heat bar every time. The whole concept screams of missed opportunities. Your actions rarely if ever alter the landscape of Atlantic City, stripping the strategy portion of Omerta of one of the chief attractions of a game like Tropico. You spend a good deal of time playing mobsters with manners in order to make local celebrities and lawmen ~warm~ to you, as well as liquoring up informants so they'll let you know about opportunities for new joints or premises in the area. It's a realistic concept, but it serves little more purpose than accelerating the already speedy cash flow. Even then, you'll spend plenty of time waiting as your band of six henchmen have to jog to every new objective while the denizens of Atlantic City speed past in cars. The turn-based tactical battles represent a step up in immersion, but not execution. It may be fun to watch your little gang of thugs rid local warehouses of their Ku Klux Klan infestations, but it's annoying to plan out stealthy routes for your gangsters armed with knives and brass knuckles only to find that the pathing system left them standing right in the path of a Grand Wizard's shotgun blast. The baffling AI sometimes refrains from finishing off one of your goons to attack someone else on the other side of the room. Cover opportunities abound, but often spots that seem like they'd leave you exposed offer the best cover while standing behind a wall sometimes results in your perp going the way of Bonnie and Clyde. One of Omerta's greatest failings, indeed, is that cash flows so easily that you'll sometimes find yourself paying a fee to avoid the combat (or else auto resolving it), which goes against everything a good gangster game should stand for. Gangster warfare should be interesting. In Omerta, it's not. What a pity, then, that the multiplayer mode focuses exclusively on this aspect of Omerta. The ability to play cooperatively in two of the four missions sometimes achieves the semblance of genuine fun, but the idea that Omerta would have fared better with a multiplayer turf war on the strategy map always looms (again, think Monopoly with Tommy guns.) To call the sandbox mode a disappointment is bit like saying Bugs Moran was irritable; it confines you to the small neighborhood maps of the missions and quickly devolves into watching your money pile up. But though Omerta's gameplay succeeds about as well as Al Capone's attempts at tax evasion, its presentation fares much better. Early jazz reminiscent of the best work of King Oliver and the Original Dixieland Jazz Band plays through every stage, and when rain falls on the rooftops at Atlantic City by night, Omerta achieves a fleeting sense of beauty. In all fairness, a lot of people might find this mix of lightweight city maintenance and top-down combat entertaining in small doses, and it's true that Omerta's consciously hackneyed voice acting and predictable story exudes some charm. It may be a disappointment, but it's a polished disappointment. Still, most games in this vein exist solely on Facebook, where titles like The Last Stand: Dead Zone provide a mildly similar experience for free. In such a light, Haemimont's asking price of $40 seems aimed at recreating the absurd prices Prohibition-era Americans had to put down for a swig of ale. THE VERDICT Omerta's mix of management simulation and top-down turn-based combat in the style of XCOM brims with potential but it suffers from an almost total absence of risk or failure even on the hardest difficulty. There's charm and a good soundtrack in store here, but it quickly loses its appeal amid gameplay that never stops feeling as though you're working your way through a tutorial. At $40, that makes for an offer you should have no trouble refusing.", "date": "Feb. 7, 2013,"}