{"name": "Borderlands 2", "name_review": "Borderlands 2: Sir Hammerlock's Big Game Hunt Review", "ref": "https://me.ign.com/en/borderlands-2/63292/review/borderlands-2-sir-hammerlocks-big-game-hunt-review", "text": "How far can an expansion to a great game fall? It's a tough question, and one that Sir Hammerlock's Big Game Hunt, the latest DLC add-on for Borderlands 2, had me asking early, and often. After all, it still has the same, sound shoot-and-loot mechanics from the main game, along with plenty of new enemies to take aim at. How different can it really feel? The answer is a lot, and in this case different doesn't mean better. Big Game Hunt manages to stay just enjoyable enough to get a pass, but it's still easily the weakest add-on Gearbox has put on the table for Borderlands 2 thus far. The setup for Big Game Hunt brims with opportunity. Sir Hammerlock, the bionic-armed gentleman hunter from the main campaign, has invited you out to his cabin in the savage lands of Aegrus for a quiet weekend of hunting and hijinks  you know, like tracking and fighting tons of huge, unique monsters for loot, honor, and the Borderlands way. Sadly, what it turns out to be is a short, uninspired quest line to take down yet another self-proclaimed evil genius. Enter Professor Nakayama, a one-dimensional new villain whose only discernible trait is that he's obsessed with the late Handsome Jack, a trait hammered home ad nauseum from start to finish with tepid writing that falls well short of the Borderlands norm. Sir Hammerlock gets similar treatment, with repeated attempts to squeeze laughs out of how much of a gentleman he is, and to little effect. After Mr. Torgue's Campaign of Carnage nailed the comedy, Big Game Hunt feels like a step back. More so than the usual monsters, the main quest here focuses the fighting on tribal savages, Nakayama's followers who share his...enthusiasmfor Handsome Jack. Despite enemies sporting an interesting assortment of never-before-seen abilities, these fights can become grueling slogs thanks almost entirely to one particular new enemy type: the witch doctor. It would be irritating enough if these nuisances only healed themselves and every enemy within a football field sized radius in the blink of an eye -- but they've also got a metric ton of hit points, as well as a slew of other skills that make them an absolute pain. Their voodoo masks make them immune to headshots, they randomly deflect or avoid melee attacks (even Zero's action skill), and their powerful elemental attacks give them one-shot killing potential if you aren't geared well enough. To top it all off, witch doctors can cast a spell that upgrades nearby allies into badass, super badass or ultimate badass ranks. This new foe is challenging, sure, but more importantly hes exhausting to the point youre better off saving time and ammunition by running away. Fortunately, the other enemy types are generally more fun to fight, but some still seem like a lot of risk for little reward. Unless you really put yourself in harms way to land criticals, spiders and giant flying spores absorb inordinate amounts of punishment. Oddly, the big game creatures the title refers to are far less threatening, going down relatively easily once you've discerned their patterns. Personally, I would have preferred more varied and challenging unique creatures to getting crushed by common ones. In both scope and ambition, Big Game Hunt never fully lives up to its name. THE VERDICT Make no mistake, Big Game Hunt is still Borderlands 2. Combat is still satisfying, as is finding that next gear upgrade. Anyone who found the core gameplay enjoyable before will most likely find it enjoyable here, and a new raid boss offers completionists yet another feather to put in their cap. But in terms of story, dialogue, and encounter design, this add-on pales in comparison to the rest of Borderlands 2. It's like the worst episode of a show you love -- it isn't quite bad, but knowing how good it can be makes it hard to get excited over. PS: Increase the level cap already! Borderlands 2 preserves the best parts of the franchise while also making numerous, much needed improvements to areas like narrative and class skill design. Additional visual customization options would make it better, and the occasional technical issue takes away from the experience, but overall this is an excellent shooter no one even remotely curious should overlook. Prepare to level. Prepare to loot. Prepare to get lost in the hilarious, bizarre and wonderful world of Pandora.", "date": "Jan. 15, 2013,"}