{"name": "Silent Hill: Book of Memories", "name_review": "Silent Hill: Book of Memories Review", "ref": "https://me.ign.com/en/silent-hill-book-of-memories/62322/review/silent-hill-book-of-memories-review", "text": "Silent Hill: Book of Memories isn't a good game, but it's one I keep coming back and playing. While we were tantalized with the Diablo-like gameplay of Warrior's Lair (a crossplay dungeon crawler) before the PlayStation Vita launched, the game formerly known as Ruin hasn't been seen or heard from in months. Development hell, they call it. Now, Silent Hill is here to fill that void, but it does so without any style or polish. Book of Memories is nothing like the Silent Hill games that have come before. This isn't a tense, single-player adventure. Rather, Book of Memories is a multiplayer dungeon crawler. You pick a character and go through level after level of nurses, butchers and creepy crawlers while hacking and slashing. You aren't trying to run from the things that go bump in the night; you're trying to run through them and collect their loot. For lots of people, this is blasphemy, but for me, it's the setup I've been looking for. I have no attachment to the Silent Hill franchise, and I've been craving a deep RPG-like experience on Sony's handheld. In some ways, Book of Memories delivers that, and in others, it's a total mess. Let's talk about the good stuff. You can jump into the game and immediately start marching toward the level cap. Enemies get in your way, and you beat them to death. Turn on your flashlight, and you can see desks and cabinets that you can loot for keys, weapons and Memory Residue (which looks like piles of gold and can be exchanged for items). As you level up, you begin finding and equipping artifacts that augment your stats and get rewarded with special weapons like giant cleavers and fire swords. As you get deeper into the game, Karma Abilities become more important and allow you to sap the health of bad guys using the rear touch screen and so on. This is the kind of setup that nerdom is based on, and it can hook you in Silent Hill: Book of Memories. The desire to level your character, discover all of the map, and fill out the weapons portfolio -- it's engaging enough to keep you fooling around with the game. All of this is really simple stuff, so don't expect the in-depth workings of your favorite RPG, but it has the Diablo feel, and that's a proven formula. Book of Memories is a good time sink. The levels aren't vast, so a 15-minute train ride ends with results. The combat isn't hard for the most part, so the game can be a distraction while you do other things. If you just want to chase XP and wail on stuff, Silent Hill: Book of Memories fits the bill, but you're never so into the experience that the many shortcomings of Book of Memories don't stand out. For starters, the story is utter nonsense and poorly presented. This book is delivered to your character on his or her birthday, and if they write in it, go to sleep, and beat the nightmare dungeon before them, whatever written in the book comes true. This is presented by some poorly done cutscenes and broken up in-level clues. It never works, and I was never too sure what I was fighting for. For as much as the gameplay speaks to the leveling geek in all of us, Book of Memories never takes those mechanics anywhere memorable. Levels are broken up into different sets that each have their own vibe, but they all feel the same due to the same enemies showing up and none of the areas look all that good. Lovely. Then, there are a bunch of presentation problems. Although you're earning XP and leveling up, that meter is buried in the menu; you never have the satisfaction of seeing your bar 'ding' in the heat of battle. Load times are noticeably long. All the menus look subpar and cluttered. The menu's touch-only interface is cumbersome, and why they hid 'quit' on options is beyond me. Now, I don't know if I would've mentioned the 'quit' button if Silent Hill: Book of Memories didn't totally screw up its multiplayer. The idea of leveling my character and having a friend help me along the way is great, but not in this game. There's no drop-in/drop-out co-op option in Book of Memories, and when you quit out of a multiplayer match or a single-player game, you'll lose your progress in a given level. If I was cruising through a level and got stuck at a boss, you couldn't just jump in and help me. I'd have to quit out, start multiplayer and then work my way back to that point with you. It's a silly oversight that neuters one of the coolest ideas of Silent Hill: Book of Memories. If you have dedicated friends and want to make appointments, you can still have a good time playing online or via ad-hoc multiplayer, but make sure you've beaten whatever level you're on before trying to start a co-op match. THE VERDICT So here's the easiest way to sum up Silent Hill: Book of Memories: it mixes solid but underwhelming gameplay with a lackluster presentation. If you just want dungeons to crawl through and couldn't care less about polished menus and engaging stories, great. Everyone else, don't feel bad if you skip Silent Hill: Book of Memories.", "date": "Nov. 21, 2012,"}