{"name": "Disney Epic Mickey 2: The Power of Two", "name_review": "Disney Epic Mickey 2: The Power of Two Review", "ref": "https://me.ign.com/en/disney-epic-mickey-2-the-power-of-two/62003/review/disney-epic-mickey-2-the-power-of-two-review", "text": "Disney Epic Mickey 2: The Power of Two tries to be many things. Its a co-op game. Its a musical. Its a platformer with elements of choice and consequence. Its a lovingly crafted homage to the Disney of yesteryear and its iconic theme parks. Junction Point Studios has also tried to address many of the complaints directed at the original Epic Mickey. The troublesome camera has been tinkered with, previously mute characters speak, and the games RPG elements have been dragged into the foreground. Everything about this game screams of a determination to get Disney Interactive Studios great black and white hope right this time. But the weight of Junction Points ambition has resulted in a game that buckles at the knees. While Epic Mickey 2 retains the Disney charm so lovingly injected by designer Warren Spector, its nostalgic heart is its high point. Visually, Epic Mickey 2 is a gift to be savored. Practically, its plagued with issues. Epic Mickey 2 returns us once again to the Wasteland, the sprawling home to rejected or long forgotten toons from Disneys considerable back-catalogue. Never a place to relax for long, Wasteland is now plagued by earthquakes, returning it to a pile of rubble and sputtering machinery. The newly-reformed Mad Doctor calls for a hero, a magical television is built, and voila! Mickey Mouse is again on a repair mission, armed with his trusty paintbrush that enables him to paint or thin out parts of his environment. This time, hes got a permanent partner in Oswald the Lucky Rabbit; the more charming of the two by the width of a detachable arm. The game is again a journey of discovery through a world built from discarded Disney memorabilia and broken down animatronics, a heaving, twitching place that should be a delight to nosy around in for the Disney enthusiast. References to Disney properties are everywhere, from old favorites like Petes Dragon to modern classics like The Nightmare Before Christmas. Its a particular joy stumbling across a visual nod to a film or dusty old short you forgot the moment you hit puberty. Spectors peculiar combination of cold mechanics and warm Disney familiarity returns, and when it works, it sings: a door that requires you to pull a wooden Snow White and Prince Charming into an embrace is the sort of touch that lingers, as is a complex mechanical system activated by characters from Disneylands Main Street Parade. The aesthetic is most endearing when Mickey and Oswald are traversing across 2D landscapes, which lean heavily towards the abstract. These transitional sections - Frankenstein's Monster versions of classic Disney shorts - are the most visually arresting of Epic Mickey 2s playable areas. You push, I pull. Theres pleasure to be found in Epic Mickey 2s cut-scenes, too. Lightning has struck twice for Powerhouse Studio, the outsourced animation team reunited to create Epic Mickey 2s retro-flavored 2D cut-scenes. These are a stunning visual highlight, Powerhouse capturing a characters bemusement or glee with just a raise of a squiggle or a slight shift of a black dot. The team has done well to create animations that retain Spectors mad vision while feeling distinctively old-school. There are a couple of immediately obvious new additions to the formula. Characters now have voices, adding refreshing personality to fan favorites, and theres the occasional musical number. Strangely, these songs  all led with goofball gusto by the Mad Doctor - are too sporadic to leave a lasting impression. For all the talk of Epic Mickey 2s Broadway-style ambitions, theyre a nice but inessential touch. Like its predecessor, Epic Mickey 2s score is excellent, a haunting mixture of childrens choruses, sweeping orchestra and throwbacks to tunes of yesteryear. Although it wont play at the forefront of your consciousness, the music subtly changes based on your decisions throughout the game. At least to the ear, Epic Mickey 2 does a good job at making you feel like youre playing something much grander than a passable platformer. Running from the past... Because for all its ambition, Epic Mickey 2 has failed to get some very basic features right. While simplistic minute-to-minute gameplay is forgivable  this is a kids game, after all  Mickeys central objectives eventually grow repetitive and tiresome. The slog of reviving dead machines over the course of 20 hours is exacerbated by audio cues that remind you of your task-at-hand in a never-ending loop (I guarantee youll end up wanting to throttle your gremlin compadre.) In a universe as rich as Disneys, collecting missing pumps and inserting batteries into sockets leaves you yearning for something a little less pedestrian. The addition of two new types of ink  invisible and indelible  mixes the gameplay up somewhat, but rarely do they prove essential in any given objective. It would have been refreshing to have seen these used more frequently throughout the campaign, or indeed, more creatively; a combination of an indelible Mickey and an invisible Oswald would have made for an interesting dynamic, and sections requiring a slightly more demanding use of stealth would have added some needed tension. Perhaps most frustrating in the list of the games missteps is the return of that wonky camera that so plagued the original. The player can manually manipulate Epic Mickey 2s camera, but it always wants to return to a position that sits too low. This is chiefly problematic when trying to pull focus in battle, and bosses, who loom over Mickey and Oswald, take a particularly long time to defeat. The problem is worsened when combined with Epic Mickey 2s slippery surfaces; trying to judge distances in more delicate platforming sections often leads to wild leaps of faith and untimely death. For this reason, motion control is recommended - aiming with a PlayStation Move controller feels more intuitive, and the ability to target accurately will ease a part of the struggle. These issues arent offset by the much hyped choice and consequence that forms the backbone of Epic Mickey 2. Sometimes its clear why youre being punished for an action  you deliberately took the easy route, or destroyed too many enemies  but frequently your behavior feels arbitrarily judged. Perhaps you accidentally set an enemy free from a cage, or thinned a piece of machinery that apparently you shouldnt have. Its an oddly muddy system, which only makes sense if pointed out. To the developers credit, there are indeed consequences to your actions, although only rarely will these affect you in any palpable way. Perhaps youll cast a fleeting glance at a section thats sealed off, or raise an eyebrow when a character obstinately declares he wont help you for the rest of your campaign. But, at the 19-hour mark, you wont angst over your missed opportunities too much. And, by games end, any repercussions cease to matter. Mickey must prevail, after all. This focus on the journey of Epic Mickey 2 is also a focus on re-playability, but what with Epic Mickeys epic length and its uninspired gameplay, only the most die-hard Disney fanatics will likely play through again. If you want to get the most out of Epic Mickey 2, youd best deviate from the main path altogether, and explore its nooks, crannies and charming side-quests, of which there are many. For this, you need a human co-op partner. As a split-screen game, Epic Mickey 2 is kicked into life, opening itself up to much more intuitive exploration. Oswald is a satisfying character to control, too, his ear-propeller skill versatile in frequently vertical level design. The A.I-controlled Oswald, on the other hand, is infuriatingly inconsistent, occasionally disappearing for entire sections, or yelling out his acknowledgements of your commands - ~I got it!~ ~I know how to do this!~ - while remaining stationary. Hes able to fumble his way through the game for the most part, but leaves you wishing for a proper, communicative partner. While Epic Mickey 2s co-operative battling and platforming is simplistic  Oswald zaps and flies while Mickey paints and jumps  it begs for a little human finesse. THE VERDICT Ultimately, there is a feeling here of missed opportunity. Junction Point Studios tried hard to revolutionize the wheel, but Disney Epic Mickey 2: The Power of Two leaves you wishing the developer had refined the mechanics of the original before embarking on its more intrepid endeavors. The game still delivers on the charm and occasionally hits some truly inspired highs, but fundamental issues hold it back from ever getting within sight of its goals. If youre a Disney fan, theres still much joy to be gleaned out of Epic Mickey 2, but those expecting anything outside of its nostalgic heart should, sadly, look elsewhere.", "date": "Nov. 18, 2012,"}