{"name": "Scribblenauts Unlimited", "name_review": "Scribblenauts Wii U Review", "ref": "https://me.ign.com/en/scribblenauts-unlimited/62000/review/scribblenauts-wii-u-review", "text": "A witch asked me to help her stop two pesky children from eating her house so I made it rotten and they ran away in disgust. An arsonist pleaded with me in desperation as his crippling penchant for destruction was ruining the world around him, so I gave him a therapist and they talked until he put his bad habits to rest. A lowly street peddler wept at his inability to make his way in the cold world around him so I introduced him to a teacher who taught him skills and inspired him to enter a life of gainful employment. A giant human heart began attacking a group of unsuspecting people so I threw some aspirin at it since thats a great way to prevent those types of things from happening in real life, I suppose. In a few short breaths Im a social worker, a baker, a doctor, a warrior, a savior of cities, and an inspirer of worlds. Flowers grow, birds flutter overhead, and newly remodeled buildings shimmer as jubilant citizens surround it with glee. And then I unleashed a giant Minotaur holding a chainsaw upon them all, because f*ck it. Scribblenauts Unlimited might be gamings greatest toy box. Its Super Mario Paint meets Grand Theft Auto and whatever else your warped little mind decides to splash across its blank canvases at any given instant. Its a driven collection of hundreds of puzzles set in a sprawling open world spanning dozens of themes. Its a game where nearly every single word you tap out on the Wii Us touch screen becomes an object you can interact with on the fly. And its a wonderful little bundle of joy. The premise here is roughly the same elevator pitch we got back in 2009 with the original Scribblenauts, just with a bounty of added control tweaks and minor nuances added to smooth out the process. Type a word and a cartoon representation of that word appears on screen as something you can interact with. Add an attribute to that word and you can interact with it further. A character asks for a friend. You give him a gorilla. Or a giant gorilla. Or a dead gorilla, if youre feeling morbid. Voila. A Mario World inspired overworld connects lots of little puzzle hubs, meaning you can hop around and tackle everything the game has to offer instead of being trapped in the linearity of the finish a puzzle to start the next sequential progression of the last few Scribblenauts titles. And aside from a few small snags, it works very well. Old Scribblenauts standbys still seem to rule over anything much more elaborate that your brain may conjure, though. A sleeping pill will incapacitate any man or animal that needs to be put down without death. A black hole does a better job at clearing away waste than a broom ever could. And invoking a deadly cartoon laser gun battle between God and Satan on a total whim never gets old. All in all the puzzles feel a bit easier and simpler this go around. But its the rapid fire nature in which Unlimited presents each challenge (and the myriad ways to solve them) that really sets the experience apart from its previous iterations. Coupled with the nearly infinite combination of pretty much every non-nude, non-alcoholic and non-licensed noun you can summon and Unlimited nearly lives up to its name. Reunited. Its ironically in the few licensed characters in Scribblenauts where things are actually much more limited than they should be, however. Nintendo handed developer 5th Cell the rights to a select few characters and items from the much-cherished Mario and Zelda franchises, and the results are equally brilliant and frustrating. On one hand, dropping Luigi and Windwakers Ganondorf into a pit with Cthulhu, a sheep and half a dozen zombies just to see what happens is a crazy thing to say that you legally created in an officially sanctioned video game sold in stores. Feeding Mario a Super Mushroom makes him double in size. Giving Link an Ocarina makes him call upon Epona. Summoning both Sheik and Zelda always makes one of them vanish. And yes, you can kill a chimpanzee with a Master Sword. Stop asking. But the ability to edit and customize objects and characters  something you can do with literally every other item in the game  is locked out of being possible for Nintendos branded characters. You wont see any Yoshis with gigantic heads, cyborg legs and sharks for arms like you can with the non-licensed characters in Scribblenauts. Same goes for adding adjectives to the Big Ns canon. You cant, which means no Chocolate Zelda or Bacteriologic Peach, sadly. It feels strange to run into licensing walls in what really boils to a God game, as innocuous as it may appear on its surface. Protect ya neck. Seeing Scribblenauts play out on a massive television is analluring if not completely dismissible experience. Youll want to marvel at how pretty this game is in high definition but the reality is that youll spend most of your time hunched over the Wii Us GamePad, tapping characters and words with the stylus with barely a reason to ever look up from it. Your TV here only replicates the exact experience happening on the smaller screen so be prepared to get comfy with the GamePad here. As excited as I was to see things jump to high definition, Scribblenauts started as a handheld game and Unlimited does more to extend that experience rather than separate itself from it. THE VERDICT In some ways, Scribblenauts Unlimited is still running on the same awe-inspiring gimmicks the series introduced in 2009 but with the level of polish and refinement here, its finally delivering on all fronts. Despite some dips in overall puzzle difficulty this time around, the game has a massive amount of content to both discover and create from scratch. If youve skipped the series until now, start here. Youll be floored at how much there is to show off. And if youre the creative type, the Object Editor opens up endless possibilities. Scribblenauts Unlimited is an excellent Wii U launch game, even if it just feels like a glorified handheld title.", "date": "Nov. 18, 2012,"}