{"name": "LittleBigPlanet Karting", "name_review": "LittleBigPlanet Karting Review", "ref": "https://me.ign.com/en/littlebigplanet-karting/61693/review/littlebigplanet-karting-review", "text": "LittleBigPlanet Karting exists in this weird, in-between space. This is a kart racer from United Front Games, the folks who put out ModNation Racers on PlayStation 3 more than two years ago. Those creators have taken the LittleBigPlanet franchise and wrapped it around ModNation's established racing engine. So instead of Mods as racers, it's Sackboys. Instead of races being laid out in lists, they're patches peppered on cushy planets. In other words, the worlds of LBP and ModNation have collided to make one game. That should be awesome, but LittleBigPlanet Karting doesn't have the polish of the LBP games that have come before it, nor the kart racing fun that defined ModNation Racers. Strangely, it's a product that fails to live up to the bar set by each of its predecessors, representing a step backwards for United Front Games as a kart racing developer and LittleBigPlanet as one of Sonys marquee franchises. When it comes to actually racing, LittleBigPlanet Karting features some polished mechanics, but it's just not that exciting. Some tracks have crazy turns and sharp visuals, but most feel empty and forgettable, with long stretches of just driving and trying to nab the occasional score bubble. Like most kart racers out there, you drift around corners to get a quick speed burst, pick-up items to use them as weapons, and basically do whatever you can to end up in first place. Again, all of that is solid, but LBP Karting strips out a few of the ModNation mechanics that made that game strategic and fun. You no longer have a boost/shield meter to worry about; now, you get the boost from drifting and have to decide if you want to use your item for its given purpose or use it to defend an attack when the time comes. This is a step backward. Building up the ModNation meter meant you could defend yourself from multiple attacks. Requiring me to have an item equipped and ready to use as a shield means I'm vulnerable a lot more. This leads to LittleBigPlanet Karting being frustrating. I love kart racers and understand that cheap shots are a part of the genre, but I can't remember the last kart racer I played that frustrated me as much as LittleBigPlanet Karting does. There are a number of issues here. I'd deploy items like the Boxing Glove or Fast Forward Button (both of which propel you forward on the track), and I'd be slammed into obstructions at the end of the animation that instantly killed me. When I'd respawn, I'd be invulnerable for a few seconds, and as soon as that ended, I'd be blasted with a missile from a computerized foe and have no way to defend myself as I had just used the item I had equipped -- the item that led to my death and my subsequent spiral into last place. Racing isn't your only option in LittleBigPlanet Karting. The game also packs Battle Modes where you race around arenas blasting other players and trying to net the most kills. These are peppered throughout the story mode and are actually less cheap than the races, but they're more fun against real people locally or online. Like any LittleBigPlanet before it, Karting keeps the Sackboy stuff players know. The game starts with you in your cardboard pod, you create levels on your moon, and Sackboy is yours to customize via the friendly Pop-It menu. Aesthetically, LittleBigPlanet Karting does a great job of emulating what the Media Molecule games started. But then we get into the game itself. When you best a race or a battle, a versus level version of that trial will pop up on the world. This is the one you'll use to play people online, but when you start unlocking the side missions and mini-games, the planets become overloaded with content and look a bit like a confusing snake's nest. Why not just have the one level ask me if I want to go online and race other people? Traditional Sackboy tweaking included. This setup is one of LittleBigPlanet Karting's major flaws. Whereas ModNation Racers gave you an online ranking system to level-up in and an easy way to dive straight into races, LittleBigPlanet Karting doesn't. There's no online section from the main menu and no carrot on the end of the stick outside of individual race leaderboards. If you want to play online, you have to click on Story, the planet you want and then the race you want. After you've finished a match, you can vote on what track to tackle next. The system doesn't feel competitive. It doesn't put competition front and center, and that's what kart racers are all about. You want to dive in and mix it up with the weapons, ramps and shortcuts United Front Games have created, but the way the game is setup makes it seem like the story of LBP Karting is the focus and the multiplayer is just something that's there. That's a big step backwards, as the story in LBP Karting lacks the charm and whimsy of previous LittleBigPlanet games. We're driving to planets from previous LittleBigPlanet games and revisiting characters; this could be awesome, but the cutscenes used to tell the tale are way too simple. They feel like they're early creations from the community -- and not the superstars in said community. Characters are just moving parts held together with visible joints, and the story unfolds through captions rather than voiceover. Stephen Fry is back to narrate the adventure, but it's just an excuse to get you racing and battling. That's not a knock, but it's not the traditional storytelling. Both LBP and ModNation Racers made a big deal out of their creation tools, and so does LittleBigPlanet Karting. Jump into My Moon, and you'll be able to whip up not only your own tracks but also your own games. Again, though, this is a strange hodgepodge that isn't user friendly. The ModNation track builder is basically dropped into its own section of the LBP Pop-It menu and then all the LBP goodies you'd expect surround it. However, tools from the Pop-It menu no longer have individual tutorials linked to them. You have to pop out and watch a series of non-interactive tutorial videos, so finding the one that pertains to your question can be tough. You still drive to lay your track in create, but ModNation Racers' ~auto-populate~ option has been removed, so you personally need to place each and every item you want in your creation. Creating stuff in LBP has always been complicated, but LBP Karting seems to remove some of the stuff that was there to make it easier. I'm sure the dedicated players out there are going to come up with some fantastic stuff if LittleBigPlanet Karting finds an audience, but the creations I played on the test servers didn't inspire confidence. THE VERDICT A lack of confidence seems to define LittleBigPlanet Karting. The game pulls from both the LBP and ModNation universes without ever finding its own voice. In the end, that leads to the game feeling like a forgettable kart racer. The racing mechanics are tight, but I'd rather play ModNation Racers with its strategy and create options for karts. The LBP vibe is nice, but I'd rather play one of the core LittleBigPlanet platformers for better creation tools and storytelling.", "date": "Nov. 7, 2012,"}