{"name": "Assassin's Creed Origins", "name_review": "Assassin's Creed Origins Review", "ref": "https://me.ign.com/en/assassins-creed-next/139314/review/assassins-creed-origins-review", "text": "Assassins Creed Origins is a dark, multifaceted, deep dive into one of the series most alluring settings yet: ancient Egypt. As Bayek of Siwa, who is simultaneously compassionate, bold, and driven by revenge, youre strung through a twisted story of pharaohs and corrupt leaders, of love gained and lost, and the plights of the lower class in a time when they were routinely worked to death and nobody batted an eye. Its a tense journey that challenges your concepts of right and wrong, making you consider the morality of those you kill in the process  and, in a dramatic shift for the series, its all part of a full-on roleplaying game. I spent 30 hours finishing the main campaign, which took me through just over half of the expansive and beautiful map that recreates ancient Egypts varied architecture and environments. Its filled with areas of soft sand that are swept by dynamic sandstorms, ranges of treacherous and rocky mountains, catacombs of towering ancient structures built in the names of the gods, and the decaying shacks of the common people. Refreshingly, I discovered all of these things through an organic drive to explore, rather than through the series traditional structure of climbing to viewpoints to have them unveiled for you. There are plenty more secrets to uncover, and the delightful sense of discovery still hasnt left me. This is also the biggest and most connected map weve seen in an Assassin's Creed game. Even the seemingly-empty desert regions having their own treats, like the breathtaking view from the highest elevation point, with an impressive draw distance, whether youre playing on Xbox One X or PlayStation 4. There are multiple cities, too, each with their own unique culture featuring different gods, politics, race relations, and prejudices to uncover. Theyre distinct in architecture and environment, and that makes the significant time commitment one thats consistently varied and surprising. The delightful sense of discovery still hasn't left me. The density of it is made more impressive by being able to explore it in its entirety without any loading screens, with the exception of some story cutscenes, and if you choose to fast travel. If you want to get around quickly, a smart in-universe transit system lets you call your mount and press a button to follow the main road, or to head to a custom marker youve placed on the map  all fully automated, letting you take in the scenery around you. While the main story is delightfully mystical and elaborate on its own, Origins also has some of the strongest actual mission design Ive encountered in the entire 10-game series  and maybe in any open-world RPG. From collecting clues to solve mysteries, to chariot racing and gladiatorial arena fighting, to chasing down leads and assassinating high-level enemies hidden in fortresses, to Black Flag-style ship-to-ship combat, I was pleasantly surprised by how each of them felt like a self-contained short, well-paced story. Another highlight is the series of hidden temples, which  without spoiling anything  tie into Assassins Creeds overarching sci-fi story, among other things. They are distinct from every other tomb youll find in ancient Egypt, and even include some throwbacks to the fan-favorite, timing-based platforming puzzles introduced way back in Assassins Creed 2. I rarely felt like I was doing too much of any one thing. While there are quests that simply involve finding a hidden location or looting a building, Origins has largely done away with the cluttered mini-map full of useless chests. Instead, the vast majority of quests require multiple steps to complete and have multi-faceted, interesting characters with believable motives. Even when I really only began a quest for the XP, many of them ended up distinctly memorable. Ill remember the man who was poisoning poor Egyptians so he, as a Greek, could acquire their land when they died, and Ill remember the little girl who was selling fake Siwan artefacts for her mother, repeatedly assuring me they were real. My sole complaint is the NPCs overuse of my family member died! and Bayeks constant outrage at someones disrespect of the gods as the driving force of a quest. The most seamlessly executed parkour and climbing yet. Of course, being an Assassins Creed game, theres a whole lot of parkour and climbing in Origins, and this is undoubtedly Ubisofts most seamlessly executed version of that well-rehearsed mechanic. Things that can be climbed are blended more organically into buildings and the act of climbing feels clean and almost as passive as running. True, that removes some of the challenge that existed in previous games where youd have to figure out the best route up a building, but it takes a fair amount of frustration out the door with it. I never had a moment where Bayek failed to climb something I thought he should be able to, and that smoothness put Ezio, Altair, and the rest of the previous Assassins to shame. The notably strong XP-based RPG progression elements are what make Origins addictive on a new level. Assassins Creed has let you unlock and upgrade abilities for a while now, but Origins does it in a way that enables multiple creative options that can cater to your playstyle, rather than just things that youll pick arbitrarily. If you want to approach missions stealthily, there are abilities that give you bonuses for stealth kills, ones that let you control arrows in the air after youve fired them for more precise headshots, and ones that let you visually predict the path an enemy will walk on. If subtlety isnt your thing, there are options that make you a beast in melee combat, others that increase the amount of money you get from looting, and some that mostly just look cool (like activating slow-mo if youre mid-air with your bow out). In the earlier stages, there are some plainly obvious picks, but I think most people will end up with very different sets of abilities by the end of the main story. Thankfully, Origins does away with previous games auto-fail stealth missions and its heavy-handed suggestions for how you should approach certain objectives. Instead, it finally gives you absolute, almost Hitman-level freedom to approach a target however youd like, and your choice of abilities can unlock new solutions. For example, as soon as I gained the ability to befriend animals, it changed the way I approached any mission locations where they were in the area. Id survey the area with Bayeks bird companion, Senu, then stealthily take out the guards at the front of a camp with a predator bow, sneak through to a caged lion, befriend it, and release it. Thats generally more than enough of a distraction to get past the remaining guards and break out the hostage I was sent to free from another cage, then slip out totally unseen. There is quite a lot of 'grinding' to be done. While unlocking new abilities and story missions generally happens at a smooth pace, there is quite a lot of grinding to be done in Origins. This happened to me when the recommended level for a new main quest mission appeared as several levels above where I was when I first unlocked it  a difference that can render enemies all but unkillable. Thats usually no big deal, since Origins is flush with side activities that can help you make up the difference, but on two separate occasions, I couldnt find any side quests at my level. That meant I had to go for much lower-level quests for small rewards, which stretched out the process uncomfortably. If you do urgently want to get to the next story event  as I did at one point towards the very end of the story  this stymied progress can be a little frustrating. 12", "date": "Oct. 26, 2017,"}