{"name": "Halo 4", "name_review": "Halo 4 Review", "ref": "https://me.ign.com/en/halo-4/61563/review/halo-4-review", "text": "Halo 4 is really Cortanas story. As usual, of course, the fate of the universe rests on Master Chiefs long-dormant shoulders  the green-armored super-soldier has been on ice aboard theForward Unto Dawn since Halo 3 faded to black five years ago  but this time our hero bears an even greater burden. Saving humanity is the easy part. In Halo 4, his more difficult task is rescuing Cortana from herself. She is slipping into rampancy  a condition that plagues all UNSC AI constructs after theyve been in service more than seven years. As their knowledge base expands, they eventually, as Cortana explains, think themselves to death. And thats the unexpected heart of Halo 4s greatness. The plot delves deeper into Johns humanity than ever before, but Halo 4 is more about Cortana and the fight for her own  ironically enough  humanity. Amazingly, Halo 4 is not only a success, but a bar-raising triumph for the entire first-person shooter genre. And just how new developer 343 Industries has done it will surprise, delight, and excite you. Familiarly Unfamiliar It starts with a mesmerizing CG cutscene that flat-out knocks you on your ass. The lighting is flawless, subtle movements and animations abound, and it even goes so far that Commander Lasky (yes, the same Lasky we see as a teenager in the Forward Unto Dawn webseries) has crooked teeth  not the usual polygon-perfect Chiclet choppers that every other animated video game human has. It strikes a fine balance between old-school fan service and establishing context for new players, and it quickly segues into gameplay, where Halo 4s greatest strength becomes immediately apparent: its gunplay. Halos weapons continue their trend of working in complementary harmony, where each gun has a purpose, and every situation a fitting firing solution. The inaccurate Promethean Suppressor and undesirable Covenant Storm Rifle proved near-useless at times, but Halo 4 still hits on a ludicrously high percentage of its death-dealers. The short-range Energy Sword or new Scattershot are great to pack alongside mid-range delights such as the DMR or Battle Rifle, which also pair nicely with the ferocious Sniper Rifle if youre into the long game. In the opening mission, Master Chief is thawed out and immediately put back to work shooting Covenant, evoking both Halo: Combat Evolved (its set aboard an under-attack spaceship) and Halo 2 (the stages major battle takes place in zero-G on the hull of the ship). Expect your jaw to drop at least once on every level of Halo 4s eight-mission campaign, especially after crash-landing on the Forerunner planet Requiem, emerging from the wreckage, and ascending a hill whose apex overlooks a gorgeous valley. It is your introduction to the planet youll be spending most of the game exploring and fighting the new Promethean enemies on, an obvious callback to the unforgettable moment when you touched down on the Halo ring for the first time in Combat Evolved. Now Hear This Of course, gorgeous graphics are only one responsibility a consoles killer app must bear. Perhaps equal to Halo 4s monitor-melting visuals is its bar-none, best-in-class sound design. If you think youve heard Halo, check your ears and listen again. Nary a gunshot, MJOLNIR boot clank, or Covenant Elites Wort wort wort passes through your speakers without a significant, authoritative overhaul that lends an aggressive, testosterone-inducing punch to Halo 4s combat. Few game series are known as much for their music as Halo, and thus much has been made of British electronica producer Neil Davidge taking over for the beloved Bungie incumbent, Marty ODonnell. Its a bold shift  and probably wise of 343 to go in a tonally different direction rather than attempt to emulate ODonnell  but the results are mixed. The trademark monk chants are gone, and Davidges moody tunes are complementary rather than additive. The new tracks simply arent memorable and never elevate the action happening on the screen the way that ODonnells bombastic scores did, though this may be intentional, as Davidges compositions are decidedly atmospheric. Hello New Day Resplendent set-pieces are ubiquitous during your quest, matched by what is inarguably the finest Halo sandbox yet. Halo 4 feels much more open-ended and organic than Halo Reachs paint-by-numbers sequences because of its massive scale, scope, and freedom for possibility. Go it on foot, or take the Scorpion in front of you? Hop in a Ghost, or take the riskier strategy of trying to get to a heavily guarded Wraith? All of these choices exist in a moment, not a spectacular scene, allowing for emergent encounters dictated by the opportunities you seize. The wealth of options in Halo 4's sandbox make the campaign a joy to play again and again. To be clear, Halo 4 certainly has its share of dedicated vehicle sections. The walking two-story Mantis robot packs a high-caliber machinegun alongside a rocket barrage. Its even sporting a mean foot stomp attack to flatten any Covenant or Promethean scum who dare venture within spitting distance of you. The time youll spend behind its controls is both empowering and refreshing. Halo 4 also finally lets me do two things Ive always wanted to do in a Halo campaign: fight alongside other Spartans and fly a Pelican. Its a treat to blast Covenant Phantoms out of the sky with the silver birds beefed-up Spartan Laser, giving a classic Halo vehicle its long-overdue moment in the sun. Furthermore, an amazing near-final sequence tips its cap to the Halo finales of yore  youll know it when you see it and I dare not spoil it for you  even if its very obviously reminiscent of another powerhouse pop-culture phenomenon. Digging Deeper All throughout, the Halo 4 campaign is paced better than any first-person shooter this side of Half-Life 2, deftly mixing on-foot combat, vehicle sequences, quiet story moments, and key Chief-and-Cortana interactions. That pacing is most evident on Normal difficulty, where you wont run into the patience-testing battles for the next checkpoint that define the Heroic and Legendary settings. The series has long been lauded for its brainy bad guys, and theyve gained a whole host of IQ points for Master Chiefs return. As youd expect, the full smarts of Halo 4s brilliant enemy AI are most evident at higher difficulties. Vehicles get brought down to earth  sometimes literally, in the case of the Banshee  now that enemies are proficient at firing ride-disabling overcharged Plasma Pistol bursts. And the new Promethean aggressors are wicked intelligent without being unfair. The Prometheans are anything but dummies. In other words, they're not the Flood. Watcher units hover above the Knight infantrymen, acting as guardians and medics  if you can get around the protectors shield or return-to-sender grenade tosses, it can revive its allies. Halo 4s combat is about efficient prioritization: kill the Watcher before it can get to cover, and turn the Knights to dust before they can escape, all the while dodging fire from swarms of speedy wall-running Crawlers  dog-like denizens of Requiem that can only be shot in the face. An Imperfect Beginning? The campaign has few failings, but the primary annoyance is that a lot of great story content is left for the eight hidden Terminals. Unlike previous Halos, the Terminal tale here isnt a side-story, but rather it fills in important backstory for both the main antagonist and a key allied character. Worse, you cant view the videos within the game. Instead, youre directed to Halo Waypoint, which serves only to pull you out of the experience, literally and figuratively. On a related note, as much as Halo 4 delves delightfully deep into its iconic characters, it leaves a number of threads hanging. Why is Spartan-II creator Dr. Catherine Halsey in handcuffs in the intro? What did Master Chiefs[spoiler redacted] do to him? How did [spoiler redacted] survive at the end? No doubt these will be addressed in the fifth and sixth Halos, but until then the discussions will be heated and the wait will be maddening. Fair warning: Getting the special Legendary ending is going to require a lot of tough work. Halo 4s other drag is one thats only really evident on Heroic or Legendary difficulties: some of its fetch quest-y, flip-three-switches sequences feel like they artificially lengthen the game because of how long you can get hung up on them when the going gets tough. I spent upwards of an hour trying to trudge through one of them on Heroic, but when playing again on Normal I cruised through on the first try. At one point, Cortana even makes a self-deprecating remark about the repetition, which I recognized and appreciated. These are mostly just scrapes in the paint of Master Chiefs MJOLNIR armor, however. His return in the Halo 4 campaign is a success of mission design, art direction, level design, technology, and story writing. Underpinning it all, though, is that irresistible combat. Some shooters get a few weapons right, or, like Sniper Elite v2, they build their entire experience around one facet like long-range. Halo, however, boasts the best of all worlds. As youd expect, this plays exceptionally well in Halo 4s robust multiplayer modes. Great Expectations No console shooter has a richer, deeper, more revered multiplayer history than Halo. So how does Halo 4s multiplayer suite live up to the legacy in 343s hands? Its golden. Halo has evolved, wrapping its multiplayer in an unexpected narrative context  the Spartan-on-Spartan battles are presented as training sessions aboard theUNSC Infinity ship  complete with more of the same visually arresting introductory cutscenes for both the adversarial War Games and the new Spartan Ops co-op mode. With Halo 4s immaculate weapon balancing and gun-for-every-situation combat strategies, it needs only a great crop of multiplayer maps in order to qualify for classic status. Fear not, as 343 packs War Games with 10 mostly stellar stages and three additional Forge-built battlegrounds. Exile leads the vehicle-heavy Big-Team Battle complement, Ragnarok shines as a Mantis-showcasing remake of Halo 3s Valhalla, and Haven is among the series all-time finest small and symmetrical levels. Oh, and one of the official Forge constructions, Settler, is a smaller, crazier evolution of the franchises most famous map that I absolutely love: Blood Gulch. Halo 4 might not have its instant-classic (a la Halo 2s Lockout), but this is an impressive collection of outstanding battlegrounds, with a seemingly greater emphasis placed on the large-scale, vehicle-inclusive levels that are Halos bread-and-butter. Meanwhile, Halo 4 includes all of the same matchmaking, playlists, customization, and social options youve come to expect from the series. The more visual lobby screen, where player cards depict each persons custom Spartan, is a bit more cluttered and difficult to parse through than previous Halos, but thats the only downgrade. Everything else is on par with what Bungie had previously established. The Theater returns virtually unchanged, as does the Forge editor, with its notable improvement being a magnet feature that allows you to more easily connect Forge pieces. That leaves Spartan Ops, a downloadable series of 10 episodic side missions for Gold subscribers, each of which include a lengthy CG cutscene. The first one spans five chapters, and it took about an hour to play through in four-player co-op on Legendary difficulty. As youd expect, the more friends you bring the easier itll be  and, while its perfectly enjoyable and makes for a good excuse to jump online with your pals once a week, once youre finished with each episode, it lacks the replayability and score-based incentives of the Firefight mode it replaces. However, the incredible pre-episode cinematics make the mode a must-play regardless, and it opens up a number of interesting narrative possibilities for future episodes and seasons. So even if you only play each episode once, you cant complain about the fact that nine more weeks of downloads await you. The End of the Beginning After soaking in the new game, I am beyond thrilled to be so in love with Halo again, more than Ive been since Halo 2. Halo 4 is a masterstroke everyone can and should celebrate, and its two guaranteed sequels instantly make the next-generation Xbox a must-own system, with Halo 5 its most anticipated title. Halo has been rebuilt. It has been redefined. And it has been reinvigorated. The Xboxs original king has returned to his rightful place on the throne. THE VERDICT Cortana once asked Master Chief what would happen if he missed his target, and in the single greatest line of dialogue in Halo history, Chief replied with the coolest, calmest confidence, ~I wont.~ With Halo 4, he doesn't.", "date": "Nov. 1, 2012,"}