{"name": "Assassin's Creed III", "name_review": "Assassin's Creed III Review", "ref": "https://me.ign.com/en/assassins-creed-iii/61525/review/assassins-creed-iii-review", "text": "If theres one image that encapsulates the Assassins Creed series, its that of a hooded figure balancing atop some skyscraping parapet, looking down into the city below. Its a snapshot that shows off a lot of what makes these games special  their incredible attention to detail, breath-taking verticality, fascinating architecture, unique historical settings - but it also represents their limitations. Assassins Creed games are easy to admire, but you often feel a bit distanced from them, too, held back from inhabiting these worlds as fully as youd like to. Youve always been on the outside looking in. Not so with Assassins Creed III, which hauls the series across the ocean into a new setting thats absolutely bursting with things to do. It turns a fascinating section of history into a vast open-world playground, letting you conquer the rooftops, stalk the forests and sail the seas of revolutionary America and authoring a main storyline that puts you in the middle of some of the most important events of the period, like a fly on the wall of history. Its all about enjoying the freedom of movement the game affords you and immersing yourself in its world, as well as setting up the set-piece assassinations that form the climax of each chapter. Where the storyline missions usually follow a pattern of gathering information, stalking and eventually killing a high-profile target (with the odd naval mission or large-scale battle thrown in for variety), outside of that you're free to do whatever you want: hunt for trinkets, clamber over the rooftops of New York in search of almanac pages, or pick fights with the Redcoats on behalf of the populace. There is a vast amount of content in this game, from liberating Boston and New York to building up a homestead on the frontier to sailing the high seas to just enjoying the outdoors and hunting wildlife. But perhaps because Assassin's Creed III is so huge, it can be pretty inconsistent. It attempts an astonishing amount, and doesnt always succeed. Assassin's Creed III follows hot-tempered native American assassin Connor for almost his entire life, starting as a tree-climbing kid and growing from troubled young man to vengeful adult  but without wanting to spoil anything, he's not the only character you'll play. Connor's path often intersects with key moments in the American Revolution, putting him in the middle of the Battle of Bunker Hill for one spectacular mission. He finds himself fighting on the side of the Patriots for most of the game, but because he has enemies on both sides, his motivations for doing so has little to do with their battle for independence from the British crown. Connor isn't as straightforwardly charming as Assassin's Creed II's Ezio, and although writing is excellent for the most part, you never warm to Assassins Creed IIIs heroes nor grow to resent its villains in quite the same way. Its impossible to discuss exactly why this is without spoiling something of the games plot - which you definitely dont want, as there are some great moments here. There will doubtless be a lot of discussion around this after the game makes its way into players hands, but what it really comes down to is that Connor often feels more like an errand boy than a freedom fighter; within the missions, Assassins Creed III can feel very scripted and dictatorial, fettering you with rigid objectives and punishing you harshly when you step outside their boundaries  chase sequences are particularly infuriating on this front. The game is often at its best outside of the story, when it leaves you to enjoy and inhabit its world. As a technological achievement, Assassins Creed III is astounding. Its excellent opening in a London opera house is a showcase for the new and improved animation, crowd physics and freedom of movement, but as soon as you hit the New World it is all about the great outdoors.Assassin's Creed III's story spans decades and over that time you get to see the gorgeous forests and nascent cities of Connor's homeland covered in heavy snow, gleaming in autumnal morning mists, and blooming in the summer. It can be stunning. Walking the streets of bustling Boston, full of people and noise and activity, you can't help but be in awe. However, Assassins Creed III is often the victim of its own technological ambition. Pop-in, frame-rate drops and occasional graphical glitches are definitely a part of the experience, and you do wonder whether the omnipresent fog in New York City has more to do with technical limitations than the weather. The loading times are also hefty and I encountered some significant bugs during my review playthrough, though the developer claims that these will be fixed with a day-one patch. But it feels petty to begrudge the game for these hiccups when it pushes the boundaries of this generation so far. The basics of Assassins Creed  free-running and combat  have been honed to near-perfection here. Free-running has been simplified and improved, and scaling the rock faces and branches of the frontier is no more difficult or confusing than climbing the ornate architecture of European cities. The Animus interface is clearer and less intrusive then before  spiderweb-like vectors highlight things that Connor can interact with and show when hes hidden from view in the undergrowth or in a crowd. Every element of the HUD is customisable, letting you determine exactly how much visual help you want. Combat is still a fairly simplistic parry-and-counter system, but it's made much more exciting by some excellently gruesome kill animations and a big selection of weapons  although, weirdly, you have to visit a shop or the homestead mansion to swap out your swords, axes, tomahawks or clubs. But trying to remain hidden is much more satisfying than just causing a giant brawl  staying incognito during assassination missions is extremely challenging, usually for the right reasons. Assassin's Creed III is more combat-focussed than previous games in the series; there's a lot less leaping around ruined buildings and much more stalking and killing, of man and beast both. Multiplayer is an unexpected pleasure, placing the finely honed running-and-killing mechanics of the single-player game into an inventive and surprisingly cerebral new context. The new Wolf Pack mode, a co-operative score attack where you and friends work together to kill NPC targets, is superficially entertaining, but honestly its the familiar Assassinate mode that still holds the most appeal, getting you to identify and kill other human players amongst a crowd of NPCs whilst trying to remain hidden yourself. Playing the multiplayer unlocks an impressively fully-formed, branching story about the Animus and Abstergo that provides extra motivation to keep playing, but its the thrilling mixture of deception, quick-wittedness and sudden violence at the heart of most of the game modes that keeps it exciting. Theres a lot to it, so much so that it almost feels like an entirely separate game from the single-player. Assassins Creed IIIs pacing is a source of frustration for the first third or so of the story  it takes too long to open up and show its hand. Right at the beginning of Connor's story you're kept on a short leash; your movements are wholly dictated by the plot for a good three hours or so, which is disappointing when you've had a taste of how open the world can be. It's a definite low point that lasts too long, and the game only really recovers when it sets you free again to explore at your own pace. After that point, the minimap bristles with enticing icons, inviting you to join hunting clubs, explore with frontiersmen, recruit your own assassin underlings in New York and Boston by loosening the Templars grip on the cities, or take part in hours worth of optional naval missions that put you behind a ships wheel. How much you engage with all of this optional fun will determine how much you enjoy Assassins Creed 3 as a whole; stick to the story missions and youll quickly become frustrated with their strictures (and frequent cut-scenes), but allow yourself an hour or two of exploration between each of them and the games rhythm is much better. The naval missions, particularly, are a real highlight: theyre dramatic and novel, and the feeling of steering the ship against the oceans swell and battling through unfavourable winds is really convincing. But although Assassins Creed IIIs variety and freedom is in many respects a saving grace, its also problematic: theres a vast amount to do, but not all of it is integrated well. Where some optional stuff like the naval adventures, fort assaults and the Homestead side-story missions are great, other things feel unfinished, tacked-on or queerly pointless, like the Boston and New York underground tunnels, trading and crafting, and training your assassins once youve recruited them. These features arent fully realised and feel like wasted ideas. How much you enjoy the game will depend heavily on how willing you are to figure out and engage with these optional activities on your own, because the game wont guide you towards them. THE VERDICT Assassin's Creed III is very enjoyable overall, but its not consistently brilliant. Not everything about the game gels together convincingly and the missions unnecessary prescriptiveness sometimes undermines the sense of freedom that the rest of the game works so hard to create. But it achieves so much that you cant help but respect it; no other open-world game has ever given us a setting that's as impressive to observe or as full of things to do as this. Connors story has its lulls but it still tells a tale much richer and more compelling than most other games manage, set in a fascinating period of history. Assassins Creed III isnt as huge an improvement upon its predecessors achievements as many players will be hoping for, but its still up there with the best that the series has achieved - even if it isn't quite the best. With Assassins Creed 3 Remastered, Ubisoft does everything in its power to bring one of the weaker games in the series up to modern standards, and its full of sights worth seeing. The main improvement is graphical, and the scenery of 18th-century Colonial America looks fantastic. There are even some meaningful tweaks made to stealth mechanics to make it feel a little more up to date and less aggravating. Where this remaster falters are places where AC3 can't be changed without fundamentally remaking the entire game from the ground up, namely a stiff animation style, repetitive mission structure, and that goddamn final sequence.", "date": "Oct. 30, 2012,"}