{"name": "Street Fighter x Tekken (Special Edition)", "name_review": "Street Fighter X Tekken Vita Review", "ref": "https://me.ign.com/en/street-fighter-x-tekken/61508/review/street-fighter-x-tekken-vita-review", "text": "Street Fighter X Tekken is, without any question, the most divisive fighting game Capcom has ever produced. At no point in Street Fighters 25-year history has a single entry so completely embodied the unique dichotomy that exists within its fan base. It's easy to argue that casual fight fans are usually playing an entirely different game from the hardcore nuts, but for SFxT, this proves especially true. Players looking for a good time with some buddies and beers wont find it any more or less entertaining than Street Fighter 4: Arcade Edition or Ultimate Marvel vs. Capcom 3, but for more serious challengers, it leaves a lot to be desired. How much you get out of the Vita release  which is seven months late to the market -- will have a lot to do with which category you place yourself in. Of course, the main goal here was to create a console caliber experience on the go, and Street Fighter X Tekken on Vita does a passable job of it. Content-wise, you get the complete experience. Every character, stage and feature from the home version is at your disposal, including online matchmaking and the battle log feature which keeps a rolling record of your most recent fights so you can re-watch them as you please. Further sweetening the deal, you get the 12 additional characters that console customers had to pay extra for, and you can even beat your PS3-playing friends down with them through the seamless cross platform netplay to add insult to injury. This isn't to say that nothing gets lost in translation, however. Where Vitas Ultimate Marvel vs. Capcom 3 looks and plays nearly identically to its big brother on console, SFxT loses some of its luster. Lighting seems flat and textures aren't nearly as crisp as they could be given how much power the Vita pushes. These visual concessions are made all the more noticeable by the stage backgrounds, which have not only been simplified in terms of what's going on in them, but by some layers having been converted from full 3D to static 2D images. None of these shortcomings are deal breakers on their own, but their combined effect mutes some of the visual impact the original brought to the table. I wish I could say all of SFxT's issues were visual, but I'd be lying if I did. Load times are longer than they should be, especially when playing online where you also have to deal with a good bit of lag as well. Perhaps the biggest problem the game faces, however, is the control layout of the Vita itself. Street Fighter X Tekken has 6 attack buttons, which means there's nowhere left to map all 3 punches or kicks. On a full sized arcade stick, you don't really need to, but hitting all three punches when two of them are on the face and the other is a shoulder button is really unreliable. Capcom tries to solve this problem by allowing you to assign these commands to different zones on the front and rear touch screens, but it's far from ideal. To be fair, I don't think there was a better way to handle the situation, but that doesn't change the fact that it impacts the play experience significantly. Granted, none of these issues make SFxT impossible to enjoy on the Vita, assuming you enjoyed it in the first place. This is still the same goofy fighting game it was seven months ago, meaning if you thought its systems were quizzical back then, you'll still be sighing in exasperation on a regular basis. On the surface, it has all the components of an entertaining brawler: a colorful cast of characters, flashy moves, and more juggles than a three-ring circus. These basic elements are enough to entertain the uninitiated, but most seasoned vets will see right through the glossy veneer and peg Street Fighter X Tekken for the flawed fighter it is. Heihachi spends his time here while waiting for PlayStation All-Stars. To be clear, this isn't merely about the game lacking the chops to satisfy tournament level players. Rather, it's a simple matter of puzzling design choices. To many, SFxT's mechanics are either redundant or useless. Cross Assault, which allows both characters on your team to be on screen fighting at once, is entirely pointless except in the exceedingly rare case that you're playing with a human partner. The two button custom combos would appear to be a way to give newcomers an easy way to get some damage until they get the hang of their character, but this role is already handled by the more effective Cross Rush. Then there's Pandora mode, which kills off your active character to give you a short lived damage boost. But if you don't finish your opponent within a few seconds, you lose the round automatically, preventing it from having any practical applications. I could go on and on, but you get the picture. It's perfectly fine for certain features of a fighting system to be less useful than others, but when most of the elements that differentiate your game from its competitors are so ineffective that they aren't even fun to use, there's a problem. As if this weren't enough, Capcom also made some questionable calls where overall balance is concerned. The hit boxes on jumping attacks are just plain stupid, crossing up from distances they never would in any other fighting game. Meanwhile, very few characters (and almost none of the Tekken cast members) have serviceable anti-airs. So where in every other Street Fighter taking to the air is a big risk, in this one you can do it freely and score easy ambiguous mix-ups off them. Invincible wake-up rolls make it impossible for most characters to pressure a knocked down opponent, and a variety of factors conspire to make time-outs more common than knockouts. All this adds up to awkward, slow-paced matches that many will find boring, whether playing or spectating. Poor Cody. For as bad as this all sounds though, the truth is that a lot of people won't notice or care. Sure, the competitive scene has unceremoniously disowned Street Fighter X Tekken, something it hasn't done to a major Capcom fighting release, possibly ever. As someone who counts myself among their ranks, I've never particularly enjoyed SFxT, but I know plenty of people to whom tournaments, strategies and nuances mean nothing, and they tend to have a good time with it. That doesn't magically make its faults disappear, but it does mean you could have a perfectly good time with it, provided you're the right type of player. THE VERDICT Let's put this all in perspective, shall we? Over the course of the last 3+ years, Street Fighter 4 and Marvel vs. Capcom 3 have sold several million copies worldwide. In each of those years, Evolution, the largest international fighting game tournament in the world, drew several thousand players. Those several thousand generally don't dig this game, and this port does nothing to change that fact. The question is, are you part of the several thousand, or the several million? If you fall under the latter, you can do much worse than Street Fighter X Tekken, even with the compromises the Vita version makes. But the former are a tougher lot to please. After all, we're the kind of folks who think an automatic transmission ruins a good sports car, or perhaps more accurately, the ones too busy scoring a boxing match in our heads to get excited about entrance themes and haymakers. For us, it's all about the sweet science, and in this regard SFxT is still sorely lacking. <p>The fast pace of the combat and fluidity of the tag mechanics truly bring Street Fighter X Tekken to the top of the fighting game heap. The Gem system is a fine addition that manages to do something daring by offering some new strategy to the fighting, and the two rosters complement each other very well. Street Fighter X Tekken is a fantastic fighting game that nails the basic fighting mechanics while daring to take a few risks with the formula as we know it; the pressure is on Namco Bandai to deliver something better with Tekken X Street Fighter.</p> <br> <DIV CLASS=~IGNE_divider~></DIV> <br> <p><i>Steven Hopper is the Executive Editor for IGN's Xbox channels. Check him out on <b><a href=~http://people.ign.com/Shopper-IGN~>MyIGN</a></b> and <b><a href=~http://twitter.com/Steven_Hopper~>Twitter</a></b>.</i><br></p>", "date": "Oct. 30, 2012,"}