{"name": "Borderlands 2", "name_review": "Borderlands 2 Review", "ref": "https://me.ign.com/en/borderlands-2/60481/review/borderlands-2-review", "text": "When youve managed to create an unexpectedly great first entry for a franchise, it begs the question: What the hell do you do with the sequel? In the case of Borderlands 2 developer Gearbox has decided to largely stick with what worked the first time around, while implementing a host of tweaks that make it an overall superior game. A few relatively minor complaints aside, Borderlands 2 improves not only the narrative, but almost every major game system. If youve been itching for a reason to jump back into the world of Pandora, Borderlands 2 provides a more than ample supply. The hook of Borderlands 2, the very reason that I found myself thinking about it when I worked or tried to fall asleep, is the loot. Guns, ammo, character skins, grenade mods, class mods -- theres always something just a bit better, something you so desperately didnt even know you needed until you found it in Borderlands 2. Just like Diablo or a number of other action RPGs, the hunt for loot becomes intoxicating because of the tiny rush you get each time a rare colored item spills out of a chest or is dropped by a recently slain enemy. Every firefight and intense boss battle becomes all the more rewarding, because, though you might die a few times and want to crush something near you in real life, it suddenly feels like everything is going to be OK when youre blasting away enemies with a newly looted gun. Guns really do make up the bulk of the loot, and thats great because youre going to spend most of your time in Borderlands 2 staring down a gun sight. No matter the quest, at some point something or someone is getting pounded with lead. Thankfully, snappy shooting and lots of environmental hazards combine with each classs unique ability to turn every skirmish into a playground. You simply have to decide the best -- or most entertaining -- way to kill everyone. While many guns operate similarly to one another, the stats and augmentations are just complex enough to create a seemingly endless number of combinations, without being so diverse that theyre hard to understand at a glance. You roll in, you kill anything that looks at you the wrong way, and then you walk around and look at items, utilizing the handy on-screen comparison tools to see if youve found something at all better than what youre already holding. It keeps things from dragging, and drives you rapidly onward in the never-ending quest for loot. Seeing as how Borderlands 2 takes cues from numerous RPGs, I still find myself disappointed with the lack of visual customization options (Borderlands 2 features the ability to reskin your character, but only with blanket skins that change the look of their body and their head). However, when it comes to class skill customization, Borderlands 2 is heading in the right direction. Like the first game, Borderlands 2s four classes each have a unique ability. Unlike the original, though, a lot of options have been added to the skill trees to make it possible to create much more diverse builds...at least to a point. No matter what, every Commando will be about using turrets, every Gunzerker about raging out and blasting people with two weapons at once, every Siren about using a stun ability called Phase Lock, and every Assassin about temporarily cloaking and unleashing devastating surprise attacks. But how those abilities and characters function can be tailored to your playstyle (and can be changed over and over again for a negligible fee on a whim). For instance your Assassin might be focused on sniping and avoiding damage, while mine could be tailored to get in close and melee enemies while taking it on the chin. On the surface two peoples takes on a class might seem similar, but the new, more filled out skill trees allow you to create a version of a class that better suits your style. Trying out skills and then reassigning skill points over and over is important in Borderlands 2, especially when you consider that you can play alone or with up to three other people. Grouping in Borderlands 2 makes the combat feel different; enemies get harder and you can use each classs power to support your allies. The Commando could toss out a turret, drawing enemy fire while the Assassin closes in and pummels enemies to death, for instance. Since loot is shared you need to pick your partners carefully. Playing with strangers or super aggressive friends means youll likely find yourself in a race to see who can grab everything the fastest, and thats really not all that fun. No matter how you feel about Diablo III, making it so each player only sees their own loot is brilliant design, and its a shame Borderlands 2 takes it in a route that means people are competing with one another. If you want to take your characters customization even further, Borderlands 2s new Badass Ranking system gives you plenty of ways to work for it. A host of in-game challenges track things like headshots with a specific weapon class, or looting a large number of chests. As you finish each of these tasks for the first time, youre given a token you can spend on a number of tiny boosts that affect stats like reload speed, recoil reduction and weapon damage. The bonuses per token are really small, but as you earn more than 100 of them, the benefits really start to add up. Best of all, these bonuses benefit every character you create, giving them a bit of a head start (you can turn it off if you dont want the bonus). Its another way Borderlands 2 makes you feel consistently rewarded, and it provides plenty of incentive to use weapons or play differently than you otherwise would. Plot wise, Borderlands 2 is a direct sequel, with a story that picks up shortly after the first. You play one of four new Vault Hunters whove come to Pandora to hunt for  you guessed it  vaults. Unfortunately, since the opening of the last vault the planets been all but taken over by Hyperion Corporation and its insidious and somewhat charming leader, Handsome Jack. Through a number of events outside of your control, you end up getting wrapped up in a plot to stop Jack, save the world and help out some of the citizens and beloved characters from the first game. The main story hits on notes youve probably encountered in hundreds of other games but, despite being clichd and more than a little predictable, its still far more successful than in the original. Borderlands 2s campaign narrative actually tells a coherent story, with endearing characters who manage to feel nuanced and real. At times the story can even be touching and heavy, though this is when it starts to feel a bit at odds with Borderlands 2s overwhelmingly silly sense of humor. Ultimately, though, its a yarn worth hearing, one that ropes you in and makes you feel like what youre doing has purpose  something the original game never really achieved. The main storys good, but the best writing in Borderlands 2 comes from the side quests. If you played and enjoyed things like the General Knoxx or Claptrap DLC from the first game, then youll be in for a real treat throughout Borderlands 2s more than 30 hours of game time. Each time the main story starts to slow down, youre almost always given a number of sidequests to jump into. Mechanically they dont do anything all that different from typical RPG kill this or collect that fodder quests, but the writing, presentation, and acting turn them into some of the most memorable content the game has to offer. For instance one mission has you fighting off a splinter group of ninja-like bandits who just so happen to live in a sewer, eat pizza and talk like the Teenage Mutant Ninja Turtles. Another side quest tasks you with collecting body parts for a robot who wants to become human, and his take on humanity, as well as the way he talks, turns into genuine comedy. Not many games manage to make me literally laugh out loud, but Borderlands 2s mixture of gutter humor and sharp wit did so repeatedly. Even when I had far out-leveled the sidequest content I couldnt help but return to it, lest I miss out on something awesome. Similarly to how the sidequests build upon the writing Gearbox became known for with the first games DLC, Borderlands 2 also expands upon other parts of the game in smaller, but still significant ways. From more options to how you sort missions, to easy ways to mark and sell loot, to an always present mini-map, the entire interface is simply a lot more user friendly and intuitive. Sadly, though, little has been done to improve the driving component of the series. Outside of a few quests that require you to use a car, the vehicles feel largely underutilized and not all that valuable outside of getting you to destinations a lot quicker. Borderlands 2 is a shooter first and foremost, but itd be awesome to see smarter mission design that takes advantage of them in, say, the way Halo does with its vehicle levels. Even so, they offer a change of pace from the rest of the games shoot and loot cycle. If thirty hours of what Ive described doesnt seem like enough, Borderlands 2 provides plenty of reasons to play it again and again. All four of the classes are a lot of fun to play, and even after you finish the campaign theres always the option to try out Vault Hunter Mode, which is essentially a second playthrough where you get to keep your loot and levels. Even after you hit the cap of 50 you can fight the games first four-person raid boss. With the promise of DLC on the horizon, which Gearbox did a great job with the first time around, I know Ill be coming back to Borderlands 2 again. When it comes to what platform you should play onwell, it doesnt really matter all that much. Get Borderlands 2 on PS3, 360 or PC and youll experience the exact same content. All of them have the same story, the same skill trees and the same minor issues with texture pop-in. During my playthrough bugs would also occasionally pop up. Typically this involved enemies or objects getting stuck in the world, and in one case this resulted in the need to completely restart a boss fight. Since they happen so randomly, though, its hard to say whether or not these will occur during your playthrough, or whether theyll even occur on all platforms. Still, they were more than a little annoying, and really broke me out of the experience sometimes. The one thing worth pointing out between the various platforms is how cool Borderlands 2 can look if you have an awesome PC. The PC version allows plenty of tweaks to draw distance, frame rate and more. It also allows Nvidia card users to turn on Physx options, which results in a hell of a lot more particles flying around, realistic liquid physics, and a greater sense of destructible environments. Ultimately I dont feel this is something console gamers will miss, but for those of you with great hardware its an additional thing to enjoy. Just be warned: its very, very resource intensive. THE VERDICT Borderlands 2 preserves the best parts of the franchise while also making numerous, much needed improvements to areas like narrative and class skill design. Additional visual customization options would make it better, and the occasional technical issue takes away from the experience, but overall this is an excellent shooter no one even remotely curious should overlook. Prepare to level. Prepare to loot. Prepare to get lost in the hilarious, bizarre and wonderful world of Pandora. Borderlands 2 preserves the best parts of the franchise while also making numerous, much needed improvements to areas like narrative and class skill design. Additional visual customization options would make it better, and the occasional technical issue takes away from the experience, but overall this is an excellent shooter no one even remotely curious should overlook. Prepare to level. Prepare to loot. Prepare to get lost in the hilarious, bizarre and wonderful world of Pandora.", "date": "Sept. 16, 2012"}