{"name": "ELEX", "name_review": "ELEX Review", "ref": "https://me.ign.com/en/elex/139043/review/elex-review", "text": "If youve ever been on a date with someone who seems very interesting and pleasant, but suddenly goes on tirades about lizard people or how the Illuminati faked the moon landing, you have some understanding of my love-hate relationship with ELEX. Its a sprawling, ambitious, Euro-style RPG in the tradition of series like The Witcher and Gothic, and theres plenty to admire peppered across its more than 50 hours of adventuring. But while it spends about half its time making me want to sing its praises, it spends the other half making me want to pull every single hair out of my scalp. The seamless open world is built on a strong foundation of detailed lore that feels unlike anything the genre has thrown at us before. There are dazzling sci-fi elements like super soldiers and radioactive mutants, but also a clan of woodsy wizards who shun all technology. There are exciting influences from Fallout and Mad Max, with sand-blown, post-apocalyptic ruins and gangs of mercenaries in biker leathers, but also a medieval-ish religious order that worships the god of machines. Somehow, it all fits together in a way that feels interconnected and believable. The sheer uniqueness always left me wanting to dig deeper and learn more. The early part of the main quest involves aligning with one of the three main factions, and while each has a very distinct aesthetic, values they expect you to uphold, and a unique set of quests, they unfortunately dont play as differently as I expected. I quickly found that trying to treat ELEX like a shooter, or make a go of things as a pure magic user, isnt terribly viable. Ammo and mana potions are too scarce, and going all-in on ranged makes it very hard to defend yourself against most monsters. Melee weaponry almost always ended up being my main combat tool, and a lot of the supposedly exclusive abilities for each faction are mirrored in the other two. For example, many of the buffs available through Berserker magic have almost direct analogs in the psychic powers of the Clerics and the stimulant consumables that can be manufactured by the Outlaws. So in practice, theyre the same abilities shuffled to different parts of the skill tree. The story's twists are unexpected and memorable.The story is definitely the strongest pillar holding up ELEX. The twists are unexpected and memorable. The characters are endearing, with multi-layered and engaging backstories. Duras, a stoic warrior and your first companion, has a checkered past that presents many interesting questions as you pick through it. Nasty, an outlaw who seems like a stereotypical, curse-flinging, edge girl femme fatale has a meaningful arc of growth that sheds light on her behaviors in a believable way. There are enough potential variations in the ending that I almost want to play it again to see more of them. And its all accompanied by almost shockingly high-quality voice acting. Yet for an RPG that puts so much emphasis on player choice, there really arent a lot of opportunities to solve problems by means other than combat. I built my character to take the fullest advantage of speech-based personality skills, as I often do. Disappointingly, I could count on one hand the number of times I was actually able to use these skills to change the outcome of a quest. Putting so much emphasis on combat isnt necessarily a bad thing, but the fact that I was given the option to dump points into skills that will almost never come up in a meaningful way feels like I fell into a trap set for idealistic fools who thought they could solve problems with diplomacy. The biggest problem with ELEX is that its buggy to the point I almost wasnt able to finish it. Broken event triggers, horrible party member AI, and missing or misplaced map markers that make quest targets impossible to find call to mind the worst of Fallout: New Vegas or Vampire the Masquerade: Bloodlines at the time of their respective releases. At one point I had to chase down and speak to every named NPC in a large town - most of which do not stay in one place for long - due to having no indication of which one had the quest that would let me advance the story. In another case, I spent almost an hour jetpacking around looking for a way into a locked structure because thats where the quest marker told me to go, and I was never tipped off that it unlocks through another quest I hadnt completed yet. Im not the kind of RPG player who needs everything spelled out for me with GPS directions on every quest. But the reason great games like Morrowind got away with less hand-holding was the fact that you could read books, talk to guards, or otherwise get clues from the environment on where you needed to go. ELEX offers none of that, so a lot of quests arent so much involved treasure hunts as they are a guessing game mixed with hide-and-seek. Maybe developer Piranha Bytes will fix it in a few months with some extensive patches. It certainly has the ingredients to be a come-from-behind success story like New Vegas or Bloodlines (though fixing the latter was largely a fan effort). But at the moment, I just cant recommend anyone spend money on the technical disaster area that is ELEX. ELEX made me feel like I had to break its core systems to win.Even when everything is working as intended, the combat balance often feels absurd. Games like Dark Souls are punishing, but never feel unfair. Certain quests in ELEX, on the other hand, made me feel like I had to break or circumvent its core systems to win. Some required me to snipe a couple enemies from a large group with fireballs at a distance, run several hundred yards to a shack with a bed, take a quick nap to regain my health and mana, and return to repeat this process four or five times. Thats a tedious way to fight. One boss took me almost two hours to slay because I had to keep trying until I got lucky enough not to trigger his unblockable, nearly undodgeable rock-throw attack (which he could somehow hit me with even when I was standing directly behind him) too many times. On top of the poor encounter design, moment-to-moment combat is irritating because of things like imprecise hitboxes and animation timings, especially on area attacks. Enemy damage scales up way too quickly in comparison to yours throughout the middle levels, forcing frequent grinding detours to catch up. Too often, I felt that I was fighting poor design choices rather than monsters. The designers also seem stubbornly phobic of many quality-of-life features that became standard in the genre for a reason. Things like having to constantly buy potions from vendors to heal yourself while also dealing with the constraints of a stingy, gear-focused economy are throwbacks to the bad old days when your survivability was based on the size of your wallet. Its hard to believe a lot of balance testing and tuning was done on loot drops, monster stats, and player abilities. The math involved all comes across as arbitrary rather than carefully thought-out, from the fact that the endgame armor costs more than I made in 30 levels of exploring and questing to the aggravating reality that damage from hard-to-avoid ranged attacks is so high, fights with more than three foes at once are almost always suicide, even at higher levels. There are lots of little moments that made me go, How did this make it into the release version? One prominent example is the fact that theres a long, unskippable conversation right before the highly difficult final boss fight, and you cant save after it - so youre forced to mash B to get through a bunch of dialogue on every single attempt. Its one thing to make me earn my victory  its another to punish my defeats with an annoying inconvenience every time, especially on a fight designed to take several attempts to complete. The best-case scenario for ELEX is that itll be worth picking up on sale a year or two from now after its been heavily patched to fix its rampant bugs and infuriating balance problems. It has enough good ideas that one day it might be talked about as one of those hidden RPG gems that people play and wonder why it wasnt successful at launch. But the frothy mix of joy and frustration that ELEX presents today skews too heavily toward the latter. I wish it well, but I dont think Ill be calling it up for a second date.", "date": "Oct. 20, 2017,"}