{"name": "Wreckateer", "name_review": "Wreckateer Review", "ref": "https://me.ign.com/en/wreckateer-135604/58947/review/wreckateer-review", "text": "On the surface, simplicity and accessibility seem to be the common denominators defining casual gaming's best -- really, what makes go-to games great is their mastery of instant tension and speedy release. Few things are more stimulating in games than the sensation of not knowing whether you'll succeed or fail. An excellent title gives players of any skill the control -- and a splash of luck -- to complete any task. Wreckateer is an excellent example of a game understanding everything that makes experiences like it such fun to play. The premise and execution are simple and accessible: you aim and fire various ammo at destructible castles. The Kinect-powered airborne attack input is a terrific balance of anxious waiting and satisfying result. You rely on yourself as much as fortuitous physics when you make your mark. Wreckateer has all the necessary components to make an amazing casual puzzle game, yet it falls just short of ~irresistible addiction~ and instead settles for ~amusing distraction.~ As an intern under two veteran wreckateers, you're learning their methods to demolish goblin-infested castles with a ballista. The story starts and stops there, and it's all the excuse you'll ever really need. Firing simple rocks escalates into more elaborate ammunition types, and each requires careful aiming and delicate babysitting right up until the moment it makes something crumble. Even as you aim for dynamite strapped to walls, there's a strange, soothing calm to Wreckateer's demolition. The wait between attack and result is a long one, and you're involved throughout all of it. You'll fling your arms about to add spin to your shots, detonate bombs, rip one rock into four small ones, and float flying bullets through points collectibles. Each time your shot makes its mark, there's a satisfying crunch as castles crash to the ground, onto each other, or into groups of their evil occupants. Watching the points rack up alongside badges earned for risky shots or wrecking houses reinforces that good feeling, even more so when you've filled the multiplier bar. It's a stellar feeling after 15 seconds of wondering whether or not you're going to get where you want. Blow this bomb beneath the bridge to take it out at its support. You never know which four to five shot types -- such as a winged projectile you can steer with your arms and the aforementioned chunk that splits into four smaller stones -- you're getting when you start a stage for the first time, and part of the puzzle is figuring out which serves the best purpose, and in what order. This keeps each of the 60 levels, spread across four hours or so, more interesting than the actual levels. There's no identity to any of the 10 worlds. Some have snow. Some have canyons. Some have a darker hue. But the actual layouts aren't very interesting in the grand scheme of things There's only so much you can do with assorted layouts of walls and towers, and Wreckateer exhausts its options early. Although it's entertaining to break stuff, you'll want to do it in very short bursts so it doesn't blur together. Late in the campaign, Wreckateer mixes things up with new variables. Sometimes you need to collect floating power ups to cross a canyon or punch through multiple towers. Without using this stuff, you'll fail, and failure is Wreckateer's greatest enemy. Certain stages makes it suddenly -- and incredibly -- hard to meet the bronze medal's minimum requirements to proceed. By the time I finally earned it, I didn't know what I'd done differently, and I didn't want to keep playing. It's frustrating to go from having a good time lazily smashing stuff and solving puzzles to replaying the same stage a dozen times. Kick back, relax, smash. Even if it weren't a cute and fun puzzle game, Wreckateer's use of Kinect is a beacon of hope that this device is worth using. Wreckateer employs and understands a few basic gestures, so there's little room for you to fail because the sensor wasn't listening. Wreckateer knows the limitations of the device and leverages them to its advantage. You can squeeze some precision out of broad movements, which future motion games could learn from. CLOSING COMMENTS In longer sessions, Wreckateer exposes the extent of its creativity, leaving you with little to wonder about and discover as you grind through too-similar stages. But it works both as a Kinect puzzle game and a relaxing casual diversion. You can distract yourself with a few rounds of ripping structures to pieces and go on with your day, and come back later to enjoy more. IGN RATINGS FOR THE WRECKATEER (XBOX 360) Rating Description out of 10 Click here for ratings guide 6.5 OVERALL Okay (out of 10) In longer sessions, Wreckateer exposes the extent of its creativity, leaving you with little to wonder about and discover as you grind through too-similar stages. But it works both as a Kinect puzzle game and a relaxing casual diversion. You can distract yourself with a few rounds of ripping structures to pieces and go on with your day, and come back later to enjoy more.", "date": "July 24, 2012,"}