{"name": "Kingdom Hearts 3D: Dream Drop Distance (The Mark of Mastery Edition)", "name_review": "Kingdom Hearts 3D: Dream Drop Distance Review", "ref": "https://me.ign.com/en/kingdom-hearts-3d-dream-drop-distance/58806/review/kingdom-hearts-3d-dream-drop-distance-review", "text": "Disney and Final Fantasy - it's the mash-up we never knew we always wanted. Now Kingdom Hearts, the franchise that seemed like such a stretch when it first debuted for PlayStation 2 in 2002, is celebrating its 10th anniversary. Commemorating the occasion is the release of Kingdom Hearts 3D: Dream Drop Distance for Nintendo 3DS, a fitting culmination of 10 years of keyblade action. Kingdom Hearts 3D marks the return of Sora and Riku, two of the franchises most beloved characters, both of whom date back to the very first game. Dream Drop Distance follows the two heroes as they attempt to pass the Mark of Mastery exam (which entails each of them saving parallel versions of seven different worlds). If they pass, theyll be deemed true Keyblade Masters, with the tools and know-how to combat the return of the evil Xehanort (teased at the end of Kingdom Hearts Re:coded). If they fail well, lets just say failure isnt an option. In addition to the concepts that have come to be KH staples (Disney-themed worlds to explore and save, Final Fantasy throwbacks and cameos, a focus on characters and collection, and so on), KH3D also brings several new mechanics to the series. One such addition comes in the form of the Flowmotion combat, allowing players to utilize the environment to dodge enemies and execute special attacks. By adding an extra dash of excitement and strategy, as well as transforming the way you move and interact with enemies and the world around you, Flowmotion completely reinvigorates the already innovative real-time, RPG battle system (which allows you to use items and perform keyblade or magic attacks with the touch of a button). It can also be used to jump up buildings and soar across the worlds with dizzying speed. The frenetic implementation of this new mechanic is thrilling. Even if it can be a tad touchy at times, and takes practice to utilize to its fullest, it will make you wonder how you survived so long without the ability to move so quickly and gracefully from one area to the next. Another new addition to Dream Drop Distance - and part of the reasoning behind the games title - is the Drop system, which forces you to switch between Sora and Rikus separate yet overlapping storylines after a certain amount of playtime has passed. The mechanic can be somewhat jarring at first, as you can be pulled away from what youre doing at any given moment, whether youre in the middle of a big fight or near the end of a world. However, once you get used to its abrupt nature, it adds some excitement and immediacy to the adventure, and also serves to remind you not to neglect one storyline in favor of the other. With the ability to Drop any time you choose, and the inclusion of the Drop-Me-Not item to extend your time, this new system proves a great addition to the series. And while both Sora and Rikus storylines each revolve around parallel versions of the same seven worlds, Square Enix did a surprisingly effective job of changing them up, ensuring they each feel different and contribute something new to the overall arc. While the Drop system was a bold move, and a risky one at that, in the end it pays off nicely and proves a clever way to shake up the KH formula and successfully tell two parallel stories at once. Can Sora and Riku overcome the darkness? The Command Deck system first seen in Kingdom Hearts: Birth By Sleep has made a welcome return in Dream Drop Distance, allowing players to collect and equip different abilities for easy access in battle. Once used, these abilities have a cool down period, ensuring you dont harp on the same magic attack over and over again. Its a handy system, especially when you need to grab a potion in the middle of a boss fight or switch between fire and ice moves on the fly. The desire to customize your deck with the best moves possible only adds more fuel to the collectible-hunt. Kingdom Hearts 3D does a fine job of utilizing the 3DSs various capabilities to make for a truly unique experience. The Reality Shift mechanic uses the touchscreen to bend the world around your character. When near certain objects, you can take advantage of that worlds specific Shift - whether its launching barrels in Traverse Town, grabbing a ride on the Faith Line in La Cit des Cloches, or hacking the system in The Grid. Alternately, the game uses the systems camera and AR functionality to allow you to interact with your characters Dream Eater - a virtual pet of sorts that offers assistance during battles and can be used for special combo moves when its Link meter is full. Using the stylus to pet your Meow Wow as it rolls around your coffee table is quite adorable, and an unexpectedly fun addition to the game, even if it doesnt add too much to the overall experience (Nintendogs plus Dream Eaters, anyone?). Despite its various successes, Dream Drop Distance still suffers from a handful of the same problems that have plagued the series since its inception. The platforming is still a bit off, as the characters often don't seem to interact with the environment exactly as youd expect them to. You cant always jump on things that you should logically be able to jump on, and the way your character moves and controls could be smoother. While it can prove frustrating, its not bad enough to keep you from wanting to press forward, and the gameplays merits still far outweigh this negligible flaw. The story serves to push Sora and Rikus arcs forward, paving the way for the long-awaited sequel, Kingdom Hearts III. Unfortunately, it can be hard to follow at times, and simply isnt told in the clearest, most logical way possible. It gets continually stronger as the game progresses, but suffers from some pacing issues in the very beginning before the story really takes off, and is told in such a way that those not familiar with the franchise will likely feel lost before visiting the first World. Thankfully, the game gives newcomers a chance to brush up on core story and gameplay elements via the Memento system. This allows you to unlock optional Tutorials, Flashbacks (which give insight into old Kingdom Hearts and Disney plotlines), and Chronicles (which give the gist of what went down in past KH adventures). Even if it can be convoluted and hard to follow at times, that a game with Mickey Mouse as King is endeavoring to touch on such heavy themes (like the relationship between the body, soul and heart, the darkness within us all, and the significance of dreams and human connection) is truly impressive. The result, despite whatever problems the game encounters along the way, is quite effective and moving. While the Final Fantasy elements are seriously downplayed in Kingdom Hearts 3D (worry not - youll still run into some playful or entrepreneurial Moogles along the way), portable gaming enthusiasts should look forward to some incredibly well-executed cameos by The World Ends With You characters like Neku, Joshua, Rhyme and Beat. The way these characters interact with the KH cast is priceless, most notably Nekus bewilderment at Soras upbeat attitude when the two first meet. This game marks the first time these characters have been fully voice-acted, and its enough to get any TWEWY fan chomping at the bit for a sequel. Rounding out the package are some seriously gorgeous graphics and amazing sound presentation. The game looks incredible, with spot-on character and world design that successfully brings all these franchises to life, while at the same time makes them feel at home in the same universe. Every now and then youll see an environment that doesnt quite hold up, but this is rare, and for the most part the game looks incredible and boasts some of the best graphics on the system. The music, care of series veteran Yoko Shimomura, captures the essence of each world and character - remarkable considering none of the Disney film music is actually used. Dearly Beloved, a track that dates back to the original game, will still bring you to tears with its haunting and heart-rending melody. The voice acting is similarly well done, with much of the original cast reprising their roles. CLOSING COMMENTS Despite its problems, Kingdom Hearts 3D: Dream Drop Distance is an enjoyable experience with an engaging story and incredible characterization. Although the platforming is far from fluid and the story can feel convoluted at times, when KH3D soars, it soars high - capturing that KH magic that has propelled the series to great success for a decade now. Dream Drop Distance captures the quality of the console releases, but in bite-sized chunks fit for a portable, and successfully whisks players away to the world of Disney films like Hunchback of Notre Dame, Pinocchio, Tron: Legacy and more. Overall its a great new entry in the series, one befitting Sora and Rikus return. With the excellent additions of Flowmotion combat and the Drop system, this may be the best portable entry in the series to date. IGN RATINGS FOR KINGDOM HEARTS 3D: DREAM DROP DISTANCE (3DS) Rating Description out of 10 Click here for ratings guide 8.0 Presentation The story is silly, but hits the right notes and can be quite moving at times. The Memento system helps bridge the gap between new and old players. 8.5 Graphics Gorgeous graphics that rank among the best on the system and really bring the familiar worlds/characters to life. Occasionally an environment doesnt hold up, but overall its a great-looking package. 9.0 Sound Lovely music from veteran KH composer Yoko Shimomura - Dearly Beloved will still bring you to tears with its haunting melody. The voice acting is spot-on and its a nice touch that much of the original cast has returned. 8.5 Gameplay The Drop system and Flowmotion combat are great additions to the real-time RPG system KH innovated so many years ago. 8.5 Lasting Appeal Even though there are only seven worlds, the parallel storylines, plethora of hidden treasure chests and multiple difficulty levels make for a pretty lengthy experience. 8.5 OVERALL Great (out of 10) Despite its problems, Kingdom Hearts 3D: Dream Drop Distance is an enjoyable experience with an engaging story and incredible characterization. Although the platforming is far from fluid and the story can feel convoluted at times, when KH3D soars, it soars high - capturing that KH magic that has propelled the series to great success for a decade now. Dream Drop Distance captures the quality of the console releases, but in bite-sized chunks fit for a portable, and successfully whisks players away to the world of Disney films like Hunchback of Notre Dame, Pinocchio, Tron: Legacy and more. Overall its a great new entry in the series, one befitting Sora and Rikus return. With the excellent additions of Flowmotion combat and the Drop system, this may be the best portable entry in the series to date.", "date": "July 18, 2012,"}