{"name": "Test Drive: Ferrari Racing Legends", "name_review": "Test Drive: Ferrari Racing Legends Review", "ref": "https://me.ign.com/en/test-drive-ferrari-racing-legends/58418/review/test-drive-ferrari-racing-legends-review", "text": "When the engine is gunning away full-bore with a satisfying howl and the scenery is whipping by in a blur, it's easy to appreciate the raw power found in the gorgeously designed racing beasts in Test Drive: Ferrari Racing Legends. An inherent lust for the iconic red sexiness cranked out by the renowned Italian sports car manufacturer will certainly enhance your appreciation of this high-speed homage to all things Ferrari, but it's a shame that a draconian difficulty curve puts the brakes on the fun too soon. Is this what a quarter-million dollars feels like? Ferrari Racing Legends straddles the line between hardcore simulation and arcade-style racing in a way that's accessible to newcomers without stripping out all the challenge. Considering these are the same folks behind the sim-y Need for Speed: Shift games, it's no surprise these mean racing machines are generally responsive and handle well at high speed. Though each of the 50+ unlockable rides drive differently, three adjustable driving model presets let you tweak the overall physics and realism level to suit your skill. The novice setup offers maximum handholding to keep casual players from careening off the track. In contrast, engaging pro mode doesn't quite crank all of the realism dials to 11 like in some other racing sims, yet it does make it tricky enough to put veteran gear-heads through their paces. The campaign ditches the open world flow of Test Drive Unlimited in favor of more traditional closed-circuit tracks and a minimalist story that plays out almost entirely through informative but unexciting menu text. It feels like a few steps backwards for the genre, but widely ranging objectives save the day. In addition to standard races, you'll face off against rivals, work to stay behind a partner racer within a three second window, shoot to beat specific lap times, and work to overtake all other cars on the track. While this variety helps switch things up, other areas of gameplay sometimes feel a little too by-the-book. Tom Selleck's mustache not included...unless you pre-ordered (just kidding!). You won't find much of the flashiness of other modern racers here either. Ferrari Racing Legends pushes authenticity and simplicity over style both in its presentation and gameplay. As crazy as some of the tougher courses can get, they're less visually dynamic than the off-road terrain and urban vistas of similar genre entries. An impressive number of race events are spread out across three separate campaigns that tackle different eras of Ferrari history and do a masterful job of showcasing the evolution in car designs over the years. With its cool sepia-faded intros, older classic cars, and more accessible courses, the Golden era (1947-1973) stretch is the most enjoyable. Unfortunately, Ferrari Racing Legends derails in its Silver (1974-1990) and Modern (1990-2011) era portions. Even if you have everything dialed back to their most forgiving settings, these latter campaigns are simply brutal, delivering a jarring spike in difficulty early-on that will rapidly whittle away the patience of even the most skilled drivers. Prepare to suffer agonizing failure over and over again, even with seemingly spectacular runs. CLOSING COMMENTS High-speed thrills hit the wall too soon in the punishing campaign, and despite a solid range of multiplayer, quick race, and time-trial options, progressing through the three distinct eras to unlock all the tracks and sweet rides is a big part of the fun that gets trampled by the clumsy execution. IGN RATINGS FOR TEST DRIVE: FERRARI RACING LEGENDS (XBOX 360) Rating Description out of 10 Click here for ratings guide 6.5 Presentation A cool multi-era campaign spins out with minimal flair and dull story delivery. 7.5 Graphics The authentic cars and tracks look great, despite the lack of extra flashiness you'd expect from modern racers. 6.5 Sound Lots of engine revving and tire screeching with little to no musical accompaniment to complement the action. 7.0 Gameplay A solid balance between arcade racing and hardcore simulation, until you're bludgeoned by the latter half of the campaign. 5.0 Lasting Appeal Asinine difficulty spikes pillage the racing action mid-campaign, leaving little left to enjoy once you hit the wall. 6.5 OVERALL Okay (out of 10) High-speed thrills hit the wall too soon in the punishing campaign, and despite a solid range of multiplayer, quick race, and time-trial options, progressing through the three distinct eras to unlock all the tracks and sweet rides is a big part of the fun that gets trampled by the clumsy execution.", "date": "July 4, 2012,"}