{"name": "Spec Ops: The Line", "name_review": "Spec Ops: The Line Review", "ref": "https://me.ign.com/en/spec-ops-the-line/58233/review/spec-ops-the-line-review", "text": "Nothing good ever happens to anyone in Spec Ops: The Line. It starts with a rescue, a rough situation destined to get worse, and unravels in a downward spiral where only bad things happen to good people. By the end, physical, mental, and moral disruption leave each character in a very different place than they started. You almost expect it to have been written by Game of Thrones author George R.R. Martin. This isnt a good thing for Captain Martin Walker, our intrepid hero whose will weakens with every enemy encounter. He transforms from a cheesy clich to someone you sympathize with, and then develops into something despicable. How he gets there isnt up to you -- what it ultimately means, though, is entirely your call. Story is Spec Ops strong suit, and while the inconsistent combat isnt ideal, the gameplay does a great job of facilitating that narrative between intense encounters. In fact, The Line accomplishes something most shooters dont bother with: It makes violence meaningful. Every firefight ends with Walker and his Delta Force squad regretting what they've done. Yeah, that's pretty bleak. The Line puts them in the precarious position of fighting their brethren. Rogue American soldiers whove abandoned their duty in Dubai attack on sight, and not without reason. The city is a wasteland, the environment is as hostile as the refugees, and surviving requires aggressive self-defense. Dubai hosts a civil war between multiple factions trying not to die. The Deltas are just one of these groups. As Walker, youll discover dark and disturbing things about Dubai and the people stuck within it. In your mission to save civilians and make contact with a former commander, youll make tough decisions that arent like other video game choices. Morality isnt a feature or mechanic in Spec Ops: The Line -- each ethical quandary Walker deals with are subtle story beats dealt with by in-game action rather than a separate yes/no mechanism. You project their meaning and importance onto your character without seeing substantial in-game consequence. Deciding which of the bickering, increasingly angry teammates to side with, or who lives and dies, doesnt affect the outcome of your rescue mission. In fact, the finale has a greater effect on the six hours leading up to it. Choice changes what it means to be this man. He makes the inevitable bad call and deals with it, nothing more. On the other side of every door and dune are are conspiracies, betrayals, and mysteries waiting for Walker. The battles on the way to each one strengthens The Line's constant tension. Walker is just a man, and bullets rip him to pieces. Hes vulnerable and his enemies are aggressive, which encourages intelligent tactical combat. Dubai's greatest deceit is its alluring beauty. The Line introduces new variables in each fight. Sometimes sandstorms, sunshine, or objects obscure your vision. Fast-moving melee specialists, heavy gunners, and grenadiers force you to stay mobile and risk exposure. Destroying walls to drown enemies in sand is as viable a tactic as taking a turret, popping out of cover with a SCAR, or commanding squadmates. Marking targets keeps you safe while slipping from one unreliable cover point to the next, and issuing commands to stun soldiers with flashbangs keeps them from suppressing you. Walkers commands are simple and few because he doesnt rely on them. When theyre not shooting at walls, Lugo and Adams -- Walkers left- and right-hand men -- are capable of dealing with waves of attackers. They saved me from dying multiple times when Spec Ops mechanics failed me. On multiple occasions, Walker didnt slide into or sprint out of cover properly. Half the time I tried protecting myself, my character stopped dead before dropping dead. Vaulting over objects is an issue as well because its input is the same as the melee attack, meaning Walker would sometimes punch the air instead of hop over a barrier. With no evasive roll to dodge effectively, control problems hung me out to dry. Sandstorms will blind soldiers and tear down buildings. Unpredictability and variety are the saviors of Spec Ops standard stop-and-pop formula, and neither exists in its online multiplayer. The adversarial side of The Line is an empty experience that relies on your lust for unlockables without presenting a reason to care. Getting new guns, protective gear, perks to boost stats, and cosmetic apparel is fun, but playing eight-player deathmatches on large yet cluttered maps is hardly a thrilling method to earn them. The reward system itself is a letdown, too. The prizes for leveling up are similar weapons with minimal improvements and too-familiar ballistics. The beacon of hope in multiplayer is the objective-based Buried mode, which tasks two teams of four to sabotage the enemy HQ while defending their own. Its a tense tug-of-war full of panic and planning -- its a shame such a smart game type is trapped in the shell of an unremarkable online afterthought. Multiplayer lacks the aesthetic spirit of the single-player campaign as well. What begins as a drab, brown desert shooter suddenly discovers a gorgeous, colorful personality. The purples, blues, greens, reds, and golds of the campaign's incredible interiors leave lasting impressions; you'll associate red and green with different but equally unsettling events. Color certainly exists in the multiplayer maps, but it isn't spotlighted or emphasized in a meaningful way. Meanwhile, the rock music of the early game gives way to somber acoustic melodies as the Delta crew deteriorates, further establishing the unforgiving tone in and out of combat. When all's said and done and the dust has settled, Spec Ops puts players in an interesting position. The endings -- whichever one you get -- are open to interpretation while still offering closure. The new information shines new lights on various spots in the story that warrant a second run through the campaign. The depth of these convincing characters is clearer when you know the fate you're responsible for. You see Dubai and those left behind in a new way. Most importantly, you finally understand Walker, which could well change the way you act on his motivations. What you regretted the first time could eat you alive when it's done differently. This is why Spec Ops is a daring experiment worth celebrating. For the first time, a game with guns doesn't want you to be the hero -- it's wants you to feel terrible about trying to be one. CLOSING COMMENTS Spec Ops isnt about a war, protecting the world, or defeating some evil threat -- its about you, the effects of your actions, and events that are out of your control. The sum of Spec Ops unexpected story is an army shooter that makes killing people mean something. This, along with its thoughtful aesthetic and intelligent enemy encounters, defies the standard established by low-aiming action games. Multiplayer cant muster up the same courage, though, and while the hollow online experience doesnt detract from the single-player campaigns accomplishments, its reliance on convention doesnt do anything to elevate it. IGN RATINGS FOR SPEC OPS: THE LINE (XBOX 360) Rating Description out of 10 Click here for ratings guide 9.0 Presentation Story takes precedent over everything in Spec Ops, which the smart pacing and writing emphasize. 8.0 Graphics Great lighting and attention to detail save Spec Ops from its texture loading issues and unimpressive particle effects. 7.0 Sound Music plays an important atmospheric role, and the voice acting creates genuine and believable characters. 7.0 Gameplay Control and cover problems hurt an already standard shooter, but the intelligent encounters and level design make each fight exciting. 7.0 Lasting Appeal Multiplayer's a wash, but the campaign is worth replaying -- seeing the same events while knowing what's really going on is uncomfortable in new ways. 8.0 OVERALL Great (out of 10) Spec Ops isnt about a war, protecting the world, or defeating some evil threat -- its about you, the effects of your actions, and events that are out of your control. The sum of Spec Ops unexpected story is an army shooter that makes killing people mean something. This, along with its thoughtful aesthetic and intelligent enemy encounters, defies the standard established by low-aiming action games. Multiplayer cant muster up the same courage, though, and while the hollow online experience doesnt detract from the single-player campaigns accomplishments, its reliance on convention doesnt do anything to elevate it.", "date": "June 26, 2012,"}