{"name": "Resistance: Burning Skies", "name_review": "Resistance: Burning Skies Review", "ref": "https://me.ign.com/en/resistance-burning-skies/57477/review/resistance-burning-skies-review", "text": "Looking back at IGN's previews of Resistance: Burning Skies, the same idea keeps popping up: this is a handheld first-person shooter that feels like its console brethren. After shoehorning FPS games onto portables for years, having a true dual-stick shooter on the go is exciting -- it's just that Resistance: Burning Skies isn't. Burning Skies is a competent shooter with presentation problems that does little to thrill you. Like most shooters these days, Resistance: Burning Skies is broken into two parts -- single player and online multiplayer. The solo campaign casts you as Tom Reilly, a New York firefighter thrust right into the action as the Chimera invade America for the first time. (Thus, this is a story set between Resistance: Fall of Man and Resistance 2.) Tom's just doing his job and rescuing people, but when the Chimera abduct his wife and kid in front of him, he's committed to the fight until he gets them back (translating into six chapters of gameplay that should take you six or fewer hours). Unfortunately, most of that is straightforward and mindless. Tom rarely speaks, and when he does, it's rarely about his emotions. We're just some dude blasting and hacking our way across a bridge because getting there is the objective and we're hoping to find some weapon upgrades on the linear path. There are cutscenes between each chapter, but they're always told from another character's perspective. We never get a genuine moment with Tom, so why should we care about his motivation? As such, the action is the main focus in Resistance: Burning Skies, and again, it's competent but lackluster. If you want to shoot things and peek out of cover, Burning Skies has it, but it doesn't have much more than that. Each time you run into a room, there are a bunch of Chimera to shoot. Most of these guys will just stand there and fight from one spot. Bosses are a breeze, and I think that has something to do with the way the game is controlled on the Vita. Oddly, Burning Skies disables the Vita's ability to take screenshots. See, the dual sticks and shoulder buttons allow for the console FPS basics that everyone knows. It's tight, responsive and going to make most feel at home. However, the Vita makes up for the buttons it's lacking with the front touch screen and the rear touch pad. You can double tap the back touch to run, and tap or hold the front touch to melee, interact with the environment and utilize each of the eight guns' secondary fire modes. Here's where the breezy feeling meets the controls. These touch mechanics work and were only annoying when I'd accidentally melee a door or fire a tag round into the floor trying to interact with an object. However, holding the screen to fire an RPG or mark an enemy for the Bullseye takes time, and I think that's why the enemies aren't all that challenging; they're giving you a chance to use the touch screen mechanics. There's a Burning Skies Trophy for killing a bunch of Executioners -- huge enemies each with a cannon for an arm -- but when one of these guys would show up, I'd stand in the open, tag the cannon with the Bullseye, and then empty a clip from cover. The game gave me ample time to do this without getting blown away by the beast. I didn't need a crazy strategy or to stay on my toes. It was as if the game was saying ~Use the secondary now!~ Even though the game does offer different difficulties, I found the ones unlocked from the get go to be like this but with less health for Tom. In the spots where I did die, Burning Skies became all the more frustrating due to its poor checkpoint system. Sometimes, I'd start quite a ways back from where I perished (the bridge section), and other times I'd start before a pivotal moment and have to listen to the same conversation over and over (the final boss). When you switch to multiplayer, you lose the gripes about story and the ho-hum enemies, but you don't find the hook that'll make Resistance: Burning Skies a must have. Good for up to eight players, the online options are limited at best. There are no clans, a handful of maps, and perks that are just unlockable weapons and mods from the single-player campaign. If you're aching for a handheld shooter, the game's three modes (deathmatch, team deathmatch and survival) will be here for you, but I dont know how much of a community will sprout up around this. Interestingly, one of my biggest complaints about Resistance: Burning Skies is the game's audio. The orchestral score is beautiful, but it doesn't seem to get used all that often. Instead, it seemed like my soundtrack was my own footsteps as I ran through single-player and multiplayer. In multiplayer, another issue arose where I'd be all alone in an area but gunfire would sound as if it was raining down on me. No matter where I was in a match, it sounded like I was in the heat of battle as long as someone somewhere was using his or her gun. CLOSING COMMENTS Resistance: Burning Skies has the honor of being the first true twin-stick FPS on a handheld, but it doesn't do much with it. The story here is forgettable, the action is formulaic, and the multiplayer is simplistic. If first-person action is your favorite thing in the world, Resistance: Burning Skies is at your service. Just don't expect it to shine like we know this franchise can. IGN RATINGS FOR RESISTANCE: BURNING SKIES (VITA) Rating Description out of 10 Click here for ratings guide 5.5 Presentation Tom Reilly's story is thin at best. 7.0 Graphics The environments seem empty but look sharp. The cutscenes artifact for some reason. 5.5 Sound The music sets a somber mood, but the usual soundtrack is footsteps and gunfire no matter how close to the battle you are. 6.0 Gameplay With the exception of a few touch screen issues, the game plays well. It just isn't that exciting. 5.5 Lasting Appeal Your first run through should take six or fewer hours. New Game Plus is available, but you should have the Platinum Trophy from the first playthrough. Multiplayer is thin on options and reasons to keep playing. 5.5 OVERALL Mediocre (out of 10) Resistance: Burning Skies has the honor of being the first true twin-stick FPS on a handheld, but it doesn't do much with it. The story here is forgettable, the action is formulaic, and the multiplayer is simplistic. If first-person action is your favorite thing in the world, Resistance: Burning Skies is at your service. Just don't expect it to shine like we know this franchise can.", "date": "May 29, 2012,"}