{"name": "Mario Tennis Open", "name_review": "Mario Tennis Open Review", "ref": "https://me.ign.com/en/mario-tennis-open/57219/review/mario-tennis-open-review", "text": "Marios extracurricular activities are so extensive at this point that it feels like he spends more time partying and participating in sports than he does saving Princess Peach. Thats not necessarily a bad thing. The strength of gamings most iconic franchise rests in its versatility. To that end, Mario is making his first sports spin-off appearance on the Nintendo 3DS. To say that it is a fun, addictive experience is easy enough, but Mario Tennis Open fails to capitalize on the franchises core strengths and suffers from a number of oversights, ultimately making it more memorable for what it could have done - and didnt. Developer Camelot has once again delivered a core tennis experience that carefully channels the idea of the original sport while wrapping it in a colorful cartoon world, making something that couldnt possibly appeal to everyone more digestible. This 3DS outing in particular attempts to strip away complexity on the surface, focusing on two primary methods of control: touchpad-based actions and gameplay that focuses on position and shot placement. There are no character-specific power shots or abilities that drastically shake up the straight forward concept of volleying a tennis ball back and forth, watching for a narrow window to fire a shot past an opponent. Further placing an emphasis on accessibility, Camelot uses the 3DSs gyroscope to provide an alternative control scheme that shifts the games camera from high above the court to just over the shoulder of the player, relying on physically rotating the system to place shots. In addition to this, the computer will automatically control movement if the circle pad is left untouched, allowing players to simply focus on shot timing. Given that the touch pad will highlight recommended shot types for each volley, Mario Tennis Open easily becomes a digital version of Simon Says. The optional nature of this control scheme wouldnt be a problem were it not for the fact that there is no way to bar players from utilizing it in online matches. The handicap of players allowing the AI to instantly react to shot placement is immense, immediately shifting Open from a game that could have had a competitive element to something far less. Still, there is something fundamental about Camelots production that remains addictive. The games cast of approximately a dozen characters, including your Mii, retains a basic skill structure, allowing you to focus on speed, power, defense and more strategies. The game wont change dramatically, but there is certainly a noticeable difference between Bowser and Diddy Kong. The absence of character-specific abilities is missed. The more characters stand apart, the better the experience is. The notion of being unique, and standing apart from other tennis games, is perhaps one of this games greatest weaknesses. Camelot has the entire Mario legacy and its wildly manic world at its disposal, but this time around the developer failed to embrace that idea. This is tennis, with some window dressing and a few ideas for accessibility and replayability. Yet at no time does it feel like this is a sport game embracing its key, defining attribute. It seems as though Camelot understood this on some level. Customization is a key concept in Mario Tennis Open. Almost every match  win or lose  will unlock some sort of item in the games shop, able to be purchased with in-game currency that you earn through separately featured mini-games. The constant reward will no doubt lure some players to play again and again, whether online, in exhibition or in Singles or Doubles Tournaments, which feature eight cups each. There are just two critical problems  you can only apply purchased goods to your Mii, and attributes of each item are not only displayed in the worst way possible (pie charts?!), you cant see their cumulative effect on your character. The notion of having a store, and having dozens upon dozens of collectibles that can be earned or purchased, is a fantastic way of extending replay value and gameplay versatility. Mario Tennis Open simply misses the mark. Not allowing the overwhelming majority of playable characters to be customizable is a huge oversight. Not giving players the ability to understand what changing a racket, shirt and shoes means to a characters ability is equally frustrating. Pie charts simply dont give enough information, particularly when stacked together. The fact that only Mii accessories give this information also means you wont have a definitive idea of whether your Miis altered stats are appreciably better than the default Yoshi or Wario characters. This could have been a huge selling point for the game, but its significantly flawed. Camelot didnt skimp with the games extras, however. In addition to the vast number of unlockables, the developer included four mini-games that are quite entertaining in their own right  with slight adjustments, these could have made for great eShop content. Most of these are simple variations on volleys, focusing on shot placement in different ways. Ring Shot, for example, forces players to position shot trajectories to go through gold rings of different sizes, with an emphasis on bonus points if multiple rings are hit in one shot. Super Mario Tennis has players hitting a ball against a wall that is actually displaying an automatically scrolling game of the original, 8-bit Super Mario Bros. Hitting coins, enemies and blocks not only increases the score but adds more time to the clock, allowing players to eventually reach the end of the level. Combined with Galaxy Rally and Ink Showdown, these tennis variations are a welcome addition, if not for their variety then the fact that they can earn you coins to purchase items in the shop. If you actually want to deck out your in-game Mii, these will need to be visited frequently. For anyone else, these will prove addicting for the relatively brief duration of their three main challenges, which will earn you the games hidden characters. Mario Tennis Open does feature some sound concepts for multiplayer, though stops far short of the community-based ideas of Mario Kart 7. Combine this with limited options for competitive play and you have something that isn't nearly as compelling as it ought to be. Still, the game allows for online, local, single cart download and StreetPass-based interactivity. Whether playing with (or against a friend), or that friend's Mii, there are plenty of ways to challenge others on the court. If you're a bit more casual, or are mostly concerned with playing locally (and therefore can agree on a play style), you'll find plenty to like about Camelot's design here. It's just a shame it didn't go a few steps further, something that can be said about Open as a whole. CLOSING COMMENTS The fundamental Mario Tennis Open experience is sound. Camelots decade of tennis experience means they understand how to make the sport engaging and addicting. Using the 3DSs touch pad or buttons for the games six types of shots is a welcome addition. The inclusion of a gyroscope mode allows players to strip away the challenging nature of court position to focus on selecting the right shot for the occasion. Yet Mario Tennis Open struggles in just about every other regard. The game never embraces its Mario heritage, never allowing itself to break out of a more typical tennis mold to be something unique. Online competition wont be fair since players cant omit gyroscope players ability to automatically navigate the court. Customization proves limited, despite its sheer quantity, because only Miis can be altered and the items statistics are displayed inadequately. Likewise, mini-game variations on tennis are rather creative, but wont hold up over time. Stacked up, these deficiencies overwhelm what is, at its core, a great game. Its a shame just about everything Mario Tennis Open attempts to add on top of that is remarkably unworthy of its lineage. IGN RATINGS FOR MARIO TENNIS OPEN (3DS) Rating Description out of 10 Click here for ratings guide 7.0 Presentation Tournaments and special games make for a solid single-player experience, but the lack of multiplayer, customization options hurts. 7.5 Graphics Reasonable considering the genre; you wont care much about the games 3D implementation. 7.5 Sound Surprisingly great music, but the character voices will get old quickly. 6.5 Gameplay The core idea here is great, but the game struggles in every other way. 6.0 Lasting Appeal A solid foundation for multiplayer, but weak customization and online options severely hurt the product. 6.5 OVERALL Okay (out of 10) The fundamental Mario Tennis Open experience is sound. Camelots decade of tennis experience means they understand how to make the sport engaging and addicting. Using the 3DSs touch pad or buttons for the games six types of shots is a welcome addition. The inclusion of a gyroscope mode allows players to strip away the challenging nature of court position to focus on selecting the right shot for the occasion. Yet Mario Tennis Open struggles in just about every other regard. The game never embraces its Mario heritage, never allowing itself to break out of a more typical tennis mold to be something unique. Online competition wont be fair since players cant omit gyroscope players ability to automatically navigate the court. Customization proves limited, despite its sheer quantity, because only Miis can be altered and the items statistics are displayed inadequately. Likewise, mini-game variations on tennis are rather creative, but wont hold up over time. Stacked up, these deficiencies overwhelm what is, at its core, a great game. Its a shame just about everything Mario Tennis Open attempts to add on top of that is remarkably unworthy of its lineage.", "date": "May 16, 2012,"}