{"name": "Sniper Elite V2", "name_review": "Sniper Elite V2 Review", "ref": "https://me.ign.com/en/sniper-elite-v2-106020/57198/review/sniper-elite-v2-review", "text": "Perched atop the bombed out husk of a building, I scan the razor wire fence line and nearby rubble far below for movement through the scope of my M1903 Springfield. Taking aim at a pair of Nazis chatting amidst the din of distant gunfire, I hold my breath, line-up my shot, and pull the trigger. The bullet spins through the air, hanging just for a second in the light, before it erupts through my target's eyeball in slow-motion and sprays blood, brains, and shattered cranium out the backside of his head -- all in gruesome X-Ray vision that provides a sickly intimate view of the grisly noggin slurry as it makes its grand exit. By the time my victim's body crumples to the ground and his comrade draws his gun, another bullet rockets out of my chamber. Only instead of connecting with meat and bone, this one falls slightly short of its mark, entirely by accident, and hits a live grenade attached to his belt. A lucky shot. One that sends body parts flying in a ball of flame. Amazing. It's incredible moments like this that show off Sniper Elite V2's real magic, elevating the act of pumping bullets into foes into an art form. Taking place at the end of the second World War, this third-person shooter puts you once again in the battle-hardened shoes of US sniper Karl Faireborne as you venture deep behind enemy lines into Berlin. Your mission is to take down or co-opt key scientific personnel to cripple the German V2 rocket program before crucial intel falls into the hands of the Russians. But to be honest, I care precious little about the specifics of why and who once I slink through a stage and find a good vantage point to start popping off shots. The raw essence of what it is to be a sniper is captured here marvelously, and it's this focus that keeps the setting and gameplay from falling into familiar WWII shooter genre ruts. V2's lengthy campaign delivers a satisfying trek through a well-designed medley of war-torn cityscapes ripe with tactical opportunities for assassination and covert sneakery. Setting charges to blow up bridges, rescuing prisoners, igniting armored tanks from afar, and sabotaging your foes round out a rotating array of objectives that bolster the more straightforward assassination-focused missions. There are still a decent number of all-out firefights that have you hustling on-foot and frantically spraying SMG fire into soldiers charging at you, but relying too heavily on such tactics gets you killed more often that not. This is a sniping game after all, and I appreciate that the fact you're toting a high caliber scoped rifle isn't merely an afterthought. You're just one dude against heavily armed forces. Getting caught out in the open with your pants down can be disastrous, since it only takes a few blasts of enemy gunfire to wipe you out. The same goes for being surprised by your foes in close-quarters. Limited ammo reserves, limited health, and the sluggish lag time when changing weapons all but ensures speedy death for the unwary. In any other shooter these would be faults, but they're a perfectly appropriate fit in V2. You're a specialist trained for stealth and long-distance precision, not an infantry grunt. As such, sneaking up to choke enemies from behind, using your silenced pistol for close range headshots, and masking the sound of your gunfire by timing it to coincide with loud background noises, and dragging dead bodies around to use as bait are all smart tactics at your disposal when you're not busting skulls open from afar. However, pitching caution out the window at times can be fun too, and V2's new checkpoint system and automatic health regeneration makes experimenting with risky moves less punishing than the original. n sharp contrast to the vulnerability you experience battling on the ground and in the open, V2 makes you feel like a death-dealing God every time you look down the barrel of the sniper scope. Fatal shots to the head, heart, lungs, groin produce spectacular and graphic death sequences that follow your bullet's trajectory from different camera angles as it zips across the battlefield in slow motion towards your target. When it finally connects, the awesome X-Ray kill-cam shows the brutal effects your bullet unleashes on your foe's internal organs and bone structure. It's gruesome to be sure, but V2 dishes out the most satisfying sniping I've ever encountered in a game. The realistic shot physics are a cool touch, and they can be toggled up or down to affect the challenge level dramatically. Shots get trickier to make as you add in other factors to deal with, like wind speed, gravity, distance, and the shakiness from breathing, and it feels even more rewarding to land them accurately this way. Regardless of your settings, if your shots are poorly aimed and hit non-vital areas, it takes several bullets to fell your foe. At times, the aggressive AI can make it very tough to line up proper aim when you're under intense fire, and it gets a lot more overwhelming further along in the game and on higher difficulty settings. Yet at other moments foes occasionally stand around and let themselves be slaughtered. Fortunately, the challenge is often a brisk one, and that's mostly a good thing. Sniping with a pal co-operatively through the main campaign is an enjoyable way to play, since you can revive one another and trade off spotting duties, though V2 has several other multiplayer options worth scoping out too. Battling waves of enemies in the survival-style Kill Tally is standard fare, while Bombing Run changes things up a bit by tasking you with recovering parts to rebuild your escape vehicle before the whole area is blown to bits. However, Overwatch is where multiplayer really gets cool. This mode has one player handle sniping duties from a distant perch while the other runs around at ground-level calling out enemy locations and pushing forward to reach checkpoints. These missions require careful collaborative teamwork, and they're a ton of fun. CLOSING COMMENTS V2's gratuitous X-Ray kill-cam adds a macabre elegance to every perfectly-timed shot you make that gives your careful handiwork an appealing artistic flair. While the ground combat and close-up encounters aren't as tight as you'd expect from a common shooter, the sniper gameplay is front-and-center here, and it's delivered with top-notch class and authenticity. Even if you think you've had your fill of the WWII genre, this ballsy tactical shooter could definitely change your mind, and blow other peoples' wide open. IGN RATINGS FOR SNIPER ELITE V2 (PS3) Rating Description out of 10 Click here for ratings guide 8.0 Presentation Creative menu transitions tie together the strong campaign and multiplayer modes. 7.5 Graphics Detailed stages are filled with nuance, though some minor visual bugs and fuzziness detract slightly from the thematic vibe. X-Ray kill-cam is amazingly cool. 8.0 Sound Dialogue is a little corny, but the great sound effects make up for it. 8.0 Gameplay The sniping focus is brilliantly done, outshining the less polished close-quarters combat. 8.0 Lasting Appeal A lengthy campaign mixes with optional co-op and compelling multiplayer options to extend the head-popping fun. 8.0 OVERALL Great (out of 10) V2's gratuitous X-Ray kill-cam adds a macabre elegance to every perfectly-timed shot you make that gives your careful handiwork an appealing artistic flair. While the ground combat and close-up encounters aren't as tight as you'd expect from a common shooter, the sniper gameplay is front-and-center here, and it's delivered with top-notch class and authenticity. Even if you think you've had your fill of the WWII genre, this ballsy tactical shooter could definitely change your mind, and blow other peoples' wide open.", "date": "May 15, 2012,"}