{"name": "Analogue: A Hate Story", "name_review": "Analogue: A Hate Story Review", "ref": "https://me.ign.com/en/analogue-a-hate-story/57149/review/analogue-a-hate-story-review", "text": "In the hands of another writer, Analogue: A Hate Story might have been a survival horror game. After all, its story centers on a derelict colony starship that just blipped back on the radar after an absence of many hundreds of years, and much like Dead Spaces Isaac Clarke, its your job to scrounge around and find out what led to such a sad state of affairs. But thats where the similarities end. Christine Loves Analogue isnt without its own horrors, but they lie in contemplating the ghosts of an overly patriarchal society left to evolve without outside influences instead of bloody squabbles with nightmarish baddies. This is as much of a story about love, betrayal, and duty as it is about hate, and the questions it raises linger in the mind long after finishing all five of the available endings. Yet in the end, thats exactly what it is--a story. Youll have to look elsewhere if youre expecting anything remotely action-based. It neatly sidesteps the label of mere interactive fiction like Loves other games thanks to some smart design choices, but that doesnt mean that much of your time wont be spent poring over dozens of complex journal entries from the dead crew and jotting down the occasional note. In this case, Love initially structures the narrative so you need to interact with the ships AI to recover the ships administrative password, which is hidden among accounts of everything from cryostasis and bar fights to structured misogyny and lesbian trysts, each punctuated by a competent techno score that captures in tone of the material in question. Its best compared to completing a puzzle. Not only does this provide the game-like experience of finding hidden nuggets of information, but it also ensures that you end up reading every page of Loves narrative. The good news is that most of its 59,000 words are worth reading. It's hard to relate the details of the dystopian story without venturing into spoiler territory, but Love presents a believable account of one grim direction an entire society could take if locked on a lost generational ship for centuries. Here, a forgotten revolution results in a heavy-handed patriarchal society in which women have such a low place that they're often not even called by their names. Knowledge rots to the point that the crew isn't even aware that there's a reason for floating about the stars in a giant hunk of metal. By the time we reach the period of the story (which is still 600 years before you arrive), the men aboard the ship discover a sick girl from hundreds of years ago, and the story gains considerable power from her attempts to reconcile her values from a period much like our own with one that resembles feudal Korea. In a masterful stroke, Love's decision to filter these accounts through the lens of the ships two widely different AI personalities renders any black and white judgment of the inevitable tragedy an impossibility. Weighty journal entries are laughed off with amusing sarcastic remarks by one AI, and you're prodded for sympathy by another. Youre also at their whim when trying to uncover necessary information, thanks to a convenient malfunction that prohibits them from understanding any input from you aside from simple binary responses. Its a welcome tactic of creating some suspense, since it becomes clear that one AI is hiding a hefty chunk of information after you unlock the second one, which has considerable consequences when youre forced to choose between the two toward the end. The only possible downside to all this is that youll need to revisit several entries youve already looked through in order to get the other AIs commentary (and possible extra data logs) if you want to get the most out of the game. Still, theres a least one bizarre break of character that threatens to undermine everything the game stands for, presumably in the name of adding a forced dose of visual variety. At one point, the AI who resents the misogynistic practices of the ships society relates that she likes cosplay and ask if you wouldnt mind dressing her up as a maid or a detective. This, on top of the fact that shes already sporting a schoolgirl outfit with a tiny skirt and thigh-high stockings when you first meet her. Its hard not to get the uncomfortable feeling that shes toying with the submissive concepts that lie at the very heart of whats gone rotten with the ship. On the other hand, the AI who represents the patriarchal side of the ships crew is attractively bold and outspoken by comparison, and her traditional Korean garb gives her an air of dignity and power that the other AI never achieves (although the unlockable concept art shows the designer originally had different plans). It's not enough to ruin the impact of story since you don't even need to change her outfit if you don't want to, but the game's so short that you could be forgiven for wondering why Love allowed the option in the first place. The closest Analogue comes to resembling a traditional game comes about 75% of the way through the storyline, when an unexpected emergency forces you to make some tough decisions under a timer through the ships DOS-style override terminal. Its not too challenging, although you might break a sweat if you havent been fiddling with the terminal up until this point. Pressed to compare it to a mundane real-life experience, Id say its comparable to trying to recover the contents of an untitled Word document after a Windows crash only twenty minutes before an article deadline, despite having never saved the document apart from the autosave function (and yes, this happened in my less disciplined days). After that little 20-minute interlude, Analogue largely follows the same pattern as before aside from some questionable romance options that largely come out of nowhere toward the end. In context, these seem more like pleas of desperation than love, particularly since the most you do is give the parties in question some attention. They're not as jarring as the cosplay break, but Love's tale would have been better without them. CLOSING COMMENTS Saying that Analogue isnt for everyone is a bit like saying that a couple of fans didnt like the ending of Mass Effect 3. Its the kind of game that appeals to those rare individuals who take the time to read through quest text in an MMORPG or savor every word of the journals in the Myst series, especially since theres not much of an actual game here beyond reading and the brief hassle with ships override terminal. Indeed, with a mere couple of hours of gameplay and less than 100 megabytes of data, it might enjoy more fame if adapted for the iPad. Yet regardless of what it lacks in traditional gaming excitement, Analogue presents a rich and mature story (its certainly not for kids) sprinkled with lively morsels of humor that keeps you involved despite some stumbles. If you're just as into science fiction novels as you're into gaming, you'll likely find much to enjoy here aside from the relatively steep asking price. IGN RATINGS FOR ANALOGUE: A HATE STORY (PC) Rating Description out of 10 Click here for ratings guide 6.5 Presentation Analogue has a sparse presentation overall, but it works for the subject matter. Menus are intuitive, but navigating the data logs can be a bit of a pain. 7.0 Graphics The only graphics to speak of center on sprites of the two AI figures, but theyre drawn well, and theres a version of each available for every necessary emotion. 6.5 Sound Analogue has a decent techno score that changes according to the mood of the proceedings, but it gets a tad repetitive since theres only one track for each mood. 7.0 Gameplay The binary questions work well in context, and the override terminal minigame stirs some excitement. 5.5 Lasting Appeal Analogue might be worth a few replays to see all of the available endings, but once thats done, youre likely done for good. 7.0 OVERALL Good (out of 10) Saying that Analogue isnt for everyone is a bit like saying that a couple of fans didnt like the ending of Mass Effect 3. Its the kind of game that appeals to those rare individuals who take the time to read through quest text in an MMORPG or savor every word of the journals in the Myst series, especially since theres not much of an actual game here beyond reading and the brief hassle with ships override terminal. Indeed, with a mere couple of hours of gameplay and less than 100 megabytes of data, it might enjoy more fame if adapted for the iPad. Yet regardless of what it lacks in traditional gaming excitement, Analogue presents a rich and mature story (its certainly not for kids) sprinkled with lively morsels of humor that keeps you involved despite some stumbles. If you're just as into science fiction novels as you're into gaming, you'll likely find much to enjoy here aside from the relatively steep asking price.", "date": "May 13, 2012,"}