{"name": "The Walking Dead: A Telltale Game Series -- Season One", "name_review": "The Walking Dead: The Game Review", "ref": "https://me.ign.com/en/the-walking-dead-the-game/56838/review/the-walking-dead-the-game-review", "text": "The best part of The Walking Dead: The Game's first episode -- ~A New Day~ -- is the thing that will turn many people off: the talking. If you're looking for a zombie game to shotgun your way through or to entertain you with one-liners and cuss words, it's best to ignore The Walking Dead altogether. This is a deeply personal and emotional experience, and that's why it feels so right as a part of this franchise. IGN's Fairly Spoiler-Free Walking Dead Video Review In the first of five episodes, you take on the role of Lee Everett, a man who may or may not be a killer. About the time Lee is getting transported to prison, the zombie apocalypse starts and gives him a ~get out of jail free~ card. For the next two hours, it's up to you to keep Lee alive and able to protect Clementine, the first grader in his care. All of this is happening concurrently with the comic book series. Lee's story kicks off at the beginning of the end of the world, so Rick, the protagonist of the books, is snoozing in his hospital bed. This is a new, independent group of survivors -- although you can expect a familiar face or two as a crossover -- so meeting each other and figuring out how you're going to survive is the thrust of A New Day. Yes, there are action sequences (a lot of them, actually), but you'll spend the majority of your time making decisions and living with the consequences. See, developer Telltale Games has built a brand new adventure game setup for The Walking Dead. Although you had to choose what to say in Telltale titles such as Back to the Future, you could double back in conversation trees and explore all the options. The Walking Dead removes that and ups the stakes. Here, someone will ask you a question and you'll have a limited time to pick one of four responses. Whatever you decide, you live with. Characters remember what you say and take note of your pronoun usage, demeanor, and so on. While this might simply be someone questioning Lee's story in this episode, Telltale says the way people perceive him is going to drastically affect future episodes. What if your squad finds out you've been lying from the get-go? Make your choice and live with it. For now, this means I've got a reason to replay A New Day. As soon as I was done with my first playthrough, I jumped back in to make different choices. Twice in this episode, you'll have to choose one life over another, and I had to see how saving each person played out. With three save slots, you're encouraged to have different takes on the same story. That's awesome and is something that guarantees I'm going to get a lot of playtime out of each Walking Dead episode, but it also pointed out how attached I had become to ~my~ story. The Walking Dead: The Game is a choose your own adventure zombie book, but when I started my second playthrough, I discovered I didn't want to make the other choices. I had built my Lee -- an honest, caring man -- and I wanted to see his story unfold. Going back and siding with a jerk in an argument or being mean to Clementine, that wasn't ~my~ Lee. In just two hours, I had become so attached to these characters thanks to their top notch voice acting and these deep conversations that wronging them broke my heart. That's kind of heavy for an adventure game, but it speaks to how well everything comes together here. But enough of all that emotional stuff, you do bash the skulls of quite a few walkers in A New Day. Similar to the revamped conversation system, The Walking Dead uses a new adventure control scheme. You navigate Lee with one joystick and then move an on-screen reticle with the other (WASD and a mouse on PC respectively). Environments are littered with interaction points that you can hover over with the cursor and choose to look at for more info, open, talk to or so on. When a walker nabs you, it's a frantic button-tap followed by a kill using whatever you have around you. As someone who was disappointed by Jurassic Park, I welcomed this new system. It's easy to get the hang of, and trying to target a slowly approaching walker is harder than you think (though it's easier with the mouse on PC), and the kills are gruesomely rad. Like, seriously, Telltale doesn't hold back on the blood and graphic violence, which is a very good thing. IGN's SPOILER-FILLED Talking Walking Dead That's another thing telltale nails -- the visuals. Being part of the comic universe, The Walking Dead has this cel-shaded look with thick black lines tracing vibrant characters and objects. It's striking and pretty. Plus, with the exception of a jarring camera cut or audio oddity, The Walking Dead runs really well. It's not perfect, but it's the best performing Telltale game with little slowdown and few stumbles. There is a moment or two where something goofy breaks the Walking Dead's narrative -- i.e. an adult not knowing a radio would need batteries or how to put in said batteries -- and I know some adventure gamers will be disappointed to find that there really aren't many puzzles. But these are really trivial things when you look at the whole of what's a remarkable start to an enthralling, true-to-form Walking Dead story. How Much Does Walking Dead Cost? Release Date? As it's coming to so many platforms, keeping track of how much The Walking Dead: The Game will cost you has been tough. If you're buying it on the PC or Mac, you get a five-episode season pass for $24.99 on Tuesday, April 24th. (EU gets the PC/Mac version for 24.99 Euros on Tuesday, too.) If you buy on PlayStation 3, you can grab each episode for $4.99 or buy the five-episode season pass for $19.99 on Tuesday, April 24th. (EU gets the PS3 episodes one by one for 4.99 Euros and the season pass for 19.99 Euros starting on Wednesday, April 25th.) If you get it on Xbox 360, there is no season pass so you'll have to pay 400 Microsoft Points per episode sometime this month. CLOSING COMMENTS The Walking Dead: The Game is off to a great start with A New Day. It has a believable cast of characters and a great look. Sure, the puzzles some adventure gamers love are missing and there will be an audio hiccup here and there, but as an introductory hook to the five-episode series, The Walking Dead Episode 1 has just about everything fans could want. IGN RATINGS FOR THE WITCHER 2: ENHANCED EDITION Rating Description out of 10 Click here for ratings guide 9.0 Presentation A New Day is a great story filled with cool moments and fleshed-out characters. 8.5 Graphics Some of the art has sharp edges and tiny details look blurred, but overall, the comic book style is colorful and inviting. It's a pretty game. 8.5 Sound Great voice acting brings the characters to life. Still an audio issue -- a character suddenly becomes softer -- here and there. 8.5 Gameplay The new control scheme is easy to get the hang of and fun to use. Not many puzzles. Kind of an interactive graphic novel, which I dig. 8.5 Lasting Appeal I played it twice to see the other side. Real value will come as you play other episodes and see if your choices truly change the outcomes. 8.5 OVERALL Great (out of 10) The Walking Dead: The Game -- Episode 2: Starved for Help wasn't what I was expecting. Rather than focus on more walkers and more headshots, the game turns everything around and made me focus on the possible threat of other survivors. It made me focus on who Lee would actually be in this world -- the guy with morals or the guy doing what it takes to get by. I dug that; it's definitely a different experience than the first episode (including its additional technical issues), but that's what I want out of episodic content.", "date": "April 24, 2012"}