{"name": "Telltale's Guardians of the Galaxy Episode 4", "name_review": "Telltale's Guardians of the Galaxy Episode 4 Review", "ref": "https://me.ign.com/en/telltales-guardians-of-the-galaxy-episode-4/138730/review/telltales-guardians-of-the-galaxy-episode-4-review", "text": "Talk about a rollercoaster ride: Following on the heels of the weakest Guardians episode of the season, Who Needs You is right up there with the first in contention for being the best so far. This introspective side adventure does almost nothing to advance the Stop the bad guys! plot, but taking a break from that obligation allowed Telltale to give us a snappy couple hours crammed with meaningful character moments, supplemented by just enough action to keep it from feeling like a soap opera. Drax takes his turn at center stage this time around (though Im sure hed insist he has never been on a stage, as he is not an actor), but I was somewhat disappointed by the relative brevity of his flashback sequence. He gets a mere one scene with his deceased daughter, but its one of the most powerful and tear-jerking scenes in a Telltale game since the first season of The Walking Dead and contains the first moment in any series where I felt like letting the choice timer run out and saying nothing sent a far more powerful message than any of the other options I could have chosen. At the same time, Episode 4 is still very much about Gamora and (depending on your earlier choices) Nebula, continuing and paying off their arc from the previous episode in a surprising and emotionally satisfying way. Its not always a given that all the little, So-and-so will remember this choices in a Telltale game are meaningfully vindicated in a single moment that really makes you feel like you did the right thing. Gamora and Nebulas interactions here did just that. Not all the consequences I faced seemed to line up with my prior actions, though. When the tensions that have been boiling throughout the series spilled over, the resulting backlash seemed like a predetermined outcome that I never had any power to change, despite all the opportunities Id been given to try to prevent it. I thought Id been reasonably successful, but it turned out Id accomplished nothing. Characters two whom Id shown the most favoritism werent necessarily the ones that sided with me. The one Guardian that did have my back was the last person I would have expected, which was an interesting surprise, but one that seemed to diminish the importance of my choices to the point that I wondered if this was the only way things could have turned out. It definitely raised my eyebrows in the heat of the moment.Who Needs You also throws a major curveball of the same magnitude as the fantastic Thanos encounter in Episode 1. While Im at least more than half certain its going to end up being a fake out, it definitely raised my eyebrows in the heat of the moment. Its a very dark chapter that leaves the team and the galaxy in mourning with bleak prospects, yet the tone never really lets go of the hopeful, adventurous spirit that has framed everything from the beginning. The action bits are goofy but exciting, and it seems like Telltales designers have finally solved the pacing issues between talking and shooting that most of the previous episodes have suffered from. After so many battles with a melodramatic Kree warlord, its nice to see Peter and the gang engaged in almost slapstick combat against a giant space worm - because why not? Theres enough interpersonal drama running through every scene that the whole fate of the universe thing isnt really missed for a second. Plus, repairing a spaceship in motion with a pair of broken jet boots while Queens Stone Cold Crazy blares was sublimely entertaining, and the best use of licensed music to punctuate a quicktime sequence in the series so far. I can definitely feel that end-of-series crunch happening in Who Needs You, where all the many choices Ive made have to converge back together to fit a limited number of endings. It comes across a bit heavy-handed in setting the stage for what seems like a somewhat predictable final chapter, but Telltale has surprised me before. As a standalone adventure, its definitely up there with Episode 1 as something Id play over a couple more times, not just to explore different choices but because its simply fun and exciting. The fact that it pulls very few emotional punches left me feeling a bit worn out, but also with a glowing sense of anticipation for the sprint to the finish and tying it all together.", "date": "Oct. 11, 2017,"}