{"name": "Legend of Grimrock", "name_review": "Legend of Grimrock Review", "ref": "https://me.ign.com/en/legend-of-grimrock/56876/review/legend-of-grimrock-review", "text": "As a kid, I grew up rolling d20s, charting out hand-scrawled labyrinths on graph paper swiped from math class, and concocting elaborate fantasy worlds to explore. And when I wasn't sitting around a table with my pals debating the finer points of casting Magic Missiles instead of Delayed Blast Fireballs, I spent my free time affixed to a clunky old PC playing games like Eye of the Beholder and Dungeon Master. Digging into Almost Human's shiny new take on hardcore old-school dungeon crawlers is a warm fuzzy trip down memory lane, but one of the most impressive things about Legend of Grimrock is the way it showcases how well the classic formula holds up after so many years. Things get off to a rough start for your posse. Charged with treason against the king and hauled atop Mount Grimrock's towering spire, armed spearmen hurl your group down into the mountain's cavernous void to die. Survival hinges on scavenging, battling, and puzzling your way downward into the treacherous labyrinth in hopes of reaching the exit with your hide intact. The minimal plot setup is fleshed out just enough to set the stage for some serious catacomb crawling, and that's fine by me. Like the classic games it riffs on, Legend of Grimrock is all about crafting a killer quartet and slugging your way deep into the unknown. Legend of Grimrock Trailer Hand-picking your four-member party is preferable to diving in with the pre-made group, and there's a good balance between accessibility and depth in the character crafting menu. While class selection is sadly limited to fighters, rogues, and mages, cool racial perks and selectable bonus traits add enough variety to the mix to keep things interesting. Insectoids, for example, make great back-line spellcasters due to their heightened intelligence and naturally hardened carapace, while burly minotaurs are solid front-row combatants that get an attack boost for every human skull they're holding in their inventory. Leveling-up characters earns you skill points to dump into a broad range of weapon, armor, spell, and ability specializations, unlocking new perks and boosting your combat prowess in the process. Since the real fun comes from diving into the dungeons to amass powers and gear as you go, I appreciate that it only takes a minute or two to lock and load your crew without sacrificing depth in the character customization department. Only a few steps into the first dungeon level, it's easy to get swept away by the thick, potent atmosphere of Grimrock's underground realm. The dank moss-and-root entwined stone walls feel ancient and almost alive, particularly as the warm torchlight casts shadows across their crisp detailed surface. Other nuances, like mysterious earthquakes, strange voices that appear in your dreams, and the foreboding sound of scurrying creatures stalking you in the distance add to the tension that slowly builds as you explore. There's something ominous afoot, and it feels like it could emerge at any second to destroy you. You also never know what you'll encounter when rounding the next corner or opening a locked door, and the eerie vibe plays well off the need to scour every nook and cranny for invaluable loot. Moving around the underground grid-based network of corridors and rooms auto-maps your progress, and though you can turn this feature off to kick it way old-school, letting the complex dungeon levels chart themselves out as you roam is much easier than scrawling everything by hand. Besides, there are much more pressing matters to worry about, like roaming bands of undead knights, swarms of spiders with poison-tipped fangs, and hulking ogres capable of wiping out your group in a heartbeat. Swinging swords and flinging spells in Legend of Grimrock is familiar, but it never feels stale. Since each attack your party members deliver has a brief warm-up phase before you can use it again, battles become a fast-paced synchronized dance number punctuated by staggered blows and nimble maneuvers to skirt your opponent's attacks. The real-time element adds a refreshing urgency to these encounters that keeps you alert and thinking on the fly. Sure, you might not feel the burn in one-off scuffles against a giant snail or two, but being locked in a room that suddenly springs to life with the clanking spears of numerous undead warriors marching out of hidden alcoves will inspire panic. It's a thrill to survive these frantic surprise attacks, narrowly skirting death by a hair. Figuring out ways to use pit traps and other elements of the environment to dispatch foes makes victory all-the-more satisfying. The unique magic system throws a neat twist into combat that requires some concentration and quick reflexes in order pull off more elaborate spells in the heat of battle. Spells are cast by plugging a specific rune pattern into a 3x3 grid that fits neatly over your wizard character's portrait. Once queued up, you can fire off the magic at any time with a quick click. From hurling fireballs and poisonous clouds to using invisibility and protective charms, there's a good mix for magic-minded folks to play around with. While experimenting with different combinations sometimes unlocks spells through accidental tinkering, most spells aren't uncovered until you find a scroll with their formula on it. Scoring new spells during your travels feel more rewarding than simply gaining them automatically. Potion crafting has the same appeal as well, since you have to track down ingredients and vials, find note scrolls on how to use them, and then combine them properly on an inventory grid to create your elixir. As much as punchy combat keeps the pace flowing, Legend of Grimrock's elaborate puzzles offer an excellent reason to take a breather and stir up the old brain juice for a bit. Each level of the dungeon is brimming with hidden switches, locked doors, pressure plates, pitfalls, teleporters, scrawled messages, and magical statues that come together in clever ways to challenge your problem solving skills. Figuring out these obstacles can be a frustrating process at times when they're obstructing the only path forward, but the vast majority of the puzzles strike the right balance between difficulty and creativity. Beyond the beautiful visual detail etched into each underground setting and the addictive pull of exploring and battling your way through uncharted territory, it's the little touches that really make Grimrock's dark world a special place for me. There's nothing quite like having to consume the flesh of fallen beasts to keep your party from starving or suddenly finding yourself poking around in pitch blackness because your last torch burnt out to drive home the feeling that you're trapped and alone in this godforsaken place. While seemingly insignificant at first, the many unique but minor details that increasingly stand out as you delve deeper add tremendous personality to this scrappy indie homage to classic dungeon crawlers. CLOSING COMMENTS Underneath its gorgeous sheen and striking atmosphere, Legend of Grimrock is an unapologetic nod to PC gaming's earlier days. Playing it reawakens those same feelings of excitement I had back when I got into early dungeon crawler RPGs for the first time. There's something magical about the skillful way the dev team takes such antiquated game design and makes it feel new and fun again, pushing all the right nostalgia buttons in the process. But more importantly, everything about this well-crafted romp through deadly dungeons comes together to pull you into its mysterious realm and hold on. IGN RATINGS FOR LEGEND OF GRIMROCK Rating Description out of 10 Click here for ratings guide 8.5 Presentation A simple, flexible interface makes it easy to manage your group and engage in battle. 8.5 Graphics Impressive detail is poured into dungeon environments and creature designs alike, making for stunning atmosphere. 8.0 Sound Subtle but powerful, great use of sounds help bring these dungeons to life. 9.0 Gameplay The balance between exciting combat, thought-provoking puzzle work, and open-ended exploration is stellar. 8.5 Lasting Appeal With different party configurations and so many secret nooks to sniff out, there's a lot of ground to cover and reason to return. 8.5 OVERALL Great (out of 10)", "date": "April 9, 2012,"}