{"name": "MotorStorm RC", "name_review": "MotorStorm RC Review", "ref": "https://me.ign.com/en/motorstorm-rc/56927/review/motorstorm-rc-review", "text": "MotorStorm RC isn't a MotorStorm game. Well, of course it is  there's a big MotorStorm logo on the front of the box  but it's nothing like any of the games that have appeared in the series before. True, many of the hallmarks of previous games are present and correct  a generous smattering of mud and dirt, an abundance of race-tuned off-road cars and a bass-heavy soundtrack that'll test your ability to keep your bowels in check if you crank the volume up to maximum. But as a racing experience it has more in common with ancient top-down racer Micro Machines than it does with its predecessors. Importantly, that's a good thing. Rather than lazily port a bastard child of games gone by, developer Evolution has started from the ground up and created a game that is interesting on two counts: firstly, it's snackable gaming at its finest, serving up minute-long thrill rides one after the other. First things first: the premise. The gas-guzzlers and explosive, behind-the-wheel action the series has worn like a badge of honour have gone, replaced by radio-controlled cars and circuits most of us could squeeze into our back yards. It's not fancy and in all honesty it isn't the game to show off the PS3 in terms of visual grunt, but as a stripped-back racer it delivers a fun, compelling arcade experience with the kind of confidence you'd expect from a team that been making MotorStorm games since the launch of the console. The structure of MotorStorm RC will be familiar to series veterans and there's still an over-arching Festival of Speed theme, broken into four areas  Monument Valley, Pacific Rift, Arctic Edge and Apocalypse. Aside from name and general themes though, tracks in MotorStorm RC share little with their big brothers; the lush jungles of Pacific Rift are more garden shrubbery in RC, and Arctic Edge's icy blizzards are more a light dusting of the white stuff. Visually, MotorStorm RC is no slouch, but it doesn't look quite so good on a big screen as it does on the Vita. There's not a huge amount of contrast between the different locales and on occasion there's a touch of noticeable slow-down when a lot of cars slam into each other around the same corner. One benefit of playing on a larger screen, however, is that it's easier to make out obstacles, so you're less likely to clip a corner and flip out. See MotorStorm RC in action Handling is sharp and responsive, and the balance of control and challenge is just right whether you're driving a big rig or lightweight buggy. What's neat is that the cars don't feel like the heavyweights in previous MotorStorms, but more like the feather-light radio-controlled cars many of us messed around with when we were kids. They can be twitchy and unpredictable on rough surfaces, forcing you to play the game in a different way than you would a traditional racer. Driving full throttle isn't always the best option and clipping a raised apex could flip your buggy on its lid. Get it right, however, and the feeling of sliding around a banked curve at full whack is incredibly satisfying. Of course, there's more than just one kind of car in the game: racing trucks, rally cars, dune buggies and more all feature. Indeed, the difference between how the cars handle is one of MotorStorm RC's highlights and tackling the same race in different vehicles can dramatically change the outcome. While the buggy is fast and nimble, it flips easily and will always come off second-best in a shunt, so wouldn't always be your first choice in a race against other cars. The weight of a racing truck means it's better around corners, but take it out on a track with jumps and you could be penalised. Races are split into four types: the standard Race is just that, a first-to-the-finish-line dash around the circuits; Hot Lap pits you against three ghost cars in order to notch up a killer time; in Pursuit you must overtake all other opponents; and Drift dishes out points for driving with style (the more you powerslide the more points you earn). The higher your podium finish, the more medals you're awarded, which unlocks new tracks, challenges and vehicles. There are 48 challenges in total. While this may sound like a lot it's entirely feasible you'll breeze through at least half of these on your first go grabbing at least a gold or silver medal, which is enough to open up more tracks and challenges to keep you going. There's always something new to see though; drift challenges, for example, don't open up until you're about halfway through the game and offer a much stiffer challenge, and the game has plenty more to offer. What really brings the challenges to life are the live leaderboards; often you're not just competing against the cars on the screen, but also the lap times of your friends, or if you want to look at the bigger picture, everyone who's playing MotorStorm RC across the world. You can instantly see where you rank on certain challenges and that's a tremendous incentive to shave precious milliseconds off your best time. Furthermore, every time you rack up a hot lap it gets posted on your friends' leaderboards and vice-versa, so competing against pint-sized onscreen opponents really is only part of MotorStorm's picture. The PSN version also includes split-screen multiplayer for up to four players, which is a blast. However, the lack of an online multiplayer component definitely hurts the game's longevity. CLOSING COMMENTS MotorStorm RC is a taste of what arcade gaming used to be like all those years ago. Its refreshingly simple and doesnt get bogged down with trying to be the biggest or the fastest and as a result its a lot of fun. The idea of being constantly connected to the leaderboards is a stroke of genius, especially because itll pull in times for people playing on both PS3 and on Vita, but perhaps MotorStorm RCs crowning glory is its price. This wouldve been a great game for 10 quid or 20 bucks, but for half that its a steal. Its by no means perfect  the inclusion of proper online multiplayer wouldve added another point  but youd be hard-pushed to find a game as good as this for the price. IGN RATINGS FOR MOTORSTORM RC (PS3) Rating Description out of 10 Click here for ratings guide 8.0 Presentation The compact style of MotorStorm RC is a refreshing departure for the series, and it harks back to arcade games of old. 7.5 Graphics Not quite so sharp on the big screen compared to Vita but the tracks are detailed and easier to navigate. More contrast between tracks would've been welcome. 7.5 Sound The bass-heavy dubstep soundtrack compliments the track action perfect and adds audio grunt to fragile whine of the RC cars. 9.0 Gameplay Sharp handling and responsive controls make MotorStorm RC easy to pick up and enjoyable to play. 8.0 Lasting Appeal With over 40 challenges to tackle there's a decent amount to get stuck into, plus the live leaderboards will keep you playing for longer. Shame there's no real-time online multiplayer though. 8.5 OVERALL Great (out of 10) Motorstom RC r en liten bit av en svunnen arkadkultur. Evolution har jobbat mlmedvetet och frsker aldrig gra spelet till ngot annat n ren krgldje. Det mrks. Motorostorm RC r riktigt roligt att spela och det vinner mycket p den smtt geniala idn om att hela tiden vara uppkopplad mot leaderboards. Dr summeras bde tider frn PS Vita och PS3. Med det sagt s kan Motortstorms strsta bedrift mycket vl vara priset. Visst, det hr hade varit ett prisvrt spel fr 100 kronor, men med en prislapp p 55 kronor r det ett kap. Det r inte ett perfekt spel  multiplayer hade ftt det att klttra ett betygssnpp  men det r svrt att hitta ett spel som r s prisvrt. Om Motorstorm RC r en fingervisning om vilken typ av spel som vntar PS Vita, och framfr allt till vilka priser, s har konsolen goda frutsttningar att klara sig mot den hrda konkurrensen.", "date": "April 3, 2012,"}