{"name": "Angry Birds Space", "name_review": "Angry Birds Space Review", "ref": "https://me.ign.com/en/angry-birds-space/56949/review/angry-birds-space-review", "text": "What is it? Is there anyone out there that hasn't played Angry Birds at this point? By now everyone knows how it works: just pull back your slingshot and release. This single touch-screen input sends your bird ammo flying, (hopefully) on a collision course with those evil pigs. Angry Birds has always been fun and polished, but after several hundred levels the formula was beginning to feel stale. Enter Angry Birds Space. Rovio's latest is full of imagination and new ideas, making Angry Birds feel fresh again. Space features two major innovations: zero gravity environments and gravity wells. In zero-G, birds fly in a straight line. Hitting a TNT crate sends debris flying in every direction, while nudging a pig sends it lazily floating through space. Most stages also feature planets or moons that have their own unique gravity that will suck in birds and obstacles alike. This can sometimes pose a challenge, but usually smart players can use these gravity effects to their advantage. To hit hard-to-reach pigs, you'll do things like slingshot a bird around a planet to attack from the back. Did we like it? Rovio's newest Angry Birds sequel is the first to actually feel like a sequel. Space introduces the new interstellar gravity elements right from the start, and steadily builds on them over the course of the game's 60+ stages. Later levels introduce multiple planets, each with their own gravity to navigate. This makes Space much more of a skill-based puzzler than previous Angry Birds games  to win players need to plan out their attack in advance. It's not uncommon to slingshot a bird around two celestial bodies before expertly detonating it at just the right moment to clear a stage. Satisfying. Two new birds also help keep Space's stages fun and fresh. A square ice bird can be detonated to freeze any nearby blocks and pigs. The yellow triangular dive-bombing bird has also been redesigned. Players can now send him anywhere on the stage just by tapping the target. Space's physics randomness does bring the experience down a little. You can fling a bird in the exact same way five times and experience five different results. A little too much success is left to chance. Should you buy it? Angry Birds Space is the exact shot in the arm the series needed. Anyone burnt out on vanilla bird flinging will enjoy the game's out-of-this-world adventure. A few of Rovio's business decisions are disappointing, however. Space's base game includes 60 levels, but an entire third chapter with 30 more stages is only available via a $0.99 in-app purchase. Additionally, the ~Mighty Eagle~ level-clearing superbird used to be a one-time purchase, but now can only be purchased as a consumable. Each 20 uses of this last resort now costs players an additional $0.99. CLOSING COMMENTS Angry Birds Space's more aggressive pricing and somewhat random physics results are disappointing, but neither issue detracts from the game's overall quality or fun factor. Space takes the basic Angry Birds experience and adds a twist just big enough to once again reinvigorate the franchise. IGN RATINGS FOR THE ANGRY BIRDS SPACE (IPHONE) Rating Description out of 10 Click here for ratings guide 8.5 OVERALL Great (out of 10)", "date": "March 23, 2012"}