{"name": "Ninja Gaiden III (Collector's Edition)", "name_review": "Ninja Gaiden 3 Review", "ref": "https://me.ign.com/en/ninja-gaiden-iii/56968/review/ninja-gaiden-3-review", "text": "Ninja Gaiden used to be about careful combat for skilled players. Knowing the skill-set inside and out was as important as understanding individual opponents, and digging into the complex mechanics was necessary to succeed. One basic enemy could kill Ryu Hayabusa, and getting him out of each encounter alive was an accomplishment. Ninja Gaiden 3 rejects this identity in an attempt to do something fresh and interesting with its hero. This is an admirable ambition that's ultimately responsible for many of the sequel's numerous failures. Shallow combat, a misguided narrative focus, and awful pacing cripple what could have been the most interesting entry in the series' history. With Ninja Gaiden 3, Team Ninja displays an obsession with new-found emptiness that anchors the action, betrays fans, and repels newcomers. Ninja Gaiden 3 video review. In one of the early encounters, an unarmed enemy begs for his life, takes off his ski mask to show you his face, and talks about providing for his family. The only option is to walk slowly toward the man before cutting him down. As intended, it's an unsettling scene. Thematically, Ninja Gaiden 3 strives for a dark story that wants to be taken seriously. It positions itself as a contemplative character study and reflection on Ryu's psychological struggle with his monstrous ethics. In both the grand scheme and moment-to-moment of Ninja Gaiden 3 this aspect falls short of its intended mark. Right before the credits roll, an ally reassures Ryu he's not a murderer. Hayabusa took 2,110 lives after eight hours according to my stat tally, some of which were more pleading, unarmed men. The questions Ninja Gaiden 3 asks its character throughout its narrative diametrically oppose the events that precede and follow them. What...is happening? Ryu has no motivational consistency and there are frequent narrative contradictions that left me with more questions than answers. Didn't she betray me? Why am I fighting a boss again instead of rescuing these people? Didn't I kill him? Oh, another betrayal? Ninja Gaiden's new focus flails while telling a meaningless story that gets in the way. The prominence of poor storytelling interrupts the slicing and dicing so often that Ninja Gaiden 3 can't keep an enjoyable pace. Ryu's arm is plagued by the blood of his past and present victims, which regularly causes him to slow down and clutch his infected appendage. Why? The arm doesn't play an interesting role during gameplay. Beyond the inconvenience it serves no purpose. It just handicaps your mobility for brief periods, and the A.I. doesn't take advantage of it. If anything, they dial back the aggression. Coming out of one cinematic and walking a short distance to another is irritating as well. Even if you're not interested in what Ninja Gaiden 3 is trying to say, it's going to tell you. These scripted sequences may mean to add tension or gravity, but the reality is that they get in the way of unleashing violence, which is the real reason anyone plays Ninja Gaiden. Expect to fight this boss no fewer than three times. Somewhere along the way, Team Ninja forgot this is what made Ninja Gaiden great. Nothing about Ninja Gaiden 3 is difficult, or even challenging enough to be amusing. Enemies here are harmless. More often than not, the soldiers, ninja, or monsters pop out simply to wait to die. Ninja Gaiden compensates for this with a disarming quantity of guys to kill, which is a cheap cop-out that emphasizes its creative vacancy. Repetition sinks in early, hits hard, and doesn't let up. In addition, the erratic and unreliable targeting means missing marks more often than is acceptable for a franchise revered for precision. In another questionable step backward, Ryu sticks with just one weapon for the entire game. The most challenging thing about Ninja Gaiden 3 is dealing with its confused camera. It tries to highlight big moments via swooping angles and cool cuts, but it can't keep up with the events. How is the perspective more distracting and disorienting in 2012 than it was in 2004? More importantly, how can something this chaotic be so thoroughly unexciting? Such archaic design dominates Ninja Gaiden 3. Structurally, it feels more like Dynasty Warriors than anything else. You'll kill a dozen or so identical enemies in a locked arena, wait for the next wave, and do it again. Every so often you'll unleash magic to wipe out everyone on-screen. Once you've killed 20-50 guys, you'll exit the arena, enter another, and fight 20-50 more hostiles. Boss battles are similarly interminable. Bisecting a Goddess and cutting the arms off a biological experiment could have been climactic finales to otherwise uninteresting, too-similar spectacles. Instead, enemies regenerate lost limbs, repair their bodies, or have armored plates protecting what you thought you destroyed. Worse, Ninja Gaiden recycles bosses frequently. You can expect to fight numerous big-bads repeatedly and to do so in the same predictable fashion you did last time. These are highly customized characters and they still look really similar. Getting through five foes used to mean something. Maybe you'd be rewarded with a decapitation for your effort. Now the reward for enduring Ninja Gaiden 3 is, well, more of it. Team Ninja has too many terrible new ideas that ultimately end up interfering with one another. The throwaway multiplayer mode would have been the one thing worth experiencing if the co-op challenges were even on par with the campaign. Tasks such as ~press the attack button repeatedly~ or ~throw a shuriken~ demand even less effort than the single-player. Multiplayer isn't just tacked-on or superfluous, it's also plain bad. The uninspired deathmatch mode is so straightforward, and the character customization is so limited, that there's nothing to keep you coming back. Not that Ninja Gaiden 3 ever gives anyone a good reason to pay attention in the first place. CLOSING COMMENTS Ninja Gaiden 3 is a gash on the face of the franchise and one of the worst games the action genre has yet suffered. It has no consideration for its fans wants or what a new audience may have enjoyed. Its a nightmare thats as easy as it is uninteresting, and it abandons what used to work for awful new ideas that dont work together. Under no circumstance should you ever waste your time on this self-indulgent and abysmal wreck. IGN RATINGS FOR NINJA GAIDEN III (X360) Rating Description out of 10 Click here for ratings guide 5.0 Presentation The camera hurts the stylish and over-the-top action. 4.0 Graphics Ryu looks fine, the women look like RealDolls, and everything else looks like low-res sewage. 5.5 Sound The voice acting is rough, but the ridiculous metal tunes are super fun to fight to. 2.5 Gameplay When you can tell whats happening, fighting is easy, repetitive, and dull. 2.0 Lasting Appeal One weapon, no character progression, and pointless multiplayer leave little reason to return. 3.0 OVERALL Awful (out of 10) Ninja Gaiden 3 is a gash on the face of the franchise and one of the worst games the action genre has yet suffered. It has no consideration for its fans wants or what a new audience may have enjoyed. Its a nightmare thats as easy as it is uninteresting, and it abandons what used to work for awful new ideas that dont work together. Under no circumstance should you ever waste your time on this self-indulgent and abysmal wreck.", "date": "March 19, 2012"}