{"name": "Defenders of Ardania", "name_review": "Defenders of Ardania Review", "ref": "https://me.ign.com/en/defenders-of-ardania/56964/review/defenders-of-ardania-review", "text": "Tower defense erupted in popularity through Flash and mobile gaming across the past few years based on a standard formula: build defenses and fight off wave after wave of enemies. Defenders of Ardania attempts to evolve that formula by letting players send wave after wave of soldiers right back at the enemy. While an interesting twist, this gamble turns into a stalemate; a simple battle becomes a lengthy and frustrating time sink that lacks the satisfying end of a strategic battle. Tower-up and send in the troops. For full disclosure, I did not complete the main campaign of Defenders of Ardania. After conquering more than half the story levels and battling several opponents online, I encountered the same design issues and boring flow in each match which led to the crushing frustration of needless defeat. The greatest problems aren't in the story I didn't complete, rather in the simplest elements of the game's design that didn't work for me. The problem is in the tug-of-war design. When a strategy game focuses on defense alone, there's a clear path to success. But when each force sends their own troops and defends their base with equal vigor, there's a boring progression of each side losing health until one side finally gets a few points ahead. The only bonus a player gets against the AI is the fact that the computer can't repair its base (but online players can -- more on that later). Only certain types of troops can attack each other, so the early flow of gameplay is back and forth waves of troops passing harmlessly by each other, bigger towers built, and the slow trudge towards defeat or success -- neither of which is readily apparent from early waves. Don't spend all your towers in one place. Defenders of Ardania attempts a design more akin to real-time strategy than tower defense. Unfortunately, by limiting control over the troops, it does not work as effectively. Certain units are irrelevant beyond the first few minutes of battle because they're too weak (even once leveled up). Additionally, each map has a finite numbers of towers available, so even if a player utilizes resources to the best of their ability, they remain curbed by defensive limitations. Even on double speed, the pace is painful. This makes a simple two-person battle turn into a lengthy saga of repeating the same actions over and over again. Survival mode returns gameplay to simple tower defense, but again, because the tower count is limited, it's a frustrating way to play. Not only does this mode rip out the twist that makes the game interesting in the first place, it negates features from a genre that's already learned how to best flourish. Thus, it fails at executing its evolved design attempts and its roots. Multiplayer takes place between two to four players on one of the eighteen campaign maps. There are very few customizable options. Multiplayer further reveals and amplifies design problems and creates lengthy battles (longer than single player) that seem to go nowhere. Where the key to winning a battle in single player is the AI's inability to heal its base, that element is gone when playing against human prey. Everyone can heal themselves (on a timer), so matches stretch into seeming perpetuity. The dark imagery of late levels. For example, I stepped away from the television during an online match (I apologize if that was you). I returned 15 minutes later to discover that not only was the war still going, I had more than a third of my life remaining and almost staged a comeback -- only to suffer defeat 45 minutes later. The strategy genre demands that if one side lets go of their offensive push, the opposing force ought to crush them. Defenders of Ardania's meandering pace doesn't support this ability to take the upper hand. Of course there will be players who are better than others, but when two semi-competent gamers battle, the match can linger on too long -- and winning hardly delivers satisfaction. Defenders of Ardania looks good, but stuttering frame rates and blocky animations stand out as additional annoyance on the already excruciating pace. The story is a standard tale of monsters and wizards, with some hit and miss voiceovers. The campaign levels begin with a lengthy (and unskippable) introduction to the level (and sometimes new gameplay elements). There is no signal at the end of these story bits, so by the time you realize that the characters are done talking, the enemy has already launched its first waves. CLOSING COMMENTS Theres something to be said for slow-burn strategy games that require precise tweaks and purchases to gain the edge in battle. Unfortunately, Defenders of Ardania lacks these nuances and insists on wasting the players time with needless limitations and wave after wave of opposing forces that result in an ongoing stalemate. Sure, one player will eventually triumph, but it all comes down to a lucky break. The concept is cool, but Defenders of Ardanias balance doesnt support its innovation. IGN RATINGS FOR THE DEFENDERS OF ARDANIA (PC) Rating Description out of 10 Click here for ratings guide 4.5 OVERALL Bad (out of 10) Theres something to be said for slow-burn strategy games that require precise tweaks and purchases to gain the edge in battle. Unfortunately, Defenders of Ardania lacks these nuances and insists on wasting the players time with needless limitations and wave after wave of opposing forces that result in an ongoing stalemate. Sure, one player will eventually triumph, but it all comes down to a lucky break. The concept is cool, but Defenders of Ardanias balance doesnt support its innovation.", "date": "March 19, 2012"}