{"name": "Silent Hill: Downpour", "name_review": "Silent Hill Downpour Review", "ref": "https://me.ign.com/en/silent-hill-downpour/56979/review/silent-hill-downpour-review", "text": "Being a Silent Hill fan is a lot like watching Eddie Murphy movies. You keep thinking back and remembering the glory days, while quietly thinking that maybe this next one movie will be the one to restore him to Beverly Hill Cop/48 Hrs. glory (or in Silent Hill's case, the days of Silent Hill 2 and 3). However, time and time again, we are ultimately disappointed among the Norbits, Klumps, and Homecomings. But we keep with it, remembering the good days, and in the case of Silent Hill, recognizing the key strengths of the franchise, and hoping that some capable developer will put the series on top of the survival horror heap where it belongs. Then, Silent Hill Downpour comes along and knocks the series down a few more pegs. Silent Hill: Downpour Video Review Developed by series newcomer Vatra Games, Silent Hill Downpour is a pretty different take on the series. Downpour takes many of the devices familiar to fans of the franchise like Akira Yamaoka's score and many of the familiar landmarks and sights in the town, and replaces them with new previously unexplored sections of Silent Hill, a new hero and more of a focus on action and combat. There are a few connections that the game makes to the previous games in the series, but unfortunately most of what has been added isn't great. There are a few fleeting moments in Downpour that offer legitimate thrills, but on the whole, the experience is very weak. The gameplay is dull and uninspired, the combat is loose and clunky, and the technical presentation is simply a mess. Silent Hill Downpour pits you as series newcomer Murphy Pendleton, a convict being transported to a new prison. Before he gets there, the bus crashes, killing many of those on board and transporting Murphy into the eerie otherworldly town known as Silent Hill. The game gives you a few details here and there on Murphy's background, but you're only fed bits and pieces of the character, slowly learning what he did to get incarcerated as well as why he's a prime candidate for residency in the terrifying titular town. Much of what you see at first of Murphy's past is the bizarre visual cues that don't mean much, but as you progress the pieces will begin to fit together more. The game also lets you create Murphy's character yourself with a few choices littered throughout the story. You'll be tasked a couple of times with either rescuing someone from harm or leaving them to it (occasionally goading them into it as well). However, these choices don't really have the weight that they should, and oftentimes the same series of events will play out regardless of what you choose. The enemies aren't the most creative in the Silent Hill universe. Also different in Downpour is combat, which plays a more important role in the game than it previous Silent Hill titles. Your arsenal is composed of whatever tools you'll find strewn throughout the environment, be it a hammer, a plank of wood, a fire extinguisher, or even just a rock. Weapons degrade pretty quickly and eventually break, so you might find yourself scrambling for a new one to pick up right in the middle of a fight. Adding to this is the rain mechanic, since the more it rains, the more aggressive and difficult your enemies will become. This adds in a fight or flight mechanic to the gameplay, and makes for an approach to combat that is new to the series. Unfortunately, that combat is a mess. Swinging your weapons around is cumbersome, and nearly every attack from your enemies will stagger Murphy and cause him to lose control. Melee combat feels loose, imprecise, and unwieldy, regardless of what kind of weapon you're thrashing about. Perhaps the developers opted to build the combat in this way to make running away from battles more of a necessity, but that doesn't make it any fun. As in other Silent Hill games, shooting is here, but purposely difficult. Guns are rare to find as is ammo, meaning that the majority of your interactions with enemies will involve either trying to take them on melee style, or turn tail and run away. The Otherworld sequences are some of the scariest in the game. Puzzles have always been a key part of the Silent Hill experience, and Downpour at least manages to carry this tradition forward, along with the ability. Your weaponry will also come in handy when solving a few environmental puzzles, going beyond simply using axes to knock through wooden planks that block doors but even using hooked sticks to reach fire escapes. It's an interesting application, but not really enough to carry the whole experience. Aside from guiding Murphy through the game's main mission through Silent Hill, you'll also come across some ancillary quests throughout the town. You'll be able to explore houses and apartment buildings, discovering some background on the town's residents while solving mysteries for them. You'll perform a variety of tasks during these side-missions, like returning objects stolen by a thief to their rightful owners, freeing birds from cages, and directly engaging the town's other inhabitants to gain more insight and new items. There are a lot of technical issues to be found in the game's graphics. You can certainly see some cool design choices, especially in the Otherworld sequences, which can make for some legitimately scary moments. However, the lack of technical polish is just too hard to ignore here. The game is rife with murky textures and drab environments (to be sure, Silent Hill is a drab and murky place), as well as more technical problems like texture popping and framerate stutters. The Xbox 360 version does run a bit more stably than the PS3 version with less slowdown and freezing, but texture popping is still an issue here, and the visual effects aren't much to look at. CLOSING COMMENTS The most frustrating thing about Silent Hill Downpour isnt the lousy combat, dull exploration, or even the technical gaffes. Its the fact that every now and then while playing through the games story, youll see signs of brilliance; sunlight hinted from behind the overcast sky. From the Otherworld sequences to the interesting protagonist as well as the way the very town itself is molded to Murphys past all make for a game that couldve really been something special for the series. However, all of the aforementioned issues play their role in making Downpour an unfun, disappointing experience. IGN RATINGS FOR SILENT HILL: DOWNPOUR (X360) Rating Description out of 10 Click here for ratings guide 5.5 Presentation The story in Silent Hill Downpour isnt half bad, and watching Murphys past unfold is one of the more compelling elements in the game, but the half-baked inclusion of choice options feels tacked on. 5.0 Graphics Some cool design ideas that ultimately fall apart under technical issues and drab, boring visuals. Freezing and stuttering aren't as much of a problem here as on the PS3. 6.5 Sound The music effects are fairly sparse aside from some creepy sound effects here and there to set the mood, and the Korn theme song likely isnt for everyone. The voice work is hit and miss. 4.0 Gameplay A heavy reliance on sub-par combat and dull exploration elements make this one a frustrating bore to play. 4.5 Lasting Appeal Downpour isnt terribly long, but completing the extra side missions will extend the experience. Unfortunately, that experience is still deeply flawed. 4.5 OVERALL Bad (out of 10) The most frustrating thing about Silent Hill Downpour isnt the lousy combat, dull exploration, or even the technical gaffes. Its the fact that every now and then while playing through the games story, youll see signs of brilliance; sunlight hinted from behind the overcast sky. From the Otherworld sequences to the interesting protagonist as well as the way the very town itself is molded to Murphys past all make for a game that couldve really been something special for the series. However, all of the aforementioned issues play their role in making Downpour an unfun, disappointing experience.", "date": "March 14, 2012"}