{"name": "Mass Effect Infiltrator", "name_review": "Mass Effect Infiltrator Review", "ref": "https://me.ign.com/en/mass-effect-infiltrator/56974/review/mass-effect-infiltrator-review", "text": "Mass Effect Infiltrator Video Review What is it? Mass Effect Infiltrator follows Cerberus agent Randall Ezno. After discovering the nefarious experiments happening within a Cerberus base, Ezno goes rogue in an effort to put a stop to the company. Infiltrator is a linear action game through and through, so don't expect dialogue trees, galactic exploration, a level-up system or many of the other staples of the Mass Effect series. The game instead plays out as a pure cover shooter, wherein players blast their way through nine chapters, split up into over 30 bite-sized and repeatable combat encounters. The entire campaign lasts around six hours. At the end of every encounter players are scored based on how much health they lost, how stylish their kills were, and how much time elapsed. Earning perfect three-star ratings helps amp up Infiltrator's replay value and earns players in-game credits. These credits can be used to unlock and upgrade weapons and biotic powers. Did we like it? Mass Effect Infiltrator's gameplay isn't as impressive as its visuals. The controls work well when enemies are at a distance thanks to the game's clever ~tap to target~ system. To target an enemy, players simply tap them when in range. This zooms in the camera onto that individual target, brings up an aiming reticle, and allows players to fire. It's a nice combination of iPad ease and traditional FPS aiming skill. Unfortunately the player's other interactions with Infiltrator often frustrate. Ezno's out-of-combat walking feels stiff and awkward. Players can supposedly use swipe gestures to switch between pieces of cover, but the gestures often fail to register. It can also be hard to deal with closing enemies  close-range combat can be clunky. None of these control issues are deal-breakers, but nothing else in Infiltrator (besides the visuals) excels enough to balance out the deficiencies. All the game's enemies and combat encounters feel the same. Players can unlock and level-up biotics, but they suffer from a lack of identity  they are essentially all used to incapacitate an enemy and little else. The writing and voice acting aren't offensively bad, but also suffer from the same sense of blandness. Should you buy it? Infiltrator is a passable cover shooter with uneven pacing. Later levels do contain plenty of brilliant moments. A typical firefight might require players to snipe someone from afar, quickly switch to shotgun to dispatch a flanking Geth then cloak to surreptitiously move to a new piece of cover, etc. Unfortunately most encounters don't play out so dynamically. Players can usually hide behind one piece of cover, taking out enemies one at a time. Mass Effect Infiltrator's gameplay simply isn't interesting or varied enough. There are better shooters on the App Store, but there are also plenty worse. Mass Effect nuts or iOS gamers that have fully exhausted better options will enjoy mastering Infiltrator's campaign, but most gamers are probably better off buying a better alternative. Infiltrator's Mass Effect 3 Hooks Intel collected in Infiltrator can be used to up your Galactic Readiness Rating in Mass Effect 3 using an EA Origin account. For details see IGN's Mass Effect Infiltrator Wiki page. CLOSING COMMENTS Mass Effect Infiltrators rote and unexceptional gameplay doesnt live up to the promise of the games gorgeous visuals. Gamers that dont mind some control frustrations will find a lot to like within the six hour campaign, but there are also plenty of ways the experience could have been spiced up and smoothed out. IGN RATINGS FOR THE MASS EFFECT INFILTRATOR (IPHONE) Rating Description out of 10 Click here for ratings guide 6.5 OVERALL Okay (out of 10) Mass Effect Infiltrators rote and unexceptional gameplay doesnt live up to the promise of the games gorgeous visuals. Gamers that dont mind some control frustrations will find a lot to like within the six hour campaign, but there are also plenty of ways the experience could have been spiced up and smoothed out.", "date": "March 14, 2012"}