{"name": "Unpacking", "name_review": "Unpacking Review", "ref": "https://me.ign.com/en/unpacking/191155/review/unpacking-review", "text": "Disclosure: Humble Bundle, the publisher of Unpacking, is owned by Ziff Davis, the parent company of IGN. Humble Bundle and IGN operate completely independently, and no special consideration is given to Humble Bundle announcements or promotions for coverage.In real life, moving is the worst. In Unpacking, described by its creators as a zen puzzle game, settling into a new place is surprisingly comforting. Unpacking takes you through a series of homes representing an invisible protagonists life from 1997 to 2018, and as it turns out, you can tell a lot about a person by the things they take with them. Though the mechanics are simple and the campaign can be completed in a handful of hours, Unpacking is a memorable, delightful game that shows that there are still new ways to tell stories in video games out there.You might not think stacking plates and organizing books is compelling, but strangely, it really is. Part of that might have to do with how often youve pulled up stakes. For me, it was a lot: between the ages of 18 and 26, I moved more than half a dozen times. Packing and unpacking became an almost annual ritual as I transitioned through a series of apartments in various neighborhoods throughout the Philadelphia area. None of these places ever felt like home until I started unpacking: taping the David Bowie poster with torn edges to the wall, finding a flat surface for my ancient record player, and lining up my Harry Potter books in chronological order on the shelves. Settling into the next place always felt like a new chapter of my life was starting, and thats a feeling Unpacking captures well. When youre getting started, no time is wasted with explanations, tutorials, or cut scenes. You dont even see the person whose boxes youre unloading. Instead, we get to know them through the basic point-and-click mechanics that allow you to move belongings from boxes to their proper places in the home, beginning with a single childhood bedroom and eventually moving on to larger, multi-room spaces. Theres no inventory list so you never know what the next thing youll pull out of any given box will be, and that makes for a series of sweet surprises that reveals a little bit more about the character. There are also no timers or scores, allowing you to move at your own pace. Because of that, Unpacking is the kind of game in which its easy to lose a couple of hours in what feels like only minutes. As you fill rooms with possessions, you're really uncovering clues.These environments represent different stages of the path to adulthood: the childhood bedroom, a college dorm, a shared apartment, and more. As you fill them with possessions, youre really uncovering clues: art supplies indicate a creative type, while controllers and board games show what they like to do in their free time. Postcards, photos, and souvenirs hint at a love of travel and a close-knit group of friends.Speaking of photos, unpacking a camera in the first stage unlocks the photo mode, which I was excited to use. Sadly, though its fun to add filters and stickers to certain scenes and capture your organizational brilliance, I was disappointed by how little is done with it. For instance, I thought my photos might show up in the literal photo album that serves as an interface that allows you to store and continue progress, but they did not. Its a minor annoyance, but in a game that focuses so heavily on the memories we make and keep, being able to incorporate those photos elsewhere would have been a nice touch.Clicky sound effects subtly and skillfully complement the retro-inspired whimsical art style.As it turns out, zen is a really accurate description of the Unpacking experience. Soothing background music and satisfying, clicky sound effects subtly and skillfully complement the retro-inspired whimsical art style. The only problem I had with the overall look and feel is that it was occasionally hard to identify small items, even when zooming all the way in. It took me several moves to figure out that the gray lump of pixels I kept unpacking in the kitchen was actually a refrigerator magnet. Theres almost no wrong way to unpack, although you wont be able to move onto the next stage if certain items arent put away properly. Most of the time that makes sense; toilet paper and toothbrushes belong in the bathroom, after all, and guests might find it a bit strange if you store your underwear in the living room. Other times, its not clear whats wrong  is it really such a big deal if a toaster is kept on a counter instead of tucked away in a cabinet? You can actually disable this feature in the accessibility menu and let chaos reign, but it does have some storytelling benefits, like stashing a photo in a drawer instead of putting it on display. Its not a particularly long game, but moments like that can leave a lasting impression. Unpackings greatest achievement is that it tells a story without any of the tools wed usually consider essential. Theres no dialogue, very little text, and no visible characters. All you have to work with is a series of rooms, dozens of boxes, and the year in which each stage takes place; its up to you to put everything together as you see fit. Not only does it work, its actually quite moving (pun intended). It certainly made me think about all of the things Ive packed and unpacked over the years, as well as what they say about me.", "date": "Nov. 2, 2021,"}