{"name": "Naruto Shippuden: Ultimate Ninja Storm Generations", "name_review": "Naruto Shippuden: Ultimate Ninja Storm Generations Review", "ref": "https://me.ign.com/en/naruto-shippuden-ultimate-ninja-storm-generations/56983/review/naruto-shippuden-ultimate-ninja-storm-generations-review", "text": "Bold, brash and bombastic, the world of Naruto and his ninja cohorts seems tailor made for video games. Often revolving around larger-than-life conflicts and epic battles, this tale of a young warrior with overwhelming power has been the subject of numerous games, including two previous installments of the Ninja Storm series (which are themselves part of a long-running Ultimate Ninja franchise). While deriving much from its predecessors, Ninja Storm Generations continues to refine itself in a few key ways. The series still struggles from some of the same pitfalls, but make no mistake about it - this is a gorgeous game that should be played by avid fans and casual observers alike. The story of the Naruto series has been well-explained by this point, most notably in the previous two games. Generations' single-player, story-based component attempts a new approach, opting for well over a half dozen, isolated story lines that gradually unlock as players complete other segments. These concepts eliminate any sort of hub world, instead bridging key battles with quick, effective recaps to set up the next conflict. All of these chapters focus in some way on Naruto Uzumaki and his friend/rival/enemy Sasuke Uchiha, observing each ninja's struggles and triumphs as they clash again and again throughout their lives. Naruto: Ultimate Ninja Storm Generations Video Review Though Naruto is often dismissed as a sort of contemporary Dragon Ball Z, incapable of sacrificing its epic battles to tell an emotionally-driven story, Generations is proof that this assumption is incorrect. Through a combination of anime sequences new and old, as well as static imagery with voice overs, this sprawling, chaotic world is often summed up in a surprisingly poignant way. Fans might fuss over some of the details omitted, but frankly this is one of the better representations of a lengthy series that sometimes forgets how stirring it can be. In terms of gameplay, Ninja Storm Generations is still very much the streamlined arena fighter established in previous installments. With a massive roster of characters spanning the entire Naruto saga, there are plenty of options to enter one-on-one or partner-assisted battles. The biggest changes to gameplay come in the form of a substitution meter, which limits the number of instant escapes all characters have, as well as the Awakening Mode, which becomes a last-ditch grab for power on the part of near-defeated players. Both are welcome ideas, though using a meter to inhibit Substitutions might not be the best approach. In practice, battles tend to stall slightly as players wait for those particular meters to automatically refill. The Generations series isn't known for its slower pace, but being able to evade powerful attacks is so valuable that waiting is often worth it. The Ninja Storm titles have particularly focused on their pick-up-and-play mentality, working with very basic input commands and concepts. No complex commands are necessary, and what combo attacks are available are typically designated to simple directional inputs in the midst of repeatedly hitting one basic attack button. Yet complexity (or a lack thereof) is not the entire measure of quality. Just because Generations doesn't require counting frames or hit boxes doesn't instantly make it inferior - sometimes that is a welcome change. Young Kakashi Cuts Loose Generations instead focuses on positional strategy as well as a large focus on how players react to an assault. Though the basic, speedy nature of the game's controls will definitely (and unfortunately) invite a great deal of gleeful button-mashers, those who actually take the time to learn how the game operates will find a fighter that carries a fascinating amount of strategy, all the while eliminating the need to memorize a dozen different button combinations. Learning when to burst in with a powerful move, learning when to evade, learning when to charge all of these things might seem obvious, but mixed together they create something really addicting. Despite its effectiveness, there is certainly room for some more complexity within the framework of simplicity. The Ninja Storm series is a 3D fighter that actually allows players to move around large spaces effectively. Despite this, the levels themselves are very, very basic in execution, and really add nothing to the battle. Likewise, the fact that players are limited to just a few chakra-based special attacks seems too limiting. Certainly a bit more flexibility would be welcome. Many of the 70 or so selectable characters are more or less clones with slightly different move sets. Allowing for more customization would not only simplify things, but add in a bit of strategy as well. Lastly, it would be great to see developer Cyber Connect 2 experiment with the notion of true team battles rather than limiting partners to assist moves. Though Generations' core gameplay is fairly straightforward, it gains quite a bit when it comes to its robust online features. Players can not only engage in ranked and casual matches, but four and eight-player tournaments, endless assaults and more. One of the more fascinating (and gimmicky) modes available is the ~Ninja Info Card Battle,~ which allows players to assign trading cards with attributes that ~battle~ before an actual match begins. The winner of the card battle gains the boosts listed on their card, adding a new angle to what would simply be a typical online confrontation. It'd be great to lose the blatant marketing ploy and simply see some sort of abilities characteristic in the game, but it's a start. Fear Gaara's Overwhelming Power Generations offers a great deal of unlockable content as well. In addition to opening up branches in the story mode, players must work to open up all of the game's 72 playable characters, as well as more that only designated for support roles. Fans of the Naruto collectible card game will also be happy to know the ~Sage's Legacy Edition~ expansion comes with passwords that can be used to unlock more content. Movies, new tools, character images and much more are able to be purchased with in-game currency, which is earned by competing in any type of match, single-player or otherwise. The in-game shop could use more useful and significant items (such as extra stages, modes or even characters) for purchase, but the fact that so much extra material is available is more than welcome. One suggestion for the future - include some sort of encyclopedia to help those new to the franchise understand more about this colorful world. The story mode only manages so much. CLOSING COMMENTS Cyber Connect 2's Ninja Storm series is somewhat of a known entity at this point. The developer not only creates a gorgeous replication of the popular Naruto series, it knows how to treat the characters and their stories with respect. In some ways these games capture the essence of the manga better than the anime adaptations do - and they do it while allowing players to create epic battles of their own. The different approach to the single-player story works well, and though it retreads a lot of familiar ground, it never feels like it's wasting time, maintaining a constant focus on Naruto and Sasuke. Subtle changes to the mechanics continue to add layers to the combat, and while this isn't the most nuanced fighter, that's not necessarily a problem - for the most part. Fans of Naruto are no doubt going to pick up Generations, but what's more important is that showing this game to non-Naruto fans will make them understand what makes this franchise so beloved. Hidden below the crazy, numerous battles are some very moving stories about kids trying to find their way in the world - and how their elders struggle to raise and protect them. The heart of the Naruto franchise is stunningly sincere - and somehow this game finds those points and shines a spotlight on them. Powerful stuff indeed, particularly if you just walk into this looking for a casual, addicting fighting game with great graphics - which also describes Generations perfectly. IGN RATINGS FOR NARUTO SHIPPUDEN: ULTIMATE NINJA STORM GENERATIONS (PS3) Rating Description out of 10 Click here for ratings guide 9.0 Presentation A very lengthy storyline is somehow streamlined without missing its heart. Not even the anime manages such an immediate, powerful impact sometimes. 9.0 Graphics Absolutely gorgeous, capturing the tone of both the manga and anime perfectly. 8.0 Sound Good music can get a bit repetitive. Decent voice work - and the ability for a Japanese language track. 7.0 Gameplay Simple and very effective, though there is definitely room to layer in complexity without losing accessibility. 9.0 Lasting Appeal Tons of unlockable characters, stages and online modes. Repeated characters are a bit of a shame. 8.5 OVERALL Great (out of 10) Cyber Connect 2's Ninja Storm series is somewhat of a known entity at this point. The developer not only creates a gorgeous replication of the popular Naruto series, it knows how to treat the characters and their stories with respect. In some ways these games capture the essence of the manga better than the anime adaptations do - and they do it while allowing players to create epic battles of their own. The different approach to the single-player story works well, and though it retreads a lot of familiar ground, it never feels like it's wasting time, maintaining a constant focus on Naruto and Sasuke. Subtle changes to the mechanics continue to add layers to the combat, and while this isn't the most nuanced fighter, that's not necessarily a problem - for the most part. Fans of Naruto are no doubt going to pick up Generations, but what's more important is that showing this game to non-Naruto fans will make them understand what makes this franchise so beloved. Hidden below the crazy, numerous battles are some very moving stories about kids trying to find their way in the world - and how their elders struggle to raise and protect them. The heart of the Naruto franchise is stunningly sincere - and somehow this game finds those points and shines a spotlight on them. Powerful stuff indeed, particularly if you just walk into this looking for a casual, addicting fighting game with great graphics - which also describes Generations perfectly.", "date": "March 13, 2012"}