{"name": "SSX 3", "name_review": "SSX Review", "ref": "https://me.ign.com/en/ssx-3/57045/review/ssx-review", "text": "Extreme sports games died in the mid-2000s. They were a relic of last generation's ideals, a fleeting memory of joy that developers couldn't capture again. Then SSX rose from the dead in the most spectacular fashion, like Lazarus busting a 1080 nosegrab. For the fifth canon installment in the SSX series (the Wii's SSX Blur doesn't count, apparently), EA Canada went all out in every aspect, bringing back familiar faces for their most epic adventure yet. Not that SSX needed a riveting story to get you into the idea of snowboarding around the world, but the plot revolves around team SSX trying to conquer the nine Deadly Descents (the most dangerous mountains in the world). Problem is, one of their former team members, Griff, claims he's going to do it first. Oh hell no. So it's a race to beat the douchey prettyboy to the mountains. SSX Video Review Whether you're carving through broken sections of the Great Wall of China, or leaping off of abandoned nuclear reactors, SSX never fails to excite. Every mountain range exudes an awesomely unique vibe, playing off the region's features. It takes skill and well-timed jumps to dodge the broken aircraft and steep, deadly cliffs of Patagonia. Grinding along Alaska's pipelines turns a normal snowboarding track into a rollercoaster. Every area in SSX provides an amazing, exhilarating ride. Even the ~love it or hate it~ ranges, like the dark mazes of Africa or the icy deathtraps in Siberia, are breathtaking trips. The core of SSX has, since Tricky at least, been about pulling incredible, over the top tricks, and this SSX has that in abundance. Both the stick and button controls work extremely well, allowing you to pull off dozens of tricks in a row with complete ease. The real skill comes in keeping that combo up, an absolutely crucial strategy for getting those high scores (which generally lie in the 15-20 million point range). For the SSX enthusiasts, the classic controls are available too, though they seem more like a favor to fans than something you'd want to play with for some of the more difficult tracks. Hitting the same tracks in a Race event, instead of a trick run, can change your entire strategy of the course, forcing you to find the fastest lines instead of the biggest air. And every course features multiple branching paths, hidden tunnels, and dangerous canyons, requiring expert precision to get those best scores. And sometimes just to survive. You won't see this sh#$ at the Winter X Games. SSX's newest component, the Survive It courses, test your ability to not eat it and die. Each of the nine mountain ranges feature a Deadly Descent, a mountain so dangerous that you need special gear to even ride it. It's here where things like the wingsuit come into play. While the other featured gear is nowhere near as exciting as the wingsuit (oh sweet, I get a headlamp?!), all of the actual Survive It events try to kill you in the most exciting ways possible. Giant avalanches try and swallow you up, freezing cold temperatures and lack of oxygen will suck the life from you, jagged rocks and trees threaten to crush your bones. So yeah, no sweat. Throughout the entire game, RiderNet keeps track of your progress. Anyone who has played the last few Need for Speed games will recognize RiderNet as an Autolog-inspired online resource. From the second you load up SSX, RiderNet alerts you about what your friends are doing. Any scores posted or collectibles acquired pop up, and the game sets challenges for you based on your friend's scores. Multiplayer in SSX comes in the form of Global Events, a constantly updating series of challenges open to everyone in the world (or just you and your buds). EA has challenges going all the time, and you can just drop in and try and post a high score or fast time. As you're racing along a course, other players doing the same show up alongside you in a crazy simultaneous event. For some, the lack of traditional multiplayer is a problem, but with the custom events that let you invite only your friends, you can get near that experience. Plus the Global Events and RiderNet combine to open up multiplayer in a much broader and more modern way that allows you to play SSX at your own speed and on your schedule, while still keeping that competitive edge with your friends. Carve it up in SSX What's a snowboarding game without a dope soundtrack, right? SSX goes hard with a lot of drum and bass from The Qemists. Skrillex provides the obligatory dubstep madness. Noisia's uptempo electronica is rad. Bands like Foster the People and The Naked and Famous represent the whiteboy rock contingent. And it's all accented by a Pretty Lights remix of Run-DMC's ~It's Tricky~ whenever you get your combo up. But what really makes the soundtrack so cool is that SSX auto remixes the songs as you race, and this works when you load your own music into the game as well. CLOSING COMMENTS SSX is the video game this generation has been missing. The feeble attempts of other, lesser snowboarding games to capture the adrenaline fueled excitement of SSX dont compare at all. This is what happens when you dont just put the game out every year, but spend your time crafting it, creating the ultimate experience. SSX redefines snowboarding games, raises the bar for the genre, then backflips over it. IGN RATINGS FOR SSX (X360) Rating Description out of 10 Click here for ratings guide 8.5 Presentation An awesome global menu system, customizable everything, and even some neat comic book stories for the characters. 9.0 Graphics The huge, diverse mountain ranges look great, every character is mad stylish and over the top. 8.5 Sound Eclectic and fun soundtrack from some of the industrys hottest new electronic and rock names. Shame theres not more voice acting. 9.0 Gameplay Over the top, insane snowboarding action that blows the doors off every other boarding game. 8.5 Lasting Appeal RiderNet and Global Events provide constant challenge, despite the lack of traditional multiplayer. 9.0 OVERALL Amazing (out of 10) SSX is the video game this generation has been missing. The feeble attempts of other, lesser snowboarding games to capture the adrenaline fueled excitement of SSX dont compare at all. This is what happens when you dont just put the game out every year, but spend your time crafting it, creating the ultimate experience. SSX redefines snowboarding games, raises the bar for the genre, then backflips over it.", "date": "Feb. 24, 2012,"}