{"name": "Disciples: Liberation", "name_review": "Disciples: Liberation Review", "ref": "https://me.ign.com/en/disciples-liberation/191092/review/disciples-liberation-review", "text": "A tactical RPG adventure, Disciples: Liberation is a fun outing in a fantasy world that puts you in the shoes of a classic RPG protagonist with special powers, a motley crew of companions, and a bone to pick with fate... then just keeps escalating the stakes further than you'd ever expect them to go. In fact, it punches above its weight class in the quality of its combat and content, but lets itself down with a disorganized mess of extra systems and some very prominent bugs.Blending a turn-based tactics game with a proper RPG, Disciples: Liberation has you wander through isometric environments as you play through a hefty 80-hour RPG story  I did more than a few sidequests and optional fights, ending up at 92 hours played. It's not an open world, but it's not linear either; each chapter is divided up into a few regions that can be tackled in any order. Within those regions you fight a lot of turn-based battles, and it's good that those are fun and (aside from being a bit slow at times) pretty openly designed because there are a lot of them.It's a suitably sprawling, cosmic story for Nevandaar, a fantasy world that's dark and terrible, but still allows for goodness and redemption. Your character, a gutter-born mercenary named Avyanna, has plenty of dialogue choices: Kind ones denoted by halos, aggressive ones denoted by horns, and snarky ones denoted by Avyanna's own twilight wings symbol. The sidequests have enough diversity, and enough compelling characters, that I couldn't always easily decide who to side with. Disciples: Liberation knows what tone it's going for and sticks to it.There's a lot of branching dialogue, most of it pretty good, but some of it's really cheesy and accompanied by equally cheesy voice acting. That's honestly a positive thing, because Disciples: Liberation knows what tone it's going for and sticks to it. Nevandaar is a comfort-food setting; this is a familiar, feel-good, generic fantasy done right.When you settle in for a fight you'll control Avyanna, a few of her named companions, and a set of generic units you've recruited on your travels or produced back home in the ancient magical city of Yllian. There's a lot of variety to the units, from armored infantry to bone golems, possessed berserkers, and feral elf snipers. There are over 50 units, all told, and units level up as you go, so nothing ever becomes truly irrelevant. (Unfortunately, though your companions are a diverse and weird lot, on the battlefield they're just reskins of basic units with higher stats.)In addition to its front line use, each unit can also be placed in one of your three back line slots, where it contributes a unique power from afar by buffing your units or weakening your enemies. Pro tip: Winter Dryads give your entire army permanent regeneration, which I found invaluable.From armored infantry to bone golems, possessed berserkers, and feral elf snipers.The combat maps are an ideal size, giving you enough room to maneuver and a sprinkling of terrain to play around. They avoid both the trap of feeling like a tight chessboard and the classic genre mistake of attempting environmental realism at the cost of being tactically interesting. No playstyle feels penalized, nor does any style feel fundamentally overpowered. Both melee-centric and ranged options have their high points, and while mobility is strong, units get bonuses and healing if they choose not to use an action point. Those small bonuses for not acting are brilliant design, allowing defensive strategies to flourish in a genre normally obsessed with aggressive movement. The enemy AI does its best, and does focus fire pretty well, but is very bad at knowing when to time its special abilities and truly terrible at staying put to capitalize on those bonuses.I liked to build my armies out of combos of Undead (who have staying power), Demons (who hit hard), and Elves (to pick off the stragglers). The human Empire units are all obnoxious god-botherers and I couldn't stand their voice shouts after a while, so I mostly didn't use them. One of my favorite army compositions came about mid-game, when my undead Death Knights would inflict the chilled effect on enemies and Elf snipers, who automatically critical on chilled foes, would pick them off. Meanwhile Avyanna  who I'd built into a teleporting battle magician  would wreak havoc with controlling spells in the enemy's back line.The spells are a particular joy, with an extensive spellbook of magic to collect that varies from situational buffs and fireballs to weird utility spells like walls or clouds of mist. It really nails the feel of that classic fantasy magic-user with a spell for every situation, even if you're playing as one of Avyanna's melee builds.Other systems, however, seem designed almost at random. Other systems, however, seem designed almost at random. Resources for building your base and upgrading your troops are poorly balanced, with some critical and others all but useless  I had a stockpile of over 200,000 wood and iron at the end of the campaign but constantly wanted more gold. They also accumulate in real time while the game runs, but can only be picked up in your base, so if you really wanted unlimited resources you could leave Disciples: Liberation running and visit every hour or so. There's other stuff that generally feels irrelevant and only comes up as a frustration, like persistent damage between unrelated combats, or the arbitrary limitation on how many buildings you can place in your settlement.None of that really detracts from the otherwise nice story and combat, though. What does are the interface, which slows down gameplay, and the bugs, which are both frustrating and too numerous to list. The interface itself just has delays built in: It's riddled with submenus and loves to use three clicks for a task when one would do. It's also poorly signposted outside of combat, doing things like showing you a total for a number but not what that number means  it's not fun to reverse-engineer precisely what each point of strength does.The bugs, on the other hand, are more than mere annoyances. Some were just exploits, like one that let me add infinite units to my army. Others were annoying but survivable, like low-level combats that can't be autoresolved, or skills that seem to do nothing. Other issues consistently cropped up that required me to reload a recent quicksave or quit out and restart. I can't be comprehensive, but I'll give a few examples that required a reboot to fix: A persistent bug made me unable to interact with the world at random. Clicking ~Done~ too quickly after combat locked me on the summary screen. I'm a veteran of weird bugs and probably have more patience for them than most, but these were bad enough that I'd be sure they're fixed before you commit to play.None of them were apocalyptic, of course. My save worked, and I was ultimately able to finish relatively unimpeded, but it left me with the sour taste that combos, skill bonuses, and other key parts of the game either didn't work. Or, worse, that they didn't work and I had no way to tell they didn't work. Disciples: Liberation struggles against itself. It contains a rich world and high-stakes story that are coupled with fun and varied tactical combat, but this RPG feels destined for cult status, especially among those who didn't know they wanted this particular blend of genres. Despite its epic length, its a game that feels like the start of something bigger, and I had enough fun that I'd at least try a sequel. Disciples: Liberation has a lot of interesting ideas going on that could be refined into something great  if its rampant bugs can be smoothed out and its extraneous systems balanced.", "date": "Oct. 30, 2021,"}