{"name": "Virtua Tennis 4", "name_review": "Virtua Tennis 4: World Tour Edition Review", "ref": "https://me.ign.com/en/virtua-tennis-4/56788/review/virtua-tennis-4-world-tour-edition-review", "text": "SEGA's entry into the Vita ring brings its hit tennis game to handhelds. Seems like an odd choice for the first Vita game from SEGA, but hey, Virtua Tennis' arcade tennis style is a good fit for the handheld. Between the two major tennis games, Virtua Tennis was always the more arcade style game, while Top Spin was a more traditional tennis sim. Virtua Tennis 4 stays true to its roots. It's got a wacky, over-the-top feel, and there is more of a focus on exciting tennis action and less on stats and attributes. The Virtua Tennis 4 Console Version Video Review Virtua Tennis 4 plays really well. The controls are tight, the animations are good, and the game has a great difficulty progression. The opponents feel unique and require different strategies to defeat. It's satisfying to hit a smash and watch the other guy dive for it. Not gonna lie, I yelled obscenities both in anger and joy during the final, most difficult tournament, and that's how a high energy, emotional game like tennis should feel. The biggest problem with Virtua Tennis 4 is that it feels like I've played all this before. Not only because I literally played this before when it was out on PS3, but also because the series hasn't changed much. The meat of the game doesn't feel different than Virtua Tennis 3. It's nearly all the same players, and the mechanics are identical. Not that there's a lot that can be improved in a tennis game (it's essentially a glorified Pong), but it's hard to get excited for a game I've played already. Virtua Tennis 4 isn't all a rehash, but the new features don't add a lot to the experience. The World Tour is now a bizarre board game, adding a level of randomness to the career. While it certainly keeps things interesting, it does little more than add a sense of frustration whenever I couldn't play a tournament or mini-game when I wanted to because the game forced me to move in random intervals on the game board. Likewise the mini-games are back, with the same zaniness like gathering chicks, and playing hot potato with a time bomb, but these are momentary distractions. I commend SEGA for making my training sessions in career mode more interesting than just practicing a backhand, but the games aren't fun enough to play on their own (which is what the game's Party mode is all about). Thankfully Virtua Tennis 4 features an Arcade mode, a more streamlined four-match tournament that gives you a decent challenge without all the fluff. And there is an online mode, though I wish it was more robust. I can play matches against people, and there's a ranking system that keeps track of my wins, but it'd be nice to set up an online career or tournament structure. That isn't too much to ask. Vita Features For the Vita version of Virtua Tennis, SEGA crammed some new features and mini-games into the package. You can use the camera to take a picture of your face, creating a frightening version of yourself as a playable character. The camera can also be used to pose with the game's 3D modeled tennis stars (like you really know them!). Like the camera, most of the other Vita features seem superfluous or tacked on. The touchscreen multiplayer turns tennis into an awkward game of Pong. The VR camera mimics the motion control mode from the console games, which is fun, but only as a diversion. The main game's touch controls allow you to swipe for shots and move your player around the court, but I found it to be slower and less responsive than the button controls. I kept switching back to the normal control scheme and eventually just never went back to touch controls. It's a good try, but when the game gets intense towards the end you need the precision of the normal control scheme. CLOSING COMMENTS Tennis works pretty well as a handheld game. The matches can be pretty short (and are short by default in career mode), so you can get your tennis fix in whenever. The new features dont add a lot to the package, making it hard to recommend Virtua Tennis to anyone that has been playing it on the console. But as one of the first sports games on Vita, Virtua Tennis is way more exciting than golf or billiards. IGN RATINGS FOR VIRTUA TENNIS 4: WORLD TOUR EDITION (VITA) Rating Description out of 10 Click here for ratings guide 7.0 Presentation The wacky career mode has been fleshed out and streamlined for the Vita, making the board game a little more interesting. 8.0 Graphics The lighting and animations are great (if repetitive), and aside from some ~uncanny valley~ moments, the character models look really good. 6.5 Sound The music is very limited, and the player's grunts often sound ridiculous. 8.0 Gameplay The actual tennis gameplay is still really fun, just like it's been for the last decade. Touch controls are meh. 7.5 Lasting Appeal Decent career mode length, and some limited online play. The Vita modes don't add much actual fun. 7.5 OVERALL Good (out of 10)", "date": "Feb. 22, 2012,"}