{"name": "Asura's Wrath", "name_review": "Asura's Wrath Review", "ref": "https://me.ign.com/en/asuras-wrath/57094/review/asuras-wrath-review", "text": "Asura's Wrath is not like any game you will ever have played before. This is, self-evidently, an excellent thing  and a rare one, if you've been playing games for a long time. It is an attempt at a new kind of interactive entertainment, one much closer to living, breathing anime than traditional action game. It delivers a story that's up there with the best gaming has to offer in terms of visual spectacle, but in doing so, it stays very close to the conventions of film, and rather shies away from actually being a game. The game's story spans 12,000 years and follows the story of Asura  a demi-god betrayed by his fellow gods and thrown out of heaven. He loses his wife and daughter to a power-plot dreamed up by the other deities, and finds himself resurrected centuries later through the sheer force of his anger. As he comes back to life and sees what a mess of the world his former comrades have made, his rage gets stronger and stronger, leading to some incredible scenes of over-the-top, fantastical violence. You'll see some astonishing things: the Earth exploding into a gigantic laser-shooting maw, a sword so long it can cleave the Moon in two, and Asura regularly punching people so hard that they literally go into orbit. Watch the video review It is best described as an interactive anime box-set. The game is split into 18 episodes (with a secret unlockable one at the end) of about 20 minutes each, each one book-ended by gorgeously illustrated bumpers and adorned with credits just like a real television show. There's even a narrated preview before each one that hints at what's about to happen. Each of these episodes features completely different gameplay, dependent on the scenario. So in one episode, you might be headbutting a giant turtle to death, where in the next you're shooting giant squid in space in an on-rails shooter scenario. Next, you may be engaged in an epic Dragonball Z-style one-on-one confrontation on the moon. In one episode, the objective is to stop Asura from staring for too long at the generous assets of a hot-springs attendant. I'm not making that up, that really is a level. Sake from a hot spring Asura's Wrath's presentation is faultless. The style, which is a synthesis of bizarre science-fiction and Japanese mythological imagery viewed through a pen-and-ink, comic-book filter, is unique and striking. It's beautifully directed; the animation is often up there with the best in Japanese film. It's awesome scene after awesome scene: a fleet of spaceships exploding in the sky, a space weapon shaped like a giant Buddha made of light, a face-off between six-armed Asura and stylish, mask-wearing rival Yasha in a smoking crater. The static illustrations that feature between episodes are gorgeously detailed too  as you might expect from a studio (CyberConnect 2) whose staff are suffused with passion for manga and anime. Asura's Wrath is, in my opinion, one of the greatest achievements in Japanese animation in a very long time. Its story  bonkers and entirely nonsensical as it is, towards the end  is what keeps you playing; you always want to know what's going to happen next. But  and this is a very big reservation  it often forgets to be interactive. About 70% of the time in Asura's Wrath, you're watching rather than playing. You're lucky if any given episode features more than three or four minutes of actual gameplay. There's no getting away from the fact that Asura's Wrath is mostly cutscene. Even when you're nominally involved in the action through QTEs, failing them often makes no difference to what actually happens in the scene; all it does is lower your overall performance rating at the end of the episode. It's not boring, for the same reason that Metal Gear Solid 4 isn't boring: these are some of the best, most ludicrously insane cutscenes you will ever see. But where Metal Gear Solid 4 has hours of gameplay inbetween its self-indulgent cinematography, Asura's Wrath does not. It's a shame, because in the rare moments when Asura's Wrath is just being an action game, it's very good fun. Light and heavy attacks change depending on context, and there are cool-looking, satisfying counters and finishing moves for each enemy type. The aim, in action scenes, is to build up enough rage to initiate Burst mode, which throws you into a QTE sequence that advances the story. There's a cool symbiosis between gameplay and theme in Asura's Wrath: there's no better genre than the action game for a story about a very, very angry man channelling his rage into all-consuming destructive power. The source of Asura's rage Another major shortcoming is longevity: Asura's Wrath is barely six hours long, which is very light for a full-price game. Replaying episodes on higher difficulties is a possibility, but because the story is what you're playing for, you won't want to have to sit through all the cutscene twice. Whichever way you look at it, a game that essentially constitutes maybe two hours of gameplay if you take out all of the cutscenes and timed button-pressing is going to have a tough time selling itself for the same asking price as, say, Skyrim. And even within that short runtime, there's a little too much repetition in the enemies and boss fights to be entirely forgivable. What we have in Asura's Wrath is a game that's stylistically almost perfect, but lacking in substance. I enjoyed it immensely  and so will you, if you've any weakness at all for mad Japanese action  but if I had paid 40 (or $60) for it, I doubt I would look upon it so warmly. As an episodic download release Asura's Wrath would be brilliant, but as a premium-priced game it can only be recommended with strong reservations. CLOSING COMMENTS I cant help but love Asuras Wrath for having the bravery to try something completely new. It sets out to be a new kind of interactive animation, and it succeeds completely at that. But a game this light on actual content is difficult to justify as a full-price release; its style over substance, and some players will feel cheated by the paucity of actual gameplay in amongst the six hours of brilliant spectacle. You should absolutely play Asuras Wrath, because its an experience like no other, but be aware of what it is before you put down your cash. IGN RATINGS FOR ASURA'S WRATH Rating Description out of 10 Click here for ratings guide 9.5 Presentation Stylistically Asuras Wrath is basically faultless: its unique, strange, unashamedly over-the-top, and always a pleasure to look at. 9.0 Graphics The animation and cinematography are right up there with the best. 9.0 Sound Asuras Wraths original score complements the action well, and both the Japanese and English voice actors do a good job. 6.5 Gameplay What there is, is good  but theres disappointingly little gameplay here. 4.0 Lasting Appeal Six hours for a full-price release just isnt acceptable, no matter how enjoyable those six hours are. 7.5 OVERALL Good (out of 10) I cant help but love Asuras Wrath for having the bravery to try something completely new. It sets out to be a new kind of interactive animation, and it succeeds completely at that. But a game this light on actual content is difficult to justify as a full-price release; its style over substance, and some players will feel cheated by the paucity of actual gameplay in amongst the six hours of brilliant spectacle. You should absolutely play Asuras Wrath, because its an experience like no other, but be aware of what it is before you put down your cash.", "date": "Feb. 17, 2012,"}