{"name": "Dungeon Hunter: Alliance", "name_review": "Dungeon Hunter: Alliance Review", "ref": "https://me.ign.com/en/dungeon-hunter-alliance/56806/review/dungeon-hunter-alliance-review", "text": "The Playstation Vita may have its first structural stability test in the form of Dungeon Hunter: Alliance. This hack-and-slash adventure requires constant button-mashing as thousands of enemies fall under the attack of its protagonist. Dungeon Hunter: Alliance is a fun game full of loot and monsters, and tells a simplistic tale of fighting the evils in the world. But Gameloft's battler isn't a new game. In fact, you can buy Dungeon Hunter: Alliance on PSN right now for $12.99. While a fun stop-gap until more Action RPGs show up on Vita, it's difficult to justify the full retail price of Dungeon Hunter: Alliance when there's a much cheaper version readily available. Dungeon Hunter: Alliance in Action Dungeon Hunter: Alliance is similar to Diablo, in that enemies drop weapons, armor, and treasure left and right, making it a collector's dream. Fighting through thousands of enemies in a long (yet familiar) quest plays out well, but diving into the framework reveals inherent problems. Ranged attacks and spells hit hard, even when enemies attempt to swarm the hero, but melee attacks feel imprecise, making many battles a lumbering frustration. Which enemy loses a sliver of life? Depends on the minute distinction of which direction a player is facing. Even standing in front of a breakable barrel illuminates the inherent problems in hit detection, with containers often taking multiple swings to register a hit. When too many enemies show up, things slow down. When bashing in the skull of a skeleton or gargoyle or spider, the loot drops give purpose to the fight Filling up the inventory with varied tools gets a boost from the auto-equip function that automatically throws on more powerful items. Compounded with the option to auto-transmute items into gold, inventory management is super easy and adding coins to your gold stash simple. Most gold goes to purchasing potions, the only way to survive in Dungeon Hunter. Each area's earmarked by a statue that sells them, and there's no way to battle through a given area without filling up regularly. While loot is plentiful, it never makes you feel all-powerful. Between loot and the reliance on potions, Dungeon Hunter: Alliance never lets you trounce enemies that regularly rubberband up to match your current strength. The plentiful enemies regularly surround and attack the hero, but it's easy to lose track of them. While the player shows up as a blue outline behind 3D objects like arches and trees, enemies don't. Thus, when a swarm of wolves chase you behind a tree, you're swinging blind, hoping to survive the encounter. This wouldn't be such a problem if the hit detection was better, but we're talking invisible threats. Other times, when enemies retreat they'll suddenly disappear for unspecified reasons. All of these enemy problems are dwarfed by the true enemy of combat: a terrible frame rate. While Dungeon Hunter: Alliance thrives on its huge battles, it's difficult to survive when your life disappears in jagged cuts and mashing your special skills doesn't translate to the stuttering fight onscreen. Swing hard until you hit 'em. Multiplayer marks one of the more successful elements of Dungeon Hunter: Alliance. Jumping into a four-player online game works smoothly, though everyone's locked to the same screen and it's often difficult to get everyone to go to the same location. Loot gets color-coded, so it's easy to discern what new object gets to join your inventory. Having multiple classes in a party makes the larger rumbles more pleasant. The Vita brings some subtle additions to Dungeon Hunter: Alliance. Using the dual-touch front screen, you can zoom in and out on the battlefield, and using the back touch pad controls the treasure-hunting fairy that follows the hero around. The extra controls that vary from the PSN version don't add much to the experience, as the functions aren't critical to success in the adventure. CLOSING COMMENTS Dungeon Hunter: Alliance isnt as polished as Diablo and lacks the charm of Torchlight. Battling through its varied levels and sorting through mountains of loot is fun, when glitches dont get in the way. Unfortunately, when it costs $28 more to hack and slash through the adventure on Vita than on Playstation 3, one must question the value of the package. The added Vita elements and the glitches just dont go far enough. IGN RATINGS FOR DUNGEON HUNTER: ALLIANCE (VITA) Rating Description out of 10 Click here for ratings guide 6.0 Presentation The story isnt interesting enough to repeat, and the Pit of Trials doesnt add much variety to the options. 6.0 Graphics While it looks better than its iPhone origins, Dungeon Hunter: Alliance isnt a great looking game, especially when the frame rate cant keep up. 7.0 Sound The clash of swords and roaring monsters sounds good, but the text-driven story feels like a jarring gap when it comes to sound. 5.0 Gameplay Spotty hit detection and the reliance on potions make this game more obnoxious than it should be. It swings quickly into chore territory. 7.0 Lasting Appeal Collecting loot feels like an infinitely expanding hobby, but after a certain point, it doesnt feel necessary to do it all over again. 5.5 OVERALL Mediocre (out of 10)", "date": "Feb. 14, 2012,"}