{"name": "Mario & Sonic at the London 2012 Olympic Games", "name_review": "Mario & Sonic at the London 2012 Olympic Games Review", "ref": "https://me.ign.com/en/mario-sonic-at-the-london-2012-olympic-games/57121/review/mario-sonic-at-the-london-2012-olympic-games-review", "text": "The worlds of Mario and Sonic collide once again, not to adventure through the Mushroom Kingdom or acquire the Chaos Emeralds, but to compete in the 2012 London Olympic Games. Though the now-familiar concept doesn't quite have the same appeal as a new platformer, it works reasonably well in its own right  despite the game's design limitations. The Wii version of Mario & Sonic's latest Olympic team-up was released late last year, and while the Nintendo 3DS version appears similar on the surface  this time containing more than 50 different Olympic-related events  the actual execution is significantly different. Perhaps attempting to appeal more toward gamers on the go, the events here are mini-games, purposefully reduced in design and control. A game of soccer/football, for example, has been streamlined to focus on penalty kicks instead of a more complete version of the sport. Games like tennis or volleyball are likewise limited, opting to simply have you hit a ball with timed button presses or stylus swipes rather than position your players on the court. Like past Mario & Sonic at the Olympics titles, some of these mini-games fare better than others. Many of the shooting (double trap), combat (fencing) and biking-related (BMX) events are quite good, and a few are actually addicting. Attempting to earn gold medals on all three difficulty levels will keep you coming back repeatedly. You'll also no doubt attempt to get the best scores or times possible, as many of those can be ranked globally online. Lastly, participating in events will earn you tickets, which can be redeemed for the 200 collectible badges that can be applied to your ID tag used for rankings. Yet for all the halfway decent experiences, there are several that are cringe-worthy. Your first time yelling at your 3DS to prompt weight-lifting will likely be your last. Similarly, blowing at your system while you attempt to adjust a sail on your boat feels ridiculous, even if there's no one in the room. And was there a strong demand for an event based around grabbing a water bottle during a marathon? Anyone? Embarrassing design experiences aside, the game's developers never seem to settle on consistent controls, even when dealing with repeated events. For example solo archery uses the stylus for control while team archery  which is the same sport with multiple characters on your team  uses the gyroscope. Slightly less annoying is that the game limits the selectable characters to four per game, based on arbitrary and generic categories such 'Heroes' or 'Wild Ones'. Want to use Mario in the aforementioned archery event? Tough luck. Selecting Mario over a different character wouldn't matter anyway, as none of the characters seem to differ in ability or skill. What's most frustrating about these design and control limitations is they seem arbitrary. The 3DS is capable of replicating console-like experiences. This feels deliberate, and the ~benefit~ of having 50 mini-games doesn't cut it when they include grabbing water bottles or walking quickly. And that doesn't begin to cover the repetitive nature of many of them, or the poor control schemes that many suffer from. Adding to this game's woes is the fact that the Wii version's Dream Events (wackier sports more suited to the worlds of Mario and Sonic) and London Party modes (akin to an Olympic Mario Party) have been removed. In their place is a Story Mode that attempts to create a narrative for all the characters just prior to the Olympic games. When the plot starts with Bowser and Eggman deviously plotting to make the already-foggy London foggier, you know you're in for a rough time. The mode never aspires to be more than medleys of existing events, strung together by poor cutscenes with irritating sound effects. Mario and Sonic deserve better than this  they've had better than this. CLOSING COMMENTS Perhaps thats what makes Mario & Sonic at the London 2012 Olympic Games on the 3DS so frustrating. While it has some great mini-games, it forcefully limits itself and discards many of the ideas that made its predecessors so good. There are some good elements here though. Acquiring medals, ranking your best scores globally and earning medals can be very addicting. But only half of these games are worth playing. Most are simply shallow attempts at their counterparts, which is more or less what this version of the London Olympic Games ends up being. IGN RATINGS FOR MARIO & SONIC AT THE LONDON 2012 OLYMPIC GAMES Rating Description out of 10 Click here for ratings guide 6.0 Presentation Story Mode is ridiculous. Everything else is fine. Some very poor control descriptions. 7.0 Graphics Certainly competent but nothing impressive either. Good 3D effects. 6.0 Sound Decent music but the character voices are utterly irritating. 6.0 Gameplay A bit of a mess. Some games are great, others arent at all. Where are the great modes from the Wii version? 8.0 Lasting Appeal Attempting to get badges, medals and rank your times online will be addicting. 6.5 OVERALL Okay (out of 10) Perhaps thats what makes Mario & Sonic at the London 2012 Olympic Games on the 3DS so frustrating. While it has some great mini-games, it forcefully limits itself and discards many of the ideas that made its predecessors so good. There are some good elements here though. Acquiring medals, ranking your best scores globally and earning medals can be very addicting. But only half of these games are worth playing. Most are simply shallow attempts at their counterparts, which is more or less what this version of the London Olympic Games ends up being.", "date": "Feb. 14, 2012,"}