{"name": "King Arthur II: The Role-Playing Wargame", "name_review": "King Arthur II Review", "ref": "https://me.ign.com/en/king-arthur-ii-the-role-playing-wargame/57119/review/king-arthur-ii-review", "text": "The poet Ogden Nash once said: ~Middle age is when you've met so many people that every new person you meet reminds you of someone else.~ I guess I must be the youngest middle-aged person ever, because it's uncanny how much King Arthur II reminds me of a bunch of old games, especially a turn-based title called Centurion: Defender of Rome. Like that game, KAII is played primarily on an overhead map (of England rather than the Roman Empire in this case), and gameplay consists of tactical battles interspersed with administrative tasks and a series of Choose-Your-Own-Adventure-esque diplomacy and espionage quests. Unlike that game, KAII isn't very much fun. And when I say ~Choose-Your-Own-Adventure-esque,~ that's literally what the lion's share of the ~RPG~ gameplay consists of here. You begin a quest by moving your army to it on the overworld map, and are presented with a series of text dialogue boxes. You can pick from a variety of approaches as to how to respond to the text, but all you really do is click A, B, or C. ~Stats~ as such don't enter into the equation, the entirety of gameplay here boils down to which of the several multiple-choice options you go with. Since various pathways will often lead to the same result (or slightly different ones), the quests tend to be devolve into clickthrough exercises that you just kind of want to get through as quickly as possible. On the plus side, though, these quests are often interesting and well-written, and the narrator, at least, is a quality voice actor who brings a sense of ~book-on-tape~ to the quest portions. Sure, you probably didn't buy a computer game for that book-on-tape experience, but the quality is there, nevertheless. King Arthur II's Launch Trailer The actual battles, of which you'll have plenty, are a much more action-packed affair, if a bit chaotic. Here, KAII tries its best to take a page from the Total War series  and to its credit, KAII looks every bit as snazzy, if not more, than the best AAA wargames out there -- but inferior AI, both for enemies and your own troops, as well as a too-forgiving level of difficulty on normal and a much too hard level on anything higher than that, render the tactical combat something of an exercise in going through the motions. Generally, you'll position your units before a battle, try to come up with some kind of clear strategy, give some initial orders, and let fly, at which point all hell pretty much breaks loose, partly because of the poor AI going pell-mell at the enemy, and partly because you can't practically employ tactics other than rushing into melee because of KAII's magic spell addition. See, KAII employs a Master of Magic-type hero system, whereby your army's general (you can only ever have three, disappointingly) can equip a variety of items that will boost his (or his units') effectiveness in combat, and can cast spells directly at enemy troops. Theoretically, it's a nice touch of direct influence in an otherwise hands-off situation, but apart from waiting for them to cool down after a casting, throwing spells seems to come with no cost or downside. You just mash away at the spell button whenever you get the chance, no tactics necessary. This means your army needs to close with and engage enemy troops as quickly as possible to avoid being whittled down by lightning bolts and debilitating curses while you maneuver. And that issue speaks to the larger one: KAII is generally weak sauce. Aside from the fairly obvious choose-your-own-adventure stuff, the campaign fails to provide much in the way of either strategic or tactical challenge. Often, enemy nations will have the wherewithal to annihilate your unprotected lands, but never send an army that you won't be able handle (if they send one at all). Partly this is because the AI is super forgiving with what it throws at you, even on the harder difficulty levels, and also because the tactical combat doesn't really require much in the way of battlefield acumen  although if you increase the difficulty, enemies get much tougher, if not any smarter, so prepare for frustration. A Glimpse of Neocore's Strategy Game On paper, you want your archers behind your foot soldiers, and your cavalry on the flanks (with any monster/demon/magic units doing whatever they do), but in practice if you start the battle with experienced units of pretty much any type, you're going to win. You might take more casualties, but these are easily replaced with the click of a button. And then your units garner more experience, and then you're even more badass, rinse and repeat. The original King Arthur was criticized for being too difficult (and if you jack up the difficulty, KAII will also feel unfair), but, at least on the default setting, the pendulum has swung too far in the other direction here. CLOSING COMMENTS While it certainly has plenty of missteps, KAII's nods to (or blatant rip-offs from) other classic games make it interesting from a nostalgia perspective. Because the gameplay is so straightforward, newbies to the genre who are nevertheless fans of the setting may find a friendly sort of Frankenstein monster to play with here. IGN RATINGS FOR KING ARTHUR II: THE ROLE-PLAYING WARGAME Rating Description out of 10 Click here for ratings guide 7.0 Presentation It looks nice and has pretty smooth load times throughout. The tutorial is helpful and verbose, and much of the game is presented via voice-over narration of generally decent quality. 9.0 Graphics This is a fantastic-looking title. Units are interesting just to look at, in that tabletop-miniature kind of way, and backgrounds, story scenes, and even menus look top notch. 7.0 Sound The voice acting is surprisingly good in some places, and kind of crappy in others. Music is period-appropriate and fantastical, although actual combat sounds are always weak and underwhelming. 6.0 Gameplay he game is multifaceted and brings in a lot of nifty ideas, it just doesn't offer all that much in the way of real options or chances to use your noggin. Good for newbies, not so good for grognards. 5.0 Lasting Appeal There's no multiplayer, so once you've gone through the campaign, you're pretty much done, which cannot help but reduce the shelf-life. 6.0 OVERALL Okay (out of 10) While it certainly has plenty of missteps, KAII's nods to (or blatant rip-offs from) other classic games make it interesting from a nostalgia perspective. Because the gameplay is so straightforward, newbies to the genre who are nevertheless fans of the setting may find a friendly sort of Frankenstein monster to play with here.", "date": "Feb. 14, 2012,"}