{"name": "Touch My Katamari", "name_review": "Touch My Katamari Review", "ref": "https://me.ign.com/en/touch-my-katamari/56800/review/touch-my-katamari-review", "text": "While the title may sound like an easy setup for whatever the Japanese translation of 'that's what she said' is, Touch My Katamari is instead the latest in Namco's long-rolling puzzle-action series that first made its debut on the PS2 in 2004. At that time, Katamari Damacy's sticky-ball shenanigans delivered a gameplay experience that was truly like no other  but since then a steady procession of sequels have only served to echo the original's quirky brilliance rather than evolve or enhance it in any meaningful way. Touch My Katamari Video Review Unfortunately, Touch My Katamari is once again more of the same. The main objective of it is unchanged; you still have to roll up as many animated and inanimate objects as you can within a set time limit, so that at the end of each level the King of All Cosmos can turn your enormous boulder of bits and pieces into a shining star. You start small and scale upward  the bigger your tumbleweed of trash, the larger the objects you can absorb. There are a couple of deviations from the formula, such as the level that gives you a calorie limit and tasks you with collecting salads and avoiding burgers, adding a semblance of strategy to the mix, but for most part you'll be rolling up absolutely everything in your path  from household items to entire households  in the exact same fashion as fans have done in each of the previous versions of the game. Maneuvering your Katamari ball around is a breeze, as this is easily the best-controlled portable edition in the franchise's history. Whereas both the PSP and iOS versions made concessions due to the limitations inherent to their respective control setups, Touch My Katamari handles exactly as it does on the home consoles thanks to the Vita's twin-sticks  you're even given the option of choosing between classic 'two sticks in tandem' to move, or the more contemporary 'one stick to move, the other to look' third-person controls. As the title implies, Touch My Katamari also incorporates a couple of Vita-specific touchscreen tweaks. Using either the front or rear touchscreen, you can swipe two fingers outward to stretch your Katamari into a rolling pin in order to cover more ground. Pinch two fingers together, and the Katamari becomes more narrow and fast-moving  better equipped to roll up steep inclines or steps. Neither of these abilities makes a dramatic difference to the gameplay, and chances are you'll forget about them most of the time, but they're both occasionally useful albeit non-essential additions all the same. He turns garbage into stars! Just like reality TV. If you were wondering how many colours the PS Vita screen is capable of displaying, then Touch My Katamari is a pretty good benchmarking tool. Just the primary color-soaked intro movie alone is enough to have you reaching for a bag of Skittles, and the vibrant palette endures all the way up to the game's psychedelic, final level freak-out. Each environment is littered with all kinds of weird and wonderful objects for you to steamroll  from juggling clowns to jumbo jets  and the frame rate remains silky smooth no matter how much clutter your Katamari collects. The main menu is slightly clunky, although a clean user interface has never been a hallmark of the series. Still, given that this is a portable experience it would have been nice to be able to skim through the list of challenges at a glance, rather than having to clumsily open up a conversation with each of the hub characters in order to check out the details of each challenge. Touch My Katamari's thirteen levels are interspersed with a five-chapter mini-movie that chronicles the adventures of Goro the Slacker. It's appropriately bug nuts crazy and bares little relation to the gameplay itself, but it's in keeping with the overall silliness of the series. Completing each level earns you candies that can be spent unlocking everything from soundtrack remixes to new clothing for the King, as well as two alternate modes for each of the levels  the sped-up Katamari Drive mode, and the roll-around-until-you-get-bored Eternal mode. Yet ultimately Touch My Katamari is a pretty fleeting experience  you can see most of what it has to offer within a day. While it may be the case that the game's designers have deliberately made the level challenges short to facilitate gaming on the go, it all amounts to what is a surprisingly short-lived experience overall. CLOSING COMMENTS Touch My Katamari is well-controlled and fun while it lasts, but it feels like the series has stagnated. The touchscreen controls are welcome, but I wish the developers had been a bit more creative with the Vitas functionality. Imagine using the Vitas augmented reality capabilities to roll a Katamari ball around your actual living room? Or standing on an apartment balcony and rolling a giant Katamari around your neighborhood? Or indeed doing something,anything, other than the exact same thing that Katamari fans have been doing since 2004? Instead we get the same old Katamari experience once again, and while its a solid entry point for newcomers, theres honestly nothing to see here for long-term fans. This is one rolling stone that has noticeably gathered moss. IGN RATINGS FOR TOUCH MY KATAMARI (VITA) Rating Description out of 10 Click here for ratings guide 7.0 Presentation Saturated with color and whimsy throughout, although the menu navigation feels a little clunky. 7.5 Graphics Consistent with the blocky style of previous games  it suits the gameplay but its nothing to scream about. 7.5 Sound The soundtrack is overflowing with upbeat electronica and acid jazz jams, but nothing like the earworms from the original PS2 games. 6.5 Gameplay Its still a fun and oddly hypnotic gameplay experience, but theres just no evidence of any innovation at all. 5,0 Lasting Appeal See most of what it has to offer in a day, then spend a week grinding your way to unlocking all the extras in the shop. 6.0 OVERALL Okay (out of 10)", "date": "Feb. 14, 2012,"}