{"name": "4 Elements II", "name_review": "4 Elements II Review", "ref": "https://me.ign.com/en/4-elements-ii/56962/review/4-elements-ii-review", "text": "The successor to 2008's highly acclaimed 4 Elements, 4 Elements II is a sophisticated look at the Match 3 discipline. It's far prettier and more challenging than the original, and it's definitely deeper. It's also eminently affordable (currently less than ten bucks), making it easy to recommend for those who fondly remember whiling away hours with the first game four years ago. But what about the rest of us? What you need to know right off the start is that 4 Elements II delivers itself, outwardly anyway, as a kids' game. It's all magic and castles and innocence. And fairies that flit about the screen. The music is generally soft and soothing, and there's nothing to offend the sensibilities of impressionable minds. It's a gentle approach that even younger children will appreciate but more mature gamers might find a bit immature. When you first fire up 4 Elements II, this whole Match 3 notion seems very far away indeed. Through illustrations and animated sprites, you're presented with a story about a magic kingdom  not surprisingly, the same magic kingdom found in its 2008 predecessor  that's fallen onto hard times. Seems said kingdom has been thrown into darkness and will remain that way until some brave soul  that would be you  dares to restore the revered ~magic book~ to its former glory. You then proceed to make your way through the book, chapter by chapter. Each chapter follows a similar routine  a non-Match 3 puzzle to start, several Match 3 levels in the middle, and other assorted non-Match 3 puzzles scattered throughout and at the end. These peripheral puzzles will take one of several forms  spot the difference, hidden object, and the like  yet few will ever present a serious obstacle to the adult gamer. Indeed, while children and purely casual players may enjoy them, many more will likely find them unnecessary and perhaps even bothersome. Regardless, the quality of the Match 3 play is second to none. In 4 Elements II, like the original, you don't merely jump about willy-nilly busting blocks. Instead, there's a very definite method to the madness. You see, it's all about the liquid  a liquid that must eventually flow through to the end of the current grid, but can only do so if you manage to clear a path for it before the timer hits zero. You clear that path, as I alluded earlier, by ~drawing~ the cursor through three or more adjoining colored cells. Do that, and the tiles underneath those cells evaporate, leaving an open corridor through which the liquid flows. Run the cursor through five or more adjoining cells, and you'll also trigger an explosion that eradicates even more tiles from the immediate vicinity. The more cells you connect, the bigger the explosion, and the more open space you create. But there's far more to it. Along the way, you'll encounter blockades in the form of boulders, frozen tiles, and solid metal plates. You'll come upon nifty little machines that fire flaming arrows toward other nifty little machines, which in turn explode and carve massive openings. You'll trigger land mines. You'll see mini-grids in which you must re-arrange puzzle pieces to form a pipeline or re-arrange massive cement blocks to clear an opening. And you'll find ways around  or through  those metal plates too. Aiding you in your quest is an assortment of four power-ups. Active and usable only when you've successfully connected a given number of similarly colored cells and then unusable until you've again connected another batch of similarly colored cells, each power-up is quite unique. The first acts like a pick-axe, allowing you to break apart boulders. The second will melt frozen cells. The third will transpose one cell of a given color for a cell of a given color, and the fourth reshuffles the entire board. The game is smartly designed to deliver constant variety. For starters, all grids are not created equal. While the very first is rectangular, future grids are in the shapes of animals, lanterns, bugs, and any other number of random shapes. More importantly, the game forces you to change up your modus operandi on the fly. One moment, for example, you're moving slowly and carefully, scanning the board for any color connections, playing the odds of which color will drop next, and crawling inch by painful inch in what at times seems like an impossible situation. Then, quite suddenly, you'll make a breakthrough and the entire board comes alive  tiles exploding, new cells dropping, arrows shooting this way and that, and liquid flowing like a raging river. Later, you're in another section where stringing together eight, nine, ten cells at a time is easy but the block puzzle lying ahead is tricky enough to tax the brain of even the proverbial rocket scientist. In this way, the game always keeps you on your toes. It's also important to note that each level is so vast, especially as you delve deeper into the game, that only a fraction of it will fit on your display at any one time. Sure, you can access a mini-map of the entire level whenever you want, but playing it bit by bit as its enormity automatically unfolds and scrolls upward or downward or side to side is a sincerely challenging task. Arguably the biggest knock is the absence of difficulty adjustments. Granted, developer Playrix seems to have gauged its target audience well and instilled just enough difficulty to keep things consistently edgy. Moreover, the game does offer a ~Relaxed Mode~ that's free of time constraints and will likely appeal to children and anyone looking for a less strenuous time. But an option to either crank up the challenge or marginally reduce it should have been included. CLOSING COMMENTS Burying a really adept Match 3 game inside a fantasy/magic approach that seems designed for children is an, erinteresting idea. Nonetheless, the core gameplay is very strong and the price is certainly right. It is not a grandiose overstatement to say that 4 Elements II feels, at times, like an IQ test; a thoroughly addictive, my-god-it's 2AM-and-I'm-still-playing IQ test. With fairies. IGN RATINGS FOR 4 ELEMENTS II (PC) Rating Description out of 10 Click here for ratings guide 6.0 Presentation On first blush and around the periphery, it feels like a kids' game. Inwardly, it's a thoroughly compelling cranial function tester. Quite the dichotomy. 8.0 Graphics 4 Elements II won't win an award for best graphics. But for a budget title focusing on a multicolored grid, it's a beautiful thing. 7.0 Sound A Match 3 game, by its very nature, will always be audibly repetitious. Still, there's enough variety here that you won't feel the need to switch off your speakers. 8.0 Gameplay In 4 Elements II, developer Playrix does as much as can be expected with an old-school concept. 7.0 Lasting Appeal Even hardcore Match 3 addicts might have a tough time playing the game a second time. Luckily, the first go-through will likely take weeks to complete. 7.5 OVERALL Good (out of 10) Burying a really adept Match 3 game inside a fantasy/magic approach that seems designed for children is an, erinteresting idea. Nonetheless, the core gameplay is very strong and the price is certainly right. It is not a grandiose overstatement to say that 4 Elements II feels, at times, like an IQ test; a thoroughly addictive, my-god-it's 2AM-and-I'm-still-playing IQ test. With fairies.", "date": "Feb. 9, 2012,"}