{"name": "Jak and Daxter Collection", "name_review": "Jak and Daxter Collection Review", "ref": "https://me.ign.com/en/jak-and-daxter-collection/56929/review/jak-and-daxter-collection-review", "text": "With any HD collection there are two questions: Do the games hold up, and is the HD conversion good? For the Jak and Daxter Collection the answers are: yes and yes. Whoa, wait don't go anywhere! Sit your ass back down. For those of you that never played the Jak series on PS2 what's your problem, huh? You missed three of the best action platformers of that generation. Naughty Dog pushed the PS2 to its limits, creating huge worlds, memorable characters, action packed stories, and great gameplay, all without loading screens, which was pretty damn impressive in the early 2000s (and still is). The Jak series has been lauded by everyone in the industry and IGN itself gave all three games scores around 9.5. Jak and Daxter Collection Video Review Jak Games The Precursor Legacy Jak II Jak 3 All too often games that I loved a decade ago feel dated and too easy. And while the Jak series feels a bit like a carry over from a genre that this generation has mostly abandoned, it stays fun, fast paced, and beautiful. Daxter still makes me laugh, that dock level in Jak II still makes me scream in rage, and the twist ending for Jak 3 is still one of my favorite moments in video game storytelling. The upscaling showcases how gorgeous these three games are. The Precursor Legacy didn't age as gracefully, though its environments are arguably the best in the series. But the second and especially the third game outshine many of the other HD collection counterparts. The 3D effect doesn't add a lot to the package, save for some cool moments when you're racing in vehicles, or in those spots where you can see large sections of the environment that show off the depth of the world. CLOSING COMMENTS As a gamer who likes to relive some of my favorite games, I find the HD collections to be an awesome way to get rewarded for nostalgia. And now Sony has released two of the three platforming hall of famers from the PS2. While I find myself more disappointed than I expected that games like Jak X, Daxter and even The Lost Frontier (ugh) arent included in the package, The Jak and Daxter Collection has reminded me why I fell in love with the series, and Naughty Dog as a developer. IGN RATINGS FOR JAK AND DAXTER COLLECTION Rating Description out of 10 Click here for ratings guide 9.0 Presentation Mass Media made awesome new title screens, and created dozens of unique trophies. 8.5 Graphics Fantastic upscaling make the later two games shine. The first looks good too, but aged. 9.5 Sound Daxter is the epitome of awesome voice acting. Yeah, I said it. 8.5 Gameplay Platformers have fallen out of favor recently, but these are some of the best in the genre. 9.0 Lasting Appeal Three full games on one disc, for one low price. 9.0 OVERALL Amazing (out of 10)", "date": "Feb. 7, 2012,"}