{"name": "Kingdoms of Amalur: Reckoning (Special Edition)", "name_review": "Kingdoms of Amalur: Reckoning Review", "ref": "https://me.ign.com/en/kingdoms-of-amalur-reckoning/56924/review/kingdoms-of-amalur-reckoning-review", "text": "Who said that epic and expansive fantasy RPGs had to have subpar gameplay? For as much as I absolutely adore games like Fallout 3, Mass Effect 2 and Skyrim, gameplay in those titles simply didn't live up to the amazing standards set by their superb settings, narratives and quest structures. In Fallout 3, VATS was simply an excuse for its inherently clumsy combat, and for as much awe as Skyrim instilled in me, in-game fighting is sloppy. Good news, then, that Kingdoms of Amalur: Reckoning has come along. Kingdoms of Amalur: Reckoning Video Review Reckoning proves once and for all that great role-playing experiences don't have to sacrifice what matters most in any game -- gameplay -- while still remaining true to all of the minutiae that makes the best RPGs great. And while Reckoning certainly has its own flaws, I still found myself utterly satisfied with my experience and anxious to parlay the good news to fellow fans of the western RPG. Reckoning certainly isn't a game you should sleep on. Quite the contrary: Amalur demands your attention. Kingdoms of Amalur: Reckoning's story, crafted by prolific New York Times bestselling author R.A. Salvatore, rests at the heart of the experience. At the beginning of the game, your character -- who you fully craft and customize throughout your adventure -- finds himself (or herself) revived from the grips of death via an arcane contraption known as the Well of Souls. This Lazarus-like event has messed with the threads of fate weaving in and out of Amalur's events and inhabitants, leaving you, the player, without a predestined course. Naturally, this lack of an almost Calvinist-like spiritual course gives you incredible power and potential, something that those around you seek to take advantage of and, at times, exploit for their own gain. Such a plot has incredible depth, and while all of the fictional names, locations and dense lore can be a bit daunting to keep up with, fantasy fans will find plenty to love. Better yet, exploring the story leads you in turn to exploring the expansive world of Amalur. Split into continents and territories, Amalur's world doesn't present itself quite as non-linearly as the likes of Fallout 3 or Skyrim, but you won't be tethered to isolated locations a la Mass Effect, either. Amalur is very much non-linear in its own right, and you can explore as much as you'd like (so long as you can survive). But everything is presented in a much more contained, coherent and orderly manner. Combat never felt so good. Lending to the feeling of exploration, Reckoning's high quality (yet inconsistent) art style will give you a true feeling of discovering the unique and unknown. Environments are beautiful, and locations feel truly different from one another. You'll work your way from ancient forests to wide open plains, from sandy deserts to murky swamps. Amalur exudes topographical and geological diversity. Unfortunately, characters and monsters alike don't quite live up to the lofty heights set by your surroundings, though everything still mixes together nicely. Reckoning's sparse musical accompaniment gets the job done, but the game's real sonic feat is the high quality of the voice acting. Characters, from major NPCs to people who give you miscellaneous side quests, portray their parts with a consistent level of polish. Unlike some other titles in the genre, I didn't constantly find myself noting ~Wow, that guy sounds a whole lot like the guy I talked to in that other town 10 minutes ago.~ Dialogue is lengthy, detailed and fleshed-out. It delivers a whole lot of punch on behalf of the story. 12", "date": "Feb. 6, 2012,"}