{"name": "Final Fantasy XIII-2 (Crystal Edition)", "name_review": "Final Fantasy XIII-2 Review", "ref": "https://me.ign.com/en/final-fantasy-xiii-2/56986/review/final-fantasy-xiii-2-review", "text": "~Linear.~ A word hurled at the original Final Fantasy XIII without relent, and rightly so. The game funneled players down a hallway for more than 20 hours while it told a provocative story of defying the gods. No matter how you felt about its battle system, you still had precious little to explore. When word of a sequel spread, the fear of that linearity persisted. But it seems the developers at Square-Enix wanted nothing more than to prove the gaming populace wrong with the same level of defiance Lightning and her friends showed the gods. Final Fantasy XIII-2 showers you with choice and branching paths. The battle system functions faster and includes several new features like tamable monster allies. But with these improvements, the story sheds much of its focus. Characters act without clear motivation, and the only driving force is to find Lightning. Without question, it's a better game, but Final Fantasy XIII-2 makes costly sacrifices to its narrative in order to achieve mechanical advancements. Final Fantasy XIII-2 Video Review Much like Final Fantasy X-2, this sequel approaches storytelling with a lighter heart. It still leaves plenty of room to get serious, but much of this emotional weight bears down towards the finale. In the beginning, Lightning somehow finds herself guarding the throne of Valhalla, a realm of chaos unbound by time. She fights a dark-haired man named Caius and -- in the midst of battle -- meets a stranger from a future age named Noel. She tasks Noel with traveling through time to find her sister and bring her to Valhalla, as Lightning can't leave the realm unguarded. You acquire full control of Serah, Noel, and the systems that power them an hour or two after the opening sequence; a stark contrast to the slow build of the original. As soon as the two heroes leap into the flow of time, Final Fantasy XIII-2's open nature shines through. Environments no longer follow a single path. With webs of rooms to explore and treasure chests hidden off the map, Final Fantasy XIII-2 encourages you to take your time and look around. You can access these environments, which dot the timeline, in more than one order. While a general flow from one place to another moves the plot along, the freedom to sidetrack greatly enhances the explorative flavor. More impressively, you can unlock the ability to close time gates and start the area from scratch, correcting mistakes or just trying something new. This functions as a literal ~reset button~ mid-game. This sense of freedom, even if you choose to ignore it, helps Final Fantasy XIII-2 feel more like a traditional RPG where discovery dominates the experience. Train monsters to fight by your side. At each new turn, battles separate Noel from bringing Serah back to Lightning. These battles share plenty of systems with the original, but Final Fantasy XIII-2 includes several crucial improvements, both large and small. One of the bigger changes: Serah and Noel are the only playable human characters in the game with the third party slot ready for a monster ally. Defeat a wild critter and you have a chance to tame it. Each critter has an inherent role in battle and a few special skills. Furthermore, each monster can level up along with the human heroes by consuming items. Final Fantasy XIII-2 Wiki GuideSide Quests GuideFragment LocationsFF XIII-2 WalkthroughThe Characters Collecting monsters has a special charm, as a little-known franchise called ~Pokemon~ can attest to. This system gives you even more things to track down, tweak, and make your own. Also, there's a ~cool factor~ to having a Chocobo fighting at your side. Considering this, along with the many side quests and secret endings, you have much more content to enjoy. The battle system also benefits from less obvious, but just as important, alterations. The action gauge returns with role-specific abilities that consume segments of that gauge. But Paradigm Shifts, the act of changing roles mid-fight, have been injected with adrenaline. Shifts happen so quickly the overall pace of battle feels much faster. Lastly, auto-battle returns and selects smart choices based on the information you've collected on your enemies. The prevalence of auto-battle and the general effectiveness of your AI companions make most battles in Final Fantasy XIII-2 a walk down Easy Street. This has its benefits. In one way, it speeds battles up and eliminates much of the hassle from traditional turn-based affairs. Yet it also takes away the more intimate challenge of those same systems. Even though these automated, smart systems speed things along, they fail to deliver the same sense of satisfaction as the ~old days~ when each command required ample thought and manual input. Chocobos: the only way to ride. All these mechanics represent a fraction of the minutia powering Final Fantasy XIII-2. Other components, including a more streamlined, choice-driven level-up system, also demonstrate how the developers at Square-Enix have enhanced this sequel. Plenty of surprises also delight, including a vocal-heavy soundtrack with a shocking degree of variety from tune to tune. With all the raw ~good~ here and a marked celebration of the non-linear, Final Fantasy XIII-2 loses focus when it comes to its story. In fact, you can safely say there's little story at all besides the singular motivation to find Lightning (and resolve paradoxes along the way). Even after witnessing the touching throes of its finale, Final Fantasy XIII-2 could have used more narrative punch. This lack of substance cuts deep into the end result. In fact, the ending of the game offers no resolution whatsoever. For a franchise known for telling incredible stories, this disappointing conclusion hurts worst of all. CLOSING COMMENTS Final Fantasy XIII-2 proves itself the better game, but it lacks the same focused storytelling employed in the original. It benefits from an improved battle system, open environments, and an overall level of polish that deserves a nod of respect. Despite its severe lack of closure, Final Fantasy XIII-2 still deserves your time, especially for a few poignant moments set at the end of days. Square-Enix provided the author with retail copies of Final Fantasy XIII-2 for review purposes. The author completed the main story on normal difficulty in approximately 35 hours using the PS3 version. Brief testing was also conducted on the 360 version. IGN RATINGS FOR FINAL FANTASY XIII-2 (X360) Rating Description out of 10 Click here for ratings guide 7.0 Presentation Extreme polish in almost all user systems. Organized menus, clear tutorials, and a fun sense of humor. Story only reaches emotional clarity at the conclusion and offers no closure. 8.5 Graphics Eye-catching characters and colorful worlds. Not quite as impressive as when the original launched in 2010, but still full of personality and an ample usage of pink and purple. 9.0 Sound Excellent voice work from the actors behind Serah and Noel, with solid performances from the rest of the supporting cast. A great soundtrack with more vocals than most Final Fantasy games to date. 8.0 Gameplay Fast battles supported by a fun monster collection system. Still fairly easy for the JRPG experienced, though the new focus on exploration lends much to the package. 9.0 Lasting Appeal Tremendous post-game content, considering you can beat the main quest with about 40 of the 160 collectible memory fragments. Easy to return to the world and continue fighting after the credits roll. 8.0 OVERALL Great (out of 10) Final Fantasy XIII-2 proves itself the better game, but it lacks the same focused storytelling employed in the original. It benefits from an improved battle system, open environments, and an overall level of polish that deserves a nod of respect. Despite its severe lack of closure, Final Fantasy XIII-2 still deserves your time, especially for a few poignant moments set at the end of days.", "date": "Jan. 27, 2012,"}