{"name": "quarrel", "name_review": "Quarrel Review", "ref": "https://me.ign.com/en/quarrel/57013/review/quarrel-review", "text": "Repeatedly rearranging letters into anagrams is the mental equivalent of hot yoga. Quarrel is equal parts exhausting and rewarding, and its test of skill doesn't stop with the breadth of your vocabulary. It challenges players not only to outwit each other with words, but to do it within the confines they set for themselves, all the while proving their mental capacity for strategic warfare. Quarrel is half Scrabble, half Risk, and the combination is bliss. Whether you win or lose, the brain strain will entertain -- for a little while, anyway. More Quarrel Videos As in the classic board game Risk, Quarrel players take turns attacking each other to acquire chunks of land. Squadrons of up to eight adorable soldiers occupy each space and then set out to take over enemy territory. Rather than rely on lucky die rolls, battles play out in a competitive Scrabble-esque duel. The attacker and defender are given the same eight letters of various point values. Whoever punches in the word worth the most wins the space. The catch is that you can only make a word as long as the number of goofy ninja or Scotsman pieces on your respective space. This is where the complexity of Quarrel's unexpected strategy comes into play and competition gets heated. An attacker with seven men may lose to a defender with four, for instance, because the defender has a sharper eye for a high-scoring word. Access to additional letters doesn't necessarily mean throwing a better word at your opponent before the ticking timer hits zero, so everyone is always at risk. Better still, fast fingers determines who wins in a draw. There's a sense of pressure weighing over everyone all the time. Quarrel builds a lot of tension that tends to release to raucous laughter. One-on-one matches are where Quarrel is at its best. The intimacy of a head-on challenge was far preferable to the bigger four-player matches. See, in combining the best bits of both Scrabble and Risk, Quarrel inadvertently invites some of each game's most aggravating qualities. Like any delicious dog food, it's PREMIXED! There's a dissatisfaction in having direct control over your failure -- sometimes you simply don't have enough soldiers to use the letters you'd like because you've spread your army too thin, or your brain taps when you should have scored big with a five-dollar word. That's the inherent nature of wordsmithing, and it's a struggle every writer, reader, and word nerd is all too familiar with. That makes the discovery and success all the more satisfying. Territorial takeover has a similar sense of cathartic release clashing with intolerable impatience. Dominating the board indicates you're on the fast track to success, with more reinforcements on the way at the end of each turn. Unfortunately, the even nature of Quarrel's setup also means prolonged back-and-forth battles between players ceaselessly chasing each other's tails. Four-player matches can last anywhere from 20 lengthy minutes to an interminable hour or more. This isn't a game designed for the inevitable extended play these map bring about, which is best indicated by the option to end a match at any point if both players agree. (With one more word, it's winner-take-all -- with bonuses based on current board domination, of course.) Even the language obsessed will find themselves struggling to stick with Quarrel if they're on the losing end of a long match. Even winning is draining if it isn't in quick bursts. Simplicity is one of Quarrel's strong suits, which unfortunately doesn't lend itself well to extended play. Futilely rearranging letters to an uncertain end will drive some players absolutely mad. As will some of Quarrel's more peculiar flaws. The A.I. always seemed to win on a draw regardless of lightning-quick letter crunching (if you have a chatpad or USB keyboard, you'll be even quicker than most). The absolute worst problem was the selection of restricted words. Not giving points for profanity is understandable, but ~foe~ is a word, Quarrel, no matter what you say. You're not foolin' anyone with bizarre limitations like this, you're just going to make certain folks flustered. Given how well you cater to linguists, this is a real shame. CLOSING COMMENTS Good thing Quarrel has custom match settings; tuning how (and how long) you play is the best way to experience this entertaining puzzle competition. Its strategy is just complex enough to demand some skill, and breaking down words is right up every word nerd's alley. Quarrel is flawed, but selective players who know what they want will find themselves enraptured by a siren song written in eight-letter words. IGN RATINGS FOR THE QUARREL (X360) Rating Description out of 10 Click here for ratings guide 7.0 OVERALL Good (out of 10) Good thing Quarrel has custom match settings; tuning how (and how long) you play is the best way to experience this entertaining puzzle competition. Its strategy is just complex enough to demand some skill, and breaking down words is right up every word nerd's alley. Quarrel is flawed, but selective players who know what they want will find themselves enraptured by a siren song written in eight-letter words.", "date": "Jan. 25, 2012,"}