{"name": "Your Shape: Fitness Evolved 2012", "name_review": "Your Shape: Fitness Evolved 2012 Review", "ref": "https://me.ign.com/en/your-shape-fitness-evolved-2012/57016/review/your-shape-fitness-evolved-2012-review", "text": "Your Shape: Fitness Evolved 2012 is not a game. It's an interactive fitness product that utilizes the Kinect sensor (sold separately) in combination with the Xbox 360 to track your movements while you work out. It's a fancy idea, but if you're looking for that ~magic bullet~ to get in great shape it won't do that for you on its own. Your Shape 2012 is largely focused on creating a personal training experience for you, or providing those potentially embarrassing classes in the privacy of your own living room. In this sweet spot, as a Kinect-powered product, it delivers. Where it has room to evolve is in the realm of variety, quality personal feedback, and improvements to its ability to ~see you.~ Your Shape 2012 Launch Trailer A bit of warning: like many Kinect games, you need about a 10-by-10 foot square (3-by-3 meters) to work out. If you've got that space, great. I am on the other side of the spectrum. I have to push the couch back and roll up the carpet. Hard flooring plus a gym mat is ultimately best, but with the right shoes carpet works as well. Just keep in mind you'll be imaginarily speed skating side-to-side, or potentially dropping some small dumbbells at your feet. The point is that Your Shape is trying to bring a piece of the gym into your home. Be prepared. If you're just looking to burn some calories and distract yourself with a game, something like Dance Central 2 or Kinect Sports: Season 2 are more playful and worth considering as alternatives. That said, Fitness Evolved 2012 is really the primary game for Kinect that offers something aimed at replacing the gym. Now, I'd argue that you can't really replace a fully-stocked gym environment or the value of personal training (seriously, take a few and learn good form); but, I'd also argue that anyone can get low-impact, calorie-frying workouts without ever leaving the house. Many just need some motivation and some basic instruction. Your Shape provides these basics and does it well. By using the power of Kinect, it actually is able to give you light -- and I stress that word -- correctional advice to improve your form. ~Head up.~ ~Try to get lower.~ ~Lift your knees higher.~ More on how effective this personal training is in a moment. Your Shape 2012 offers up a good mix of exercise routines. First, let's talk about the variety of content. If you're familiar with 2011's debut Kinect version, don't expect an all-new experience. It ultimately feels like the version it should have been in the first place, with a few crucial improvements and additions. It offers up warm-up games, running, training, dancing, and some yoga/Zen. It's a nice balance, it just leaves you wanting more. The bulk of it is still rooted in the training, which focuses on muscle toning and building. There's a simple quiz that helps recommend the best training sessions for you, but ultimately you're just choosing from one big menu. Simple icons earmark the recommend routines. It's a trade-off: you don't get truly personalized workouts like you would with a trainer, but you also don't get stuck with routines that include things you don't want. So you can quickly choose your flavor: legs, glutes, abs, chest, etc. Exercises include lunges, sit-ups, push-ups, arm raises and more. There's a full body workout in here, which is great. I just wish you had more control to design your own routines on a per-exercise basis. But it's clear Your Shape 2012 is more for those who don't have a ton of fitness experience and just want to spend, say, eight or 15 minutes improving their derriere without thinking too much. The ability to set up your own routines is sorely missed here. This brings us to one of the largest improvements over last year's edition: floor moves. It's relatively unthinkable to exclude sit-ups, push-ups or planks in a workout, so I'm glad to see these added in. However, due to the way Kinect must analyze your full form -- from the side -- it will have you twisting your head sideways towards the screen, trying to get a look at how you're doing in terms of form, speed, and success. You can take a peek, but what you're supposed to do is listen to the audible ~dings~ and voice instruction to follow along. It doesn't really explain this to you, though, which is frustrating and even a bit dangerous. It would help if this was made more clear, and perhaps there were replays to encourage you to review your work after, not during. I've seen complaints condemning the floor workouts because of how this feels, but the truth is it's crucial thatUbisoft added them in. At the gym, you'd have to look in the mirror the same awkward way, and you shouldn't really have your head up then either. Unfortunately, it's something you'll have to get used to. It's just not clear or intuitive, and it needs to be. 12", "date": "Jan. 24, 2012,"}