{"name": "Super Crate Box", "name_review": "Super Crate Box Review", "ref": "https://me.ign.com/en/super-crate-box-140030/57014/review/super-crate-box-review", "text": "What is it? Super Crate Box started life on the PC as an attempt to bring back ~the glory of the golden arcade age.~ The action takes place on a single non-scrolling screen, and the premise is simple: collect as many crates as you can! All enemies deal out instant death when touched, keeping the action tense. Every time players nab a crate, another pops up in a new random location on the board, meaning gamers are always scrambling above, below, and around enemies in their crate-ly pursuit. The genius in Super Crate box is that each crate also equips players with a new weapon. The end result is a frenzied and frenetic 2D arena shooter. One moment you're armed with a rocket launcher. Then a machine gun. flamethrower katana grenade launcher... the list goes on. Your only ~score~ is how many crates you collect, so there is no incentive (or ability) to hold onto more effective weapons. Every round is a wild menagerie of weapon swapping and enemy dodging. Did we like it? Unfortunately, Super Crate Box's on-screen virtual buttons simply don't work well. Other games get away with virtual D-Pads and jump buttons thanks to frequent checkpoints, or generous health bars. But in here, one mistake ends your round. It's almost impossible to stick with Super Crate Box after nearly setting a high score, only to fail due to a millimeter of imprecise tapping causing an unexpected jump. After this happens a few times gamers may not want to come back. iCade owners can wholly avoid these control problems, making Super Crate Box hours of frantic fun. But unfortunately most gamers are stuck with their thumbs and touch screen. Should you buy it? Vlambeer packed a surprising amount of value into such a simple premise. The three stages all feel genuinely unique, as do all three modes of play. The game also has a smart unlockable structure, with some bonuses unlocked for earning specific high scores, and others more generously awarded for reaching cumulative crate collection totals. Ultimately, if you're not the type of gamer to rage quit in disgust when a promising run is ended through no fault of your own, Super Crate Box makes a very fun $1.99 diversion. CLOSING COMMENTS Super Crate Box is not without its merits, and when experienced in an iCade with physical buttons the experience is sublime. Unfortunately, standard iOS play only frustrates. Virtual buttons do not mix well with high score tables and instant deaths. IGN RATINGS FOR THE SUPER CRATE BOX (IPHONE) Rating Description out of 10 Click here for ratings guide 6.5 OVERALL Okay (out of 10) Super Crate Box is not without its merits, and when experienced in an iCade with physical buttons the experience is sublime. Unfortunately, standard iOS play only frustrates. Virtual buttons do not mix well with high score tables and instant deaths.", "date": "Jan. 24, 2012,"}