{"name": "Q.U.B.E.", "name_review": "Q.U.B.E. Review", "ref": "https://me.ign.com/en/q-u-b-e/57058/review/qube-review", "text": "Not so long ago, one of the other editors at IGN, a certain Anthony Gallegos, wrote about the tendency that games have to copy other games. He argued, and I mostly agree with him, that taking elements of other games and appropriating them or giving them a unique twist can result in an awesome new experience. Without Minecraft and its predecessors, there would be no Terraria. Without Wolfenstein 3D, there'd be no Call of Duty. And I'm pretty sure that without Pong, there'd be no ball-sports. But there is a fine line between appropriating and emulating which is perhaps indistinguishable until you cross it. Q.U.B.E. is a game that has wandered across that line. Q.U.B.E is a first-person-puzzle game in which players navigate a series of rooms by altering certain blocks. Red blocks can be extended in length up to three times, yellow blocks, always found in triplets, can make a tiered stairway, and blue blocks can act as springboards. Purple blocks can be used to rotate entire portions of a room, and green blocks can be affected by the physics of other blocks. In addition, there are some puzzles involving magnets and illumination, and several puzzles require you to dye spheres or beams of light a certain color to activate a switch. More Q.U.B.E. Gameplay From the moment Q.U.B.E. opens, it's hard not to draw immediate comparisons to Portal. You awake in a sterile white environment with only some fancy looking gloves and a single path to take. The flat, white surfaces are made up of cubes, and are so strongly reminiscent of the Aperture Enrichment Center that it can be a little distracting. And as hints of the game's story begin to surface, the comparisons only become stronger. There's not much to go off as far as story is concerned either. No dialogue or text or other characters appear throughout Q.U.B.E. In the latter third of the game, the sterile testing-facility demeanor begins to peel away, and there are hints of a more malevolent force at work, but the hints never develop into anything. Portal was a really solid game, but much of its appeal came from psychotic and comedic A.I. GLaDOS. Without her, Portal would be a lonely and at times frustrating experience. Which is exactly what Q.U.B.E. is. Despite many clever puzzles, there's only so much tension you can make when there's no risk of death or failure, or a clear goal to work towards. With no other characters, there's nothing to guide you through the chambers or encourage you when you're doing well. Q.U.B.E. does at least fully commit to its style. Later sequences contain vertigo-inducing walls of undulating blocks, and despite the derivative style, the visual effect of each chamber is quite striking. One part where the environment is pitch black provides Q.U.B.E.'s most interesting visuals, but feels like a gimmick to slow down puzzles you've solved earlier. More Q.U.B.E. Gameplay Most of the puzzles are fun, but those that require the magnet mechanic tend to frustrate more than challenge. The issue is that, when you're dealing with blocks, all the puzzles are basically grid-based. But the physics that guide their movement aren't, so often times the blocks will get twisted or caught on the corner of an object and be pushed out of alignment. Maneuvering multiple cubes, such as the infuriating magnet puzzle towards the end of Sector 6, often feels like it's down to blind luck. The inability to stop and start the magnet buttons quickly, or use them while keeping the blocks you're meant to be moving within your line of sight, only makes things worse. Finally, where Portal gave you the opportunity to use all the mechanics you've learned in a more freeform setting, Q.U.B.E.'s attempts to emulate this don't provide enough freedom. You're still in the sterile facility, and you've still only got maybe four or five options to play with. Then it just kind ofends. While a ~twist~ comes out of nowhere, and the entire sequence is well-built and genuinely exhilarating, it doesn't really earn it with a good build up. There's no final encounter  there's no one to encounter  you just see where the game ends, walk over to it, and enjoy the ending sequence. CLOSING COMMENTS Q.U.B.E. offers some short-term fun for puzzle fans and not a lot else. With so little emphasis put on story I cant help but feel that Q.U.B.E. may have benefitted from having no story elements at all, instead of loosely hinting at some bigger picture that goes unseen. A few sloppy physics-based puzzles and a short-lasting gimmick put a small dent in the enjoyment of many other block-puzzles, but a consistent and striking visual style keeps things interesting. But, as much as it wishes otherwise, Q.U.B.E aint Portal, and its attempts to the contrary work against it. IGN RATINGS FOR Q.U.B.E. (PC) Rating Description out of 10 Click here for ratings guide 5.5 Presentation There's too little to the story to put anything together, but the ending is exhilarating nonetheless. 8.5 Graphics The visuals are simple but effective, if a little derivative, and the darker sequences are very striking. 7.0 Sound The synth soundtrack is soothing. Ambient noises occasionally stop suddenly. 6.5 Gameplay Some strong and clever puzzles are broken up by gimmicks and frustrating magnet stages. 5.0 Lasting Appeal You might get a solid five hours out of Q.U.B.E., but that's about it. There's no reason to play twice. 6.5 OVERALL Okay (out of 10) Q.U.B.E. offers some short-term fun for puzzle fans and not a lot else. With so little emphasis put on story I cant help but feel that Q.U.B.E. may have benefitted from having no story elements at all, instead of loosely hinting at some bigger picture that goes unseen. A few sloppy physics-based puzzles and a short-lasting gimmick put a small dent in the enjoyment of many other block-puzzles, but a consistent and striking visual style keeps things interesting. But, as much as it wishes otherwise, Q.U.B.E aint Portal, and its attempts to the contrary work against it.", "date": "Jan. 10, 2012,"}