{"name": "Samurai Sword Destiny", "name_review": "Samurai Sword Destiny Review", "ref": "https://me.ign.com/en/samurai-sword-destiny/57073/review/samurai-sword-destiny-review", "text": "Two and a half years ago, Nintendo's Wii was blessed by the release of Muramasa: The Demon Blade. It was a stylish, gorgeous, absolutely beautiful 2D spectacle to behold that told a tale of swords and samurai in a side-scrolling action/RPG framework. One of the Wii's finest games, no doubt. Samurai Sword Destiny is trying to be Muramasa. Someone on this game's development team must have played and loved that Wii game and wanted to craft an homage -- and visually, they've kind of succeeded. This new 3DS download doesn't present the extreme level of detail that Muramasa held in its art, but the overall aesthetic is in the same vein here. Playing this, you can imagine what Muramasa itself would be like if it actually had a 3DS version. What's more, Samurai Sword Destiny pulls off the difficult trick of giving interesting stereoscopic depth to 2D game elements. Akane the vengeful swordswoman and her foes are all strictly flat and stuck moving only to the left and right across the screen, but the 3D effect surrounding them breathes life into the action. It's a look that makes me hopeful for Nintendo's upcoming Paper Mario 3DSsequel. Moving beyond the visuals, though, this Sword begins to get duller. Akane's quest to save her missing brother is broken down into two types of gameplay, neither of which is all that deep or interesting. The first style of play is seen in the game's fighting sequences, where Akane wields her sword against onslaughts of look-alike monks and ninja warriors trying to strike her down. Battling these baddies is a bit like playing an old-school brawler (complete with a flashing ~Go!~ arrow telling you when to move on), but it's just too repetitive to be much fun. You'll dash across the screen with a running slash, turn around, dash the other way . . . rinse and repeat. The second type of stage is a bit more compelling, as it features a kind of fast-reaction auto-run design -- kind of like WiiWare'sBit.Trip Runner. Akane takes off at a constant sprint to avoid an ambush, and you've got to swing her sword with proper timing to deflect incoming arrows, dodge out of the way of falling boulders and slice through enemy archers all on the run. These sequences fall short too, though, in the fact that they don't take advantage of the game's last design element: upgrades. You earn gold for successful kills in Samurai Sword Destiny, and that gold can be used between levels to purchase extra powers and enhancements for Akane. You can buy increased agility, or more complex sword combos, or even the ability to regenerate your HP when you're standing still (very useful). These upgrades, though, only really impact one half of the game -- the fighting stages. The auto-run levels don't see their benefit, and there aren't any upgrades specifically tailored toward making them any easier. (And you obviously can't stand still to trigger that health regeneration.) CLOSING COMMENTS So, in the end, Samurai Sword Destiny is an OK play and visually accomplished, but the only thing it really does a great job of is making me dream of other games. It's got me drooling over the idea of a Muramasa 3DS port, excited to see the depth applied to Paper Mario's flattened characters later this year and wondering what progress is being made on the Bit.Trip Runner sequel. Invest in this if you like the look and have some cash to spare, otherwise hold on to your funds until the eShop's next samurai gamearrives. IGN RATINGS FOR THE SAMURAI SWORD DESTINY (3DS) Rating Description out of 10 Click here for ratings guide 6.0 OVERALL Okay (out of 10) So, in the end, Samurai Sword Destiny is an OK play and visually accomplished, but the only thing it really does a great job of is making me dream of other games. It's got me drooling over the idea of a Muramasa 3DS port, excited to see the depth applied to Paper Mario's flattened characters later this year and wondering what progress is being made on the Bit.Trip Runner sequel. Invest in this if you like the look and have some cash to spare, otherwise hold on to your funds until the eShop's next samurai game arrives.", "date": "Jan. 5, 2012,"}