{"name": "Slingo Supreme", "name_review": "Slingo Supreme Review", "ref": "https://me.ign.com/en/slingo-supreme/57101/review/slingo-supreme-review", "text": "The final DSiWare release of 2011 is a new version of a game design that's been around since about 1995. ~Slingo~ came about as one of the Internet's first casual-play browser games way back in that age of dial-up access and 14.4 modems, combining the random chance of a slot machine with the five-by-five number grid of bingo. That slots/bingo fusion is still fueling Slingo today -- and this latest edition adds in some Supreme extras. The game is largely luck-based, as slot machines are. You start with a grid of 25 spaces and you tap the touch screen to spin up a set of five digits for yourself. You then tap the numbers that match to start filling in the grid -- so if you've got a ~19~ in the second column and another 19 appears after a spin, that's a match. Making five matches to fill up a full row, column or diagonal line on the grid earns you extra points, and your goal is to try to score as many points as possible in just 20 spins. The Supreme part comes in with some fancy power-ups and other bells and whistles that show up at random during those 20 spins -- you might earn an extra spin for free, or get a point multiplier, or even have to step away from the slot machine for a moment to play a Rock/Paper/Scissors mini-game against The Devil himself. (Cue ominous music.) All of these tacked-on extras add some spice and variety, but ultimately you realize that you're pretty mindlessly just tapping away at the screen over and over again with a design that demands very little thought and strategy. That kind of casual time-wasting is perfectly fine when played for free in an Internet browser window, but I have a hard time recommending that anyone actually pay for such an experience -- especially at the steep price of eight dollars. CLOSING COMMENTS Slingo Supreme is still OK, but I'd suggest that anyone who's dead-set on playing Slingo on their DSi or 3DS check out last Spring'sSlingo Quest instead. You'll have to dig to find it, but it's on sale in the eShop for the same price -- and it at least offers some sense of structure and advancement as you play. IGN RATINGS FOR THE SLINGO SUPREME (DSI) Rating Description out of 10 Click here for ratings guide 6.0 OVERALL Okay (out of 10) Slingo Supreme is still OK, but I'd suggest that anyone who's dead-set on playing Slingo on their DSi or 3DS check out last Spring's Slingo Quest instead. You'll have to dig to find it, but it's on sale in the eShop for the same price -- and it at least offers some sense of structure and advancement as you play.", "date": "Jan. 2, 2012,"}