{"name": "Danganronpa 3", "name_review": "Danganronpa V3 Review", "ref": "https://me.ign.com/en/danganronpa-3/137955/review/danganronpa-v3-review", "text": "Danganronpa is a series that doesnt look like much on the surface, but once you start playing, its easy to get sucked into the weird character drama and the lengthy, winding twists and turns of their despair-inducing adventures. The newest installment, Danganronpa V3, doesnt change too much from the previous two: its still an anime and pop-art-fueled hybrid of adventure game, murder mystery, and courtroom drama. But sometimes, more of the same is a good thing  especially when its done this well. For the third time, a fresh batch of uniquely gifted students have been trapped in a prison-like high school by bloodthirsty bear mascot Monokuma (this time with his equally evil cubs) and forced to participate in a killing game to murder each other. Danganronpa V3's gameplay is split into three parts: daily school life, investigations, and class trials. The relatively quiet gameplay, classmate interactions, and exploration of daily life makes an effective story contrast with the murderous horrors and grisly investigations that follow it, though first-person wandering in the samey-looking school halls, even with new areas opening each chapter, got really old, really fast. The highlights that make it worthwhile are the story development and the free time sequences in which you can have conversations with and grow closer to particular classmates. Not only is it a real delight to learn more about these deep characters, but you can also earn rewards (like special perks during Class Trials) for doing so. You can sometimes spin trials in a completely different direction by lying.Class trials are where things get spicy: timing-based minigames, quick-thinking logic puzzles, and even spins on racing games and Minesweeper simulate the high-stakes emotional tension of arguing in a distinctive way. These minigames are short but also woefully uneven, with some considerably more enjoyable than others. Mind Mine, in particular, is pretty weak, but the rhythm-based game to disarm a character (a metaphor that shows you battling shadows to break down defenses) that wraps up every trial is plenty of fun. You can also make false statements to shoot down certain arguments, though the penalty for missing with a lie is so severe that you wont want to risk it unless its absolutely necessary, which takes some of the fun out of it. Making this worse is the lack of hints, and that you can sometimes spin trials in a completely different direction than normal by lying at opportune times. The most appealing part of Danganronpa V3, however, is its wonderfully weird cast. Everyone in the prison-like school has a unique personality: the speech-impaired but lovable hulk Gonta, with his deep-rooted love of insects and desire to be a gentleman to help everyone, makes a memorable impression, as does the far less-lovable manipulator and all-around thorn in the side, Kokichi. Some characters start off with one-note personalities, like man-hating martial artist Tenko and cold childcare-giver Maki, but theyre affected by events in ways that allow them to grow in ways that are satisfying to watch. The emotional highs and lows hinge on you forming a connection with these characters, and this delightful rogues gallery of over-talented wackos gives you plenty of personalities to love and hate. That makes the gut-punch when one of the characters youve grown to love turns up dead  or, worse, turns out to be a killer  even more impactful. Danganronpa V3 cant survive on characters alone, however  the story has to give us good reasons to care about them. Fortunately, it delivers those from start to finish. Plot twists come on strong from the get-go here, so be prepared for some jaw-dropping revelations and unexpected Wow, they actually went there! surprises from very early on. While there are a few lulls in the story, the quiet times are used to good effect, giving us closer looks at characters and their actions, cooling down after a major event, and letting us reflect on things that have already happened. Perhaps the biggest complaint is that some of the trials arent as interesting as others: chapter four, in particular, is a bit dull until it nears its climax, but it redeems itself with an unforgettable ending. And by the time the sixth and final chapter wraps up after more than 35 hours  well, no spoilers, but lets just say the endings going to have a lot of people talking! Ultimately, Danganronpa V3 doesnt add too much new to the series. But thats okay  it doesnt need to reinvent the wheel when the wheel we already have still rolls out eclectic characters and shocking moments so reliably. Its a great rollercoaster of hope and despair with a climax that made me sit back and think about everything that just happened. The road to the end of Danganronpa V3 is long and twisted, but the ride is well worth it.", "date": "Sept. 23, 2017"}