{"name": "Resistance 3 (Doomsday Edition)", "name_review": "Resistance 3 Review", "ref": "https://me.ign.com/en/resistance-3/57078/review/resistance-3-review", "text": "Perhaps more than any other shooter series this console generation, Insomniac's PS3-exclusive Resistance games have best captured the desperation of war. The series has never been about jingoistic glorification of patriotism. It's never really been interested in pumping you up for a battle. This war has always been about the fate of the entire world and the brave men and women that will stop at nothing to try and save it. Most shooters overlook the human element of the story but Resistance puts these characters front and center. There is something deeply moving about a game where that kind of responsibility is in the main character's hands. This is particularly true of the latest entry in the series, Resistance 3. War is horrifying in any context but it's particularly bleak here; it's safe to say that things are looking pretty dire for the human race when the third game kicks off. It's been four years since the events of Resistance 2 and the once thriving human war effort has dwindled down to almost nothing, with pockets of humanity still struggling to fend off the Chimera. This alien menace has begun terraforming the planet to be more like their icy homeworld and, with the appearance of an ominous worm-hole opening up in the skies over New York City, it's starting to look like Earth is well and truly lost. IGN's Resistance 3 video review. Enter Joseph Capelli. He's a family man living in Haven, Oklahoma, who is propositioned by series stalwart Dr. Malikov to escort him to New York in a last-ditch effort to close the worm-hole before it's too late. Capelli doesn't want to leave his wife and infant son and at first refuses Dr. Malikov's request, but eventually changes his mind when he realizes this may be the only shot his son has at living a normal life. It's a surprisingly touching moment when Capelli is forced to say goodbye to his loved ones and, as he clings to his son's little mitten for the rest of the campaign, you really do feel his sadness. Right off the bat, Resistance 3 controls wonderfully. There's a quick and powerful feel to the guns; each one is sharp and accurate and packs a hell of a wallop. The shooting mechanics are tight and responsive, ensuring you're equipped to deal with the many moments you'll be outnumbered by dozens-upon-dozens of feral Chimera, just itching to rip you apart. And yes, this happens a lot. ~When you squish upon a guard...~ Move functionality has also been included for Resistance 3, though this control method isn't quite as finely tuned. Firing from the hip is effective but the noticeable lag between your motions and the actions on screen make aiming down the crosshairs incredibly sluggish, even with the sensitivity all the way up. It just doesn't cut it in the heat of an intense battle where you'll want every advantage you can get. Luckily, you're never without an arsenal of awesome weapons and, in keeping with the high standard set by the previous games, Resistance 3's guns give you free rein to kill creatively. Old favorites like the Auger and Bullseye are back, only now each weapon automatically levels up the more you use it, unlocking upgrades like incendiary ammo on the fly. There are also a few new weapons, such as the 'Mutator', which causes enemies to rapidly grow boils that swell up and explode. You can even get your hands on the Chimera's own 'Deadeye' sniper rifle. Every kill in Resistance 3 is exceedingly satisfying - not only because of the first class arsenal and tight controls, but also because each time you take a Chimera down, it lets out an explosive death growl that tells you it's expired. The train authorities get quite tough on fare-evaders in the future. In terms of tone, Insomniac has really amped up the gut-wrenching terror for Resistance 3. This is the darkest and most violent game in the series, and almost the entire second act of the game will have you on the edge of your seat. The Chimera are meaner than ever here. One particular scene shows a screaming man having his head ripped-off by one of the ruthless alien invaders, upping the ante when it comes to gore in the franchise. Creepy environments like mines, caves, sewers and even a prison are also not for the faint-hearted. It's a spine-chilling experience, and if you play this game alone at night, you'll likely go from explosive growls to explosive bowels. 12", "date": "Sept. 5, 2011,"}