{"name": "bastion", "name_review": "Bastion Review", "ref": "https://me.ign.com/en/bastion/57092/review/bastion-review", "text": "Bastion is one of the best downloadable games this year, but I didn't believe it right away. From the first time I saw it, I knew that the game was witty -- as evident from the narrator who literally narrates just about everything you do as you do it -- but Bastion was still just an action role-playing game. I moved through an area with my two weapons, shield, and special attack. No big deal. However, then Bastion started revealing itself to me, and I couldn't stop playing. Bastion Video Review In Bastion, something called the ~Great Calamity~ has rolled in and taken out your entire civilization. You awaken as ~the Kid,~ and set off to restore the Bastion -- a spot where everyone was supposed to meet if bad stuff went down. To do this, you'll need to dive into levels, best foes, and collect shards. Like I said, not that different from your average RPG, and it never hooked me. By the time it reached the branching ending, I didn't have strong enough feelings to really care one way or another about the outcome. Still -- and this is the rare occasion I say this about a story -- it didn't matter. Bastion is just too damn good. The graphics are amazing; I can only describe the scenes as a watercolor painting with stained glass influences. The sound immersed me in the game. The narrator is entertaining as he announced what I was doing and why it mattered, but his sultry tones also kept me company. Bastion's a single-player game, but the narrator was my companion through thick and thin. Toss in some fantastic music and sound effects, and Bastion is a blast to experience. However, those are just the accoutrements. Bastion's gameplay is the main event. I hacked and slashed my way through these levels, but I got to choose my loadouts before I set out. As I played, I unlocked new weapons like a six shooter and a machete, I found new elixirs that increased the damage of my attacks, and I even unlocked idols that made levels tougher -- made enemies unable to be beaten by normal attacks but that gave me greater rewards. All of this made me want to keep playing -- and play in different ways. Was my loadout the best? How hard could I make a level and still have it be fun? What loot would the next seemingly dead end yield? I loved coming back to answer these questions. Get'em, kid. These variations on the gameplay, these carrots at the end of the stick only become available the deeper you get. As I was playing, I was unlocking a new twist to my hub world (the Bastion) with each level my character achieved. I had an in-game achievement center that rewarded me with XP for completing tasks, a store, a crazy pipe to hit and fall into an XP farm, and so on. Hell, even after I beat the game, there was a new game plus that kept my progress, started over, and made reference to the fact that I was playing through the story again. The best thing Bastion has going for it is that I was always surprised by what came next. The levels, the enemies, the crazy weapon-testing mini-games -- there's always something up this game's sleeve. CLOSING COMMENTS When I beat Bastion for the first time, I reloaded my save and played through for the second ending. When that was done, I started my new game plus. I'm not the repeat type of gamer, but Bastion's leveling, weapon upgrades, and difficulty tweaks are just too gosh-darn addictive. The story could've been better, but it doesn't matter. This game is amazing and you owe it to yourself to download it. IGN RATINGS FOR BASTION (X360) Rating Description out of 10 Click here for ratings guide 8.0 Presentation The story is traditional stuff, but I was wrapped up in the experience from the main menu to the credits thanks to leaderboards, easy to navigate menus, and more. 9.0 Graphics Just a beautiful world. The characters are detailed, the colors are rich, and the world forming underneath the kid's feet is a nice touch. 9.0 Sound The sound effects, the score, and the narrator are all excellent. 9.0 Gameplay The hack and slash gameplay is fun and amplified by leveling up your character, improving your weapons, and making the game harder through idols. There's so much to discover. 9.0 Lasting Appeal Finish the story, and there are weapon challenges to tackle and a new game plus mode to finish for the whole picture. 9.0 OVERALL Amazing (out of 10) When I beat Bastion for the first time, I reloaded my save and played through for the second ending. When that was done, I started my new game plus. I'm not the repeat type of gamer, but Bastion's leveling, weapon upgrades, and difficulty tweaks are just too gosh-darn addictive. The story could've been better, but it doesn't matter. This game is amazing and you owe it to yourself to download it.", "date": "July 19, 2011,"}