{"name": "Astria Ascending", "name_review": "Astria Ascending Review", "ref": "https://me.ign.com/en/astria-ascending/190075/review/astria-ascending-review", "text": "There is always something exciting about playing a brand new JRPG that isnt from one of the popular franchises we already know and love, mostly to see how it differentiates itself from the pack. But while Astria Ascendings turn-based combat is excellent, its mediocre story and weak quest design drag it down. It has plenty of amusing things going for it, but those shortcomings keep it from becoming the breakout JRPG it had the potential to be.Astria Ascending puts a side-scrolling twist on a more traditional, turn-based RPG shell. Youll explore its world of Orchanon as a 2D platformer, entering separate rooms, collecting treasures, and encountering enemies as you travel across the screen. But while its presentation is novel, its story setup is something weve seen several times before: you play as Ulan, the leader of the 333rd company of Demi-Gods trying to stop an uncompelling chaotic threat that wants to remove harmony from the world. Each of your party members has their own bigger motivation too, but in general, the story is just so cliche. Astria Ascendings world has a unique look and its races are freshly designed, but their differences are only skin deep. Because of this, the main cast suffers from bland dialogue and a lack of personality, making them uninteresting to spend dozens of hours with. And like so many other JRPG stories, their struggle is against yet another syndicate of generic villains that want to destroy the world for some weak, unconvincing reason. That isnt to say that this story structure never works, because it does have entertaining or heartfelt moments here and there. Many party members have family tied into the events in ways that could be compelling, but with how vague a lot of the plot points are left, those potential hooks were never actually able to grab my interest.Side quests do very little to make the world feel fleshed out.Unsurprisingly, completing your quest will mean venturing into a handful of puzzle-filled dungeons. Some of these require you to take advantage of basic elemental powers to solve them, like using wind to move boxes to their correct position. But most arent that engaging due to their simplicity. Dungeons are usually structured the same too: each has a boss known as an Astrae that you can summon in battle once youve defeated it, followed by another boss at the end, leaving them a little too predictable to make your way through.The repetition is shaken up a bit relatively deep into the story by a section where you shoot enemies in the sky like a side scrolling shooter, but its too little too late. You only ever see this twist between specific locations in the latter half of the story, and by that point youll already have progressed so far that its introduction feels random and disjointed.As you explore Orchanon, you will also find plenty of side quests, but these are similarly straightforward and uninspired, doing little to make the world feel fleshed out. Youll often be asked to defeat a certain number of enemies or find the quest giver a specific item, and little else. While none of them are very interesting, additional guild missions that task you with killing special enemies for money, experience, and skill points can be. Every enemy type has distinct abilities so fighting these minibosses adds even more variety to the creatures that you face, which is especially welcome when combat is the shining star here. Focus Your SkillsAstria Ascending really stands out in its battles and its art style. Every zone is drop dead gorgeous, especially in dungeons. Since its presented as a 2D platformer outside of fights, the world of Orchanon feels as if it was created in a story book  each of its characters drawn with tender love and care, and they especially shine in combat. Whether it be an attack, spell, buff, or status effect, everything is animated immaculately and with purpose.The combat itself is some of the best Ive seen in a traditional turn-based JRPG. This is due to the excellent Focus mechanic, which makes the party gain Focus Points when striking an enemys weakness. Focus can stack up, allowing you to deal an abundance of damage once it maxes out. But while youre collecting Focus, enemies can hit your weaknesses and do the exact same thing, raising the stakes the longer a fight goes on. Youll also have to be careful since using the wrong attack on an enemy will make you lose Focus, adding an extra layer of tension to each fight. Mix that exciting system with the art and animations and it truly makes combat an impressive package. Almost every encounter feels like a challenge that is satisfying to conquer too. An intuitive job system provides a wide variety of abilities to use, and planning your teams powers is where Astria Ascendings true puzzles lie. Members of your party begin with a starting job but will gain three more throughout the story, which provides them with a myriad of different skills to mix and match based on your personal preference and the weaknesses of the enemies you are facing. Unfortunately, Astria Ascending also comes with some horrendous difficulty spikes. This means youll occasionally need to spend a significant amount of time grinding to get past tough enemies. There is at least a difficulty option that can be lowered if youre not willing to deal with these annoying spikes  but on the normal difficulty, its not uncommon to spend multiple hours leveling just to get past one specific fight only to have to do it again for a different one not too far down the road. Astria Ascendings incredible battle and job systems are perfectly complemented by its gorgeous art and animations, but the rest of this JRPG doesnt shine nearly as bright. Its hindered significantly by a bland story, one-note cast, and brutal difficulty spikes throughout. That brings down its otherwise rewarding combat, and makes the journey feel like a chore rather than the exciting start of something new it could have been.", "date": "Oct. 2, 2021,"}