{"name": "Squid Game: Season 1", "name_review": "Squid Game: Season 1 Review", "ref": "https://me.ign.com/en/squid-game-season-1/190054/review/squid-game-season-1-review", "text": "Squid Game is now streaming on Netflix.Squid Game sounds like an homage to those strange underwater creatures that undulate below the sea. It's actually a compelling, candy-coated fever dream in which contestants play the innocent games from their childhood with one major change: if they lose, their lives are forfeit. It's a jarring, disturbing portrait of individuals eking out hard luck existences and struggling across Seoul, South Korea, and as much a tale of a dystopian hellscape of the mind as it is a horror series viewed through the lens of those scraping by.Seong Gi-hun (Lee Jung-jae) is an average guy who's in serious need of some cash, or a miracle. He's down on his luck, with a daughter he may never see again and an elderly mother who's still forced to take care of him as though he were a child. So when given the opportunity to play a series of children's games for an astronomical sum of money, Gi-hun can't refuse.Neither can nearly 500 other participants, all of whom have been voluntarily whisked away to the middle of nowhere, under surveillance by masked guards and clad in numbered T-shirts and sweatsuits. All are chasing the magical sum of money that could potentially make every single one of their problems disappear -- but at what cost?That all becomes apparent once the ~players~ realize even the simplest children's game in this prison-like compound could result in a swift, painful death. The childlike joy of ~Red Light, Green Light~ quickly devolves into a harrowing sight as those who move a single muscle during the ~red light~ are unceremoniously shot where they stand. It's haunting, of course, but perhaps even more terrifying is the idea that these people are willingly participating. The thought of returning to their old lives and facing their debts is so terrible that they'd rather risk imminent death. It's a concept that hangs heavy throughout the series' lean 9-episode run, especially as the story expands from Gi-hun's somewhat selfish existence and explores the others involved in the games.One of the series' greatest strengths is weaving a tangled web of character development that pays off with each new hour we watch. North Korean defector Kang Sae-byeok (Jung Ho-yeon) is tough as nails on the outside, but occasionally reveals a kinder, gentler side. Gi-hun's childhood friend Cho Sang-woo (Park Hae-soo) is an even more intriguing case, having stolen money from his clients, going so far as to put his mother's home and business on the line as collateral. And though we know all this, these players' truest intentions remain obfuscated time and time again. Thats part of what keeps us watching, after all. Squid Game moves at a breakneck pace, speeding from game to game.And its easy to become attached to these players, even though it's quickly established that you could be saying goodbye to them at any moment. Squid Game moves at a breakneck pace, speeding from game to game, keeping you at the edge of your seat as the body count climbs and the plot continues to thicken. And it isn't for the squeamish, as participants are shot right between the eyes without so much as flinching during competitions and bodies left to pile up until there are enough victors to pass through. Sometimes its not that characters are dying, but how theyre eliminated that makes you sit up and pay attention. The first game involves an eerie robot doll that turns around and looks for people still moving after the red light is given as it scans for violators. The second game forces players to chisel a shape out of a piece of honeycomb -- prompting the craftier players to use anything at their disposal, even if it means the humiliating task of licking the treat over and over again to make the job easier. But throughout all the violence and the multiple poignant, thoughtful moments, there's one central thread: the juxtaposition of the innocence of childhood against the harsh world we're all forced to endure. There are also questions upon questions that arise at every corner. For instance, who are these mysterious masked captors, and how does it benefit them to offer such a large payout for people who are down on their luck? Why not find a less sadistic way to be altruistic?It's difficult to say, of course, but answers do come in due time. You'll be left pondering what these poor souls could possibly be made to go through next as each episode concludes, however, and frantically scrambling for the play button to see what happens, all in the hopes of finding out what's really going on, just like the players themselves, and striking it rich with a bit of ~plot~ lottery. While the last bits of the story do drag a small bit as the story winds down, the tension doesnt let up until the final credits roll. By then, youll have seen hundreds of deaths, gallons of blood, and some truly ingenious acts from people just like you and me who have all chosen one path forward: living, no matter what it takes. And thats a hell of a lot scarier than giving up and succumbing to debts and hardship. Squid Game is one of the most exciting series to hit Netflix in some time. It mashes up the carefree, idyllic days of childhood with the brutal realism of adulthood as it forces everyday people to compete in life or death matches in a bid to potentially wipe out their debts. Equal parts gut-wrenching and squirm-inducing, its a white-knuckle thriller, drama, and episodic psychological breakdown with a sickly pastel veneer. Its one of the most unique things youll watch this year -- and maybe ever.", "date": "Oct. 1, 2021,"}