{"name": "Sable", "name_review": "Sable Review", "ref": "https://me.ign.com/en/sable/189706/review/sable-review", "text": "For an adventure game with no combat, no fail state, and not even much in the way of an objective, exploring Sables ruined desert of Midden was rarely ever dull. Driving a hoverbike through its stylish open world or climbing giant mountains and crumbling cities can be a lot of fun in a zen-like fashion. But for all the ways it manages to delight in its simplicity, dull puzzles, distracting bugs, and poor camera controls can also occasionally turn Sables peaceful world into a frustrating one.Sable tells a unique coming of age story, giving you control of a silent, masked protagonist in a fascinating world full of other creepy masked people, ruined sci-fi technology, and very little background to explain any of it. As a child entering adulthood, you begin a solitary quest to figure out who you are by exploring the vast desert around you  a ritual that plays out a bit like a mix between Dune and my nephews bar mitzvah. What makes this odyssey so special is that you truly get to make it your own. After a brief introduction to teach you the basics, the world completely opens up to you with no main questline and only a few suggestions of where to go. Completing quests given to you by its excellently written NPCs will earn you magical masks, and once youve obtained just one you could turn around, go home, and end your journey right away. I spent 12+ hours exploring all the nooks and crannies of Midden, completing every quest, and soaking in all Sable has to offer, but others could complete their pilgrimage in just a few hours if theyd prefer. Every players experience is likely to be different, and the structure of this world is incredibly well-designed to support the different ways you can approach it.No matter what paths you choose, however, the things you do in Sable will be largely the same. That includes riding a hoverbike around its visually stunning (if mostly empty) desert areas, solving simple puzzles, and doing a ton of platforming. Platforming is somewhat bare bones in its design: youve got the ability to jump, glide slowly through the air, and climb any surface with a slowly-depleting stamina bar (because Breath of the Wild made it so thats just in every open-world game now, I guess). But despite those basic building blocks, it manages to be pretty engaging throughout, due in no small part to the beautiful terrain youll be scrambling across. You arent doing exciting midair dashes or using a grappling hook to swing across gaps, but the slower pace pairs perfectly with Sables zen tone.Platforming's slower pace pairs perfectly with Sable's zen tone.That is, of course, when the camera isnt getting in the way of an otherwise good time. Like countless 3D platformers before it, Sable suffers quite a bit from a wonky camera thats constantly having dust kicked up into it when riding your hoverbike or phasing through objects when youre trying to get it into the right angle for a jump. Thankfully, Sables platforming is decidedly low stakes and not very challenging, so it never made me rage really. But its still an underlying annoyance that doesnt go away, and one that eventually started to steam my broccoli after long periods.Compared to its amusing, minimalist platforming, riding the hoverbike around and solving environmental puzzles holds up less well over the dozen hours I spent with Sable. Its puzzles never really present any kind of challenge or clever design that makes you feel accomplished for solving them, with most obstacles amounting to simply standing on a button or placing a battery inside a socket to power something up. Its not actively bad by any means, but also not really anything exciting to write home about either  again, just like my nephew's bar mitzvah. Similarly, riding your hoverbike around the barren deserts is a good way to see the gorgeous landscapes of Sables ruined world, but it eventually amounts to little more than holding down the accelerator and waiting until you get where youre trying to go. You can upgrade your bike and customize its color, look, and performance, but theres not a pressing need to do so since you wont be taking it into races or battles like Mad Max or anything. That means theres not much to it, but Sables stylish, cell-shaded environments are still so dang interesting to look at that sometimes I forgot Id been riding in a straight line for five minutes and wasnt even heading in the right direction.Once you do arrive at your destination, though, theres plenty to do, and meeting people and taking on quests are some of the best moments Sable has. The writing is excellent across the board and although you never hear anyone speak or even see their face, theres lots of memorable characters. I seriously wanted to meet everyone I could and was almost never disappointed in the hijinks and banter that followed. Sable almost always rewarded me for butting into the lives of others with quests that played out in unpredictable ways. In one quest, I posed as a fearsome vigilante to save a child, and in another I stole some poop from some bugs for science. I also climbed some giant floating crystals and ripped pieces of lightning out of them with my bare hands. Seriously, the stuff they have you do is all over the place in the best possible way.The bugs and glitches you encounter along the way, though, are less alluring, and Sable is just teeming with them, big and small. Theres everything from visual glitches like bushes that fly around and snap back in place like rubber bands or bushes that let you see through the world map when you point the camera at them (there are non-bush related bugs, too). Framerate issues and other visual blemishes like this arent game-breaking, but they do add up to noticeably hinder the experience. One time an emotional cutscene was completely ruined when my bike seemingly cloned itself and then rammed into its doppelganger during a serious moment. It was hilarious, obviously, but probably not what the developers were going for. On the other end of the spectrum, there are also issues that actually do have more dire consequences. These ranged from getting locked out of a quest because a vendors goods werent showing up, to my bike becoming invisible for some reason for a few hours, to my characters money not showing up correctly leaving me guessing if I could afford things or not. Most issues were resolved by resetting a few times, but not all of them, and the threat of bugs mucking something up was a constant fear throughout my otherwise enjoyably peaceful journey. Sables unique art style, memorable characters and quests, and engaging open-ended formula are going to stick with me for a long time. But the numerous technical issues, wonky camera, and bland puzzles all make this otherwise compelling odyssey a lot rockier. Those issues can be frustratingly frequent distractions, but when they did manage to fade into the background I found myself mesmerized by Sables bizarre world of creepy worms, masked weirdos, and hoverbikes.", "date": "Sept. 23, 2021"}