{"name": "Lost Judgment", "name_review": "Lost Judgment Review", "ref": "https://me.ign.com/en/lost-judgment/189538/review/lost-judgment-review", "text": "The Yakuza series and its spin-offs are renowned for juxtaposing simmering crime drama plots alongside quirkier complementary diversions, but Lost Judgment is the first time that the side dishes have turned out to be more satisfying than the main course. An intriguing murder case at its center doesnt quite go the distance thanks to a lack of late-game twists and turns and puddle-deep detective gameplay, but a surprisingly absorbing series of optional investigations that place returning star Takayuki Yagami undercover at a Yokohama high school go a long way towards redeeming the overall adventure.When a body is found decomposing in an abandoned warehouse, the prime suspect has an airtight alibi: getting caught committing an entirely different crime at the exact same time the warehouse murder is believed to have taken place. Its a provocative jumping off point to be reunited with private investigator Yagami and his likeable crime-solving cohorts, and it kept me enthralled in its opening hours as a series of contradictions were picked apart and modern concepts like deepfake technology were posited that made me feel like I was leading man in an episode of CSI: Shinjuku.This initial intrigue doesnt last, though, since all of the major parts and players in Lost Judgments main case have been identified and unmasked roughly by the start of the third act, which means any sense of mystery evaporates from there on out as the characters talk in circles and at length while re-examining the same pieces of evidence without revealing any new details. I kept waiting for a rug-pulling plot twist that never arrived, and despite the customary escalating boss fights in Lost Judgments closing chapters, I couldnt help but feel like it was just going through the motions.Defective AgencyI felt equally apathetic towards Yagamis detective work which, despite some minor tweaks and additions, remains as disappointingly shallow and inflexible in Lost Judgment as it was in the original. Quick-time event-heavy chase sequences are repetitive and often ridiculous, running laps of the same small circuit and always seeming a few comedic toots of Yakety Sax away from being an actual Benny Hill skit. Meanwhile, the covert tailing missions are slightly less frustrating this time around thanks to the ability to press a button to act casual and hide in plain sight, but no less plodding.Then there are the parkour sections, which are clunky enough to make an Assassins Creed fan want to fall on their hidden blade, and the stealth scenes that force you to throw coins in very specific spots to distract guards before you can take them out (just quietly creeping up behind them greets you with a greyed-out button prompt and no course of action other than to scurry back to your overtly signposted hiding spot). The added detection gadgets, like a highly sensitive microphone and a detector for hidden cameras, are certainly welcome but in practice theyre effectively not that different from the simple crime scene pixel-hunting from Yagamis first outing. The one aspect of Lost Judgments sleuthing that does feel a bit more involved is Yagamis ability to eavesdrop on conversations between pedestrians in order to pick up certain words or phrases that can be used as search terms in the Buzz Researcher app on his phone. In doing so, he can sift through a feed of text messages and triangulate specific points on the map where new clues might be uncovered. Its still relatively restrictive since you can only use the exact search terms youre given, but as far as actual deduction goes it at least made me feel I was getting my hands dirty rather than merely having them held.Private School Private EyeAnd yet, despite all of these gripes, I cant say that I didnt end up enjoying my time with Lost Judgment overall, and thats almost entirely thanks to the surprisingly meaty undercover side cases that Yagami can undertake at the Seiryo High School. Playing the role of a Japanese Johnny Depp in a 21 Jump Street-style high school sting feels refreshingly novel, and I enjoyed posing as a choreographer for the school dance squad or helping the robotics club refine their machines, while simultaneously sniffing around for clues to the identity of an unnamed professor suspected of recruiting students into criminal activity. Playing the role of a Japanese Johnny Depp in a 21 Jump Street-style high school sting feels refreshingly novel.These school stories often spill out into interesting places outside of the school grounds, and also do a great job of contextualising a lot of the mini-games found in Lost Judgment. The amount of time I spend in the virtual Club Segas found in Yakuza games has diminished with each subsequent sequel over the years; however, in Lost Judgment I was forced to brush up on my Virtua Fighter 5 skills in my efforts to endear myself to the schools eSports team while I investigated one of its members accused of cheating in tournaments. I appreciated the way Lost Judgment cleverly takes previously peripheral ingredients and makes them feel vital.In all, there are 10 different school societies to be infiltrated and investigated, combining to add more than a dozen hours of compelling casework to the package. Its shocking to me that these are all entirely optional, since I found them to be far more engaging and mechanically diverse than anything offered by the main story. This is despite the fact that, since theyre treated as side missions, theyre sadly not given the same level of slick presentation gloss as the fully-voiced cutscenes that flesh out much of Lost Judgments main mystery.My only major issue with the schoolyard subplots is that in a game that details the potentially horrifying ramifications of bullying, including youth suicide, you spend a surprising amount of time as a grown man beating the absolute snot out of teenagers. It only takes a few pranks played on the maths teacher for Yagami to morph into the meanest form of Mr. Miyagi and send a gang of troublemakers from the classroom to the emergency ward, which seems more than a little contrary to Lost Judgments virtuous main message. Not Exactly Like a DragonThankfully, the majority of Yagamis street fights are contested against consenting adult combatants. Unlike the turn-based battles of 2020s Yakuza: Like a Dragon, Lost Judgment stays true to the real-time Streets of Rage-style beat-em-up action that the Yakuza series was built upon. That suits me, since my personal preference is for pulling off a swift combo-based beatdown rather than get bogged down in menus puzzling over which defense spell to cast next. In addition to the Tiger and Crane fighting styles that return from the original Judgment, Yagami now has a Snake style, which is heavy with slippery parry moves, and I gravitated towards using it more often than not thanks to the satisfying counter-attack opportunities it consistently creates. However, Lost Judgment just cant compete with Yakuza: Like a Dragon when it comes to sheer enemy variety. Whereas Like a Dragon packed in enough colourful characters to overcrowd the worlds angriest-looking Wheres Wally? poster, Lost Judgment just pits you up against more or less the same stock-standard street punks in the vast majority of its brawls. The scraps certainly increase in challenge as you go on, with gang members swelling in numbers and bringing in more deadly weapons like katanas and flamethrowers, but it ultimately feels a bit stale when the thousandth head you crack has the same scowling facial texture as the first. Speaking of textures, the Kamarucho and Yokohama settings from Like a Dragon remain every bit as detailed in Lost Judgment, and as dazzling as ever to walk around  particularly at night. Yagami has access to a detective dog named Ranpo who can be used to sniff out hidden secrets, but I also enjoyed the simple pleasure of just peacefully walking him through the neon-lit streets. However, its a shame that Lost Judgments environment isnt quite as functional as that of the last Yakuza, and indeed while vending machines are on every other street corner, you cant actually buy items from them like you could in Like a Dragon. Instead you need to hustle to the nearest Poppo anytime you want supplies, ironically making these convenience stores seem somewhat inconvenient by comparison. Kung Fu KickflipThat extra legwork is mitigated somewhat by the inclusion of a skateboard, which ex-lawyer Yagami can magically whip out at any moment to go from lapsed legal eagle to wannabe Tony Hawk. However, its unfortunately pretty clumsily implemented. The button you hold down to run is the same one that activates the skateboard, and so I frequently found myself accidentally skating into a cluster of pedestrians and stacking it when I was merely trying to sprint past them. That made getting around substantially more stop-and-start than Id have liked. Besides, cash is so easily earned that I was more inclined to just order a taxi from Yagamis phone than I was to try to reach anywhere on foot.Ex-lawyer Yagami can magically whip out [his skateboard] at any moment to go from lapsed legal eagle to wannabe Tony Hawk.In fact, while Lost Judgment has an incredibly long list of features and some of them are really well done, skateboarding is just one of many that looks good on paper but is not so good in practice. Its true that you can race in violent Road Rash-inspired motorcycle races, try and grind your way to high scores in a warehouse skate park, and go undercover at a Russian school for ninjas. But its also true that the motorcycle races are hampered by stiff controls and an impractically low chase camera, the skateboarding tricks are on rails (and not in the good way), and infiltrating the ninja school basically amounts to playing a game of darts and getting dragged along into yet another monotonous chase sequence. In some ways, Lost Judgment is a bit like a gacha machine  all those toys sure seem enticing and varied when you look at them through the glass, but once you dispense a capsule and crack it open you realise theyre surprisingly cheaply made and youre suddenly not sure whether you actually needed it in the first place.By that same 100 yen token, there are a lot of really fun activities that only emerge over time. I was over 30 hours into my playthrough and well beyond rolling credits on the main story before I unlocked a robust arcade boxing mini-game, complete with 24 different opponents and its own levelling system and unlockable special moves, for example. I've still only uncovered three out of the 12 game cartridges you can play on the Sega Master System in Yagami's office. And whats this? A hilarious mini-game where you have to drunkenly chat up barmaids in the local nightclub? There are certainly a lot of hidden delights to be found digging around in Lost Judgment's sandbox, as long as youre prepared to invest the time and take the good with the bad. Despite its intriguing whodunnit premise, Lost Judgments main story fails to sustain its suspense all the way to the finish and its detective methods remain only slightly less superficial than those of the previous game. However, its meaty undercover side stories set in and around the Seiryo High School kept me playing for hours and hours well after the main story credits had rolled, in doing so revealing a lot of fun surprises that I might never have found had the classroom cases not kept me on the hook. This Yakuza spin-off feels far from being considered case closed, but heres hoping that Sega can show some better Judgment in the series' future.", "date": "Sept. 16, 2021"}