{"name": "NBA 2K22 [Next-Gen]", "name_review": "NBA 2K22 Review", "ref": "https://me.ign.com/en/nba-2k22-next-gen-version/189464/review/nba-2k22-review", "text": "When a basketball player gets into the zone, people say it can feel like time slows to crawl. They can see things before they happen, every little detail about their opponent stands out, and the rim seems to get bigger and more inviting. NBA 2K22 never quite managed to get me all the way into the zone, but the improved gameplay and breadth of content of this iteration get it closer than its been for the past few years. From important changes to how stamina impacts shooting to a City filled with diverse ways to improve your MyPlayer character, 2K22 feels like a breath of fresh air compared to 2K21. NBA 2K22 has made some important tweaks to the on-court action that help make it play like a more realistic game, most noticeably how it handles stamina loss while dribbling. In 2K21, it was easy to run at a defender on the perimeter, hit a Curry slide, and drain a three without breaking a sweat. Against the CPU, that tactic was almost undefendable, especially in MyTeam where player cards were quickly made ridiculously overpowered. With 2K22, you can still employ tactics like that, but the stamina loss you suffer from sprinting and doing dribble moves is made much more significant to balance out its effectiveness. As your player gets more tired their shot meter will shrink, making it tougher to hit shots. That leads to a game that initially seems slow compared to 2K21  but if you play under more control and dont just hold that sprint button, youll actually have an easier time putting the ball into the bucket because of your larger shot meter. It may not seem like an important change at first, but it leads to a playstyle that feels closer to real life than 2K21 ever did.Fatigue leads to a playstyle that feels closer to real life than 2K21 ever did.Without three hunting and rim running, youre forced to play team basketball. The pick and roll is your best friend, especially offline. Learning how and when to use your dribble skills and speed to get past defenders off of a pick will make all the difference. Or, if youd rather do damage as a big man in the paint, use the pick and roll to force a switch and go to work against the smaller defender. These tactics are a little overpowered at times, but theyre countered by improvements on the defensive side of the ball.Additionally, Visual Concepts has completely redone its systems for contesting shots and blocking. Not only does this mean snazzy new snatch blocks and volleyball spikes, but I felt like a true rim protector when roaming the paint. Like the pick and roll, it can start to feel like you have too much power; however, the offense is much more likely to drain open jumpers, meaning you cant just sag off and rely on a late contest. Steals have also been improved with new animations based on your players steal rating, so trying to swipe the ball with a low-rated player is sluggish, while guys like Jimmy Butler and Matisse Thybulle will rip the ball with authority.What We Said About NBA 2K21When its clicking, NBA 2K21 has some of the best gameplay in sports video game history. But thats been true for several years now, and though this years iteration improves on a handful of things, most notably the aimed shooting mechanic, there hasnt been much movement. At the same time, its a shame that 2Ks focus isnt on the fun you can have on the court, but instead the money that can be extracted from your wallet off of the court in the MyCareer and MyTeam modes, which just arent fun to grind through without paying. Maybe the new set of consoles on the horizon will bring a fresh start for the NBA 2K franchise, but right now I feel more pessimistic about the series future than ever. - Ben Vollmer, September 10, 2020.Score: 6Read the full NBA 2K21 reviewOn top of that, Ive noticed some of the more notorious legacy issues not popping up as much. Things like bump steals arent gone completely, but I certainly havent seen them happening as much as last year. The tweaks on the defensive side of the ball have also seemingly gotten rid of the speed-boosting that plagued 2K21. That could, of course, all change as people get more familiar with 2K22, but for now, Im happy to see Visual Concepts taking steps to iron out some of those more annoying tactics. And while there are still quite a few instances of weird animations that took me out of the experience, those too are lessened from previous years.I'm happy to see Visual Concepts taking steps to iron out some of those more annoying tactics.Improved gameplay doesnt mean much if you dont have good places to take advantage of it, but fortunately, so far Visual Concepts seems to have provided plenty of things to do throughout its selection of modes. Whether you want to build your own baller from scratch in MyCareer, assemble a dream team of past and present NBA stars in MyTeam, run your own team in MyNBA, or dominate the womens game in The W, NBA 2K22 has you covered.MyCareer takes us back to the vast world of The City. Here, youll step into the shoes of a budding NBA superstar and help lead him into the Hall of Fame. Or, you can forget all of that fame and fortune and take your game to the streets to play against other players in modes like the Rec Room and Pro-Am. Either way, youll have to contend with the confusing teammate rating AI. This rating helps dictate how much Virtual Currency (VC) you earn at the end of each game, making it very important if youre not looking to spend real-world money to improve your player (which, of course, 2K would very much like us to do). Unfortunately, the AI too often decides that something that isnt your fault is something it should penalize you for. For example, if I correctly switched on a pick and roll to pick up the ball handler, the AI would sometimes decide that I shouldve stuck with my man and docked me points if he scored when my teammate didnt switch to cover him. It also switched me from one man to the other at random several times, forcing me to sprint across the court to stop losing points for leaving my assignment. Its a frustrating experience  one that youre probably familiar with if youve played any NBA 2K game in recent years.The second you step into multiplayer matches on the street or gym, microtransactions begin to rear their ugly head.If you stick to your NBA career, you probably wont notice the monetization problems that The City is full of. The second you step into multiplayer matches on the street or gym, however, theyll begin to rear their ugly head. Its nearly impossible to hop in without either spending money or going through a massive grind to raise your players overall level. I routinely matched up with other people whose players overall rating was in the low 90s, and my 65 OVR small forward simply couldnt hang. It may not be pay to win by the strictest definition because you can grind it out, but its aggravatingly close.Meanwhile, Visual Concepts has put a major focus on off-the-court activities in MyCareer. Early on in my playthrough, I was picking up coffee for my pal, The Game, to help kickstart my rap career. Later, I hooked up with Jake from State Farm for some absolutely shameless brand promotion. The City is full of product placement, to the point where I could only laugh at how ridiculous it became. However, the core of building up your personal brand is an adequate diversion when you want a break from the grind of an NBA season. Over in MyTeam, 2K22 is home to similar highs and lows. The good news is that it provides more than enough content to keep you busy, which means you dont need to open your pocketbook for pesky microtransactions if you dont want to. If you want the best of the best players right away, you can, of course, spend money for the chance to get them. However, in my experience, there are plenty of free options that make you competitive  you just have to put the time in to unlock them.NBA 2K22 has also added a few new features like the Shoe Builder and a Card Grading system. However, these feel mostly tacked on and dont add much to the gameplay. The real problem for MyTeam is its lackluster multiplayer options.There are free options that make you competitive  you just have to put the time in to unlock them.Unlimited and Limited modes are back with basically no changes. That means most people will probably never sniff the top tiers of Unlimited rewards, and Limited continues to be a luck fest in terms of rewards. Visual Concepts has also changed Triple Threat Online to something its calling The 100, but as far as Im concerned its a significant step down. The idea is that you start a round with 100 points, and after each game your opponents score will be subtracted from that total as you work your way up the prize board until you hit zero points. That couldve been a great casual option since youre guaranteed to at least make it to the second tier on the prize board, but in practice, its unrewarding compared to the single-player modes for casual players and more annoying for the more dedicated players who will now have to struggle to get to the top tier of the board much more than in previous years.Microtransaction Reaction NBA 2K22 continues the series unfortunate tradition of being littered with microtransactions. Depending on what modes you like to play you can avoid them, but playing multiplayer in The City or in MyTeam will make you feel the call immediately. In fact, you almost cant compete in The City modes like Rec Room without buying VC. MyTeam is less overbearing because you can grab free reward players more quickly than you can level up your MyPlayer. However, youll still get matched against others online with stacked teams that feel unstoppable unless youre a top player.The new Draft mode is definitely the star of the multiplayer show. At least, it shouldve been, had real-world money not become part of the equation. Visual Concepts made the decision to ask us to pay to enter once you use up the limited tickets you can earn. Adding that cost to entry really puts a damper on what could be a fun, casual mode. I would really like to see them switch to in-game currency for entry, even if it means a slightly steeper time cost.Finally, MyNBA has spent the offseason making improvements to how you build your coaching staff and train players. These are neat additions for those who want to really dig into running a franchise, but are hardly game-changers. And The W feels like an afterthought of MyCareer. Sure, you dont have to go through a ridiculous grind to build up your player, but Visual Concepts essentially took all of its ideas from MyCareer and turned them into basic menus. It certainly isnt the treatment that fans of the WNBA would want. NBA 2K22 puts you on the court of the entire basketball universe. Play now in real NBA and WNBA environments against authentic teams and players. Build your own dream team in MyTEAM with todays stars and yesterdays legends. Live out your own pro journey in MyCAREER and experience your personal rise to the NBA. Flex your management skills as a powerful Executive in MyGM and MyLEAGUE. Anyone, anywhere can hoop in NBA 2K22.", "date": "Sept. 15, 2021"}