{"name": "Deathloop", "name_review": "Deathloop Review", "ref": "https://me.ign.com/en/deathloop/189392/review/deathloop-review", "text": "Ive never played a game like Deathloop before. More accurately, Ive played a lot of games that are a little bit like it  Dishonored, Hitman, Outer Wilds, and even Dark Souls among them  but never anything that fits so many interesting ideas together to create something so fascinatingly unique. Its ever-repeating day, doomed to loop until you can break it by murdering eight targets, is a playground for impactful gunplay, absorbing investigation work, satisfying experimentation, and even tense multiplayer standoffs. Developer Arkane Studios precise calibration of these pieces make Deathloop an intricately built clockwork machine that doesnt so much quietly hum, but rather confidently roars. Your eight targets, known as Visionaries, have taken up residence on Blackreef; a cold and grey island made appealingly vibrant by dashes of 1960s fashion, architecture, and technology. Awakening every morning on its freezing shore is your protagonist Colt, a consistently amusing and understandably sweary gunslinger whose amnesia prevents him from knowing how he got here or for how long hes been looping. Surprisingly for the scenario, there's no ticking clock snapping at your heels as you try to end the cycle by taking all your targets out before the day resets and theyre all resurrected. Deathloops smartest decision is to split its day into four time periods  morning, noon, afternoon, and night  and you can remain in each of them for as long or as short a time as youd like. You choose one of Blackreefs four unique districts to visit in each period, and you can take your time to thoroughly explore and crack some of Deathloops most elusive optional secrets without the fear of time running out. Thats not to say there arent complications, though. Your targets are spread out across those time periods and locations, so much so its initially impossible to kill them all before the day runs out. As such, you need to herd them together so that you can murder more than one at a time. To achieve this, you must conduct an investigation into their lives and schedules that took me roughly 20 hours, uncovering Blackreefs exciting secrets, learning fascinating details about your adversaries, and eventually concluding by orchestrating a satisfying solution that ensures every single one of them dies before midnight strikes. Despite using a live, die, repeat structure, its best to think of Deathloop as a temporal metroidvania rather than anything close to a roguelike. Its chief currency is information: as you chase down objectives and unearth new leads, youll discover clues that help you to unlock doors and exciting new opportunities in areas youve previously visited, both in time and space. Those areas are, in Arkane tradition, intricately detailed and dense with personality. The decrepit Karls Bay, with its cavernous, rusting aircraft hangars perfect for staging ambushes in, is home to an obsessive cult that devoutly follows one of the Visionaries. The sleeker Fristad Rock, meanwhile, with its rock n roll club filled with tempting off-limits chambers, provides a fantastic challenge for your infiltration skills. Excitingly, the details of the four locations shift depending on the time you visit them. As the day goes on, the island becomes increasingly anarchic as its residents grow rowdier and smash up furniture, graffiti walls, and even crash a car into a building. In the afternoon, a snowstorm redecorates Blackreef with a white blanket, while the evening is host to an exuberant party that dominates the Updaam district. Between these big visual changes are subtle, more meaningful alterations, such as changing enemy patrols, water freezing to provide new pathways, or a secret apartment window that only opens in the afternoon. These changes help create a constant sense of discovery all throughout Deathloops day. Once youve played through all four time periods, the day resets and you start again. Dying will also send you right back to breakfast time, although Colts supernatural abilities allow him to survive death twice per time period, which keeps things fair and provides an opportunity to quickly learn from mistakes without things getting frustrating. Either way, each reset also strips your inventory of every weapon, power, and upgrade youve picked up, forcing you to start afresh each day. Saving you from despair is the Infusion system, which allows you to permanently bind items to Colt so that they survive the loop. It requires spending Residuum, a resource found around Blackreef which is rare enough to force considered purchases, but in enough supply that each new loop will consistently bolster your arsenal. This system cleverly encourages you to vary your approach, allowing you to taste Deathloops many flavours without committing until youre ready. Each day involves picking up a new assortment of guns with varying perks from the enemies you chew through, as well as upgrades called Trinkets, by the bucketful. Trinkets, of which there are dozens, allow you to make meaningful alterations to both your weapons and to Colt, such as the ability to reload in an instant or move without making noise. The loops cycling buffet of options allows you to discover and test new equipment, which will go on to inspire your Infusion choices. My increasing enamourment with supernatural abilities such as the Force push-like Karnesis, for instance, saw me invest in Trinkets that increased how long I could use them for, and even fuel them with my health should I run out of power. Over time, youll build up a collection of your favourite items, from which you choose a loadout before heading into the next location. While you may lose equipment at the end of a run, a reset never disrupts your investigation  you hold onto every single discovery youve made so far in your quest log and intel files. This means you rarely have to repeat the same activity twice, which eliminates a frustration many other time-loop games suffer from. Discoveries automatically set new objectives, which unfortunately robs you of the chance to draw your own conclusions but does ensure youre never exasperated by hidden links. Its a worthwhile tradeoff that keeps Deathloop moving at a lively pace. The journey your objectives take you on frequently shines a new light on locations and time periods youve visited before, which builds up a rewarding bank of knowledge. You gradually learn shortcuts through buildings, safe havens with health dispensers, and treasure troves that refill with the same violent delights  punchy weapons or even reliable sources of Residuum  every day. The most thrilling discoveries come slowly but surely as you begin to recognise the cause-and-effect connections between times and districts, such as when I realised that breaking into a computer in the morning will ensure a door in a different district will be unlocked in the afternoon. After a couple of hours of linear introduction (which do spend a little too long in a tightly controlled tutorial mode), the whole island and time loop is opened up to you to explore as you please  any district, in any order. You are provided with starting leads for each of the eight Visionaries, which unfold as linear quest lines, but how you pursue them is entirely up to you. You could opt to tug on each new thread as you find them, hopping between leads to cover as much ground as possible in a single loop, which provides a gratifying sense of efficiency. Or you could chase down a single lead, skipping time periods and locations in dogged pursuit of a specific part of the puzzle. This remarkable freedom helps fulfill the investigator fantasy; theres a genuine sense that each choice you make helps narrow the search, inch by satisfying inch. Since most people on Blackreef are more interested in killing you than chatting, the answers to Deathloops murder puzzle are largely discovered in the classic formats of audio diaries, notes, and computer messages. Granted, those are a dime a dozen in just about every game since BioShock, but Arkane has outdone itself here: these are the best Ive experienced in any game; concise, deeply flavourful, and often surprisingly funny. Via the aggressive messages sent by AlphaWolf69, for instance, youll quickly learn that one Visionary, Aleksis Dorsey, is a frat boy scumbag whose only rightful place is at the business end of your shotgun. Directly tying objectives to these diaries and messages means each new discovery further develops an authentic antagonistic relationship between you and the Visionaries as you play, rather than having a manufactured one dropped in your lap. Arkanes deft storytelling hand doesnt always hold entirely steady, though. If you dont fully absorb every note and connect the many dots yourself, which is highly possible given the amount of freedom you have, Colts personal story  a fun, twisty history that intertwines with the lives of his targets and acts as Deathloops overarching plot  might not quite come together. And without it, the short concluding chapter can feel not just abrupt, but rather thin. As much as I appreciate Arkane having confidence in us to make these connections ourselves, Colts story feels like something that should have been served up in small milestone meals throughout the loops in a way that cant possibly be missed, rather than scattered like cookie crumbs across the world to be overlooked by those who just want to get on with the next justified murder. Shotgun Symphony The precision engineering of this complex, looping world is held in balance by Deathloops combat system, which is a delightfully raucous affair that roars like a dragon with ballistic breath. If you prefer to go loud you can paint the walls with the insides of Blackreefs violent thugs  all of whom appear to have fallen out of an Andy Warhol painting  using a small but well-tuned array of fantastically heavy weapons. Among the best are the Pepper Mill, a sputtering machine gun that feels as if it were wrenched from the undercarriage of a fighter plane, and The Fourpounder, a pistol that fires with the force of a battleships cannon made miniature. Despite acquiring these trusty favourites, I constantly found myself switching between the entire armoury as I planned around different tactics. If youre playing on PS5, as I did, each gun produces a different effect in the DualSenses triggers and haptic vibrations, generating a deeply enjoyable sense of force with every fight. These guns are joined by a library of Slabs, which are supernatural powers stolen from the corpses of Visionaries. These can be used in combination with your weapons and the environment to approach situations in your preferred manner, and all routes feel robust no matter if you choose to go loud or quiet. Pairing the teleportation Slab, called Shift, with the invisibility of Aether, for example, allows you to zip up to the rafters and observe enemy paths unseen, picking off stragglers with a silenced nail gun. The Karnesis Slab, meanwhile, can be used to levitate groups and repeatedly slam them into walls until theres no life left in them. Adding to the Slabs value are upgrades, such as the ability to chain your teleport with a kick thats so powerful it causes a sonic boom  which are acquired by looting the same Slab multiple times. This provides a strong reason to revisit your targets over and over to claim their Slabs, should the hilariously brutal neck-snap melee kill not be enough encouragement. The links between your weapons and powers make Deathloops combat (or avoidance thereof) a hotbed for joyful experimentation. The system truly comes alive, though, when you learn how Trinkets can harmonise the individual components of your loadout. The right combination can create a whole new playstyle: you might become a hands-off hacker capable of remotely locking down rooms and take out targets with gun turrets that heal you with each kill; or perhaps a master navigator who can double-jump up onto balconies and magically switch places with enemies; or a telekinetic tank with ocean-deep ammunition reserves and a health bar that never seems to run out. This has a deck-building appeal to it, as you mix and match your inventory to craft kits tailored for delightful shootouts, sneaky infiltrations, or a hybrid of the two. Over time, youll develop a character build refined in anticipation of the final, perfect loop. Does that sound too easy? There is, of course, a catch. Doing her best to ensure you never make it as far as the final loop is Julianna Blake, the only Visionary who ever takes a direct interest in Colt and operates on his level. She constantly chats with you over the radio, and your boisterous banter with her imbues this complex, mechanical game with an endearingly human personality. If you dont try to break the loop, she taunts, Im just going to kill you over and over again in increasingly violent ways until you do! Colt breaks her off; Fine! Ill break your f***ing loop, and whatever I did to p**s you off, Im sorry! Its said with such comically coarse delivery that Colt instantly proves himself a worthy antithesis to the largely silent protagonists of other Arkane games. But the biggest difference between Julianna and her peers is that where the other Visionaries will only get aggressive if you invade their home turf, Julianna is a restless and free-roaming hunter. Shell seek you out and crash your investigation party, turning up like a miniboss fight out of the blue. For example, after silently killing my first target and all their guards, I turned around to find Julianna inches from my face, blocking the exit in a moment that called back memories of BioShocks terrifying dentist. The ensuing shootout  taking place in a hangar rapidly filling with lethal gas  threatened to send me back to the morning without any of the cool treasure Id scooped up that day. Juliannas enhanced aggression, resilience, and ability to disguise herself as generic enemies means shes a welcome tangent in Deathloops predictable and repeating patterns. Shes not quite as dangerous as she sounds  I only actually died by her hand during the earliest stages  but the alert music that signals her arrival in the area nonetheless drums up some genuine tension every time. Thats the case in single-player mode, at least. Julianna serves a greater purpose, in that she can be controlled by another player who can invade your game to try to thwart you. This twist on the PvP mechanic popularised by Dark Souls turns her into an entirely different beast. Naturally more intelligent than her AI stand-in (or not, I suppose, depending on the person youre playing against), a real Julianna provides a more authentic sense of cat-and-mouse to the proceedings. This chase is a thrill that not even the few lag spikes I encountered could dampen, and a challenge that turns the ability to replay the loop after the credits have rolled into a much more alluring endgame scenario. Thankfully, if you detest the sound of a randomer jeopardising your perfectly arranged kill, invaders can be entirely locked out of your game, or limited to just friends, with the simple flick of a menu switch. From the other perspective, playing as Julianna is similar to controlling Colt, but she has a different rhythm. Without Colts resurrection ability, every wrong move could be your last, and youll need to kill your target three times to ensure hes dead for good. Its a balance that initially seems unfair, but eventually reveals itself to simply be a different kind of battle. Deception becomes the key part of your toolkit; theres a quiet thrill in switching appearances with an NPC and blending in, doing your best to replicate an AI patrol route (not unlike Watch Dogs multiplayer mode). The map knowledge youve learned over many loops helps pinpoint ambush locations in places youll know Colt is likely heading to, which is a gratifying reward for mastering Deathloops level design. My apologies to the person who I repeatedly toyed with in the rock club, invisibly stalking them using vents Ive discovered on multiple visits to stay two steps ahead. Encouraging you through repeat invasions is a Hunter Rank progression system. This can be increased by completing challenges, each of which prompts you to kill Colt in a variety of fun ways. Success unlocks a rapidly growing collection of weapons, powers, and Trinkets for Julianna (she and Colt do not share an inventory), a wardrobe of new looks for both playable characters, and further challenges to complete. PvP is by no means an essential mode, but for anyone as similarly taken by Deathloops combat as I am, its essentially a rewards system for killing in smart ways. Despite its seemingly endless complexities, Deathloop is one of the most confidently designed games Ive ever played. Arkane Studios has crafted a world made of ideas linked by meaningful connections; time influences space, space influences tactics, and tactics influence loadouts. Its unique, high-concept ideas around time loops and non-linear investigation work are implemented with elegance, making its systems feel effortless to navigate, learn from, and ultimately master. A new high watermark for Arkane and developers of similar games to aspire to, Deathloop is a game like no other.", "date": "Sept. 13, 2021"}