{"name": "NBA 2K18", "name_review": "NBA 2K18 Review", "ref": "https://me.ign.com/en/nba-2k18/137838/review/nba-2k18-review", "text": "NBA 2K18 can be compared to an NBA superstar entering his final years in the league: its confident and willing to take risks because it already knows it has a spot in the Hall of Fame. The legacy of NBA 2K18  that is, its gameplay and presentation  are in a great place, and so while not every risk taken with MyGM and MyCareer pays off, its still a game thats worth coming back to all year long. On the court, NBA 2K18 has done something genuinely impressive in making each player handle differently. You have to think about dribble drives before going for them, and knowledge of the real-life players skills is rewarded. Guys like Jimmy Butler are living at the foul line, as they should, while someone like Tyler Johnson does not get the same calls. Overall, you have to really read the defense and react while playing to each players strengths. You cant just drive into a pile and expect it to go your way  because it wont. Playing to the strengths and weaknesses of your players comes through.Playing to the strengths and weaknesses of your players comes through all over the court. Enes Kanter is a wonderful player to have on offense, but hes a complete liability when it comes to protecting the paint. Someone like Kelly Olynyk can spread the floor from the center position, but dont expect him to be able to handle Karl-Anthony Towns on defense. Kyrie Irving and Isaiah Thomas are unbelievably dangerous on offense, but Patrick Beverley is way more useful on defense than either of those superstars could ever be. Even something as nuanced as the help defense has really been diversified this year based on personnel. Defenders will leave suspect shooters like Ben Simmons and Josh Jackson alone in the corner from three-point land and help out on drives instead, daring them to take and make three-point shots and prove they should be covered. The downside is that AI players still sometimes struggle with things like losing their man for no reason on defense. In addition, they have a hard time figuring out body placement on post-entry passes, playing on the wrong hip, or even fronting their man when it doesnt really make sense. However, the AI does do a much better job this year of playing into the signature styles of teams and players on offense. Guys like Devin Booker run off screen to catch the ball on the move to immediately pressure your defense. Unique big men like Nikola Jokic arent featured enough for my tastes, but overall, teams play like their real-life counterparts more than they ever have before. Seeing all these improvements across the board has breathed new life into the series for me.There are a couple other improvements to long-term mechanical issues in NBA 2K that should be mentioned: fast breaks and rebounding. Fast breaks have improved this year in that youre no longer constantly being chased down and blocked from behind on plays that should obviously end in dunks. Defenders cant just make up an absurd amount of space and get to you when they have no right to get there. That being said, players still dont run lanes or hold their spacing enough on the break. Its very common to see seven or eight players end up in the paint on the break when they really should be finding more spots at the three-point line to provide better spacing and passing lanes. Rebounding has been diversified this year with some fantastic loose-ball animations and tip rebounds. There are still some cases where I dont understand how a guard got in to get a rebound around three other players, but much like the signature style mentioned previously, players like Andre Drummond are true threats on the glass. All of this put together means Im having the best time Ive ever had playing online in head-to-head games. I generally play NBA 2K more online than against the AI, and so seeing all these improvements across the board has truly breathed new life into the series for me. MyTeam is the biggest beneficiary of these improvements. My favorite new MyTeam addition is Pack and Playoffs, which simplifies your team down to selecting five random players from packs, and then uses that group to go against other users. So you end up seeing opponents who clearly tried to build a team to play a certain style, and then others who just picked the best players they could regardless of fit. You have to adjust and strategize while not worrying about subs or any other extra elements  and then if you get bored, you just go and draft again. The biggest downside right now to the head-to-head games online is that timeouts are causing a minor frame rate issue for many folks (including myself) after returning to action. If neither team ever calls a timeout, this issue never occurs. You can play through it, but it is noticeable, especially when stat overlays come up on the screen during the action. I imagine it will be patched because something similar has happened before in an NBA 2K game and was quickly patched then, but as of now, it remains my biggest issue with online play. Playing online has seen a number of structural changes, some better than others. The first and most obvious is that, in what feels like the culmination of years of baby steps, NBA 2K18 has largely stripped away the linear starting path of MyCareer and combined it with MyPark and Pro-Am to create The Neighborhood. Instead of picking modes from menus, youre set loose in an open environment as your player and are free to jog to various places to take part in MyPark Ante Up games, or even just compete in trivia against a bunch of other random people. It's a smart way to keep you in a populated world at all times.Its a smart way to keep you in a populated world at all times, and it pretty effectively hides the loading times that come with switching between the various modes. It doesnt cure the need to wait for matchmaking, but at least it keeps you in the world in the meantime. It feels weird to say, but just walking around and suddenly challenging other people in a game of skee-ball or trying to beat some random persons score in Downtown  a game where you earn points for hitting shots from various spots on the court  are enjoyable detours on my way to the ProAm gym. Those are all steps forward, but NBA 2K18 has also taken a significant step back by bringing microtransactions to a place that feels uncomfortable. They were around last year, but now youre forced to use virtual currency to buy everything from a tattoo to a T-shirt, as well as increasing your characters stats. You can earn this currency by playing  very slowly  but if you buy the $150 version of NBA 2K18 you can get a big boost with the currency that comes with it. Youll see plenty of those artificially high-rated players around, and it feels like were being steered toward spending money to avoid an insane amount of hours spent grinding for points. It's a dangerous slide into pay-to-win territory.This haves and have-nots problem is magnified because, again, individual players on the court play much more closely to their strengths and weaknesses than before. So when you start out, your 60-rated player is pretty much bad across the board. The people who paid money and have better skills are still not great at everything, but no one is going to want to play with your 60 because youre now even more of a liability. It just feels really perplexing to make a competitive online mode so focused on character stats, because that means getting up to speed means either paying out money or grinding for hours to make yourself viable. Most competitive first-person shooters hide cosmetics or at worst maps behind a paywall rather than more powerful guns because that would throw off the balance, and this is no different. Its a dangerous slide into pay-to-win territory. Meanwhile, over in the franchise mode, MyGM, theres a new text-driven story mode attached to the extensive simulation. Its good to see an element of story added to try and give you a reason to play beyond just crafting your squad to win games, but this is not a great first attempt. Its largely styled like a choose-your-own-adventure book that plays out in simple cutscenes, only it feels like the choices dont actually mean much. For example, one story path leads to a choice of whether to hire the owners son as assistant GM. If you refuse, the owner hires his son anyway. If you then fire the brat, hell keep showing up in meetings until you fire him again after the season ends. Thats either a really annoying bug or a serious lack of impact to decisions. In another instance, your owner demands you trade for a specific player. This also felt completely scripted because it seemed next to impossible to manually trade for him, no matter what I offered the other team. But then magically, right at the trade deadline, this specific player was acquired in a move that was done behind my back by the owners son. Between the irrelevant choices theres also a cringe-worthy number of bizarre food and drink jokes. Your owners are obsessed with made-up foods like do-nakes (a cross between a donut and cupcake that isnt nearly as catchy as the cronuts that inspired them). I imagine its supposed to be a running gag, but it really just slows down the cutscenes more than anything and isnt nearly funny enough to justify that. As a huge NBA nerd, this is a tool that feels like it was made for me.The bright side is you can just play the regular MyLeague mode to ignore all these story elements and just get lost in the deeper analytical aspects of running an NBA franchise. Its made incrementally more interesting this year by a helpful new analytics tool: You can plot different data points on the X and Y axis and analyze the entire NBA or just a small subset of players. So, if I want to see who is making the most three-pointers per-36 minutes while factoring in their age, I put those elements on the graph and then perhaps discover I want to go out and acquire a player who is maybe being overlooked on another team. As a huge NBA nerd and someone who obsesses over the ins and outs of contracts, salaries, and stats, this is a tool that feels like it was made for me. That said, some of the new additions dont work quite right. A lot of the new elements of the recent NBA collective bargaining agreement (CBA) have been added to various amounts of success. For example, things like the G-League integration and two-way contracts seem to be working, but cap holds and player rights seem to be off in various ways. For example, players should always count as cap holds for your team until you renounce them in the offseason, thereby impacting how much money you have to spend in free agency. To use the Sixers as an example, J.J. Redick should have a massive cap hold after the first offseason until hes renounced, only hes just an unrestricted free agent and does not appear to count against your cap. Another example is restricted free agent Joel Embiid: his cap hold does stick around, but it should be closer to $18 million, but ends up around $12 million. A bigger problem is that some players coming off rookie contracts are being marked as unrestricted free agents when they should always be restricted if the fourth-year option was picked up  thats just the way the CBA works. I recognize a lot of this is in-depth and many wont notice because there are many other deep elements working correctly within franchise mode, but this stuff does matter for the long-term health of a franchise if you want to play multiple seasons  and thats what this mode is for. Overall, NBA 2K18 continues its streak of having one of the deepest franchise modes around. NBA 2K18 is another step forward on the court, improving on the series already great gameplay. Youre rewarded for smart, controlled basketball when dribbling, driving, and playing defense in ways that make sense for the players youre controlling. In the side modes, results are mixed: the new fusion of Career mode elements into The Neighborhood gives it some new life, but the same cant be said for the meaningless story elements within MyGM, and microtransactions now have too much of an impact on gameplay. Theres far more good than bad, though, and NBA 2K18 deserves credit for taking chances.", "date": "Sept. 20, 2017"}