{"name": "12 Minutes", "name_review": "Twelve Minutes Review", "ref": "https://me.ign.com/en/12-minutes/188418/review/twelve-minutes-review", "text": "[Editor's Note: This is a spoiler-free review.]Twelve Minutes doesnt seem all that unique on paper. When you boil it all down, its a fairly traditional point-and-click adventure game that takes place in one setting. But where things get interesting is that its also a time-loop mystery, so even though you have all of your puzzle objects at your disposal from the jump, theyll need to be combined in intentionally different ways over the course of dozens and dozens of loop resets during the full six- to eight-hour story in order to unlock new information. Its a fresh twist on a genre Ive loved since the original Monkey Island days, and the story is good enough to make me immediately want to talk to someone else whos also finished it.Think of Twelve Minutes and its time loop as a house of cards: you can build it using anything in the deck, but if you make one mistake, itll collapse and youll have to start all over. Sometimes youll knock it down on purpose in order to get something you need for your next proper attempt to finish it. Its also somewhat flexible: when I talked to two other people who played it, I found that each of us took a slightly different path to arrive at the conclusion. Willem Dafoe is particularly menacing as the cop.That story sees your character, voiced by James McAvoy, walking in the front door of your apartment at the beginning of the game, where your wife, played by Daisy Ridley, is eager to share some news. She greets you and offers a dessert she made. A few minutes later, though, a cop voiced by Willem Dafoe knocks on the door claiming to have a warrant for your wifes arrest; one wrong move and things go awry fast and the loop starts over. You also cant leave the apartment, as doing so also resets the loop. That confinement sometimes felt comforting as I tried to figure out what to do next and discover why this cop was so hostile, since I knew the answer was in the room somewhere  there were no other locations I couldve missed something in. But of course, if you do get stuck (which I did once until I stumbled onto a new path by accident), that same one-bedroom flat can feel frustrating too. Things can get Groundhog Day-levels of dark if you want them to, and itll be up to you to see if those are just clever ways youre allowed to take out frustration when you get stuck, or if they can be used as legitimate ways to move the story forward.Of course, youve got items scattered around the apartment you can pick up, use, and combine with other objects: things like coffee mugs, a kitchen knife, spoons, the aforementioned desserts, and your cell phone, just to name a few. You can pick any of them up and theyll be added to your inventory in classic point-and-click adventure style, and figuring out how  and when  to deploy them is key to advancing the plot. The small but star-studded voice cast does a great job of bringing the story to life, and Dafoe is particularly menacing as the cop. Theres also a subtle, drama-enhancing score that complements key moments nicely. Also, the ability to fast-forward through dialogue youve already heard many times in previous loops is invaluable for keeping things from getting too repetitive. Visually, meanwhile, Twelve Minutes is very simplistic, and eight hours is a long time to be looking at the same top-down view of your apartment. The frequent clipping issues and very rudimentary Sims-like animations dont help, but its the kind of nitpick I learned to live with as I became engrossed in the central mystery.And that mystery absolutely pays off. Writer-director Luis Antonio deftly paces the peeling of the storys onion layers; I was surprised when Steam showed that Id played for seven and a half hours on my initial run-through; it didnt feel that long, and I mean that in a good way. Its difficult to convey my enthusiasm for Twelve Minutes time-loop mystery without discussing what happens at the end, but like Inside, Id be doing you a grave disservice by giving anything away. What I can say is that the payoff is worth it, and the clever way in which writer-director Luis Antonio flips the traditional point-and-click adventure on its head makes for a compelling bit of unconventional storytelling that could only have worked as a game. Throw in great performances from three respected actors and the result is a memorable crime worth solving.", "date": "Aug. 18, 2021,"}