{"name": "Boyfriend Dungeon", "name_review": "Boyfriend Dungeon Review", "ref": "https://me.ign.com/en/boyfriend-dungeon/188252/review/boyfriend-dungeon-review", "text": "When I first heard the delightfully wild concept of Boyfriend Dungeon, I was keenly interested in the idea of playing a game that gives the dating sim formula a different kind of action: Hades-style isometric battles in which your weapons are also your love interests. Thats an exciting concept because games in this genre are often defined by romances that are longer and more choice-based than what you'll find in something like Mass Effect. But while the combat is entertaining enough while the enemy variety lasts and Boyfriend Dungeon certainly has a cast of pleasantly designed characters, it fails to offer much nuance in its relationships. Even worse, its roguelite structure tied to romance systems meant juggling spending time with who you like versus the weapon you actually want to play with. Limited dungeons, having to interact with an antagonist in an uncomfortably close way, and an awkwardly rushed romance system kill the mood, too.In Boyfriend Dungeon, you assume the role of a person who's never been on a date before and is sent to a cute beachside town for the summer to find love. It turns out the dating hot spots are on the beach or in the town's nightlife, but excitingly, they're in ~dunj~ or (what the cool folks here call dungeons) where people can go dungeon crawling for money  and romance. You're not dungeon crawling alongside another fighter, but are instead wielding potential partners and using them to slice or bash enemies into submission. In Boyfriend Dungeon, some people can magically transform into a cool weapon that reflects their personality: a cautious and artistic woman named Valeria can transform into a pretty dagger, while a K-pop idol morphs into an awesome lasersaber. Wielding someone isn't inherently romantic, but these weapon-people aren't hesitant about getting flirtatious.It's a fun setup, though some moments in the romantic journey get a little bumpy given how inconsistent your character is with their available dialogue options. They go from not even being able to say they can stand up for themself in one instance to suddenly navigating rather intensely flirtatious situations. Talk about whiplash! More divergent dialogue options would have made more sense and let us consistently roleplay as either the naive romantic novice or the suave natural  or maybe even a character who had a shred of dating experience. As it is, these romances escalate far too quickly; if I were in their very inexperienced shoes, the way they go about approaching their partners' problems and romantic gestures would only make sense if they had far more disastrous outcomes.Sometimes Friendship Is BestThings get even weirder in the beach town when weapon-people start going missing, so naturally, you delve into the dunj only to find them and, of course, date them. By typical dating sim standards, romance is exceptionally quick and easy in Boyfriend Dungeon. Since theyre almost all in your debt for your heroic rescue efforts youre not starting from the point of having to win anyones favor  youre choosing who to reject, if you decide to deny anyone  so already were cutting right to the chase and skipping the introductory phase we see in games like Hatoful Boyfriend and Hakuoki. Every weapon-person has six levels of romance, each with a corresponding date encounter, which increase as you gain experience with the weapons in the dunj by slaying enemies. The first is a surface-level and often heavily flirtatious introduction; the second is where you choose if youre keeping it friendly or going for a more intimate relationship  and you'll usually get another chance at the third level to romance if you denied their first advance. Theres just not enough time to get to know your date before having to decide to engage romantically. There are quick interactions with the weapon-people while exploring the dungeons at special rest spots, but their reactions don't change as your relationship grows. A cold character that warms up to you can suddenly be aloof when you get back to the rest spot in the dunj. It's fine, and they do provide some nice context for the characters' thoughts on random subjects, but they're not substitutes for more meaningful time with each character while first establishing a romance. The rules of when you have to choose romance aren't clear either, so I went along with being flirtatious with everyone at first out of worry I'd miss something. For others like me who prefer one romance at a time, it may be a bit overwhelming and uncomfortable to accidentally find yourself juggling romantic involvements with five of the seven weapon people. I was especially unhappy knowing certain characters I was romancing probably wouldn't be cool with me making lifelong plans with others, but there were never any consequences for those unfaithful actions. (Which is also disappointing  shouldnt I be called out for my two-timing ways by the characters who would be uncomfortable with that?)There are options to soften the intensity of the relationship and occasionally disagree or go against something the character would like, but not a ton of opportunities in terms of moving back to friendship. After I found out a character was into a relationship style I personally didnt vibe with, I found it basically impossible to say thanks but no thanks. I could ignore her, but thatd also mean sacrificing the resolution to her story  and growing her abilities as a weapon. Which brings us to yet another problem: your affection level is the same as the weapons level in their skill tree. Weapon level progress stops at each level up and requires you to go on the next outing with the weapon-person before you can start earning XP toward the next. Progressing through skill trees is important because it unlocks bonuses and abilities specific to each weapon, like chain lightning that bounces between more targets for the electric blade, or amping up bleed duration that damages enemies over time. I wanted those upgrades, especially for my favorite weapons, but I just wasnt into some of them as characters.Those that do include an extra dash of magic like witchcraft and other fantastical themes benefited from it.The weapon-people vary in their preferred kind of relationship (poly, casual, monogamous), and the quality of their stories and personalities varies, too. With the exception of one of the more grounded characters stories, those whose stories push the boundaries of realism had the most interesting arcs. Sure, they're all weapon-people, but that magical part of them rarely plays into their personal stories. An extra dash of magic like witchcraft and other fantastical themes definitely enhanced their tales. Though their stories were, to an extent, relatable (I helped someone cope with death and another learn how to live a healthier lifestyle), I also got to see how a cat juggled its life indoors and on the streets. (Yes, you can ~romance~ this cat and it's maybe the best of Boyfriend Dungeons storylines  which is a bit of commentary on dating in and of itself when you think about it.) The limited number of interactions cut short my enjoyment of their paths, but they were enjoyable all the same.Some, however, were less than fun. One individual basically boiled down to being defined by their poorness and basically couldn't do much for themself. You'd think someone in college would understand that cooking for yourself is a way to save money, yet this character was oddly oblivious to that. And yet again, I didn't feel I knew them as a person well enough to enjoy being able to help them out of their occasional unfortunate situations. Another had serious family issues that were awkwardly made to be intensely goofy. For instance, the man's father would berate him for simple things like texting or, I don't know, the quality of his water. I liked his story otherwise, but it was an inconsistent experience. Again, you can skip engaging with characters you don't enjoy, but that also means you skip growing them as a weapon.Please Stop Talking to MeThe antagonist is Eric, a guy your cousin actually sets you up with for your first date. Eric is unabashedly rude and judgemental, so its not unreasonable that regardless of how you choose to approach him, youll only be able to treat him with disdain after a certain point. The problem with him as the villain is how youre forced to interact with him, which is the same way you interact with everyone else: you have to text him. And that gets weird, because shortly after your initial meeting, this guy goes out of his way to pester, stalk, and intimidate you. Even weirder, he owns a materials shop you can choose to go to too. If you don't answer the texts of an asshole, you don't get to finish the story. Yikes. I was made massively uncomfortable by responding to his creepy messages, so as soon as I realized I could just ignore him I did, and went about my characters summer. Only after completing the dungeons and finishing three character paths did I realize that you cant, actually, bypass his creepiness; if you don't answer the texts of an asshole, you don't get to finish the story. Yikes. This realization was genuinely off-putting for me. There is a warning at the beginning of Boyfriend Dungeon about potentially uncomfortable situations, but it didnt say Id have to take part in them. I know many may not have the same response to having to interact with someone who is actively trying to harm you, your friends, and others because of their romantic interest in you, but even still, the design fails there. Physical notes, additional challenges in the dunj, or myriad other threats would have been better than forcing us to give space  and by replying to Eric's messages and choosing to engage, that is giving space  in order for him to continue his gross ways. If it were me Id just block him and be done with it.I mightve felt differently if the ending put some kind of twist on things that made it make sense or had something to say about abusive relationships beyond ~it's bad,~ but no  the resolution with his story is frustrating and unsatisfying, too.The Only Swiping Here is of Swords, Daggers, and ClawsIt's a shame the dating structure and some large leaps in relationships are largely disappointing because there is actually a lot to like about Boyfriend Dungeon. The music everywhere is consistently great, with catchy original pop songs and fun weapon romance themes in the lyrics. It's a perfect mix for the unique kind of dungeon diving you'll do while still maintaining the fun beach town vibes. The character designs are nicely diverse, gender-inclusive, and of course, attractive (please just look at Seven and Valeria). Their weapon abilities are fun to learn, too. Each weapon has its own specialization: Rowan, the scythe, creates a black hole that draws enemies and eventually earns you a damage multiplier; Valeria, the dagger, is all about confusing enemies, letting you roll your way out of a sticky situation; Isaac, the estoc, grants a shield and parry ability. You can slightly tweak certain perks at select love levels, too. Again, they only go to level six, so their growth is limited. That said, I appreciate that the weapons offer different movement speeds too  the dagger, for instance, made me nimble while the scythe was slow and heavy. The combination of the weapon variety plus the random challenges of the procedurally generated dungeon floors made me happy to return to them early on and try my hand at fighting my way through odd monsters like flip phones and old boxy TVs. Dunj monsters are manifestations of a persons fears and, as one weapon in particular wont shut up about while fighting, the first is about fear of change. So having monsters be designed as old technology that gradually becomes more monstrous as you descend makes a fair amount of sense. With each run, I satisfyingly saw my HP increase and did noticeably more damage.As youd expect for a roguelite-style action game, it's easy to lose a run quickly early on. The only ways to leave a dungeon are by running out of health or by leaving through an elevator. Naturally, progression after each defeat or exit was made easier with XP spoils that went to my weapons and my character. With each run, I satisfyingly saw my HP increase and did noticeably more damage.I enjoyed learning each weapon and appreciated that I could change which weapon I had equipped between each floor. If I had maxed out a weapon's level and needed to go on a date to move on, I could then switch to another and work on their level. That said, there are only about 12 or 13 floors depending on the dungeon, counting a mini-boss on the way down. They're fun to get through, but it's a bummer there isn't at least one more to play. The two dungeons get a little stale if you aim to complete everything Boyfriend Dungeon has to offer.By the time I had maxed out two weapons, I already completed the available dungeons. There is a double XP bonus for the remaining weapons after completing the first, but the lack of enemy variety meant all my interest had to come from how weapons played differently. And for the weapons I didn't like playing with  and if I didn't like their characters story either  it was just getting through it for the sake of doing so. (Normally I'd skip character paths I don't enjoy, but for the sake of this review, I wanted to see all the storylines through. Finding everything and completing all paths took about 12 hours.)There are other ways to dish out damage: Zines give you the power to toss fireballs, summon a bug ally, or even place a cute little turret to help do damage. Zines have to be crafted, and their recipes are randomly given out as you explore the dunj. You can also make gifts using a simple crafting system to give to romance partners and increase their experience faster. There are also clothes you can make to deal bonus damage, a slew of other bonuses, or even unlock alternate music. Running back through the dungeons to try and find all the recipes did give them a little incentive of extra replayability. Some of the Zine powers do unfortunately introduce gameplay bugs, though, like getting destroyed by your own weapon's power or getting stuck behind walls. Recipe hunting was my main motivation toward the end as I finished up the remaining character stories quickly. I was glad to focus on something other than their problems and the awkward romantic interactions I accidentally got myself into. Also, it seems that the weapon you beat the replayable final battle with sort of gets the last word in with you, almost cementing them as your final ~choice.~ Almost. The messiness of dating everyone at once meant I didn't really feel all that close to anyone  if anything, I just felt a little guilty. Boyfriend Dungeon could have been a cool combat-heavy spin on the dating sim genre, but its uncomfortable forced interactions with the villain, inconsistent dialogue options, and limiting dating structure make it a disappointment. The fun weapons deserve more to cut and destroy and we deserve more time to decide whether or not we want to jump into a romance  or dump it.", "date": "Aug. 14, 2021,"}