{"name": "SpongeBob SquarePants: The Cosmic Shake", "name_review": "SpongeBob SquarePants: The Cosmic Shake Review", "ref": "https://me.ign.com/en/spongebob-squarepants-the-cosmic-shake/204900/review/spongebob-squarepants-the-cosmic-shake-review", "text": "Whether Im enjoying my favorite memes or going back to rewatch one of the only cartoons I still legitimately laugh at as an adult, its hard to understate SpongeBob SquarePants influence on my life. Through it all, the porous goofball Ive known for years feels like the perfect mascot for an over-the-top, cartoonish platformer. While 2003s SpongeBob SquarePants: Battle for Bikini Bottom proved it could be done, weve been in dire need of a modern take on that idea starring everyones favorite fry cook. And yet, like a collapsing Squidward Souffle, SpongeBob SquarePants: The Cosmic Shake dried up my optimism the more I played: its merely a thin, by-the-numbers sequel to the 20-year-old Bikini Bottom rather than the ground-up redesign that absorbs the progress genre heroes like Mario or Ratchet and Clank have made in the decades since that we deserve. So although Cosmic Shake does benefit from the quirky SpongeBob characters and their world, as a platformer its a terribly bland journey that feels painfully frozen in time even as the fans of the show have continued to age (also painfully).As Ive come to expect from this delightful sponge, the story begins when he makes a series of extremely ill-advised decisions which cause the very fabric of Bikini Bottom to be torn apart at the seams. Determined to put things right, SpongeBob and a newly transformed balloon version of Patrick begin hopping through portals and fighting samey jelly monsters in search of their friends. What little plot follows is basically just a thinly veiled excuse to revisit memorable SpongeBob episodes, whether youre running around the prehistoric version of Bikini Bottom or the creepy depths of Rock Bottom, which is a nice trip down memory lane but not exactly an original or memorable SpongeBob tale that can stand on its own.What we said about SpongeBob SquarePants: Battle for Bikini Bottom - RehydratedSpongeBob SquarePants: Battle for Bikini Bottom - Rehydrated makes an argument that, if youre going to remake something beloved, its not worth taking any half-measures. Rehydrateds revisit of the iconic SpongeBob platformer often does just that. Rather than addressing any of the real issues with Battle for Bikini Bottom that could have been tweaked without ruining the spirit of the original, it leaves history intact at the cost of making this a better game  and its problems have only become more noticeable with age and increased competition. There are bright spots that remain fun almost two decades later, and there are pops of ingenuity in its reworking, but it does little to stand alongside the best, or even the pretty good, platformer remakes and remasters weve seen this generation. - Jonathon Dornbush, June 22, 2020Score: 5Read the full SpongeBob SquarePants: Battle for Bikini Bottom - Rehydrated review.That nostalgic indulgence is helped greatly by the appearance of so many recognizable characters  voiced by their original voice actors  including SpongeBob, Patrick, Pearl, The Flying Dutchman, and Mr. Krabs, most of whom have more than a few amusing lines or gags that theyre a part of. I got a chuckle out of seeing Mr. Krabs as a western bandito or Pearl as a medieval fantasy princess, and the resulting hijinks felt very much like it was straight out of a long-lost episode of the show. Similarly, all the realms you visit along the way are such colorful and vibrantly cartoonish reimaginings of the world of SpongeBob and friends. Its even got an amazing loading screen where that classic French voice says one hour later, and those way-too-detailed closeup images of characters that gross you out, both of which are fantastic nods to the show.It's shocking how little the formula has been changed.Thats what makes it a massive bummer that Cosmic Shake falls so woefully short when it comes to actual gameplay. Its been almost 20 years since the release of SpongeBob SquarePants: Battle for Bikini Bottom  and just over two since the Rehydrated remaster reminded us of how poorly that games mechanics have aged  and its shocking how little that formula has evolved for this followup. In one of the dullest platformers in recent memory, Cosmic Shake serves up a recipe thats almost identical to that of its predecessor and had me nodding off as I played. Dreadfully simplistic jumping puzzles and combat against the same handful of enemies who posed absolutely no challenge wore thin quickly. Sure, you can double-jump, ground pound, glide across gaps using a pizza box, attack with your bubble wand, and sometimes activate context-sensitive prompts to do special things like karate kick enemies or swing on a fishing line, but that toolbox is extremely light and never puts you into situations  mandatory or optional  that require a mastery over any of these skills. After the first few hours of its 10-hour campaign, Id seen just about all the tricks up Cosmic Shakes sleeves and had to press on through humdrum platforming and combat ad nauseum.Every level has you jump through some metaphorical and literal hoops, broken up by waves of enemies that can easily be swatted away in seconds before going back to platforming. Variety, both in combat and in the puzzles that the platforming offers, is a major pain point, and even as youre traveling through a pirate-themed realm or a Hollywood movie set, youre fighting the same pushover purple enemies or hopping on the same floating rectangles. Even when you do get a special sequence, like a chase scene atop a seahorse or an extremely brief stealth section, its either incredibly short-lived or hardly different enough from the rest of the grind to keep things interesting. The only unique moments are at the end of each level when you fight a boss, like an evil Sandy the Squirrel in a Bruce Lee outfit, though even these highlights arent breaking any new ground in terms of gameplay  they just feel loads better than the rest of the boring trek.Its not that the controls or ideas in Cosmic Shake are poorly implemented, but that they havent learned a thing from practically any modern-day platformers that are far more interesting. For example, you dont get any of the highly entertaining gymnastic platforming feats or unique and silly combat options youd find in Psychonauts 2  a game that feels like a lot of its bones would have suited a SpongeBob platformer perfectly. Instead, it plays like every forgettable, middling platformer Ive played in the past 20 years, and that stunning lack of creativity in an underwater world thats known for its hilarious originality is a throbbing disappointment for the entirety. As a result, playing Cosmic Shake made me feel like I had put on a high-quality foam SpongeBob costume to attend a costume party, but was forced to perform excruciatingly dull chores while wearing it instead of goofing around; its amusing only in the charming disguise that accompanies the otherwise tedious experience.There are just so many better platformers out there already, even for kids.I understand that Cosmic Shake was almost certainly designed with children in mind and Im sure a kid who hasnt played a lot of better games would enjoy it just fine, but even so, I cant imagine any of the children I know enjoying this as much as they would Super Mario Odyssey, which does practically everything better. There are just so many great kid-friendly platformers out there already in 2023, and aside from having SpongeBob's face in it, Cosmic Shake gives you no reasons to play this one over the multitude of alternatives. I mean, you can only blissfully swat around the same three types of enemies or double-jump across identical gaps so many times before youre sick of it, regardless of your age. Aside from getting through the main story, Cosmic Shake does offer some optional collectathons to complete and even some side quests to go on. Most arent worth the trouble, like one side quest that has you cook Krabby Patties for hungry fish in a short minigame. That said, theres plenty of new content hiding in areas that can be revisited once youve gained new abilities, some of which hide interesting secrets and areas that can only be accessed later. Usually, though, they just lead to more of the same dull combat and rote platforming youll already be bored with.Note: A previous version of this article incorrectly stated that SpongeBob SquarePants is no longer airing new episodes. It has been corrected. SpongeBob SquarePants: The Cosmic Shake is a simple, unambitious platformer that pales in comparison to its peers in every way besides all the charm and humor it borrows from the iconic show. Whether its the incredibly basic jumping and swinging that becomes irksomely repetitive within minutes, or the humdrum combat that has you mopping up the same handful of enemies hundreds of times without anything to meaningfully differentiate the first battle from the last, Cosmic Shake badly lacks the imagination and creativity for which the show is known. The original casts voice performances and silly gags are certainly a highlight, but if you were hoping for something akin to Super Mario Odyssey in a pineapple under the sea, sadly this falls far short.", "date": "Jan. 30, 2023,"}