{"name": "Cris Tales", "name_review": "Cris Tales Review", "ref": "https://me.ign.com/en/cris-tales/187483/review/cris-tales-review", "text": "Lets face it: time travel is ridiculous and doesnt make a lick of sense. But its precisely because it makes no sense that its a perfect match for an over-the-top fantasy JRPG, and Cris Tales blends that nonsense smoothie to fantastic effect. Manipulating the past, present, and future to solve puzzles, defeat enemies, and change destinies is absolutely awesome when it works. Unfortunately, when it comes to Cris Tales repetitive turn-based combat, I felt more like I was trapped in the continuums most boring time loop. Even so, the timeless story, quirky characters, and effortless charm of Cris Tales still managed to make this exaggerated anime adventure a mostly fun ride.Cris Tales otherworldly fantasy setting could have been taken straight out of a childrens story book  its filled with talking frogs, weird robot thingies, and time mages that make casual use of their awesome power, which no one seems at all concerned or impressed by. Everything about the world is delightfully strange, from the fact that people use marbles as currency, to the strange Mother Superior witches that exist in every town to help raise the children or something. Youll travel through monster-infested salt mines, visit a city located inside an active volcano, and sail around in a boat thats made out of a giant metal womans shoe. Its one of the weirdest settings of all time and yet everything just had me nodding along like, Well, yeah, of course I need to retrofit my shoe-boat with metal plating so it can surf through lava. Who hasnt had to do that?It helps that the cartoonish, anime art style is brimming with life and personality, which makes traveling this fantasy world a complete delight. You can spend a lot of time just soaking in the awesome aesthetic of Cris Tales world, whether thats through the unique townsfolk you meet, the colorful environments around them, or the bizarre enemies you fight, like a giant, creepy multi-armed robot or a sentient blob of water. That said, there are some performance issues like framerate stuttering during combat and cutscenes that can get in the way of its good looks, but nothing bad enough to seriously hinder my enjoyment.The main character, Crisbell, is your typical bright-eyed, innocent, and unflappably optimistic protagonist who goes around doing good deeds without a second thought as to why she has to be the one to solve everyones problems. Along the way she meets an immortal child time mage, an anime robot, and some lady in a hoodie who attacks by pulling random weapons out of a bottomless bag like a murderous Mary Poppins. The cast is universally awesome. That goes for the main characters that you spend most of your time with all the way down to the tiniest supporting roles who are also given their time to shine. I really respected just how much Cris Tales makes use of all of its characters and never forgets about them, right up until the storys final moments (even though Im awful at remembering names and found myself shouting WHO? when my party brought up a character I hadnt seen in 20 hours).From the main characters to the tiniest supporting roles, the cast is universally awesome.The story itself isnt the most original or surprising in the world  my housemates and I all independently predicted the ending after playing only an hour of its 40+ hour campaign  but its competently told and well-written for the most part. Saving the world and fighting in the name of friendship and family is a cliche, but one that Cris Tales wears proudly. The story is helped along by voice performances that are mostly adequate and occasionally exceptional, as well as some genuinely rewarding player decisions that let you have a real and lasting impact on the world and its characters. That said, this tale does lose a lot of steam toward the end by padding itself out with return visits to previously explored areas that drag on too long, especially considering the final payoff isnt particularly inspired.If Cris Tales has one stand out feature though, its the incredibly well done and unique use of time travel and time manipulation that sits at the center of everything you do. Because you play as a time mage, Cris Tales involves a lot of time-based shenanigans, both as a plot device and as a gameplay hook. In fact, in many areas the screen itself is split into three sections to simultaneously show the past, present, and future of that location, each of which can be visited and interacted with to complete puzzles and gain a greater understanding of the world and its characters. At one point, I found a struggling artist in the present and saw that in the future hed turned to a life of crime. After completing a quest for him to support his pursuit of the arts, I changed his future and could now see hed end up as a successful musician in the years ahead.Seeing your actions have a direct impact on the future is massively rewarding and can have an enormous effect on the world. In one city, I noticed that an area had the grim fate of eventually becoming submerged underwater. But over the course of an entirely optional sidequest I saved someones life who vowed to fix the citys flooding problems, which changed that outcome and opened up new ways for me to interact with the location. Seeing that direct cause and effect so quickly makes Cris Tales side quests stand out from your typical RPG, and moments like this can be some of its best when they come together well.Cris Tales calls itself a love letter to classic JRPGs, and it plays like one through and through, in ways both good and bad. Its got the larger than life party of characters and a story that grows from humble beginnings to an epic struggle on a cosmic scale, but its also got some of the uglier traditional JRPG mechanics I could have done without, like static save points and no autosaves. Look, I get it. Tradition is tradition, and even blockbuster JRPGs like Persona 5 have largely stuck to their guns on this one, but that doesnt make it any less frustrating. Why cant I just save without having to run halfway across town? Does anyone actually enjoy having to repeat an entire section of a dungeon because the boss kills you far away from a save point? Or worse yet, because the game crashed and there was no autosave to come to your rescue?For a game about time travel, Cris Tales sure likes to waste a lot of yours.For a game about time travel, Cris Tales sure likes to waste a lot of yours, and theres no better example of that than your frog friend, Matias. He fills the JRPG role of the animal mascot/wise guide, and hes necessary to complete most time-manipulation puzzles. Frustratingly, Matias hops along behind you at the slowest pace possible, and attempting to time travel before hes caught up with you results in an obnoxious pop-up window reminding you that you should wait for your frog to be nearby. If youre running across an area, it can take 10-15 entire seconds for this green lump to catch up with you, which I discovered is exactly enough time to curse his name and wish an untimely end to his entire bloodline. This issue came up way more often than you might expect and continued to bother me the whole way through.Time and Time AgainBut while the time travel mechanics are otherwise a joy when exploring the world, how theyve been implemented into Cris Tales bland, repetitive turn-based combat is far less exciting. As a longtime RPG nerd, I usually love turn-based combat and random encounters, but this combat system is mostly tedious and oftentimes just downright sloppy. Early on in the adventure youre introduced to some really unique concepts that make clever use of Crisbells ability to manipulate time. For example, in an early boss encounter you have to attack a heavily armored character with water attacks in the present, then send them into the future where their armor has rusted away due to prolonged water damage, which gives you an opening to attack. In another encounter, you send an enemy into the past, then hit them with a poison attack before bringing them back into the present, which applies the damage-over-time effect all at once with devastating results.You might think these early examples would be just a small sampling of all the interesting ways one might manipulate time to their advantage, but in reality this is about as far as those mechanics ever go. After the first handful of tutorial encounters, youll have experienced nearly all the tricks in the book and their use thereafter becomes a matter of repeating them to painfully monotonous effect with very few twists and turns along the way. Its such a massive missed opportunity compared to how well time travel is used outside of combat.Even if you do enjoy the few overused time manipulation tricks that combat offers, taking advantage of them is rarely the best way to get through encounters anyway. Sure, I could apply burn to an enemy, then throw them into the future where theyre torched to a crisp, but why would I do that when I could just one-shot them with an elemental attack instead? It usually takes multiple steps to make use of time travel in combat as you combine different effects like this, but the payoffs dont actually reward the extra effort when you could have just been attacking instead. As a result, I only ended up using it in rare cases where it made sense or a particular fight demanded it. Combat recycles time travel tricks, enemies, and even bosses.Combat encounters dont just repeat the same time travel tricks either, they also reuse the same few enemy types. Simple enemies like wolves and slimes are just given a fresh coat of paint or an elemental remix in each area and thrown in your path time and time again. Combine that with reused time manipulation gimmicks and frequent random encounters and youve got a recipe for one of the more mindlessly grindy JRPGs Ive played in a long while.Sadly, the bosses are also repetitive and drawn out, potentially even more so. Where early on in the adventure youre treated to some interesting boss fights that serve as rewarding finales for each dungeon, the back half of the journey recycles those encounters multiple times with bigger health bars and damage numbers. Some of these fights can drag on for 20 minutes of attacking and healing while slowly chipping away at a health bar in a mind-numbingly boring and low-stakes battle of attrition.This pile of missteps is an unfortunate miss because the world outside of Cris Tales battles is genuinely lovely, but you spend so much of your time in combat that its shortcomings are felt constantly. By the time I reached the end credits after almost 50 hours, I was glad to be done with its bland battle system, which is a shame when I was still enjoying the story itself. Cris Tales tells a charming JRPG tale in a gorgeous and weird world, but it's hobbled by incredibly monotonous combat. Its battles undoubtedly overstay their welcome, but this unique odyssey still manages to shine through them a bit thanks to its style, characters, and the inspired (non-combat) time travel mechanics that make it so memorable.", "date": "July 24, 2021,"}