{"name": "Dead Space", "name_review": "Dead Space Review", "ref": "https://me.ign.com/en/dead-space-4/204800/review/dead-space-review", "text": "Never mind the numerous necromorphs, the tortured torsos sprouting out of walls, or the terrifyingly towering space sphincter  the thing I was most scared of going into the Dead Space remake is that it wouldn't live up to my fond memories of the fantastically horrific 2008 original. After just over 12 hours spent stalking through the revitalized USG Ishimura Im happy to report that of the many things to legitimately fear about this haunted space hulk, that was not one of them. This new Dead Space enhances the original in almost every way, using a Plasma Cutter to drop its ugliest appendages on the cutting room floor while preserving the essence of what made its distinctly dismemberment-heavy shooting so special, and grafting on welcome new character details in order to present its creepy sci-fi horror story in its very best light  and its most intimidating shadows. Dead Space (PS5) . . 245.00 Buy Now  If you missed it the first time around, Dead Space takes the action-oriented brand of survival horror established by Resident Evil 4, evolves the combat with a combination of gunplay and the ability to throw objects with Kinesis and temporarily slow enemies down with a Stasis power, and forces you to unlearn everything you know about killing zombies  its hordes of agitated mutants must be blasted limb from limb as opposed to being instantly dropped with a headshot. It sets its strategic brand of slaughter onboard a doomed spaceship that seems straight out of Event Horizon, and focuses on the determined plight of engineer Isaac Clarke and his increasingly disturbing search for his scientist wife Nicole. Although it spawned sequels, comic books, and even a spiritual successor in the form of 2022s The Callisto Protocol, in my mind nothing has come close to exceeding Isaacs first heavy footsteps onto the deck of the Ishimura  at least until now. Developer Motive Studio has made some major renovations to Dead Spaces house of horrors, and boy do I love what they've done with the place. For one, it looks amazing: the supreme level of detail on Isaacs instantly recognizable engineering suit alone makes that of the original look like a cheap fabric onesie picked up from the bottom shelf in a costume shop. Our ominous spaceship surroundings are made to feel substantially more spine-chilling thanks to realistically weathered steel surfaces and walls overrun with putridly pubescent levels of pus-filled pimples, and impressively moody lighting highlights the enhanced environmental detail while keeping plenty of corners cloaked in shadow  and us in the dark in terms of what might be lurking in them. Boy do I love what they've done with the place. Not only does the Ishimura look more striking than ever before, its also been restructured to encourage more exploration. Although Isaacs initial arrival in the hangar and flight deck very closely mirrors the layout of the original, its not long until you start to notice some substantial differences. For starters, you can now shuttle freely back and forth between the tram stations connecting all the different sections of the Ishimura (once youve unlocked them), and you can also travel between certain areas on foot via new corridors like those that connect the flight deck to the medical deck, or indeed off your feet in other sections. A spectacular new zero-gravity detour that takes you from the hangar bay to engineering is just one area that takes advantage of far more liberating flight controls that allow you to manually steer Isaac through space, as opposed to beaming him in rigid straight lines from surface to surface. The benefit of this more interconnected Ishimura is twofold, since not only does it engender a far greater sense of place than the more compartmentalised original, but it also allows for backtracking to access previously locked doors as Isaacs security level increases over the course of the journey, giving you the opportunity to discover weapon upgrade schematics and various other treasures and making progression feel a bit like a more murder-heavy Metroid. Additionally, the storage rooms in the original game that could only be accessed by spending a precious power node are thankfully no more; instead, gaining access to them requires a bit of enjoyable environmental puzzle solving, like finding the right angle through a shattered window in order to disable a doors locking mechanism with a pinpoint shot. Ship of Ghouls An equal level of accuracy is demanded by Dead Spaces combat, too, which remains focussed on literally disarming (and/or dislegging) each snarling flesh golem rather than wasting ammo on their vestigial, brainless heads or spongey torsos. Enemy types resemble the same gaggle of ghouls that seem to have been plucked right off John Carpenters Pinterest board, but there have been a few welcome tweaks made to the variety of threats you have to encounter. The acid-vomiting variations of the basic spike-handed Slasher seem to be far more common than they were in the original, and they kept me on my toes even after Id sheared off their legs from a seemingly safe distance  thankfully Isaac is considerably more nimble than he used to be. Meanwhile the hyper-mobile Twitcher types seem far more frenetic than before, and really put my aiming ability and Stasis reserves to the test. Beyond that, enemies are literally dripping with detailed slime and entrails, but that isnt just disgusting eye candy. Each necromorph now has several layers of flesh and bone to blast away, not only ratcheting up the gore but also giving you a clear visual indication of how close you are to lopping off a limb, which is extremely handy when youre trying to prioritise a roomful of twisted targets. Enemy types resemble the same gaggle of ghouls that seem to have been plucked right off John Carpenter's Pinterest board. Dead Space also finds creative new ways to keep tension levels high, often via the cunning use of the new circuit breakers that force you to divert power between certain interactive elements of the environment, like elevators and gravity control systems, in order to complete a mission objective. At one junction box early on I opted to channel power to a maintenance storage room door But in doing so I had to sacrifice the lighting system, meaning my journey back out of the area was illuminated solely by the narrow beam of torchlight on Isaacs Plasma Cutter, making for a considerably more panic-inducing trip as each necromorph flashed into my restricted field of view. Conversely, were given a few more objects in our surroundings in order to even the often overwhelming odds, and in addition to explosive canisters and spikes to hurl with extremely satisfying kinesis powers, there are also Stasis canisters that can detonate with wide areas of effect  plunging a group of enemies into temporary slow-motion and giving you a precious moment to decide whether to stay and shoot their legs off or use your own legs to bolt for the nearest exit. (These canisters were previously introduced in Dead Space 2.) What We Said About Dead Space (2008) Call it science fiction survival horror, but Dead Space does the genre proud with an engaging story; action that's tense, fast-paced and extremely violent; as well as atmospheric qualities that will get under your skin and make you jump. It may be a newcomer, but the seeds of an incredible franchise have been sown, and EA's in a great position to reap a phenomenal franchise full of scares. If you like survival horror, action or sci-fi, Dead Space needs to be on your radar.  Jeff Haynes, October 28, 2008 Score: 8.7 Read the full Dead Space (2008) review Throughout the tension-filled adventure, Motive Studio has kept Dead Spaces best moments largely intact while dramatically overhauling and paring back its weaker scenes. The first fight against a regenerating hunter that takes place in a cryogenic chamber plays out in the same intense, close-quarters style as it did previously, because that brilliantly pulse-raising encounter is just as effective now as it was 15 years ago. By contrast, the much-maligned asteroid-blasting sequence in the storys first half has been completely discarded and dramatically redone: instead of being stuck in a gunners seat struggling to fend off an asteroid shower with a pair of rapidly overheating cannons, we must now head out into space and calibrate the Ishimuras defense system by boosting between each cannon and manually calling each strike while hulking chunks of space rock spin past our noses towards the ships hull. It takes a sequence that was previously an aggravating chore and transforms it into an utterly exhilarating challenge, and its just one of a number of examples that greatly refine some of the original games rougher edges. It takes a sequence that was previously an aggravating chore and transforms it into an utterly exhilarating challenge. There are countless other comparatively minor but equally as welcome upgrades, too  like the way triggering an objective marker actually angles the camera towards a waypoint rather than unhelpfully towards your feet, or how you can buy multiples of any given item in the store at once instead of being forced into a series of individual transactions, or how you can now manipulate doors and control panels while holding up an object with kinesis  the latter of which gave me the option of carrying an explosive canister between rooms in anticipation of an ambush. I particularly like the way that weapons are now found in the world  typically during a story event  rather than simply being bought from the store for large sums of credits. Its smart to introduce a no money down test drive of Dead Spaces seven weapon types particularly for newcomers to the series, even though I admittedly settled on the same powered-up Plasma Cutter, Line Gun, and Force Gun combo that I employed in my multiple playthroughs of the original game. Upgrading those weapons this time around offers far more regular rewards. While the layout for each weapon upgrade tree remains similar in terms of interface, all of the pointless empty slots have been removed, meaning theres a tangible benefit for each and every power node you choose to invest, whether its a boost to clip capacity, reload speed, rate of fire, or damage. Additionally, there are special functions to unlock as you reach the ends of each upgrade path, such as incendiary rounds for the plasma cutter or an increase to the size of the Force Guns gravity-swirling alternate-fire mode, which bring much-needed buffs to your combat capabilities against the relentless necromorph waves in Dead Spaces dying hours. By the time Id reached the formidable final boss Id augmented my favourite suite of repurposed mining tools with enough extra power to bring a tear to the eye of Tim The Toolman Taylor. An Affair to Dismember The monsters in Dead Space arent the only things with more meat on their bones, and indeed Isaacs story has been fleshed out with satisfying new helpings of extra detail. Theres an entirely new multi-part side mission devoted to following a breadcrumb trail of holographic logs that reveal Nicoles most recent movements before the necromorph outbreak, along with other audio and text files that better explain the strained status of the couples relationship and the role that the mysterious church of Unitology played in Isaacs upbringing. As a result, I found that I was able to achieve a far deeper understanding of Isaacs wavering mental and emotional state this time around, and although the overall story arc is broadly the same as the original, this added context (along with some clever character tweaks) meant that its shocking final twist felt considerably more plausible. Isaac only speaks when spoken to, and doesn't deliver Nathan Drake-style quips. Dead Spaces main man is humanised even further in the remake by his ability to talk, rather than merely accept his crewmates orders without so much as a silent nod of acknowledgement like he did in the original. Actor Gunner Wright, who voiced Isaac in the Dead Space sequels, delivers a suitably stoic performance, and it makes Isaac feel like a far more influential figure when hes actively debating plans of attack with chief security officer Hammond, as opposed to just tackling each task like a deep space dogsbody. Thankfully, this is done sparingly: Isaac only speaks when spoken to, and doesnt deliver Nathan Drake-style quips while hes pruning limbs off space zombies like theyre the bloodiest kind of Bonsai tree. Instead, his moment-to-moment status is indicated by his heavy breathing and his hurried heartbeat heard in moments of eerie silence, exactly as it should be. With its stunningly redesigned spaceship, smartly and subtly enhanced story, and spectacularly reimagined action scenes, Motive Studio has managed to successfully breathe new life into the seminal sci-fi horror universe of Dead Space. Despite the fact Ive returned to the 2008 original several times over the years and found it to hold up fairly well, my latest journey through the darkened hallways of the USG Ishimura still managed to consistently surprise me and pull me into Isaacs plight far more than ever before, while still satisfying my desire to butcher undead astronauts with an enjoyable arsenal of wildly unsafe mining tools. Its clear that this superb Dead Space remake has been a labour of love for the team at Motive Studios, whove very carefully balanced innovation and renovation with preservation, and to their credit the end result is undoubtedly the definitive way to experience  or re-experience  one of the best survival horror shooters that Capcom never made.", "date": "Jan. 26, 2023,"}