{"name": "Old World", "name_review": "Old World Review", "ref": "https://me.ign.com/en/old-world/187112/review/old-world-review", "text": "We've seen plenty of 4X games that try to tackle the whole scope of human history, or our distant future among the stars. But Old World zooms in both on time and space, creating what is still a suitably epic story based exclusively around the ancient Mediterranean. In most ways, it benefits from this narrower focus, telling more intimate and less abstract stories about human society than its ancestors in the Civilization series could. At the same time, it manages to feel a fair bit more complicated and unwieldy in the process. At least at first.Old World is like a post-graduate program for players who already have a bachelor's degree in Sid Meier's Civilization. Despite covering a much smaller slice of history, it takes the Civ template as a starting point and layers a lot of new mechanics on top of it. And for the most part, they're pretty interesting twists. But they're often presented in ways that aren't immediately elegant or approachable. The most prominent of these is a system of named characters and aristocratic families which adds a sort of ~Crusader Kings Lite~ dynamic to your internal and international politics.One issue I always had with the Civilization series was that you sprinted through the ages so quickly that a lot of the relatable, human aspects of history could get lost in the mix. With each turn representing a year or a half-year in Old World, and leaders who grow old and die in realistic time frames, I really got to know and develop feelings for the various generals and court functionaries through scripted events and decisions. In my first game as the Macedonian Greeks, Alexander was blinded in a military training exercise as a child and went on to be a wise administrator rather than a ravenous conqueror. His grandson would forge a peace with the Gauls by marrying one of their tattooed warriors, but upset some of the more xenophobic nobles in the process.All in the FamilyThe events are generally well-written, making it easy to understand what's going on and what your options are. I also rarely felt like there was one choice that was clearly better than the others, which is a difficult balancing act to pull off. More than once, I was asked to pick between something that would benefit the whole nation but upset one or more of the major noble families, or show a little favoritism to keep a potential rival from getting too rebellious. Compared to Crusader Kings 3, these events are a bit simpler and less likely to have multiple steps, but have just as much potential to majorly affect your plans, like Alexander's little accident did.I was less thrilled by the consequences for failing to balance these internal concerns, though. The one time I did annoy one of my noble families enough to cause a revolt, they simply spawned a few units of rebels without much fanfare and I was able to put them down quite easily without much lasting harm. Some of that was luck  my best army was close to home rather than away on campaign. But it still felt a bit anticlimactic. It's more interesting thinking about how to prevent a revolt than it is to actually put one down. Since every city you found must be awarded to one of the four noble families, you have to think about whether you want to keep their power bases spread out and balkanized, or clustered so they're easier to pin down.This can be a lot to get your head around.This can be a lot to get your head around, and while there is a decent tutorial and a nested tooltip system, the UI didn't do me a lot of favors there. It likes to present information in a very dense, text-heavy way that seems afraid to cover up too much of the map, even when doing so could have given each detail some much needed breathing room and improved readability by a lot. I found myself constantly wishing for proper character screens like in Crusader Kings 2 and 3 instead of the cramped little frames we got. Making more use of icons, tabs, or collapsible info panes rather than assaulting us with so much plain text per tooltip would have gone a long way as well.The other major departure from Civilization is a resource called orders, which determines how much your entire civilization can do on a given turn. While individual units still have a movement range and action limit, you can run out of orders and not be able to use all of them. So a very spread-out empire without enough administrative buildings may find that they have to choose between giving orders to their troops at home to put down a rebellion or maneuvering against a rival in a foreign war.You often cant do it all, and deciding where to spend your attention and what to ignore is commonly an interesting decision. Overall, I liked the way this allowed smaller, ~tall~ empires to compete with sprawling and inefficient ones and modeled the difficulties of commanding a vast, ancient state. But it is also one more resource to juggle on top of all of the usual ones you'd expect in Civ, so at the same time, it contributes to the increased complexity I mentioned earlier.From Sea to Shining SeaWhile the menus may get overly busy, the map looks excellent and presents a lot of useful information at a glance. It might not be quite as high fidelity as Civ 6 or the upcoming Humankind, but the units and buildings are a bit less exaggerated and stylized, so I feel more like I'm looking at a real place and not at a game board. And that's a pretty big deal for me. On the other hand, the world generation looks a little bit off sometimes. I always seem to spawn near a bunch of volcanoes regardless of my settings, and the placement of eco regions like deserts can feel slightly arbitrary. But if you don't want to leave things up to chance, there are also handcrafted maps of the Mediterranean and the Middle East with historical start locations. The cities you place down on these rolling hills and sprawling plains will develop culturally through four different levels, which determines what you can build within their limits. Technology is still required to unlock certain things, but this serves as an interesting replacement for the idea of different ages or eras in other 4X games. Rather than progressing as an entire society, each of your cities might be at a different tier, with new colonies and outlying settlements lagging behind the urban core of the capital socially and technologically. I really liked the way this shaped my empire both in terms of visual variety and gameplay, allowing me to see a clear difference between pastoral farming areas and highly developed industrial ones.The wars you'll fight across these maps are definitely a highlight of Old World.The wars you'll fight across these maps are definitely a highlight of Old World. And unlike the other new features, they add a lot of depth without adding much complexity. Axemen have a cleave that can deal reduced damage to anyone close to their primary target. Simple. Cavalry get to attack again if they kill a unit. Spearmen are the only guys that can stop cavalry in their tracks, as mounted units normally ignore zone of control rules. None of these abilities require multiple paragraphs of text to understand or come with an armload of edge cases, but the possibilities for using them in concert are great, much like a game of chess. And the AI is generally much more capable of understanding and employing those ideas than anything I've seen in Civ 6, even after its years of patches.This is also where Old World's final new resource comes in: training. This is generated by military buildings and leaders, and is used both to train and rank up military units. Since unit promotions can use training in place of experience, you can choose to have a smaller, more elite army instead of a larger one. Training can also be spent on a turn-by-turn basis to get extra orders or force march a unit beyond their normal range, so I rarely ran out of ways to use it to squeeze out a bit of an extra advantage in combat if I had any to spare.To VictoryOld World's victory conditions are a bit on the underwhelming side. The main, proactive way to triumph is by completing a certain number of periodically offered objectives called Ambitions, which can be anything from capturing a certain number of enemy cities to building enough of a specific tile improvement. Failing this, you fall back to a scoring system based mostly on how many cities you have and how developed they are, which gives the win either to the first nation to reach a set number or whoever has the most when a certain number of turns is reached. I didn't mind this too much since the events and character interactions make Old World much more about the journey than the destination, but some more variety in goals to pursue wouldn't have hurt.On your way to the end, you can shape your society with some interesting and flavorful choices of laws and religious beliefs. Legal innovations are unlocked by technology and present a binary choice between two paths, such as Slavery vs Freedom or Monotheism vs Polytheism. Having a professional army will give a trickle of training points at all times, for instance, while a volunteer army will give you a larger number per turn while at war but none while at peace. In most cases, both choices are simple, compelling, and seem to do a pretty good job of simulating the historical ideas they are meant to represent. Old World can be vexing at first given how much more there is to manage on top of the usual 4X concerns weve gotten used to in the past decade or so, and the UI can feel cluttered as you're trying to piece it all together. But crucially, none of that added complexity comes without added rewards. The richness and human element that mortal characters and noble families bring is well worth coming to grips with all of the extra mechanics they introduce. Limiting your ability to give orders not only cuts down on long turn times in the late game, but opens up new strategies for playing tall or making the most of a less than great start position. Its a fine balancing act, and while Old World doesnt really become a ~Civ killer,~ I don't think it's trying to be. For those who have the patience to master it, it's a satisfying and deep 4X that could generate interesting stories for ages to come.", "date": "July 15, 2021,"}