{"name": "F1 2021", "name_review": "F1 2021 Review", "ref": "https://me.ign.com/en/f1-2021/186979/review/f1-2021-review", "text": "The world of F1 was set to be transformed this year, thanks to the prospect of radical new regulations and cars. However, like so many things during the pandemic, the changes were delayed until 2022  leaving F1 in a 12-month holding pattern. The real-life 2021 season seemed poised to offer few surprises, but the reality is that this season has so far been the most interesting championship in years.Funnily enough, its this backdrop that Codemasters has found itself competing against with its own fictional drama, introducing a fully-fledged story mode to F1 2021 for the first time in the series. The end result falls a little short of being as dramatic as the real thing, but its a well-executed and welcome new way to play that joins the series wide array of existing modes and makes for another excellent package  albeit one that needs a bit of extra content to bring it in line with the real-life 2021 season.Codemasters flirted with the concept of a story mode two years ago in F1 2019 with its brief, F2-themed intro and its curated set of late-race scenarios and first-person cutscenes. There, however, it was simply a short sequence of events bolted onto the beginning of the standard career experience. In F1 2021 the story is a standalone mode akin to The Journey from FIFA 17 to 19, or Fight Night Champions titular Champion Mode  although its never quite as sentimental as the former or as rousing as the latter.Get to the PointDubbed Braking Point, F1 2021s story focuses on a pair of very different drivers: rookie Aiden Jackson, a talented Brit who still has some key things to learn about the F1 paddock, and Casper Akkerman, a Dutch journeyman with an illustrious career thats mostly behind him. Depending on your choice, Jackson and Akkerman will race for one of five selectable teams  Williams, Haas, Alfa Romeo, Alpha Tauri, and Racing Point (which becomes Aston Martin during the story). These fictional drivers will unseat the real-life drivers in your choice of team, but the rest of the grid will be made up of actual F1 stars from the 2020 and 2021 seasons  except for one. Another driver from one of the four remaining selectable teams will be replaced with Codemasters resident F1 reptile, Devon Butler, who returns from his brief appearance as the antagonist at the beginning of F1 2019 for a slightly bigger role this time around.The equally happy face of man whose office door is safe for another day.Braking Point also ignores the COVID-19 crisis that had a huge impact on the 2020 and 2021 F1 seasons and includes races which never happened  which is a little incongruous if you dwell on it  but I did quite enjoy how it temporarily turns back the clock to revisit 2020s car and driver combinations. Watching Ricciardo change from Renault to McLaren and Renault change from Renault to Alpine reminded me a little of the multi-season nature of the fan favourite F1 Challenge '99-'02 (known as F1 Career Challenge on consoles). Coincidentally enough, that was actually the last F1 game published by EA before this one.Keep 'Em AutomatedSadly, you cant start the standard career modes a few seasons ago in the same way as Braking Point, but there have been a lot of other tweaks to these modes that I found welcome as a returning player of many years.The ability to run quick, automated practice programs from a selection of tabs is a great addition, since they really had become quite a grind. It feels far, far better than skipping them outright, sacrificing the resource points, and diving straight into qualifying  which Ive been tempted to do regularly over the last couple of years. I found the new option to leave the R&D to the AI useful also, even though the R&D system has had a nice facelift. Facility building can also be automated, but I stayed in charge of that to make sure the AI didnt blow all my cash before I had a chance to lure Danny Ric to my team a few seasons in.Building a fast car and letting Dan Ricciardo win a championship is officially my new hobby.F1 2021 also introduces a new Expert setting that allows you to really fine-tune the career experience to suit the pace you want to play at. You can still toggle assists on and calibrate the AI to your own needs, but selecting the Expert environment opens up a raft of options, including the severity of mechanical faults you might suffer, the rate at which you and the AI teams accumulate resource points and cash, and how damage is calculated. You can accelerate your rise to the pinnacle of F1 or make it incredibly, incredibly hard; its up to you.You can accelerate your rise to the pinnacle of F1 or make it incredibly, incredibly hard; it's up to you.Damage deserves an additional mention because its much more nuanced than ever before, which improves the racing by dialling up the consequences. Damage to your floor, barge boards, or side pods, for instance, will create drag and have a noticeable effect on your top speed. Tyre damage is more convincing, too; brush a wall too heavily and its possible for tyres to become completely delaminated, with the belt ripped from the sidewall.While the novelty has worn off slightly after bursting onto the scene in F1 2020, My Team is still a brilliant mode, and Codemasters has done well to prune some the ageing cutscenes that clashed with the fact youre actually the team owner (although there are still celebratory vignettes here that are at least five or six years old by now). The livery editing is very limited by modern standards, though, and itd be great if sponsor decals only vanished from your car if you chose not to re-sign them. As it stands, every time sponsor contracts expire you still have to go and manually place their decals back on your car. Its a weird annoyance considering everything else is so streamlined.F1 2021 also introduces a pair of brand new two-player career modes, where you can link up with a friend to play as either rivals or teammates (Contracts mode allows both players to independently sign up with the team of their choice, whilst co-op mode ensures your friend automatically follows you wherever you sign). Co-op in particular feels like the online extension of how I found myself playing splitscreen when it was added back to the series last year. Splitscreen has returned but its separate from the two-player career modes, which are online-based.Handling feels broadly similar to F1 2020 though the cars feel a little more responsive when moving laterally and are on more of a knifes edge when it comes to grabbing too much curb at the wrong moment. Bottom out on a curb, or simply unsettle the aero balance enough, and the rear will whip around quick smart, so F1 2021 demands an exact touch.F1 2021 features no classic cars for the first time in many years so I wont argue its the best-sounding F1 game to date without any V8s on deck. To be fair, however, there definitely has been some work on the sound this year, and the noticeably more prominent transmission whine adds a fine extra layer to the richness of the car audio.I do think it is the best-looking F1 game to date, however, and the enhancements here are across the board. The cars look excellent (particularly when carrying subtle racing damage), character models are much improved, and trackside detail is the most granular Ive seen. Off-track surfaces like grass have received a big leap in fidelity.On the topic of tracks, F1 2021 is missing several tracks it needed to be able to accurately simulate the 2021 season from the get-go. That said, Imola, Portimao, and the new Jeddah street circuit are reportedly coming free at some point this year. That the real sport can pivot faster than the video game is an unfortunate reality of game development, but F1 2021 currently falls some distance short of being able to properly represent this years season. F1 2021 is the best-looking and most customisable instalment of the long-running Codemasters series to date, and the ability to tinker under the hood of the core career experience and play co-op with a friend is very welcome. With the addition of Braking Point its also arguably the boldest F1 game so far. The characterisation is a little underdone and the E for Everyone approach means its quite an airbrushed take on the F1 world compared to Netflixs tense and profanity-laden Drive to Survive, but injecting a story mode into the F1 series was a risk well worth taking and Im certainly looking forward to more of it.", "date": "July 13, 2021,"}