{"name": "Scarlet Nexus", "name_review": "Scarlet Nexus Review", "ref": "https://me.ign.com/en/scarlet-nexus/186517/review/scarlet-nexus-review", "text": "The genre of Action-RPG is a big umbrella that covers everything from soulslikes to first-person stealth-action games like Deus Ex to isometric RPGs like Diablo, and many more. But even within that wide spectrum, theres nothing quite like Scarlet Nexus  a game that combines inspirations from fast-paced character-action games of the Devil May Cry and Bayonetta school with epic JRPGs the likes of the Persona and Tales of series. Its a surprisingly ambitious undertaking, and perhaps even more surprising is that Scarlet Nexus hits far more often than it misses.So when I say that Scarlet Nexus is an action RPG, calling it that doesnt really paint the full picture of what its about. Its moment-to-moment gameplay is a straight-up action game, through and through, like something youd expect out of Platinum Games  its completely linear levels are structured so that youre basically just moving from one closed-off battle to another while combat is fast, flashy, and reflex-driven.But the key difference between this and Platinums style is that Scarlet Nexus is just as focused on its story, worldbuilding, and character development as it is on combat; perhaps even more so in some regards. First off, its split up into two separate 20-hour campaigns that each follow the story of one of the two main characters: Yuito and Kasane. While their journeys do overlap from time to time these are, for all intents and purposes, two distinct and equally essential campaigns that you can play in either order, and completing them both is required to get a full understanding of Scarlet Nexuss story.Scarlet Nexus is just as focused on its story, worldbuilding, and character development as it is on combat.And its a story worth experiencing  one which takes place in a fascinating world where the vast majority of the population are gifted with powers of the mind. City streets are colored with augmented-reality advertisements, people are able to send messages directly to each others brains, and those with exceptional combat abilities are drafted into a Special Forces-like organization called the OSF (Others Suppression Force) to do battle against otherworldly monstrosities known as Others.Both Yuito and Kasane begin as newly minted members of the OSF and are placed onto two different platoons, each with their own squadmates and leaders; from that starting point, their journeys branch out in ways that have each character experiencing one side of a dense and complex plot full of conspiracies, ulterior motives, and surprising twists. Bandai Namco does an outstanding job of posing questions in one characters playthrough and then answering them in the other by providing added context that better explains what led to certain events in ways that lead to some really satisfying pay-offs.What really makes Scarlet Nexus special is the amount of care taken to develop its large supporting cast.While the overarching story is great, what really makes Scarlet Nexus special is the amount of care taken to develop its large supporting cast of eight characters who join Yuito and Kasanes parties. After most big missions, youre brought back to your hideout for a stand-by phase that gives you an opportunity to converse with your teammates, give them gifts (which they amusingly occasionally play with,) and trigger bond episodes that allow you to increase your bond level with each one. This is nothing super new to fans of the Mass Effect or Persona series, but whats interesting about the way its handled here in Scarlet Nexus is that the bond episodes are very often tied to whats happening in the main story, are entirely different depending on which campaign youre playing, and are not always about improving a relationship. Sometimes the interactions in these bond episodes are outright hostile, but the important thing is that you always learn something about the character and why they act the way they do, or something that better explains the actions they just took in the main story.Even though most of the characters in Scarlet Nexus do fall into very tropey anime archetypes (the childhood friend/romantic interest, the snooty elitist brat, the shy and soft-spoken girl, and so on) these bond episodes do a wonderful job of developing them, to a point where they wind up becoming more than just their tropes. By the end, even the ones that I rolled my eyes at initially  like the aforementioned snooty elitist prick, Shiden  became characters that I grew to really care about. While these scenes are rewards unto themselves, increasing your bond with a party member will also improve their special powers and open up more opportunities for them to help you in battle. Thats a nice extra incentive that also ties into the idea that your relationships with these characters are growing stronger. The story is helped by wonderful performances in both English and Japanese.The story is also helped by wonderful performances in both English and Japanese, with the ability to choose whichever one strikes your fancy from the main menu. While it wouldve been nice to have more animated cutscenes as opposed to the static storyboard animatics, its an understandable compromise considering the sheer mountain of dialogue there is in Scarlet Nexus. Psy-Kicking Some AssScarlet Nexus' biggest hurdle to overcome as a straight-up action game with a 40-hour, RPG-like story is making its combat engaging throughout that epic length. Remember, most character-action games only have to plan out around 10-12 hours worth of satisfying progression, so this is a rare thing to attempt. And while Scarlet Nexus does clear that hurdle, it definitely clips it on the way. Most character-action games only have to plan out around 10-12 hours' worth of satisfying progression.At a basic level, combat is a lot of fun. Both Yuito and Kasane have the Jedi-like power of psychokinesis which allows them to telekinetically grab objects and hurl them towards enemies, but they use different weapons, and thats enough to give them their own unique flavor in a fight. Yuito uses a sword with faster attacks and a supporting skill set that makes him better suited for close-range combat, while Kasane uses a handful of knives that she controls telekinetically. Shes a bit slower but well suited for mid-range combat, and her supporting skill set makes her a little trickier to handle than Yuito, but equally enjoyable.What really makes Scarlet Nexuss combat stand out is how the telekinetic moves flow with the weapon-based attacks. At any point of a weapon combo, you can press the right trigger to immediately hop back and throw an object, then follow that with a weapon attack that brings you right back into melee range. The result of the ease of transition between the two is a really exciting and smooth mix of long-range and close-range combat. And then there are the crazy environmental interactables that you can use, like grabbing a train with your mind and causing it to crash through a crowd of enemies, taking them all out in a single go.On top of that, youre able to borrow the abilities of your squadmates through the Struggle Arms System (SAS), which allows you to target key weaknesses of certain enemies or take advantage of specific status ailments, like when you use Hanabis pyrokinesis to ignite a group of enemies that have been doused with oil. When going up against tougher enemies, you really need to put it all together by mixing in regular attacks, psychokinetic attacks, and SAS abilities that target enemy weaknesses in order to succeed, which leads to some really satisfying fights that feel like youre firing on all cylinders. While the combat itself is highly dynamic... the enemies that you fight are not. The one place that Scarlet Nexus feels like it slips up on the fundamentals of combat is that targeting isnt the greatest. I sometimes found myself swinging at air despite feeling like my attack shouldve connected, but not often enough to become more than a little frustrating.A bigger issue is that while the combat itself is highly dynamic, with lots of different abilities and powers that can each be upgraded in meaningful ways that change how theyre used over the course of the campaign, the enemies that you fight are not. Theres just not enough variety among them to healthily sustain a game of this length, especially since so many of them are of the lock and key variety: once you figure out the right ability to use against them, every fight thereafter always plays out the same.I do wish there were more of them, but I have to at least shout out the fact that the visual design of the enemies we do have to battle against is fantastic. The Others are a fantastical mix of beauty and monstrosity, combining the organic and inorganic in wildly inventive ways that are always unsettling to look at. The result of the lack of mechanical variety is that by the end of Yuitos campaign, which is punctuated by multiple hours of very similar fights against very similar enemies, I was pretty exhausted from Scarlet Nexus combat and was not looking forward to immediately fighting through another one of a similar length (speaking strictly from a combat perspective). Fortunately, beating one campaign allows you to carry over your progress to the other, much like a New Game+. Not having to start from zero allowed me to blast through Kasanes combat encounters much faster and get to the story, which was what I was really interested in at that point.Deja VuIn contrast to the inventive enemy designs, Scarlet Nexus levels are very often visually drab  we see areas like a mostly empty construction yard, an abandoned subway, and a broken-down highway with nothing done to really make them feel distinct. They make up for it with some terrifically fun environmental interactables, like the aforementioned train in the underground subway, the crane in the construction yard, or the bus that you can ride along a highway, crashing through groups of Others as you go. However, once again, variety remains an issue for a game of this length. Thats exacerbated by the fact that youre regularly expected to travel through the same exact parts of the same exact levels, fighting the same or very similarly placed enemies. Yuito and Kasane at least get to visit a few unique locations that the other doesnt ever get to see, so there is some added variety between the two campaigns, but I still found myself walking through the same AR bands of yellow tape, cruising past the same group of Others, or working my way to the same rooftop far too often. Its understandable to take a look at Scarlet Nexus and write it off as just another anime game, but doing so would be a big mistake. This is an ambitious undertaking from Bandai Namco, one that attempts to blend the two disparate genres of character-action game and large-scale JRPG, and achieves an impressive level of success. Its combat and thin enemy variety dont hold up all the way to the end of the combined 40 hours of its dual campaigns, but its story and characters absolutely do, and make for a surprise breakout hit of 2021.", "date": "June 26, 2021,"}