{"name": "Guilty Gear Strive", "name_review": "Guilty Gear Strive Review", "ref": "https://me.ign.com/en/guilty-gear-strive/185608/review/guilty-gear-strive-review", "text": "Guilty Gear is arguably one of the most underappreciated fighting game series out there. I know this because Ive been guilty of underappreciating it myself. For one reason or another  maybe I just didnt think I was skilled enough to get good at them, or I just wasnt in the right headspace  I never really tried to learn one in depth. But when Guilty Gear Strive was announced, I made the determination that I would no longer let this be a blind spot in my fighting game knowledge, and rather than just dipping my toes in the water like I have for every other Guilty Gear game, with Strive I made the full, headfirst plunge. Well, after making the dive Im happy to report that I love Guilty Gear Strive. Its not without its share of faults and stumbles, but they pale in comparison to the gorgeous art, the electric soundtrack, the wildly inventive character designs, the stable netcode, and its balance of approachability and depth, each of which raise the bar for other 2D fighters to follow.Over seven games and multiple spinoffs spanning the last two decades, Guilty Gear has quietly amassed some of the densest lore throughout all of fighting games. If any kind of proof of this is needed, just take a look the seemingly never-ending in-game glossary of terms and figures, the timeline of events covering 1998 to 2187 (did you know that in 2009, India withdrew from the UN due to dissatisfaction with the UNs decision to ban all electronic devices?), and the correlation chart that covers every event and relationship formed from every game in the series. All this is to say that Guilty Gear Strive very much feels like a climax of everything that the series story has been building towards for all of these years, and its a story thats aimed squarely at those who are caught up on the long journeys of its core cast of characters. So if you dont know who That Man is, or his significance to Sol Badguy, chances are youre probably going to want to watch a recap video or two... or five. If you don't know who ~That Man~ is... You're probably going to want to watch a recap video or two... or five.And you really should put in that extra effort if youre not caught up, because once you understand who these characters are and the struggles that theyve gone through to get where theyre at in Strive, its story is actually pretty dang good  and its told in a way thats unique in the world of fighting games. Like the Xrd games, Strives story mode is entirely devoid of gameplay, and should be enjoyed much like a binge-watchable anime series. Its a bold decision to make a story mode in a video game that you dont play at all, but its one that I actually have a great deal of respect for. By focusing on just the story, Strive is able to avoid shoehorning in battles in places where they wouldnt naturally fit, and the result is a story mode that feels completely uncompromised by gameplay. A Fighters SolWhen you actually do get to play, it becomes obvious why Guilty Gear has always been one of the deepest and most complex fighting game series around. And while that complexity is one of the things that has made it so beloved, it has also traditionally made it one of the harder series to get into from a beginners perspective. Guilty Gear Strive, however, sets out to address that in a number of ways without compromising the heart of what makes Guilty Gear, Guilty Gear. First off, big-damage combos arent nearly as hard to pull off as they have been in the past. Even just comboing a simple slash, heavy slash, overdrive combo can yield a humongous chunk of damage. The tradeoff is that landing these big combos is a bit more difficult because you can no longer convert substantial damage off of quick light attacks. The universal gatling system of punches cancelling into kicks, which cancel into slashes, which cancel into heavy slashes, which cancel into dust attacks is no longer present in Strive. Instead, if you want that combo damage, youre going to have to find a way to land your beefier and slower attacks. It certainly creates a more deliberate pace and a more neutral-heavy style of gameplay, but I think its a great change that gives Strive its own unique feel and identity compared to other Guilty Gear games. And make no mistake, even despite that change in pace, this is still Guilty Gear, a series that throws many of the typical rules of fighting games out the window with unorthodox mechanics such as its signature Roman Cancels. Thats when you press three attack buttons to cancel the startup or recovery animations of nearly any attack at the cost of 50% of your tension meter. So for example, if you rush in with an unsafe move like, say, Sols Night Raid Vortex, you can use a Roman Cancel when its blocked to not only make yourself safe from punishment, but also leave yourself in a position to continue your offense. Or you could use a Roman Cancel to keep a combo going after Sols heavy slash, a move that normally isnt cancellable into anything else. RCs are a Swiss army knife of utility, and thats without even getting into the weeds of the differences between the red, blue, purple, and yellow varieties. Strives version of Roman Cancels mostly function the same as they always have, with the exception of the fact that they are now much more pronounced, with a giant clock counting down the remaining time left of the slow down, and their shockwave now sending opponents slowly upwards, making it easier to follow up with aerials. New to Strive also is the ability to add a short directional dash during the pause of a Roman Cancel, which opens up the doors to all sorts of combo options that would be otherwise impossible because your character wouldnt be in the right position to land the next attack. What it all boils down to is that Roman Cancels add a level of creativity to Guilty Gears combat that is nearly unprecedented in the realm of fighting games, and Strive iterates on the mechanic in thoughtful ways that make it feel fresh without ever messing too much with a great thing. Who Dares to Enter the MayhemStrives base roster of 15 characters is a great mix of longstanding veterans and returning fan favorites, bookended by two brand-new characters in Nagoriyuki and Giovanna. Nagoriyuki is one of the most interesting fighting game characters Ive played in quite some time, combining the two disparate archetypes of the slow, hulking beast and the fast, unpredictable pressure machine, tied together by unique transformation that can just as easily kill himself as it can the opponent. Basically, his walk speed is extraordinarily slow, he doesnt have a normal dash, and all of his regular moves hit extremely hard and from a long distance, but are exceptionally slow. However, hes got a super-fast command dash and his special moves come out fairly quickly, with the unique property of being able to cancel into each other as much as you want, making it very hard to be able to tell when his pressure is going to end. The catch is that whenever he uses these special moves he causes his blood gauge to rise, and once its full he enters his Blood Rage state which makes him even more powerful, but also even less mobile, and drains his life super quickly. The only way to leave the Blood Rage state is by waiting for the time to expire (draining about half your life in the process) or by using a deadly overdrive attack that can leave him extremely vulnerable if blocked. GIovanna, very much in contrast to Nagoriyuki, is a simple character with a simple gameplan: Get in your opponents face and never leave. Shes got really good normal attacks, an extremely fast dash that she can use to get in, tap your toes, and then smack your face with a roundhouse kick, a leaping cross-up split kick that leaves you at advantage on block, and absolutely ridiculous damage if she manages to catch you in close range. As someone whos traditionally struggled to find a character that really gelled with me in the Guilty Gear series, Gio stood out as someone that I immediately understood and felt comfortable with. Plus, shes got a dog. When looked at as a whole, 15 characters is not a ton, but considering how different they all are and the wide range of fighting styles that they cover, Strives roster feels bigger than it actually is. The returning roster all keep their general playstyles, but its awesome how they feel very much like all-new characters thanks to the new tools that theyve received  and the ones that have been taken away. Strides and Stumbles Its not a stretch to say that Guilty Gear Strive is the best-looking 2D fighting game theres ever been up to this point. ArcSystem Works has all but perfected the art of the 2D aesthetic using 3D models, and Guilty Gear Strive is quite simply its best showcase yet. Everything, from the smaller details like the way the sun rays hit and cast shadows on combatants, to the sheer amount of detail found in the backgrounds of each level, is astounding. Even when theyre just standing still, every character exudes personality in their idle animations, to say nothing of their actual movements and attacks. Its a shame that Strive has no insta-kill super moves like there have been in previous Guilty Gear games, because they would no doubt be true spectacles to behold. And then theres the soundtrack, which is bull**** blazing, as one might say. I think thats a good thing? Lets just say its a good thing. The vocals of the heavy rock soundtrack might not be for everyone, but fortunately, if youre more of a fan of previous Guilty Gear games soundtracks, you can spend in-game currency to fish up old songs from previous games and set those as your background music. And then there's the soundtrack, which is ~bull**** blazing,~ as one might say~All this said, not everything in Strive is a stride forward. Theres no combo challenge mode anymore, which used to be a great tool to get familiar with a new character; the arcade mode no longer has its own character-specific intro and ending cutscenes, opting instead to just give some quick dialogue before the first and last fight, and having the story branch slightly depending on whether you win or lose key matches; and the mission mode feels bloated with a bunch of super-simple and basic lessons that feel like theyd be better taught in a mode that doesnt force you to repeat the action five times. Still, the Mission Mode is worthy of praise, especially the later ones that introduce you to high-level fighting game concepts in ways that are easy to understand and give context to how theyd come up in an actual battle. Not to mention the character-specific matchup tips, like how to deal with Mays barrage of dolphins, Potemkins Hammer Fall, and Leos cross ups are incredibly helpful, and I wish more fighting games would include practice spaces like this. And finally, lets address the online lobby situation: Its not great. Theres definitely some charm to the 8-bit aesthetic, unlockable emotes, and customizable clothes you can equip to your avatar, but as something that you have to engage with at every level of online play, even for ranked play, it can be aggravating to deal with. But, its a blow that is softened by Strives actual netcode being stellar. All of my online matches with the review build have been pretty much flawless, and while the real test will be once the game is out in the wild, if my experience in the two open betas are any indication, Strives online play on a technical level is a giant step forward for ArcSys fighting games. Guilty Gear Strive is a milestone 2D fighting game that raises the bar for anime-like fighters in terms of its visuals, online netcode, and sheer creativity found in all aspects of its design. Its definitely a different flavor of Guilty Gear, with a heavier focus on fighting in the neutral and a slightly slowed down pace, but it maintains the series soul with absolutely wild character designs, flexible combo system, and a level of creativity both in its presentation and mechanics that is second to none in the genre.", "date": "June 8, 2021,"}