{"name": "That '90s Show: Season 1", "name_review": "That '90s Show: Season 1 Review", "ref": "https://me.ign.com/en/that-90s-show-season-1/204618/review/that-90s-show-season-1-review", "text": "That '90s Show is now streaming on Netflix. In the age of reboots, revivals, and sequels of beloved classic shows, That 70s Show  which aired from 1998 to 2006  has been given another revival and, unlike the failed attempt with That 80s Show, That 90s Show succeeds by continuing the story of the Foreman family in Point Place, Wisconsin, even if it does rely a little too heavily on its predecessor at times. Google Chromecast with Google TV 4 Media Streamer Watch the latest movies and TV shows in 4K HDR/Dolby Vision with the Google Chromecast with Google TV media streamer. . 249.00 See it  Set 15 years after the end of That 70s Show, That 90s Show finds Eric Foreman (Topher Grace) and Donna Pinciotti (Laura Prepon) living happily married in Chicago and parents to a young, awkward teenager named Leia (Callie Haverda). They visit Eric's parents  Kitty (Debra Jo Rupp) and Red (Kurtwood Smith)  in Point Place, Wisconsin for the Fourth of July before Eric and Leia go on their father-daughter space camp retreat. But after she bonds with the riot grrrl-next-door Gwen (Ashley Aufderheide) and her friends, Leia requests to spend the rest of the summer with her grandparents. Her new basement friends consist of grunge music lover Gwen; Gwens himbo half-brother Nate (Maxwell Acee Donovan); his controlling, witty girlfriend Nikki (Sam Morelos); the sarcastic realist Ozzie (Reyn Doi); and the attractive goofball Jay Kelso (Mace Coronel)  yes, the son of Michael (Ashton Kutcher) and Jackie Kelso (Mila Kunis). That 90s Show sticks to the same format and mood as the original series. The kids spend their summer doing random hijinks, from attending a rave to picking up free stuff from the Pennysaver to their hilarious, deep discussions while high. Leia is endearing as the wallflower  basically the girl version of her father as a teen. Nate and Nikki, like Michael Kelso and Jackie, are the shallow, incompatible couple. Ozzie is the queer Asian kid living in Wisconsin who is comparable to Fez (Wilmer Valderrama), who was also seen as an outsider. Gwen is very much the rebel like Erics best friend Steven Hyde (Danny Masterson). And Jay is a dopey version of Donna, the love interest. If the formula worked before, it should work again, right? To some extent, sure. The characters individually are comical  especially Ozzie, whose sardonic one-liners were amusing  but as a group, they lack the chemistry to believe in their relationship drama. Even the season finale, which ended on an emotional cliffhanger, felt flat and unearned. The show plays into the 90s well with its music and the subtle call outs to Glamour Shots, snap bands, Blockbuster, and even the movie Clerks  leading to a hilarious moment when Leia, who had never seen Clerks, makes up that its her favorite movie and that Kevin Smith was so sexy in that. Its also fun to see Red and Kitty adapt to the ever-changing society by being introduced to the internet. Kitty, at one point, believes that the government can hear everything through the computer. She whispers to it, I loved you on Arsenio, Bill  referencing the president of that time, Bill Clinton, on the 90s talk show The Arsenio Hall Show. The series truly works because of its connective tissue to the original with Kitty, Red, Fez, and the many cameos that show up. Fans of That 70s Show can expect many inside gags and Easter eggs, with the pilot episode especially completely stuffed with references. Itll definitely be a treat for those wondering what happened to the beloved characters minus Hyde (due to Mastersons legal troubles). Rupp, Smith, and Valderrama fall back into their roles as if no time had passed, with Valderrama stealing every scene hes in. Though it is delightful seeing familiar and some unexpected returning characters in the series, newcomers may not understand the inside jokes or the comedy. For example, the many cameos from Leo (70s icon Tommy Chong) made sense in That 70s Show, but some viewers today wont understand his role in this series as being anything other than a stoned hippie. The series follows the same format as the original, which works for the characters and their storylines. That 90s Show is at its best when the gags relate to the original series, especially with the high circle and dealing with Red and Kitty. But that is putting too much weight on the older cast members when the show should focus on the kids of the present day  or in this case, the kids of the 90s. That is not to say that, if given a second season, they cant improve on that aspect. The teen characters have the potential to be even better than their predecessors, but nepotism can only get you so far. Netflixs That 90s Show is a blast from the past of the 90s and of memories from That 70s Show. With funny moments filled with nostalgia, That 90s Show is charming and has a lot of potential. The series follows the same format as the original, which works for the characters and their storylines, but relies too heavily on the original cast  leaving little room for the new wave of talented teens to fully develop their relationships with each other.", "date": "Jan. 19, 2023,"}