{"name": "Pac-Man 99", "name_review": "Pac-Man 99 Review", "ref": "https://me.ign.com/en/pac-man-99/183767/review/pac-man-99-review", "text": "I'm a big fan of novel twists on old formulas, particularly new spins on classic games. Pac-Man CE DX, Pac-Man 256, and now Pac-Man 99 are all great examples of repackaging a legendary game with new ideas while retaining the feel of the original. Of the games I just mentioned, the large-scale multiplayer Pac-Man 99 is probably the weakest of the three, but thats a very high bar and doesn't mean it's not a lot of fun. 99 just doesn't offer much in the way of variety, and even if you pay to unlock the $30 DLC, the differences are constrained to cosmetics and don't have any effect on the gameplay. But when a match comes down to the wire, it's almost impossible not to have a smile on your face. Pac-Man 99, like Tetris 99 and Super Mario 35 (RIP), is a free download for Nintendo Online subscribers that shares a lot of the DNA of the previous ~battle royale~ free-to-play games on the Switch. You join a lobby with 98 other players and, after a few seconds, the round begins and... you play Pac-Man. At first it seems entirely normal: The power pellets, wafers (yes, that's the official name of the dots), ghosts and fruit are here, but now every gobbled ghost is sent to another players game in the form of a hollow Pac-Man. Bumping into one of them slows you down significantly, which is not ideal when youre trying to stay ahead of fast-moving ghosts. When there are a dozen or more of these line-art Pac-Men chomping at your heels things can get pretty hairy, but gobbling a power pellet melts all of these phantom Pacs instantly, freeing you up to continue your run. The wafers also serve a valuable new function, in that winding your way through the maze grants you a permanent speed bonus once you've eaten every wafer. You can stack these effects with each new level clear, which is a crucial part of survival when the match is down to its last 10 competitors. There are also two rows of small ghosts on either side of the maze, and eating them creates ghost trains, which you can then devour under the influence of a power pellet. It's not quite the same as the ghost trains of Pac-Man CE DX, but it's damn close, and its great to see each one sent off to a foes screen. I absolutely loved how Pac-Man 99 made me rethink my entire approach to this classic gameFinally, the fruits appear just under the spawn box for the ghosts once you've eaten enough wafers. Chomp one down, and the board resets: the pellets and wafers are back, and you start the process over again. The fruits appear long before you've eaten all the wafers, so resetting the board means you lose out on a speed bonus. However, there's another risk-reward element built into the fruits functionality: eating one destroys the cursed red Pac-Men. As the field winnows down to fewer and fewer players, a new red line-art Pac-Man appears  sometimes several at once. These foes cannot be eaten (a power pellet will just freeze them, not make them edible), and a single touch means game over. The only way to make them disappear is to eat the fruit. 98 Problems I absolutely loved how Pac-Man 99 made me rethink my entire approach to this classic game several times each match. I spend the first half of each match working hard to get my speed up as high as possible, and once the red Pac-Men join the fight I abandon my quest for speed and focus on survival. When there are five red Pac-Men chasing me, my goal goes from banking speed bonuses to eating just enough wafers to get the fruit to appear so I can clear the foul red demons, avoid the slowdown from the legions of hollow Pacs, and try to grab a power pellet to send a torrent of my own annoyances to my unsuspecting foes. All this pivoting of play style happens in seconds, sometimes several times, and makes the final stretch of each match as stressful as it is exhilarating. I still haven't won a match, but I've come in second place several times and can get to the top 10 more often than not. And that's it. That's the entirety of the free version of Pac-Man 99. There are no other mazes, no other modes, and no differences from the core game at all in the free version. That's where it falters: every single match plays out essentially the same once you figure it out. I didn't consult any guides while playing, so a lot of my personal joy came from unwrapping its many subtleties, slowly working to create an (almost) winning strategy. Super Mario 35, which I reviewed at launch, was way too World 1-1 heavy, but at least you had a good chance to see a different level once you cleared it. Not so with Pac-Man 99: the maze is the same each and every time. That's where it falters: every single match plays out essentially the same once you figure it out. With Pac-Man 99 being so new, I didn't have any trouble finding a match. The longest I waited for a new round to start was maybe 20 seconds, but matching with 98 other players takes only a few seconds. Frustratingly, I had several cases where I'd be waiting for a game and get kicked out for a network error. It happened fairly infrequently, but just enough for it to stick out in my mind. Thankfully I never experienced any sort of server disconnection during an actual match, so while it is annoying, it's not game-breaking. You can pay to unlock different skins and a few offline modes. The skins are all tributes to arcade days gone, and I love them in principle, but in practice I found them distracting. If you want to drop $2 to reskin the single Pac-Man 99 maze there are tons of options, or you can unlock everything for $30. I personally don't see the appeal: the offline modes don't offer anything particularly different than the battle royale mode. The CPU Battle pits you against CPU controlled players rather than actual humans, and Score Attack is just a contest to get the highest score possible. Blind Time Attack also uses the same maze the same enemies and the same rules, but you battle a countdown timer. You score certain combos (grab a fruit or eat all the ghosts on the board, for instance) and you get a little time back. And... that's it. Slight variations on the same game, and I didn't find any of them anything near the fun of Pac-Man 99. Pac-Man 99 is another smart multiplayer twist on a classic with fast-paced gameplay that requires on-the-fly strategy pivots and increasingly quick thinking as the field of competitors thins out. But once you lock into a winning style, there's nothing more to see. Even something as simple as changing up the maze structure at random would do wonders to keep Pac-Man 99 feeling fresher, longer, but here were trapped in the same maze for eternity.", "date": "April 15, 2021"}