{"name": "Balan Wonderworld", "name_review": "Balan Wonderworld Review", "ref": "https://me.ign.com/en/balan-wonderworld/183271/review/balan-wonderworld-review", "text": "Its sad to say, but Ive gotten used to disappointment when it comes to spiritual successors of iconic games made by their original creators. For every return as impressive as Bloodstained, there seems to be a far less successful attempt like Mighty No. 9. So, Im disappointed but not surprised to see that Balan Wonderworld, the latest 3D platformer from Sonic the Hedgehog co-creators Yuji Naka and Naoto Ohshima, is a fundamentally flawed shadow of its predecessors. Its character designs, cutscenes, and music are certainly charming, but charm alone isnt enough to make this half-baked platformer any less boring to actually play. When youre hopping around Balan Wonderworlds simultaneously imaginative yet bland stages, it doesnt necessarily feel like a total trainwreck. Some of its barebones obstacle courses can occasionally produce hints of what I might call fun, and its not much more than a total bore the rest of the time. But when you take Balan Wonderworld as a whole, it sinks lower than the rudimentary platforming that barely props it up. From its misguided one-button control scheme, to its haphazard transforming costume mechanic and the levels that use them, to the half-hearted Chao Garden-like hub world between them, it gets a lot wrong  and very little of what it gets right helps to balance the scales. This is usually the part where Id break down Balan Wonderworlds story for you, but theres not much to tell about the unexplained nonsense it calls a plot. You play as either a boy who goes from happily breakdancing to being super bummed out in record time, or a girl whose housemaids whisper about her behind her back for no apparent reason. Your choice means very little, though, because either way you are quickly abducted by a magical tophat man named Balan and dropped into a dream land full of weird birds and crystals or something? Its unclear, but thats all the setup youll get before it starts parading you through 12 different worlds (each with just two levels, a boss, and an extra level once you beat the story) that are each structured around another sad person, all of whom seem completely unrelated to anything thats going on. Ive enjoyed plenty of games with incomprehensible stories, but Balan Wonderworlds inanity is particularly disappointing when its animated cutscenes are so well made. Theyre full of life and energy, and can even tell a few genuinely entertaining bite-sized stories about each worlds subject. Cutscenes primarily play right before a boss to quickly introduce the person for that world and a problem they are facing  be it a boy trying to build a flying machine or a scuba diving girl whose dolphin friend maimed her and left her to die  but a second cutscene right after the boss then immediately resolves it (dont worry, she and the dolphin are cool now). That pacing not only makes each characters story feel disjointed from everything else, including your protagonist, it means the levels you play before meeting them are devoid of context. If the first cutscene had played at the start of the world, then maybe I would have connected with those characters as I played through their reference-filled levels, like a chess players world being littered with chess pieces. But by holding their whole story to the end, Balan Wonderworld becomes little more than a jumble of endearing but incoherent ideas. Control Chaos Regardless of its story, the festering rot at the heart of Balan Wonderworld is the inexplicable decision to make it a one-button game. Apart from using the joystick to move and the shoulder buttons to swap between ability-altering costumes, nearly every other button on the controller does the same thing. That concept is taken laughably too far by making them the same in the menus too, forcing you to scroll to specific back buttons rather than just being able to hit B/Circle, which would be hilarious if it werent so stupid. When youre not wearing a costume (which is extremely rare), your lone button is a simple and underwhelming jump, but each of Balan Wonderworlds more than 80 different outfits change that function to something else. A jack-o-lantern costume makes your sole action a punch attack, while a sheep suit lets you hover jump, and there are a needlessly large number of other options to stumble across. The idea of a one-button control scheme isnt an inherently bad one, but Balan Wonderworld doesnt provide a single good reason for why it restricts itself this way. What it does do, however, is provide innumerable examples for why it shouldnt have  most critically, it prevents certain costumes from performing that most basic of platforming tasks: jump. Some suits work fine with one button, particularly the jumping-focused ones (who would have guessed?), but others range from perplexing to downright awful as a result. Things like a clown that can only jump by slowly charging up an annoyingly small explosion, or a flower that can stretch up a uselessly short distance. If a costume uses its button to attack then odds are you cant jump at all while wearing it, while others might still let you jump but at the cost of making their ability activate only when youre standing still  or worse, entirely at random. Why in Wonderworld is that the better option? Player control is sacrificed for unnecessary simplicity again and again: a robot costume can shoot lasers only if you dont move at all while a mantis suit can throw blades but not make it up a one-foot ledge, and neither of them make the frequently ignorable enemies any less dull to fight. And then theres the truly baffling Box Fox, which Balan Wonderworlds own tooltip explains will turn you into a plain cube when it feels like it. Thats genuinely unbelievable when the alternative would have just been to enable even a single extra button, and can make already bland costume abilities annoying or flatout unusable. And while you can carry three costumes at once and simply run around in a more maneuverable one most of the time, swapping between them is accompanied by an aggravatingly slow animation that makes doing so in a pinch a frantic affair. Because getting hit means you lose that costume entirely, I even found myself in a few situations where taking damage sometimes meant not having the one ability I needed to progress, or potentially not being able to jump at all. That leaves you with no option but to tediously backtrack and grab another copy of the outfit you need. Costumes are contained in purple gems that require a key to unlock, but thats yet another mechanic thats so pointless its silly. Keys are almost always just a few steps away from the gems themselves, occasionally tucked around a nearby corner or behind a box to provide all the challenge and excitement of playing hide and seek with a four-year-old. Collecting them is always just added friction in a game full of it. The visual variety of costumes is, at least, decently impressive, with a particular favorite of mine being a giant rolling BB-8 style panda. But mechanically, theres an immense amount of overlap that can cause new obstacles to be monotonously similar to old ones  there are a half dozen different ways to hover in the air, multiple fighters that fill the same role, and countless options to destroy breakable blocks. While over 80 different costumes! might be a catchy bullet point for the back of its $60 box, the reality is Balan Wonderworld would have been a significantly better platformer if it only had 10 that it actually took proper advantage of. Player control is sacrificed for unnecessary simplicity over and over again. As is, each world has about five costumes it introduces, makes use of for some extremely basic platforming, and then throws away just as fast. Balan Wonderworlds levels are mostly linear, but they ignore all the platforming fundamentals of introducing the basics of a mechanic and then building more interesting or challenging sections on top of it as you progress. Each stage seems like a mock-up of how a costume could be used in some better thought-out game we dont get to play. Maybe the most glaring example of this is a costume that lets you summon a ladder on specific ladder spots (exciting, right?). Its used to very simply get over some walls right after you get it and then basically never again, so why does it exist at all? Not all of them are quite that dry, with mildly more entertaining suits sending you bouncing between balloons or floating along air currents. But they never evolve past the lack of complexity found in the first few levels, leaving me bored and unengaged for the roughly nine hours it took to reach the credits. Most levels have small extra bits that can only be accessed with specific costumes from other worlds too, like a recurring bandstand platform that needs a musical costume to trigger  but that means solving these obstacles is purely a matter of having the right costume or not. If you spot blue webbing on a wall, you can go back to the closest checkpoint and swap into the spider costume to climb it (if you have an extra of that suit, otherwise youve got to go back to its home world first). But thats not an interesting challenge, a fun discovery, or even a very well rewarded task as its very frequently just hiding some borderline useless crystals rather than the Statues that act as Balan Wonderworlds Super Star equivalent to unlock more worlds. Those collectibles (and a hat with eyes) arent where the similarities to Super Mario Odyssey stop either. Balan Wonderworld clearly seems to take some inspiration from Marios latest major outing, but it doesnt recapture any of the magic that made it so special. Marios capture forms are similarly limited in their capabilities, sure, but the vast majority of Odyssey is spent as Mario himself, whose controls are far more nuanced than a single jump button. Each level of that game is designed around Mario and his available captures with explicit intent, ramping up simple concepts into more complex ideas as you go. In contrast, Balan Wonderworld just throws a bunch of random ideas and costumes at you, lets you swap to any of them any time you like, and never really offers a more interesting use than the ones it introduces the first moment after you put one on. The worlds can stretch through some neat visual styles, from jungle treetops to an M.C. Escher-style artistic maze, but even the nicest of them are undercut by repetitive terrain and peculiar dancing NPCs that disappear every time you get close (and a small handful have a downright nauseating screen warp effect that makes it actively hard to play). But all that color and some pretty great music dont do much to differentiate their rudimentary level design. Every single one is still overburdened with a needless amount of costumes and held back by its restrictive control scheme, the combination of which prevents Balan Wonderworlds platforming from ever forming a coherent voice of its own. The one place this trend is ever so slightly bucked is in its bosses, which do manage to flaunt Balan Wonderworlds knack for character design. Bosses follow the cookie cutter three-hit formula to beat, but a neat little twist is that there are actually three different ways to deal damage that you have to figure out mid-fight. Each one you manage to use earns you a Statue, which makes them more like an action puzzle. That doesnt really make them much fun to actually fight, as dodging their attacks and hitting back is still incredibly basic and often annoyingly unintuitive, but it is a place where Balan Wonderworlds creativity feels better expressed. The prospect of 100%ing any of Balan Wonderworld's stages is an absolute nightmare. Its certainly a preferable way to earn Statues than the Balans Bout bonus stages hidden throughout every level. These transport you to a timing-based minigame where Balan himself flies through a generic void inexplicably punching rocks for no discernible reason, with you trying to time button presses to annoyingly vague indicators to earn multipliers on the crystals youve collected. Every single Balans Bout reuses the same small pool of animations, takes far too long, and is incredibly harsh in its judgement  getting every button press perfect will earn you a gold medal and a Statue of its own, while even a single slightly mistimed one will drop you to a silver and deny you that reward. By the latter half of the campaign there are two or three of these in every single level, and you have to completely reload a level to take another crack at them, making the prospect of 100%ing any of Balan Wonderworlds stages an absolute nightmare to consider. Completionists will get more bad news once the credits roll, as a third level opens up in each of the 12 worlds. These endgame stages ramp up the challenge a little bit, but probably in one of the more frustrating ways possible. The platforming puzzles are only marginally more complex, but now there are no purple costume gems scattered around except for some hidden special ones (like a somewhat familiar chargeable rocket roller skater). That means you have to rely on the supply of costumes youve collected elsewhere, and losing a specific one you need could not only halt your progress in that level but also potentially force you back to a different world to laboriously farm up on what you need. That crosses a threshold Balan Wonderworld mercifully doesnt often reach: the point where my boredom transforms into frustration. Garden of Eatin' Between each level, you return to your pointless garden hub world full of pointless birds that spin a wheel to rack up pointless points. For anyone hoping this green, hilled zone is comparable to the Sonic Adventure series adorable Chao Garden, I regret to inform you that pretty much the only thing they have in common is the ability to force feed its cute critters crystals and then unceremoniously throw them through the air for a cruel laugh. There's very little interaction with these bird blobs otherwise, making the almost idle game-like nature of giving them crystals to make a generic counter go up perplexingly dull. The process of feeding them is a tedious one too, requiring you to walk to one of four colored flower patches to throw out the matching crystals you collect during a level  the catch here is that you throw them 10 at a time and there can seemingly only be 20 spawned in at once. Since the old ones will despawn if too many new ones arrive, you have to throw some out and then wait for your fluffy workers to slowly eat before throwing out more. That will then cause them to spin a wheel that builds superfluous structures in your hub, be it a trampoline for them to bounce on, part of a tower for them to adorably roll down, another trampoline, or even a third trampoline. Because youre given zero motivation or explanation for any of this (what do the different color crystals do? Why am I building them so many trampolines? Where did one get a tiny hat from?), throwing out crystals becomes little more than a chore between levels, completely unlike the nuanced care I could give my Chao. Whats worse, because crystals are the primary item youre meant to pick up besides Statues, their lack of value in the hub (the only place they are at all relevant) undermines the very act of collecting them. Backtracking to equip that music costume I mentioned earlier seems relatively fruitless when using its special bandstand only gets you four crystals to add to the hundreds your birds will greedily devour. By the end of the campaign I barely even cared about picking them up anymore  and when the main collectible of your 3D platformer starts to feel like more trouble than its worth, thats a pretty catastrophic breaking point. Balan Wonderworld reminds me of some of the other platformers I played as a child, but not in a good way. It feels like a small subset of games that I enjoyed in the 90s, like Gex: Enter the Gecko or Bubsy, only to realize they were actually pretty bad once I grew out of my young naivete and looked back with more informed eyes. But both our options and our standards have increased dramatically since the days of the Nintendo 64. So even viewed with nostalgic eyes, Balan Wonderworld is less a throwback to a bygone era and more a derivative reminder of memories best left forgotten. Balan Wonderworld isnt always an awful platformer, but it is a consistently boring one. Its full of charming character designs and the occasional hint of a clever idea, but its insistence on being a one-button game with dozens of needlessly overlapping abilities that are thrown aside just as fast as they are introduced rots it to the core. Its a mess of undercooked concepts and clunky mechanics that slow it to a crawl, and it seems to take inspiration from better games without properly recapturing what actually makes them fun. Its platforming never evolves beyond the most basic possible obstacles it can throw at you, but it's the fundamentally flawed choices behind that mediocrity that take Balan Wonderworld from unamusing to outright bad.", "date": "March 31, 2021"}