{"name": "Evil Genius 2", "name_review": "Evil Genius 2: World Domination Review", "ref": "https://me.ign.com/en/evil-genius-2-pc/183203/review/evil-genius-2-world-domination-review", "text": "Why must I be surrounded by incompetent fools? I don't expect Evil Genius 2s world domination to be a walk in the park, but I can't take diabolical joy in shaking my fist at the forces of justice or making an example of an unruly minion when it's a clunky interface and confusingly-worded objectives getting in the way of my grand plans. The whole Dungeon Keeper-meets-Bond villain operation is decked in delightful style and humor from top to bottom, but that can only go so far when the acts of building a secret lair, ordering around underlings, and taking over the damn world are so often underwhelming. Evil Genius 2 is at its best when it's leaning into the tropes and aesthetics of classic, over-the-top spy thrillers. From the hulking, brass-bedecked Red Ivan to the subtly menacing goodie-turned-archvillain Emma, each of the four geniuses you can choose to play as has a distinct, in-your-face personality that makes them the deliciously malicious center of the unfolding plot. With simple but effective character designs and gleeful, scenery-chewing voice acting, I was always eager to see how these titans of crime would react to each new challenge or event in the story. Even bit parts are voiced and animated with a dramatic flair. And the way they're organized into optional side missions you can pick up at any time gives you a lot of control over what kind of tale you're in the mood for. There seem to be quite a few of them, as I'm still seeing plenty of new ones with over 25 hours of terror under my belt. And there are a lot of scripted episodes to enjoy here. As you progress toward building a campaign-winning doomsday weapon, you'll recruit new types of minions to staff your base, steal cultural heirlooms, and go up against some of the globe's signature crime fighters. Dealing with these do-gooders means running a legit-seeming, upscale casino as a cover operation. This was probably my favorite part of the whole business, and I wish it were a bit more in-depth. As it is, your entertainers and cocktail bars merely serve as a way to waste the investigators' time, draining their resolve and hopefully forcing them to go home without finding any clues. I wish this had been expanded on more, as trying to waylay a wannabe Bond in true Casino Royale fashion is exactly the kind of experience I was hoping for. Running a cover operation was probably my favorite part of the whole business, and I wish it were a bit more in-depth.If the meddling heroes make it past the ~Employees Only~ doors, you can get into some tense dust-ups with higher stakes and tougher enemies the more infamous you become. I found these became kind of repetitive and meaningless, though, and mostly boiled down to hitting a lockdown button so my security forces would go and deal with the problem. The cool traps you can deploy unlock so late in the tech tree that my base was usually too established to make the best use of them without painstakingly and completely relocating all of my vital operations. If I could have started out with a bunch of money to build an entire dummy floor for the purpose of slowing down my enemies, that would have been great. But Evil Genius 2 doesn't really give you the chance to do that. Unfortunately, for almost every spot where Evil Genius excels in the style department, I can point to one where it falls short in substance. Building a multi-layered base full of evil computers, evil bunk beds, and evil particle accelerator things, wwas a rewarding way to customize my operation, with the added wrinkle of having to think about how to best make use of limited space. But almost everything else I had to do to take over the world was not so pleasant. The world map is mostly a giant mess and I hate it.Let's cut right to the chase. The world map is where you deploy minions to steal money, kidnap specialists who can train your staff to do new jobs, and complete story missions. As a whole, it's mostly a giant mess and I hate it. Its existence dragged my machinations down time and again. For example, there's a little number next to the menu button which will show you how many of your global criminal networks are idle, but there doesn't seem to be a way to quickly see which ones need attention once you're on the map screen. You have to actually hover over each one to check its status and see who needs a new assignment. Don't I have lackeys to trudge through this tedium for me?! I ended up mostly ignoring the active operations like heists or distracting the authorities unless I needed a quick cash infusion or there was a story mission to complete. It's a major chore to try to have a lot of operations running constantly. And the rewards don't usually seem worth it, since each network will generate a small amount of passive income even if you do nothing, which was more than enough to keep things running smoothly once I had enough outposts built. This interface is generally terrible at communicating objectives, too, doling out vague directives and assuming you'll be able to psychically discern what steps are required to get there. For example, it might tell you to recruit two new types of minions to fill out your roster. But it will never tell you that you need to do this by opening the Side Stories screen and selecting a specific adventure that will unlock them. I ran into this issue almost constantly, in every single genius's campaign. The tutorial is mediocre at best, and there doesn't even seem to be a glossary to explain basic game terms. Not anywhere that I could find it, anyway. While the art, voice acting, and overall theme harmonize so beautifully that I want to steeple my fingers and practice my evil laugh, almost every moment of playing Evil Genius 2 is plagued by a clunky, needy world map layer and confusing, poorly communicated objectives. Its the kind of problem that playtesting usually brings out during development, and this game couldve used more of that. Once I eventually stumbled blindly onto the solutions to some of these frustrating problems through brute force trial and error, I could see the promise of a dastardly good time of laying traps and spinning plates hiding underneath. But being constantly surrounded by fools wasn't quite worth the reward, at the end of the doomsday.", "date": "March 30, 2021"}