{"name": "Life is Strange: Before the Storm -- Episode 1", "name_review": "Life is Strange: Before the Storm Episode 1 - Awake Review", "ref": "https://me.ign.com/en/life-is-strange-before-the-storm-episode-1/137243/review/life-is-strange-before-the-storm-episode-1-awake-review", "text": "Returning to Arcadia Bay, Oregon in Life is Strange: Before the Storm brings back the coming of age, indie-film vibes and tugs of emotion defined the first Life is Strange Series. Of course, the first episode of this prequel, titled Awake, also comes with the awkward dialogue and unrealistic characterisation which made the original difficult to connect with at times. Playing through this dialogue-based adventure as local teenage rebel and angst queen Chloe Price can grant an appreciation for an often-prickly character. Unlike its predecessor, Life is Strange: Before the Storm (so far) doesnt appear to revolve around any supernatural powers, and instead features a more grounded back-talk ability that lets Chloe interject into other peoples dialogue. That means that being a smart mouth teenager is literally the main mechanic for solving problems, and it works pretty well except that the over-the-top reactions from both Chloe and the other residents of Arcadia Bay can feel jarring and even unbelievable. A bouncer letting an underage smart-mouth girl into a club because she insults his bike or a parents inability to accept thanks, all feel like exaggerated fantasies rather than genuine moments. This is balanced out by Chloes interactions with friends, which usually take a more relatable and believable tone. Awake bounces between acting as a tutorial for this new ability and showing the softer side of Chloe in what feels like a slightly awkward but promising start to this story. Chloe still suffers from the bursts of unlikeable behaviour which also plagued her throughout the original Life is Strange, but this time the insight gained from playing the story through her eyes seats these in a more understandable realm. Shes an angsty teen whos lost her father and her only friend and feels abandoned. Finding triggers for her scattered memories and reading through old texts was gut wrenching, especially after playing as Max in Life is Strange and being able to see how alone we left Chloe in her time of need. The talk-back ability is a new way to appreciate Chloe's personalityShe darts between being relatable, which throws me back to my own high school experience, and having interactions which dont always make sense. Real interactions while playing a game of DnD with friends felt funny, warm, and endearing, whereas when the skinny teen tried to intimidate two guys out of a bar fight rather than apologise I got the impression even Chloe herself didnt understand her logic. I soon settled into a pattern where the most favourable and satisfying results came from leaning into imagining what this flawed, insecure character might do rather than what seemed traditionally right or pious. Her back-talk ability relies heavily on this, and its a new way to appreciate Chloes personality. Listening closely to what the other people have said is key to making back-talk work, and Chloe will pick up on words and themes to give you a few potential responses. The timer on these choices does a good job of mimicking the feel of a real-life argument where you scramble to work out what the best comeback will be. Relative to the original Life is Strange, the lack of Maxs magical rewind ability adds a level of permanency to these actions, which is nice other than that it took away some willingness to take big chances and see what mightve been. That said, none of the three times Awake uses this mechanic felt like theyd have any major impact on the story and felt a bit hollow as a result, so hopefully, its more of a warmup for more weighty decisions in future episodes. Chloe defeats a bully with the power of bratty argumentativeness.Despite not seeing much consequence from decisions, many of Chloes interactions can feel good. Defeating a bully using just the power of bratty argumentativeness gives a believable sense of teenaged accomplishment, even if it uses cheesy lines to do so. Being kind when its the right thing to do or just finding the perfect smart answer all offer an inherent emotional sense of reward and achievement. Other characters also seem to respect and praise Chloe when shes successful in these bouts, and although its a bit overt and almost fanciful, the results are not without satisfaction. Even with Chloes angst and impetuous teenage behaviours, the most frustration I found came from other characters responses to her. Her mother, Joyce, appears to try to see things from her position and responds to softness if Chloe offers with some of her own. But then Joyce also thoughtlessly antagonises Chloe by persistently pushing her towards her new boyfriend, David, about whom Chloe is not shy about expressing her dislike. And when youre forced into an interaction with David, whenever you attempt to extend an olive branch hell ungratefully say the worst possible thing, to the point where it was comically unbelievable. The writing in these interactions felt more like a retelling in which a teenager tries purposefully to brand the participants as villains, but unfortunately, I dont think thats intentional. Where the hook lies in all of this is in Chloes relationships, less so with her parents and more with her classmates  especially the whirlwind one that develops between her and the very popular Rachel Amber. In this episode, we witness the beginnings of the affection Chloe harbors for the infamous Rachel in the original Life is Strange. It feels rushed, but in the way that only teenage love can, and sparks some genuine emotion in all the awkwardness. Rachel is in some ways even angrier at the world and less grounded than Chloe, and watching Chloes desperation at trying to hold on to their relationship made me understand and side with her in ways I was initially worried I never would. Anyone whos played the original Life is Strange has a fair idea about whats coming for these characters, but so far the journey looks to be interesting even if the destination is clear. I feel that if Life is Strange: Before the Storm ever manages to find its feet it will have a compelling tale to deliver, and I hope that despite what Ive seen so far my actions will have a significant say in what that actually is. Based on these first few hours Im confident that this story has the ability to tear my heart out, but am little worried that shaky dialogue and unbelievable interactions will get in the way. Life is Strange: Before the Storm shows a lot of promise in its first few hours despite the same weaknesses in its script as the original Life is Strange series. The new talk-back mechanic fits Chloes character well, challenging you to roleplay as an angsty teen to get the best results. Everything is pointing towards a heartbreaking story with interesting characters, but the lack of finesse behind how its delivered and potential absence of impact from player choice give me some reservations.", "date": "Sept. 6, 2017,"}