{"name": "Monster Energy Supercross  The Official Videogame 4", "name_review": "Monster Energy Supercross – The Official Videogame 4 Review", "ref": "https://me.ign.com/en/monster-energy-supercross-the-official-videogame-4/182557/review/monster-energy-supercross-the-official-videogame-4-review", "text": "Its no secret licensed racing games on a yearly cadence sometimes struggle to innovate, and Monster Energy Supercross -- The Official Videogame 4 is no exception. Its certainly true that Supercross 4 looks the best the series ever has humming along at 60 frames per second on PS5 and Xbox Series XS, and its also true that developer Milestone has wedged in more riders, more official teams, and more items than ever before. However, its attempt at injecting more nuance into the career mode falls short of meaningfully reinventing the experience, and the overall result honestly seems like a bit of an inessential upgrade from 2020s Supercross 3. Between Supercross, MXGP, Ride, and MotoGP, theres no doubting Milestones enthusiasm when it comes to motorcycle games. With that in mind Supercross 4 is, perhaps unsurprisingly, a sincere and successful stab at distilling an admittedly niche motorsport into a racing game geared towards Supercross disciples. The bikes are lavishly detailed, the track atmosphere is great, and the sense of speed and danger as 22 riders hustle and jostle around the tight stadium courses is very good. However, this was equally true of Supercross 3, and indeed Supercross 2  and even the original. Its subsequently hard to argue that Supercross 4 does quite enough new stuff to truly soar above its predecessors. Skilling Them Softly Supercross 4s primary new addition is a juicier single-player career mode, which includes a skill tree to improve your riders stats, dedicated training modules, a journal that tracks various racing feats and other cumulative bits of data, and a path that now begins in Supercross Futures  the real-world feeder system established back in 2018 for aspiring Supercross superstars and folks with the confidence to wear leather pants with the word Impeccable on their bottoms. While this all sounds good on paper, its still quite basic compared to the deeper career modes found in games like F1 or WRC, and its application in-game is all a little uneven. In real life, for instance, Futures are amateur class races conducted on courses that are tamed down from the ones sculpted for the pros. The Futures races in Supercross 4, however, ultimately dont seem distinct from the main categories as they use the same courses and are presented in the same way. Without its own atmosphere it doesnt really feel like a unique starting point for your Supercross 4 career. The RPG-style skill tree seems like a pretty standard inclusion for a sports game on the surface, and it works, because I definitely felt the results of boosting my riders stats. Unfortunately, for this to be able to happen, Supercross 4 feels as if its arbitrarily numbing the bike handling to be more sluggish in the beginning, which I found pretty unappealing as a returning player. It feels artificial to override a players actual proficiency with the controls simply because they havent earned enough points to check a box yet. Between the optional training modules and the points gleaned from racing and fulfilling totals in my riders journal, thankfully it only took less than a full season to boost these stats to the point where the handling felt largely on par with Supercross 3 again. Thats despite the games best efforts to derail me, too, because there are definitely some gremlins in the training modes. ~Missing~ gates while passing directly over them and the inconsistent fail states for leaving the track limits proved pretty annoying, but losing one of my limited number of weekly attempts because the AI crashed before even handing me control was extremely lousy. Sunday, Muddy Sunday Perhaps one of the most peculiar problems with Supercross 4, however, is how impenetrable I predict it may be for both new players and some young players. Yes, the difficulty curve for the Supercross series has always been significant and, yes, the tracks are always unforgiving for the unprepared, and success requires carefully learning each track to maintain momentum on the rhythm sections above all. However, between Supercross 4s extremely superficial tutorial and the scaling back of rewinds from unlimited to a very finite resource, Supercross 4 has become an even more unfriendly place for less experienced players. The fact that there are five separate AI difficulty levels that all seem to be able to rip lap times within a second-or-so of each other also leaves me sceptical whether beginners will be able to fashion Supercross 4 into an experience they can scale along with their own skills. F1 2020 is a good example of a game thats made great strides opening up a daunting sim to beginners while retaining its complexity, but Supercross 4 is going the opposite direction  and narrowing the target audience seems especially odd considering Supercross is owned by the same company that runs Monster Jam and Disney On Ice. This is a shame because ultimately Supercross 4 still feels good to play. The air control physics are still a little wonky if you waggle the wrong inputs, but the sense of weight remains very good. Additionally, Supercross 4 eases up on making grazing the trackside Tuff Blox a death sentence and the dynamics of deep, thick sand are very well-realised this time around. Monster Energy Supercross 4 is another typically robust take on the AMA Supercross Championship but, with fewer concessions for newcomers and casual players and the changes to career mode ultimately being a little rudimentary, this particular instalment feels as if its both steering away from courting new fans and not quite doing enough to compel existing players to upgrade.", "date": "March 11, 2021"}