{"name": "Stronghold: Warlords", "name_review": "Stronghold Warlords Review", "ref": "https://me.ign.com/en/stronghold-warlords/182466/review/stronghold-warlords-review", "text": "For 20 years now, the Stronghold series has fortified itself in an interesting place somewhere between a city builder and a more traditional real-time strategy. Stronghold Warlords continues this tradition with a new flavor as it takes us, for the first time in the series, to the battlefields of ancient and medieval East Asia. But as an RTS, it feels like it's still living in the mists of the past. And the city building, while it can be an interesting and almost zen little puzzle, often feels at odds with the goal of straightforwardly conquering your enemies. The biggest, often refreshing difference between a Stronghold game and, say, Warcraft or StarCraft, is in how it pushes you to think about space. You're going to be turning an open plot of land into an impressive, thriving walled city... assuming no one razes it to the ground first. And it's not just the availability of natural resources you need to worry about. Decisions like placing your main stockpile close to resource collection areas can have a big effect on the efficiency of your economy, and keeping your people happy later on will partly depend on how many of your buildings are in the radius of temples. You really have to try and picture how everything is going to fit together, on top of building out your defenses to maximize your home field advantage. It does a good job of scratching that Tetris-y itch and making long-term planning pay off. Thats been true of the series as a whole, but Warlords has added a new wrinkle in that you can choose whether to keep your people in line through love or fear. One building chain will let you construct torture racks and other unsubtle symbols of oppression, which make your workers work faster but demoralize your armies and reduce your popularity. The other offers creature comforts that will inspire the troops and endear you in the hearts of the commoners, but also lowers their resource output since they're spending too much time playing lawn darts or whatever. I enjoyed the tension this created because I could see how much productivity I could squeeze out of my people and also keep each new stronghold from feeling like a repeat of the last. You can choose whether to keep your people in line through love or fear.Keeping happiness at least somewhat positive is important because it's the only way your population will grow, and raising taxes to afford higher-tier units is only possible if you're giving something back in return, like more rice rations or fancy new silk duds. This helps your cities feel like a bit more than just a collection of peasants dumping gold in a pile to fund your armies like in a traditional RTS. But once those armies get on the move, that's sort of all it boils down to. Combat in Stronghold Warlords is at its best during sieges, whether you're on the attacking or the defending side. All the modular pieces you can construct your walls and towers from allow for some interesting and clever set-ups to maximize your advantages against a larger force, especially if you know a thing or two about how real castles were designed in these eras. And figuring out how to take on an enemy fortress, probing for weak spots and choosing your opportunities carefully, can be exciting as well. Field battles just aren't as interesting, though. Fights are very old-school Age of Empires in their pacing and scale.There is a huge gap in movement speed between lower-tier skirmishers and the tanky imperial troops you can get later in the tech tree, which does allow a savvy commander to outmaneuver a more potent army and win the day. But overall, these fights are very old-school Age of Empires in their pacing and scale. It's not terrible, it just feels very behind the times compared to more recent RTSes like Northgard or Total War. And the art doesn't help. While the grand keeps and shining pagodas are detailed and attractive, these low polygon, flat-looking unit models could be outshone by something like the original Company of Heroes, which came out almost 15 years ago. Each of the six single-player campaigns, which are around six to 10 hours long, take you to a different time and place in history, they only seem like distinct factions because most missions limit what you can build. In multiplayer and skirmish vs AI, on the other hand, that distinction is lost: not only are the unit rosters identical for each army, your Imperial Swordsmen will always speak Chinese even if you're playing as the Vietnamese. Genghis Khan can hire Ninja and Samurai units just as easily as his rival, the shogun, can get Mongol horse archers. There's a little bit of visual variation in architecture, but overall, it's all a weirdly homogenous abstraction of a setting that spans an entire continent and over a thousand years of history. Genghis Khan can hire Ninja and Samurai units just as easily as his rival, the shogun, can get Mongol horse archers.Some of the voice acting is definitely pretty iffy, too. The main advisor character in the campaign, especially, sounds like a really cartoonish, potentially offensive stereotype of a fussy Chinese bureaucrat. It's similar in tone to the somewhat over-the-top and playful depictions of historical figures the series has dabbled with previously, but when it's applied to a non-European character, it's hard not to wince any time he opens his mouth. The leaders themselves, while exaggerated, at least don't sound like caricatures. At least the mission objectives have good variety and nod to some interesting historical battles. They definitely play fast and loose with history, but keep it interesting by alternating between more traditional base building, a few that have you trying to take down a castle with a fixed army and no ability to replenish troops, and some that are purely focused on building up your economy while defending a castle. Those last ones are the most fun, especially when combined with the system of militarily or diplomatically vassalizing AI warlords on each map to grant you various bonuses. It made me wish there was some kind of horde mode for skirmish or multiplayer, which could have taken the strongest part of Warlords and made it endlessly replayable. When I'm laying out a city or defending it from invaders, Stronghold Warlords is satisfying and almost chill. But it's a better castle builder than it is an RTS, and aside from a kind of aimless free build mode, there's not much of a way to ignore those lackluster elements. The dated unit models just aren't at all nice to look at, and make me wonder if a game of this budget wouldn't have gotten more bang for their buck going with a more stylized art direction. The historically-based campaigns have some cool missions, but the fact that every faction boils down to a weird amalgamation of such a broad swathe of history and geography in skirmish and multiplayer feels like a missed opportunity. I don't regret the time spent with Stronghold Warlords, but I wouldn't be devastated to have missed it either.", "date": "March 9, 2021,"}