{"name": "Monster Jam Steel Titans 2", "name_review": "Monster Jam Steel Titans 2 Review", "ref": "https://me.ign.com/en/monster-jam-steel-titans-2/182417/review/monster-jam-steel-titans-2-review", "text": "Monster trucks are the automotive embodiment of a slightly tipsy dad coming home after a wedding: spirits high but knocking over all the garden gnomes. Theyre big, loud, and a little destructive  but lovable oafs, nonetheless. Its hard to hate a giant, five-ton truck wearing a novelty hat. Monster Jam Steel Titans 2 quaintly leans into this kind of wackiness with a series of large, themed open worlds celebrating a silly yet earnest stable of official trucks shaped like dogs and zombies, but its anticlimactic exploration objectives and the vanilla, chore-like structure of the competitions on offer unfortunately make for a surprisingly boring drive. The lack of spark is quickly evident. After a bafflingly basic tutorial, I was suddenly and unceremoniously dumped into the first of several open-world environments, leaving me to press pause and shuffle through menus to uncover what I was actually supposed to do. Steel Titans 2 splits its action over two separate career paths, but neither of them are very interesting. Theres the arena and stadium-based championship career, which resembles traditional, real-world Monster Jam events, and then theres the World Career mode, which is literally just a series of exactly the same arena and stadium events but with a waypoint challenge or circuit race based in the open worlds included occasionally. Theres also a smattering of things to go and find in these maps, but doing so has proven annoying and unrewarding. You cant discover a secret in the wrong truck, but even in the right truck nothing Ive found so far has been particularly interesting. Only Monster Mutt Poodle can open a specific hot pink barn to temporarily make a new jump available, for instance, but the jump only appears to exist as a means to collect a floating inverted triangle. According to the game, floating triangles unlock more trucks  but ultimately its just stuff on a list to tick off in a game thats already a repetitive slog. Unreal Steel Truck handling is passable but it definitely lacks the sense of weight and inertia found in Monster Truck Championship. The general driving is okay and the independent rear-wheel steering controlled by the right stick certainly differentiates it from most other racers. The short course, head-to-head racing feels best, where you can whip the trucks into pretty satisfying and aggressive powerslides. However, things unravel somewhat as soon as you tip over, or tricks are required. Admittedly Steel Titans 2 doesnt position itself as a simulation, but for five-ton trucks they sure swirl about like candy wrappers caught in an updraft. An arcade approach to handling isnt inherently bad, but it definitely makes the freestyle events simplistic affairs. Scoring a perfect 10 is a cakewalk when all you have to do is pin the throttle, point at a ramp, rip a couple of backflips, and roll around. It wont look pretty but the points will rack up. I never needed a plan; all I ever had to do was send it high, tumble around, and accidentally accumulate a combo big enough to be unbeatable. In contrast to last years Monster Truck Championship, the career modes in Steel Titans 2 are woefully superficial. The arena championship is the worst offender and really lacks excitement. Theres zero sense of being an up-and-coming driver; I just mashed through a menu and moved through a laundry list of events. Theres no team management, no truck creation or customisation, and no real sense of how far through the season you are, other than a progress bar you have to quit the mode to view. The barebones presentation just shoves you from event to event until there arent any more of them, and then its over, with zero indication youve actually won anything. The stadium championship that follows is slightly better on account of the venues being bigger  so the race and freestyle layouts are more interesting  but its still largely soulless. F1, WRC, and even Monster Truck Championship made me feel like I was part of an operation. Steel Titans 2 just airdrops you into a truck for a minute or so at a time. Its just shallow and trite compared to its peers. Grave Mistakes The other side of Steel Titans 2 is its wild and over-the-top open world maps and its World Career, which is themed around curated sets of Monster Jam trucks. The Monster Mutt trucks, for instance, get a massive fantasy dog park filled with giant kennels and a race track shaped like a giant bone, and the spooky trucks get a gothic, Halloween-inspired environment filled with pumpkins, graveyards, and shipwrecks. Its a cute touch that definitely embraces the silly personas spray-painted all over these well-known Monster Jam trucks, but it does make it feel like Steel Titans 2 is trying to have one foot in the real world and the other in a methanol-huffing fever dream  particularly since the World Career mode is padded out with plenty of repeats of arena and stadium events. Steel Titans 2 is bright and saturated, but the flickering shadows are awful and stuff like the clipping, the total lack of a watersplash effect, and spelling errors in the menus makes it all feel pretty half-hearted. Truck detail is decent, but developer Rainbow Studios has made the peculiar decision to completely bury Monster Jams most iconic trucks as distant unlocks. This means that by the time you secure trucks like Grave Digger and Megalodon, Steel Titans 2 has long run out of things to show you. That theyre not even available in quick play feels like a snub to particularly young kids who probably just want to freely hoon around in their favourites without jumping through 75 hoops to do so. Rainbow Studios has been responsible for some top-notch, mudslinging racers over the years, but Monster Jam Steel Titans 2 isnt one of them. The racing is serviceable enough and the themed worlds are a cute idea, but its bland and poorly presented, chore-like approach to its career content turns one of the most grin-inducing spectacles in motorsport into a remarkably dull experience.", "date": "March 5, 2021,"}