{"name": "The Climb 2", "name_review": "The Climb 2 Review", "ref": "https://me.ign.com/en/the-climb-2/182387/review/the-climb-2-review", "text": "Climbing is one of those things that works really well in VR with motion controls, but rarely gets more than a moment to shine. The Climb 2, though, is all about it. This is developer Cryteks second iteration on the idea of scaling large, vertical obstacles, and its a major improvement over the original Oculus Rift launch game in terms of controls and level design. And even though climbing sounds pretty basic on its own, the simulated sensation of dizzying heights makes the tension feel real  and The Climb 2 comes with a bump in graphics that shows off what the Oculus Quest 2 can really do when its running on all cylinders. Things start off pretty simple. Once you get through its brief tutorial, youre allowed to swing (pun intended) between any of its five main zones, and within each of those are three different levels that unlock as you beat the last one. Thankfully, it does away with the originals arbitrary level-gating system that felt entirely out of place and limited your ability to explore early on. If it sounds like the amount of content here is light, thats because it is: thats a total of just 15 levels. Dont come in expecting a story, either. The Climb 2s storytelling is all found in its intricate level design, though a bigger plot is something that could certainly have made this experience even more cohesive and interesting. The only thing youll be doing is jumping, gripping, and swinging your way up this meticulously detailed virtual climbing wall  and youll do it alone. If it sounds like the amount of content here is light, that's because it is.What makes it work is that theres a refreshing amount of diversity. Each level, even within the same zone, has a completely different backdrop and art style, and map layouts are all notably different from what came before. For example, one of the early levels in the City area has you climbing along the outsides of skyscrapers in broad daylight, whereas the next level starkly contrasts that by having you jump between moving elevators with gorgeous city lights glimmering across the horizon at night. Later, you climb through mountainous crevasces while evading feral wolves, then youre leaping between hanging baggage containers, and even climbing up the side of a giant wind turbine. It all looks fantastic, and the constant change in backdrop keeps things feeling fresh and interesting throughout. Speaking of graphics, The Climb 2  which I played on Oculus Quest 2 but is also available on the original Quest  offers a significant leap in graphical quality over its predecessor on the same system. Off the bat, it offers sharper textures and far more clarity; I noticed fewer jagged edges on objects as well, at times fooling me into thinking Id been playing a PC VR game and not one on a standalone device. Most important here is the visual boost to nighttime environments. Some nighttime levels in The Climb were downright unplayable due to claustrophobic level design and unclear directions, but thats solved now in The Climb 2s similar areas. Even the most dimly-lit levels have clearly marked grip points now, and the navigation system can easily get you back on track if you start to lose direction. The moment-to-moment gameplay of The Climb 2 is meditative in its simplicity.As tense as it can be, the moment-to-moment gameplay of The Climb 2 is meditative in its simplicity. Just like in the original, its core game mode  called the Professional mode  is about balancing speed and stamina. Trying to hold a grip with one hand can cause you to lose too much stamina and slip, but you can press your Touch controllers trigger button halfway to hold on longer and restore stamina mid-climb, or you can apply chalk to your hands to make them retain more stamina and restore stamina much faster. These are all strategies that carry over from the original game, but they feel so much smoother now. For instance, maintaining a half-grip is now more forgiving and intuitive. Chalking your hands is also much quicker and far less clunky. As a result, its much easier to get into a groove in The Climb 2. Making things even more interesting, most of the maps now have several different pathways that you can take to reach your goal. Theyre also left open to interpretation: if you see an opening to take a shortcut by, for example, jumping directly to a distant ledge instead of climbing towards it, you can probably do it. The other big upgrade is that a vastly improved physics system means that youll get to move across objects and obstacles that have some physical reactivity as opposed to the strictly static world of the original. Youll jump between hanging tents, climb across ropes, and hang onto scaffolding for dear life as it bounces around in response to your weight. This introduces a ton of flavor to the gameplay. Despite being way more intuitive, The Climb 2 still hasnt fully escaped the troubles of the original. Its a physically intense game which often makes you crane your neck to play, and that can cause some discomfort. And while the level design is far less frustrating than that of its predecessors, there will still often be moments where you get your head stuck inside of a wall, or your avatars full body will block you from making an obvious jump, causing you to fall to your death. As with the original, you can customize your avatars hands, but there really isnt much of an incentive to do so. You cant even show off the stuff youve earned to other players, and vice versa. A vastly improved physics system means there's some real physical reactivity.The continuing lack of a real multiplayer mode is especially disappointing, given it was such a missed opportunity in The Climb. Instead of racing someone to the top of a mountain in real time, you can compete against ghost avatars made from your friends leaderboard scores. This is plenty of fun when it challenges you to get better at climbing, but its just not the same. Finally, if the intensity of managing your stamina or infrequently chalking up your hands is too much, theres a Casual mode that does away with these things. Its a great way to jump into a level and start climbing, and I found it a helpful way to scope out a level and get a sense of direction before climbing it for real in Professional mode. Its great that both modes have their own leaderboards, meaning that you can go head-to-head with a ghost opponent in Casual mode if thats closer to your speed. Thanks to improvements to its controls and level design, The Climb 2 is a significant step up from Cryteks original swing at a VR climbing simulator. It may be short, but it doesnt keep you waiting to get to the action. And while it doesnt innovate enough to feel like a whole new game, it refines its predecessors enjoyable but generally unintuitive climbing into something much more approachable and slick, making it a great game for VR beginners. At its best, The Climb 2 exhilarates as it carries you well above the clouds.", "date": "March 4, 2021,"}