{"name": "River City Girls 2", "name_review": "River City Girls 2 Review", "ref": "https://me.ign.com/en/river-city-girls-2/204044/review/river-city-girls-2-review", "text": "The Kunio-kun series is so old and spans so many consoles that you may have stumbled across one of its games without even knowing its part of a connected universe of beat-em-ups. The best-known of them  Super Dodge Ball, Double Dragon, and River City Ransom  are all separate stories revolving around how there never seems to be a deficit of faces to punch in River City. River City Girls 2 is both a sequel to the excellent 2019 beat-em-up and the final form of the action-RPG design that River City Ransom pioneered in the late 80s. Its only marginally different from the one before it, choosing to refine systems and expand in size instead of entirely overhauling how anything works. But when you kicked so much butt the first time, why change your technique? Sony Playstation 5 Console Standard Edition . . 2,498.00 View on Amazon  The details of how and why the Yakuza that Kyoko and Misako thought theyd chased out of the city in the previous game are back are shaky, but they and their punchable faces have taken over the school and all the local hangout spots. That's reason enough to start their two-fisted crusade to rid them from the streets, one cracked skull or broken rib at a time. While the story itself is light and easy to ignore, the writing is sharp and funny. I consistently chuckled at the one-liners and the banter between the protagonists and the various enemies and side characters they encountered. You get straight into the brawling pretty quickly, with all four returning characters  our two leading ladies and their boyfriends, River City Ransom heroes Kunio and Riki  playable out of the gate in single-player or up to four-player co-op. Though leveling up and gaining new techniques organically or through purchase at the dojo turns the combat system into a robust palette for violent self expression after a few hours, the early game can feel particularly shallow. With only a handful of techniques at your disposal, the button-spammy nature of this genre will never feel more apparent. However, that serves as a stark contrast to what a great beat-em-up can be: once you get further down the combo rabbit hole the offensive options feel spectacular. Once you get further down the combo rabbit hole the offensive options feel spectacular. There are a lot of moves to learn in River City Girls 2, but the ease of inputs  just a direction plus light, heavy, or special attacks  means it's a cinch to cycle them into your gameplan. Characters also fit pretty easy-to-define archetypes that make each of them unique from each other in important ways: while Misako and Kyoko are both all-rounders, the former has a much better air game while the latter can lock down her surrounding zone with her Chun-Li inspired kicks, or repel them with the worlds sturdiest dab. As the best friends feel like two sides of a similar coin, so do their boyfriends and the new characters, Provie and Marian. Riki and Provie are speedsters, moving quick and bamboozling opponents with blinding strikes, but the breakdancers tricks are better for groups of enemies vs the Rikis single-target lockdown. Besides being a total unit, Marian is also the more hands-on grappler to compliment Kunios brawler instincts. This ultimately means that theres more than just one option for anybody who falls into a particular style of play. You may still want to drill down on one character and stick with them, though, since non-active characters level up far more slowly than the ones in the field, meaning you're setting yourself back several levels every time you switch if youre not actively leveling them all evenly. There's more than just one option for anybody who falls into a particular style of play. The gangs victims come in a wonderful array of shapes and sizes, many of them references to Kunio-kun history, beat-em-ups as a genre, or pop culture at large. They can be very tenacious and, until you get better crowd control tools, the way they simply surround you to wail away at your flanks can be enough to frustrate. Thankfully, most of those tough fights can be avoided by simply running to the exit, with relatively few scenes locking you into combat before you can progress. As with the first game, enemies you take down will occasionally surrender and plead to join your crew, which allows them to be used like assist characters in tag-based fighting games. River City Girls 2 goes a bit further, supplying a selection of NPCs who can join you without having to beat them into submission first  and thats another great way to circumvent grinding through opponents unnecessarily. I wish that there were a similar solution for the final hour  toward the end was especially tedious, when youre funneled through gauntlets of locked screens staving off wave after wave of bad guys in a climax that felt more like busy work then a final test. The stranger the distraction, the more I missed it when it was gone. I wasnt simply street fighting throughout the entire eight-hour adventure, though. Shortly after embarking on the quest to save the city, I found myself occasionally doing odd jobs like catching ghosts, robbing a Yakuza-owned bank, and training the locals in the lost art of dodgeball. The stranger the distraction, the more I missed it when it was gone. These were much-appreciated meanderings that helped break up the punch-drunk monotony. Equipping gear bought at stores sprinkled throughout the seven regions of the city helps even the odds in combat. Items that gave me a health shield when I was low or added elemental properties to my heavy attacks were my personal go-tos, but there are also options that alter almost every way you interact with River City Girls 2. Want to move faster? Theres an accessory for that. Want to hit just the male (or female) enemies harder for some reason, there's one for that too. Food items, though one-time use consumables, can be stored for when you need them and grant characters a permanent stat buff the first time they eat them. So if you do choose to grind, there will be plenty of places to spend all that hard-earned money. The map of River City is huge in River City Girls 2, much bigger than the previous games rendition. My first time kicking ass through locations like the vibrant fish markets of Ocean Heights or the sleek offices of the Technos complex were a treat because theyre so well drawn and colored. That said, the size of the city means that even with the presence of a fast-travel system I had to spend an awful lot of time backtracking through parts of the city to check boxes to progress the main quest. Also, many screens feature lots of obstacles and architecture that can become challenges for platforming or add a bit more tactical thinking to the fights you pick, but I found that I was just as often slipping off of edges or having my view of the action blocked by something in the foreground. But again, the scenery deserves attention. Character models and backgrounds have a chunky pixel style that, mixed with the silky smooth animations, capture a style and expressiveness that deserves to stand shoulder to shoulder with beautiful retro contemporaries like Streets of Rage 4 and TMNT: Shredders Revenge. This is also true of the music: Megan McDuffees killer soundtrack bangs with toe-tapping, genre-bashing instrumentals. Occasionally, youll walk into a room and hear some fun attempts at parodying local radio stations in the background. In some of the more prominent areas, songs feature lyrics from villains taunting you as you journey to them. Theres so much energy in the music that its hard not to be motivated to kick every face in the room. Whether you're a long-time fan of these games, or youve just been recently introduced to the beat-em-up by the genres renaissance over the past few years, River City should be your next stop. River City Girls 2s RPG elements, dense combat, and witty sense of humor is a real shot in the arm to a genre that has been celebrating its history lately, but also in need of some innovation. Here, by expanding on its 2019 revival of the foundational design concept laid all the way back in 1989, Wayforward has blended history seamlessly with modern day vibes to create something true to its roots and new on the scene at the same time. You might call being led back and forth through the citys map stale, but you cant say those locations arent gorgeous and full of great music.", "date": "Dec. 15, 2022,"}