{"name": "Young Rock - Working the Gimmick", "name_review": "Young Rock Series Premiere Review - \"Working the Gimmick\"", "ref": "https://me.ign.com/en/young-rock-working-the-gimmick/181736/review/young-rock-series-premiere-review-working-the-gimmick", "text": "Young Rock premieres on Tuesday, February 16 on NBC. Dwayne ~The Rock~ Johnson continues his genial dominance of Hollywood with a light and charming single-camera comedy look at his formative years growing up in the traveling carny world of '80s pro-wrestling, and then later as a defensive lineman for the University of Miami. Young Rock is a nice, amusing peek into the childhood and college years of one of the nicest entertainers in Tinseltown - even if it's possible that Johnson's overt amiability is part of a persona. Part of working the gimmick. Although, if that's true, there are worse acts to have than ~hard-working guy who's super gracious and courteous.~ Young Rock gently demonstrates Johnson's ability to make fun of himself. It's not a ~warts and all~ look at his life, but it's self-deprecating enough to create a charming time capsule that coats darker truths with sitcom niceties. If you're wholly unaware of the wrestling world, or even The Rock's tenure as one of the industry's biggest stars, then Johnson's upbringing, and iconic wrestling lineage, may be nothing more than a curiosity to you. If you are a wrestling fan though, these particular elements of Young Rock will hit differently, and hopefully, delight, as the series shows us not only Johnson's father, Rocky Johnson (Joseph Lee Anderson), and uncles Afa and Sika (Fasitua Amosa and John Tui), but also Andre the Giant (Matthew Willig), Iron Sheik (Brett Azar), Junkyard Dog (Nate Jackson), and many more. The curtain famously dropped on the wrestling industry in the late '90s, allowing fans to recognize (and appreciate) the artifice, but we've never really gotten a glance at this era of wrestling from a behind-the-scenes standpoint. The '70s and '80s era of wrestling, the apex of the ~Territory Days,~ was filled with famous journeymen who never broke the illusion in public since having people think wrestling was real was absolutely crucial to making money. Young Rock's first episode, ~Working the Gimmick,~ refers to wrestling's version of, well, ~dress for the job you want.~ Or, another way to look at it is kind of a ~fake it till you make it~ spin on manifesting. And it's a great concept to start with since it's very important to who Johnson is as a person. Johnson appears on the show, as himself in 2032, during the campaign trail for a presidential run (hah!), telling his life story to Randall Park (playing himself), who is always a welcome face and can currently be seen on WandaVision (as well as Young Rock creator Nahnatchka Khan's Fresh Off the Boat). It makes sense for Johnson to bookend these Young Rock episodes, as his anchoring powers are undeniable. But the true stars of the series are the young actors who play Rock during different, pivotal time periods. That's Adrian Groulx as the wide-eyed, 10-year-old Johnson, in awe of his wrestling father (despite dad's parade of broken promises); Bradley Constant as teenage Johnson, making his way through high school, constantly trying to come off as richer and cooler than he is (while his mom, played by Stacey Leilua, tries to bring him down to earth); and Uli Latukefu as college freshman Rocky, determined to make a name for himself after years of working to maintain his father's fame. This is where Young Rock truly finds, and works, its gimmick. By jumping Johnson back to these three ages, and using this device to craft the theme of the week (some episodes involve all three past Johnsons, some only one), Young Rock can touch on a wider variety of stories and get more creative with its famous fables. ~Working the Gimmick,~ as a premiere episode, is an entertaining introduction to the series, and to Johnson, as it offers up a lively sampler platter of his roots. Namely, the idea of making people believe you're great until, after sweat and determination, you get there yourself. Like wrestling itself, which is its own unique form of storytelling, Young Rock is an enjoyable blend of real and fake exaggerated. Like the man it's based on, this premiere episode is polished and endearing, with a handful of lines that will make you cackle. It's never truly irreverent enough to escape being more benign than groundbreaking, but it's still a good ol' time on the couch.", "date": "Feb. 17, 2021,"}