{"name": "Ys IX: Monstrum Nox", "name_review": "Ys IX: Monstrum Nox Review", "ref": "https://me.ign.com/en/ys-ix-monstrum-nox/181579/review/ys-ix-monstrum-nox-review", "text": "Adol Christin, the protagonist of Falcoms long-lived Ys series, is a real adventurers adventurer. He's been drifting from place to place since his journey began on Japanese PCs in 1987, collecting tales, meeting new people, and getting caught up in towns' supernatural business. In Ys IX: Monstrum Nox, Adol blows into the town of Balduq and discovers a particularly dark secret seething in its depths. His trouble is our gain: Ys IX is yet another deeply satisfying action RPG starring the red-haired sword-swinger. It has a lot in common with 2016's Ys VIII: Lacrimosa of Dana, but avoids feeling like ~just more of the same~ thanks to new abilities that make exploration fast, frantic, and fun. Unlike more serialized RPGs such as Trails of Cold Steel, it's easy to jump into Ys games because the storys mostly self-contained. Granted, there are a few jokes and references in Ys IX that are clearly for long-time fans, but the premise is simple: The story opens with Adol being arrested for his many, many crimes against the far-reaching Romun Empire, and his lack of surprise at the arrest is honestly funny. His interrogation, where he's grilled about certain Ys series' tropes (~Why do ships seem to sink when you're on them? How do you keep losing priceless historical relics?~) is also great. I laughed out loud when Adol acquired one of Ys IX's legendary swords, and one of the dialogue options was, ~I'm going to lose this, aren't I?~ During his escape, Adol ends up afflicted with a ~curse~  and an honestly badass wardrobe to go along with it. He's a ~Monstrum~ now, and is henceforth known as ~The Crimson King.~ (Is that a prog rock reference or a callout to Stephen King's The Dark Tower series? You make the call!) If he wishes to know the reason behind it, he must uncover the secret seething in the heart of Balduq's enormous prison. Thus begins a heck of a lot of sword-swinging. Ys XI's familiarity isn't boring.In that respect, Ys IX is an action RPG that  to reiterate a previous point  looks and plays similarly to the excellent Ys VIII. While Ys VIII added a whole new literal dimension to the series by bringing it into the 3D realm, IX doesnt have the same level of novelty, but its familiarity isn't boring. Hacking up foes across sprawling plains, ancient ruins, and lava-filled caverns to name a few is a good deal of satisfying fun, even if the environments outside of town are a bit visually bland. It's a while before you're allowed to see those locations, though, because a hefty chunk of Ys IXs roughly 30 hours of story takes place within the city of Balduq. I was initially a little bored, but my outlook changed when Adol gained his earliest Monstrum ~Gifts~  and these new movement powers are where Ys IX begins to feel different from its predecessor. Crimson Line lets him grapple from rooftop to rooftop, Hunter's Descent lets him glide, and Heaven's Run lets him run straight up walls. (~Hardcore Parkour!~) These early gifts alone let Adol Batman the hell out of Balduq  yes, I'm using ~Batman~ as a verb  and it became much easier to appreciate my time in the sprawling city. Gifts are employed in battle, too: Crimson Line zips you directly into an enemy's face, for example. (All the better to stab your eyes out, my dear.) For more of a challenge  and a deeper game  I recommend cranking the difficulty up.Fans of musou games like Dynasty Warriors will probably find themselves right at home in the moment-to-moment hacking and slashing your way through hordes of enemies. But like Dynasty Warriors, the combat in Ys IX isn't particularly deep or challenging, and Ys IX is a pretty quick game by JRPG standards as a consequence. For more of a challenge  and a deeper game  I recommend cranking the difficulty up. You still aren't going to get Souls-like battles or anything, but the harder monsters encourage you to learn patterns and use the cool and satisfying Flash Guard parry that slows down time after a perfect dodge. I personally took a little bit of extra time to wrap up quests and procure knick-knacks that can be used to upgrade weapons and create gifts for my comrades, and combined with exploration of the corners of the map that added a few more hours to my playtime. I was inspired to solve Balduq's problems and help out Adol's new pals.Ys games usually come with their fair share of fun characters and a compelling story, but I was surprised at how invested I was in Ys events and characters. Mind, one of the characters, the Monstrum code-named Feral Hawk, is a bog-standard edgelord who just wants to swear and fight, but I enjoyed my time with the rest of the cast. I particularly have soft spots for the sweet and shy White Cat and the sickly but determined Renegade. Adol's new friends play key roles in many of Ys IX's subquests, which are refreshingly meaty despite being short, and are often tied into Ys IX's overarching plot. While the main story challenges you to uncover Balduq's strange secrets, the subquests focus more on a budding revolution within the nation against its Romun occupiers. However, the revolution's old guard isn't happy with the way the hot-headed young revolutionaries are conducting themselves. (The revolution's former leader, a cigar-smoking octogenarian named Margot, is awesome.) Ys IX's story isn't as deep as what you'll find in a Trails of Cold Steel game, but I was inspired to solve Balduq's problems and help out Adol's new pals. The friends Adol makes in Ys IX become important during the Grimwald Nox, a tower defense minigame that pops up at key story moments. The name is new but the concept isnt: these missions are very similar to the base defense minigame in Ys VIII, right down to your rescued friends cheering you on and offering stat buffs and heals. You also use monster loot to craft defenses like canons and towers that inflict invaders with status ailments like sleep and poison to soften them up before you jump into combat. It still doesnt feel fully fleshed out as a tower defense game, since you can't freely decide where these defensive tools should be placed, which means theres not a lot of strategy to be had in the Grimwald Nox. But there is a lot of intense swordplay as waves of demons bear down on you, hell-bent on destroying the Sphene crystal that must be protected. Once I learned that you shouldn't skimp on beefing up the Grimwald Nox's defenses (seriously, don't), I started having a lot of fun in these twisted, monster-infested dimensions. You can just turn off your brain and put yourself on ~auto~ while you cut into monsters and collect their loot drops. It feels good, and hey, it's cheaper than therapy. Unfortunately, the busy Nox battles make it easy to spot one of Ys IX's drawbacks: frame rate drops in busy areas, especially in the Coliseum region of Balduq, some of which persisted even after the launch patches. I also noticed texture pop-in, and a full-on game crash during one Grimwald Nox battle. I didn't lose too much progress thanks to Ys IX's robust auto-save system, but it's always a bummer when PlayStation 4's Blue Screen of Death puts a sudden end to your fun. The more I played Ys IX, the deeper I fell for it. It looks, plays, and sounds similar to Ys VIII, but its emphasis on story and new movement abilities like grappling, gliding, and wall-running gives it a flavor of its own. Better still, action RPG fans who've long been ~Ys-curious~ can jump into Ys IX without fear of missing out on the ongoing story. The Court of the Crimson King welcomes all adventurers, new and old.", "date": "Feb. 11, 2021,"}