{"name": "Little Nightmares II", "name_review": "Little Nightmares 2 Review", "ref": "https://me.ign.com/en/little-nightmares-2/181504/review/little-nightmares-2-review", "text": "Horrors lurk around every corner in Little Nightmares 2s sinister city setting. This deadly game of hide and seek picks up where the original left off, this time with an entirely new set of twisted tormentors hunting you through a variety of dread-inducing locations. Its a formula that works, and Little Nightmares 2 certainly has its fair share of exhilarating moments over the course of its fleeting, four-hour duration, but it also plays things a little safe, utilising many of the originals puzzle-solving and stealth mechanics. Instead of being a shocking new horror, Little Nightmares 2s stalk through the shadows ultimately proves to be somewhat of a retread. New protagonist Mono may look different to the original games Six, donning a paper bag mask in place of her distinctive yellow raincoat, but his skill set is largely the same. The key difference here is Monos ability to pick up and wield a handful of different weapons to either smash through specific sections of the scenery, or to swat away smaller enemies like the disembodied hands that stalk you through Little Nightmares 2s hospital level. Additionally, Mono is equipped with the services of Six herself, since she tags along as an AI-controlled partner through much of the journey. Sixs role is that of a slightly more proactive version of Yorda from Ico, but her relationship with Mono doesnt really evolve into the partnership that made the PS2 classic so special. Watch Your Six Instead, Six acts as a handy guide whenever one of Little Nightmares 2s adult antagonists gives chase, blazing a trail a few yards in front of you and indicating, for instance, which crate to hide behind a split second before a lumbering farmer can unload a shotgun spray. This obviously helps to minimise trial and error in more high pressure sequences, but her companionship doesnt really introduce much in the way of teamwork as far as puzzles are concerned. Yes, theres a dedicated input for beckoning her over to your position, but I dont really recall ever actually needing to use it in order to coordinate a way towards a puzzle solution. There arent any complex mechanisms that demand to be operated in tandem, and it doesnt really ever get more dynamic than simple synchronised acts like climbing on top of a piano lodged among some broken floorboards and timing your jumps so that the combined force of your landing can propel it downward into the basement. Its admittedly quite adorable the way Six will occasionally mimic Monos actions; when he picks up an important puzzle item, shell often scoop up a wooden building block and amble along behind him, shadowing him like a younger sibling. But much like a little sister, Six also often finds herself getting in the way, stubbornly standing still to block your path while youre dragging a piece of furniture, or accidentally nudging you out of cover when youre trying to remain hidden from the watchful gaze of a wide-eyed warden. While Sixs inclusion eventually has a surprising story pay-off late in Little Nightmares 2  in a way I wont spoil here  her presence feels largely underutilised for the bulk of the adventure. It also breaks the immersion somewhat that Mono is so easily spotted the moment he sets foot outside of the shadows, yet Six can seemingly stumble around in the spotlight right under an enemys nose and attract about as much attention as a broken television set. Big Trouble in Little Nightmares Speaking of which, busted boob tubes are found littered along your path through Little Nightmares 2s gloomy narrative, which appears to be a sardonic commentary on the screen obsession of modern society. This leads to some hilariously dark moments later on when, after Mono has picked up a discarded TV remote, hes able to toggle these goggleboxes on and off to draw the focus of certain enemy types and lure them to their death like media-loving lemmings. As was the case with the original, it's the villains that really are the stars of Little Nightmares 2.And as was the case with the original, its the villains that really are the stars of Little Nightmares 2. There are a number of genuinely terrifying creations hellbent on sniffing you out, but the one that had me most on edge was the school teacher with the serpentine neck. Just hearing the leathery squeak of her stretching spine off-camera was enough to make me wince, but the appearance of her dead-eyed grimace bobbling at the end of it and twisting its way up towards my elevated hiding spot in the classrooms rafters was a genuinely chilling sight. How you avoid these hulking towers of terror, however, is by relying on mostly the same simple stealth techniques established in the original; crouch-walking to quieten your footsteps and scurrying between the shadowy undersides of tables during the short windows in which their gaze is averted. One stand-out section of Little Nightmares 2 satisfyingly strays from the norm by giving Mono a torch that freezes prosthetic-limbed hospital patients in place anytime theyre caught in its beam. Its a startling effect to watch them shift from inanimate statues in the light to shuffling silhouettes in the dark as you quickly whip the torch around to halt their approach from all angles, and I wish there were a few more interesting departures like this along the way. Even so, Little Nightmares 2 is still much better at flight than it is at fight, and the small amount of combat on offer failed to engage me to the same degree as the consistently hair-raising stealth. While I certainly savoured the visceral thrill of feeling my controller rumble as I dragged a heavy sledgehammer along the floorboards before pulverising the porcelain skull of one of the school sections bullies, I found judging the arc of my swing frustratingly imprecise anytime an enemy was above or below Mono in relation to the 2.5D camera viewpoint, often leaving me open to a counter-attacking pounce from an enemy and an instant death. Spatial awareness issues also left me accidentally veering off of ledges during certain platforming sections, a problem thats unfortunately a hangover from the original game. At least this time around the checkpoints are frequent and reload times feel much speedier, so clumsy moments like these arent as annoying as perhaps they could have been. Little Nightmares 2 is every bit as black, bleak, and eerily beautiful as the original. Its also just as brief, and although the reintroduction of the Six character as an AI-controlled co-op partner ultimately serves the story well, shes not used as a vehicle to take the games puzzle-solving and stealth to interesting new places, which seems like a real missed opportunity. While I still very much enjoyed each thrilling encounter with its menacing mob of monstrosities, the overall sense of familiarity this time around meant that Little Nightmares 2 left less of a lasting impact. Theres no doubting developer Tarsier Studios artistry and ability, but I hope for its next project it leaves these Little Nightmares behind and dares to dream bigger.", "date": "Feb. 9, 2021,"}