{"name": "The Medium", "name_review": "The Medium Review", "ref": "https://me.ign.com/en/the-medium/181076/review/the-medium-review", "text": "There are always two sides to every story, but rarely does the audience get to experience them both at the same time. Such is the novel gameplay hook central to The Medium, an enthralling psychological horror adventure that splits your focus between a gloomy real-world setting and a haunting parallel spirit world, with actions performed in one having a measurable impact on the other. Its a stylish and clever technique thats used to consistently engaging effect, allowing for some stimulating puzzle design and exhilarating moments of reality-hopping cat and mouse with a truly memorable monster. I quickly warmed to the self-deprecating charm of The Mediums split-screen scream queen, Marianne. Shes a spirit guide who is lured to an abandoned resort in the Polish hinterland hoping to uncover the origin of her clairvoyant abilities, and her consistently wry observations  delivered by actress Kelly Burke  kept the mood from becoming too dire in what is an otherwise intensely disturbing detective tale. Determining the extent of the evil atrocities that went down within the hotels walls and identifying the perpetrators soon becomes the main focus, one that I took great morbid delight in as I pieced together each and every sinister scrap of evidence along its bloodsoaked breadcrumb trail. Much of the clue gathering is admittedly fairly straightforward in a mechanical sense, using Mariannes insight ability on discarded objects found in the world to reveal information about the fate of their owners, for example, or to highlight the ghostly footsteps that point the way forward. But elsewhere there are some satisfyingly hands-on methods you need to employ, and I particularly enjoyed the simple pleasure of arranging trays of photography chemicals and dunking the paper in the right sequence of solutions in order to develop a photo correctly in a dark room. (Remember developing photos? ... No? Okay.) Dual Shocks Of course, almost every room in The Medium is a dark room, and they only get darker. At predetermined points along the main story path the screen will split to reveal the spirit world side by side with the material world, and youll suddenly be controlling two versions of Marianne at the same time. Its an incredibly striking contrast; on one side of the screen the flesh and bone Marianne will be moving along a dimly lit hotel corridor, on the other, her silver-haired spiritual form will be stalking through a hollowed-out hallway to Hell. On both sides of the divide the environments are exceptionally well realised, but its the spirit world that is particularly eerie to explore, with unearthly tendrils sprouting from the floors, outstretched hands clawing at you like stalactites from the ceiling, and your general surroundings resembling a nightmarish landscape the likes of which isnt normally seen anywhere outside of a heavy metal album cover. On that note, in this otherworld you frequently reveal new areas by slashing through sheets of human skin with a blade made of bones, which also sounds like the opening lyric to the most metal song ever made. You frequently reveal new areas by slashing through sheets of human skin with a blade made of bones.Displaying both realities at the same time isnt just done for stylish effect; theres a practical purpose, too. During these times Marianne is able to trigger an out-of-body experience, relinquishing control of her earthly self for a short period of time in order to send her spiritual form to areas otherwise unreachable within the mortal realm. In fact, the complimentary use of mortal and spiritual abilities is paramount to solving the bulk of The Mediums puzzles which, while never stumping me enough to halt the surging story momentum, still required a substantial amount of lateral thought that extended to either side of the split. This can be as simple as sending Mariannes spirit to deliver a blast of energy to power the fusebox of a broken elevator or, in a more memorable sequence later on, manipulating the hands of a grandfather clock in the real world to scrub forwards and backwards through time in the spirit realm, revealing clues to a hidden door from the phantom presences that appear along the timeline. That said, its not just the haunted souls of the hotel youll have to contend with, but also the ghosts of horror games past. There are plenty of odd-shaped keys to find, valves to turn, and broken lever handles to repair, which on paper may sound like dated throwbacks to the likes of Alone in the Dark. However, its the use of Mariannes reality-phasing abilities to uncover and obtain these items that makes The Medium feel distinct, and that kept me engaged in clearing a path through its increasingly ominous obstacles. Always Leave Them Wanting Maw The other force propelling me forward was The Mediums principal villain, The Maw. While I certainly enjoyed the strong performances from Marianne and the small supporting cast (both human and spiritual) its Troy Bakers uncharacteristic and entirely unsettling turn as The Mediums chief antagonist that really steals the show. It's Troy Baker's uncharacteristic and entirely unsettling turn as The Medium's chief antagonist that really steals the show.The Maw is a malevolent manifestation that haunts Marianne throughout her journey, first within the confines of the spirit world but eventually following her back into reality. Much like Resident Evil 2 and 3s monstrous pursuers, The Maw cant be killed, only avoided, which keeps tension levels high as you shift back and forth between realities not knowing how or when hell appear; he might burst in as his imposing demonic form in the spirit world, or as a more camouflaged spectral silhouette in the real one. Baker brings real menace to The Maws crazed mutterings as he stalks you through each setting, oscillating between guttural growls and tormented whimpering, and its his lumbering presence combined with creepy ambient sound design and an anxiety-inducing score that had me forging my way towards The Mediums gripping conclusion while forever looking over my shoulder. I say that metaphorically, since you cant actually look over your shoulder in The Medium. Well, not on purpose at least. While each of developer Bloober Teams horror games to date have been in first-person, from Layers of Fear 2 to Observer to Blair Witch, The Medium is a strictly third-person affair, appropriating the multiple fixed camera angles of the early Resident Evil and Silent Hill games that change up from room to room. Apparently this decision was partially born out of necessity, since giving free control over the camera was reportedly causing nausea during the dual-reality sections. Yet while the many claustrophobic close-ups and cinematic angles certainly contribute to an ongoing sense of trepidation, The Medium doesnt have the power to manipulate or disorient you as deviously as Bloobers previous first-person games. It isnt able to unsettle you by diverting your attention one way in order to rearrange the environment behind you, for example. Its a hair-raising ride regardless, but the most disoriented I ever felt during the eight hours it took to complete the story was anytime the camera suddenly switched angles and I had to course-correct with an awkward stutter step like someone whod just narrowly avoided walking into the wrong bathroom by accident. The Medium uses a unique reality-shifting ability to bring a new dimension to some tried-and-tested genre puzzle-solving mechanics. It presents an intriguing mystery to unravel and adds a tangible sense of urgency to your investigations by placing a truly memorable villain hot on your heels. It isnt able to play with perspective as effectively as some of Bloober Teams other work, but its brilliantly paced and palpably tense. An absorbing and nerve-racking journey from the shriek of its first jump scare to its very last gasp, The Medium delivers a psychological horror adventure thats all thriller and no filler.", "date": "Jan. 27, 2021,"}