{"name": "Hitman 3", "name_review": "Hitman 3 Review", "ref": "https://me.ign.com/en/hitman-3-tba/180862/review/hitman-3-review", "text": "Agent 47s unique brand of slow-paced stealth in an assortment of dense, deadly, and deeply varied murder playgrounds has reached a wonderful crescendo in Hitman 3. While it doesnt stray from the killer chord combination developer IO Interactive crafted for 2016s Hitman  and continued to use in 2018s Hitman 2  its abundantly clear here that the studio has well and truly mastered its act. With some of the most surprising and imaginative levels in the series so far, Hitman 3 may feel largely familiar to its two most-recent predecessors, but just thinking of the hours upon hours of chaos, carnage, and cruel comedy that each of its six outstanding new maps will produce makes me giddy. This final chapter of IOs World of Assassination trilogy that began with 2016s Hitman might be better thought of as an expansion than a sequel. If youve bounced off Hitman before  particularly in the last five years  know that theres been no big reinvention of the bald blokes blueprint in Hitman 3. The interface and controls have remained consistent in their stiffness, and the range of uses for your weapons and items arent drastically different, either. The most notable new toy in Hitman 3 is a camera which can be used to hack or examine switches and items, which is handy but not really a game changer. The true strength of Hitman 3, then, is found in its maps. All six of Hitman 3s beautiful and strikingly well-lit levels are amongst the strongest of the series, so much so that its hard to pick a standout favourite. Things get off to a fairly stunning start, with 47 parachuting onto the worlds tallest building in Dubai and infiltrating its opulent interior, but that high bar is maintained throughout. The follow-up mission is a nod and a wink to Contracts Beldingford Manor map and takes 47 to a similarly massive UK country manor where one entertainingly ironic route to killing your target involves posing as a detective whos there to solve a murder on the property. From there its off to a massive German rave for a mission that oozes atmosphere and puts an interesting twist on hunting down your five targets amongst the throngs of sweaty, 24-hour party people, and then to Chongqing, China, where the glow of neon lights, the reflections in the soaked streets, and the trickle of rain down 47s jacket combine for perhaps the most visually impressive mission of the series so far. The next stop is an Argentinian vineyard that reminded me of Blood Moneys excellent A Vintage Year map, only vastly bigger; then the finale is a fabulous surprise unlike any Hitman mission to date, and one which I sincerely hope isnt spoiled for you. Its tricky to speak about these locations in too much detail without ruining the thrill of strolling through them and revealing massive new areas you had no idea existed, but these environments are truly some of the most memorable and remarkable maps IO has ever created  from the intimidating verticality on display while perched on the outside of the highest skyscraper in the world to the rustic charm of Thornbridge Manor. Im equally hesitant to reveal the quirky assassination opportunities they contain but I will say Hitman 3 contains both the funniest and the most complex Hitman kill Ive ever played  and at least one of the most-dastardly  and there are still many I havent got to yet. Yes, a lot of the kills are gentle remixes of ones that have come before, but theyre still cleverly built up. A Wolf Among Sheep As always, the slow-burn thrill of these games comes from planning, patience, and hiding in plain sight. The key to success is finding the perfect disguise for exploration, listening and looking for opportunities, and getting the timing just right to pull off the perfect crime and escape unseen. Its an unapologetically single-player experience that rewards rational thinking over rushing, although it is flexible enough to cater to both extremes: those who prefer to follow the multilayered mini-stories playing out within the levels to make invisible, surgical strikes and disappear without a trace, and those who like to improvise and leave behind piles of dead and unconscious men in their underpants stacked like cordwood. You can get away with all of this because the often hilariously nave AI is still easy to exploit as ever. Of course, tricking the dopey guards and civilians with unexpected distractions and suspicious items has emerged as such a fundamental part of the puzzle solving in the current Hitman trilogy, and Ive actually grown to love these dumb bastards over the years. These folks wont even blink an eye at a severe-faced stranger whos wearing the clothes of a man theyve very recently had a conversation with and, while that does rob stealthy victories of believability at times, this kind of suspension of disbelief is simply necessary for Hitman to function. As grim as the murder-for-hire premise seems on the surface, this has always been a cheekily self-aware series that relishes in a general degree of silliness and gallows humour. These great levels are linked together by the conclusion to the limp story arc that kicked off in 2016. While this hackneyed story of competing shadow organisations is unlikely to have Netflix power brokers sprinting to the nearest chequebook, its nice to have it wrapped after five years  even if its been entirely inessential to my enjoyment of the levels themselves. Now, at least, well be able to move on to something thats hopefully a bit different. Greatest Hits The biggest advantage of there not being any revolutionary changes in Hitman 3 is that owners of Hitman and Hitman 2 can carry over their levels and progress to Hitman 3. Theres a certain tidiness to rolling the trilogy into a single product that I really like, and I admire IOs commitment to keeping the previous games content alive like this. On Xbox Series X this is mostly seamless; as an owner of both previous Hitman games on Xbox One, Hitman 3 was automatically augmented with all previous maps, although the progression carry-over functionality wasnt operational for me at the time of review. The PC situation is hindered somewhat by the shift from Steam to the Epic Games Store, though IO Interactive has gone on the record that an import feature will be available within weeks. Its also proven to be a little unruly on PlayStation 5. Despite having both previous games installed, Hitman 3 is directing me to further downloads to allow access  neither of which are available at time of review. The lack of native support for PSVR on PS5 also meant I had to download and install the PS4 version of Hitman 3 alongside the PS5 version, which is a bit of a messy solution  but thats really on Sony rather than IO. For its part, IO provides a free digital copy of the PS4 version to all who buy the PS5 version so nobody misses out. When you get it up and running, Hitman in VR is worth a dabble if you own a PSVR, though really only to experience its general slapstick goofiness first-hand. You have to play with the DualShock 4 because the Move controllers just dont have enough buttons and, while it can generally handle melee attacks, the shooting experience is really quite cumbersome, imprecise, and irritating as a consequence. The end result is a system that winds up marooned halfway between full motion controls and traditional controls  which I found regularly brain-bending and occasionally stomach churning. Theres no denying that getting access to all of Hitman and Hitman 2s levels in VR is incredible value  and its a novelty feeling as if youre truly inside these levels  but its janky, primitive, and really not the best way to play. Rich, rewarding, and highly replayable, Hitman 3 is a superb instalment of IOs idiosyncratic but much-loved stealth series. The fundamentals havent changed since 2016 but its collection of outstanding maps makes for a refined, reliable, and robust curtain-closer to the current Hitman trilogy. Six maps may sound slim but each one is huge and designed to be played several times over  and even then its very unlikely youll have uncovered all of its creative and surprising assassination opportunities. There really isnt a weak one in the bunch. This barcoded butcher has made a lot of appearances over the past 20 years, but Hitman 3 is definitely one of his best.", "date": "Jan. 19, 2021,"}