{"name": "Factorio", "name_review": "Factorio Review", "ref": "https://me.ign.com/en/factorio/180694/review/factorio-review", "text": "Rags-to-riches survival games are a dime a dozen these days, but Factorios wild ambition and open-ended format takes the potential for complexity up several notches. It starts you off as a spaceship crash survivor with only a pickaxe with which to explore its randomly generated 2D planets, but stick with it long enough and you can build all the way up to fighting aliens with tanks and creating manufacturing megastructures in seconds with a personal robot swarm. While it gets a little slow in certain places and its ultra-complex logistics chains can be overwhelming, the rewarding depth that can be extracted from its whirring conveyor belts and steam-belching power plants are worth the trouble. The most important thing to understand about Factorio is that it's one of those games you probably won't figure out how to play optimally through trial and error alone. My first couple of experimental factories ended up being such a mess that I decided it was better to simply abandon them and start over rather than trying to salvage the tangle of assembly lines and mining drills I had created before I understood some key tricks and common pitfalls. Youre best off doing your homework and reading wikis and watching tutorial videos, or bringing along a friend who knows what they're doing in multiplayer, because Factorio wont guide you away from frustrating disaster. That's not necessarily a bad thing, though, as anyone whos played great games like Minecraft, Dwarf Fortress, or Crusader Kings can tell you. Factorio scratches some similar itches with its intimidating but exciting depth: once I got into a groove, learning how to weave underground conveyor belts to connect extractors to refineries to multiple layers of factories to create an optimal assembly line, I found expanding and upgrading my factory almost Zen at times. And it's pretty forgiving of mistakes, since you can rearrange machinery fairly easily and without cost, so it's actually unlikely you'll mess up so badly you can't save it on the default difficulty. It just takes a little time. I found expanding and upgrading my factory almost Zen at times.Everything from your astronaut to the heavy industrial equipment is drawn in a readable, colorful pixel art style, which cuts down on the overall stressfulness a lot. It's usually very easy to see which buildings are making what, if they're getting enough power, and where all of your supply lines are going. That said, the interface like everything else  takes some getting used to. There are tons of hotkeys and keyboard shortcuts that let you perform important tasks quickly and precisely, but it took quite a bit of fumbling before hitting Z to manually feed items to a machine or shift-clicking to duplicate a factory's output onto another became muscle memory. Progression can feel a bit tedious now and then, like when you realize your next level of science  which is researched by manufacturing different colored science units out of various materials  requires two products you don't have, and each of those is made from two or more secondary products you also don't have, which may even require you to seek out new raw resources far from your main base. And also you're running out of copper again so you need to explore new areas of the map and build an outpost that can supply more to your main base. Trying to figure out what steps I needed to take and in what order could give me a slight headache, and theres a fair amount of repetition involved in setting up a new supply line that works exactly like the previous ones but with a different extractor building. But the satisfaction of getting everything working properly is a hell of a drug. What really saves Factorio from slipping into monotony are some key techs that can totally change the way you play, and theyre spaced nicely through the tree. Unlocking trains lets you ship large quantities of materials quickly over long distances on a schedule. Cars, and later tanks, give you personal mobility and a major combat advantage against this alien world's single-minded insectoid inhabitants who resist your industrial revolution. And eventually, populating your base with autonomous drones will allow you to do things like move resources from extraction sites to refineries without a maze of conveyor belts, or even copy and paste large, multi-part structures for easy expansion. Its one of those games that feels like it doesn't even really start until youre 20 or more hours in and have access to a lot of tools that make your life much easier. And even after more than 40, my most advanced factory still has a lot left to unlock. The map is sprawling enough to accommodate some truly magnificent and intricately designed manufacturing facilities  the only limit is what you can wrap your head around and your CPU finally saying enough is enough. You need to prevent your logistics puzzle from being smashed to bits by aliens.Making little optimizations to save space and increase throughput isn't all you'll be concerned with, though; youll need to prevent your logistics puzzle from being smashed to bits by those ever-expanding alien nests. Nearly all of your machinery generates some pollution, even if you move completely to green energy, which will justifiably agitate these creepy crawlies if it reaches their habitats and cause them to attack in waves until your every creation is obliterated. Defending your bases with walls and turrets is viable, but I found it more exciting to take the fight to them and make sure there were no active nests anywhere near my base or outposts. The early enemies are pretty trivial, and you can plink away at them with a basic pistol effectively. But the longer you play on a given map, the more they'll evolve new unit types. You need to keep up in the arms race by researching better guns, better armor, and unlocking military techs like tanks, artillery, and combat drones or you'll eventually be overwhelmed. The clever interplay between the different enemy types makes taking down their bases a hectic challenge as you have to dodge acid-spitting worms and use the terrain or your own pre-built kill zones to avoid getting surrounded. Later techs, like modular power armor customizable with energy shields, personal drones, and more, slowly turn you into a futuristic superhero. If the default bugs aren't challenging you enough, or you don't want to deal with them at all, the map generator has tons of settings to customize your experience, too. You can play on a peaceful map with lots of trees and water, a desolate death world that's literally crawling with foes from the very beginning, or anything in between. And Wube Software did itself a favor by making Factorio extensively moddable: tons of add-ons are available already from the lengthy early access period to give you an even more control over your set-up or add new techs and extra quality-of-life features. The sheer amount of stuff there is to do in Factorio is breathtaking and a bit frightening. Even with over 40 hours on my most-played save, some of the higher-end factories I've seen others build look like absolute witchcraft  its the kind of game that can become a second job if you let it. But thanks to an ever increasing alien threat and some well-placed keystone techs that give you new toys and really change things up, I never hit a point of complete monotony where I felt like I was just building things to build more things for no particular reason. I could easily see myself sinking hundreds more hours into this elaborate contraption, seeing how big I can build and trying out totally new base layouts. It's got a very high buy-in to learn, but Factorio rewards you with entertaining logistics puzzles and a sense of ownership over something colossal and impressive if you put the time in.", "date": "Jan. 14, 2021,"}