{"name": "The Midnight Sky", "name_review": "The Midnight Sky Review", "ref": "https://me.ign.com/en/the-midnight-sky/180366/review/the-midnight-sky-review", "text": "The Midnight Sky was released in select theaters December 11 and starts streaming December 23 on Netflix. Matt Fowler reviewed this movie via a digital screener. Amidst the doomsday dystopia genre, the two main branches seem to be ~hope~ and ~desolation.~ When the latter is done right, you get something scintillatingly sorrowful like The Road. When the former hits its mark you get Children of Men. Or even a roaring coaster like Fury Road. The Midnight Sky, Oscar winner George Clooney's latest directorial effort and based on the novel ~Good Morning, Midnight~ by Lily Brooks-Dalton, can't figure out which it wants to be and that results in an emotional but empty endeavor. Sadly, like the way most Netflix original movies tend to land, The Midnight Sky feels lacking, as if there are ingredients missing required to cook up a fully-realized film. (Not from a production standpoint, as the movie itself is quite lavish and almost too expensive-feeling for the personal story it's mostly trying to tell.) There is a heart, and specialness, to the movie but it often gets drowned out by big action set-pieces -- be they in the arctic or in space -- that feel rather extraneous. It's a sign that, maybe, a bit too much care went into making this feel like an epic when the blood and bones story itself needed more attention. In the not too distant future, Earth is a ravaged, iced-over wreck. Clooney plays a dying scientist, Augustine Lofthouse, in a remote arctic outpost that's been fully evacuated after (from the looks of the knobs and dials) nuclear reactors all over the world have finally gone kablooey because of the freeze. Clooney's emaciated Augustine discovers a mute girl left behind, Iris (Caoilinn Springall), and together, after a bit of bonding, they set out into the unforgiving frost to reach a different base where they can contact a spacecraft called ther and tell them not to return (since the world is now a brutal ball of death). Clooney and Springall are great together and deliver the best moments in the film. There are a few twists and turns that are fairly easy to predict but most of that's forgivable because Clooney's very good at interacting with a character who gives not-much back and Springall is able to express quite a bit with her doe-eyed glare. Again, the resolution is not quite as important as the journey here, so their almost-dreamlike mission together to send out a warning signal results in a handful of powerful moments of realization and survival. The fact that the Augustine half of the movie feels deeper might be because, well, he's the only character in the movie given layers, as spare as they are. Brief flashback sequences, featuring Star Trek: Discovery's Ethan Peck as a young Augustine (dubbed by Clooney), let us in enough to help us connect more with Augustine's trudge through freezing temperatures. Up in space, aboard the ther, The Midnight Sky's second story sort of languishes in underdevelopment. On their way home from a habitable moon of Jupiter, the previously undiscovered K-23, the ther crew thinks they're coming home with good news to help rescue the remnants of humanity. Felicity Jones, David Oyelowo, Demin Bichir, Kyle Chandler, and Tiffany Boone make up this last-surviving space mission and they're all mostly short-sheeted when it comes to character development. It's also in the space segments where you'll find the highest cost for the smallest reward. Money floods the screen for disaster set-pieces that you already know while watching don't ultimately mean anything because the crew trying to survive them are headed toward a dead-end anyway. While Augustine tries to find a stronger antenna back at home, the ther crew spends most of their time sorting through their own communication issues so they can contact Earth. It's a lot of effort on both ends just to basically hear ~Hey, the world is dead so...go back to that moon?~ This is supposed to be this film's version of hope, but it lands with a thud. Because at that point, five people making a U-turn aren't going to make a huge difference, humankind-wise. The greatest parts of The Midnight Sky come from smaller, more personalized moments and the actors performing them. The film is very pretty -- admirably so, in fact -- but none of the gloss actually adds to the story. If anything, the movie might resonate better as a low-fi offering rather than something with a bloated budget. The Midnight Sky didn't need to reportedly cost close to $100 million dollars when the strongest elements and themes came down to two characters sharing a heartfelt moment or when the film as a whole feels like a pair of soulful eyes with not much going on behind them. George Clooney's The Midnight Sky is a gorgeous, glossy doomsday odyssey that feels like too big a winter coat on a small, fragile frame. Clooney's moments with young Caoilinn Springall, who plays a mysterious girl left behind in a remote arctic station, resonate the best as does their trek through the frozen wasteland. The crew of the spaceship ther, in the film's B-story, land with less magic and majesty, however. The muddled end result is a mix of emotion and emptiness.", "date": "Dec. 24, 2020,"}