{"name": "Cyberpunk 2077 for Xbox One and PlayStation 4", "name_review": "Cyberpunk 2077 for Xbox One and PlayStation 4 Review", "ref": "https://me.ign.com/en/cyberpunk-2077-for-xbox-one-and-playstation-4/180160/review/cyberpunk-2077-for-xbox-one-and-playstation-4-review", "text": "While I had just as much fun playing Cyberpunk 2077 on PC as Tom did playing for his review, on the base PlayStation 4 or Xbox One it is a different game entirely. It fails to hit even the lowest bar of technical quality one should expect even when playing on lower-end hardware. It performs so poorly that it makes combat, driving, and what is otherwise a master craft of storytelling legitimately difficult to look at. It is not an exaggeration to say that Ive felt nauseated after playing because of the terrible frame rate. It really is that bad, and its very suspicious that CD Projekt Red refused to provide console review copies ahead of launch. In my original tests on patch 1.02, frame rate dipped into the teens on Xbox One during key story moments involving combat, and while patch 1.04 promised more stability, it still struggles to maintain 30fps and crashes are still frequent. At best it will regularly crash to the system screen on Xbox One; at worst itll hard-lock your system and you have to turn it off and on again. In short, neither the PS4 or Xbox One is able to hold a steady frame rate, and they often freeze altogether for seconds at a time. On the base model Xbox One, it appears to be running at less than 720p resolution at times (though that fluctuates due to dynamic scaling). Even so, you can expect to see it drop as low as 10 frames per second during combat, which is all but unplayable, and its around 20fps even when youre doing simple and routine things like walking outside in the introduction. The PS4 is slightly better in performance and stability since patch 1.04, but at the sacrifice of texture load-in time. Characters will often appear blocky while you wait an agonizingly long time for their faces to show up to the party, and geometry or textures will sometimes fail to appear even with all the effects like film grain and motion blur turned off. The Xbox One/PS4 version is nearly unrecognizable compared to the PC version. Both platforms have several major issues with the open world, such as signs that have no graphics at all until they eventually load in about five seconds later (making it impossible to navigate without the map) and explosions or effects that happen comically late or fail to trigger at all. Its not just visual: the enemy AI will sometimes break and wont shoot at you. The excellent voice acting is one of the few things that holds up  everything else is nearly unrecognizable compared to the PC version. Even the PS4 Pro and Xbox One X, which have some problems of their own, are a huge step up from this technical mess. If your only option right now is playing Cyberpunk 2077 on either of the base console platforms, I highly suggest you dont play at all until its many terrible performance issues are fixed. And if youve already bought it and had an experience similar to what Ive described, you should absolutely get a refund if possible. The PlayStation 4 and Xbox One versions are simply not in an acceptable state, and it makes me sad to think that so many people are having their first Cyberpunk 2077 experience ruined this way  because when it works, its a fantastic RPG.", "date": "Dec. 15, 2020,"}