{"name": "Call of the Sea", "name_review": "Call of the Sea Review", "ref": "https://me.ign.com/en/call-of-the-sea/179882/review/call-of-the-sea-review", "text": "All great puzzle games not only consist of lots of smaller problems to solve along the way, but one overarching conundrum to unpack on your journey. They take you to a mysterious place full of intrigue and the unknown, a place which by the end of your time there youve uncovered all of the secrets it held inside. The stunning island setting of Call of the Sea does exactly this as youre led through each of its puzzle-laden areas, gradually revealing the answers to an engrossing story full to the brim with beauty and darkness. Its clear from the get-go of this four to five-hour first-person adventure where its inspirations came from. The shadow of Lovecraft hangs heavy over the island, with echoes of other-worldly creatures and pearlescent The Colour Out of Space tones littering the landscape at times. Never does it descend into pure horror, though, and stays firmly put in the more dreamlike elements of the Lovecraftian spectrum, with aspects of Guillermo Del Toros work also present. In particular, The Shape of Water appears to have a big influence throughout  romance, fantasy, and well, water are big themes here. Its fundamentally about the lengths well go to for the people we love. And like true love, Call of the Sea is reciprocal; the more you invest in its characters and story, the more gratification youll ultimately receive when choosing between its equally affecting and poignant endings. The more you invest in its characters and story, the more gratification you'll ultimately receive. Call of the Sea is not without a sense of adventure, though, and borrows heavily from the 19th-century novels of Jules Verne and H. G. Wells as you travel to a mysterious location and unearth its history as well as the remnants of an ancient civilization. Theres a genuine feeling of discovery as you follow in the tracks of your characters explorer husband, Harry. You play as Norah, a woman suffering from an unexplained illness, the cure for which is the reason Harry ventured to the south Pacific in the first place. Shes expertly voiced by Cissy Jones (of Firewatch and The Walking Dead fame) who carries the story on her shoulders for almost all of its runtime with occasional support from Yuri Lowenthal (Marvels Spider-Man) as Harry. Similar to Firewatch, Call of the Sea has a personal story to tell with a healthy dose of mystery thrown in. Its very well written on the whole and concisely tells its story through internal dialogue, letters, and painted murals without ever becoming confusing or dull. Its in these internal thoughts, however, that some of the writing doesnt hold up. It occasionally feels unnatural, with the obvious stated on more than one occasion. It didnt detract too much from me enjoying the story as a whole, but did at times leave little to interpretation or genuine discovery and what felt like it couldve been an enticing open mystery sometimes became an expedition in exposition instead. An adventure game is only as good as its puzzles, though, and in this regard Call of the Sea excels. As much as its story and aesthetic influences are clear to see, its gameplay is firmly rooted in classics such as the Myst series. Each chapter tends to have one large puzzle to solve in order to move onto the next area, and its surrounded by numerous smaller problems to solve in order to find the main solution. An adventure game is only as good as its puzzles, though, and in this regard Call of the Sea excels. They start off fairly basic but build in complexity as you move deeper into the heart of the island. Some conundrums share similar mechanics, whether that be translating symbols or pressing a series of disparate buttons in a correct order, but no two are identical. Theres a sense of progression in difficulty that goes hand-in-hand with the story, meaning the puzzles hit a real sweet spot for me and my head felt appropriately scratched. They were never so simple that I felt I wasnt being challenged, but also never obtuse to the level of me being stumped. This is much appreciated, as with a story-heavy game such as this you never want your momentum to be slowed as you await the next plot developments. Its a hard thing to balance, but Call of the Sea achieves this throughout. It constantly brings in surprising new mechanics and ways to move around its world. Each new set of puzzles brings a new set of ideas to the table whether on land, or occasionally, underwater. A favourite section of mine had me trying to bring an oversized dormant organ back to life and work out how to play the correct series of musical notes in order to proceed. Theres always a satisfying pay-off to these larger puzzles as well in the form of significant narrative advancements or pure visual spectacle. Each of these areas will have you travelling back and forth between locations in order to do things in the right order. This can become a little laborious over time, as Norah isnt the fastest walker, and while you can move slightly quicker by running it isnt enough of a speed boost to ease the pain. What does make slowly strolling your way across the island and back more bearable is that theres plenty of stunning scenery to take in. Each biome houses its own delights, whether that be the tropical tones of a bird-song filled clearing or the harsh crashes of waves set against lightning poetically cannoning off a shipwreck. No two areas feel the same, and indeed not all of them feel of our world, but theyre all attention grabbing in their own ways. The classic look of 1930s posters and postcards is infused into the art style and allows for colours to burst off of the screen. An experience packed with beauty and wonder that hides a dark mystery bubbling beneath its surface. This paradisiacal setting allows for the more foreboding and unusual architectural and artistic elements of the island to stand out more than they would do in a less naturally tranquil place. In essence it mirrors the themes and story of Call of the Sea perfectly; an experience packed with beauty and wonder that hides a dark mystery bubbling beneath its surface. Developer Out of the Blues debut game is a gorgeous homage to the films and games that inspired it. Through engaging Myst-style puzzles and a captivating story, Call of the Sea triumphs in bringing its island alive, along with the characters that have explored it. It delivers a short-lived but engrossing experience through stunning art direction and an excellent voice cast, with the biggest of its minor annoyances being a slow movement speed. If a fun, but emotionally affecting adventure is what youre searching for then Call of the Sea most definitely answers that call.", "date": "Dec. 9, 2020,"}