{"name": "AMD Radeon RX 6800 XT", "name_review": "AMD Radeon RX 6800 XT Review", "ref": "https://me.ign.com/en/amd-radeon-rx-6800-xt/179414/review/amd-radeon-rx-6800-xt-review", "text": "The wait is finally over: Navi 2.0 is here. Ive spent the last week putting the Radeon RX 6800 XT and RX 6800 through their paces to see how they stack up against our stable of last generation graphics cards and Nvidias RTX-3000 Series. In this article, Ill be focusing on the RX 6800 XT but be sure to check out our separate RX 6800 review as well. Coming to market at $649, the RX 6800 XT undercuts the price of the Nvidia RTX 3080  but does it have the performance to stack up? AMD Radeon RX 6800 XT  Design and Features If it werent for the branding, I would think the Radeon RX 6800 XT was a third-party card. Compared to last generations AMD Radeon RX 5700 XT, its bigger and looks better, throwing out the blower-style cooler for a triple fan design and a 2.5-slot heatsink. At 267x120mm, is a far cry from the case-challenging Nvidia RTX 3090 and should fit in most mid-tower PC cases with ease. Visually, its a major upgrade from the minimalist 5700 XT and looks equal parts spaceship and muscle car. I like it. Of course, looks only go so far. What really matters is what that heatsink is keeping cool. The RX 6800 XT is built on AMDs RDNA 2 architecture. Like the RX 5700 XT, it uses AMDs 7nm process, but the transistor count has more than doubled, going from 10.3 billion to 26.8 billion. With that, the GPU has received a massive expansion in Stream Processors, which are responsible for game rendering. Last generations 5700 XT featured 2560 SPs, while the 6800 XT bumps that all the way to 4608. Likewise, it features 72 Compute Units, up from 40 last-gen, and each has its hardware level ray tracing unit (which well get to shortly). It marries that with 16GB of GDDR6 memory (topping all but the RTX 3090 from Team Green) on a 256-bit bus bearing a total bandwidth of 512 GB/s. If you recall from my review of the RTX 3080 Founders Edition, the RX 6800 XTs main competitor, this memory configuration isnt as fast. The RTX 3080 uses the cutting edge GDDR6X and offers a maximum memory bandwidth of 760 GB/s. If we go down a step to the RTX 3070, we find a much more apples to apples comparison since it is also running GDDR6 on a 256-bit bus. There, the 6800 XT is substantially faster than the RTX 3070s 448 GB/s. In other words, this Navi GPU has faster memory than you might expect from GDDR6, but it still doesnt compare well to the G6X in the RTX 3080. In real world terms, I wasnt able to notice any difference while gaming, but its worth being aware as game engine development continues to advance. The guaranteed clock speeds are impressive, though as weve seen with cards for a number of years, they really only hint at what the cards may achieve. The Radeon 6800 XT offers a Game Clock of 2015 MHz and a Boost Clock of up to 2250 MHz. AMDs Radeon Software comes also with several presets, including the much anticipated Rage Mode (which raises the power limits on the card), and an automatic overclocking option that removes the legwork from figuring out a stable, notched up frequency. Even without those, I was surprised to see what the card was capable of. Loading up a game with complete stock speeds, the RX 6800 XT immediately ramped up to 2400 MHz and pushed just shy of 2500 MHz with Rage Mode engaged. Compared to the RTX 3070 or RTX 3080, which would maybe hit 2 GHz without a manual overclock, you can see how impressive that speed boost is. Before moving into the architecture, you should also know that the card features one HDMI 2.1 output and two DisplayPort 1.4 with integrated Display Stream Compression (DSC) for running high performance gaming monitors. It also includes a USB Type-C output for easily connecting virtual reality headsets. RDNA 2: The New Architecture To really understand the RX 6000 series and how the specs above come into play, we have to dig a little deeper into whats going on within the chip itself. RDNA 2 is a big leap forward for AMD and offers real world benefits for gamers. AMD quotes 1.54x performance per watt compared to last-gen and up to 1.3x higher frequency. What that means, in essence, is that watt for watt the RX 6000 series is going to kick out more frames at a higher frequency than the original RDNA architecture was capable of. One of the ways it accomplishes this is through its brand new store of Infinity Cache. Both the RX 6800 and RX 6800 XT feature 128 MB of rapid access, on-die storage that increases the bandwidth of the built-in video memory. Rather than have to draw on the VRAM, RDNA2 maintains a pool of important data on the GPU itself for near-immediate access, and actively maintains it to reduce latency. This accounts for a share of the gains I introduced previously, but is also more energy efficient, reducing the overall power demands of the card as a whole. Likewise, its a primary reason for the incredible clock speeds the card is able to offer. If that name sounds familiar, it should. Infinity Cache is directly related to the Infinity Fabric found on AMDs Ryzen CPUs. More than any generation before it, the RX 6000 series draws on the connection between CPU and GPU for elevated performance. As a result, theres a real benefit to running a new AMD CPU along with your RX 6000-series GPU. AMD leverages this synergy with a technology it calls Smart Access Memory. By running both AMD components on the AMD 500-series platform, your Ryzen CPU is able to directly access all 16GB of the 6800 XTs memory. AMD claims an average FPS improvement of 6% with results that can go as high as 15% in Forza Horizon 4 at 1440p. Since our test platform is based on the Intel i9-9900K, I wasnt able to test these for myself, but based on the performance results I saw, even a 6% improvement does well to close the gap between or even beat the RTX 3080 in some titles. Enabling Ray Tracing One of the biggest curiosities leading up to this launch was how the RX 6000 series would handle ray tracing. While Nvidia features a whole separate RT Core in its RTX architecture, RDNA 2 instead bakes ray tracing into its existing Compute Units with new Ray Tracing Accelerators. Each CU features a single Accelerator, so every clock cycle  up to 70 of them  can be leveraged for four ray tracing intersections each. This performance is also enhanced by the Infinity Cache and is further enhanced you have the CPU, GPU, and motherboard synergy above with Smart Access Memory. Even with those enhancements, trying to run ray traced games at 4K is a tall order, even for the best gaming GPUs. Nvidia accomplishes this with the help of its AI-powered Deep Learning Super Sampling (DLSS) technology to intelligently upscale games to higher resolutions without the same performance penalty. At launch, AMD has no answer for this technology, which means ray tracing at a particular resolution is much more taxing than those that support DLSS with Nvidia (which, to be fair, is still a fairly small, yet growing, number). AMD did share that gamers can expect a solution to come  a technology they call FidelityFX Super Resolution, but there is very little known about it or when it may actually release. In the gaming landscape today, its still a minority of games that support ray tracing, but since Nvidia was first out of the gate, many of those that do also support DLSS. Apples to apples, AMDs RX-6000 series is at a significant disadvantage in these cases as DLSS will allow Nvidias RTX cards to run at much higher frame rates, even at 4K. As youll see, enabling ray tracing at this resolution often drops frame rates well below 60 FPS. In many cases, games are still playable but arent nearly as smooth. This isnt the case at 1440p, and the RX 6800 XT does an admirable job of enabling no-sacrifices gameplay at that resolution. Given that, its worth taking a close look at how you want to play, and how long you may need to wait for FidelityFX Super Resolution if 4K with ray tracing is on your list of must-haves. That said, I remain impressed at the impact of Radeon Image Sharpening, which algorithmically applies a sharpening filter but only to the areas of the screen that need it. This technology was highlighted as part of the RX 5700 XT launch and has since gone mostly under the radar. Gaming at 1440p with ray tracing on and Radeon Image Sharpening enabled isnt quite 4K, but it is an improvement over normal 1440p without a major FPS loss. The other thing to know is that the Radeon RX 6000 series uses Microsofts DXR platform, not RTX. That means, games designed specifically for RTX ray tracing will not automatically work with DXR cards like the RX 6800 XT. While that might seem obvious, that does mean that some games that can do ray tracing wont do ray tracing with these cards, such as Wolfenstein: Youngblood. That said, in the roster of games I had available to test, Wolfenstein was the only one that had this issue. Radeon Anti-Lag, Radeon Boost, Content Creation This launch isnt all about hardware, though, as AMD has a couple of neat software tricks up its sleeve and some real highlights for streamers and content creation. The first is a technology called Radeon Anti-Lag and can work in conjunction with its second, Radeon Boost. Together, they aim to reduce input latency, improve performance and make games feel more responsive. Radeon Anti-Lag works by controlling the pace of CPU tasks to better sync with GPUs in graphics-card-limited scenarios. By its design, this can have a minor impact on frame rate (several frames a second) but in my testing does make games feel more responsive. Im far from a competitive gamer, so the fact that its perceptible even to me bodes well for competitive gamers in hardware-limited scenarios. Radeon Boost, on the other hand, dynamically adjusts your resolution to increase performance. Unlike the resolution scaling you might be familiar with from console implementations, Boost only kicks in during bursts of motion when youre unlikely to perceive any difference in visual quality. This improves overall performance, and when used in conjunction with Radeon Anti-Lag, makes competitive gaming feel more fluid and responsive. With little to no visual difference, theres little reason not to use these features if you enjoy twitch shooters and need the lowest input possible. Finally, the RX 6000 Series also brings with it the most recent codecs for streamers and content creators. In addition to traditional H.264, it also features H.265/HEVC and AV1 decoding for reduced bandwidth, higher quality game streaming. AMD Radeon RX 6800 XT  Performance Test system: Z390 Asus ROG Maximus XI Extreme Motherboard, Intel Core i9-9900K CPU (stock), Corsair H115i PRO RGB 280mm AIO CPU Cooler, 32GB Corsair Vengeance RGB Pro DDR4-3200, 1TB Samsung EVO Plus NVMe SSD, Corsair HX1200 1200-watt power supply. Now that we have a better understanding of the card itself, lets take a closer look at how it performs. All tests were performed at ultra settings to determine how the RX 6800 XT performs under pressure. In contrast to our prior GPU reviews, I have expanded ray tracing testing to include 1440p in a wide variety of tests to better demonstrate the different levels of expected performance. Since Rage Mode was highlighted as a gateway to improved performance, I included tests with Rage Mode enabled as a separate entry. I tested this preset at 4K only due to time and to examine the impact it would have in the most challenging scenarios. As I mentioned previously, our test system is built on the Intel Z390 platform, so we were unable to take advantage of Smart Access Memory. If youre gaming on a system that does have that hardware, your results will likely be slightly higher than what I was able to document. AMD Radeon RX 6800 XT  Synthetic Benchmarks Starting with our synthetics tests, the Radeon RX 6800 XT performed very well, topping the charts in Fire Strike and coming in second to the much more expensive Nvidia RTX 3090 Founders Edition in Heaven. These are rasterization tests, however, and dont engage each cards ray tracing capabilities so I turned to a series of additional benchmarks to see how it would stack up there. The Ray Tracing tests begin to tell a different tale. 3DMarks Port Royal tests find the RX 6800 XT falling short of the RTX 3090 and 3080 while still maintaining a lead over the RTX 3070. In Surgical Scalpels Boundary benchmark, the lack of DLSS support puts the RX 6800 XT at less than half the FPS of even the RTX 3070. It fares a little better in 3DMarks Ray Tracing Test, but still falls short of any of the RTX cards. Synthetics are good for comparing GPUs, but dont necessarily say much about actual gameplay performance. Lets see how it did in gaming benchmarks. Heres where things get interesting. To say that it leapfrogs last generations RX 5700 XT is an understatement. In the games above, the RX 6800 XT explodes the frame rate at every resolution. FPS is 66% higher at 1080p, 77% higher at 1440p, and 81% higher at 4K. Generation over generation, thats simply phenomenal; however, given that this is a 6800 XT and last generation topped out at 5700 XT, its possible we might see a more apt comparison in the future. For now, this is what we have and the results are extraordinary. Compared to the RTX 3080, the RX 6800 XT is surprisingly competitive. It trades blows across games and resolutions. The RTX 3080 maintains the overall lead, but often by such a margin that its unlikely to be perceived during actual gameplay. That said, without an equivalent to DLSS, ray tracing performance is much lower, as evidenced in Metro: Exodus. There, the RX 6800 XT delivered 65 FPS at 1440p but dropped to 35 at 4K. By contrast, the RTX 3080 offered 89 FPS at 1440p and 64 at 4K. Even without upscaling, the RX 6800 XT still surpassed the RTX 3070 at both 1440p and 4K resolutions. Lets take a look at 4K in particular with a wider variety of games. For these tests, I narrowed down the focus to the current generation of 4K cards, excluding the RTX 3090 which is in an entirely different tier of price and performance. With this expanded selection of games, some ray traced and some not, several things become clear. First, when we look at pure rasterization, the RX 6800 XT is a beast. In default mode, it averages only 4% slower than the RTX 3080 (3% with Rage Mode enabled). Try to play something with ray tracing enabled without DLSS and the gap becomes a chasm. Remember, most games supporting RTX today also support DLSS. Without that feature, the RX 6800 XT is 40% slower on those games and 18% behind the RTX 3070. The exception to this is the recently-released Dirt 5 which does not have DLSS and performed much better on the RX 6800 XT. Those numbers are both surprising and promising, so if this is an example of things to come, then maybe this wont be an issue at all. Without a crystal ball there is no way to tell for certain. Looking at the entirety of our test roster, however, the RX 6800 XT was 23% slower than the RTX 3080 but 3% faster than the RTX 3070. Rage Mode offers a performance improvement, but it's small at only 1% on average The other thing to note here is that Rage Mode does offer a performance improvement, but its small at only 1% on average. At the same time, since the cooler is able to keep the card well within safe limits and it doesn't result in much if any additional noise, theres not a lot of reason not to have it on unless you plan to overclock. So what can we take from this? First off, if you dont care about ray tracing, the RX 6800 XT is an excellent way to game at 4K while also saving money. I would also consider this card if youre currently at 1440p and looking to upgrade in the future. At that resolution, it can deliver 60+ FPS at ultra settings even with DXR enabled. While youre waiting to make the resolution jump, AMD should be well on the path to delivering its own scaling solution. If youre already gaming at 4K and do care about ray tracing, this probably isnt the card for you. At least not yet. AMD Radeon RX 6800 XT  Thermals and Acoustics When it comes to temperature, AMD bases its throttling on a relatively high junction temperature (the hottest spot on the die) of 110C. The GPU temperature, on the other hand, is the figure we typically look at, which often lags behind the junction temperature. This is important because even though the RX 6800 XT runs fairly hot at 89C peak in our testing, the junction temperature never reached its 110C throttle point while gaming. Even after hours of benchmark testing, it was able to maintain a clock rate in the 2400 MHz range, which is impressive. Still, 89C is hot for a high airflow case like my Lian Li LanCool II and this is dramatically higher than the 69C average I observed on the RTX 3080. With its triple fan solution, the Radeon RX 6800 XT generates more noise than Nvidias current RTX line-up. Its not loud, but did overtake my case fans slightly, clearly allowing me to hear when the GPU would spin up. Given the revised temperature load, its clear to see that AMD has carefully balanced acoustics with thermal performance and has done well walking the line. The Radeon RX 6800 XT is a great graphics card for ray traced gaming at 1080p and 1440p and comes within spitting distance of the RTX 3080 for rasterization at 4K. If youre gaming at 4K and interested in ray tracing, it may be best to wait until FidelityFX Super Resolution releases and provides an alternative to DLSS, but in pure value for dollar, this card is a winner.", "date": "Nov. 19, 2020,"}