{"name": "LEGO Star Wars Holiday Special", "name_review": "LEGO Star Wars Holiday Special Review", "ref": "https://me.ign.com/en/lego-star-wars-holiday-special/179381/review/lego-star-wars-holiday-special-review", "text": "The LEGO Star Wars Holiday Special is now streaming on Disney+. For those looking for a sweet, off-kilter addendum to the Star Wars Sequel Trilogy -- one that will most assuredly leave you with a bigger smile than The Rise of Skywalker did (if it left you with a smile at all) -- the new LEGO Star Wars Holiday Special is a charming and calamitous cross-time caper that blends all three trilogies together like never before. Using the original (cult car-crash-you-can't-look-away-from) 1978 Star Wars Holiday Special for inspiration, the LEGO Star Wars Holiday Special takes place after the demise of the First Order, post-Rise of Skywalker, and reunites Rey, Finn, Poe, and Rose for a celebration of Life Day on Kashyyyk. Those familiar with the original special will delight (maybe?) at the return of Itchy, Malla, and Lumpy while those who've been to Galaxy's Edge at a Disney theme park might appreciate the multiple Fried Endorian Tip-Yip references. Yes, this special is designed to cater to all levels of Stars Wars fandom, and all eras of Star Wars cinema. For all of its flaws, The Rise of Skywalker did give fans the first adventure featuring Rey, Finn, and Poe as a crusading trio instead of keeping them mostly separate throughout the movie. It was odd to wait to do that until the very end of the saga, but it was still a great thing to have happen before it was all over. The LEGO Star Wars Holiday Special sort of revisits this and builds on it, giving us more time with these characters as true friends -- albeit a very silly time. Again, this is a comedic, winking, even self-deprecating take on the Skywalker Saga but it still, in a strange way, wraps things up better than you'd ever anticipate. As Rey struggles to train Finn in the ways of the Force, Poe and company try to put together the perfect Life Day party. Rey's journey takes her to through time and space to search for secrets from past Jedi masters, bringing her through -- we'll just say -- the saga's greatest hits. From Hoth to Dagobah to Tatooine podracing to a young Obi-Wan complaining about trade disputes (and even a quick Mandalorian scene), Rey sort of ~time heists~ her way through all nine movies, creating a big, joyful swirl of Star Wars nuttiness full of meta-gags like Kylo Ren's shirtlessness, Jar Jar's senate speech, and an errant Greedo ~Maclunkey!~ And just like how the Avengers' time heist in Endgame unleashed a past Thanos, Rey inadvertently ropes Return of the Jedi's Emperor Palpatine into the journey and causes some fun friction between Kylo and his grandfather, Darth Vader. It's here that the special finds its true hilarity as the Dark Side, which is usually incredibly dour, is a great source for some laughs. We don't ever get to see someone like Palpatine cut loose outside of Robot Chicken. Here, voiced by Trevor Devall, the Emperor is quite the cut up. The majors stars of the Sequel Trilogy aren't around to provide voices in the way that, say, the original Star Wars Holiday Special had Mark Hamill, Carrie Fisher, and Harrison Ford on deck, but Kelly Marie Tran, Billy Dee Williams, and Anthony Daniels are in it as well as Star Wars: The Clone Wars vets Matt Lanter (Anakin Skywalker), Tom Kane (Yoda, Qui-Gon Jinn), James Arnold Taylor (Obi-Wan Kenobi), and Dee Bradley Baker. Look, the LEGO Star Wars Holiday Special isn't ground-breaking, and it can be fairly corny a lot of the time, but it'll surprise you with how much it puts a nice pretty bow on top of the entire franchise. Ultimately, it's a better send-off in many ways than Episode IX. The LEGO Star Wars Holiday Special might just be an unexpected treat for those looking for an extra bit of closure on the Skywalker Saga. It is all at once abundantly silly, cringingly corny, and marvelously meta. It will also divide fans. I mean, what better way to usher back in the Star Wars Holiday Special?", "date": "Nov. 18, 2020,"}