{"name": "NBA 2K21 for Xbox Series X and PlayStation 5", "name_review": "NBA 2K21 for Xbox Series X and PlayStation 5 Review", "ref": "https://me.ign.com/en/nba-2k21-for-xbox-series-x-and-playstation-5/179315/review/nba-2k21-for-xbox-series-x-and-playstation-5-review", "text": "Usually with cross-generation games like this, when we play on the shiny new boxes we expect to see the exact same game but prettier. However, the PlayStation 5 and Xbox Series X version of NBA 2K21 uses the opportunity to take the ambitious leap forward that the Xbox One and PlayStation 4 version didnt. Everything feels newer and bigger, from the jaw-dropping variety in presentation to the giant City that can be explored in MyPlayer. It doesnt shake the bad habits that rob the existing version of greatness, though: were still stuck with unnecessary grinding, putrid pay-to-win microtransactions, and a host of problems that seem like a direct result of NBA 2K21s ambition. Theres a lot to be excited about, but much like a fast-break dunk gone awry, sometimes flash is less important than substance. But my goodness does it look great. Everything on the court  and everything revolving around it  in NBA 2K21 is a technical marvel. Player models are incredibly detailed - so much so that I would frequently pause the game and watch a replay just to slow things down and appreciate it. Watching players expressions change as they contact each other in the air or fight for position off-ball is truly impressive. Even beyond the players, the sidelines feel so much more alive and dynamic. After years of watching static (or sometimes non-existent) movement courtside, its one of the first details I noticed about NBA 2K21. The unfortunate side-effect of all of this realistic glamour is that when things break down, like when a player stares blankly into the void at the freethrow line, it looks odder than it would otherwise. Still, NBA 2K21 is a good representation of what the new set of consoles are capable of graphically. Im not sure why 2K needed the power of the Series X and PlayStation 5 to pull it off, but in this version we get an entirely new broadcast team calling the game. Brian Anderson, Grant Hill, and Allie LaForce add to what is already the best play-by-play and color commentary in sports video games. Its refreshing to get a break from Kevin Harlan every once in a while, especially because the new team provides a slightly more grounded approach to Harlans dazzle and enthusiasm. Still, Anderson and crew deliver the excitement when it counts. Especially for those of us who pour hours into play-now or franchise modes, having some diversity in the booth provides a welcome change of pace. The new-gen version of NBA 2K21 addresses many of the legacy issues that have plagued the franchise for years.Between the hoops, the new-gen version of NBA 2K21 addresses many of the legacy issues that have plagued the franchise for years. Players being warped into uncontrollable animations happens much less frequently, and as a result theres more efficacy when on defense. Positioning isnt just about reacting anymore; it can be employed as a strategy. There were several times, particularly in matches online, where my usual ability to drive past aggressive defenders with someone like Kevin Durant has been stilted due to being out-positioned. Unfortunately, the A.I. doesnt take advantage of this in the way that it probably should. They were frequently overly aggressive on players who can drive but cant shoot well, such as Markell Fultz. This makes it far too easy to get into the lane for an explosive dunk or easy foul call. What We Said About NBA 2K21 for Xbox One and PS4 Verdict: When its clicking, NBA 2K21 has some of the best gameplay in sports video game history. But thats been true for several years now, and though this years iteration improves on a handful of things, most notably the aimed shooting mechanic, there hasnt been much movement. At the same time, its a shame that 2Ks focus isnt on the fun you can have on the court, but instead the money that can be extracted from your wallet off of the court in the MyCareer and MyTeam modes, which just arent fun to grind through without paying. Maybe the new set of consoles on the horizon will bring a fresh start for the NBA 2K franchise, but right now I feel more pessimistic about the series future than ever.  Ben Vollmer, September 10, 2020. Score: 6 Read the full NBA 2K21 for Xbox One and PS4 review Movement also feels a lot better, with foot planting resulting in less sliding and more nuanced play. Again, the real beneficiary here is how it feels to play defense. Tapping the analog stick to one side or the other doesnt result in a big move; instead, it results in the controlled player taking a quick step to the left or right to adjust position. One of my favorite refinements has been the ability to position yourself for a charge when playing against someone overly eager to drive the lane. The emphasis on position makes mid-game battles more fun and engaging than they have ever been in the past. The tradeoff is that the changes to the movement mechanics seems to result in accidental out-of-bounds happening far too frequently, especially involving the A.I. There were several instances where the CPU would dribble the ball out of bounds in really important situations, breaking the immersion that NBA 2K21 works so desperately to achieve. Movement also feels a lot better, with foot planting resulting in less sliding and more nuanced play.Similarly, other new issues crop up as a result of some of the changes. The pick-and-roll is incredibly hit or miss, and frequently results in a far-too-easy basket for the offense. The off-ball defender doesnt switch matchups when its appropriate and often sinks on players it shouldnt, such as Steph Curry. This is likely a side-effect of the animations being less automatic than they were in the past, but given that the pick-and-roll is such a common tool, its a glaring issue. Off-The-Court Problems NBA 2K21 makes quite a few changes outside of the arena, too. MyCareer features the same disappointing story from the previous-generation versions, The Long Shadow, but it now includes a branching storyline that involves going to the G League out of highschool instead of playing for one of the 10 available universities. The story follows mostly the same path as it did on the PS4 and Xbox One, though I did enjoy additions like the return of some characters that had made appearances in previous 2K stories, such as the over-the-top Jackson Ellis. That said, theres an option to skip The Long Shadow and head straight to the NBA, and Id still advise taking it. The writing is rarely any good, and the G League games are a slog to get through. The rest of MyPlayer, however, has seen an ambitious overhaul. The City is a brand-new area to roam and explore with created players, and its absolutely huge. In fact, its arguably far too big. Even with a decent map to help guide me, it took far too long to get from one end of The City to the other. There is too much unnecessary padding, such as restaurants you cant interact with and large construction sites that seem to exist for no reason. The City also seems to be capped at 100 players, which might seem impressive, but this isnt a battle royale. Given that there are four different affiliations and a handful of courts per affiliation, those numbers are spread incredibly thin. In my experience, finding a 3-on-3 matchup can take anywhere between five and 10 minutes, which almost totally defeats the purpose of the incredibly fast loading times. The City is huge and just feels empty.Even worse, The City just feels empty. There isnt much to do but shop around, and with only 100 people on the server at once, it often feels like roaming Grand Theft Auto without anyone to interact with. The people I did see out and about were almost always zooming by on a skateboard at a choppy frame rate. Its such a striking juxtaposition, seeing the gorgeously lit urban environment, only for it to feel empty and unengaging. The City does feel like it could be really interesting, but that would likely involve increasing the server capacity by an awful lot - which doesnt feel entirely realistic, given that the servers feel spotty at best already. Another issue with MyPlayer is that it takes an exceedingly long time just to get to The City. Before you can, you have to graduate from Rookieville, a slot of courts available only to players new to the online MyPlayer experience. Its not a horrible idea in theory, especially because the more limited server population makes for smoother matches, but you cant squad up with friends here and the lack of apparel options leaves most players looking exactly the same. It took at least 10n matches for me to progress past Rookieville, and once my reputation was at Pro level I was never able to go back. It just felt like an unnecessary buffer for veterans of the series, especially when there are options to skip over other parts of the mode. Your MyPlayer can't transfer over from the previous generation version, shining a spotlight on the gross microtransactions.Adding to the frustration of all of this is that your MyPlayer cant transfer over from the previous generation version, which meant that the dozens of hours I poured into my previous character were entirely lost once I started playing on the Series X. This is likely due to the myriad changes in the mode, including a revamped badge system, but it shines the spotlight square on the gross microtransactions that can make the grind back to a high rating a whole lot easier. Even with the Legend Edition I was provided with, I was only able to get my player up to a 75 overall rating or so and I was instantly surrounded by players with higher skill levels because I didnt want to purchase additional Virtual Currency. Even though getting dunked on can be fun, Id rather it be because I got outplayed than because I didnt drop an extra $100 on my players skills. Its really a shame, especially because MyPlayer has so much potential to be one of the best and most complex game modes in sports game history if it ever stops trying to wring cash out of us. Microtransaction Reaction [Note: This is the same as the Xbox One/PS4 version, so we've reprinted it here.] Its a big problem that just about everything in MyCareer and MyTeam requires VC because its tremendously expensive to purchase. Even at a discounted rate (which gives you a slightly better rate the more you spend), $20 is only enough to get your MyCareer player a dozen or so overall points higher  though when you consider that it took me the entirety of the six-hour MyCareer campaign just to improve a handful of points, NBA 2K21 makes it awfully tempting to spend. Especially for anyone wanting to play at a high level in the first couple months, it will mean hours and hours of grinding for VC or spending a lot of extra money. Allowing people to advance a character in a competitive game is always a terrible idea. One of my favorite additions to NBA 2K21 is The W, which allowed me to create a WNBA MyPlayer. Its worth noting that its is drastically different and thin on features compared to MyPlayer; for example, theres no story mode in The W and you cant explore The City with your created player. Still, there are some exclusive features that can only be played inside of WNBA MyPlayer, such as a really nice indoor 3v3 court that served as my favorite place to play. Unfortunately, finding matches proved even more difficult here, but I was eventually paired with some A.I. teammates and opponents. The rest of the revised modes are hit and miss. MyLeague and MyGM have been fused into the new MyNBA, which proves to be a nice change. Its nice to get the best of both worlds, which includes the in-depth customization of MyLeague and the role-playing elements of MyGM. The new menu navigation is similarly convenient, as it gave me the ability to jump around from trade prospects to coaching decisions in the matter of a second or two. NBA 2K21 really takes advantage of the quick loading times and its never more evident than in MyNBA. Another nice addition is being able to control a WNBA league, which serves as a nice change of pace given the smaller player pool and difference in gameplay styles. Another nice addition is being able to control a WNBA league.While MyTeam is more of the same, especially as it pertains to grinding out card packs or spending loads of Virtual Currency to get the players you want, the Play Now experience online was surprisingly fun. Latency still proves to be a problem, but my experience felt much more smooth than it has in the past. The gameplay changes really benefit online play, where defense feels a lot more focused than in the past and using stars like LeBron James to control the offense feels better than ever. I also never had a problem finding matches and didnt experience any disconnects in more than 10 matches online, which is not something I could have said about the previous gen version. NBA 2K21 jumps into the new generation of consoles with a heaping pile of ambitious upgrades. On and around the court, its one of the best sports game experiences Ive ever had. The movement is fluid, the presentation is startlingly good, and NBA 2K21 leaves a lot of the franchises legacy issues in the dust. The rest of NBA 2K21, namely everything it does off the court, feels like the first half of an alley-oop. Theres so much potential in the MyPlayer experience that its maddening that things feel so empty and heavily dependent on pay-to-win progression mechanics. Still, the new MyNBA mode has plenty of depth and streamlines things in a refreshingly simple way, and the ability to take on most of what NBA 2K21 has to offer through the WNBA is a really important addition. Ultimately, its just frustrating to see NBA 2K21 pass up what seems like it should be an easy slam dunk.", "date": "Nov. 17, 2020,"}