{"name": "Marvel's Spider-Man Remastered", "name_review": "Marvel's Spider-Man Remastered Review", "ref": "https://me.ign.com/en/marvels-spider-man-remastered/179313/review/marvels-spider-man-remastered-review", "text": "After playing Marvels Spider-Man: Miles Morales on PlayStation 5, it wouldve been really tough to go back to the PS4 version of 2018s best superhero game. Fortunately, Insomniac has retrofitted Peter Parkers adventure with all the outstanding tech it developed for Miles, including improved lighting and frame rates, ray-traced reflections, lightning-fast load times, and DualSense haptic feedback. And they replaced Peters face which is weird, but at least it showcases the major improvements to facial animations. This is a game that was already worth replaying on PS4, but now that its on PS5 its a great time to revisit New York and see it at its best. Back in my original Marvels Spider-Man review, I called it Great, highlighting its awesome swinging through of New York City, its excellent Peter Parker story, and battles with familiar villains. I griped a bit about some suit powers being way better than others and the repetitive optional missions being a drag but its overall one of the best superhero games ever made. Two years later, all of that remains true, even next to the open-world side mission improvements I just played in the amazing Miles Morales adventure. Insomniacs original Spidey tale is still a great Peter Parker adventure, even with a new face, featuring a great clash between the lives Peter leads both behind and out of his mask. And yes, its certainly jarring at first to see that face appear instead of the PS4 version, but I pretty quickly grew accustomed to this new look. Now Ive come to like it more than the original. It looks more age-appropriate and more in line with the boyish but confident charm of Yuri Lowenthals memorable performance. His take on Peter still stands tall as one of my favorites, buoyed by Laura Baileys still-wonderful Mary-Jane, William Salyers broken Otto Octavius, and more. Re-experiencing Insomniacs story has delighted me as much as it did the first time around, particularly in the wonderful first moments of Peter and Mary-Jane on screen together, Spider-Mans friendship with Yuri Watanabe, and some of the bigger personalities of Peters foes. Improved facial animations, less plastic-y skin, and realistic hair tech add more realism to the chemistry between Peter and MJ, with a satisfied smirk betraying Peters hope that theyll get back together, as well as the despair Otto experiences when his lab is shut down. Its a big step up. Looking Back: What We Said About Marvel's Spider-Man on PS4 ~I was left delighted at nearly every step of its 15-hour adventure thanks to a surprisingly deep tale that mines the plights of both Spider-Man and Peter Parker to great emotional success. Underpinning that engrossing narrative is an excellent set of webswinging mechanics, which -- combined with fun gadgets and plenty of puns -- makes for thrilling action in both the massive setpieces and in the quiet, confined corridors of tense sequences. Insomniacs first foray into the realm of Marvel superheroes is a continually exciting adventure whose open world and combat are only occasionally caught up in a web of overly familiar trappings.~ Characters benefit from the re-done lighting system, and so does everything else it touches. From beautiful moments at dusk as the sun fades, to indoor interiors of Fisk Tower using the buildings many modern light fixtures to more realistically brighten the space, everything just looks more beautiful. And married with ray traced reflections in the fidelity mode, New York comes alive in a way that just wasnt possible on the PS4. I mean seriously: it has turned one of Spider-Mans most common tasks, stopping a car chase, into a beautiful light show of neon signs reflecting off cars and buildings as I chased the thieves and webbed them up all through the city. Its as shiny and bright as strolling through Times Square at 2AM actually is, all without the real-life headache you probably have...if youre strolling through Times Square at 2AM. The DualSense is used pretty much exactly as it is in Miles Morales, which is excellent in helping to translate the sensation of playing as Spider-Man in more detail than ever before. I may never get the sensation of webslinging in real-life, but the DualSenses haptic vibrations, trigger resistance, and a subtle thwip from the controllers speaker do an admirable job of recreating what I imagine itd be like. Likewise, if you have a 3D audio headset like the Pulse 3D, you get a nice extra level of immersion as the sounds of sirens go by in the distance and angry New Yorkers tell you to watch where youre going as you run by on street level. But of course, my soundbar still does a perfectly good job of capturing the layered sounds of Insomniacs New York as I swing through the streets. Even if youve already beaten or even platinumed it on PS4, Id recommend checking out how much more vibrant Insomniacs New York City is. Its a different time of year than Miles Morales Christmas setting, so it offers a different enough visual palette even though Id just played that game. And all the fun of the gameplay is still there: Peters swinging and acrobatic combat flows just as well as I remember, and even more smoothly now when you choose the new 60fps performance mode (which sacrifices some of the nicer lighting effects). I still find myself leaning heavily toward my few suit mod preferences and the side missions arent any more diverse  Ive already run into what feels like a few dozen muggings  but thats remasters for you. The remaster also has all the benefits of bundling all three DLC episodes of The City That Never Sleeps. Thats another 10 or so hours of play, and it adds a largely satisfying comic book mini-arc that includes fantastic character work with Black Cat and Silver Sable. You take the bad with the good in the form of the annoying Screwball missions and a less-than-stellar second chapter, but these episodes work much better together than they did as separate episodes released a month apart as they were originally. Anyone can wear the mask, and it's lovely and important that Insomniac has carried that philosophy into its games. On top of that and the free suits Insomniac put out, the remastered edition has been enhanced with quality-of-life improvements, like the near-instantaneous load times on PS5, and even additions to Photo Mode to mirror the handy new lighting features of Miles version. Plus, Miles Morales huge suite of accessibility features have been added (something Im kicking myself for neglecting to mention in my Miles review). There are options to change the contrast of the environment, enemy readability, quick-time event requirements, and much more. Its a nice step up from the originals included options. And if recent Spider-verse stories have taught us anything, its that anyone can wear the mask, and its lovely and important that Insomniac has carried that philosophy into its games. If youve never played Marvels Spider-Man...what have you been doing the last two years!? But your procrastination has paid off, because the remaster is a much better way to play thanks to the PS5s fantastic lighting effects and loading times. Even as someone who platinumed the original, its a treat to revisit this improved New York City. The gameplay itself feels largely unchanged, but that still leaves you with a spectacular Spider-Man adventure, with all its additional content, thats also one of the best superhero games ever made, and a visual treat to kick off the PS5 era.", "date": "Nov. 17, 2020,"}