{"name": "Demon's Souls (PS5)", "name_review": "Demon's Souls Review", "ref": "https://me.ign.com/en/demons-souls/179311/review/demons-souls-review", "text": "In prep for this review I dusted off my PlayStation 3 and spent about a week replaying through the original 2009 Demons Souls. My main takeaway from that experience was, Man, as fantastic as this game is, it feels old. And I dont just mean graphically: you can only roll in four directions, character controls feel loose, and just overall, theres a lot of jank. But Bluepoint  the team that so expertly remade Shadow of the Colossus in 2018  has addressed just about all of those major issues and more in the absolutely gorgeous PlayStation 5 remake, resulting in a game that feels much tighter to control and one that brings FromSoftwares neglected original Souls game back to the forefront, reminding us what a strong foundation the Dark Souls series was built upon. Like the rest of the Souls series, the appeal of Demons Souls is that its an action-RPG that prides itself on difficult, cerebral, and methodical combat, as well as extraordinarily deep character build customization. In combat, every action poses a risk, whether its committing to an attack and leaving yourself vulnerable in the start-up and recovery of it, or committing to defense and sacrificing a portion of your stamina to avoid taking damage. Rather than relying mostly on reflexes, Demons Souls relies more on making smart decisions both in and out of combat, and making the right decisions in order to overcome its many tough challenges feels incredibly rewarding in ways few other games can match. Demons Souls may be the game that kicked off the Souls subgenre of action-RPGs, but it is the ways in which its different from the Dark Souls games that really make it stand out. The biggest is that rather than being one contiguous open world, Demons Souls is split into five isolated worlds, each made up of three to four sublevels, each offering their own unique rewards and challenges. The thing I love so much about this structure is how easy it becomes to just pack up, leave, and try out a new area if you find yourself struggling in the one youre currently in. Each level is difficult, but in very different ways, and never for reasons as simple or as boring as the enemies simply just being stronger. Each level is difficult, but in very different ways, and never for simple reasons. World 1 is tough because you frequently have to contend with an obnoxious dragon that spends its whole day roasting each of the bridges you need to cross in order to proceed; World 2s enemies are resistant to most damage types outside of piercing; World 3 is a labyrinth thats easy to get lost in and is guarded by tough mind flayers that can kill you in just one or two hits; World 4 has highly aggressive skeletons that are also resistant to most weapons outside of maces and hammers; and World 5 has a ton of enemies that are easy to kill, but have a nasty habit of swarming you with rapid hits and wild attack patterns. Not to mention the whole lake of poison thing. Whats clever about this is that Demons Souls structure makes every playthrough feel different because youre able to approach each world in new ways. For my first playthrough, I went with a magic-focused build and went to world 3 first so I could stock up on magic-replenishing consumables and unlock the NPC that grants access to the most powerful spells. But in my second playthrough with a more dexterity-driven character I bounced from world to world, picking up useful items and gear from each one before committing to beating any of them. Its this flexibility that makes Demons Souls so distinctive among the Souls games. Demon's Souls features some of the most memorable bosses of any of FromSoftware's games.Demons Souls also features some of the most memorable bosses of any of FromSoftwares games, and certainly some of most mechanically interesting ones. Many feel like experiments to really push the limit of what a boss could be; of course, not all are successful. The Dragon God was a disappointingly gimmicky boss fight in 2009, and annoyingly its just as bad in the PS5 remake. But others, like the emotional and story-driven battle against Maiden Astrea, or the epic fight against the Storm King that has you picking up a special weapon to shoot giant slicing wind attacks at the godforsaken manta rays that had been making your life a living hell for the last three hours, are absolute classics. What We Said About the Original Demon's Souls Verdict: Demon's Souls is not a game for everyone. Actually, I take that back; it's most definitely something everyone should try, but the look, seemingly unforgiving nature and themes might be a bit off-putting. Don't let them be. Every single person that owns a PS3 should at the very least rent this game to see what all the fuss is about, and those that can remember the good ol' days when games taught through the highly effective use of intense punishment and a heavy price for not playing it carefully should scoop this up instantly. It's utterly unique among the offerings on any console right now, and absolutely, positively should not be missed. - Sam Bishop, October 8, 2009 Score: 9.4 Read our full original Demon's Souls review All of this is true for Bluepoints remake, which largely stays true to the spirit of the original Demons Souls, both for better and for worse. Not all of the ways Demons Souls differentiates itself from the rest of the Souls series are positive ones. Demons Souls is exceptionally grindy in often frustrating, time-wasting ways. If you run out of health-restoring grass, youll need to either farm it by repeatedly killing specific enemies in specific worlds that drop it, or youll need to farm souls (that you could have used to improve your character) and purchase it from a merchant. Weapon upgrading is also needlessly convoluted, with 16 different types of upgrade materials to find and make sense of, and almost every weapon type requiring different materials in order to upgrade them. Dark Souls addressed both these issues with the introduction of Estus Flasks and a simplification of the weapon upgrade system, and going back to how it used to be made me remember how much of an improvement Dark Souls was in those regards. The Quality of Life The real stars of the show here, though, are the litany of smaller quality-of-life upgrades that make me never want to even think of going back to Demons Souls on the PS3. Theres so many to touch upon, but the long list includes: The addition of a tool belt that lets you equip up to four situationally useful items in a submenu thats accessible with the touchpad; the ability to use archstones like a bonfire and reset the enemies without having to go back to the Nexus; being able to see the durability of your weapon in the HUD; being able to see what the next item you have equipped is; and all of this is on top of a much cleaner and more intuitive menu UI that sacrifices some of the originals unique visual style in favor of simplicity and readability. I need to give a special mention as well to the new ability to send items to your storage box without having to return to the Nexus. Item burden is a huge factor in Demons Souls, and in the original, when you picked up something that you had no space for youd have to either make room for it by permanently destroying something in your inventory or youd have to just leave it and convince yourself that you didnt really need whatever it was anyway. And then youd also have to trek back to the archstone just so you could offload any unnecessary items. This is an elegant fix that still keeps the inventory management without any of the frustration. Theres still an annoyingly common tendency to use a shove attack when I dont mean to, and I wish the developers had done something to better explain World Tendency to newcomers. But those nitpicks notwithstanding, Bluepoint did an excellent job of updating Demons Souls to modern standards without changing the core of its gameplay. One other area that Demons Souls obviously benefits by virtue of being on a console with an SSD is a substantial reduction in load times. Rarely will you ever wait more than five seconds in between deaths or while teleporting to a new location before youre back in the action. I cant overstate how huge this is for a game like Demons Souls, in which youre expected to die over and over again and also to repeatedly reset a level for the purpose of farming. Rarely will you ever wait more than five seconds in between deaths before you're back in the action. The DualSense controller is much bigger than a DualShock 3, which makes it a tiny bit less comfortable to use the infamous claw grip that is almost required in a game like Demons Souls, but my hands adjusted over the course of X hours it took me to beat it. Most notable, though, is the way the haptics react to you being hit. When you block a big shot with your shield, you feel that strong jolt localized entirely on the left side of the controller; when you run over a fallen vase and it shatters you hear and feel that distinct impact; and when you ride an elevator, theres an almost roller coaster-esque rumble that accurately imitates the churning of gears. Its incredibly cool. Also, the provided in-game tip videos are fantastic tools that give progressively more specific hints. Those can either point you in the right direction if youre lost in a stage or give you crucial tips against tough bosses to help you figure out a proper strategy to deal with them. Sights and Sounds As one of the first games available exclusively on the PlayStation 5, its no surprise that Demons Souls is breathtaking to look at. There is a staggering level of attention to detail here. Enemies display looks of fear, anger, and desperation, and react realistically to every hit; Blood spatter sticks to your armor, weapons, and body; just about everything you walk through or on reacts naturally to your physical presence, whether its a puddle, box, vase, or a fallen enemys armor; fat jiggles on the grotesque Vanguard Demon when you make impact with a weapon. The list goes on and on. It is all around just a magnificent showcase of the power of the PlayStation 5 and an enticing taste and whats to come if things can look this good on a launch game. Bluepoint definitely took more liberties with the art style and soundtrack than it did with the gameplay, and personally I love the art direction, even though I will say that I miss the jovial mystique of the PS3s Fat Official compared to the remakes, which looks like a radiation experiment gone horribly wrong. The soundtrack, in comparison to the mostly somber and lo-key music of the original, feels much louder and more bombastic during boss fights, which I dug  but it is so different that I can definitely understand people preferring the original. Demons Souls offers two visual modes labelled Cinematic and Performance. Its the usual split that weve come to expect at this point, with the cinematic mode targeting 30fps with a true 4K resolution, and the performance mode keeping a consistent 60fps at 1440p, which is then upscaled to 4K. Personally, Ive always been a framerate over fidelity guy, so I played the whole thing in performance mode and never looked back. That said, cinematic mode is definitely a stunner if you dont mind sacrificing half the frames. Summoned Souls Of course, it wouldnt be a Souls game without asynchronous multiplayer. If youre familiar with how multiplayer has worked in other Souls games, Demons Souls should come as no surprise: Players can leave messages to give hints, point out secrets, or absolutely troll the heck out of you; you can play cooperatively with the tried-and-true method of leaving and activating summon signs; you can invade other players who are running the risk of going through a level while in human form; and you can lay down a red summon sign for some good ol fashioned consensual PVP. Ive always kind of been lukewarm on Souls multiplayer, and Demons Souls is no exception. My attempts in trying to get summoned in co-op were met with a ton of waiting and very little payoff  especially since without the covenant system added in Dark Souls, theres little incentive to offer your help outside of the fuzzy feeling in your belly that you get for doing a good deed. My one success in getting summoned for PVP didnt fare much better as I got summoned for the Old Monk boss battle, only to have it end abruptly when the player I invaded never even made it to the door. After that, I simply lost the will to sit and wait for multiplayer in general unless I was coordinating with a friend. Bluepoints team had the unenviable task of remaking an 11-year-old game with a cult following and making it look  and play  the part of being the very first game developed from the ground up for this current generation of consoles. And thats exactly what they did. Demons Souls is breathtakingly gorgeous and plays significantly better than it did on the PS3, not only thanks to the graphical power of the PlayStation 5, but because of smart quality-of-life changes and light touches that modernize some frustrating aspects of the original, without ever sacrificing the relentless challenge, puzzle-infused boss battles, and style that made it such a landmark game in the first place.", "date": "Nov. 17, 2020,"}