{"name": "Pikmin 3 Deluxe", "name_review": "Pikmin 3 Deluxe Review", "ref": "https://me.ign.com/en/pikmin-3-deluxe/178715/review/pikmin-3-deluxe-review", "text": "Like a group of space explorers is search of a hospitable new planet, Pikmin 3 is the latest in a long line of charming Wii U gems to land on the more fertile ground of a suped-up Switch port, and goodness gracious does it deserve it. Already a fantastic mix of adorable real-time strategy and tricky spatial puzzles, Pikmin 3 Deluxe makes the original even better with some enjoyable content additions and boatload of impactful quality-of-life improvements. The only problem now is that Im nearly out of reasons to keep my Wii U at all. For those who didnt play it in 2013, Pikmin 3 sends three intrepid explorers hurtling toward the surface of an alien planet in search of fruit to feed their homeworld. There they have to befriend, grow, and command the lovable little creatures that can help them repair their ship and collect enough fruit juice to stay alive while they do it. Its simultaneously cute and intense as you race both your own juice supply and a sun timer to efficiently multitask and accomplish as much as you can each day, slowly opening more areas up as you unlock new types of these adorable and handy pikmin. Heres what we said about Pikmin 3 in our original review: Pikmin 3 is a delight. Theres nothing else like its gentle combination of exploration, strategy, and discovery, and it made me feel both empathy and responsibility for virtual creatures that most games would treat as disposable fodder. It transported me like few other games can, giving the feeling of being a stranger in a strange (but oddly familiar) world. It's over too soon, but it leaves a lasting impression. - Keza MacDonald, July 22, 2013 I agree with just about every word of that in 2020, and Pikmin 3 Deluxe proves just how well all of those strengths hold up. (I urge you to read that review in its entirety to get a full picture of what makes Pikmin 3 so great, since this review will focus largely on the Deluxe changes.) Strategically juggling control of three different leaders still makes this my favorite entry in the series (even if I do love the timer-free dungeons of Pikmin 2 dearly) and the fact that the entire campaign can now be played in split-screen co-op is a wonderful fix to a notable disappointment of the original. And while there arent really any noticeable visual improvements here  apart from the fruit juice not killing the framerate every time it flows  its cartoony style means everything still looks great nearly a decade later, even if its a little jagged around the edges. One big addition is the inclusion of three difficulty modes: Normal, Hard, and Ultra-Spicy  though these labels are a bit misleading. Hard is actually pretty much the original game, while Normal makes tweaks like significantly extending the length of a day and lowering the health of enemies. That caught me off guard as a returning player (especially since Pikmin 3 already felt like the easiest game in the series), but having an option for those who dislike the time crunch is nice all the same. Ultra-Spicy, on the other hand, lowers the number of pikmin you can have in the field from 100 to 60 and cuts the juice you get from fruit in half. Its certainly a trickier puzzle to multitask with a smaller party, even if it's not necessarily a more interesting or exciting one. Impactful quality-of-life changes make this the smoothest Pikmin has ever felt. But the largest departure, as with all of these Deluxe ports, is the amputation of the Wii U Gamepads second screen. Thankfully, Pikmin 3 Deluxe works so well without it that I doubt new players will even be able to tell somethings not as it was originally intended to be. The only thing I missed is that pulling up the 2D map takes over your only screen, which means the camera will no longer fly over wherever youre looking for a 3D peek, but thats no great loss. And while I was one of the weirdos who preferred playing with the stylus and touch screen, Deluxe has lots of different control options to pick from in its absence. Frankly, the Pikmin series has now appeared on four separate consoles (we dont talk about Hey! Pikmin) and its been a little tough to control on all of them. With Deluxe, you can choose to use the control stick to move your pointer directly, use Wii Remote-style gyro controls for freer aiming, or even a hybrid version where you primarily use the stick but then fine-tune your aim with the gyro, similar to Links bow in The Legend of Zelda: Breath of the Wild. I ended up spending most of my time using full gyro aiming with a Pro Controller, which worked great for the most part even if I did have to recenter the pointer pretty frequently (thats bound to the right bumper, which at least makes it a snap to do). But no matter which control option you pick, Pikmin 3 Deluxe will be easier to handle than the original thanks to a mountain of tweaks and quality-of-life adjustments. The most noticeable is the improved lock-on that makes maneuvering during combat a breeze, but the most exciting changes are much subtler than that. Things like how whistling quickly wont immediately make a working pikmin stop what its doing, allowing you to safely gather nearby idle ones; like how pikmin will more intuitively group up with a nearby leader; like how the Charge command now only sends the type of pikmin you have selected at the time instead of the full group, or how Disbanding will keep just that color in your party, letting you manage your squad faster and take down enemies with elemental effects like fire or electricity more easily. Impactful changes like these are all over Pikmin 3 Deluxe, and its an extra step that makes every aspect of playing it less frustrating than any Pikmin has ever been. Its not just better  theres also more to play here. Pikmin 3's existing DLC comes bundled in like with most of these Deluxe ports, but there are also brand new Side Story missions that act as a prologue and epilogue to the campaign, remixing small sections of its existing levels  occasionally to the point where they are almost unrecognizable due to the addition of new walls or even all the water being drained away from a previously flooded landscape. These missions give you control of Olimar and Louie and feel a bit like more involved versions of the optional treasure missions already in the base game rather than an extensive add-on to the campaign itself. Each one has a little bit of story flavor to set the stage and then a specific objective to complete on a short timer. Those brief tales are cute little cutscenes for the missions in the shorter Olimars Assignment Side Story, but I was sad to see they turned into solely text-based intros for the longer secondary one (which unlocks after you beat the campaign and Nintendo has asked us not to talk specifics about). But even with the thinner setups, these missions do a good job of offering more than the Mission mode does thanks to their clever objectives, like having to escort an object across a map or splitting Olimar and Louie up for the entire level. They arent super challenging  on the whole theyre easier than the included treasure missions  but they still provide a satisfying hit of fresh Pikmin cleverness and charm while we eternally wait for Pikmin 4. Beyond that, there are a surprising number of other little added delights scattered throughout. Pikmin 2s Piklopedia has made an unexpected return, letting you take a closer look at all the creatures you murder and mercilessly convert into seeds. A surprisingly extensive Badge system has also been introduced, with Badges given basically as in-game achievements to reward you for actions like collecting a certain amount of fruit or doing well in missions and Side Stories. Badges will even increase an arbitrary ranking as you earn more of them, if youre looking for some Pikmin-based bragging rights. They are a neat addition, if a small one. Pikmin 3 Deluxe makes an already excellent game even better and transplants it onto a console where far more people have a chance to see how good it really is. Its Side Stories and difficulty modes arent massive additions, but they gave me more of the already clever and fast-paced fun that made me fall in love with the original game seven years ago. And while not as flashy new missions, there are a downright impressive amount of smaller touches and quality-of-life adjustments throughout (including replacing the Wii Us Gamepad screen with Switch-friendly controls) that make this the best the Pikmin series has ever felt. Theres plenty of reason to come back for returning players, and if you missed Pikmin 3 on the Wii U then you absolutely shouldnt repeat that mistake here.", "date": "Oct. 29, 2020,"}