{"name": "Nvidia GeForce RTX 3070", "name_review": "Nvidia GeForce RTX 3070 Review", "ref": "https://me.ign.com/en/nvidia-geforce-rtx-3070/178652/review/nvidia-geforce-rtx-3070-review", "text": "Despite scarcity due to overwhelming demand, Nvidias RTX 30-series graphics cards are here and were finally able to spill the beans on the final entry in Nvidias launch trio: the RTX 3070 Founders Edition. Ive reviewed both the RTX 3080 and 3090 and found each to be a performer, but both are also expensive enough to be out of reach for many gamers. After a month of waiting, we can finally see whether Nvidias most affordable 30-series card lives up to the hype of 2080 Ti-like performance. At only $499, it may just be the most compelling card of the bunch. Does it deliver? RTX 3070 - Design and Features Compared to its higher-spec siblings, the RTX 3070 feels downright small. It features the same overall design language as the rest of the line-up, albeit with a simplified face plate, but at 9.5 inches long and 4.4 inches wide, its almost two inches shorter than the RTX 3080 and three inches shorter than the 3090. Side by side, it feels like the baby of the family and is even a touch shorter than last generations RTX 2070 and 2080 Super. If you liked the sleek, black look of the 3080 or 3090, youll also like this and perhaps even more because the GeForce RTX logo no longer lights up. Its small footprint doesnt translate to reduced power, however. Like the rest of the RTX 30-series so far, it is an absolute performer. The RTX 3070 more than doubles the CUDA core count from last generations RTX 2070, jumping from 2304 cores to 5888. As Ive noted in past reviews, double the cores doesnt translate to double the performance as a portion of those cores will swap between shading and math duties, but its a massive leap nonetheless. Its also worth mentioning that the Boost Clock for this card is 1.73 GHz, but like all RTX cards, this doesnt mean much thanks to Nvidias automatic overclocking. In my testing the card hovered around 1.9 GHz without dialing in any overclock of my own. In addition, the RTX 3070 comes equipped with 8GB of GDDR6 memory. This is an important scale back from the GDDR6X found on the RTX 3080 and 3090, but a reasonable one for both cost and availability. The memory is clocked to 7000MHz on a 256-bit bus, which is identical to last generations RTX 2070. Total memory bandwidth is 448 GB/s, which sounds almost quaint compared to the 760 GB/s on the RTX 3080. For 4K gaming, this is absolutely sufficient, but given the many direct comparisons Nvidia has made to the RTX 2080 Ti, I would have liked to have seen an upgrade in the memory spec. The 2080 Ti featured a bandwidth of 616 GB/s, in comparison. Like the rest of this generation of RTX cards, the RTX 3070 utilizes Nvidias latest RTX processing system. The graphics engine of the card is composed of three core parts: the programmable shader, which is responsible for rasterization (traditional game rendering); the RT Core, which handles ray tracing; and the Tensor Core, which powers the AI functions of RTX, including DLSS and the RTX Broadcast suite. Compared to last generation, there has been some major improvements: Shader TFLOPS: 20.3 versus 7.9 on RTX 2070 RT-TFLOPS: 39.7 versus 23.8 on RTX 2070 Tensor TFLOPs: 162.6 versus 63 on RTX 2070 Of course, you should only take these numbers in comparison to each other and not other products, like a next-gen console. TFLOPS are not directly comparable, but can still provide a good metric for generation over generation improvements. Building a tiny powerhouse may be great for small form factor builds, but that miniature cooler does have negative impacts on overall thermals and noise. The card uses the same dual axial cooler as previous 30-series cards, but the reduced surface area results in higher temps overall. In my testing, the card reliably peaked at 77C once it had a chance to heat up. At this point, it became slightly more audible than the stock fans in my Lian Li Lancool II case. Compared to the downright impressive results of the RTX 3080 and 3090 coolers, this is much more in line with what we found with the original RTX 2070 and is even several degrees higher than the RTX 2070 Super I tested against. As an RTX-30 card, the 3070 also brings with it many of the other key features of this generation, including RTX Reflex, RTX Broadcast, RTX I/O, and RTX Studio. I went over these in some depth in my review of the RTX 3080, so be sure to head over there for more information. In short, systems like RTX Broadcast and RTX Studio make content creation and streaming easier than ever before, all without the need for expensive green screens or quality-killing noise canceling microphones. If youre a competitive gamer, RTX Reflex may be worth the upgrade alone as even a relative pleb like myself could feel an immediate improvement in responsiveness just by turning it on. RTX I/O, on the other hand, stands to be game changing for reducing load times once it is widely implemented in games. At the moment, however, were still waiting on that adoption to take place. Finally, around the back we have our video outputs. Identical to the RTX 3080 and 3090, it features three DisplayPort 1.4a connections and a single HDMI 2.1 out. Each can be connected simultaneously for a maximum supported resolution of 7680 x 4320. RTX 3070 - Performance Like all of our graphics card reviews, I put the RTX 3070 Founders Edition through a series of rigorous tests to see how it held up both in synthetics as well as real-world game tests. Given its spec sheet, I tested games across 1080p, 1440p, and 4K resolutions and recorded the average frame rate for each. Test system: Z390 Asus ROG Maximus XI Extreme Motherboard, Intel Core i9-9900K CPU (stock), Corsair H115i PRO RGB 280mm AIO CPU Cooler, 32GB Corsair Vengeance RGB Pro DDR4-3200, 1TB Samsung EVO Plus NVMe SSD, Corsair HX1200 1200-watt power supply. Given that Nvidia positioned the card as having RTX 2080 Ti levels of performance, I was particularly interested in testing that, as well as the 2080 Super, to cover that scope of 20-series cards. Its important to note, however, that the RTX 2080 Ti I have available for testing is a factory overclocked model and runs roughly 4% higher than a standard 2080 Ti Founders Edition. This is also true of the RTX 2070 Super (selected because its the most recent iteration of this last-gen counterpart), though to a lesser degree. Bear that in mind as you examine the results. Looking purely at synthetics, the RTX 3070 goes toe to toe with the RTX 2080 Ti and beats it in two out of three cases. It falls about 100 points behind in the Unigine Heaven benchmark, but remember that the Gigabyte AORUS Xtreme features a fast factory overclock, which would put the results of both cards much closer when comparing against a RTX 2080 Ti Founders Edition. Compared to the RTX 2070 Super, which was also a factory overclocked model, or the RTX 2080 Super FE, the RTX 3070 demonstrates a commanding lead. The card was 39% faster in Fire Strike Ultra, 34% faster in Unigine Heaven, and 45% and 42% in the Bright Memory and Boundary benchmarks respectively. Against the RTX 2080 Super Founders Edition, averages 24% higher in Fire Strike, 21% in Heaven, and 21% and 33% faster in the Bright Memory and Boundary. When taken to task in actual games, the results are much closer between the RTX 3070 and 2080 Ti. As you can see, the 2080 Ti retains an average 3% edge at 1440p. Compared against its last generation counterpart, the RTX 2070 Super, however, the 3070 averages 32% higher FPS at 1440p and 26% higher FPS at 1080p. Against the RTX 2080 Super, it averaged 18% faster at 1440p and 19% faster at 1080p. Heres how it performed in our expanded battery of games at 4K: Using the comparison cards we had on hand for testing, the RTX 3070 clocked in with frame rates ranging from 8% slower to 8% faster than the RTX 2080 Ti, for an average frame rate that was 97% of the 2080 Ti. But, factoring in the factory overclock, these results would tighten further, making the average performance almost identical at 4K. Compared to the RTX 2080 and Super, it performed an average of 22% and 36% faster respectively. While the generational leap over the RTX 2070 Super may not be as huge as I found with the RTX 3080, these results are still very impressive. The most striking is just how close the RTX 3070 performs to the RTX 2080 Ti, while costing less than half of that flagship GPU. Nvidia did not oversell this card by any margin. The RTX 3070 Founders Edition is a great card. It offers excellent 4K and 1440p performance at a very reasonable price. Its peak temperature and overall noise leave something to be desired, and the generational leap isnt quite as grand as with the RTX 3080, but at $499, its hard to argue that the RTX 3070 is anything other than a great value.", "date": "Oct. 27, 2020,"}