{"name": "Samsung Odyssey G7", "name_review": "Samsung Odyssey G7 Review", "ref": "https://me.ign.com/en/samsung-odyssey-g7/178381/review/samsung-odyssey-g7-review", "text": "144Hz may have been the benchmark for smooth motion a few years ago, but esports has pushed the boundary even further, with 240Hz panels becoming more and more common. However, theyve usually been limited to smaller, 1080p monitors, often with TN panels, leaving you to choose between buttery smooth motion and high-end picture quality. Samsungs $750 Odyssey G7 ditches the compromise with a 32-inch QLED panel that can refresh at 240Hz  all with a sharp curve designed to suck you into the action. Design and Features If youve seen any of Samsungs monitors from the past few years, the Odyssey G7 will look familiar. Its bezel is nearly frameless, with just a bit of plastic protruding out from the panel, and its two-legged stand boasts height, tilt, and swivel adjustments, with LED lighting at the pivot point. Unlike other Samsung monitors, it also has a bit of lighting along the bottom bezel, giving it just a bit more of a gamer aesthetic. It doesnt have as many color options as typical RGB gear, and it wont sync with the lights in your PC, but it has enough available colors that you can probably get it to match, with a few cool effects for that extra bit of flair (like breathing or rainbow). The Odyssey G7 looks good, though the stand is very deep, so make sure you have enough room on your desk  the 32 model requires about a foot of space from the edge. Part of this is due to the monitors size and weight: this sucker is 14.3 pounds with the stand, and it doesnt even have the power supply built into the monitor. Instead, youll have to find a place to put the huge brick in the middle of the power cable. It also has one of the deepest curves weve ever seen in a monitor at 1000R, which Samsung says matches the curvature of the human eye. Whether you enjoy a curve that deep is personal preference  Im not aware of anyone that wanted more curve, with most people preferring little to no curve  but its there. All this is to say: the Odyssey G7 is not a svelte, minimalist monitor. But thats okay, because this thing has pretty beastly specs. The VA panel combines deep blacks with vivid colors, especially with the addition of Samsungs quantum dot tech. Its DisplayHDR 600 capable, which is actually decent as far as monitors go, and has a maximum frame rate of 240Hz for crazy smooth motion. (It quotes response time at 1ms GtG, but this is largely meaningless, as manufacturers tend to fudge these numbers with a host of misleading techniques). The 2560x1440 resolution offers a nice boost over the typical 1080p resolution of monitors this fast, though at 32 inches, its not very sharp. In fact, On some shades of color, I find you can even see the space in between the pixels, causing a faint screen door effect  something Ive noticed on other Samsung monitors, though its not as bad on the Odyssey G7. If you prefer a super-dense pixel layout for desktop work, the 27-inch 1440p version may be more your speed at $650. Still, for pure gaming, a slightly less sharp picture is probably a worthy sacrifice for a screen this big and this smooth. The rest of its specs are pretty typical, with FreeSync and G-Sync compatibility for tear-free gaming, built-in speakers for convenient (but tinny) sound, and rear IO sporting 1 HDMI 2.0 port, two DisplayPort 1.4 ports, two USB ports, and a headphone jack. Its a bit of a bummer that both HDMI 2.0 and DisplayPort 1.4 will soon be outdated, particularly when youre spending $750 and want the monitor to last a long time. Testing To see if the Odyssey G7 lives up to these manufacturer-touted specs, I tested the monitors color performance using an X-Rite i1Display Pro with DisplayCal, as well as examining a number of Lagoms LCD test patterns by eye. Out of the box, our Odyssey G7 covered all of the sRGB color space and 88.2% of the DCI-P3 color space  which is the minimum value Samsung lists in its specs. Thats quite good, and will easily make for eye-popping colors in the Custom mode the monitor comes tuned to. However, it does mean colors may be a bit oversaturated, due to the way Windows handles wide color gamuts. Most people will probably enjoy the more vivid colors anyway, and its a quirk common with every wide gamut display out there, so its not a knock against the monitor  though if youre doing any color-sensitive work, youll want to calibrate the monitor or flip into sRGB mode. Color accuracy in sRGB mode was very good out of the box, with an average delta E value of 1.68  a delta E value under 3 is generally considered excellent, with the differences between the displayed color and the intended color difficult to see without scrutiny. Over 3 is easier to discern, while under 1 is imperceptible. The maximum delta E we saw in sRGB mode was 3.44. Gamma measured fairly close to the 2.2 target, though I felt like the sharpness was turned up a bit too high out of the box  taking it down a notch made graphics look more natural. The monitors black and white levels were on point in Lagoms test patterns, with the darkest and brightest squares being just barely indistinguishable from reference black and white, respectively. Since it uses a VA panel, black levels are deeper than youd find on IPS displays, so its a good monitor for playing games at night in a dark room  though it did fall a bit short of its promised contrast ratio, with our model measuring 2033:1 instead of the Samsungs quoted 2500:1. The Odyssey G7 does have local dimming, but its edge-lit and only contains 7 zones, meaning you wont see it dim as very often  and when it does, the zones are extremely obvious thanks to the blooming up and down the screen. Its nice when your game completely fades to black, but otherwise is nothing to write home about, and some may find it more distracting than its worth. You can always turn it off in the options if you dont like it. Viewing angles, like most VA panels, were not spectacular, which can be more annoying the larger your monitor is. On our 32-inch review unit, it was tough to get the top and bottom of the screen to look the same in Lagoms viewing angle pattern, and the edges never quite lined up, despite the incredibly deep curve. Still, I didnt find this noticeable in regular desktop work or gaming, so it probably wont bug most people. To test response time, Lagoms pattern shows an animated GIF that quickly switches a number of squares between two shades of grey. If the square flickers noticeably, the pixels arent responding fast enough, indicating a slow response time that could lead to ghosting. Thankfully, the Odyssey G7 performed fantastically well, with only the darkest transitions showing any hint of flickering, and even then, much less than most monitors Ive reviewed (especially other VA panels). Blur Blusters UFO ghosting test backed this up, with only the smallest trail behind moving objects. Like Samsungs other monitors, the Odyssey G7 doesnt allow you to enable overdrive (known as Response Time in the OSD) when Adaptive Sync is turned on, so you need to decide whether you want tear-free gaming or the fastest response time possible. Honestly, motion blur was so minimal out of the box that I didnt feel the need to enable Overdrive, and even when I did, it didnt make a hugely noticeable difference  though its highest setting, MBR, uses backlight flicker to all but eliminate motion blur. This tends to introduce image doubling and other artifacts, but it was less noticeable on the G7 Odyssey than other monitors  though the response time is so good you probably dont need it anyway. Speaking of G-Sync and FreeSync, I found the adaptive refresh rate on this monitor successfully eliminated screen tearing using my Nvidia graphics card. However, many users have reported flickering with their Odyssey monitors when adaptive refresh is turned on. Some find that their monitor constantly flickers, even during desktop work, while others dont have flickering at all (or dont notice it). Many users, like me, are somewhere in the middle  I couldnt get most games to show any flickering, except maybe in menus, though I did notice it on a select few (like Call of Duty: Infinite Warfare) in-game. Disabling adaptive refresh rate eliminates the flicker instantly, for me and all other users experiencing the problem  though everything else about it is difficult to pin down since it seems to vary from unit to unit. (Some report better results after changing the FreeSync range in CRU, while others have had success in borderless windowed mode or by making other tweaks.) I experienced the issue with both my Nvidia and AMD graphics cards, and Samsung declined to make any official, on-the-record comment about the issue. It seems like its partially panel lottery, and partially user sensitivity. I found it hard to see in typical fast-paced gameplay, even when Im looking for it, but again, that could just be how it manifests on this particular unit. Ultimately, I wouldnt consider it a total deal breaker  especially since variable refresh rate is less crucial at framerates this high, when tearing is hard to see  but knowing how widespread the issue is and how many users its affecting does certainly dock some points from Samsungs favor. Hopefully a future firmware or driver update fixes the problem, but until then, there is a bit of a gamble involved for FreeSync and G-Sync diehards. Gaming Gaming at 32 inches is always a treat, and Samsungs Odyssey G7 did not disappoint. At this size, the action is super in-your-face, filling up your field of view and making all other monitors seem paltry in comparison. I didnt find the super deep curve particularly beneficial, nor did it bother me a ton  if I had the choice, Id definitely choose a shallower 1800R curve, but Im not that picky. Many other users will be, however, as I know plenty of people prefer flat monitors for 16:9 displays. 1440p also provides pretty weak pixel density at 32 inches, but I find most games are pretty forgiving in this respect, and the increase to 32 inches is well worth it if you can stomach the less sharp visuals in desktop work. (Especially since you can supersample your games for a sharper image, provided you have enough GPU horsepower). That said, 1440p is more than enough if you want to get anywhere close to the super-high 240Hz refresh rates this monitor provides. Ive reviewed a number of 240Hz panels and the difference from 144Hz is noticeable  in fast-paced games like Overwatch, those extra frames make the motion feel just a bit smoother, perfect for darting around the arena as you frantically blast your enemies. That said, the jump from 144Hz to 240Hz is much smaller than the jump from 60hz to 144Hz, so while its nice to have, it isnt crucial to a good gaming experience. And thank goodness, because hitting 240 frames per second can be tough at ultra graphics settings  which is where FreeSync comes in handy, allowing you to get in the ballpark without worrying about maxing out your framerate in every game. (Though some games may have flickering issues on some units, per my note above). The fast response time keeps up with the 240Hz refresh rate superbly, and I didnt notice any bad ghosting or other motion artifacts, which can be common on other slower VA panels. Colors were vibrant and beautiful, and HDR  while likely not on par with the TV in your living room  is still worth using in games that support it, for those extra highlights and more accurate colors (since SDR will be a tad oversaturated on wide gamut displays like this). Shadow of the Tomb Raider is still one of my favorite examples of HDR done well, whether youre in the colorful Peruvian jungle or watching light stream through a hole in the wall of a dark cave. Its large size, solid contrast, and insanely smooth refresh rate make this monitor an exciting rare breed, with beautiful colors to boot. If it werent for the unnecessarily deep curve and flickering issues, itd be one of the most exciting monitors you can buy today  but such a widespread problem makes it tough to give this monitor the score itd otherwise deserve, even if it wasnt particularly bad on our test unit.", "date": "Oct. 20, 2020,"}