{"name": "Super Smash Bros. Ultimate DLC Review - Minecraft Steve", "name_review": "Super Smash Bros. Ultimate DLC Review - Minecraft Steve", "ref": "https://me.ign.com/en/super-smash-bros-ultimate-dlc-review-minecraft-steve/178258/review/super-smash-bros-ultimate-dlc-review-minecraft-steve", "text": "If theres one thing you cant take away from Super Smash Bros. Ultimates version of Steve from Minecraft, its how different he is. Steve and his cosmetically distinct but mechanically identical friends are among the most inventive fighters Ultimate has ever seen, and thats saying a lot in a game with already wildly unique options like Olimar, Ice Climbers, Hero, and more. The way Minecrafts mechanics have been incorporated into his moveset is simply incredible. He can craft, build, collect resources, and even upgrade his gear based on what hes collected. But does that innovative yet faithful implementation actually make him fun to play? Well, thats a tough question to answer. Steve is one of the most mechanics heavy characters Smash has ever seen.. To start, he requires collectable materials to utilize many of his best attacks, and to craft the weapons and tools that he uses to fight . Crafting materials can be gathered by holding B while on solid ground, and the materials that he gathers are actually affected by the type of ground hes standing on. So mining on metal will net more iron ingots, while standing on sand will get you sand blocks. There will always be a chance that youll get more valuable resources like iron, gold, and diamonds no matter what, so you never have to worry about playing a level that doesnt have a specific type of resource. Also, when you play on a battlefield or omega stage, those high value materials are dug up at a predetermined rate to eliminate the random chance of it all. Mining resources is an absolute necessity with Steve because, just like in Minecraft, his weapons and tools will eventually break after repeated use, leaving him with a very weak punch to replace his tool-based abilities. To craft new tools, you must be next to a crafting bench and hold B to automatically upgrade all your tools to the highest rarity that your materials allow. Its initially strange to have a Smash character tethered to an object like this, but thankfully you can teleport your crafting bench directly to you by holding the right trigger and pressing B. The moments where a clever idea clicks together for a KO make Steve a blast to play. Perhaps the biggest weapon in his arsenal is his minecart on forward-B. Its an extremely powerful dashing attack all on its own, but can be made even more powerful if Steve manages to collect red stone and gold, which adds a little boost to the start up. Beyond that, it can also be used as a great horizontal recovery option, as well as an unblockable ranged grab that can scoop up an enemy if you jump out of the minecart early. This can send foes careening to their death if they dont manage to mash out of it quick enough, which feels really bad to be on the receiving end of. Another first for any fighter, Steve can also build temporary terrain blocks in the air. You cant build them out too far away from the stage, but they nonetheless give him a nice defense against juggles when he gets launched vertically and can be used for some interesting set ups for the more creative thinkers out there. However, his trickiest technique involves his down-B TNT block: he can lay down TNT and walk backwards to leave a fuse trail, and then ignite it by either stepping on a pressure plate or by using one of the flame based attacks on either his down-smash or down-tilt. Being able to use his blocks or his TNT in effective ways is pretty tough to get a hang of, but the moments where a clever idea clicks together for a KO make Steve a blast to play. Unfortunately, there are also moments when Steve feels boring and frustrating instead. Steve is so dependent on resources that he constantly needs to either get a big hit to knock the enemy away, or simply run from the action in order to mine up depleted materials. I found myself having a miserably hard time against any characters that were exceptionally fast, or had quick projectiles that could interrupt my mining. Its especially bad when youre low on steel because his recovery is significantly worse without being able to use his minecart. The Meta Knight-style glider on his up-B does not give him much vertical lift, making it very hard to recover from the lower parts of a stage  which in turn makes his recovery fairly predictable and unsafe without his minecart. Also, without iron, hes unable to use his down-air anvil drop at all, which is one of his best kill moves. Unfortunately, there are also moments when Steve feels boring and frustrating. A lot of this could likely be chalked up to my own inexperience with the character, and I can totally see Steve being a big threat in the hands of someone who knows how to properly manage his limited resources. But Steves set-up-heavy gameplay style is not enjoyable enough for me to really want to conquer that steep learning curve. That said, boy does he have some nasty tools at his disposal. Aside from the aforementioned minecart, Steves up-smash deserves some special mention, as it covers nearly half of a platform on Battlefield, has a super long active hitbox, and does big damage and knockback. Its probably one of my favorite up-smashes of any fighter. Steve can also deal big damage at low percentages by doing nothing but walking toward someone while holding A to continuously slap them with a sword, eventually finishing off the combo with either a forward-air or smash attack. Its not very flashy, but it works  assuming his sword doesnt break. Hes also a nightmare to deal with for certain characters that rely on vertical recoveries because his down-air anvil can be dropped off stage and wreck characters trying to recover from the bottom. Move over Donkey Kong, K. Rools got a new most-hated rival. Finally, theres the stage, Minecraft World, which is actually one of my favorite of the DLC stages. There are multiple versions of the stage, set in different Minecraft biomes, with each match beginning with destructible blocks that eventually give way to reveal a more traditional straightforward Small Battlefield style of stage. Theres all kinds of Minecraftian touches going on in the background as well, such as a day night cycle, zombies coming out at night and then igniting on fire once day break hits, villagers going in and out of houses, and so on. Bandai Namco and Sora should be commended for somehow making Minecrafts Steve work within the confines of Super Smash Bros. Ultimate. Its truly impressive just how much of Minecraft is faithfully represented in Steve, resulting in the most mechanically unique fighter yet in a game already full of them. But while his inventiveness allows for some exciting moments, due to how intrinsically tied to mining and crafting Steve is, it can also lead to a lot of frustration.", "date": "Oct. 16, 2020,"}