{"name": "Madden NFL 18", "name_review": "Madden NFL 18 Review", "ref": "https://me.ign.com/en/madden-nfl-18/136787/review/madden-nfl-18-review", "text": "Ask Tom Brady and Matt Ryan what they think about halftime adjustments. Those adjustments, major or minor, are the key to winning any football game  the types of championship-caliber adjustments we hoped for from Maddens move to the Frostbite Engine in Madden NFL 18. The engine has enhanced the graphics dramatically and added an immense amount of detail to the absolutely wonderful Longshot story mode, but EA Sports misses the opportunity to really make its mark by refreshing the gameplay in meaningful ways. While playing a rematch of last seasons Patriots vs. Falcons Super Bowl, it was easy to get distracted by the lighting effects and the improved body types, which, to my eye, have both taken the largest leap of any of Madden 18s graphical upgrades. While watching a replay I noticed details like how the glimmer of the sun flickered off of a receivers helmet, and even while referees are announcing penalties you can see that the glare in their faces is real. The body types brought a second glance from the moment I turned on Madden NFL 18. Players still look a bit stiff and can run into each other while walking around between plays, but each position and body type is well represented, which is more than previous Maddens can say. And while its a smaller touch, stadium and uniform detail have really stuck out to me. The pop from the Seahawks lime green and the Buccaneers orange is a highly appreciated detail. The new animations look great and aren't repetitive.On the more tangible side, the engine switch makes gameplay look more fluid thanks to enhanced movement and interaction animations. My expectations werent too high considering FIFAs first foray with Frostbite encountered speed bumps from using old animations in the new engine, but Madden doesnt encounter the same problems. The new animations look great and arent repetitive, and so do the one-on-one interactions are strong and fluid in every activity Ive seen (line play, secondary coverage, and tackling). When I picked off Russell Wilson in the red zone, my DB was tripped up by Doug Baldwin, and when I took a closer look at the replay the animation was spot on. (Its a shame that to truly appreciate the animations you need to watch the replays, but I highly recommend taking the time to do it.) Gang tackling looks smoother as well, but we still see bowling pins and unnatural-looking rag dolls on occasion. The new Target Passing mechanic, which allows you to lead your pass catcher, is a doozy to learn (or maybe Im just terrible at it) because it moves extremely fast and demands on-point precision. I dont always complete a pass, but Im slowly getting the hang of it and how to lead correctly. I dont think accuracy ratings play into the mechanic, which turns it into a mini-game inside the passing game. I dont see the point of the mechanic because it doesnt give me any reason as to why its better or a preferred way to be more accurate. Open practice is going to be your friend while learning how to use this, but Ill stick with traditional button passing. Target Passing doesn't give me any reason as to why it's better.Though its easy to see the graphical improvements, the real star of Madden NFL 18 is its new story mode. EA Sports finally breathes life into the single-player side with the introduction of Longshot mode: a fantastic story-based experience using a strong cast of motion-captured actors and a well-written script that kept me engaged with RPG-style decision making. Its storytelling sequences make great use of the more lifelike graphics  imagining what it wouldve looked like with last years engine made me appreciate Frostbites upgrades even more. A good single-player experience is a significant development for this series because its been without one for four years. Maddens old solo mode, Superstar, was a waste of space and barely worth discussing. Thankfully, EA Sports eventually saw the light and dropped it after last publishing the mode in Madden NFL 13, which left Franchise as the only real single-player option. Thats why Im so used to Madden being relegated to a fun, dynamic game of multiplayer football with my best friends, and of course the ever-growing online community. And that was great, but it wasnt a good look for the NFLs exclusive console game to lack a strong solo option while single-player modes are doing great things in other sports genres like NBA 2K and EAs own FIFA series. But in Madden NFL 18, EA Sports has created a theatrical-quality, immersive, emotional, and educational single-player experience that had me glued to my TV for its five-hour run. The Longshot story mode  an adventure that takes you through the life of former blue chip quarterback Devin Wade as he makes his way through high school, college, and the NFL  captured my attention as a student of the game and kept me coming back to find out what happened next. The Longshot is a single-player experience that has me glued to my TV.While walking in Wades shoes, I encountered a sense of accountability Id never felt in a sports game before. The script is very well written, and stays interactive with Mass Effect-like decisions and button prompts that will affect your football IQ, draft grade, and social standing. Even something as trivial as choosing to post a semi-crude video to social media can impact your story. I was torn down by my coach for calling the wrong play and brutally hammered by the media when a press conference quickly got out of hand, and for every big or small mistake I made, I felt bad for Wade because of the repercussions. Those choices felt meaningful on my first playthrough, but after playing 50 percent through for a second time to test their impact on the outcome its become clear that Longshots story is linear with a few alternate scenes and endings. Its interesting that Longshot doesnt rely much on Maddens traditional football gameplay to succeed. Through the first two hours of the campaign, there was nothing more than a few button games and a quick challenge on the field. But once you hit the halfway point the gameplay kicks it up a notch and becomes a focal point as you begin to encounter former NFL stars throughout the mode. After the ending, Madden seamlessly transitions you straight to Madden Ultimate Team (MUT) mode, instantly filing your collectible-card lineup with players, coaches, stadiums, and uniforms from Longshot. There are also 27 solo challenges in MUT that let you live relive key moments from Wades past, present, and future. The best challenges are reminiscent of the NCAA Football franchise, as youre controlling the University of Texas vs. the Oregon Ducks with the NCAA theme song playing in the background. Its a respectful nod to EA Sports historic and highly regarded but dormant college franchise. Plus, theres an opportunity for EA Sports to release new challenges and cards that relate to Longshot throughout the year, potentially keeping the mode somewhat relevant for longer than launch period. Squad Up I have never been a fan of the grind that comes with the collectible card modes, but this year I was enticed to give Madden Ultimate Team a wholehearted chance with the Longshot elements and the new 3v3 competitive mode, MUT Squads, and was pleasantly surprised. I could see Squads catching on with competitive esports teamsYou and two other players team up and fill the Offensive Captain, Defensive Captain, and Head Coach roles. The on-field team is a mix of the three users Ultimate Team lineups, opening up some really cool possibilities of creating a star-studded team at random. As a foundation, I love the idea, and I could see Squads catching on with competitive esports teams. In fact, I strongly recommend playing with a premade team you know, because some of the games I played with matchmaking were a much worse experience thanks to a lack of communication and a wide disparity in skill level. But winning as a team is much more fulfilling than winning a one-on-one match. The other notable difference between MUT Squads and standard Madden gameplay is that the standard camera angle here is zoomed out pretty far, giving it a different feel. Controlling the smaller players takes a minute to get used to, but once I got the hang of it I appreciated the wide-open space and seeing my teammates run with me. I used the camera view to break a long touchdown run with Barry Sanders, something I wouldnt have been able to do as strategically in the default camera angle. Another good tweak this year is the ability to play offline and in Franchise mode with three distinct gameplay styles: Arcade, Simulation, and Competitive. This addresses a long-standing frustration Ive had with the series, in that I play Madden regularly with a handful of friends and acquaintances who all like to play in different ways. Some like to score as many points as possible and go for it on 4th-and-28. Others will delete my number from their phone if I ever go for it on fourth down early in the game while on my side of the field. Its all about our own styles. So its a relief to see that those styles are now officially supported in Madden NFL 18. Arcade provides tons of scoring, limits penalties, and removes injuries entirely. Plus, the hit stick and fancy ball-carrier moves have an increased chance at succeeding, leading to more of the Wow! moments that I crave when playing for bragging rights. During my first game in Arcade mode, I launched an 80-yard bomb to the Titans Corey Davis for a quick score, only to be on the receiving end of a similar big play courtesy of Russell Wilson only three plays later. Its a great mode for beginners and those looking to have a quick and entertaining game of Madden, especially considering the AI tends to be on the forgiving side of things. Simulation, which has always been my preferred style, gives the hardcore Sim Nation fanbase what it wants: an authentic NFL experience built upon stick skills and player ratings where penalties and injuries stay consistent. While using Simulation in Franchise, it encourages proper team building and play calling giving you the most realistic Sunday possible. Competitive is the final piece of the Madden puzzle, and one that will hopefully show the acceptance of Maddens growing eSports community over time. Competitive really started to grow on me while I was in matchmaking (by the way  Madden has the most stable online servers of all the sports games). This mode is heavily weighted on stick skill, which made it that much more fulfilling when pulling out a win online. The improved ball hawk mechanics shine in this play style, as mastering the timing on errant throws can really add to your interception rate. Another new mode, Play Now Live, allows you to follow along the real-life NFL season with in-game challenges to rewrite history, or imagine it before it happens. As an added bonus, the commentary is already updated with chatter of the NFLs first week of preseason, which gives sophomore commentators Brandon Gaudin and Charles David fresh conversational material (which they sorely needed after a limp debut last year). This week, for instance, I played the preseason matchup between the Rams and Raiders, where the commentary of the big Sammy Watkins trade ruled the conversation. Once the game is completed, you can move right into Franchise mode to play out the rest of the season. Outside of the updated commentary, Play Now Live is lifeless, giving no reason to sit down and play awhile. Finally, its a bit disappointing that my favorite mode, Franchise, went almost completely untouched from last years version to this one. Tiny tweaks to the presentation were made, including lineup introductions showing full 3D model players rather than headshots. And the soundtrack is one of the better ones in recent years. But other than that, EA Sports developers really meant it when they said at E3 that the focus would be entirely on Longshot and the port to Frostbite, and it sucks that I havent been given a reason to fire up the new version. The shift to the Frostbite Engine definitely lets Madden NFL 18 look fantastic, and Longshot makes great use of that to tell a short but powerful against-all-odds story. MUT Squads also opens up a new way to play with more than two players. But beyond that, the underwhelming feel of gameplay improvements and lack of much of anything new within Franchise, Madden NFL 18 sails wide-right in the final seconds. That said, being a much better-looking version of a solid football game with a great new story mode makes it at least a significant improvement, even if its more incremental than wed hoped from a new game engine.", "date": "Aug. 24, 2017,"}