{"name": "Vampires vs. the Bronx", "name_review": "Netflix's Vampires vs. the Bronx Review", "ref": "https://me.ign.com/en/vampires-vs-the-bronx/177898/review/netflixs-vampires-vs-the-bronx-review", "text": "Vampires vs. the Bronx is now streaming exclusively on Netflix. Vampire movies for the most part have focused only on the sexual aspect of Bram Stoker's monster. The seduction of the innocent, and the sexual liberation of women  which ran contrary to the Victorian society that read Stoker's novel. But Netflix's latest kid-friendly horror film, Vampires vs. the Bronx flips the script and uses the undead as symbols of class tensions and the systematic oppression in communities of color through gentrification. If nothing else, that alone makes Vampires vs. the Bronx a film worth checking out. That it's also a fun film with a great sense of humor and identity, and a great cast to boot makes it the perfect way to start the Halloween season. Director Oz Rodriguez (who co-wrote the script with Blaise Hemingway) isn't here to rewrite vampire lore, but to use decades of existing tropes in order to give a voice to the voiceless, and tell a story that hasn't been told before. The film follows Miguel Martinez (Jaden Michael), also known around the block as the ~Lil Mayor~ of the Bronx. Miguel is planning a big block party in support of a local bodega imperiled by rising rent, one run by a friend and sort of fatherly figure for him and his friends, Tony (played by Bronx faithful The Kid Mero). It turns out Tony's bodega isn't the only place that's being forced out of business, as some mysterious real estate company has been purchasing storefronts left and right, replacing the local nail salon with a store that sells different types of overpriced kale, or a literal butter store. More importantly, it seems people are disappearing too. It is up to Miguel and his friends -- Bobby (Gerald W. Jones III), and ~the Puerto Rican Harry Potter~ Luis (Gregory Diaz IV) -- to save the neighborhood. Rodriguez doesn't try to hide the core message of the film. On the contrary, it literally spells it out in the first five minutes of the film, as we see a nail salon owner selling their business to some outsider businessman before a tall, blonde dude literally sucks the blood out of them. Indeed, the film is interested in taking on the true horrors of gentrification, and explores it as a form of white supremacy  the people buying up the property around the block are not just any old white people, but ancient, pale white vampires with nearly silver hair who targeted the Bronx specifically because it's a community of color that not many people outside of it care about. Every time a new poster showing the face of a disappeared member of the community shows up, the characters sigh and refer to the Bronx as ~somewhere where no one cares when people disappear.~ Though they deal with different types of monsters, Vampires vs. the Bronx will most likely be compared to Joe Cornish's Attack the Block, which also combined genre storytelling with social commentary to great effect. And like Attack the Block, Oz Rodriguez's film owes much of its success to its very specific setting. It's become a bit of a clich to refer to a film's location as a character, but it is very much true of the Bronx in this film (it's even in the title). Vampires vs. the Bronx celebrates the traditions and mix of cultures in the Bronx at every chance it gets. When the kids arm up to find the undead, they realize everything they need is already at hand, because Latinx households are already equipped with garlic (or at least garlic adobo), and plenty of crucifixes. While at the bodega, the owner can't stop talking and showing off his precious Sammy Sosa baseball bat. Nearly every character sneaks in a few phrases in Spanish without the need to subtitle them, all while bachata blasts through the speakers. It's small moments like these that help the film feel authentic as it builds an image of the Bronx not as a ghettoized slum, but as a unique place worth protecting and conserving. Rodriguez, who comes from a long comedy background including the ~A Kanye Place~ parody for Saturday Night Live, knows just when to imbue the film with campy humor, or with more somber thrills. The kids make for a fantastic group you wouldn't mind seeing more of, and each of the supporting characters is as memorable as the next, particularly Method Man as Father Jackson, and Chris Redd and Vladimir Caamao as two guys who offer snappy commentary on what's going on around them. Jaden Michael, Gerald Jones III, and Gregory Diaz IV in Vampires vs. the Bronx. (Photo: Netflix) If there's one big flaw in the film, it's that it's a bit superficial in terms of character and plot. Other than its gentrification theme, the film follows a bit of a predictable plot. Basically, if you have seen any '80s-style movie starring kids fighting an outside threat to save their home, you've seen Vampires vs. the Bronx. Likewise, though the actors do a great job making you believe in the kids, their characters themselves are little more than archetypes without any sort of development or arc. Vampires vs. the Bronx won't revolutionize the vampire subgenre. But if you're looking to introduce someone to the genre, or you want a film that has something to say about gentrification and how it affects communities that also happens to be a delightfully entertaining kid-friendly horror film, this is the movie for you. Vampire vs. the Bronx offers enough kid-friendly thrills and laughs to entertain and introduce newcomers to the horror genre, while also offering a socially conscious exploration of gentrification we haven't seen in the genre before.", "date": "Oct. 7, 2020,"}