{"name": "Peaky Blinders: Mastermind", "name_review": "Peaky Blinders: Mastermind Review", "ref": "https://me.ign.com/en/peaky-blinders-mastermind/176287/review/peaky-blinders-mastermind-review", "text": "Peaky Blinders: Mastermind is like watching a baseball game that only gets exciting in the bottom of the ninth. It's a puzzle game set against the clock that unfortunately only begins to hit its stride as your time with it time runs out. While introducing some fresh time-bending and puzzle mechanics, it regularly fails to combine them into a satisfying mix. A challenging final couple of chapters ultimately save Mastermind, but never quite elevates it to the excitement of its source material. Based on the hit BBC crime drama, Peaky Blinders: Mastermind takes place prior to the events of Season 1 as the Shelby family (also known as the Peaky Blinders) attempt to assert their dominance over the Small Heath area of Birmingham. The casts likenesses are all fairly spot on and are instantly recognisable to anyone familiar with the show; among them are Cillian Murphy (complete with his signature flat cap) and Helen McCrory, radiating quiet authority. Not that she has a choice, that is  theres no spoken dialogue in Mastermind, which doesnt help fully recreate the tone of the series. Of course, Id take having to read over a poor imitation of the actors any day. Theres something slightly off about the conversations had between characters, though. The phrasing doesnt quite ring true and the tone that the family members take towards each other isnt entirely recognisable. Exchanges often resemble childrens storybook characters more than they do hardened criminals. The story is definitely not kid-friendly, however, as it revolves around a conspiracy that the Peaky Blinders are at the centre of as a web of violence, deceit, and revenge is uncovered. Its by no means a riveting tale, but a serviceable one with comic book panel-like cutscenes that glues its puzzle box levels together. There are 10 missions in total that took me around four or five hours to complete on my first playthrough, most of which take place in the cobblestone streets under the shadows of brick warehouses of industrial 1919 Birmingham. The atmosphere of the show is well reproduced in the environments even if some of the levels fail to stand out from one another due to the re-use of assets. Each of these missions consist of completing a series of objectives within a time limit while controlling one of the six playable members of the gang. The atmosphere of the show is well reproduced in the environments even if some of the levels fail to stand out from one another. The scampish Finn can crawl through small gaps and open windows, the burlish Arthur can kick down doors and brawl with enemies, and the cunning Ada who can distract police so others characters can pass by. These abilities offer variety for each character but ultimately all boil down to the same one-press button prompt to interact with items. The objectives can occasionally produce satisfying moments where you manage to successfully sync up the gangs actions, but at the same time a lot of these can fall flat, especially when certain scenarios are reproduced more than once. The main gameplay consists of puzzle solving mixed with some very light stealth mechanics as some anachronistic indie rock soundtracks your steps. The idea is to get each of your protagonists in the right place at the right time to aid each other, whether that be by using a lever to open a door, or by beating up a guard so that characters unable to fight can pass. This is mainly achieved through trial and error, though, rather than actual planning. Youll largely be moving a character to a point in the level where they cant progress, then using the rewind mechanic to get another to a point where they can assist the first character -- a system that may strike a chord with those who played 2017s The Sexy Brutale. The issue is that theres no penalty for rewinding, so if you take a wrong step or get caught in an enemys cone of vision its no big deal. Its a bit like playing chess against an opponent who allows you to go back a few turns if you think you made a mistake. The main gameplay consists of puzzle solving mixed with some very light stealth mechanics as some anachronistic indie rock soundtracks your steps. It can be a little unrewarding, especially in the earlier hours, which feel like an overextended tutorial at times and only offer a couple of minorly head-scratching moments to earn satisfaction from. Its a shame it takes so long to ramp up, because when all the cogs eventually go into motion Peaky Blinders: Mastermind becomes a completely different experience and one that provides an enjoyable challenge. Mission 8 was the turning point for me -- thats where things got a lot more interesting. Up until then youre only controlling two or three of the characters at once for the vast majority of your time, and mainly in very similar looking locations. Youre regularly given simple puzzles to solve, such as open this door or pull this lever while sidestepping past a dozy guard, which quickly becomes dull and repetitive. A highlight of these earlier levels, though, was when I had to infiltrate a prison using Tommy, Arthur, and John by crawling through sewer networks and intricately evading guards while in the precinct. Mission 8 was the turning point for me -- that's where things got a lot more interesting. In Mission 8, though, elements of Tommy Shelbys psychological mindset are brought into play in interesting ways as he is haunted by his experience serving in the First World War. It forces you to play this specific level slightly differently to others and favours the stealth elements over its core puzzle box mentality. The same cant be said for the final two missions, but they take place on a much grander scale. This is where I found most of my fun with Mastermind. The main reason why these two sprawling maps are so good is that they require you to use upwards of 5 members of the gang for the first time, syncing them all up to create chain reactions throughout the city. It was genuinely thrilling trying to move my pieces around the streets in time to cut off my target from walking down an alleyway by moving a horse and cart. What seems a simple proposition at first, becomes an intricate series of events you have to trigger in order to get your desired result. These puzzles were more challenging and coordinating everyone became much less of a cakewalk than previously, so much that I had to rewind several times and rethink my strategy. Even when eventually completing it I barely scraped a bronze medal time, which had me eager to go back and try again to somehow shave over nearly a minute off to get the gold ranking. This medal system, along with a few customarily littered collectible pocket watches, offers a level of replayability to each mission, albeit a very limited amount. These last two levels are what I wanted Peaky Blinders: Mastermind to be for its entirety. Similarly, the final mission requires you to set off around Small Heath and split up your team to get the job done. It cranks up the difficulty slightly without ever becoming obtuse and wraps up the solid, though not surprising story in a satisfying way. These last two levels are what I wanted Peaky Blinders: Mastermind to be for its entirety: a challenging set of puzzle boxes that uses the whole gang set against a backdrop of mystery and intrigue. Its unfortunate that you only get about an hour or so of that at the very end. For the majority of its runtime, Peaky Blinders: Mastermind is a puzzle game with unique ideas implemented in uninspiring ways. Its story and tone hold the levels together in a solid but unspectacular way that neither let down its source material nor build interestingly on it. Once it all starts coming together in the final two missions and you get to use your entire team together to accomplish complex objectives it becomes a genuine challenge laced with enjoyment and I was left wanting more. I just wish that it hadnt taken so long to get there.", "date": "Aug. 21, 2020,"}