{"name": "Battletoads Project", "name_review": "Battletoads Review", "ref": "https://me.ign.com/en/battletoads-project-tba/176274/review/battletoads-review", "text": "Brace yourselves for some truth: Battletoads  the 1991 game for the NES  is bad. Awkward and stiff controls paired with an unfair difficulty that requires a level of precision and reflexes that those controls dont allow is a terrible combination for a beat-em-up, and its heroes felt like uninspired TMNT knock-offs. But Battletoads (2020) is mostly the exact opposite: its a simple but fun and fair three-player beat em up with enough humor and personality to drive a spin-off TV show  which I would totally watch if they made it. It takes the legendarily awful difficulty of the original and makes it into something thats actually enjoyable for its short run  and you can still crank up the challenge if you want. It sounds weird to say, especially for this notoriously narratively light genre, but one of the biggest things that kept me enticed was the story. Presented in a great Saturday morning cartoon style, the Battletoad trio of Rash, Zitz, and Pimple have been trapped in a virtual reality hole, living out a life where theyve been worshiped as heroes for the past 26 years. The Toads all have distinct personalities: Rash is a fame-starved idiot who wears sunglasses indoors, Pimple is large and sensitive, and Zitz is the self-declared leader and the smartest of the group. Its often said that its hard to do comedy in games, but these characters play wonderfully off of each other and got quite a few boisterous laughs out of me. The story itself is simple  the Battletoads want to be famous again  but its a lot of fun and bolstered by the great voice cast. Beyond the Toads, youll encounter an old nemesis and plenty of new characters, from a warring tribe of lumberjacks and gymnasts to the new main villains, the Topians. Uto and Pia, the new big bads, are Hollywood producer stereotypes obsessed with vanity and running everything like a television show, and their god-like powers and indifference to the Battletoads make them pretty entertaining in their own right. And I cannot fail to mention the music is a ripping rock and metal soundtrack that has been stuck in my head since I finished playing. Combat isn't too deep or elaborate but it can be a blast.The combat isnt too deep or elaborate but it can be a blast thanks to combos using the basic attack on the X button, launching enemies into the air with Y, and jumping with A to juggle airborne enemies with continued attacks. Any attack can be cancelled out of with a dodge or into a different attack, giving you all kinds of flexibility. The three Toads play distinctively, too: Zitz is the fastest with his attacks, Pimple hits the hardest with slower attacks, and Rash strikes a nice balance between the two. Adding into the arsenal, theres a push-or-pull mechanic with the Battletoads using their tongues to grab enemies and a crowd-control option that involves spitting gum on enemies to hold them in place. Whats more, you can remap the controls any way you would want to, but I found the default control scheme worked really well. And while I didnt get the chance to try out the multiplayer (for pandemic reasons), there is three-player co-op that has a revival feature in case your friends get downed in combat, further smoothing out the difficulty. Things can get hectic during encounters with different enemy types flooding the screen from both sides and, in some instances, appearing on different background and foreground planes that you can switch between. But even with all that going on, it was easy to keep track of my toad amongst the chaos. Characters are big on the screen and enemies will telegraph when theyre about to do a big attack so you can dodge out of the way or pull off an attack to interrupt them. Enemies will drop flies that you can slurp up in the middle of combat to regain a little health (how much depends on the difficulty level), so theres some margin for error as well. Battletoads could certainly have benefited from more and more creative types of bad guys to beat down.While there is an aesthetic difference to the enemies depending on which level youre on, sometimes appearing as living toys or alien lumberjacks or even strange beasts, there are truly only about four types of them: one that will attack with melee, one that attacks with melee but will also block, one that uses long-range attacks, and one thats invulnerable until you dodge its charge attack. Battletoads could certainly have benefited from more and more creative types of bad guys to beat down. Similarly, in part because a lot of the levels end with minigames rather than boss fights, theres only a handful of traditional battles, and they all work the same way: theyre big bad guys who telegraph attacks, summon regular enemies (giving you a chance to grab flies to regain health mid-battle) and enter grander attack phases testing your dodge reflexes. Theyre fun enough, but a bit one-note. The main source of variety in Battletoads is in its selection of different minigames that dot the levels.So the main source of variety in Battletoads is in its selection of different minigames that dot the levels, breaking up what could be monotonous stretches of fist fights with everything from hacking puzzles to a riff on the classic speeder bikes and sledding levels. In the original those speeder segments were a side-scrolling level with blocks that flicker into existence before human fingers could react, but here theyre an over-the-shoulder segment where you can actually see whats coming from further away. Its a simple concept of dodging and weaving behind walls and jumping over obstacles and, much like the rest of Battletoads, the generous checkpoint system makes this more of a fun challenge than the originals frustrating nightmare. Other minigames include a twin-stick shooter section and some platforming; theyre all basic but enjoyable diversions. While the campaign is undeniably short, at just three to four hours long, Battletoads has the virtue of never overstaying its welcome (depending on your difficulty setting and standing in the speedrunning community) and there are collectables in each level that add some replay value. I do wish there were something to unlock or an extra mode waiting for me when Id finished to make it feel more substantial, though. How Hard Can Battletoads Get? There are three difficulty levels: Tadpole (Easy), Toad (Normal), and Battletoad (Hard). Because Im confident in my manhood, I played on Toad for the first run through and found it to be a smooth experience thanks to a great checkpointing system. Tadpole, naturally, made combat easier, with enemies taking more damage from each punch while I took less, the speeder bike and other such levels being slower and easier to navigate, and other minigames having easier options and longer timers to complete tasks. Now Battletoad, on the other hand, is no joke. While my reflexes were good enough to get through the speeder bike level on Toad with little trouble, I died so many times on Battletoad that I eventually gave up and went to bed. That said, I still had fun failing, so Im itching to master it when I get the chance. After more than a quarter of a century in limbo, this new iteration of the legendarily difficult Battletoads takes everything that made the NES original memorable and reworks it into a friendlier, funnier beat em up. Entertaining characters with a great visual style, simple but rewarding combat and minigames, and a rad soundtrack coalesce into a respectably enjoyable revival, with its most notable shortcomings being that enemy variety is a little slim and the story is over too quickly.", "date": "Aug. 20, 2020,"}