{"name": "Spiritfarer", "name_review": "Spiritfarer Review", "ref": "https://me.ign.com/en/spritfarer/176229/review/spiritfarer-review", "text": "If playing through The Last of Us Part 2s bleak world is like taking a cold shower, Spiritfarer's is something closer to sliding into a warm bubble bath. Unexpectedly playing these two games side-by-side this month was a bit jarring, as both tackle the heavy topics of death and those left behind in its wake  but while the former does so through dark, unrelenting realism, the latter instead offers a colorful, feel-good hug. And though I do love The Last of Us Part 2, Spiritfarer undoubtedly sails alongside it as one of my favorite games of the year. While genres can be helpful to quickly explain the structure of a game, Spiritfarer has defied all my best attempts to label it. One could say its a story-driven base management 2D action-platformer visual novel metroidvania, but Id rather just say its unique. Its closest analogue might be something like Animal Crossing as you sail on, upgrade, and rearrange a boat full of friendly spirits that ask you to complete tasks for them (if, instead of leaving town, your villagers eventually told you they were ready to die and asked you to do it, that is). Regardless of labels, the result is a gorgeously animated adventure that finds plenty of charm and excitement in what could easily be a gloomy subject. Spiritfarer Gameplay Screenshots You play as Stella (accompanied by her adorable cat Daffodil, who can optionally be controlled by another player in local co-op), who must take over as the new Spiritfarer: a mythological ferrymaster who sails an ocean full of fantastical islands in search of spirits to house and, eventually, bring to their final rest at the Everdoor. That task will take you to beautiful villages full of rice fields, snowy lighthouses, and even bustling spirit cities as you collect resources and upgrade your ship in ways that let you explore more of Spiritfarers expansive map. Controlling your boat is as simple as picking a spot on the sea chart, the vast majority of which starts tantalizingly hidden. Once youve set a destination, your ship will automatically chug along to it, leaving you with plenty of time to kill and a boatload of tasks to do. Spirits could ask you to build them a house, collect certain items, or visit specific islands, but you get to decide which of their quest lines to prioritize. You could spend your travel time fishing off the aft and then experimenting with your catches in the kitchen to discover recipes, chatting with your spirit friends to learn more about them, building structures to make new resources available (like an orchard to grow fruit trees), and plenty more. Spiritfarers day-night cycle always made it feel like I had more to do than time to do it all in, but there was little penalty to going slow beyond missing my self-imposed deadlines. As a result, its a fun challenge to juggle and weave these jobs together efficiently, but never one that felt punishing. It's a fun challenge to juggle jobs efficiently, but never one that feels punishing. There are also buildable crafting stations that turn raw materials like wood and ore found on islands into usable items through simple but cute button-timing minigames  like a loom that lets you turn different fibres into thread, and then thread into fabric. The progression of finding one type of material to make a thing needed for an upgrade that lets you find the next tier of material is a bog-standard affair, but I did appreciate how little grinding Spiritfarer asked of me. As long as I was exploring (which I wanted to do anyway) I could generally find what I needed swiftly enough. In fact, all throughout Spiritfarer, I found myself having to unlearn habits games like Stardew Valley and Animal Crossing have drilled into me. Theres an impulse toward maximum efficiency  having every station working on a thing at all times; processing all your raw materials as soon as you get them; always making sure youve got seeds in your garden and a literal bun in the oven. And while you can play that way, Spiritfarer doesnt actually demand a fast pace, and doing so turns mundane tasks like melting ore to ingots and watering plants repetitive fast. Eventually, I realized that I could just plant stuff when I needed a certain veggie or make ingots when they were asked for, which turned those tasks back into amusing asides instead of constant chores. Phantom Pains The spirits you pick up along the way are all unique characters, each with their own story to uncover, house to build, and even favorite foods to learn  and while they may start out looking like the generic spirits you see on islands, bringing them onto the ship reveals their true form as some sort of anthropomorphic animal. Whether its the lovably obnoxious frog man Atul or the enchantingly posh deer Gwen, theyre all endearing additions to your rapidly growing mobile village. Each one of them represents a mini story of their own as well, both in unraveling their actual life before death and the literal quest line youll follow to make their stay comfortable. Even if some characters are less lovable than others (Im looking at you, Giovanni), theyre all wonderfully written. Keeping spirits happy through good food and good hugs (the hug animations for each one are just the greatest thing) will also let them pitch in on your journey, sometimes collecting resources or growing plants. Without spoiling them, one of my favorite guests even just gives you cute drawings they made. But the biggest thing a new spirit will bring is a request for a home of their own. Fulfilling that order asks you to not only find the resources needed to build their abode, but also to find enough space to fit it alongside all the other structures in a complex game of afterlife Tetris. Crucially, few buildings are a simple box shape, usually having odd parts that jut out and slanted roofs that ultimately force your deck into a jumble of ladders and platforms no matter how many space upgrades you buy to make it bigger. It undoubtedly makes it harder to navigate (an issue Spiritfarer has generally, as its also annoyingly difficult to do certain simple things like correctly interact with a spirit when they are standing in front of a door), but I loved that this encouraged a wild, patchwork look instead of a boring stack of apartments. Few buildings are simple boxes, stopping your boat from being a boring stack of apartments. The layout of your ship isnt just for aesthetics, either. Each new passenger also unlocks a corresponding resource-gathering minigame. For example, Gwens has you sail into a cloud of spectral jellyfish to catch them as they float by, while Atul turns thunderstorms into an opportunity to literally bottle lightning. Theres no real combat in Spiritfarer, but these exciting encounters fill a similar role and transform the roofs and ledges of your floating town into a platforming jungle gym. Suddenly, layout is incredibly important if you want to efficiently collect jellies, offering real challenge to this otherwise peaceful experience  and while I dont want to spoil anything, the combination of sight and sound in a later one of these genuinely made for one of the most magical experiences Ive had in any game recently. Styx and Stones Platforming prowess comes in handy off the boat too, as islands are dotted with hidden chests full of special items, like rare seeds, recipes, or just tons of money. Theres rarely anything too difficult here, but its still fun to explore forests and mines alike in search of secrets, all the while talking to the frequently hilarious spirits who live there full-time (some of whom have amusing, if simple, sidequests for you too, like going to other islands to sell rap albums). And while ship upgrades like an ice-breaking hull open up new parts of the sea to explore, unlockable platforming abilities like a double jump or glide will let you access previously unreachable areas on land, giving you a reason to revisit old locations in what is a surprising but not unwelcome metroidvania twist. The backtracking can get a little tiresome at times, especially as more and more of the map opens up to you, but the way Spiritfarer chains along tasks is impressive. It took me more than two dozen hours to complete, and I always felt like I had a clear goal I was working toward during that time despite rarely having an explicit main objective to lead me. New spirits will come and go from your ship, offering new resources which then unlock new areas that unlock new spirits that unlock new abilities and so on and so forth. This formula does become predictable toward the end, but the characters and locations you see are still so wonderful and diverse that I could have gladly kept going if there were additional spirits to recruit. But as they come, so do they also go. Thats the cruelest trick Spiritfarer plays: it has you feed and hug and fall in love with these cute, quirky characters, having them help out around the boat and building them lovely custom homes and then they have to leave. That part of the job is explicitly explained to you at the start, but the first time I had a spirit ask to go to the Everdoor and leave this world I found myself genuinely in denial. I selfishly delayed it as long as I could, and when I ultimately gave in, taking them there was a shockingly affecting act. Spiritfarer displays a masterful use of color alongside one of my favorite soundtracks in years. Spiritfarer has a lot to say about both life and death, and the way it says it is largely well done. Not all the characters are as impactful as others, but the ones I did connect with really did make me sad to say goodbye. But while its undoubtedly somber, Spiritfarer is never a downer. Its an unrelentingly feel-good game, staying positive (much like the warm hugs Stella so often gives) right to the very end, even when its tackling some very heavy stuff. Part of the reason for that is in its art and music, which are just phenomenal. The way Spiritfarer uses color (especially as the time of day shifts) is spectacular, and all its animations  from unique hugs to your kitty cat playing with a ball of light  are impressive as hell. Its music is also some of my favorite in any game from recent memory, up there with the likes of Ori in its orchestral beauty. Even though there were always tasks to complete, Id frequently find myself just standing at the bow of my boat with the UI turned off, watching the sunset and enjoying the moment as I sailed to a new island. Spiritfarer is a gorgeous mix of an action-platformer and an Animal Crossing-style town manager that stands out as one of the most unique and enjoyable games Ive played all year. Its lengthy campaign is full of charming characters with somber, touching stories, even when the tasks between them can occasionally lose their shine. But with little pressure to grind or hurry like so many other resource collecting games, the journey to Spiritfarers Everdoor is definitely one worth savoring.", "date": "Aug. 19, 2020,"}