{"name": "Helheim Hassle", "name_review": "Helheim Hassle Review", "ref": "https://me.ign.com/en/helheim-hassle/176177/review/helheim-hassle-review", "text": "Helheim Hassle feels like a descendant of Blizzards 1992 puzzle-platforming classic, The Lost Vikings, but instead of there being multiple vikings with unique skills to switch between, theres just one viking who can separate into multiple manouvrable body parts in order to overcome each environmental obstacle. With a neatly evolving set of puzzle mechanics and an hilariously offbeat cast of characters to meet along the way, Helheim Hassle is a consistently enjoyable adventure thats only tripped up slightly by a limb-switching control system that is too frequently all thumbs. Heres the setup: spectacularly named viking pacifist Bjrn Hammerparty dies in accidental and entirely comedic circumstances at the outset, and is subsequently trapped in Nordic purgatory he soon learns that he can detach his arms, legs and head from his torso in order to make his way along the highway to Helheim. Accompanying him along his tour of loose-limbed limbo is Pesto -- aka Pestilence, one of the Four Horsemen of the Apocalypse -- who offers a mixture of useful advice and sardonic putdowns, as the unlikely pair make their way towards a spectacular showdown with a modern day gamer bro version of the Nordic god Odin. Helheim Hassle manages to pull the arms and legs off its main character without ever pulling its tongue from its cheek.Successfully navigating each region of Helheim Hassles map relies heavily on finding the right combination of Bjrns detachable limbs, and each has their own strengths and weaknesses. A detached leg, unencumbered by the rest of Bjrns bodyweight, might be able to jump up to a switch on a ledge thats otherwise out of reach, but you wont be able to actually interact with the switch unless you also attach one of Bjrns arms to the leg first. Experimenting with the various permutations and lobbing limbs around is the whole idea of progressing through these gorgeous, hand-drawn environments, and although it may sound grisly Helheim Hassle manages to pull the arms and legs off its main character without ever pulling its tongue from its cheek. Bjrn to Run Helheim Hassles puzzles find some inventive uses for Bjrns severable body bits. One puzzle requires you to attach Bjrns head to one of his hands so it can scurry along some scaffolding in order to spy on the puzzle solution being set by a goblin below. At another point, Bjrns progress is blocked by a dragon, and he must throw one of his arms into the dragons mouth and then switch control to his swallowed hand in order to defeat the dragon from the inside. In a boost to variety, changes to the environment also have an impact on Bjrns abilities  as an example, you can roll his head in snowy stages to generate large snowballs that serve as makeshift platforms. Helheim Hassle does a good job of consistently freshening things up over the course of its six-hour main quest. Whats unfortunate is that its not just Bjrns body that has a tendency to fall apart. Although you get a few different ways to switch control between Bjrns separated body parts -- either by shuffling through them with the bumper buttons, flicking to them directly with the right thumbstick, or tapping the corresponding directions on the D-pad -- none of these methods are completely reliable. Instead, youre often shunted to Bjrns torso when you were trying to take control of one of his legs should your array of separated limbs be grouped too closely together. The fiddly controls are a fairly minor annoyance, but are greatly exacerbated by the more pressurised scenarios such as the handful of chase sequences and boss fights, where often it felt like I was less likely to throw the specific body part I wanted than I was to throw my controller in frustration. Despite these Helheim hassles I enjoyed the bulk of the journey and, perhaps even more so, I revelled in retracing my steps post-credits in order to track down and complete the lengthy list of optional side quests, like learning songs to record at the record store or figuring out how to get past the bouncer at the local comedy club. Many of these are far more involved than the mandatory puzzles because they introduce considerably more cryptic layers on top of the physics-based fundamentals, and completing them earns you soul coins that can be used to unlock unique levels that playfully riff on other indie game classics like Minecraft and Limbo. Those are fun inclusions. But mostly, I was compelled to explore Helheim Hassles world purely in order to interact with its quirky inhabitants. The wonderfully absurd and entirely self-aware dialogue spouted by every shop owner and bartender seems ripped straight out of the mind of adventure game icon Tim Schafer, and the countless goblins with cockney accents appear around the place as though theyd somehow successfully escaped from Jim Hensons Labyrinth. I certainly found the road to Helheim to be mostly paved with hilarity. Helheim Hassle is a colourful puzzle-platformer that consistently tickles ribs while youre tossing around its protagonists limbs. Its main quest does a good job of introducing new ideas frequently enough to to maintain interest, and the motley crew of characters and lengthy list of side quests makes for an environment thats well worth exploring. Although the waywardness of its limb-switching control system often had me up in arms, I found Helheim Hassle to be a fun way to get legless without doing long-term damage to your liver.", "date": "Aug. 18, 2020,"}