{"name": "Nidhogg 2", "name_review": "Nidhogg 2 Review", "ref": "https://me.ign.com/en/nidhogg-2/136373/review/nidhogg-2-review", "text": "Nidhogg 2s exciting, tug-of-war style duels preserve the frantic fun and unpredictability that made the first game great, with a few twists. Its handful of new weapons help spice up matches in new and interesting ways and a larger selection of stages adds more physical variety to matches, even if its garish new coat of paint isnt always easy on the eyes. The emergent chaos, thrilling close-calls, and epic comebacks of the first Nidhogg still dominate every moment of action in Nidhogg 2. Two opponents face off in a tense head-to-head duel of wits and reflexes, attempting to slay the other with pinpoint precision and make it to the end of a multiscreen stage. Ten shiny new levels in single-player arcade mode, multiplayer quickmatches, or up to eight player tournaments also add more fun platforming obstacles to contend with mid-battle. It only takes about 20 minutes to stab and slash your way through arcade mode, but its AI opponent, which gradually becomes more aggressive and employs new behaviors and playstyles in the later face-offs, serves as a good warmup session. Nidhogg 2 is a local multiplayer game at its heart, and thats where I spent most of my 10 hours with it so far. The most thrilling part about Nidhogg 2 is that no single game is the same. I could hop into a match with a friend or co-worker that would end in a single, frantic minute. One of us might get lucky, land a series of perfect divekicks, and leap or roll our way to the finish line. Another match might last 10 or 20 minutes, a desperate push-and-shove of clashing blades and flying swords that would often attract a small crowd of spectators around the office. New weapons up the stakes and force players to adapt in interesting ways. I love how you never know how long a game will go when facing off with a new opponent, but if youre not keen on the idea of neverending matches, Nidhogg 2 lets you set time limits that, if met, will roll into a sudden death, single-screen duel to determine the victor. There are other convenient and fun ways to customize matches, too. You can limit which weapons you can spawn in with; disable throws, divekicks, and slides; and even enable weird cheats like low gravity and boomerang swords. One thing I was sad to see missing was a stat screen at the end of a session that listed out kills and suicides per player, and how long the match lasted. Still, being able to tweak matches to your liking is a welcome return feature. The simple mechanical genius of Nidhogg 2 shines brightest when its just two players facing off with the classic fencing swords, alternating between high, mid, and low positions in a flurry of quick stabs and parries. But now, players can end up with new weapons each time they respawn, which ups the stakes and forces players to adapt in interesting ways within a matter of seconds. Trusty divekicks and unarmed executions make a welcome return. Broadswords swing slower, but more powerfully, capable of knocking weapons out of an opponents hands. Unlike the classic fencing sword, you also cant accidentally poke yourself at the end of an opponents broadsword, but it seems to have a broader range when swung. Daggers are quick, but have less range when armed, making them great for throwing. Bows, on the other hand, feel absolutely useless. Ive nailed some cool kills with them, especially because a well-positioned sword can deflect their arrows, but their rate of fire is too slow against a quick opponent. In situations where I spawned in with a bow, I usually opted to throw it at the opponents head (a non-lethal move, but enough to stun them) before picking up a spare weapon from the inevitable pile-up on the ground. Every time you die, you drop your current weapon and spawn in with a new one, or sometimes the same one you had before. That, combined with new weapon types, makes for more options when deciding when to throw my current weapon to get a ranged kill and roll to grab another blade off the ground. Sometimes you dont even need a weapon to dominate the playing field. Nidhoggs trusty divekick and unarmed execution moves make welcome returns. A nimble player can knock an opponents weapon out of their hand and take them out even if theyre unarmed themselves. While still just as effective, the melee takedown in Nidhogg 2 has lost the brutal neck-snapping style of the original in favor of an obnoxious stomping animation. Nidhogg excels at letting humor bloom in the chaos of battle. Visually, Nidhogg 2 replaces the sleek and graceful minimalism of the first game with a much more colorful and cartoonish style that I wasnt always a fan of. Some of the backgrounds look fantastic  vibrant and animated scenes that feel more accessible and mainstream than the bold restraint of the original. I loved the lo-res, cursed Atari look of the first game, with its jagged platforms and crackling backdrops, but I also dont hate the sparkling beaches and birchwood forests of Nidhogg 2s new, revamped world. The tacky, bubblegum-colored characters are not as pleasing to look at. You can customize them with new hairstyles, tops, bottoms, and accessories, but they never lose that dead-eyed cartoon stare and awkward ragdoll animation that makes them so objectionable. They still paint the arena with their unusually-colored blood when they die, but because the arenas are so much more detailed and busy than the first games clean minimalism, it looks less like a sound stylistic choice and more like a distasteful mess of clashing colors. Their more humanoid shapes make the violence less artistically abstract in general: they burst into chunks of ribs and eyeballs every time they die and wear awful cartoon grimaces as they stomp each other into slime. Its meant to be silly, but it really just feels unnecessary. Nidhogg has always excelled at letting its humor bloom in the chaos and competition of its two-player battles. The good thing is, those battles are ultimately still fun to play no matter what the style looks like. The amount of action that can transpire within a couple of seconds in Nidhogg 2 makes for two-player combat thats both intense and hilarious to play or watch with friends. Nidhogg 2s visual style might not be for everyone, but its sharp, minimalist duelling is still smart and chaotic enough to allow for endless couch competition.", "date": "Aug. 17, 2017,"}