{"name": "The Dark Pictures Anthology: The Devil in Me", "name_review": "The Dark Pictures Anthology: The Devil in Me Review", "ref": "https://me.ign.com/en/the-dark-pictures-anthology-the-devil-in-me/203291/review/the-dark-pictures-anthology-the-devil-in-me-review", "text": "Usually the most unsettling thing you can find in a hotel is a mysterious mattress stain or clumps of hair in the shower drain, but The Devil in Me presents you with accommodations that are less like a Best Western and more like your worst nightmare. Inspired by a real life murder castle and its infamous serial killer hotelier, the fourth and final episode in The Dark Pictures Anthology's first season presents a fascinating facility full of ghastly deathtraps and creepy animatronics to encounter. Unfortunately it squanders it all on a bland band of lead characters, and pads its runtime with tension-draining detours that made me wish I could have called down to reception to request an earlier check out time. The Devil in Me's premise is certainly a tantalizing one. An unsolicited invitation to spend the night in a remotely located reconstruction of H.H. Holmes house of horrors would seem easier to turn down than the volume on a silent movie, but it proves to be too good to refuse for a small crew of filmmakers struggling to produce a documentary on Americas first serial killer. The team is effectively there just to grab footage that will lend some authenticity to its production, and indulge in the lavish hospitality of reclusive hotel owner Granthem DuMet. But the promise of bed and breakfast soon gives way to the threat of bedlam and bloodlust as it becomes clear that DuMet isnt just intent on recreating the look and feel of the Worlds Fair Hotel, but reenacting the horrifying events that took place within its maze-like structure too. Unlike the previous installments in The Dark Pictures Anthology which were each inspired by supernatural evils, The Devil in Mes roots in real historical events brings a far more plausible edge to its horror, which I personally find far more compelling than fantastical tales of ghosts and vampires. Uncovering the clues about the hotels disturbing origins and the true identity of its owner remained a gripping endeavour, and I was definitely more preoccupied with piecing its central mystery together than I was with ensuring its five playable leads each remained in one piece by the end.The promise of bed and breakfast soon gives way to the threat of bedlam and bloodlust...Last ResortThe main problem with its cast is that they are so uniformly uninteresting that I never felt particularly invested in their attempts to survive this harrowing stay in the heart-stab hotel. The Devil in Mes early cast interactions provide a broad insight into the groups dynamic  lighting tech Jamie and sound engineer Erin are nurturing a budding romance, journalist Kate and cameraman Mark are getting over a break up, while the only thing that director Charlie pines for is his lost packet of cigarettes  but the writing just isnt strong enough to put any real meat on their bones before it can be burnt or bludgeoned by one of the hotels devious torture devices.Developer Supermassive Games did a much better job at adding a believably human spark to its cast via the friendly quips in The Quarry earlier this year, but here any such attempts at playful banter all too frequently fall flat, and it doesnt help when the lines are often delivered with dead-eyed stares and stilted movements that make it seem like each character is literally scared stiff. Theres just very little warmth to anyone on screen, and thus when three members of the team were snuffed out during my seven-hour playthrough, each of their grisly fates elicited shrugs of apathy instead of shrieks of anguish. Gin and TronicThere was still a solid serving of scares though, typically delivered via the sudden jolting to life of the warped animatronic hotel workers and residents, first introduced in the form of an ominously silent bartender in the hotel bar and growing increasingly twisted in design as the story progresses through the darkest recesses of the building. A more physical threat is the mysterious masked assailant dressed as H.H. Holmes who stalks the separated members of your squad from the shadows like a bowler hat-wearing Michael Myers. The occasional encounters with him successfully ratchet up the tension even though they each rely on the reused set of run or hide decisions and quicktime events that have long become the standard in Supermassives horror template. Such tension is rarely maintained for long, however, since despite the variety of torture chambers to be found in its sadistic setting, the main thing that The Devil in Me seems hellbent on killing is time. There are significant stretches spent meandering around in the gloom, shimmying along ledges and crawling under fallen trees in the hotels island surroundings where you are safe in the knowledge that absolutely nothing can hurt you when youre outside of an interactive cutscene. There are certainly secrets to find, like the premonitions that hint at potential character fates, but theres also boring crate-pushing environmental puzzles and balance-beam walks that do little but pump the brakes on your progress forward.What We Said About The Dark Pictures Anthology: House of AshesIn many respects, you know exactly what youre getting with The Dark Pictures Anthology: House of Ashes. Its a QTE-filled horrorfest that is often stretching against the limitations of its budget. The script could use some polish and the characters could be a little more outside the box. However, the claustrophobic scares work effectively, and the central mystery of House of Ashes signifies a return to what fans loved about Until Dawn. It gives us a tantalizing look at what could be coming in the future.  Ricky Frech, October 22, 2021Score: 8Read the full The Dark Pictures Anthology: House of Ashes review The mansion itself is rich with ornate detail and atmosphere  every walk down a darkened hallway seems slightly more hair-raising when accompanied by scratchy opera music revolving on an old gramophone  but it too rarely feels particularly dangerous to explore. False walls that shift around you are intended to disorientate and induce panic, but instead prove to be little more than a minor inconvenience as you saunter from one end of the obstructed hallway to the other looking for the one door that doesnt have a locked padlock icon floating in front of it. Its surprising just how sedated The Devil in Me can seem, and at times it felt like Id checked into the worlds most terrifying hotel but forgotten to take the Do Not Disturb sign off the door.Lighten UpEfforts have at least been made to make each playable characters sequences feel distinct. For starters, theyre equipped with a range of contrasting light sources in order to navigate their way through the shadows  the flickering flame of Charlies zippo lighter casts an amber glow around his immediate surroundings, while Marks camera flash gives only a momentary glimpse at what lies ahead in brief bursts at a time, for example. The latter would have been a great way to startle with flashes of horror like the instant camera in developer Bloodious Games Madison, but unfortunately its not used nearly as creatively here. A modest inventory system has also been included for the first time in The Dark Pictures Anthology series, and this at least introduces different ways to interact with elements of your surroundings. Charlies business card can be used to jimmy the locks of certain drawers in order to access additional evidence, while Erins shotgun microphone is used to a reasonably unsettling effect in one sequence to isolate the tortured moans of an unseen victim. At times it felt like I'd checked into the world's most terrifying hotel but forgotten to take the 'Do Not Disturb' sign off the door.However many of the unique character-specific tools seem somewhat redundant. Jamie has an electrical multimeter to help her repair tripped fuseboxes, but its analogue display doesnt really seem to indicate anything of consequence as you idly flick the switches in the sequence indicated by each fuseboxs instructions. Meanwhile the monopod for Marks camera is eventually augmented with a sharpened drill bit to fashion it into a weapon, yet I was never presented with an opportunity to use it even though he stuck around all the way to the end credits. Such is the branching nature of The Devil in Mes narrative that subsequent playthroughs may well uncover more meaningful uses for these devices, but based on my first experience the inventory system seems like an addition to The Dark Anthology formula thats more superficial than Supermassive. The Devil in Mes twisted murder castle setting provides the literal foundations for what could have been an exciting horror adventure, but pacing problems and an insipid group of potential victims makes for a slaycation thats low in stakes and lacking in any substantial thrills or hand-wringing decisions to make. Efforts to bring gameplay variety to each playable character havent really shaken things up to any notable degree, and the quicktime event-based survival sequences adhere to a stress-inducing formula thats starting to feel a bit too familiar. Ominous animatronics and a hulking aggressor mean the concluding chapter of The Dark Pictures Anthology is still capable of inducing the occasional jump scare, but for the most part The Devil in Mes tour through a maniacs mansion is disappointingly lacking in any real menace or surprise.", "date": "Nov. 17, 2022,"}