{"name": "Othercide", "name_review": "Othercide Review", "ref": "https://me.ign.com/en/othercide/175530/review/othercide-review", "text": "Some parents are really invested in their kids report cards or success in extracurricular activities. Othercide offers a different kind of parental pride as you command a small army of warrior Daughters armed with giant swords and sleek revolvers they can use to slice, bash, and blast through a menagerie of Lovecraftian horrors. But this is more than an outlet for such dreams of blood-drenched parenthood, though. Othercide is also the best turn-based tactics game of the year so far. With the help of a mysterious figure called the Red Mother, Othercide puts you in charge of a darkly ethereal realm called the Inner Void from which you summon Daughters  echoes of whatever the Mother used to be  to stop the coming of an eldritch entity known as Suffering. Similar to 2018s Into the Breach, this will require failing and going back in time over and over until you manage to get it right. Each successive Remembrance allows you to carry over a currency called Shards from your previous run, so I never felt like I was having to start from square one. Failure is an expected and essential part of progression. Once I realized that death was never really the end, it could sometimes feel a bit too forgiving, though. Shards are used to activate unlocked bonuses on a per-run basis like increased health and damage, and even the ability to skip bosses youve already defeated. While there is a satisfying sense of progression, I usually earned so many shards per run that I didnt have to make interesting decisions about how to spend them. I could activate all of the bonuses Id unlocked at once. No Country For Health Potions Luckily, the other resources at my command did require me to make those difficult calls. Notably, Daughters do not heal between missions, and you wont find any healing abilities or items. On top of taking damage, most of the more powerful special attacks cost health to use. The only way to heal a daughter is to sacrifice another one of equal or higher level. Having a supply of sacrifices is rarely an issue, as the Vitae needed to summon new daughters is handed out in abundance. But the emotional weight I felt destroying one of my children so that another may live could be potent. As a consolation, the beneficiary will carry a part of the sacrificed daughter with them always in the form of a small mechanical bonus based on her stats at the time of death. The emotional weight of destroying a daughter so another may live could be potent. The final, and most precious, resource is resurrection tokens. Since each failed Remembrance sends your entire current roster to the cemetery, these function as a way to carry over some of your best fighters from one run to another. Theyre very hard to come by over the course of a run, though spending shards can allow you to start with a few from the get-go. They allowed me to maintain some sense of continuity and build a deeper bond with Daughters who had been with me since the beginning, which I really appreciated. When the turn-based action kicks in, Othercide proves itself a satisfying, challenging, sometimes frantic tactical dreamscape. Each of the four classes has a distinct role to play, from the tanky Shieldbearer to the heavy-hitting Blademaster to the ranged support specialist, the Soulslinger. The enemy diversity is great, from quick and deadly Scavengers to hulking, insectoid abominations that can lock you in pace with a gooey discharge. New foes are introduced gradually across the five chapters, and even seeing familiar ones in new combinations often forced me to stop and think about how to handle the situation. A time-based initiative system throws further excitement and consideration into the mix. Daughters who use more than half of their action points will have to wait a lot longer to act again, so its often smarter to end your turn with at least half remaining so you can better react to the changing battlefield. And with three mission types  the tense Rescue, desperate Survival, and ass-kicking Hunt  I had to learn what works best in a variety of situations. Mad, Mad World The one area where these missions felt a bit lacking was in the map selection. I saw the same layouts often enough for it to become a little repetitive, even if the horde of baddies was different every time. At least theyre nice to look at. Well, nice might not be exactly the right word. Othercide is bleak as hell, and its mostly black-and-white, gothic horror aesthetic does a great job creating an atmosphere of oppression and danger. The splashes of red the highly stylish Daughters bring enhances the feeling that they stand as emblems of hope in this doomed nightmare. I cant wrap up without mentioning the bosses, which are each expertly-designed puzzles that often have multiple viable solutions, but will absolutely kick your ass back to the beginning if you go at them guns blazing. I wasnt able to best any of the ones I came up against on a first try, but any enemy youve faced previously will be added to the codex where you can read up on its behavior. All of the enemies in Othercide behave deterministically; theres no randomness involved, except in the dice rolls for things like attacking and dodging. So understanding that a specific boss or enemy will always go after the closest Daughter, or the one with the least health, can allow you to manipulate them and lead them into traps. I really hit my stride when I realized the power this knowledge could give me. Othercide is a tactical roguelike with a flair for the dramatic, satisfying combat that rewards careful planning and knowing your enemies, and difficult, sometimes heart-rending shepherding of your resources. I still havent made it to the final, semi-secret unlockable boss, since this journey gets what the kids would call bastard hard by the end. But even so, Im really looking forward to finishing my business with them and uncovering the remaining secrets of the dark dream. Dont sleep on Othercide. This is one for the musty, moldering books.", "date": "July 28, 2020,"}