{"name": "Matterfall", "name_review": "Matterfall Review", "ref": "https://me.ign.com/en/matterfall/136370/review/matterfall-review", "text": "For the first two hours, Matterfalls exciting, fast-paced action, reflex-testing challenges and unique twists on 2D platforming put it up right up there with developer Housemarques best. Unfortunately, two hours is all it takes to beat all 12 levels, and while games like Resogun and Super Stardust are able to thrive past the length of their campaign through chasing high scores, Matterfalls structure makes earning a place on the leaderboards a chore. Matterfalls light sci-fi story about a dystopian planet full of robots gone amok is just there to give some light context to exploding hundreds of robots into millions of beautiful bits, which is fine. Housemarque games have always been about the explosions, and Matterfall delivers those in spades. Its twin-stick 2D action-platforming built around two main mechanics: A four-directional dash that can stun enemies and a Matter Gun beam which can detonate screen-clearing Matter Bombs dropped by enemies. The dash, in particular, is a brilliant mechanic that gives Matterfall its arcadey feel. While dashing you are completely invulnerable, and any enemy hit by the dash and its ensuing shockwave will be unable to damage you for a short time. This allows Matterfall to completely fill the screen with enemies and all kinds of bullet-hell madness without instantly overwhelming you. Youre forced to carve out a path with your dash while clearing out an army of constantly spawning enemy robots. At its best, the moment-to-moment intensity is fantastic.Its a style of gameplay that requires you to be extremely active, as you have to think about managing your dash cooldown, what enemies need to be eliminated first, and what projectiles can be dashed through. When Matterfall is at its best, its moment-to-moment intensity is fantastic. In addition to your primary blaster, you can unlock 12 slottable augmentations, including four secondary weapons, by finding civilians hidden in each level, and you can equip any three at a time. Housemarque does a great job of making each augmentation offer a substantial change in how you approach combat. For example, my personal favorite combo involves one that increases the chance that an enemy will drop a Matter Bomb, and one that allows me to detonate bombs by dashing into them, leading to a style of a gameplay thats focused on massive area-of-effect damage. Or, if youre the type that prefers a simpler approach of just run-and-gun, there are augmentations that simply increase your gun damage and health. Matterfall can be a tough game at times because of how much it throws at you at once, but between your dash, powerful secondary weapons, and screen-clearing Matter Bombs youre more than well enough equipped to deal with its difficulty. Its in a sweet spot of neither feeling too easy nor too frustrating. The real challenge comes from trying to maintain a high multiplier, since each hit you take knocks your multiplier down a level. And that leads into the biggest issue with Matterfall: its just not that fun to replay levels and try to improve upon your high scores. For one thing, restarting a level causes long load times of around 30 seconds, which wrecked the flow of repeated attempts. Meanwhile, many levels are brought down by frustrating platforming segments that slow down the pace and can unceremoniously ruin a good run with failures that are unrelated to the main test of skill of combat. On top of that, levels are just too long and padded by long stretches of running to make score chasing a good time. Its such an obvious missed opportunity, and the fact that theres no challenge mode, arcade mode, or a survival mode  any of which would have been a welcome way to take the most exciting parts of Matterfall and condense them into a singular replayable and score-driven experience  just makes it more disappointing. Matterfall succeeds in adapting Housemarques trademark style of fast, action-packed, arcadey action to the 2D platformer genre, but it feels like a puzzle half solved. Theres virtually no content here after you finish its exceptionally short campaign, outside of some harder difficulty modes and a global leaderboard to climb, and its level design isnt well-suited for replay value. Its a ton of fun while it lasts, but once its over its hard to not be left with a feeling of Is that it?", "date": "Aug. 16, 2017,"}