{"name": "Pokemon Scarlet", "name_review": "Pokémon Scarlet and Violet Review-in-Progress", "ref": "https://me.ign.com/en/pokemon-scarlet/203277/review/pokemon-scarlet-and-violet-review-in-progress", "text": "Before I started Pokmon Scarlet and Violet, I didnt quite believe they would actually let me wander off in any old direction like developer Game Freak claimed I could. Even with the increasingly open nature of recent Pokmon games like Sword, Shield, and Arceus, this has still been a very linear RPG series, with a set path of challenges and plot points lined up in a neat order. But then I picked up my Fuecoco and ventured out into the Paldea region only to have that disbelief completely shattered. After a few years of experimentation on the Switch, Game Freak has finally stumbled upon an open world formula that successfully reinvents how Pokmon is played, while remaining true to the nostalgic childhood vision of exploration, adventure, and cute monster collecting. It is, in almost every way, the transformation Ive been waiting for  but the grievously poor performance that has come along with it significantly mars this otherwise exciting design evolution.After a fairly beefy opening route and some exposition about going to school to become good at Pokmon , you are given three major story paths to follow, each with several objectives you can choose to tackle in any order. Its not unlike The Legend of Zelda: Breath of the Wilds structure of opening all four Divine Beasts at once  and similar to heading straight for Hyrule Castle to fight Ganon, you can (as far as I can tell) walk out of your school and run straight to the hardest gym and challenge it, though I wouldnt actually recommend doing that.Why a Review-in-Progress?The review embargo for Pokmon Scarlet and Violet has lifted, and while Ive finished the main story, were opting to hold our final, scored review until after launch for a few reasons. First and foremost is that the online features were not available to test ahead of release. While this has been the case for most Pokmon reviews, online has historically been limited to simple things like trading and battling. But with Scarlet and Violet, the ability to simultaneously explore its enormous open world with up to three other players was advertised as one of its new key features. Without online turned on, I dont know exactly what kinds of things players can do together in that mode, much less how it runs or if its any fun. Scoring Scarlet and Violet without testing it out personally would be a considerable omission, so were opting to wait until weve had a few days with it post-launch to make a final call.In addition to this, the review embargo we agreed to in order to receive early code from Nintendo was strict, and included limitations on what Pokmon we could show in our video review (including not allowing us to show a Pokmon that appears quite commonly on the very first route!). It also restricts us from telling you how long it took to finish the story, a critical piece of information that we endeavor to include in all of our reviews. Given all that, plus the limited amount of time weve had with Scarlet and Violet (code arrived less than a week before the embargo lifted), we decided it was best to take a bit more time so we could share our full, unrestricted thoughts in a scored review next week.Pokmon Scarlet and Violet do not include level scaling, so youll get destroyed immediately unless you follow the intended paths at least a little bit more closely. However, if you do try to take on objectives in precise order of difficulty, youll have to do a lot of inconvenient zigging and zagging across the massive Paldea map. What Scarlet and Violet actually seem to promote instead, and what I enjoyed so much about them, was getting gloriously lost. My journey involved accidentally walking into a slightly-too-difficult area early on, but using strategy and care to power through anyway. The first half or so of my adventure was incredibly difficult and rewarding as a result. When I went to work through the areas I had missed, I steamrolled several in a row before I caught up to more level-appropriate challenges again. While Im not wild about taking on a gym full of level 15 Pokmon with a team of level 35s, the inconsistent difficulty not only evened out by the endgame, it also didnt detract from my enjoyment much. Thats partially because Scarlet and Violets three story paths are all fairly involved and interesting on their own merits (especially compared to the weirdly truncated stories of Sword, Shield, and Arceus), but its also because exploring the enormous world was its own delight. Game Freak has taken another big step in the right direction with Scarlet and Violet in making a believable, creature-filled wilderness with a Regional Pokedex bulky enough that I didnt miss all the National Dex Pokemon it excludes. When I reached areas I was well overleveled for, I still had a great time hunting for items and using the autobattler Lets Go mode to train up some weaker monsters  or to barrel through a herd of Mudbray. Whats more, the wild behaviors and animations of Pokmon have been improved too. Magikarp swim up to the shoreline only to wash up and flop uselessly on the beach, clusters of Psyduck curiously gather to watch you battle, and Klawf dive bomb you from their perches on cliff faces. While Sword and Shields Wild Area looked more like someone spilled a bag of random Pokmon everywhere at times, Scarlet and Violet have monsters traveling believably in herds, clustering around a waters edge, or hiding up trees more akin to real animals. It was hard to stop myself from spending hours poking around Paldeas massive areas (the far more open evolution of past games routes) for all the monsters hiding there so I could finish this review.Aside from its phenomenal shift to a true open world, Ive had one other major takeaway from my time with Pokmon Scarlet and Violet so far that is impossible to ignore: they are a technical mess. In fact, there really isnt a moment in these games where Id say they run well. The framerate is all over the place, dipping agonizingly low even when only a few effects such as flowing water or weather are on screen. Character models only a few feet away pop in and out, sometimes rapidly, or chug along at stop motion animation speeds. Everything has a weird, shimmery blur to it, and shadows frequently disappear and reappear suddenly and illogically. Pokmon clip in and out of walls or floors at odd angles, or get stuck in them entirely  I spent an entire Gym Battle with one Pokemon halfway buried in the floor. The camera will occasionally clip through mountainsides and give a full view of a video gamey void, sometimes ruining cool moments (like, for instance, the evolution of my Wooper). Everything lags all the time, from battles to menus to cutscenes. Two of our guides writers have experienced hard game crashes. It is, by far, the worst-running Pokmon game I have ever played, and among the worst-running AAA games Ive played on the Switch so far. And yes, this is with the day one patch.There really isn't a moment in these games where I'd say Pokmon Scarlet and Violet run well. Whats saddest is that these issues frequently detract from what would otherwise be Scarlet and Violets most brilliant, standout moments. It is incredible to be able to stand on top of a huge snowy mountain at the center of a Pokmon region and see a dazzling light show of a gym in the distance one way, a sparkling lake in another, and a towering red mesa in another still, and know that I can go to all three of those places without a single loading screen, simply by taking a leap. A seamless, open Pokmon world we can explore however we like is a dream come true for Pokmon lovers, and for a brief moment I thought Id be able to put aside all the technical nonsense and just enjoy the plethora of good design choices Id been waiting for. But the issues are constant, and interrupt almost every moment intended to be spectacular or emotional or fun. For instance, the Paldea regions biggest and most beautifully designed city where several major story moments play out is one of the most technically janky areas of all. Heck, its impossible to simply run around any given grassy field for a minute or two and not be caught off guard by Pokmon models popping in and out or everything suddenly lagging dramatically. And thats all offline  what happens to it on launch day when I go online with three friends in these already laggy areas?I desperately hope some early patches can clean this mess up and bring it (I cant believe Im saying this) more in line with Arceus or Sword and Shield  those games had their technical issues, but they were much more forgivable by comparison. Because Scarlet and Violet are a blast to play, and aside from a few quibbles about the precise way certain systems work, Game Freak largely seems to have figured out what kind of open world design works for the series. It truly delivers on the Pokmon fantasy while embracing a more modern RPG style. Even as I cringed watching NPCs weirdly skate down giant staircases and vanish halfway, I was reveling in Scarlet and Violets fantastic story, characters, monsters, and world. I want more Pokmon games that play like this, just not ones that run like this.I am still looking forward to spending a lot more time in Paldea before finalizing my review and putting a score on it next week  especially as I see how the online multiplayer works once it goes live. I just wish this region was the beautiful, expansive, Pokmon-stuffed Paldea the artists and designers clearly envisioned and tried to present to me, and not the slow-moving, muddled, oddly-lit Paldea Ive been chugging my way through for the last week.Rebekah Valentine is a news reporter for IGN. You can find her on Twitter @duckvalentine. Catch never-before-seen Pokemon and explore a brand new region created playable with new open-world gameplay in Pokemon Scarlet and Pokemon Violet! Various towns blend seamlessly into the wilderness with no borders. Youll be able to see the Pokemon of this region in the skies, in the seas, in the forests, on the streets -- all over! Youll be able to experience the true joy of the Pokemon series -- battling against wild Pokemon in order to catch them -- now with open-world gameplay that invites players to go wherever their sense of adventure leads them. Brand new Pokemon populate this world, and players get to decide on their own new starter partner: will you choose Sprigatito, Fuecoco, or Quaxly?", "date": "Nov. 17, 2022,"}