{"name": "Jojo's Bizarre Adventure: All Star Battle R", "name_review": "JoJo's Bizarre Adventure: All Star Battle R Review", "ref": "https://me.ign.com/en/jojos-bizarre-adventure-all-star-battle-r/201214/review/jojos-bizarre-adventure-all-star-battle-r-review", "text": "Since its re-emergence in the anime scene in 2012, JoJos Bizarre Adventure has had an upsurge in popularity thanks to its exuberant characters, vibrant worldbuilding, and infinitely memeable moments. In 2013, developer CyberConnect 2 and Bandai Namco released a fighting game based on the long-running manga series to little fanfare. Almost a decade later, a remastered and upgraded version called JoJos Bizarre Adventure: All Star Battle R looks to make a splash in a fighting game genre thats become more exciting and crowded in recent years. All Star Battle R comes equipped with some bold new characters, smart updates to the combat system, and a disappointing replacement for the originals story mode. So in some ways, it succeeds as a celebration of the 35-year history of one of the most exuberant and vibrant anime and manga series out there, but while it remains an entertaining fighting game, its online components still feel archaic in the modern era. All Star Battle Rs impressive roster spans the entire history of the series - including 10 more fantastical characters than the previous iterations already generous 41. Representatives range from Phantom Bloods Jonathan Joestar and his diabolical adopted brother Dio Brando, to Jonathans descendant Jotaro Kujo from the Stardust Crusaders arc, culminating with Josuke from the most recent Jojolion storyline along with allies and foes from every part in between. Trying out each fighter is a joy and exploring the existing lovingly crafted fighting styles with the newly added assist move synergies brings more complexities to combat than possible in the original. Those combined with funny character quirks and interactions fill every match with pleasant surprises. The cherry on top is an update to the Japanese voice cast in All Star Battle R, with actors reprising their roles from the most recent anime adaptations to make these faithful recreations feel complete, and thats made ample use of in the middle of fights and on each menu screen.The New FacesAll Star Battle Rs Characters come in all shapes and sizes, some of which are not even human! Fighters like the ice-spewing hawk Pet Shop and Stand-wielding doggo Iggy are much smaller combatants than the typical JoJo. Despite their minor stature, their collision detection often matches those who are much larger, making incoming attacks that appear to go over or under the character hit like they were anyone else. Its not something I am too worried about as a balance issue, but it is worth noting that you might catch some punches and kicks that look a little off.Each era of JoJo has unique abilities and rules for combat, making for battles that are varied and fun to control. Every fighter has a style that fits their placement in the timeline. The first generation of characters, like the Hamon users, can recharge the HH gauge with the hold of a button and use their gauge for stronger special moves. Others have vampiric powers, while those from the Steel Ball Run arc can fight both on and off horseback. Its wild and wacky, in true JoJo spirit, and that makes matchups exciting. It's wild and wacky, in true JoJo spirit.Much of the seriess confrontations gravitate around protective spirits called Stands that act as a second body on the battlefield, and as such, a majority of the cast makes use of this special ability. This may sound a bit homogenous, but characters Stands can manifest in assorted and surprising forms, along with differentiating movesets, making every character feel like they have a cool gimmick despite sharing a common battle style. I appreciate that because, more often than not, learning one character carries over enough information to bridge the gap when trying out another. For instance, no matter who youre playing as, basic combos are easy to pull off, with light attacks smoothly transitioning into medium and heavy moves. Many of the special attacks are also mapped in similar ways across characters, making it easy to pick up for beginners no matter who they want to try. It's easy to pick up for beginners, no matter who they want to try. Speaking of beginners, Easy Beat is a great tool for new players to use to jam out simple combos using only the light attack button  until they learn how to piece moves together on their own, that is. I have had a great time swapping between the characters I love from the anime and then switching to later JoJo heroes and antagonists to see what kinds of wacky gameplay schemes they abide by. After youve taken that smooth onramp to playing All Star Battle R, there are plenty of advanced skills to learn to maximize your effectiveness on the battlefields. For example, battles play out mostly on a 2D plane, but the dodge button allows a character to dash into the foreground or background to avoid an oncoming onslaught; learning to do this is vital to open up counterattack opportunities and punish aggressive advances. Likewise, the more advanced Stylish Evade can turn last-second blocks into a time-slowing dodge, and getting the hang of it requires precise timing and intuition of what the opponents next attack may be.Learning when and how to use each of these skills drastically extends the depth of strategy.Assist characters selected from any roster member can also be called in to provide mixups, extend combos, or save you from a beating you may be taking. Even taunts serve an important function by draining the opponents resource gauge with appropriately timed trash talk. For those looking to get extra fancy, you can also spend a bar of meter to cancel the recovery of moves to either continue combos or make certain moves safe on block, much like a Roman Cancel in Guilty Gear. Learning when and how to use each of these skills is rewarding and drastically extends the depth of strategy and gameplay in All Star Battle R. What We Said About JoJo's Bizarre Adventure: All Star Battle in 2014JoJos exhibits a flagrant disregard for rules - both visual and mechanical - and for that, I truly love it. It can, at times, seem completely alien and imbalanced, but even then, it manages such consummate showmanship, its difficult to fault it too harshly. It is by no means a comprehensive, or polished fighting game, but it is a uniquely enjoyable one; exhibiting rare style and creativity in battle, even as it struggles to meet the standards set by other modern fighters. - Vince Ingenito, May 5, 2014Score: 7.4Read the full JoJo's Bizarre Adventure: All Star Battle (2013) reviewBecause of the timing of All Star Battle Rs release, its visuals are largely based on JoJo creator Hirohiki Arakis manga art style and is presented with a wonderful comic book aesthetic, including speech bubbles and dramatic comic panels. The colorful hand-drawn textures and impossible poses for each character model are wonderful to look at, even if some of the models and stages are starting to show their age in 2022.Most of All Star Battle R's offline modes are solid, if unremarkable. Most of All Star Battle Rs offline modes are solid, if unremarkable, but many kept me happily grinding matches for hours. Of course, arcade and one-on-one versus modes are expected in any fighter, and these activities are available here without any surprising elements. However, exciting additions such as a King of Fighters-like 3v3 team battle and support for tournament brackets you can play with up to eight people offer great ways to get together with friends and duke it out in person. These modes should be staples in modern fighting games, and I applaud their inclusion here. The primary single-player attraction is All Star Battle mode, which features canonical melees and hypothetical dream matches to see which JoJo from different eras would win if they came to blows. What I like most about these fights are the special conditions like giving you and your computer-controlled opponent increases or penalties to attributes like special gauge recovery, defense, or attack power. Certain boss-like characters may also start in a more challenging state, making many of the battles exciting and difficult confrontations to overcome. One of the remaster's biggest missed opportunities is in the storytelling  or lack thereof.While All Star Battle mode contains many fights from the JoJo manga and anime, theres not much to learn here about the plot of the series. Unfortunately, it leaves anybody whos new to JoJo completely in the dark as to what is happening in the story, who the main characters are, and why these fights are important. The originals story mode is nowhere to be found here, which means that one of the remasters biggest missed opportunities is in the storytelling  or lack thereof. All there is is a glossary filling in some info on important items and characters hidden in the menus, but it serves better as a reminder to lapsed fans than a guide to the greatness of JoJo. Thats not to say JoJos signature flavor is nowhere to be found; its alive and well on the battlefield. Explosive super moves known as Heart Heat and Great Heat Attacks unleash devastating combinations that are paired with ridiculous and flashy animations and voice lines. Some of the best of these include Dio pulverizing a steamroller (a classic), Diego transforming into a Jurassic terror, and Akira Otoshi shredding on his guitar while his Stand pummels their foe. Where things go downhill for JoJos Bizarre Adventure: All Star Battle R is in its considerably lacking online play. Not only are the standout parts of offline competition missing, like team battles and tournaments, but remote matches are also limited to strictly 1v1 matchmaking without the option for group lobbies. On top of that, while some matches play out just fine online, matches with any network slowdown can turn brawls into a constantly hitchy mess. Thats a real mood killer, especially in an age where online play is more popular than ever, and competing fighting games such as Guilty Gear Strive or Capcom Fighting Collection are flexing a much better online infrastructure with modern rollback netcode. I wish it were only connection problems, but there are more issues with online play. Entering into a ranked match is an exercise in navigating unintuitive menus, which made the simple task of selecting my preferred character confusing and frustrating. This annoying mode was also responsible for competitions where it lost my customized button scheme simply because I matched up in the 2P position. Its great to have JoJos Bizarre Adventure: All Star Battle represented on modern hardware with an improved combat system over its 2013 version. Its online implementation desperately needs an upgrade, though, and the crucial story context from the anime is nearly nonexistent. Still, All Star Battle R makes a strong case for itself in its raucous cast, accessible yet complex combat, and its set of solid  if safe  offline modes. Its not the best fighting game out there, but for those whore heavily invested in JoJos Bizarre Adventure, its one were glad to have on hand for a good time.", "date": "Sept. 9, 2022,"}