{"name": "Nintendo Labo Robot Kit", "name_review": "Nintendo Labo Robot Kit Review", "ref": "https://me.ign.com/en/nintendo-labo-robot-kit/146966/review/nintendo-labo-robot-kit-review", "text": "Its hard not to balk at the $80 price tag on a package that contains mostly cardboard, but the bigger and more elaborate Robot Kit is a step in the right direction for Nintendos new kid-aimed concoction. While the Variety Kit (review) is mostly a package of fun but limited ideas, the Robot Kit shows off the goofy potential of what Labo might do with future kits with a more elaborate toy that makes its simple game a whole-body experience. Of the two kits available at launch, the Robot Kit is by far the most complex and challenging individual Toy-Con to assemble. It takes an adult roughly four hours to build, and longer with kids pitching in. But once assembled, the clever backpack-like device contains a series of weighted cardboard bricks, each of which is tethered by a string to your hands and feet. When you extend one of your limbs, it pulls the string and hoists the brick upward, allowing the inserted Joy-Cons IR camera to read the reflective markings on the back and send that info to the Switch to control an on-screen robot. Finally, theres a cardboard visor strapped to your head to complete the look and add a view-switching option. And then you stomp around a futuristic city as a super-giant robot, punching and kicking the buildings in your path to rubble. Walking in place does feel awkward at first, but it didn't take long before I developed a decent understanding of the controls. Its helpful that the backside of your virtual robot has moving parts that reflect the inside of the cardboard backpack youre actually wearing  thats another detail that makes Labo feel that much more engaging and intuitive. And lowering the visor brings you into a more immersive first-person perspective, which actually has some interesting gameplay effects in certain areas. The Robot game ends up feeling shallow.Other than stomping and punching, there are a couple of cool moves you can make your robot pull off with different motions. You can transform into a tank by crouching, which turns your punches into laser cannons. You can also take flight by keeping your arms extended, allowing you to reach the tops of buildings before stomping them down to the ground. Its these small features that add a bit more variety to the otherwise straightforward game of punching buildings and UFOs. That said, the Robot game ends up feeling shallow because of  you guessed it  a lack of content. Each challenge stage offers enough variety to make things interesting. My favorite mode, and the one that feels most like an actual game, is Challenge Mode. It has five separate segments, each of which contains three stages consisting of multiple platforming and combat challenges. You can get through a stage in five minutes or so, but each stage offers enough variety to make things interesting. Some challenges include taking down enemies that you can only see from first-person mode, while others consist of flying around and hopping from UFO to UFO. Completing them unlocks new powers like pummeling enemies with rocket fists and launching energy balls straight from your arms. It was by far the most fun I had with the Robot Kit. Other than that, the options get thin. The very simple Robot Mode lets you rampage around a city for five minutes as you try and snag a new high score by destroying the most stuff in the least amount of time. Its just too simple to be lasting fun, though. There's a two-player versus mode, but you'll need a second Robot Kit around to access it  thats something we havent had the chance to do. The rest of it is customization. You can change the colors on each portion of the robot's body in the Hanger by inserting special cardboard tools into the slots on the right side of the backpack and turning them like knobs. The experience is Labo in a nutshell: its the feeling of playing with a tangible toy and seeing its digital representation respond to your motions on screen. Similarly, over in the Robot-Studio you can change the sounds the robot makes when moving its limbs. Its a kid-pleaser. For kids, the Nintendo Labo Robot Kit is like taking the fantasy of being a giant robot on a rampage and putting your imagination right up on screen. Their awe at seeing this cardboard creation come together to form such an imaginative toy makes it a fun family activity. On the other hand, as an adult, the included game doesnt have enough going on to make it worth more than a quick playthrough.", "date": "May 1, 2018, 9"}