{"name": "Phantom: Covert Ops", "name_review": "Phantom: Covert Ops Review", "ref": "https://me.ign.com/en/phantom-covert-ops/174630/review/phantom-covert-ops-review", "text": "Let me say up front that Im in no way saying that no special forces commando has ever stealthily infiltrated an enemy stronghold exclusively via kayak without ever setting foot on land. I mean, if such a soldier exists, they must be such a badass that no one has ever seen them and lived. But for the sake of argument, lets say its a goofy premise for a VR stealth game, and Phantom: Covert Ops leans into it hard enough that it sort of works. Given the fact that youre effectively half man, half boat its bemusing how seriously Phantom: Covert Ops takes itself. Youve got the amazingly generic name, and the paint-by-numbers Tom Clancy story about a former Soviet madman planning a biological weapons attack is played 100 percent straight, smack-talking villains and all. All of that is relayed to you through voices over a radio. Its practically self-parody. Where Phantom does stand out is in how you sneak around. Propelling yourself through the water is pretty fun once you get over how ridiculous waving a virtual kayak paddle looks to anybody watching  picture someone doggy-paddling through the air. I ended up getting into it, though, even putting my feet up on a footstool to simulate sitting in a kayak (though this sometimes made it difficult to reach items in my lap). Its cool to build up some speed, then hold the A button on the right controller and dip a paddle to make tight turns, though its a little inconsistent about when you can just hold the paddle and when you have to push repeatedly. As stealth games go, this is a fairly simple and forgiving one.At the same time, in a lot of ways dealing with the inertia of your boat while avoiding spotlights and incoming enemy boats is like if Agent 47 were trying to be sneaky while wearing ice skates. Getting the hang of stopping when you need to stop and positioning yourself close enough to a switch to reach out and pull it is not without its frustrations. Because of that imprecision its probably a good thing that, as stealth games go, this is a fairly simple and forgiving one. Granted, AI needs to be predictable and robotic for successful stealth to feel like solving a puzzle rather than just getting lucky, but these guys are hilariously dumb. Your binoculars permanently mark enemies for you, and soldiers are all but completely blind unless you float directly into their flashlight beams or zoom by them at top speed. I found myself being thankful that Phantom doesnt use the Rifts microphone to pick up sound that could be perceived by enemies because I was usually laughing in their faces at how brazenly I could lazily cruise by under their noses  sometimes literally when theyre standing on a bridge. Sometimes just sailing by isnt an option because an area is well lit or heavily patrolled, but in those cases there are usually highlighted objects like lights, radios, and fire extinguishers you can shoot to create a diversion and draw them away. Failing that youve always got a silenced pistol at your side that can drop all but the most armored of enemies with a single headshot. You even get about five seconds of slow-motion reaction time to take out whoever spotted you. What am I supposed to do with all these bullets?Its kind of odd that, for most of Phantoms seven missions, youre armed to the teeth: a silenced pistol, an assault rifle, and sometimes a silenced sniper rifle and another fun toy or two are strapped to your body and boat, and youll often have explosives you can toss. Usually I had more ammunition than I could carry, which was confusing because this is a game about avoiding firefights. Youre actually penalized for unnecessary kills. What am I supposed to do with all these bullets? I did enjoy being given permission to take out certain VIP war criminals when their identities were revealed by a scan  usually they have friends around who must be distracted (or killed if you dont mind running up the body count) which made for some rare moments where I had to game out how the AI would react. That doesnt mean its always easy: if you get cocky and dont stop to recognize patterns in enemy movements you can easily find yourself taken by surprise, and you die from just a few shots. Likewise, a couple of boss fight segments killed me multiple times as I figured out how to avoid invulnerable attack helicopters and snipers. Of course, the real challenge is running up the score by completing a level quickly, silently, and non-lethally  thats where the replayability comes from. On my first playthrough I only scored one A-grade in the between-mission report, so even though its campaign is only four or five hours long I could see myself replaying some to chase a few better scores. All levels are set in the dark of night within a dingy flooded Soviet military base.While theres some distinctive architecture to the map, I didnt see a ton of diversity to the levels because theyre all set in the dark of night within a dingy flooded Soviet military base. That doesnt leave a lot of room for creativity in the design, especially since everything has to be accessible without the use of your legs. Some areas are even reused for multiple missions. It does introduce a few hazards like mines to keep you from getting too complacent, though those were so easy to avoid I never actually ran into one. It doesnt help that even on the Rift S running off a GeForce RTX 2080 with the settings maxed out, Phantom doesnt look fantastic. Texture resolution gets obviously low when you get close to a wall or have to throw switches, and soldier animations are barebones. Notably for such a wet game, theres not much by way of wake and splash effects  in the first level, for example, you use a large cargo ship to cover your entrance to the base, but theres virtually no disturbance in the water behind it. The tradeoff is that you can play on the modestly powered Oculus Quest, so its not all bad. When youre done with the campaign there are a bunch of simple shooting gallery and timed killem-all challenges you can unlock and compete in to test your skill with the assortment of weaponry, plus you get the free play option that lets you revisit any of the levels with any equipment loadout you choose. Those extras do manage to make Phantom feel a little meatier. Phantom: Covert Ops is certainly a novel approach to a VR stealth game. Putting you in a stealth kayak to sneak up on ex-Soviet terrorists is a concept I didnt see coming, and neither do the virtually night-blind enemy soldiers youre up against. Its a bit simple even for its short length, and it doesnt look as sharp as some other recent VR games, but the kayak is pretty fun when you get the hang of it and chasing those high scores adds some replay value.", "date": "June 28, 2020,"}