{"name": "Waking", "name_review": "Waking Review", "ref": "https://me.ign.com/en/waking/174251/review/waking-review", "text": "Everyone has their shortlist of their favorite food and drinks. You might like pizza, steak, red velvet cake, and chamomile tea... but you would never want to dump all of that together onto one plate, mash it all together, and then expect it to taste as good as they all do separately. And that disgusting mess of an analogy is what Waking tries to do, but for game genres; take some from Dark Souls, some from various walking simulators, a little from Silent Hill: Shattered Memories, maybe a dash of Psychonauts, and definitely a healthy serving of roguelike. None of it works together, with each piece clashing with every other in the worst way possible. When you begin Waking, a screen pops up stating that it is a very personal experience where you play a character based on yourself, and goes on to say how it will ask about your life, family, and loved ones. This would be a fine idea except but it never truly amounts to anything. You see, your character is in a coma in a hospital bed and all wrapped in bandages, and you are traveling through your own mindscape trying to piece your brain back together so you can wake up. But theres a twist: the God of Sleep, Somnus, tries to convince you to move on from this world instead of fighting to stay alive. So when you get to these parts of the story that ask you personal questions, its not really about you  its more just what its going to name things everybody encounters: an attack or summoned NPC, for example. It truly doesnt matter what answer you give. Most of Waking felt like nothing I did mattered.In fact, most of Waking felt like nothing I did mattered. Youre given a variety of different named weapons to pick up  all named after emotions  but regardless of what theyre called they all do the same damage and all have the same appearance as a small knife. Nowhere I went mattered because every area I traveled to looked practically the same except for a different coloration and a lot of bloom. You go from red desert to green forest to white snowy mountain and a brown area, but they were all hard to look at because of how intense the bloom effect was. The only true variation I got was when Id get to a boss or story area, which are like stone tombs and caves, respectively. But even though most areas are similar, it was hard to navigate for a variety of reasons. For one, Waking is not a looker, harkening back to that Xbox 360 launch game feel. It looks like it would fit right along with a game like Bullet Witch. Perhaps Im dating myself here, but if you remember the music video for Californication by the Red Hot Chili Peppers, you can picture how these character models look. The NPCs and enemies all move in a stilted fashion and seem to snap into different animations instead of moving fluidly between actions, and the same could be said of the playable character. I often got caught on invisible level geometry, or I would do a melee attack which would also bring me to a full stop. Jumping never felt natural, with my character launching into the air like hes got a jetpack, only to be pulled back down to the ground at a physics-defying speed. All of this ugliness just lent itself to me being unable to remember where I was or what I was supposed to be doing or going toward. Going hand in hand with the ugliness and the repetitive landscape, the combat is also a slog. Everything you do costs a currency called neurons. It costs neurons to use basic attacks, to use items, to open certain doors, to use certain things within a level, to summon allies  but youre only allowed to carry up to 200 neurons at a time. If theres a way to upgrade that carrying capacity, there is no clear indication of how to do that, and this limit is stifling. Going hand in hand with the ugliness and the repetitive landscape, the combat is also a slog.Waking does grant you psychic powers to pick up clutter around the area and throw it at an enemy, but that might as well be a stiff breeze for all the damage it does  it only manages a stun on bigger enemies and does nothing at all to late-game enemies. You also get a pitiful, flailing melee attack in which your character flails around wildly, swinging the knife in every direction while doing, once again, little to no damage. Thats only made worse by the fact that its effectively limited by ammunition because it costs neurons  thats not how melee attacks work! And since you only get more neurons from killing enemies, it can lead to a paradoxical situation where you cant kill an enemy because you cant attack and you cant attack because you cant kill an enemy. This is all wrapped within an incredibly repetitious mission system where you have to travel from map to map doing really only one type of mission: go to a place, find three of a thing, fight a boss, and then move on. And you do this for more than 20 hours. In keeping with this theme of mindless repetition, there are only two music tracks that play over and over again. One sounds like a post-rock band like This Will Destroy You or Caspian just noodling around, not making much noise. The other is the battle music, which sounds like a Sunny Day Real Estate demo that no one ever wanted. Its nowhere near enough for a game of this length. But the most egregious part of this whole experience was how dragged out everything is. Ive gone on and on about the repetitive nature of the gameplay, but the story is incredibly boring and every cutscene is unskippable. All of the dialogue is delivered in what I can only assume is a made-up language, but an echoed whisper and the subtitles reveal that it has all the weight and eye-rolling seriousness of a first-year film student trying to understand metaphors. By the time I was approaching the end, I'd given up any pretense of taking Waking seriously.By the time I was approaching the end, Id given up any pretense of taking Waking seriously. I no longer answered the questions seriously, only giving joke answers. My most important friend? Sonic the Hedgehog. The place I treasure going to the most? Why, Applebees of course! This cynicism created the most enjoyable moments of the entire campaign. Entering a level and seeing a message about remembering Applebees intended to give me an extra boost made me giggle every time. By IGN law, I am required to mention that I didnt quite finish this game. I tried  I put in the more-than-20-hours described, and I did reach the final area. But its so infuriating that I flat-out refuse to go any further. Its honestly the most poorly designed and convoluted mess Ive seen in any game Ive ever played. Waking never explains what youre supposed to be doing to reach the final boss  it just plops you in the level with a five-minute time limit. After a while, I figured out that I was supposed to walk across different colored floor panels and if I chose the wrong one it instantly killed me. So I had to look along the walls for glowing squares to tell me which ones are safe and unsafe or pay a crystal ball to tell me one answer. That doesnt sound too unreasonable except that the crystal ball  which costs neurons, because of course it does  just kept giving me the same answer over and over and over again. Thats not helpful because there are like 10 different colors and wouldnt tell me the color I needed to know. I died three or four times and had had to start the level all over again and try to figure it out, mostly by guesswork. Oh, and did I mention that Waking randomizes its levels, so every time you die any of the information you gathered from the previous attempts goes right out the window? Yeah. Under no circumstances should you play Waking. If you want guided meditation, there are plenty of free apps for phones and videos on YouTube. If you want to play a Souls-like, there are plenty out there, including actual Souls games. If you need a game with psychic powers, Control is a lot of fun. But Waking does everything badly: its amateurish attempts at introspection, its poor combat, the tediously repetitious mission structure, the headache-inducing bloom effect, and aggravating puzzles add up to a miserable game I couldnt bring myself to finish even though I reached the final level. Avoid it at all costs and do almost literally anything else with your time.", "date": "June 18, 2020,"}