{"name": "Desperados III", "name_review": "Desperados 3 Review", "ref": "https://me.ign.com/en/desperados-2019/173981/review/desperados-3-review", "text": "While the Western genre may be synonymous with lighting-fast duels and run-and-gun shootouts, Desperados 3s real-time tactical stealth missions are best played at a meticulous crawl. Slow and steady is the order of the day in this often fiercely challenging game of covert cowboys, so its just as well that Desperados 3 gives you a colourful gang of outlaws with unique and complementary skills, ever-changing mission parameters that encourage experimentation, and a diverse collection of sand-swept settings to sneak through. Desperados 3 is a Western thats just as wily as it is wild, and should be firmly in the ironsights of anyone with the appetite for a serious stealth challenge. Its entirely possible youre not familiar with the Desperados series, considering the last instalment of the previously PC-only franchise  Desperados 2: Coopers Revenge  was released 14 years ago. It matters not, though, since Desperados 3 is a prequel to the original game and thus any prior knowledge of its plot or characters isnt necessary for newcomers looking to saddle up. Desperados 3s campaign serves as an origin story for main protagonist John Cooper, who stars in yet another tale of bitter revenge that spills its first blood on the rocks of Colorado and leaves a trail all the way down to the dustiest depths of New Mexico. Its a violent tour through a series of vibrant and wonderfully detailed frontier settings. The plot may be more stock standard than an unmodified Winchester, but what makes the 30-hour journey of Desperados 3s campaign so captivating is the camaraderie shared between its five playable characters. Their contextual banter as you make your way through each murderous mission really helps to define their individual personalities, making for an outlaw gang I was consistently happy to be at the reigns of. An early mission sees two characters make a bet to see who can claim the most scalps, and then with each subsequent kill you can hear them call out their running tallies like Gimli and Legolas in Lord of the Rings, which is just one of numerous nice little touches. Although it admittedly seems a little odd when these back-and-forths continue even when the characters are separated by large stretches of the map, almost as though theyve been outfitted with walkie talkies by a time-traveling Doc Brown. The Magnificent Five Each member of your bloodthirsty brigade has their own specific skills and tools, and much of Desperados 3 is spent hiding in bushes for several minutes at a time trying to decide exactly which combination of them is required to systematically snuff out each area full of enemies. Cooper can toss coins to startle horses into kicking guards unconscious, Doc McCoys rifle can snipe enemies from afar, Hectors shotgun blast can take out closely gathered troops all at once, and Kate can don a seductive disguise in order to divert an enemys gaze. These individual skills are typically best used in tandem, such as using Hector to lay down a bear trap behind some bushes and then getting the coquettish Kate to lure them into its gaping maw. Isabelle provides a supernatural spin on the otherwise fairly traditional stealth mechanics.Each character is consistently useful but by far the most valuable slayer in Desperados 3 is Isabelle. This voodoo priestess provides a supernatural spin on the otherwise fairly traditional stealth mechanics, largely by means of her ability to fire a blow dart into two enemies to link them together as a pair of walking voodoo dolls, whereby whatever fate befalls one is simultaneously inflicted upon the other. Tethering baddies together in this way leads to some truly inspired solutions for thinning out the enemy numbers, and I felt that Desperados 3 was really at its most flexible anytime Isabelle was placed by the story into my stealth squad of between one and five characters. Its a slight shame she doesnt actually join Coopers crew until roughly midway through the campaign, but when she does she reinvigorates the possibilities from then on out. All of the action plays out in real-time (this is not an XCOM-style game) but like developer Mimimi Games previous stealth-em-up, 2016s Shadow Tactics: Blades of the Shogun, it features the ability to pause the action and plot out a sequence of moves for your squad before executing them all at once to make complex simultaneous action possible. Desperados 3 improves on that concept with some welcome extra features such as the ability to chain together a series of moves, like killing an enemy and then carrying and concealing their body, all in one action. Plotting and executing a synchronised attack from all angles so that multiple enemies are taken out and disposed of to clear an area of threats in one fell swoop without raising an alarm is consistently satisfying to perform. Red Dead Repetition Desperados 3s automated assaults dont make life too easy, though, because pulling off such graceful cowboy-killing choreography still requires a lot of rehearsals. Since every guard is dutifully watching another guards back, youll almost always be caught in the act if you simply sneak up to stab a lookout from behind. That leads to heck of a lot of trial and error should you wish to make your way through each mission without alerting the guards and having them call in reinforcements. Despite being a game about cowboys, Desperados 3 is not so much about being quick on the draw as it is about being quick on the quicksave, and its self-aware of its reliance on this system to the point that an obnoxious quicksave reminder prompt appears in the middle of the screen should you forget to register your progress for longer than a minute. (Thankfully, this can be disabled.) My progress through each Desperados 3 mission demanded more frequent reloading than a single-shot rifle, as I continued to repeatedly botch each enemy encounter until I could come up with an effective plan to attack the guards at the right time, in the right order, using the most appropriate abilities of my team. Certainly, in the midst of Desperados 3s most challenging enemy outposts I felt like I was trapped in my own personal gunslinging Groundhog Day  but no matter how maddening the more difficult moments became, the sense of accomplishment I felt when I eventually overcame them was always immense. While it wasnt always clear on my first, second, or umpteenth attempt, there was always a solution to be found to even the most complex of enemy equations, and I never felt like I had to rely on blind luck to get through any of its toughest scenarios. The occasional presence of environmental hazards also provided some welcome assistance, and I relished the moments I was able to indulge in some Agent 47-style underhandedness by dropping a church bell on a target or rigging a buzzsaw blade in a sawmill to literally cut off a well-armed enemy at the knees. Many missions also introduce strategy-altering twists to keep things fresh, such as the map thats bisected by regular trains that forces you to time your kills on one side of the track when the sentries on the other side have their vision obscured by the passing train carriages. The last time I experienced Western epics with running times like these they were written and directed by Quentin Tarantino.But like a transcontinental train trip, Desperados 3s story missions themselves are something of a long haul. In fact, each of the final two of the 16 missions on offer took me well over three hours to complete; the last time I experienced Western epics with running times like these they were written and directed by Quentin Tarantino. This is, for the most part, due to the heavily recursive nature of its gameplay and the sheer scale of its maps, but I suspect that a small percentage of my restarts were due to quirks with the context-sensitive controls. I played Desperados 3 on Xbox One, which binds multiple actions to the A button, and that often had me jumping off a rooftop when I intended to enter a door or pick up a body. This was a relatively minor annoyance in the scheme of things (whats one more quick-reload, after all?) and by and large the controller-based setup works reliably enough, but certainly if I was dedicated enough to replay each mission to try and nail the optional speed run target times, I would only consider it with a mouse and keyboard on PC. Desperados 3 is an uncompromising tactical stealth game that tests your patience and rewards your willingness to experiment. Playing with a charming team of toy soldier-sized assassins in a series of deadly and detailed dioramas is tough and requires a lot of trial and error, but success is more rousing than a whiskey chaser. Dormant for 14 years, in Desperados 3 the series enjoys the most triumphant comeback in the Western genre since Clint Eastwood made Unforgiven.", "date": "June 12, 2020,"}