{"name": "Mortal Kombat 11 Aftermath", "name_review": "Mortal Kombat 11: Aftermath Review", "ref": "https://me.ign.com/en/mortal-kombat-11-aftermath/173501/review/mortal-kombat-11-aftermath-review", "text": "Hitting more than a year after launch, the big patch that coincided with the release of Mortal Kombat 11: Aftermath is exactly the kind of shot in the arm that MK11 needs to keep going strong in its second year. There are new stages, Friendships for every character, a plethora of big-time balance changes that shake up the meta, stage fatalities, quality of life improvements, and more. The best part is, all of that is free. You dont need the $40 Aftermath expansion to experience any of it. ...Which makes the value of the actual expansion itself a bit questionable. Dont get me wrong, what little content Aftermath offers is great. The three-hour campaign is a worthy epilogue to the main Mortal Kombat 11 story, and the trio of new characters  Fujin, Sheeva, and RoboCop  are all interesting in their own ways (though some are more interesting than others). But no matter how you slice it, theres just not much meat on Aftermaths bones when you compare it to most expansions. Aftermaths campaign picks up right where Mortal Kombat 11 leaves off and takes us on a predictable but enjoyable and action-packed side-story that inserts all of the non-guest DLC characters. Shang Tsung has one of the best shit-eating grins I've ever seen.Easily the best part of the whole Aftermath campaign is actor Cary Hiroyuki Tagawa as Shang Tsung, who  along with stealing souls  also steals every single scene that hes in. It should be obvious to any MK fan that Shang Tsung isnt to be trusted, but the way Tagawa and the writing plays with that expectation is delightful. Few characters are as smug and smarmy as Shang Tsung, and Tagawa is able to convey that masterfully not just with his voice, but also one of the best shit-eating grins Ive ever seen. Apart from Tagawas performance, everything else is business as usual for a NetherRealm story mode, with the exception of it being over in just about three hours or so. Theres tons of well-choreographed fight scenes, smart integration of gameplay that forces you to learn characters you might not otherwise play, and a couple of head-scratching moments of questionable logic as Shang Tsung, Nightwolf, and Fujin attempt to pull off a time-travel heist. Still, if youre able to turn your brain off and just enjoy the ride it takes you on, Aftermaths campaign is a good time for as long as it lasts. Aftermath's campaign is a good time for as long as it lasts.In addition to serving a mini-campaign, Aftermath also doubles as a mini-character pack. The three characters it adds to the roster are Fujin, the God of Wind (making his first appearance in a Mortal Kombat game since Mortal Kombat Armageddon 14 years ago); Sheeva, the four-armed Shokan queen (last playable in Mortal Kombat 9 in 2011); and RoboCop, whose voice and facial capture (when you do actually see his face,) is actually performed by the man himself, Peter Weller. RoboCop is no doubt the most prolific of the pack, but unfortunately, hes also the least interesting fighter. His basic moveset feels very plain, just about every special move he has feels like its been done before, and overall his playstyle just isnt one thats very fun to play. That said, hes an extremely effective zoner, with what is probably the best low projectile in MK11, so if you like characters that hang back and bombard your opponents with a constant barrage of bullets, bombs, and missiles, RoboCop was custom made for you. Unfortunately, RoboCop is the least interesting new fighter.Sheeva, on the other hand, is a blast. Shes an absolute bruiser with extremely satisfying combos that make me feel like Ive hit my opponent a thousand times by the time Im done. Shes a close-range powerhouse with a nice variety of playstyles in her three competitive variations. Her first variation gives her the ability to alter the landing spot of her iconic teleport stomp for some risky mind games; the second focuses almost entirely on combo damage; and the third is a mixup machine with overheads, lows, and command grabs. In stark contrast to RoboCop, virtually everything that Fujin does is completely unique to him, which makes him a very strange and exciting, if slightly unwieldy, character. Nothing about him is conventional, from his ability to run on air, to his weird launching tornado that requires you to actually manually direct it, to his unique slide that can be used to slip under projectiles and either start a combo or hit with an extremely satisfying krushing blow. Its kind of a bummer that currently the only way to get any of them is to buy the $40 Aftermath package, whereas all of the other DLC characters are available for $6 a piece. Hopefully somewhere down the line, NetherRealm will offer the option to buy these characters a la carte, or at the very least as a part of a new reasonably priced kombat pack seperate from the Aftermath campaign, because.Sheeva and Fujin especially are great additions to the roster. Even RoboCop, despite being a bit boring to play, is still fun to see in action. Aftermath feels like two disparate DLC packs fused together into one: A short but sweet single-player expansion with a scene-stealing Shang Tsung and half of a Kombat Pack worth of characters. Two of those three, Fujin and Sheeva, are excellent, distinctive fighters while RoboCop is just okay due to his derivative moveset. (He looks and sounds awesome, at least.) Alone and appropriately priced, these two pieces of DLC would be great; bundled together at a steep $40, though, Aftermath is a harder recommendation.", "date": "May 28, 2020,"}