{"name": "Phantasy Star Online 2", "name_review": "Phantasy Star Online 2 Review", "ref": "https://me.ign.com/en/phantasy-star-online-2/173208/review/phantasy-star-online-2-review", "text": "Eight years is a long time to wait for a game to finally get ported from Japan to America. Weve seen games get remastered for a whole new generation of console hardware in less time. But Segas Phantasy Star Online 2 is now officially out in North America on Xbox One as a free-to-play MMORPG. While its unique brand of anime-style flair and pulse-pounding gameplay are far from what youd expect in a typical online game, PSO2s amazing combat system, rewarding progression, and passionate community prove it was mostly worth the wait. In PSO2, you take on the role of a new ARKS (Artificial Relict to Keep Species) Operative. ARKS is an elite task force focused on exploring new planets and eliminating a dark and corruptive force known as the Falspawn. Thats honestly about all that you need to know or remember about this vague, jargon-packed, and emotionless story. Prior franchise knowledge is absolutely not required to understand it, but experience with the original PSO does help. (PSO2 is entirely unrelated to the single-player Sega Genesis JRPGs.) Despite the top-notch English voice cast, PSO2 just doesnt have an interesting story. Most of it is doled out by stiff characters that lack lip sync and feel like a waste of time. Both entering and leaving these story conversations requires sitting through lengthy loading screens. And to be clear, it really doesnt matter; this is absolutely not the kind of game you play for the story, so the developers have clearly just focused their attention elsewhere. It's just about plowing through enemies  and having a lot more fun as a result.And so in an unusual but much-appreciated move, PSO2 almost completely removes its exposition from the actual game. All of the missions you go on have a few bits of voice over sprinkled in but otherwise its just about plowing through enemies and having a lot more fun as a result. The conversations that move the story forward are self-contained as story quests from the main quest-giver NPC, which prevents them from slowing down the pace of missions. Rather than have you explore a sprawling open world of interconnected zones, PSO2 uses a lobby and instance system to congregate players and allow everyone to chat and team up. Once youve accepted a mission youll only see people in your party and a handful of others that may be doing the same mission. Its a very objective-focused format that keeps things moving quickly at all times, but it loses a lot of the discovery and sense of scale that usually goes hand-in-hand with MMOs. Supposedly, ARKS Operatives explore entire planets to eradicate the Falspawn, but you only see a handful of procedurally generated arenas each mission. The end result is a system that was probably much more feasible to run on an Xbox 360 eight years ago, but playing it today it feels like the shadow of what a modern MMO like this could accomplish. Quests come in a handful of flavors, such as Expeditions that usually set you off in a semi-open map to hunt down specific creatures, collect materials, or just beat the end boss. Then there are specific Client Orders to fulfill on quests, which are like side contracts that can reward huge amounts of XP when you take on several at a time, as well as the story conversation missions themselves. But the best type of quests in PSO2 are without a doubt the Urgent Quests. Urgent Quests are a blast and entirely worth planning your game time around.Urgent Quests are limited-time missions that pop up server-wide at predetermined times that are announced on the official website. During the time period the Urgent Quest is active, everyone on the server can join in and do that mission together in big multi-party groups. These are reminiscent of a raid with a dozen players working together, but its usually far more chaotic and fast-paced than most MMOs. Theyre a blast to do and entirely worth planning your game time around to fit into a schedule. PSO2 is all about the gameplay. There are tons of classes to pick from, such as the katana and bow-wielding Braver; the gravity-defying, boot-wearing, ass-kicking Bouncer; the big sword-wielding Hunter; the assault rifle-shooting Ranger, and many others. Even the magic classes have unique twists, such as the Summoner that hovers above the ground and commands pets with a magical baton. Combat feels like a mixture of Devil May Cry and Monster Hunter, or perhaps the Tales JRPG series, depending on the class you choose. My primary class is a Braver who uses either a katana for up-close and flashy combos or a powerful bow to rain down damage from afar. The skill tree you access back at the main ship lobby is full of passive ability bonuses and minor skills like dodging and parrying, but your actual combat abilities are found as random loot drops on missions in the form of discs. You can find new skills or more powerful versions of existing skills, as well as badge tokens to exchange for even more powerful items at specific vendors. Relying on the random loot gods to bless you with new abilities is a bit lame, but you can at least sell the ones you dont need or use them to upgrade existing skills. Overall its an addictive system that helps maintain excitement even when youre much higher level. You eventually get to pick a subclass, which is literally just any of the other classes you want. Youll gain all of the passives from the skill tree, but cant use any of their actual skills so you should pick something that complements your main class well. That being said, you can switch to and play any main class on any character just by talking to the skill trainer in the main lobby and switching over. Trying out other classes this way is useful, but I found myself preferring to make new characters to specialize in other classes rather than switching back and forth so I have a fresh stock of quests and Client Orders to take on as well as a separate visual identity and separate personal bank storage. Every class and race is oozing with charm and genuine personality, such as the CAST, which are humanoid robots that look like miniature Gundam units and really highlight the unique tone and visual identity of the PSO universe. The stellar character-creation system is really powerful too and lets you get into the details of each race as much as youd like. You can adjust points all across the face in supreme detail and actual clothing/outfit fashion quickly becomes a big focus if you care about that sort of stuff. The stellar character-creation system is really powerful.When youre not carving up Falspawn across the surface of weird, fantastical planets, you can spend your time at the Salon tweaking your visual style, changing accessories, or giving yourself a complete makeover. Many of PSO2s most coveted rewards are purely cosmetic and not meant for everybody to be able to get. Because PSO2 has had the better part of a decade to grow and iterate itself over the years, the version that North America has gotten falls somewhere between the launch version from 2012 and the current one that exists in Japan right now. A lot of the updates and systems are all present, but not all of the Episodes and content are here yet. Thats actually a good thing, because without gradually introducing all of that over a period of years, PSO2 would, at first, feel incredibly overwhelming for a new player. A lot of that content is playable solo. Many missions allow you to call on NPC allies for aid, which is a good way to practice content like difficult bosses or learning mechanics of enemies in a new region, and to take your time exploring if youd like. But just like any online-only game, PSO2 is heavily reliant on the activity level and sincerity of its community. If lobbies arent active Urgent Quests wont be playable and if people arent approachable and welcoming, itll put off new players, which are crucial for MMOs to remain lively. I get the feeling that most players on the North American version are new and never tried out the Japanese server, which fosters an endearing sense of shared discovery. Many players openly use voice chat on missions, as well as text chat even on Xbox, and once it hits PC the open communication should expand dramatically. Most of PSO2s many systems are explained well enough if youre paying attention, such as appraising gear, leveling up your Mag (a flying personal robot companion that grants passive stat boosts and a special attack) as well as various other nuances, but it requires a lot of reading up front and lots of cumbersome menus and its easy to miss them. At its best menu navigation is tedious, and at its worst, headache-inducing. Bringing up your inventory requires multiple button presses on an Xbox controller and something as specific as, lets say, looking up a friend to see if theyre online or checking how much time is left on your XP bonus is about three to four menus deep into one of the sub-panels and might as well be a lost cause. Thankfully, its not unusable, and the more time you spend with it the more second-nature flipping through everything becomes  but this is a textbook case of enjoying a game in spite of its clunkiness and not because of it. Microtransaction Reaction Every time you log in, Phantasy Star Online 2 tries to shove its litany of convoluted microtransactions down your throat. That sucks, but at least you can easily ignore it all without any pay-to-win scenarios. Between the cosmetic reward items, convenience items, Salon passes, Casino passes, FUN tickets, Scratch tickets, etc etc, its nearly impossible to keep everything in order. All that being said though, prices are fair and nothing feels necessary to progress or enjoy yourself. Its all cosmetics or convenience items that dont affect gameplay. One of the better items is the Gold Tier of the Mission Pass that works a lot like the Battle Pass from Fortnite, in which you unlock tiers of cosmetic and convenience rewards based on completing certain types of quests which all reset every few weeks for new seasons. You unlock the Gold Tier by using a Gold Ticket, which you can earn through in-game currency grinding or by dropping actual cash on the ticket specifically (roughly $8 in real money), or by upgrading to a Premium Subscription by purchasing a hefty Founders Pack for $60 or just the Premium subscription itself for around $13. In a nice and considerate touch, if you decide at the end of the season to upgrade to the Gold Tier version then youll retroactively unlock everything you would have unlocked already otherwise. Some of the seasonal outfits are really cool and hard to resist, like winged cybernetic android armor pieces and plenty of cute dresses and formal attire to mix things up, so I totally get it. Phantasy Star Online 2 is the kind of game you likely already know if youre interested in before you even play it. Between the ludicrous variety in classes, sheer number of things to do and see, and the slick, refined combat, there is a lot of meat left on these eight-year-old bones. It certainly shows its age in some convoluted ways and lacks an engaging story that can hold your interest, but overall it more than makes up for those shortcomings with some of the most exciting combat that stands out when compared to any action RPG released in recent years.", "date": "May 17, 2020,"}