{"name": "Legends of Runeterra", "name_review": "Legends of Runeterra Review", "ref": "https://me.ign.com/en/pc/172780/feature/legends-of-runeterra-review-in-progress", "text": "League of Legends has been around for more than 10 years now and, with Legends of Runeterra, Riot Games is hoping to capitalise on that heritage to propel its world and characters into a whole new genre: digital collectible card games (CCGs). The result is stylish, exciting, cleverly designed, and full of nods to League  whether thats through iconic Champions like Yasuo, Jinx, Ashe, Garen, and Teemo, or the many adorable Poros that populate the game. Importantly, while Legends of Runeterra is firmly rooted in an established world, it in no way excludes newcomers who may be picking it up because of its genre instead of its MOBA pedigree. Its very much like Blizzards Hearthstone in that way; I personally came to Hearthstone without any real knowledge of Warcraft, and six years later Im still playing. Legends of Runeterra is no doubt hoping to also bottle that lightning. That said, when Hearthstone burst onto the scene, it upended the gameplay of other collectible card games like Magic: The Gathering by being more straightforward and thus more accessible. Legends of Runeterra, on the other hand, sits somewhere in the middle, with some mechanics that streamline gameplay and others that ambitiously add layers of depth and complexity other games havent attempted. The overall goal of a match, however, is much the same; each player brings a deck of 40 pre-selected cards and faces off against an opponent, to the death. Initiative is passed back and forth, allowing each person to play units to the board, cast spells, and choose how to attack or defend. The match is won or lost when one combatant reduces the health of their opponents Nexus from 20 down to zero. Like Hearthstone, your mana reserve  which dictates the cards youre able to play  increases by one each round, as opposed to using a Land-style system similar to Magic. Unlike Hearthstone, however  and like Magic  youre able to choose how your units will block enemy attackers, creating an entirely different style of gameplay that sits between the two. The ability to respond immediately is foundational in Legends of Runeterra; its gameplay is intended to be like a conversation between the players, full of exchanges and interjections, as opposed to a debate of dueling speeches. Control can go back and forth many times within a single round as each player gets the chance to counter their opponents actions. The ability to respond is foundational in Legends of Runeterra; its gameplay is intended to be like a conversation between the players. To give you an idea of how this works in practice, lets say my opponent plays a unit late in a match. Doing that takes up an action and passes control over to me. I decide I want to kill it, so I target it with a spell that deals just enough damage to be lethal. That spell, however, isnt a Burst spell, so doesnt instantly cast. Instead, control goes back to my opponent and offers a chance to respond. He or she may then play a Burst spell to instantly buff the units health out of mortal range. My spell still doesnt cast, though; I then have another opportunity to cast an additional spell to increase my damage output and take out the unit. When both players have run out of options or passed, the spell (or spells) finally casts and the results become clear. This action-and-reaction gameplay opens up a lot of strategy that other games in the genre dont have. I could have gambled, for instance, by not lining up the spell initially and simply passed the turn back, in the hope that my opponent might spend enough mana doing something else that I could then cast my spell later, preventing them from being able to answer it. Of course, once I pass, my opponent could also pass, ending the round entirely before I get a chance to do anything. Attacking with units adds another layer to all this. Between each round, an attack token is passed from one player to the other. As the name suggests, whoever has this is able to initiate an attack and can do so at any point during a round. If a round starts and I have the attack token, I can choose to open attack, or start my turn by attacking. I might do this if I have a full back row (the area between my hand and the battlefield, which is where units go when played) that could trade favourably with the units my opponent has. Once I choose which units are going to attack, my opponent is only able to respond by choosing where  or if  the units that are already in their back row will be positioned to block, and/or by responding with Burst or Fast spells. Again, this is all about predicting what my opponent might do. If I choose to play a follower instead of open attacking my opponent can do the same, potentially putting down a strong blocker that ruins my attack, or he or she could simply cast a Slow spell that can clear my board. The fact that you can attack with a unit on the same turn you play it  provided you have an attack token  really helps make Legends of Runeterra feel tactically distinct from its peers. By ditching the concept of summoning sickness, units have a very dynamic feel  often functioning a lot like spells on your attack turns. That gives matches an interesting rhythm where the evaluation of what to play on turns with an attack token are really different to turns when youre defending.The fact that you can attack with a unit the turn you play it really helps make Legends of Runeterra feel tactically distinct. A simple example of this would be units with the Scout keyword. Once each attacking round, a unit with Scout can attack on its own (or alongside other Scout units) without using up your attack token. Their value, then, is largely in their ability to let you attack twice, so theyre not units you want to play at the start of your opponents attack turn, when they may be forced to block and be killed. Playing them after your opponent has attacked and is out of resources, however, makes total sense, as you could then open attack at the start of the next round, preventing your opponent from playing any more units to the board first, and still leaving you with the ability to attack again after playing more units or spending mana throughout the round. Its genuinely compelling trying to work out what the optimal way to play each round might be. Your strategy typically extends across multiple rounds, of course, as you set up for certain combos or clears  and in another clever twist that gives you more flexibility, you can even bank mana. Yes, up to three unspent mana units can be saved from one round into the next as spell mana. As youd expect, this mana can only be spent on spells, and means that you can do things like pass on turns one and two, then play a three-cost unit on turn three and still have three mana leftover to spend on spells. Its a clever system, as floating mana can become a strategic decision rather than a missed opportunity. Legends of Runeterra really is designed to give you ample opportunity to outplay your opponents. The fact that initiative is passed back and forth allows you to bluff and bait opponents into overextending, and really rewards those who know how to get the most out of their resources and anticipate what their opponent might do with theirs. Buffs, in particular, typically only last the round theyre played, so working out the counters your opponent could have when using a buff (or committing additional resources in general) is key. Importantly, while actions go back and forth repeatedly, Legends of Runeterras gameplay still feels remarkably snappy. Part of this is because players have a short duration to make any one decision and part of it is because your turn will simply pass automatically if you have no available options. (This can be turned off if youre worried the system is giving your opponent information about whats in your hand.) Its also worth pointing out that Legends of Runeterra has only minimal randomness in its card designs compared to a game like Hearthstone. Theres merit in both approaches, of course, as randomness can be really fun when implemented well, and can even help you come back in heavily unfavoured match-ups, but at the same time theres something to be said for feeling that you can showcase your knowledge in a contest where the rules are largely fixed. If youre facing off against a well-known meta deck in Legends of Runeterra, for instance, you have a very good idea what your opponents capabilities are, and those wont change to anywhere near the extent they can in Hearthstone. This also means that theres value in playing something off-meta in this game. An opponent used to facing the same lists may have a hard time making reads or playing around cards if he or she has little idea whats in your deck. Decked out Legends of Runeterra gives players a pretty incredible suite of tools to build decks with. The exciting idea underpinning deckbuilding is that any card can be paired with any other card. To make that possible, the card pool is divided up into regions based on the geography of Runeterra, with players able to combine any two regions together to make a deck. Each region has a very specific flavour in terms of both design and aesthetic, and as youd expect from a League of Legends game, each has a set of Champions that represent it. Noxus, for instance, is an overtly aggressive region. Its cards are all about doing and capitalising on damage and much of the art is obsessed with war or arena-based combat. Noxian Champions include Draven, Katarina and Darius. Ionia, on the other hand, has units that prefer to strike from the shadows, stunning opponents or utilising Elusive, which means they can only be blocked by other Elusive units. Ionian fighters are ninjas, samurai and wielders of mystical power, and Ionian Champions include Lee Sin, Yasuo and Zed. I absolutely love the flavour of each of the seven regions currently in Legends of Runeterra, and the interplay of mechanics, keywords, and Champions opens up a vast array of potential strategies. You might want to combine the control tools of the Shadow Isles with Bilgewaters ability to summon spell damage boosting Powder Kegs to try and outlast opponents. Or you might be excited about the idea of a deck that utilises a combination of Champions with spell synergy, such as Karma (who generates spells) and Ezreal (who benefits from playing spells), or Heimerdinger (who generates zero cost units by playing spells) and Vi (who gains attack power whenever you play a card). Each region currently has five Champions and they really do stand above normal units. You can include up to three copies of a Champion in your 40-card deck (with six Champion cards in total), but unlike other cards, Champions can level up mid-match. Meeting this condition is different for each, and can be anything from attacking a certain number of times or seeing a certain number of units die through to emptying your hand or having 15 cards or less left in your deck. Theres a stack of variety. Tryndamere levels up if hes going to die, for instance. When a Champion levels up it typically gets a small stat increase, but it often gains entirely new abilities too. Ezreal, for instance, has to target enemy units with spells and abilities eight or more times to level up, and once that happens every spell he casts also deals two damage to the enemy Nexus. He turns into a win condition, in other words, so if you can ramp him up you can burst opponents down. Champions also behave differently in that theyre unique entities when it comes to the board. If you have two copies of Ezreal in hand, for instance, then play one to your backrow, the other Ezreal transforms into Ezreals Mystic Shot, an alternate version of a collectible spell from his region. Each Champion has a spell associated with them, and these typically help progress them towards leveling up, or at least tie in thematically. Playing the spell then shuffles a copy of the Champion back into your deck. And if you choose not to use the spell, and the Champion in play is killed, the spell then transforms back into the Champion card and can be played as such. From a lore and worldbuilding perspective, the idea that each Champion is a unique fighter underlines their status, and it has also allowed the designers to run with some pretty powerful designs, as they know their effects cant (easily) be stacked. Vault breakers When it comes to building your collection, Legends of Runeterra has a robust progression and reward structure in place. Playing games and completing daily quests earns you XP, which is then funneled into two rewards systems  a vault that unlocks once a week, and a region-based unlock road. Want cards from Freljord? Choose that region and youll steadily unlock rewards that will help flesh out that part of your collection. Legends of Runeterra has no traditional card packs, so the rewards youll get are cards, an in-game currency called shards, and Wildcards, which can be spent on any card of a corresponding rarity. So yes, if you get a Champion Wildcard you can simply swap it for one copy of the Champion that you want. Shards can also be spent directly on cards. The rewards are pretty generous, but if you want to build your collection quickly without spending, consistency is key. Legends of Runeterra gives players bonus XP for their first three wins each day, so playing daily is important to maximise how quickly you get down each region road. And if you want to speed things along, you can spend real-world money on coins and simply buy the specific cards you want.Legends of Runeterra puts a definitive price on how much cards cost. The whole system makes for a refreshing change from most games in this genre, although newcomers may find it hard to decide which region road to activate and how to spend their Wildcards initially. After all, if youre just learning the basic mechanics, how can you know what youre going to want to play until youve truly got a feel for all the different archetypes and their strengths and weaknesses? My approach when I had a small collection was to spend a small amount of money so that I could build a cheap but competitive deck that only had three Champion cards in it. I then used that deck to learn the ropes and earn XP to expand my collection further. Playing every day, the rewards flew thick and fast, but I still wanted to be able to hop between regions and decks more often, so eventually I spent more. Microtransaction Reaction Most of the CCGs Ive played over the years require players to open a lot of card packs to build a decent collection, and even then youre not guaranteed to get what you want. Instead, you open your packs and hope for the best, then trade in your duplicates and craft the cards you want. Legends of Runeterra dispenses with card packs altogether and lets you simply buy the cards you want. Its hard to overstate how big a change this is, as it puts a definitive price on how much cards cost. You can actually work out how much you need to spend to buy the cards you want, and thus decide if you think its good value. Ive been happy with my purchases so far, but importantly, I also feel like my collection is growing at a more than decent rate through the in-game rewards systems. Of modes and men Ive spent most of my time in Legends of Runeterra playing ranked mode, in which you work your way from Iron IV up through to Diamond I, and then on to Masters. Its a familiar and entirely reasonable system, and the current season will last for around two months, which gives people a good amount of time to climb. Theres also a normal PVP option for those that are learning a deck and arent ready for ladder, as well as the option to tackle a series of challenges or play practice games against AI. The other main mode is Expeditions, in which you draft a deck of cards then try and win seven games. Its archetype-based drafting mechanics are pretty interesting, presenting you with sets of cards from defined buckets, and then changing what youre offered as the draft progresses based on your choices. To give you an idea, one archetype you might get offered from is Terrors From the Deep, which spans Bilgewater and Shadow Isles and is about reducing your deck to 15 cards or less to boost units with the Deep keyword by +3/+3. Naturally, the cards in the archetype bucket include Sea Monsters with Deep, ways to reduce your deck size, and two Champions  Nautilus and Maokai  who fit the theme perfectly. Not all archetypes are this deliberately synergistic, so theres a lot of room to go for your own homebrewed strategy. Sometimes you might wind up with a single region deck, and other times you might have cards from three regions. Overall, though, the archetype system means the variance between the best decks and the worst decks isnt super large, so youll generally stand a chance in each match, particularly if youve played enough to understand how to draft effectively. Youre able to add to and refine your deck as you progress too, but lose two games in a row and your run is over. Thankfully, each expedition is comprised of two attempts, or trials, with the prize based on your best run. Expeditions cost 2000 shards or 200 coins to compete in, which is two thirds the purchase price of a Champion. The rewards if you do well make this worthwhile, but Id definitely recommend waiting until youre very comfortable with Legends of Runeterra in general before spending in-game currency on an expedition. That said, after youve done three expeditions in a week, any future runs are free. You dont get rewards beyond the expected XP for completing games, but its a good way to get practice in. Full disclosure Legends of Runeterra breaks new ground with its interface and presentation too. Key information is always at your fingertips: you can quickly scroll through the cards that have been played, for instance, or bring up the Champions in your opponents deck. I also love that if you know what a card in your opponents hand is, it will remain face up. While Id have liked to know how many cards my opponent mulliganed at the start of each match, Im rarely in the dark about anything else. If I line up a sequence of spells or attacks and am unsure how it will resolve, I can hover over the Oracles Eye, to see what will happen, assuming nothing changes. I imagine the top players would prefer that this feature didnt exist, as a deep understanding of the game systems and the ability to do maths on the fly helps give them an edge, but for someone like myself its a great option for quickly double-checking what you thinks going to happen, and is also no substitute for understanding the core mechanics. If nothing changes, my spell plus unit will kill the opposing Braum. My favourite part of the interface, however, is being able to see every card thats associated with a card youre interested in. Say my opponent plays Heimerdinger, but I want to check how he actually works; I can right-click on him and bring up an overlay showing his base card, his leveled-up card, his spell card, and every card hes able to create. Each keyword or term has a pop-up explanation, too. Thats great design. From the card overlay you can also click through to the full widescreen art for each and every card. Its all gorgeous, and really helps flesh out the world: the people, creatures, landscapes, cultures, and tone of each region. The impressive amount of in-match VO doubles down on this, giving a sense of the relationships between characters. Legends of Runeterras presentation is just so polished, whether its the smoky trails of spells waiting to fire, or the epic full screen level up animations for each Champion. And a range of cosmetics  pets, backdrops and emotes  let you customise your half of the board. The mobile client retains all of this, and in terms of gameplay, interface and presentation is essentially the same as the PC version, just with less screen real estate to work with. Legends of Runeterra was designed with both platforms in mind, and you can tell. Legends of Runeterra is a whole new breed of CCG. While it builds on the foundations of those that have come before it, it has discarded many of the genres conventions to create deep and dynamic conversational gameplay. Along with its incredibly polished look and feel, Legends of Runeterra represents a new high-watermark for the digital card game genre.", "date": "May 14, 2020,"}