{"name": "Vampire Survivors 1.0", "name_review": "Vampire Survivors 1.0 Review", "ref": "https://me.ign.com/en/vampire-survivors-10/203179/review/vampire-survivors-10-review", "text": "Sometimes the simplest, silliest games sink their hooks into me and dont let go even while bigger, flashier options cry out for my attention  and then they reveal themselves to be not quite so simple after all, exposing layer upon layer of challenges, secrets, and even more silliness. That was what happened with Vampire Survivors, which despite looking very much like hundreds of other tiny pixel-art games on Steam that come and go every day, enthralled me and countless others nearly a year ago when it came out in early access and has kept me coming back ever since. Whats novel about it is that its basically a twin-stick shooter that does away with one of said sticks and all other buttons, leaving you to worry exclusively about positioning yourself while it takes care of firing your ever-escalating collection of weapons at the thousands of increasingly spongy enemies that flood the screen. Its a clever idea thats stayed entertaining infinitely longer than I expected it to, and even when it does descend into routine and tedium I can feel its pull compelling me to crank up another challenge mode and see how long I can last again. ASUS Dual NVIDIA GeForce RTX 3060 V2 OC Edition 12GB GDDR6 . . 1,630.00 View on Amazon  Theres no sugarcoating it: Vampire Survivors sure doesnt look like much. The barely animated pixelated 2D character sprites seem torn out of a generic and long-forgotten fantasy game from the early 90s, with the most interesting part being that some of them do have a nice disintegration effect as they die. Its as simple as it can be while managing to stay as readable as it needs to be so that you can mostly tell whats going on during the utter chaos thats about to ensue. It cannot be understated: if you survive long enough, your screen will be flooded with enough enemies and psychedelic weapon effects that its borderline impossible to tell whats going on. But living on that border is the thrill. The constant and desperate struggle is to keep your characters damage output one step ahead of the rising tide of the enemy flood, which increases in intensity based on the ticking clock that introduces greater threats every minute. If you can make it to the end of a typical 30-minute run that goes to extremes too ridiculous to describe here. Of course, if you dont kill bad guys quickly enough youll be overwhelmed and killed, but if you keep up a rapid pace of killing enemies and gathering the XP gems they drop youll get to level up and pick from a random selection of three or four new weapons and passive abilities until youve filled the available slots. The more you unlock, the more it becomes a game of picking the best options from the hand youre dealt; almost every weapon has a passive ability that it pairs with, allowing it to evolve into a more powerful version (the basic Magic Wand, for instance, pairs with the rate-of-fire increasing Empty Tome to eliminate cooldown entirely) so you have to pick carefully to optimize your build. Its not as full of surprises as the combos in The Binding of Isaac, but theres plenty to experiment with. The enthralling joy of Vampire Survivors comes from getting far enough ahead of the curve. The enthralling joy of Vampire Survivors comes from getting far enough ahead of the curve that your flailing auto-attacks kill everything in one hit. However, theres a long way to go before you reach that point. Your first short-lived runs will take place in the Mad Forest map, which could barely be more rudimentary. Its an endless stretch of green grass with nothing but a few small clumps of trees and an occasional cul de sac that only a crazy person would ever trap themselves inside. Like nearly all of the maps itll endlessly cycle forever if you head out in one direction, like a Hanna-Barbera cartoon reusing the same background over and over again. Soon youll unlock other maps by reaching milestones that first seem unattainable but gradually come within reach, and they get slightly more interesting by introducing some new obstacles. The Inlaid Library, for instance, is an unending corridor where you can move right or left forever but not up or down, while the Gallo Tower lets you go up or down forever but not left or right. The Dairy Plant is like an industrialized Mad Forest but with more stuff to bump into if youre not paying attention. Eventually you can unlock a boss rush map where youre constrained to a small arena. You get the idea: theyre not all that elaborate, and most of the gameplay distinctions between them come down to bonuses to enemy strength or other modifiers. It can be hard to wrap your head around the fact that most of these really do go on forever, which can get annoying when youre trying to keep track of where you left a health pickup or screen-clearing cross you didnt need at the time, or a treasure chest that dropped when you werent looking. Fortunately theres a map you can pause and call up at any time to get an idea of what direction you should be heading to scoop them up. Enemies are also extremely basic in their behaviors: whether theyre the bats you see at the beginning of a run or the mummies, witches, werewolves, and dozens of other monster types that arrive later, about 99% of them just move toward you until they die, with the only distinguishing factor being how fast they move, how much damage they deal if they catch you, and how much damage they absorb before they die. Theyre effectively just heat-seeking missiles with hitpoints, and almost none of them shoot their own projectiles at you  which is good because there are already so many on the screen at once that it would probably become overwhelming quickly. Even the bosses, including the egg-dropping wraiths that chase you after you pick up some special items, are almost all nothing more than enlarged versions of normal enemies with massively expanded pools of hitpoints  theres barely a special ability among them. That last 1%, though, is more than welcome when it shows up. Youll see occasional swarms of fast-moving bats or ghosts that cut across the screen (they die quick, but if the map is crowded they can push sturdier bad guys into you), sometimes youll be encircled by extremely durable plants that slowly close in on you, giant bone dragons will stretch the length of the screen, and once in a while exploding enemies will charge you. Certain stages even gradually fill with water unless you can kill the blue reaper thats summoning it, and theyre especially hard to hit unless you have the right weapons. Vampire Survivors could use a lot more of these enemies with distinctive behaviors, because it can become pretty monotonous to stomp all over more of the same for most of each run. When you first start out, Vampire Survivors is extremely tough. I rarely made it past the 10-minute mark in my early runs, and it took quite a few attempts before I made it all the way to being killed by Death himself at 30 minutes, which is where most runs end by design. However, you quickly start unlocking a healthy collection of dozens of weapons and passive abilities, from simple knives that shoot in the direction youre facing to garlic that projects a damaging aura around you to lightning that strikes random enemies, or even a pair of birds that circle you in opposite directions and launch artillery bombardments in a rotating zone (as birds are known to do). Putting together builds of abilities that compliment each other is where a massive amount of replayability and enjoyment comes from, and seeing so much damage pour out of my character is a satisfying reward for staying alive long enough to get to the point where I could literally walk away from the controls and still make it to the end. When you're ahead it's like being Pac-Man high on power pellets as he's chomping on ghosts. When youre ahead it becomes very much like the sensation of being Pac-Man high on power pellets as hes chomping on ghosts, but without any of those pesky walls, and here the ghosts dont have the good sense to flee in terror. That can go on too long, which turns the whole thing into a bore as you tap your foot waiting til the end. If you fall behind the curve, on the other hand, it turns into a bullet hell-style game of dodging and weaving, desperately hoping for a screen-clearing power-up to drop to give you even a few seconds of relief  and even then the odds are you wont be able to catch up before your health is drained away. A big opportunity to leap forward in power comes from killing bosses, which rewards you with a treasure chest that can contain one, three, or even five random upgrades for abilities youve already acquired. (This is also the only opportunity to unlock evolved versions of your weapons.) Since the levels continue on for eternity, the natural urge is to enter a holding pattern where you stay in one area and collect all of the XP from every enemy youve killed, but then you wouldnt be farming the pickups that award you cash (the persistent progression currency) and other helpful drops like health, flamethrowers, and magnets that draw in every XP gem you left uncollected on the map. That creates some incentive to move, but I soon realized that moving in a wide circle gave pickups the time they needed to spawn while also coming back to nab anything Id missed or saved for later. The only thing that breaks you out of this is that most maps have passive upgrades stashed far from your starting point that, if you wait until your existing slots are full before picking them up, can make you even more powerful, and that adds a whole other layer of strategy for how to play each map. As you go youll inevitably unlock at least a big chunk of the dozens of characters (maybe even some secret ones) who each give you different starting weapons and slight bonuses to stats. Just to name a few, theres Arca Ladonna, who starts with a randomly firing fireball attack and whose weapon cooldown times reduce as she levels up, or my favorite, Donmario, who moves slowly but starts with Bibles orbiting him and gets bonuses to projectile duration and speed (you can always pick up the Wings upgrade to make up for the speed deficit). Properly upgraded, he can turn into an almost literal buzz saw that cuts through crowds of enemies with ease. Nearly all of the characters starting bonuses are things you can pick up during a round, but these can stack together to create some crazy powerful builds. This is a game that challenges you to break its balancing and seems to celebrate when you do. Thats where Vampire Survivors longevity comes from: even when I completely break it with a build that I literally have to quit out of when I play in the unlockable unlimited mode because nothing can ever kill me, Im still tempted to chase after its many, many achievements. Get to level X with Y character; make it to minute 31 on N map. Theres always a hand it manages to tie behind your back or another handicap youre able to give yourself to make it seem insurmountable again. And then there are the many, many secrets that you could spend 1,000 hours on and never find without consulting a guide, and which you must even then try to optimize for. Its done an excellent job of raising the bar higher and higher every time I think Id hit the pinnacle. With its dead-simple graphics and basic map and enemy design, Vampire Survivors seems like it has no business sticking with me as much as it does. And yet, I felt compelled to put over a hundred hours into experimenting with its many weapon and ability upgrade combinations, starting round after round trying to reach the end and unlock all of its characters, evolve all of its weapons, and unlock all of its secrets. The bewitching spell of its appeal can be broken by the duller stretches between when you find a great build or unlock a challenging new mode, but it probably wont be long until you find a new way to challenge yourself to survive just a few seconds longer.", "date": "Nov. 12, 2022,"}