{"name": "Them's Fightin' Herds", "name_review": "Them's Fightin' Herds Review", "ref": "https://me.ign.com/en/thems-fightin-herds/172911/review/thems-fightin-herds-review", "text": "Great things often take unexpected forms. Weve already seen surprising combinations like an excellent turn-based strategy game starring Mario and Rabbids, or some of the most beloved action-adventure games of all time being Batman games  and now one of the best fighting games of 2020 is somehow kind of based on (but just legally distinct enough from) My Little Pony: Friendship is Magic. What a world we live in. Disclosure: Humble Bundle (which is owned by Ziff Davis, the parent company of IGN) is either the publisher or financier of this game and may receive a commission or fee in connection with sales. Humble Bundle and IGN operate completely independently, and no special consideration is given to Humble Bundle-published or financed games for coverage or scoring. Thems Fightin Herds isnt just good in the relative context of its origins as a fangame for a childrens TV show, its exceptional by any measure. It checks almost every major box on a fighting game fans checklist: it looks fantastic, theres a great story mode, deep mechanics, GGPO rollback netcode, and an in-depth training mode. Its biggest sin is its small roster of only six playable characters, but the ways in which developer Mane 6 has managed to do so much with so little is exemplary in a genre where other games have done much less with much more. Do You Believe in Magic? TFH is a four-button fighter, much like Dragon Ball FighterZ and BlazBlue, with light, medium, heavy, and magic attacks. Each character is wildly different, from a sheep that summons dogs to do her bidding, to an Alpaca that loves hugs and throws broccoli and apples. Whats nice is that theres still a bit of universality between them thanks to how the fighting system works. Launchers, anti-airs, sweeps, and basic combos have the same inputs across all characters, with simple combo logic of lights leading into mediums, mediums into heavies, and heavies into launchers or special moves. That makes it fairly easy to jump in and have fun as a beginner with any character. The magic system  and everything around it  is where things get really interesting and varied. Velvet, for example, has the largest magic meter of the roster, but starts every round with no magic and has to simply wait for the meter to slowly fill as time goes on. On the flip side of that, Paprika starts the match with a full magic meter and can spend it to throw out various projectiles and items, but once the meter is empty she has no way of restoring it outside of hoping her opponent eats the items she throws out. What I love about the magic system is how well it complements the standard moveset of each character and further defines their archetype. Tianhuos magic gives her the ability to use directional aerial dashes and flight, which pairs brilliantly with her unparalleled aerial offense; Arizonas close-ranged, ground-based offense is complemented by her magic lasso and armored magic attacks that allow her to close the distance on her foe; and Oleanders already oppressive zoning game is made even scarier when shes able to keep enemies away and read her book to gain access to more powerful spells. Its all really well thought out and those nuances make every character fun to play in their own way. There's no getting around the fact that there are just six fighters. As diverse and as interesting as the six fighters are, though, theres no getting around the fact that there are just six of them. That makes long sessions of playing online kind of tiresome because you find yourself playing against the same characters over and over again, as there are some clear favorites. There are currently plans for at least one DLC character, a goat that was promised as an IndieGogo stretch goal, but beyond that its up in the air. The World of Foenum Apart from the regular versus mode, Thems Fightin Herds has an impressive story mode as well. Theres currently only one chapter, but its already shaping up to be one of the most interesting and refreshingly unique takes on a fighting game campaign in quite some time. It takes the form of a sprite-based retro-styled RPG that tells the story of the world of Foenum, a land ruled by various tribes of hoofed mammals, whose peace is suddenly threatened by the reappearance of shadowy predators. And so, each of the six tribes selects a champion and charges them with the task of finding a special key that will lock the predators away. This first chapter puts you into the amusing hooves of Arizona, the champeen of the prairie, as she begins her journey to learn more about the key and the world of Foenum as a whole, but the overarching story is less entertaining than the actual dialogue between Arizona and the various other characters she comes across. Arizona is a likable and adorably naive country cow who suddenly finds herself having to interact with stuck-up deer in a big city who want nothing to do with her, and the result is some genuinely funny laugh-out-loud moments and a charming fish-out-of-water dynamic. Smartly, Mane 6 created a small handful of non-playable enemies for you to fight that take up the bulk of the actual combat in this story mode. Whats great is that while these fights are definitely easier than standard CPU battles against the actual roster (where the AI is pretty tough, depending on the difficulty setting), theyre not exactly complete pushovers. Theyre one-dimensional, sure, but that also serves to teach you how to deal with certain things that translate over to competitive modes. Wolves mainly attack by using jump-ins, allowing you to practice anti-air combos against them; Snakes will often try to zone you out, teaching you how to deal with projectiles; and Bears are slow and big with armored special moves, making them perfect for lasso combos. When you do fight a member of the main cast its treated like an appropriately special boss fight. These are challenging multi-phased battles against powered-up versions of a character with special story mode-specific moves that would be unbalanced in actual competitive play. For example, once you get to the final phase of the Velvet fight she will constantly use her tornado super to push you away while also hurling a variety of projectiles that must be either ducked under, jumped over, or blocked in order for you to continue to push forward and land an attack. The amount of time it takes to beat Arizonas chapter will depend entirely on your own skill, the difficulty you play on, and how much you want to search for treasure chests containing fun little accessories for your avatar. My playthrough took about four or five hours, but I played on the equivalent of hard mode, a decision I later regretted as I got absolutely torn up by just about every boss. Id guess that a standard playthrough on a comfortable difficulty would take about two or three hours. Importantly, while only Arizonas chapter is available at launch, the chapters for the five other characters are planned to be released down the road as free updates, which is great because this story mode is off to a very strong start. Below the Pelt Outside of story mode, everything else in Thems Fightin Herds is about what youd expect of a traditional 2D fighting game, with the exception of its unique approach to online lobbies. It recycles most of the character sprites from the story mode and has players wander around surprisingly large lobbies where they can challenge others to matches. Thats not the only reason to explore, though: there are occasional treasure chests that spawn that contain salt, a currency used to purchase accessories to customize your avatar. Even better, if one player tries to claim a chest and another player contests it, theyll fight it out, with the winner claiming the chest for themselves. Its a neat idea that would probably be better if the lobbies were more populated, but unfortunately, the current player base of Thems Fightin Herds is such that theres typically one lobby thats almost always full with 20-25 players and then a few others with just single digit player counts. Without a healthy population, the lobbies feel too big and depressingly empty. Then theres also the Salt Mines, which are crazy PvE (and eventually PvP) dungeons in which you delve into an underground cave to mine as much salt as you can before time runs out, all while dealing with the same AI-controlled predators from the story mode. Once the time expires, the person with the most salt will actually transform into a playable version of that modes bear enemy and be given a chance to hunt down the remaining players. Its a really cool idea, but the likelihood of finding a big enough lobby with willing people to participate right now is slim. Underlying every fight in Thems Fightin Herds is the GGPO rollback netcode, which is considered by many to be the gold standard, and sure enough, online play feels really good. Thats not to say that youll never experience lag, but rather that when you do experience it the match still feels entirely playable. Them's Fightin' Herds just feels extraordinarily polished. Beyond that, Thems Fightin Herds just feels extraordinarily polished. Its UI is super clean with excellent art, theres a wonderful tutorial that covers complex concepts in a way thats very easy to understand and with a great sense of humor, the soundtrack is excellent with some really cool dynamic variations on themes depending on which characters are fighting against each other and whos currently winning, and though its training mode could use some better organization, its still extremely deep and includes just about everything you could ask for. There are some very big ideas inside Thems Fightin Herds deceptively small package. Even incomplete, its story mode is already one of the most innovative Ive seen in a fighting game in ages, and its sprite-based online lobbies are interesting  though unfortunately lacking the player base to really make them shine. It also nails the important things, like great netcode, quick rematches, and tight combat with a cast of fun and remarkably diverse characters. Thems Fightin Herds biggest flaw is its brutally small roster with only six characters, and thats a big one, because eventually it does get tiring playing against the same characters over and over again. That said, anyone who passes it up based on its kiddy cartoon looks is missing out.", "date": "May 6, 2020, 3"}