{"name": "Hellblade", "name_review": "Hellblade: Senua's Sacrifice Review", "ref": "https://me.ign.com/en/hellblade/136151/review/hellblade-senuas-sacrifice-review", "text": "I spent the majority of my six-hour playthrough of Hellblade: Senuas Sacrifice grasping for a touchstone to understand the experience. It unfolds like a beautiful, dark, tense visual novel, placing the excellently raw, human performance of its main character front and center on her journey into the land of the Northmen. Her story is one of confusion, sadness, fear, and loss, and its punctuated by moments of beauty, and strength that has left a lasting impression on me. It follows the titular Senua, a celtic warrior, who embarks on a mission to the homeland of the Northmen in order to penetrate the depths of their version of hell, the mythological Norse land of the dead called Helheim. It's bound by threads of historical fiction, historical non-fiction, mythology, and metaphor all admirably weaved together to create a unique backdrop that's ripe for exploring the darker tones and themes Hellblade tackles. But as impressive as its story is, Ninja Theorys smart design reinforces the sensory nature of the harrowing tale through subtle and intuitive mechanics. Even before the game begins, you're prompted to play with headphones in order to capitalize on the binaural audio design (simulated three-dimensional sound). This is used to great effect as the voices that plague Senua are in a constant chatter, dancing around her head in creepy ways that feel as though you're never alone. Voices that plague Senua are in a constant chatter, dancing around her head in creepy ways that feel as though you're never alone.And in truth, you never really are alone in Hellblade, for better or worse. These voices speak directly to Senua, each other, and perhaps even to you. They impart advice, they argue about her actions, they tear her down and pick her up at the best and most inopportune times. This fact, coupled with the excellent original score, the never-faltering voice work, and the ambient sounds both real and imagined make for an audial experience that's as vivid and liberal as anything that happens before your eyes. Visually Hellblade is a gorgeous game to take in  sun-soaked rocky beaches, vividly distorted streaks of color and light, and deep darkness that strangles the screen, there's a variety of hues, saturation, and exposures that convey meaning in most areas. This variety is further improved when playing on the PS4 Pro, which makes use of an ~enhanced resolution~ or a smoother, more immersive 60 frames-per-second. And while Ninja Theory is no stranger to including full-motion video in the past (Enslaved's use of Andy Serkis comes to mind), Hellblade's use takes it to another degree by splicing in real footage of secondary characters' performances through a heavily distorted filter that creates impactful scenes between real and animated characters without feeling out of place. I was consistently, pleasantly surprised by the number of ways Ninja Theory was able to present these moments, all without breaking the immersion of the world and story. Its incredibly smart use of audio and visual distortion and trickery to convey the frightening effects of psychosis, hallucinations, and delusion, are married with the gameplay elements for an experience that rarely ever grapples over whether its a game or a story. Hellblade revolves around Senua's perception of her environment, drawing connections between her beliefs and the geometry of the world.For example, theres no HUD in Hellblade - yet that chorus of voices shout panicked advice at Senua in the heat of battle. ~Behind you!~ one of them screams seconds before an enemy stabs at Senua's back. Theres no combat tutorial either. Your first moments of do-or-die battle begin without warning. Theres no objective markers or mini map, which are only occasionally frustrating when backtracking to look for the collectible lorestones scattered throughout the world. Hellblade is a game that youre not supposed to trust, because what you see, or hear, or feel, is rarely truthful. And because of that there are moments of terrifying tension that gave me an amount of anxiety and panic thats borderline uncomfortable. For example, in one section I guided Senua through a pitch-black area filled with shapeless hair-raising creatures that would lunge out when she got too close. These moments evoke the vibes of a horror game that are sparse enough to be shocking when I haplessly wandered into them, but effective enough that I worried for Senua's safety with that ever-present nagging of permanent death. Yet most of Hellblade revolves around Senuas perception of her environment, drawing connections between her beliefs and the geometry of the world. Youll scour each area, lining up beams, or trees, so the shapes of the world around her take on significance and unlock the next door that blocks her progression. As new puzzle elements are slowly added  like fractured walkways and doors that require a precise viewing angle to be reassembled, or portals that force you to enter entirely different versions of the world  these puzzles take on new layers of depth, and meaning. These moments are profoundly rewarding when you uncover something new.And many of these moments are profoundly rewarding when you uncover something new  like a hidden path that can only been seen through a specific portal  because they're reinforced by the story that's made all this impossibility plausible. Surprisingly, combat in Hellblade is more of a palate cleanser than a core element. It punctuates the story with wave-based enemies that block progress until defeated, making use of Senua's light attack, heavy attack, parry, dodge, and charge. Though these moves do combine together to create a varied enough skill set when facing the same half-dozen enemy types, progression feels stunted since new abilities only slightly modify the core of the combat, rather than redefine it. The simple nature of the combat design struck me as obligatory for the sake of interactivity  giving you another way to interact with the world outside of perception  coupled with the fact a warrior should be defined by battle. But there were only a few fights where large groups of enemies were thrown at me that I ever felt threatened and it's only near the end of the journey when enemy numbers and difficulty spike unexpectedly that the combat depth eventually becomes more than the sum of its parts. And yet, like most of Hellblade, combat is still a tense experience knowing that dying too many times (in or out of combat) will cause your save to be deleted and youll be forced to start from the beginning. While that might sound draconian in execution, its tie-ins to the story are concrete, reinforcing a system where failure carries meaning rather than simply acting like a gimmick to artificially inflate difficulty. And though I don't think I ever got close to having my save data destroyed, every time I got close to dying carried much more weight and impact with this knowledge. Hellblade: Senua's Sacrifice is a masterclass of atmosphere, storytelling, and the marriage of mechanical and conceptual design. While there are moments that feel shoehorned in to remind us were playing a videogame, the care and attention Ninja Theory has clearly poured into Senua and her story has created something amazing. This is a game everyone should play, and Im thankful for the opportunity to have lived inside the mind of Senua, however briefly.", "date": "Aug. 8, 2017,"}