{"name": "Gears Tactics", "name_review": "Gears Tactics Review", "ref": "https://me.ign.com/en/gears-tactics/172679/review/gears-tactics-review", "text": "Given the life-or-death dependency on taking cover in the Gears (of War) games, I cant think of another long-running series better suited to sidestep from third-person shooter into XCOM-style turn-based tactics than this one. Gears Tactics is a spin-off with a more focused approach to the genre, ditching the larger strategy layer side of the XCOM formula in favor of pitched tactical battle after tactical battle. That comes at the cost of some replayability, but most of those fights are rewarding puzzles with fantastically polished graphical payoff. The story of Gears Tactics takes place 12 years before the original Gears of War  of course, when it comes to gleefully cutting alligator-looking dudes in half with chainsaw guns its very much business as usual. Through some impressively animated cutscenes we get to fill in a few gaps in the pre-Outsiders Diaz family history, though Kaits father, Gabriel, never really comes into his own as a memorable main character. He has his tortured past of having fallen from grace after leading an operation gone wrong and going into self-imposed exile in the COG motorpool, but being brought back for one last job doesnt really change his mind about anything  he was fed up with the COGs corrupt leadership before we meet him. Even the heated friction between grizzled old Gear Sid and the prickly engineer/sniper Mikayla never amounts to much. And despite some hints that he might attempt it, the villainous Ukkon never develops beyond one-dimensional evil. Still, the dialogue is written and acted well enough that it serves its purpose of establishing the signature Gears flavor and giving us a monster to hunt without getting in the way. Gabe leads a squad of up to four Gears into battle against a substantial lineup of recognizable Locust enemies (introduced at a steady clip throughout with a gruesome close-up and a couple of tactical tips) that range from basic grunts and exploding Tickers to buffing Kantuses and tricky Theron Guards. They all have distinctive and interesting abilities to counter, including some that automatically attack if you get too close (countering the insta-kill Lancer chainsaws) and some who explode in a cloud of debilitating poison gas on death to discourage executing them when theyre downed. The only ones that ever got on my nerves were the melee units  including those Ticker jerks  where I could never quite tell if they were in range of striking my troops or not. You may only ever have four troops at once, but they can feel like an army.The fundamentals of combat are about improving your lethality by flanking, using melee charges, tossing grenades, and other abilities, and its great. Where things really get interesting is when you start chaining together abilities from the five different classes that grant you additional action points, either for one character or your entire squad. That can turn them from generally effective fighters into spectacular killing machines that can mow down two or three times their number of enemies. Having a Vanguard soldier like Sid spend one of his three action points to charge into the midst of a group of Locust Hammerburst drones and skewer one on his Retro Lancers bayonet, only to recover that action point because of his passive Free Bayonet skill, then blast another one with his Rage Shot ability for extra damage to put them in the Gears-signature down-but-not-out state that allows him to perform an execution kill, which in turn grants his teammates an extra action to tear into the Locusts with four action points apiece instead of three, is a joy. You may only ever have four troops at once, but they can feel like an army. The directional Overwatch ability is also extremely useful  essential, really  for stopping enemy advances during their turn can be enormously powerful if you can cleverly predict enemies movements. The satisfying clink! when an enemy steps into your killzone and sets your plan into motion is one of my favorite sound effects in Gears Tactics. The Locusts think its handy, too: theyll almost compulsively use Overwatch to pin you in place rather than take a shot on their turn. Countering a web of overlapping Overwatch cones without taking a hit can be a tricky puzzle, and you have many abilities designed for doing exactly that. For instance, Disabling Shot comes standard with every soliders sidearm, which has high accuracy and a good chance to knock a grub off his guard. Grenades are handy for this, too  and there are class-specific abilities that are even more effective. One of Gears Tactics best ideas, though, is effectively turning downed enemies into powerups. Executing a downed enemy will grant an action point to every other squadmate, making it a tantalizing reward for risking the safety of one Gear to allow the others one more move. Theres a pretty good chance that reducing an enemys health bar to zero will put them into the downed state, which is actually a good incentive to not use instant/overkill options like chainsaws, bayonets, and grenades at every opportunity. Sliding into cover for a movement bonus is a great nod to classic Gears moves.Movement in general feels very fluid, which is both liberating and eventually a little tiresome. Theres no visible grid to constrain you as you move the cursor over the map, with markers on the projected path line to clearly indicate if youll spend one, two, or three movement units to get there. Theres even a movement-range bonus you can get for having your troops dash and slide into cover, which is a great nod to classic Gears moves and an extra incentive to stick to cover. Overall, though, it became a bit annoying after a while to have to mouse over so many potential destinations to see what I could reach and what I couldnt, since its not clear just by looking at the map. No matter where you move or what you do, Gears Tactics really does look spectacular  nearly up to par with Gears 5 itself. Character models are fantastically detailed and the ruined, mostly urban environments of the planet Sera are elaborate. Animations are top-notch as well; coming from XCOM 2, I was impressed to never see anybody appearing to fire in the wrong direction or hover in the air for a moment before moving. Virtually everything looks and sounds like youd expect a flashy Gears game to, including gory Lancer chainsaw kills that leave both chunks of Locust and blood splatter on the environment. Occasional cinematic camera shots zoom in on a wall with textures that dont bear scrutiny up close, but other than that Gears Tactics is polished to a thrilling shine. Whats more, its well optimized: I played on a PC with a Core-i7 7700K with a RTX 2080 and it ran all but flawlessly on ultra settings at 4K resolution. Some of that efficiency is likely because Gears Tactics isnt as ambitious as XCOM 2 when it comes to the structure of its maps. They dont appear to be procedurally generated, only specific pieces of rickety-looking cover are destructible, and there are no multi-floor structures where one unit could stand directly above another. And were only dealing with four squad members at a time rather than six  though its not exactly shy about throwing a dozen enemies at you at once! Gears Tactics goes 100% all-in on tactical battles.Your squads are made up of your choice of five available classes: Support, Vanguard, Sniper, Heavy, and Scout  though some slots are often taken up by mandatory hero characters. Each class has a fairly expansive skill tree with some very powerful, very distinctive abilities to unlock as a character levels up, and it does provide significant room for distinguishing one Sniper from another. (Though if you dont load up on the highly stackable Anchor abilities for your Heavies, which increases accuracy and damage with every shot and heals you as long as you dont move, youre blowing it!) Filling out the skill tree is one of the few things you do between missions, because as the name implies, Gears Tactics goes 100% all-in on tactical battles. There are virtually no management decisions to make beyond which soldier classes to recruit and shuffling gear around. Theres no R&D, no resources to collect or spend on new equipment, and no grand campaign map to conquer. Thats not really a weakness  whats not to like about one great tactical battle after another?  but now that my 35-ish-hour Experienced difficulty playthrough is over, the lack of a strategy layer definitely leaves it feeling less replayable than XCOM. Without thinking about what big choices Id make differently in another playthrough, Id be limited to trying different squad compositions and gear loadouts to emphasize different abilities. That has some appeal, certainly, but not nearly as much. Gears Tactics approach to progression means that your team never gets any new weapons, just new weapon mods that give you stat boosts and new passive abilities. A lot of those are extremely powerful and can absolutely change the way you play more than a slightly better shotgun would, and its great to see modifications like a fancy stock or barrel attachment have a visual effect on the gun model. Some of these are similar to XCOM 2s, like a scope that gives you better accuracy or a magazine that improves your ammo capacity, but then they start layering on new benefits like more damage at the cost of ammo capacity or better damage resistance or reduced grenade cooldowns. On their own theyre significant, but stacking together bonuses produces some amazing results. I put a bunch of critical chance and damage boosts on Sid to turn him into a close-range killing machine, and toward the end I put together a scout who could throw an amped-up frag grenade every single turn. Stacking together gear bonuses produces some amazing results.Gear is plentiful  youll get new items every mission, and more if you complete optional objectives or collect crates during missions. Managing that mountain of items becomes a bit tedious after a while, in part because you have to (or rather, you should) tweak weapons and armor often and also because the UI makes you drill down several steps to see what someone has equipped and what the alternatives are. Every soldier has four different gun parts, a sidearm, three armor pieces, and a grenade slot to individually check on if you havent used them in a little while and mightve snagged their gear for someone else in the meantime. Theres virtually no resource management at all on the battlefield, either. Ammo is unlimited  outside of ammo for power weapons that are dropped in the field  but costs an action point to replenish when youve exhausted your magazine (XCOMs system), and grenades are also unlimited but on a cooldown timer. Even health isnt a big concern, since there are no persistent wounds that last between missions, so youre free to use your tank-like troops to absorb as much damage as you like as long as you dont get them downed too many times. Permadeath is in play, but the presence of so many hero characters who must survive every mission theyre on makes it all but moot. Sure, you can lose a disposable soldier, but if Gabe or Sid or Mikayla gets their head caved in by a Locust thug thats the ball game and you have to restart the mission (or at least your last checkpoint). If youre playing on Iron Man mode thatd make them like kings on your chessboard who must be protected at all costs, but otherwise its pretty difficult to actually fail a mission and be forced to accept some casualties and move on unless you deliberately leave your heroes at home on a side mission where they arent required. If Gabe or Sid or Mikayla gets their head caved in by a Locust thug that's the ball game.If one of your non-hero crew gets dismembered, fear not: replacement troops are free (theyre limited in number but the pool is refreshed after every mission) and usually come at high enough level out of the box to take the sting right out of a death. And while you can change a characters name and customize their look, Im a little bummed theres no option to customize their faces so that I can accurately recreate my friends and coworkers as disposable Gears. And they really are disposable  I managed to lose a few over the course of my playthrough, but at the end there wasnt so much as a memorial recording the names of the fallen. That was kind of disappointing given the dramatic self-sacrifice a few of them had made. Gears Tactics three act-capping boss battles against enormous creatures are especially interesting because this is something the XCOM series has never attempted. They all basically boil down to keeping your troops out of the way of a giant monsters clearly telegraphed attacks while you whittle away its health and bat down its minions. That said, the spectacle of battling these beasts straight out of the shooters makes fights fun to take part in even if they get mechanically simple after you figure out the patterns. Between story missions are a round or two of semi-randomized missions that you have to complete two out of three, or three out of four of before proceeding to the next piece of storytelling. This is where Gears Tactics makes its biggest unforced error: it uses these to pad itself out significantly longer than it should. Dont get me wrong: side missions are generally good challenges and there are a respectable handful of types that range from rescuing soldiers in torture pods to holding out against waves of Locusts and gathering loot boxes ahead of an advancing bombardment. To keep things interesting theyve all got secondary objectives that reward you with extra loot if, say, you avoid using grenades or never have a soldier go down; and on top of that, many have modifiers that might make you play differently. I had one mission where my troops couldnt use Overwatch, one where certain enemies got a 2X damage multiplier, and one where my troops only had two action points per turn instead of three. Side missions are where Gears Tactics makes its biggest unforced error.Only a couple of these resulted in really unfair-feeling scenarios, like one where I was expected to hold two points on the map with only two soldiers against waves of heavy enemies. And that mission where I only had two action points to work with was one where I had to stay ahead of the advancing bombardment line  not fun! Fortunately, since you only have to beat two out of three or three out of four in a round, Gears Tactics gives you the ability to opt out of one where the deck seems to be too heavily stacked against you. That also means there are a lot of these missions, making up the bulk of the 35 hours I spent playing through the campaign. Its certainly a good opportunity to gather top-tier loot and improve your chances in the story missions, but grinding my Gears started to feel drawn out after a while. Especially considering youre free to keep doing these missions to endlessly hunt Legendary loot after completing the story, it mightve made more sense to wrap the plot up about 10 hours earlier. Most of my other complaints are related to the UI. It rarely gives you enough information in the mission select screen to know what youre going up against, which means loading out my squad often felt like a shot in the dark rather than a decision I could make intelligently (and sometimes I found I had to restart with a new squad to feel like I had a fighting chance). When youre unboxing a new weapon mod, it doesnt tell you which weapon theyre for  and theyre all unique to a specific class  so until you learn to recognize the icon you have to go hunting for it in your inventory. And while I love that when youre loading out a soldier it lets you browse through your teams equipped gear and pull someone elses goodies over to this one without first unequipping it from that person, it doesnt tell you who has those items equipped until you click on it. Also, it doesnt gray out the gear thats unavailable because it's equipped on a trooper who's already been deployed on this round of sidequests. Where's the Xbox One Version of Gears Tactics? Strange as it is to have a Gears game launch as a PC exclusive, that's the approach Microsoft has taken with Gears Tactics. But even though there's no release date for an Xbox version announced, Microsoft has been clear that Gears Tactics will come to Xbox at some point  and as XCOM proved, there's no reason a turn-based tactics game like this can't work well on a console. Gears Tactics is an excellent turn-based tactics game that does a superb job of melding Gears famous style and action with the mechanics laid down by XCOM. Its one intense and satisfying tactical battle after another, and it looks absolutely fantastic doing it. It does slightly wear out its welcome with too much of a good thing in its Gear-grinding side missions, and due to the lack of larger strategic decisions I dont see it as being as replayable as its tactical role model. Even so, its a strong campaign that leaves a great impression with some clever, Gears-appropriate original ideas.", "date": "April 27, 2020"}