{"name": "Among Us VR", "name_review": "Among Us VR Review", "ref": "https://me.ign.com/en/among-us-vr/203143/review/among-us-vr-review", "text": "Among Us VR understands what made Innersloths murder mystery game so special when it came out in 2018 and brought us near-endless shenanigans by placing 10 people inside a spaceship while two Impostors try to murder everyone. This ground-up VR remake is a refreshing take on the premise that recaptures that suspense while introducing exciting new dynamics. Though its missing features may prove disappointing, whats here is a great time. Right now, its one of this years best VR games. Meta Quest 2 . . 1,899.00 See it  Its hard to overstate just how polished Among Us VR feels when playing. Schell Games has adapted it to virtual reality well: the cel-shaded 3D art style works to great effect, and switching to first-person gameplay proves natural. Walking around a recreation of The Skeld spaceship map and using motion controls to carry out tasks feels a lot more immersive, and fuelling engines with a manual pump and priming shields by touching the screen is more intuitive than using a gamepad or mouse and keyboard. You can play comfortably while standing or sitting down, since movement is entirely smooth and controlled by the thumbsticks. Theres no teleporting, but if youre concerned about motion sickness, optional blinders are available to reduce potential nausea risk, alongside snap turning for the camera. Among Us VR faithfully recreates the originals template, and once again splits us between Crewmates and Impostors. Within a four to 10-player online match, Crewmates must complete several randomly assigned tasks across The Skeld. Some tasks arent particularly exciting, like waiting around for a data transfer, and the real joy comes from the social gameplay surrounding it. Still, theres several new tasks that make creative use of VR: the Admin room has a new retinal scanner that requires you to stand still for a few moments, which isnt terribly exciting, though MedBays whack-a-mole mini-game is entertaining. There's a greater sense of panic when the blaring red lights appear during a sabotage. As an Impostor, though, your only goal is convincing everyone that youre just another Crewmate, even as youre deviously killing other crewmates and trying to get away with it. There are plenty of creative avenues for murder, such as jamming doors or causing a blackout (knowing that Impostors can see in the dark). Or you can go big by sabotaging the ship by depleting the oxygen or causing a reactor meltdown, which are instant wins if Crewmates leave them unfixed for too long. I felt more creeped out during blackouts, and theres a greater sense of panic when the blaring red lights appear during a sabotage. Once a dead bodys been discovered, an emergency meeting commences and the real game of trickery and detective work begins. If youre a real Crewmate, you have to figure out who the Imposters are using whatever suspicious activities you mightve witnessed and decide who can be trusted. If youre an Imposter, you state your innocence, cast blame on others, and try to get others to vote with you to buy someone else a one-way ticket to space. Even after years of playing, keeping your story straight and successfully pinning the kill on someone else still feels great, and its only enhanced by VR. Being falsely ejected through no fault of your own can be frustrating, never mind getting caught out as an Impostor by sheer bad luck, but the fun of this game of cat and mouse is in picking up on subtle clues or tricking everyone with clever hints and insinuations. Theres a cooldown before you can strike again, which keeps a skilled Imposter from running amok. As always, how well a social game like this works comes down to who you're playing with, but in VR theres a greater sense of presence when everyones staring at you. In VR there's a greater sense of presence when everyone's staring at you. Thats all true of the regular version of Among Us, but simply having in-built voice chat in everybodys headset solves one of that versions biggest problems: if youre using an external voice client like Discord dead people can still talk and use that to cheat, but here they become mute ghosts upon death. Plus, having everybody able to speak immediately makes emergency meetings a highlight of Among Us VR. The use of proximity heightens tension: Knowing that someones voice gets louder as you get closer is another way to gather evidence, and introduces a fresh dynamic to matches whether youre hunting or being hunted. Also, you can ask someone to watch you get scanned in MedBay to prove your innocence without necessarily alerting an Impostor to your location. If youre an Impostor, you can try hiding in vents and eavesdropping on other crewmates conversations. Voice chat also makes calling someone out in the middle of a lie and seeing that so-called Crewmate crumble under pressure even more thoroughly satisfying. And if voice chats not for you for whatever reason, theres also a text chat system that uses predetermined quick-chat messages. What We Said About Among Us Among Us lives up to the hype created by its delayed explosion in popularity, for the most part. It's a style of intense, refreshing multiplayer experience that simply didn't catch on digitally before recently. Its well-earned following speaks to just how enticing murdering and deceiving your friends can be, as well as Innersloth's endearing art, approachability, and clever minigame design. I don't have any sus that this will be the last game of its breed to make a splash, since were already seeing its influence on even mega-games like Fortnite. But its the breakout hit for the genre, and it's a great first impression. - Leana Hafer, December 22, 2020 Score: 9 Read the full Among Us review Theres a lot Among Us VR does right, but the biggest knock against this version is that it doesnt have all of the same content and features as standard Among Us. Thats understandable in places, since changing gameplay settings like giving yourself faster walking speed would be a nauseating disaster for a lot of people. However, it would be nice to be able to adjust the number of tasks, for instance. Cosmetics are also limited at launch, and while the Steve Zissou-esque beanie is nice, its no double top hat. What stings more is Among Us VRs lack of extra maps. At launch, theres no Mira HQ, Polus, or the Airship  all we have to play with is The Skeld. In fairness, this was also the case when Among Us launched but a lot of people may not realise that because those maps arrived before it really took off in popularity. As a result, whats here feels disappointingly scaled back compared to the current state of Among Us. You also wont find the XP system, anonymous voting, or expanded roles like Scientists and Shapeshifters. Schell Games says content updates are coming but right now, we dont know what or when. Still, Among Us VRs real longevity comes down to who you're playing with. I couldnt play with friends during this review, but even in a lobby full of strangers, I had an excellent time. The good news is that theres crossplay multiplayer between Quest 2 and PC, which is a reassuring choice given VRs smaller audience. Among Us VR is a great ground-up reworking of a classic social game that feels right at home in virtual reality, remaining faithful to Innersloths hit while feeling fresh in a new perspective and with a few sneaky new tricks in play. This still feels like the same game many of us fell in love with years ago, yet thanks to new elements like proximity voice chat and mini-games made to work with motion controls, Among Us VR revitalizes action across The Skeld. Additional maps and cosmetics cant come quickly enough, but if theyre up to the standard that Schell Games has set with the one thats currently available theyll be worth a bit of a wait. This is easily one of the best VR adaptations of an existing game yet.", "date": "Nov. 11, 2022,"}