{"name": "Pokemon Mystery Dungeon: Rescue Team DX", "name_review": "Pokemon Mystery Dungeon: Rescue Team DX Review", "ref": "https://me.ign.com/en/pokemon-mystery-dungeon-rescue-team-dx/171080/review/pokemon-mystery-dungeon-rescue-team-dx-review", "text": "Playing Pokemon Mystery Dungeon: Rescue Team DX is, in many ways, exactly like saying its full name aloud: It starts off strong with the Pokmon you know and love, then quickly devolves into something very strange that goes on for far too long. Granted, there are plenty of reasons to adore developer Spike Chunsofts remake of the Gameboy Advances Red Rescue Team and Blue Rescue Team from 2005, like its memorable characters and unique premise for example. But the guts of this roguelike dungeon crawler are sometimes hard to bear. With monotonous dungeon crawling, predictable combat encounters, and a grind that can put you to sleep faster than a blast to the face from Butterfrees sleep powder, it couldve used more modern retouches to punch things up a little. Rather than serving as a nostalgic remake that heightens your love for your favorite pocket monsters, Rescue Team DX tests the limits of your commitment to the series with an outdated, tiresome slog. Rescue Team DX is a routine roguelike where you take your favorite Pokmon into procedurally generated dungeons filled with loot, traps, violent wild Pokmon, and lost souls in need of rescue. You also recruit new Pokmon to your cause by defeating them in battle or earning their respect by completing missions, which is a huge motivator to continue the grind even when its at its most irritating. In between dungeon delving, youll interact with vendors in Pokmon Square, manage and improve your Pokmon roster, and talk to Pokmon Rescue Teams likeable cast of characters, which makes up some of the adventures most memorable moments.TKTK This facelift does little to address Rescue Team DX's biggest issue.That doesnt mean that theres been no evolution at all  quite the opposite. Compared to the original Rescue Teams low-res, rudimentary roguelike structure, Rescue Team DX is a vast improvement. The art style, for example, has been completely reimagined to look like an awesome, Pokmon-filled oil painting, which is without a doubt the most notable upgrade. Even on the big screen in the Switchs docked mode, roaming around Pokmon Square and going dungeon delving rarely looks like something meant for a portable device. Other quality-of-life changes, like autosaving, auto-mode for exploration, expanding your maximum team size from four to eight, and incorporating mega evolutions and shinies make the journey through the often-dull business of dungeon exploration much more interesting this time. The problem is this facelift does little to address Rescue Team DXs biggest issue: the things you spend most of your time doing just arent that fun. Despite being procedurally generated, each dungeon is basically a carbon copy of the last, with tight hallways connecting to boxy rooms and enemies stalking each area. After the first hour, youll have experienced more or less all that these tedious treks have to offer but will still be subjected to dozens of hours more, practically uninterrupted. Combat while exploring these dungeons is a common and lifeless affair. Inspired by the mainline Pokmon series turn-based fights, each Pokmon has four moves and similarly take turns smacking one another around. But that familiar system has been greatly simplified and now feels decidedly low stakes. While you could decide which move to use one-by-one, slowing combat down to a crawl, the much easier option is to simply hold down the A button and let your Pokmon automatically choose the best move for you. After a couple seconds, enemies die and you continue exploring. The good news is that means combat is almost always brief, and getting through dungeons can be accomplished fairly quickly if youre efficiently trying to complete quests and find the exit as soon as possible  and with so much tedium and so little reason to explore otherwise, that will likely be your goal. Simply hold down the A button and let your Pokmon automatically choose the best move.Boss fights, while a refreshing increase in challenge compared to the rest of the campaign, only serve to highlight the combat systems flaws with their lengthier battles. A big, angry Pokmon will charge into battle to tense music only to enter into a prolonged battle of attrition where you mostly just tap A repeatedly and hope the boss dies before you run out of healing items. This exposes another flaw in the combat system: a complete lack of enemy health bars, which deprives you of the knowledge that you might be moments away from winning or miles off and are just throwing away healing items on a fruitless effort. These encounters are also extremely frustrating when you lose one, as it often requires you go through all or part of the dungeon again from the beginning. There isnt really a whole lot else to do in between each dungeon either. Youll turn in quests to net rewards and level up your rescue teams level, curate and customize your roster of Pokmon that can be converted into allies after defeating them in a dungeon, sign up for a rescue mission to save a fellow player from a dungeon theyve been defeated in, and visit vendors throughout Pokmon Square to stock up on equipment and unlock new camps for your Pokmon to settle in, but these things usually only take a few seconds each before its right back to a variation of the same dungeon you just left. Training your Pokmon at the dojo is an easy way to level up your squad and make yourself more lethal in dungeons, but guess what? The dojo is just another dungeon where the Pokmon being trained is given less than a minute to kill as many enemies as possible to boost their XP  enjoy holding A more. Thankfully there is a worthwhile payoff for grinding your way through Rescue Team DXs featureless hallways and zombie-like Pok-adversaries: its characters and story are genuinely great. As a clueless human who has been transformed into a Pokmon through unknown means and for a mysterious purpose, youll meet a memorable cast of talkative Poke-friends, like Gengar, who plays the incompetent heel, and an all-knowing Alakazam who serves as mentor to your fledgling rescue team. While the plot does make some odd turns and often takes far too long to get where its going, reaching each milestone manages to make the worst aspects of combat and exploration a lot more tolerable  even if large sections of story are interrupted with dungeon-crawling padding for no real reason except to make you wait for the next story beat to arbitrarily develop Another bright spot is the endgame, as much of the best content is locked behind the elusive credits. Evolution of Pokmon, adding legendary Pokmon to your roster, more challenging dungeons, and more mysteries. But, of course, experiencing those surprises requires even more dungeon crawling, which does nothing to improve post-credits. Pokemon Mystery Dungeon: Rescue Team DX is a remake that feels like putting a bandaid on a flawed game that badly needed major surgery instead. While the story and presentation have been drastically improved with fun characters and an impressive new art style, its core is still painfully dull. Key areas like dungeon crawling and combat are as monotonous and repetitive as ever, leaving Rescue Team DX a truly unremarkable, grindy experience.", "date": "March 6, 2020,"}