{"name": "Mega Man Zero/ZX Legacy Collection", "name_review": "Mega Man Zero/ZX Legacy Collection Review", "ref": "https://me.ign.com/en/mega-man-zero-zx-legacy-collection/170693/review/mega-man-zerozx-legacy-collection-review", "text": "Man oh (mega) man do I love this collection. Its six excellent Mega Man spin-off games bring with them exactly the kind of gameplay and story my body craves and Im thrilled at how well they hold up and stand on their own. But its the extras, including a new competitive mode with online leaderboards, that really seals the deal. Mega Man and Mega Man X are some of my favorite series in all of gaming, but I slept on the Mega Man Zero series when it came to Game Boy Advance starting in 2002 and first realized what I was missing when the Zero Collection came out on DS in 2010. The Mega Man Zero/ZX Legacy Collection for Nintendo Switch, PS4, Xbox One, and Steam is even better, because it brings all four of the original Mega Man Zero GBA games and both DS games into one convenient package. They're wonderful. If you're not familiar with the plot of the Mega Man Zero series, here's a quick rundown: 100 years after the events of the Mega Man X series, legendary warrior Zero is reactivated to help fight in the war between humans and Reploids, a race of human-like robots based on the original Mega Man X. Mega Man ZX and Advent are set even further in the future, in the year 25XX, when humans and Reploids exist in harmony... until the revival of the Mavericks. Throughout the entire series there's a lot of talk of cyber-elves and Neo Arcadia, Bio-Metals, Reploids, E-Crystals, sacrifice, and betrayal in other words, it rules pretty hard. It's exactly the kind of corny, jargon-heavy anime storyline I love in my video games. Unfortunately dialogue is largely unskippable, which can be real annoying when you're trying to beat a boss. There's a lot of talk of cyber-elves and Neo Arcadia, Bio-Metals, Reploids, E-Crystals, sacrifice, and betrayal in other words, it rules pretty hard. The gameplay itself follows the Mega Man Zero formula, and on Switch it feels great in both handheld mode and on my TV. Holding down the R-button to fire the alternate weapon on the Joy-Con doesn't feel the best, but the Pro Controller is a much better fit. You can remap the controls to fit your preferred playstyle, which is a welcome option. None of these old-school platformers are easy, but to help remedy any of the frustration Capcom has added two new options to ease the sting of repeated failure. Save-Assist drops save locations at key points in the levels, meaning you can lose to a boss and start right back up again from the nearest save point instead of starting the whole level over like back in the day. These aren't save states, though, so they still require a certain amount of raw skill if you want to make it through the levels. There's also a casual mode which removes the threat of instant-death from spikes and pits and beefs up your character and weapons. Casual mode has to be set at the beginning of a game, so you need to be committed to your choice: you can't switch back and forth between normal and casual modes. I have no problem admitting I played with the Save-Assist mode turned on, but only tried out Casual Mode for the purposes of this review. I have my pride. On modern displays, the Zero/ZX series' pixel art graphics are absolutely beautiful. There are three different filters to choose from: a ~soft~ filter blurring the pixels a bit, ~no filter,~ showing off every pixel in its full, razor-sharp crispness, and a filter that makes the graphics look like they're on a GBA or DS screen. That last one puts a very subtle, but noticeable, static effect on the screen, giving it just a hint of old-school grittiness inherent in earlier handheld displays. It's far and away my preferred way to play. The Zero/ZX series' pixel art graphics are absolutely beautiful. Apart from the filters, there are different screen layouts you can choose from, the number of which differs whether you're playing Mega Man Zero or ZX games. The ZX games, originally released on DS, have several layout options for the DS' second screen, but there's no portrait mode for use on the Switch, which is a massive bummer. The two DS games would benefit enormously from compatibility with something like the Flip Grip, a $12 plastic device that allows you to hold the Switch sideways. Tons of other retro games on Switch support the vertical orientation, including individual games on collections like the SNK 40th Anniversary and SEGA Ages. Capcom, if you're reading this, please patch in a vertical orientation for ZX and ZX Advent in handheld mode! There are also loads of wallpapers to choose from, and I didn't find a bad one in the bunch, to be honest. The Zero/ZX art style is a personal favorite, so I found myself swapping out wallpapers fairly regularly just to enjoy a change of scenery. When a collection has games as strong as these, it lives or dies by the quality of its extra content, and I'm happy to say Mega Man Zero/ZX Legacy Collection does... a decent job. My one gripe is it plays it pretty safe: it has exactly the kind of bonus content you've come to expect at this point, and only scratches the surface of the series' history. I would love to see more in-depth bonus features delving into the series' development. There is a massive gallery of art for all six games, with high-resolution images available to scroll through and enjoy. There are also bonus cards you unlock through playing, and you can activate them to unlock extras in the games themselves. For example, turning on some of the earlier bonus cards adds plants, paintings, and other touches to the Resistance Base in Mega Man Zero 3. It's a cool cosmetic touch I didn't expect, and with 100 unlockable cards there are many more secrets I haven't unlocked. There is a massive gallery of art for all six games, with high-resolution images available to scroll through and enjoy. On top of the bonus art, the soundtracks for every single game are accessible from the main menu right from the start, so you can cycle through your favorites (my absolute favorite is Departure from Mega Man Zero 2, followed by Green Grass Gradation from Mega Man ZX). The new Z-Chaser mode is a competitive speed-running mode with online leaderboards. It's really well done, with the ability to choose your ~ghost~ from a selection of other, actual players who've set records and compete against them for glory. If you'd rather compete locally, Z-Chaser has a head-to-head mode, too. Even though I'm not into competitive speedrunning at all, I did find myself enjoying running Mega Man Zero levels against the ghost of an online stranger. The Mega Man Zero/ZX Legacy collection is great thanks to the quality of its six included games. Capcom's addition of new modes to help people play these classics at whatever difficulty they feel comfortable with is a great way for anyone to enjoy the wild sci-fi stories of these Mega Man X spin-offs without making it a walk in the park. The bonus features are great, but aren't anything more than what you'd expect to find in a retro gaming collection, although the Z-Chaser adds a new level of competitiveness to the games. Playing handheld games on a 55~ screen is fun enough on its own, but these games in particular look and play amazingly well.", "date": "Feb. 25, 2020,"}