{"name": "Warcraft III: Reforged", "name_review": "Warcraft 3: Reforged Review", "ref": "https://me.ign.com/en/warcraft-3-reforged/170061/review/warcraft-3-reforged-review", "text": "Over the course of the last week, theres been a lot of gnashing of teeth over shortcomings in Warcraft 3: Reforgeds effort to freshen up an 18-year-old RTS classic. And while there are undoubtedly some cut corners and buggy menus dragging things down, what made the original Warcraft 3 great mostly still holds up today. After an MMO with seven expansions, a digital card game, and a feature film, Reign of Chaos and The Frozen Throne represent the pinnacle of the Warcraft franchise in many ways. The new coat of paint, while not as impressive as I expected, makes it even more enjoyable to revisit that peak. What struck me the most in the seven full-length, single-player campaigns included with Reforged was how dynamic and compelling Warcrafts storytelling used to be. Warcraft 3 hit before the constraints of a faction-focused PvP MMO and its roughly two-year expansion cycle put Blizzards writers in a bit of a box. But this tale of Arthas fall, the reawakening of the Night Elves, Kaelthas leading his people into exile, and the first major confrontation with the Burning Legion comprise a wonderful fantasy epic. And the mission design, particularly in the Frozen Throne campaigns, still holds up against the cream of todays strategy crop. World of Warcraft, at its very best, can brush up against these heights, but it has never truly surpassed them. If youve never experienced Warcraft 3s story before, basking in its memorable characters, meaningful twists, dramatic changes of fate, and climactic confrontations are worth the price of admission already. Four Nation Army Each of the four factions presents an interesting and different playstyle, from the fairly conventional Humans, who work like a classic RTS faction, to the completely out-there undead Scourge, who collect lumber with their frontline infantry units, raise enemy corpses to fight for them, and use their food buildings as defensive towers. Winning in multiplayer still heavily focuses on heroes and who can gobble up the most experience points from neutral monsters the fastest, which can be frustrating if you get your perfect army crushed because the other teams champions out-farmed you. But once you get a grasp on how this is a different kodo beast from other RTSes, it offers interesting new challenges and strategies. It's more than your typical base building game in ways that have allowed it to remain distinct and entertaining. Aside from the hero system that would lead directly to the creation of the MOBA genre, Warcraft 3 introduced a handful of other unique and cool mechanics to the mix. The day/night cycle and how certain units interact with it, particularly Night Elves, adds some excellent opportunities and obstacles when it comes to timing big attacks or laying ambushes. The upkeep system that charges you for a percentage of your gold income when your army gets too big forces you to make meaningful decisions about whether you need a stronger force or a stronger economy. Its much more than your typical base building game in a lot of ways that have allowed it to remain distinct and entertaining even as the genre has waned. For a Warcraft veteran like myself, the visual upgrade here is the biggest draw aside from nostalgia. And in that, Reforged only partially succeeds. On the one hand, this is the best the characters and units from the Warcraft universe have ever looked, even including the recent model updates in WoW. The visual style is a bit more realistic and gritty, and closer to the look of a Blizzard cinematic than the slightly cartoonier, more stylized version of the world weve grown accustomed to. When I really zoom in to look at the details on a peon or a death knight, it makes me wish World of Warcraft looked this good. The environments havent been given quite as much love though. The HD textures are crisp and attractive, and theyve added more 3D vegetation to give the land some depth. But the level geometry is still pretty blocky and dated-looking. The trees arent very detailed compared to the ghouls whacking away at them. The waterfalls in particular are just plain ugly, and look like they could have been ported straight from the 2002 version. Zug Bug While some people have reported running into a variety of different issues, Ive been lucky enough not to run into any serious bugs so far, but the menus do all feel very finicky and half-baked. They lag and freeze regularly, buttons arent responsive, sometimes the map for the next mission doesnt even display correctly, and UI elements in the post-battle summary can overlap and become unreadable. Its the least-polished element of the whole affair by far. Venturing out from the excellent campaign mode and into multiplayer, I didnt find it hard to have a good time though. There are some features from the original disappointingly missing, like custom campaign support and automated tournaments, but what is here works pretty well. You can still jump into dozens of diverse custom maps featuring everything from Lord of the Rings-inspired battles to tower defense. The skirmish matchmaking is fast, painless, and did a good job of placing me with similarly-skilled opponents. Of course, the UI still managed to get in its own way here. I could never get the custom map browser to sort properly, forcing me to scroll down and manually look for matches with low ping. Warcraft 3 is still probably my favorite Warcraft game of all time, and one of my favorite fantasy stories in any video game. The visual update Reforged brings to all its beloved and behated characters is all the reason I needed to want to experience it again. Its not perfect, and its not everything we may have been promised, but its still Warcraft 3. If I were judging it purely based on how good of a remaster it is, theres not much to write home about and plenty of room for improvement. But taken as a whole, its still a great game nearly two decades after its initial release. And the relatively minor shortcomings of this edition shouldnt stop you from returning to this classic age of Azeroth or diving in for the first time.", "date": "Feb. 6, 2020,"}