{"name": "Zombie Army 4: Dead War", "name_review": "Zombie Army 4: Dead War Review", "ref": "https://me.ign.com/en/zombie-army-4/169981/review/zombie-army-4-dead-war-review", "text": "Did you catch that just a couple of weeks ago, Valve came out and said that in no uncertain terms that there will absolutely not be a Left 4 Dead 3 anytime soon? Well, whats terrible news for many is awesome for Zombie Army 4: Dead War, which couldnt have hoped for better timing. Its here to follow in those four-player co-op footsteps  except its zombies are also Nazis, and sometimes when you kill them you get a super-gross slow-mo kill. It definitely scratches the itch, though the handful of new ideas it injects dont really reinvigorate the genre that Bill, Coach, Zoey, and Francis built. It may feel overall familiar, but Zombie Army 4 does manage to separate itself from the already sizable horde of cooperative zombie shooters in a few enjoyable ways. For starters, the story is delightfully absurd, with occult forces bringing the Nazi army back from the dead, seemingly from the literal bowels of Hell. Its roughly eight-hour campaign ends with a ridiculous and surprising final confrontation that is worth seeing unspoiled. A simplified Horde mode exists as well, if you just want to stick to one location and see how many waves you can take on while experimenting with different weapons. I prefer the variety and forward momentum of playing the full campaign, but Horde offers plenty of opportunity for intense shootouts and last-second victories. The alternate-WW2 setting is disgusting and full of gore, but in a creative way where I was eager to see what I would be fighting next. I enjoyed confronting powerful enemies like flamethrower zombies with explosive gas tanks on their backs, zombie Nazi generals whose hearts must be removed in order to prevent them from spawning more enemies, and bosses like tanks that reveal giant ribcages when their armored sides are blown off. And it's made all the more exciting by an excellent soundtrack that feels like it comes straight out of the 1985 George A. Romero zombie film classic, Day of the Dead  my only complaint about the music being I wish it were mixed louder and piped in more often. There's a layer of strategic dismemberment to the mindless slaughter. Theres a little more to it than running and gunning because the way you shoot zombies encourages you to confront the walking dead in a more nuanced way: Getting a certain number of kills unlocks special abilities, like overpowered sniper shots or hyper-fast shotgun reloading, but you also get a chance to recover health by pulling off up-close kills. Killing a certain number of zombies from a distance to earn the right to run in and recover some health adds a layer of strategic dismemberment to the mindless slaughter. On top of that, theres clearly some Doom inspiration here that helps keep the action moving, with certain zombies offering up ammo, grenades, or health packs if you stomp them after theyve been defeated. This led to some great moments where I recovered from being cornered by taking out a huge wave, healed myself with up-close fatalities, and then stomped enemies on the ground to recover ammo before rushing toward the next objective. Where it had seemed like I was done for just moments earlier, I found myself maxed out and ready for whatever came next without so much as an ammo cache pitstop. The layouts of Zombie Army 4s eight levels (and the smaller, final confrontation) are designed well and do a good job of contextualizing why you need to make it from point A to point B beyond basic survival. Sometimes youre exploring an abandoned zoo, other times youre getting fuel for a boat so it can make its way down a canal, or youre gathering up pieces of a bomb to combine at the end of the stage. The levels dont look radically different, but they all have interesting layouts that are fun to explore and are creepy and unsettling in their own way. The objectives are simple enough where you and your friends will never be confused about what to do next, but interesting and varied enough that it doesnt quite feel like youre always doing the same thing. There are never moments where co-op play is required  you could easily play through solo if thats how you roll  but the more players join the action the higher the difficulty automatically scales and the more important teamwork becomes. You could easily play through solo if that's how you roll. I like the mad sprint to complete those kinds of objectives, but was less excited about the areas where you have to hold your ground for a certain period of time. These defensive scenarios arent all that common, but oddly Zombie Army 4 is constantly offering you landmines and electric tripwires that arent all that useful when youre on the run instead of preparing for an onslaught. And even during holdout objectives when you have time to lay out traps, theyre all pretty much gone after the first wave and its back to standard shooting anyway. The upgrade system is also rewarding  up to a certain point. The persistent character progression lets you level up across the board, so whether youre in Horde mode, playing the campaign alone, or with friends, you can add new abilities like better defense or faster landmine placing, among others. There arent enough options to allow you and your friends to branch off and occupy classes with wildly different and synergistic abilities, but growing your abilities level to level is still worthwhile. Why would I use a machine gun when my shotgun electrocutes zombies? The gun upgrade system, however, is initially exciting but can hit a wall. The Trench Gun is a personal favorite: by the end of the campaign I had sped up my reloading, boosted damage output, and added bonus electricity damage. I added similar upgrades to my sniper rifle, but after awhile I ended up with a load of gun upgrades for weapons I had no intention of using. Why would I take two steps backward and start using a machine gun when my shotgun electrocutes zombies? Because there arent any classes, I didnt feel a reason to return to square one and change things up. Its a nice touch, though, that when you die you turn into a zombie and watch, with no control, as your character ambles into the crowd and becomes another obstacle for your friends to overcome. Once they kill you, you can respawn (as long as they dont die before then), so it works as a fun handicap to prevent instant respawning  and lets face it, its also fun to kill the zombie versions of your friends. Microtransaction Reaction Zombie Army 4 at launch represents a respectable package with a substantial campaign, but a first season of DLC is already planned, and a Season Pass is available for $34.99. Along with new characters and guns, and new skins for all the characters and guns, the first DLC will also add three new campaign missions. Additional free levels for Horde mode are also planned, though its currently unclear exactly when this new content will be available. In terms of what is available immediately, there is a small selection of cosmetic items and alternate guns that are included in the Deluxe Edition or can be purchased individually for $4 or $5. So far, it doesnt seem like DLC content will be a major issue. On the technical side, I didnt run into any connection issues, but I did have some general bugs. On more than one occasion I ran into a scenario where zombies were arriving endlessly, even though the goal had been completed, forcing us to restart. I also had a couple of times where big black bars would appear, obscuring my view of ammo reserves and when my special abilities would be available. It was pretty annoying. Zombie Army 4: Dead War feels largely familiar amid the horde of Left 4 Dead-style co-op shooters, but it isnt without its clever mechanical touches and spins on the oldest of video game cliches: killing Nazi zombies. Between its varied and campy story campaign and an amusing horde mode, there are plenty of opportunities for harrowing teamwork and gory, disgusting X-ray kills. The weapon progression system doesnt give a lot of reasons to branch out, though, so the pull of its replayability isnt as strong as it could be.", "date": "Feb. 4, 2020,"}