{"name": "Super Smash Bros. Ultimate - Byleth DLC", "name_review": "Super Smash Bros. Ultimate - Byleth DLC Review", "ref": "https://me.ign.com/en/super-smash-bros-ultimate-byleth-dlc/169897/review/super-smash-bros-ultimate-byleth-dlc-review", "text": "After the impressive and surprising list of DLC characters Super Smash Bros. Ultimates first Fighters Pass has brought so far, the most recent and final addition, Byleth from Fire Emblem: Three Houses, feels like an incredibly safe pick  in more ways than one. Theyre not as mechanically complex as the likes of Hero or Terry Bogard, and not as fan-servingly exciting as Joker or Banjo & Kazooie. And yet, a bit of vanilla to round out this already vibrant pack of extra fighters doesnt stop Byleth from proudly standing out among their Fire Emblem peers and the rest of Ultimates extensive roster. As an anime-looking sword-wielder, Byleth certainly has their work cut out for them in trying to convince people to pick them up over any of the other similar options  and thankfully, theyve got plenty to work with in that regard. Out of the five other Fire Emblem reps (seven if you count Echo Fighters), Byleth manages to be the only one to showcase the strategic weapon variety thats core to the series. Using special weapons from Three Houses known as Heroes Relics, Byleth can seamlessly swap out their whip-sword for a hefty axe, lengthy spear, or powerful bow, and each has their own unique strengths that make them a ton of fun to smash your opponents with. Rather than have them haphazardly attached to various moves, Byleths different weapons are smartly mapped to your directional inputs. While their neutral special incorporates the bow, side attacks utilize their spear, down attacks summon the axe, and lighter swipes and overhead moves uses the whip-sword. Beyond each one looking awesome when summoned in a fight, the directional based context gives Byleth a feeling of smart cohesion thats incredibly easy to pick up and understand. Byleths moveset is also one of the big reasons why this DLC fighter seems fairly simple compared to the others that have arrived post-launch  for better and for worse. Where Terrys button inputs could be too technical for some, Heros random moves and magic meter could feel too chaotic, and the meters and consumables of Joker and Banjo too much to keep track of, Byleth forgoes all of it. Their gimmick essentially lies in the simplicity of a man/woman-at-arms, with a weapon for every situation, providing a different type of challenge in knowing when to use the right one rather than learning how to wield them at all. But Why Byleth? Its a question thats been on everyones mind since game director Masahiro Sakurais big reveal: why close out Fighters Pass 1s list of impossible-to-predict guests with Nintendos latest Fire Emblem protagonist? The answer is likely the most obvious one  because they are Nintendos latest protagonist, and rightly deserve a place on the roster. When Super Smash Bros. Ultimates launch roster was revealed, it seemed like every main character from all of Nintendos biggest games were there  including the likes of the Inklings and Isabelle, both of whom had gained increased popularity since the last Smash Bros. game. It's entirely possible the only reason weve seen so many guest characters as DLC is because we also havent been introduced to that many new Nintendo protagonists since Ultimate launched. Out of Nintendos 2019 lineup, Byleth was the only real new addition to a big franchise that also lent themself toward being a fighter. (Sorry, Gooigi, maybe youll make the Echo Fighter roster someday.) If Three Houses had been developed and released a year or two earlier, theres a good chance Byleth would have been in the base roster as many other Fire Emblem heroes were in the past. As for why Fire Emblem has so many representatives in Smash - unlike other big Nintendo franchises, Fire Emblem is one of the few that regularly changes its cast of main characters for each game (Granted, having three reps for Fire Emblem Awakening was a bit too much, even considering Echo Fighters). If Byleth does have a gaping flaw, its commitment. While each weapon type can deal a staggering amount of damage when they connect, theyll often leave Byleth wide open to counters from a skilled or perceptive opponent. The bow, known as Failnaught, can be charged up to deal devastating precision damage at long range, but once youve charged past a certain threshold, you cant get out of the move early. Similarly, aiming your attacks downward with the axe Amyr can demolish anyone standing nearby, but the lengthy startup and finish (and the time youre left vulnerable after landing with a downward aerial strike) means youll either have to be very good at predicting an opponent, or drop in on a group of distracted fighters. The slow nature of these kinds of unsafe moves might not turn a lot of heads in the competitive scene, but it may entice newer players who arent afraid of making mistakes with an easy-to-grasp moveset and tons of strong attacks. Even without the additional weaponry, Byleths Sword of the Creator (which is generally linked to up-attacks, but can also act as a sort of default for many others) holds some very interesting and fun properties. Able to be used like a whip, it gives Byleths quicker moves and upward attacks more options, thanks in part to their unique recovery move. While other characters like Zero Suit Samus and Joker can use similar tools to grab or hook onto ledges and pull themselves up, Byleths up-B can also latch onto opponents and use them as a stepping stone to launch high up while sending their target screaming downwards once theyve hit a certain damage threshold  which makes it deliciously evil to use off the stage, yanking poor souls down to their doom before they can react. I was even pleased to find some clever applications when used above platforms, giving me different options to follow up with other moves depending on how damaged my opponent was, or how far my opponent bounced back off the ground below me. That said, smaller ledges have sometimes been my downfall, as the Sword of the Creator has either been unwilling or unable to hook onto tiny platforms to save me from plummeting and the move itself gives no recovery if nothing connects. Byleth's up-B can also latch onto opponents and use them as a stepping stone to launch high up while sending their target screaming downwards once they've hit a certain damage threshold  which makes it deliciously evil to use off the stage. As part of Byleths character pack, theres also the addition of a host of new themed Spirit Battles. These are as ingeniously crafted as ever, and Three Houses fans will appreciate all the fun details  like Dimitris Spirit Battle including a tough Ganondorf in place of Dimitris stalwart bodyguard, Dedue. That being said, those who havent already played through the Three Houses story may wish to hold off on some of the tougher Spirit Battles, which inadvertently spoil some plot points by way of the battles surprise mechanics. As for the stage, Garreg Mach Monastery feels surprisingly bland. While stages that tour around a large location usually offer up an array of different battlefields to fight in and adapt to, each of the monasterys four areas are flat, walk-off arenas with the bare minimum inclusion of a few small temporary platforms. Even the guest appearances by students and house leaders of each of the three houses seem a bit dull - especially when spotted standing in an otherwise deserted grand hall. Garreg Mach Monastery isnt exactly a disappointing place for a fight, but when you look at the variety of architecture in other Fire Emblem levels like Castle Siege and the Coliseum, the monastery just feels stale in comparison. Luckily, the inclusion of some of the best music that Three Houses has to offer won't go unnoticed. The upbeat tempo of Fdlan Winds and The Edge of Dawn mesh perfectly with frantic large battles, while songs like The Apex of the World and Between Heaven and Earth give 1v1s a legendary feel. On the surface, the Byleth Challenger Pack isn't as flashy or surprising as past additions, and its new stage is somewhat of a missed opportunity  but the new professor themself shouldnt be discounted so easily. Byleth has a simple to grasp moveset with some fun small twists thats welcomely easy to learn the ropes with, and their unique approach to directional-based weapons stands out enough to make checking out yet another Fire Emblem hero worth it  even for the skeptics.", "date": "Jan. 31, 2020,"}