{"name": "Chilling Adventures of Sabrina: Part 3", "name_review": "Netflix Chilling Adventures of Sabrina: Part 3 Review", "ref": "https://me.ign.com/en/chilling-adventures-of-sabrina-part-3/169729/review/netflix-chilling-adventures-of-sabrina-part-3-review", "text": "This is a spoiler-free review of Netflix's Chilling Adventures of Sabrina Part 3, now streaming globally. After the wild events of Chilling Adventures of Sabrina Season 2 Sabrina discovering that her father is the literal devil and then besting her father, trapping him in the body of her sexy wizard boyfriend Nick Scratch; Aunt Zelda becoming the High Priestess of the Church of the Night and head of The Academy of Unseen Arts  we have a lot of questions! Like, is Sabrina still the Herald of Hell? Will Nick ever get out of Lucifer's playground? What really happened to Father Blackwood? Will Lilith be a better ruler of Hell than Lucifer? Well, the third installment of Chilling Adventures of Sabrina is here to give us some answers, but arguably the biggest question is: will the series be able to top the high-camp, gothic horror quality that made it such a big hit with fans in Part 2? This reviewer is happy to report that the answer is a resounding yes. Hail Satan, baby! Something that Part 1 of CAOS struggled with was a sense of style over substance, a few filler episodes that shouldn't have existed in a ten-episode season, and a sense of confusion around what the show wanted to be. Was it a teen melodrama a la Riverdale? A feminist screed on the nature of women, oppression, and religion? The messy first installment was fun enough, and the second season made good on some of that potential, with more thoughtful story arcs, impressive visuals, and a killer cliffhanger that built on one of the darkest parts of the original source material. With this third entry, Roberto Aguirre-Sacasa cements Sabrina as a contemporary teen classic, finally delivering on the promise of the earlier seasons. What works so well about the latest batch of episodes? To put it succinctly, in part 3 the show goes ~full Riverdale.~ If you've watched Aguirre-Sacasa's camp CW magnum opus then you'll have an idea of what we mean. But if you haven't fallen for the strange charms of the Archie-verse, we'll just say that here, we get an uncompromising, ridiculous, and unendingly enjoyable version of what Sabrina always hinted it could be, complete with musical numbers, cheerleading, and a lot of fantastically scary monsters. Without getting too deep into spoiler territory -- this was already revealed in trailers and teasers -- the season begins as Sabrina and friends head to Hell, and it's just as gory, great, and fun as it sounds. Despite a setup that could've left us missing Buffy the Vampire Slayer, from the first episode onwards, an impressive use of budget, brilliant production design (a consistent joy since the show debuted), and an absolute dedication to being itself makes this season a hellish joy to binge. Something that really brings Part 3 to life is its near-procedural nature, which offers up a Buffy-style adventure of the week (or in this case, episode) that never takes away from the overarching narrative that is woven throughout. Sabrina and her Fright Club get up to all kinds of escapades that span history, dimensions, and imagination as Sabrina once again struggles to find a balance between her destiny as the daughter of Satan and her life as a teenage girl. What changes here, though, is the world of Greendale expands with bigger stakes and bigger threats, and Chilling Adventures of Sabrina is all the better for it. Rectifying (some of) the biggest sins of the past, CAOS Season 3 gives some of the most interesting -- and previously sidelined -- characters some of the best storylines. We get a couple of very entertaining episodes featuring Prudence and Ambrose embarking on a globetrotting adventure which sees the pair -- who were both standouts who didn't get enough screen time in Parts 1 and 2 searching for Father Blackwood on a sort of erotic monster hunting world tour (we'll take that spin-off now, please!). We also get some seriously solid horror action, so if you're reading this as a genre fan who has never been tempted by the teen show, you can easily hop into this season and enjoy some incredible practical work, huge horror moments, and generally gorgeous and gory chaos. Speaking of horror, Aguirre-Sacasa excels when he wears his genre-fan heart on his sleeve and this season is steeped in the blood of his influences. From Eldritch horror to final girls, you'll find no trope unturned here, but it never feels like fan service or overkill. In fact, Aguirre-Sacasa crafts a delightfully dark homage to horror whilst never feeling derivative, even when leaning into the oldest of cosmic horror storytelling. There's just something about this season that feels balanced, mature, and really damn good. The finale may split audiences down the middle with a big Deus Ex Machina that could easily break your suspension of disbelief. For this recently converted Chilling Adventures diehard, it was perfectly outrageous and felt like a totally fitting way to end what was one of the most fun seasons of TV we've seen in ages. Count us in for Part 4; hell... it can't come soon enough. Benefitting from a vast step up in quality on almost every level, a strong ensemble cast who have grown into their roles, and a creative vision that finally feels like it's been given full reign, this season of Chilling Adventures of Sabrina is easily the best yet. Whether or not you've already fallen for the charms of Sabrina and her friends, you'd be remiss not to check out the newest entry into this terrifyingly entertaining teen horror series.", "date": "Jan. 26, 2020,"}