{"name": "Wattam", "name_review": "Wattam Review", "ref": "https://me.ign.com/en/wattam/168663/review/wattam-review", "text": "Somewhere between a lucid dream, a childrens show, and an acid trip, youll find Wattam. The latest game from Katamari Damacy creator Keita Takahashi is an absurd and colorful adventure full of anthropomorphised objects, laugh-out-loud goals, and a dreamlike sense of floaty imprecision. Its not the meatiest of games (despite literally letting you play as meat), but its a ridiculous joy all the same while it lasts. Wattam doesnt really fit into any specific genre box, but you could most closely liken it to a third-person puzzle game. Bear with me here: you control a mustachioed green cube called the Mayor who wears a bowler hat with a confetti bomb inexplicably tucked underneath it. He starts out alone in the dark, but simple quest prompts guide you (and potentially a friend in local co-op) along to complete tasks that slowly repopulate the world around you. Everything in Wattam, including the ground you are walking on, has a cute little face and a pair of arms, each one bubbling and giggling with smiles nearly the entire time with happy voices that were surely recorded by actual children. Before long, the Mayor is surrounded by anthropomorphized rocks, flowers, and trees, as well as odder things like loose body parts, pieces of colorful poop, living numbers, and roughly 100 other smiling object-friends. And, in what is probably the loveliest part of Wattam, every single one of them is a playable character. While the Mayor is your main hero, you can swap freely to any of the others youve brought back from the void of nothingness at any time. Yes, even the poop. The ones you arent directly controlling (or holding hands with) will idly wander around and do their own thing, making them feel more alive than just an avatar waiting to be controlled. I was genuinely smiling the entire time I played Wattam  its just so pleasant to be in this weird and friendly world. It's just so pleasant to be in Wattam's weird and friendly world. Most of Wattams objectives ask you to use certain characters in specific ways. For example, one had me take control of a tree and use it to eat other characters and then regrow them as food, while a set of other particularly fun ones had me stack different characters on top of each other to try and exactly match the height of a tall golden bowling pin. Theres very little challenge to any of them, but the are all so gleefully absurd that I had fun the whole way through the two-and-a-half hours it took me to finish the main story. Granted, thats not super long. Theres at least some mechanical variety between them to keep things fresh. While most of the objects are functionally similar  nearly all of them can run around, climb others, and hold hands to create adorable little chains  some have specific tricks, ranging from the trees eating I mentioned earlier to things like a desk fan being able to blow wind or some balloons that can float high in the sky. The imprecise character swapping thats tied to the right control stick can be a pain to manage at times, but theres rarely ever a danger or reason to hurry that could turn that minor annoyance into a larger frustration. While Wattam is filled to the brim with thematic surprises (I will be amazed if anyone could accurately guess whats coming next at any point in this game), it doesnt take too long before the loop of completing straightforward tasks to unlock the next set of characters over and over becomes fairly clear. There are some moments that break this loop up with unique activities like a faux-boss battle against a faceless doll or an investigation to find a piece of sushis lost fish egg children, but these ideas come and go disappointingly quickly. Wattam isnt trying to be an action game or a detective game, though, and these asides instead feel like your characters are kids at a playground adorably playing make-believe. What Wattam is trying to be is exactly the mess of incongruous characters it presents you with, happingly holding hands and smiling as they get turned into poop or blown up with a confetti bomb for no reason other than its fun. It succeeds heartily at being just that, and there are some genuinely hilarious goofs and jokes throughout. Stepping back from it, its clear that if Wattam wasnt such a charming game then it would likely be a pretty boring one. If Wattam wasn't such a charming game then it would likely be a pretty boring one, but it's got charm out the wazoo. Thankfully, its got charm coming out the wazoo. The character design is fantastic, the world is colorful and lovely, the childish voices are a silly delight, the scenarios it throws at you are often creative and strange, and the consistently incredible music ties it all together. Even beyond the main theme song (which is Katamari Damacy-levels of excellent), every character has a unique instrumentation or melody that takes over when you control them that gives each a burst of extra personality. Wattam is a weird and wild fever dream of a game, but its the most enjoyable fever dream Ive ever had. Its loop of using ridiculous, anthropomorphic characters to complete simple tasks in order to gather more ridiculous, anthropomorphic characters succeeds thanks to the silly and fun situations it puts you in, even if its not the most complex or challenging loop to begin with. I cant help but feel like some of the most interesting ideas Wattam uses to shake things up arent fully explored, but being a part of this friendly world, however briefly, is a true joy.", "date": "Dec. 17, 2019,"}