{"name": "Mortal Kombat 11 - Sindel DLC", "name_review": "Mortal Kombat 11 - Sindel DLC Review", "ref": "https://me.ign.com/en/mortal-kombat-11-sindel-dlc/168045/review/mortal-kombat-11-sindel-dlc-review", "text": "Sindel is disgusting. And by that I mean that shes both a deplorable person and she has some nasty tricks in Mortal Kombat 11 that are sure to make her a huge threat against the rest of the roster. Shes an absolute monster in the mid range, with an overhead that reaches from a football field away that will certainly remind MKX players of Kung Jin; a Krushing Blow on her scream that can whiff punish and delete nearly half your life bar; and a deadly flipping overhead that can quickly close the distance, score a knock down, and put her in range to threaten your wake-up. Fans of Mortal Kombat 9s Sindel may be surprised to learn that this time around shes actually not much of a true zoner, which is great because MK11s got enough of those. MK11s Sindels best range is at mid-screen, where she can threaten with her giant polearm that hits overhead; her chargeable scream, which can be cancelled, enhanced, and will Krushing Blow on a counter hit; and her back + 3, 4 string, which has surprising range and can combo into big damage. This big damage doesnt come easy, though, because Sindel is not a simple character to use. While they cover huge range, her attacks are not very fast  and her combos, while they hit like a freight train, are not the easiest to land. Theyre also generally pretty punishable on block, making her a character thats great at whiff punishes and catching people sleeping with tricky overheads and lows, but shes not all that good at putting on pressure, lacking any solid block strings that could keep an opponent on the defensive and guessing. Sindel can also be very sneaky. Her first competitive variation, which is the one I personally have the best time with, has a move called Whip & Flip. This flipping hair whip can be aimed close, medium, or far and allows her to leap over projectiles for a quick overhead throw that gives her free wake up pressure if it lands. But the best part about this move is that she can use it from the air as well, allowing her to alter her jump arc, bait out anti airs, or  if youre feeling lucky  you can use it after a jump-kick to try to catch an opponent trying to switch to a low block. Her second competitive variation plays completely unlike anything else in Mortal Kombat 11. It revolves around an aerial Banshee Dash that sends a ghost forward in the air and, if it hits, Sindel can spend a bar of meter to instantly teleport to it and start up a jump-in combo. But then its also complemented by an ability called Deadly Echo that allows her to cancel a jump in, do a quick air-hop, and do another jump in. It allows for some absolutely crazy combos that are extraordinarily tricky to do, but look stylish as all hell. For those who truly miss Sindels zoner-heavy playstyle from MK9, her third competitive variation is the closest thing her latest iteration has to it. Shes got a great low projectile that can duck under opposing projectiles and win trades, an aerial projectile barrage that completely controls the mid-range, and a floating trap that will deal unblockable damage to anyone who gets close to it, allowing her to discourage her opponent from getting anywhere near her, or trap an enemy in a corner with unavoidable damage. Each of these three variations represents an entirely different style of play, and whats great is that theyre all fun to use and extremely effective in their own way. This is exactly how the variation system is supposed to work. Sindel has absolutely crazy combos that are extraordinarily tricky to do, but look stylish as hell. As far as style goes, Netherrealm once again does not disappoint with this reimagining of Sindel. Her hair is obviously the most important feature, and it succeeds at simultaneously looking realistic and otherworldly in the way it grows, shrinks, and wraps around its victims. Shes also got a great selection of unlockable outfits and gear that feel befitting of Mortal Kombats premiere Queen. Its also notable and a bit disappointing that her story ending retcons what has long been the history of her character. It removes any sort of gray area to her personality and essentially just makes her pure evil, flattening a three-dimensional character into a two-dimensional villain. Sindels return in Mortal Kombat 11 is a triumphant one, and Netherrealm continues its excellent track record of DLC characters in this first Kombat Pack. Sindel feels completely unique from the rest of the cast, with a keepaway style that allows her to threaten heavily from the mid-range with fun and inventive combos that deal massive amounts of damage. Her story retcon is disappointing from a lore perspective, but that seems like a problem for a future Mortal Kombat story mode to deal with. For now, Mortal Kombat fans rejoice: your Queen has returned.", "date": "Nov. 28, 2019,"}