{"name": "Shenmue III", "name_review": "Shenmue 3 Review", "ref": "https://me.ign.com/en/shenmue-iii-rumored/167883/review/shenmue-3-review", "text": "The story of Shenmue began 20 years ago, and for its time the original game was an undeniable marvel in video game storytelling and world-building. You lived Ryo Hazukis life, developing relationships and maintaining a day job in your Japanese hometown, all while trying to track down your fathers murderer so you could extract vengeance. Time has not been kind to that original game, nor its 2001 sequel, as video game stories and performance capture tech have improved drastically. In many ways, Shenmue 3 is a stark reminder of the leaps and bounds developers have made in the last 20 years. Thats not to say there isnt a compelling experience here  it just feels out of time and doesnt reward the Shenmue faithful with meaningful revelations in the story. The good news is that nearly everything about Shenmue 3 improves on the two games that came before it in some way. The structure of the gameplay is streamlined, combat isnt as overcomplicated (but still remains challenging), training and improving your abilities makes more sense, and making progress is just generally better. I rarely, if ever, found myself stuck and unsure of where I needed to go next in the way I often did when playing the first two adventures. Shenmue 3s overall look represents a huge improvement, with the picturesque countryside of Bailu Village standing out in particular. That said, character movement is stiff and their designs are inconsistent, with some folks looking realistic and others looking like cartoon characters  which is pretty standard for Shenmue, to be fair. All of that is good news for committed players who love the series and have eagerly been waiting 20 years to see what happens next, but there is no denying Shenmue 3 feels like it should have come out in the mid-2000s. It seems incredibly dated compared to modern contemporaries.It begins exactly where Shenmue 2 left off by recreating that games final moments in this brand-new engine, which functions well as both a quick recap (a good, longer recap is available in the start menu, too) and table setting for what you can expect visually. From there, you learn your new goal: to track down your friend Shenhuas kidnapped father so you can continue your journey to find your fathers murderer, Lan Di, and finally, hopefully, kill him. The starting town, Bailu, is the more interesting of the two areas you explore, which you do as you quickly get down to the business of asking literally everyone for information about Shenhuas dad. The voice acting for all of these conversations is hilariously bad across the board. I laughed at many line deliveries that were not meant to be funny throughout the approximately 40-hour journey, and though that makes Shenmue 3 fit perfectly next to its predecessors, it also makes it seem incredibly dated compared to modern contemporaries that similarly focus on dialogue and story. The performances may be lacking, but I did appreciate that you can talk to literally everyone you encounter (with a few exceptions in the second area, Niaowu) and have a conversation about your immediate goal. That thorough amount of dialogue was an impressive feat 20 years ago, and its one of the few things thats still impressive today. They may be generally shallow and one-note characters (even the important ones), but the fact that everyone has at least that single note makes the world feel more alive and real. That said, talking to everyone without being able to skip through lines of dialogue (unless theyre repeated conversations, like the hotel clerk who demands payment for your room every day) can be tedious, and the way you make your way down checklists which fling you back and forth across the large areas is frustrating. I spent too much time driving a forklift at my job and gambling after hours to make money to buy things that would open up training opportunities, only to have that lead to more traipsing across the city. Shenmue 3 is less about figuring out what you need to do next and more about asking people where poorly labeled landmarks are located so you can talk to the important people who are standing there waiting for you. Shenmue 3 does at least borrow Shenmue 2s system that helps alleviate the periodic need to wait out the clock for specific events by letting you skip directly to important sequences when you find out when theyre happening, which I am grateful for. Even though I like this combat system, I still struggled to enjoy the actual fights.The combat is all hand-to-hand against various thugs and its challenging, but not in any particularly fun or rewarding sort of way. The detailed combos of the first two games have been abandoned, which is a big improvement: instead of memorizing button inputs for a specific move and then spamming them in an abandoned parking lot by yourself to improve them, now you can spar with other people to level up those moves and map them to a hotkey. But even though I like this system, I still struggled to enjoy the actual fights. On every difficulty, your opponents block constantly and it made me feel like I was punching a wall until they relented, as opposed to most modern games where you need to watch for openings and dig in with precision. I also ran into more than one occasion where I was unexpectedly thrust into a combat scenario without a chance to eat some food to replenish my health first, which is unfair considering a loss means having to start the fight over. The other essential element of self-improvement, the crucial training to improve your health, is boring. All you do is perform minigames like maintaining a squat stance or walking around in a circle over and over for small boosts. I ended up doing them a lot because the bonus health was valuable, but I did so over my protests. At a certain point, I think I would just rather watch a cutscene.When youre not throwing out punches and kicks, youre participating in QTE sequences. As a preface, I actually like QTEs when theyre done well. But while Shenmue 3 executes on the basic premise by letting you participate in well-choreographed chase sequences and cinematic sparring, there is basically no punishment for failure. A missed QTE prompt in previous games was scary because it would sometimes force you to wait a whole in-game day to try again, but here the prompts just restart. Id often just memorized the sequence after a few tries and, at that point, all intensity and danger was lost. I would rather have the latter between the two options, but at a certain point, I think I would just rather watch a cutscene. The plot is arguably the main draw of Shenmue 3, and thats why its so sad that after waiting for two decades, the story doesnt feel any closer to a conclusion by the time the credits roll after around 40 hours. For all of its story and dialogue, so much of it feels inconsequential and unrelated to the larger conflict until the final moments. At that point it delivers an eye-rolling, completely unearned final-act twist before the climactic confrontation and then, without spoiling anything, it feels like it takes a frustrating shuffle backwards as opposed to taking the large step forward I wanted from what may be the last Shenmue game we ever get. I went in with low expectations for resolution, and even then they were not met. Shenmue 3 feels like its from a different era  a step forward from its ambitious action-adventure predecessors but still about five steps behind modern games. In everything from its laborious progression to its abysmal voice acting and clumsy combat, its ignored the innovations of the past 20 years and kept doing its own thing. This direct continuation of Shenmue 2s story and gameplay did feel like coming home for someone who had all but given up hope of ever returning to Ryo Hazukis world, and for that reason, I am glad Shenmue 3, in all its oddity, exists. I just wish it had given me the satisfying story I returned for.", "date": "Nov. 23, 2019,"}