{"name": "Queen & Slim", "name_review": "Queen & Slim Review", "ref": "https://me.ign.com/en/queen-slim/167772/review/queen-slim-review", "text": "The building of a legacy can best be compared to the building of a house: every brick, nail, and piece of material come together to form the finished product. The house itself is wonderful, but it truly lacks purpose without being used and lived in by people. The same goes for legacy: who you impact and what you leave inside of people is how you fortify purpose. Queen & Slim, directed by Melina Matsoukas and written by Lena Waithe, on the surface is a thriller following a Black couple after their first date on the run after accidentally killing a white police officer. But digging deep, the film puts into perspective Black legacy, the pain attached, and how we immortalize our members of the community. Like Uncle Earl (Bokeem Woodbine) jokingly does in the film, its low-hanging fruit to strictly characterize this couple as the Black Bonnie and Clyde. Monikers aside, theres more to them than the incidental crime they committed. As a unit, actors Jodie Turner-Smith and Daniel Kaluuyas chemistry crackles in every frame with a combined performance thats potent with fear, conviction, and adventure. But examined separately, they deliver something fluid and raw. Turner-Smith is the relative newcomer to film, known for her television appearances in shows like Cinemaxs Jett and Syfys Nightflyers. She naturally commands attention on the screen, playing a woman whose tragic experiences have left her rigid. Her antithesis is Kaluuya, who plays a different character from his notable roles in Get Out and Widows. Here, he plays a man of faith, whos unraveling at the seams. Its yet another performance from Kaluuya that leaves no room for doubt that he is a leading man. Both actors performances are enhanced by Waithes succinct script which provides opportunities for both actors to showcase their range through lighthearted - sometimes absurd - moments in their journey. While still on the run, for example, they drive past a horse stable. Determined, Queen convinces a visibly fearful Slim to ride one of the horses. Its a pure moment of unbridled joy; not only does it provide much-needed levity but serves as a reminder that Black joy can be created from the darkest of places. With these two elements alone, you have enough gas to fuel a powder blue Cadillac-of-a-film. But its Melina Matsoukas stellar direction that brings the octane. Matsoukas has had a storied career as a director of television and music video, particularly known for her standout collaborations with Beyonc. Similar to her direction of Formation, Matsoukas grounds her vision in memorable portraits dripping in Blackness. Cinematographer Tat Radcliffe brings this vision to life with his mix of dreamy, aerial shots during their road trip to up-close character shots that focus for long beats. Places, where the dialogue may be limited, dont feel empty; and thats thanks to this directors ability to make statements without words. This is especially profound due to whats going on in todays society. There are countless Black lives that are introduced to the mainstream, and not because of their words, but because of a video or photo of their demise by the hands of police brutality. Mike Brown, Tamir Rice, Rekia Boyd, Atatiana Jefferson, and many others are immortalized by their deaths. And while their legacy could be cemented because of pain, its the community that prevents these people from becoming folklore - we say their name and the lives they lived. Queen & Slim challenges you to see beyond the road trip and ride with two Black people who are racing against being immortalized early. Its a sobering thought overlayed with real-life events. But this opens the opportunity to see how our legacy doesnt crystalize at death, it starts at life. And the people we touch along our journeys are what make our lives meaningful. Melina Matsoukas film directorial debut stuns with its memorable vignettes. A thrilling ride, Queen & Slim serves a reminder that a Black person's journey is equally as important as how it ends.", "date": "Nov. 19, 2019,"}