{"name": "Splatoon 2", "name_review": "Splatoon 2 Review", "ref": "https://me.ign.com/en/spaltoon-for-nintendo-switch/135378/review/splatoon-2-review", "text": "It feels as if the paint had just begun to dry on Splatoon after its release on the Wii U in 2015 when Nintendo applied a fresh coat and relaunched it with Splatoon 2 on the Switch. That may be why this sequel feels less like a whole new game than a new version of the first one that rolls up the best post-launch updates to the colorful and adorably non-violent team-based shooter and adds some new toys. Of course, considering the first game is a lot of fun, thats not necessarily a bad thing, especially if you missed it for lack of a Wii U. And despite some questionable choices that can leave you trapped in matchmaking purgatory, the addition of a standout and clever take on a co-op horde mode provides some seriously addicting fun that has me coming back for more. Like its predecessor, Splatoon 2s emphasis on using vibrant, ink-based weapons to splatter both enemies and the ground alike in your team color to control territory makes it a distinctive kind of visually rewarding fun. Controlling the ground is more than just a way of keeping score, though  youre far more mobile in your own territory, creating lots of opportunity for strategies around creating a highway to an objective and cutting off your opponents, and also setting up areas to submerge into the ink and replenish your ammo. The key to victory on the eight distinct and symmetrical maps currently in rotation often lies in being aware of terrain, ink management, and the oppositions plans. Between the original arsenal, the guns added in post-launch updates, and the new ones introduced in Splatoon 2, theres plenty of ink-based weaponry to choose from, and yet each type has distinct uses. Theres the fast and furious Inkbrush that covers ground quickly, contrasted with the Slosher that manages to turn a literal bucket of ink into a deadly close-range weapon. One of my favorites of the new batch is the Dualies, dual-pistol style weapons that have a great rate of fire and also let you quickly dodge-roll when firing to strafe enemies and release a concentrated burst of ink. Theres also a brand-new array of special weapon powerups, many of which work well with proper coordination to break stalemates. The protective Ink Armor shields your entire team from harm, while the Tenta Missiles can lock onto and fire a salvo of ink strikes on multiple enemies. Obtaining new gear is a smoother process than in the first game. Going hand in hand with Splatoon 2s wealth of weapons is a set of gear that provides both style and bonuses in combat, with the added twist of over 20 random secondary abilities that unlock after youve battled with them equipped enough times. These range from practical effects, like increasing ink recovery rates, to highly specialized abilities that can track the enemy who last splatted you or players youve recently hit. Obtaining new gear is a smoother process than in the first game, too  you can now order any gear youve seen on other people in-game using currency earned from battle, though the abilities attached to yours might not be the same due to random generation. Paying to scrub unwanted extra traits to make room for new ones leaves chunks of those abilities behind to apply to other gear, letting you mix and match from your inventory, or you can try your luck at unlocking different bonuses to replace the old ones that better align with your playstyle. This is a good way get value out of gear you earned but dont plan to wear: by scrubbing enough ammo-conserving bonuses from gear I wasnt using, I was then able to apply that trait to my favorite jersey (for a hefty price). Offering the chance to craft the perfect gear for your playstyle to give you a better edge in the more competitive Ranked Battles has kept me more invested than I was in the first Splatoon. Aquatic Ambience With a world this colorful and fun, its great to see how much better people and places look on the Switch. Characters like the weapons dealer Sheldon and clothing merchant Jelfonzo look better than ever with more detailed models and textures, and the various forms of street art and graffiti scattered around the maps pop. The ink itself shimmers and glints with shiny flecks. Despite it all, Splatoon 2 never failed to maintain a smooth 60 frames per second in battle even with ink flying in all directions in a fully populated eight-player match. In handheld mode, things look great, and the option to set sensitivity for both modes of play helped immensely when switching between handheld and docked mode. I actually ended up swapping between motion and non-motion controls with surprising ease (though not being able to use the control stick to look up and down with motion and controls does take getting used to every time). Solo Artist Splatoon 2 brings back a very familiar and simple 32-mission single-player campaign that, with some exceptions, follows the style of its predecessor almost to the letter. Theres a fair amount of hand-holding and will only take six or so hours to run through and find most collectibles, but missions provide some pretty fun ideas to play around with. There are places to stylishly grind on ink-rails like a squid version of Tony Hawk, and elsewhere you can lure giant, ink-vacuuming Squee-G robots into your enemies path. Spraying ink to activate expanding sponges or moving platforms gives it a light Super Mario Sunshine feel, but it rarely challenges you the way co-op and multiplayer do. The most significant improvement over Splatoon is that the sequels campaign lets you try out each of the weapon types, which is a great way to learn about their potential and how they can be used in multiplayer before jumping online. This focus on weapon research greatly extends replay value, as you can head back into levels youve already conquered to discover new challenges based on the weapons strengths and limitations. Heading into Splatoon 2s main lobby lets you queue up for an engaging variety of online modes. Each mode automatically drops you in one of two maps that change up every two hours, which keeps things feeling fresh and doesnt let a map wear out its welcome as quickly as in other games, where the community often picks a favorite and plays it to death. The standard Turf War mode, which carries over from the original, is welcoming for beginners and veterans alike with the simple yet entertaining concept of competing to ink the most territory in three minutes. No two matches ever feel the same because the battlefield hotspots  dictated by the competing colors of ink  are constantly changing, and several times being at the right place at the right time was what narrowly pushed our team to victory. This is one case where I actually miss the Wii U gamepad  without the second-screen map or an always-on-screen minimap, you have to hold a button to overlay a map to see how things are going or jump to a teammates location. This means youll need to be that much more alert to the status of your team and the terrain, and finding a safe spot to check the map overlay took some getting used to. Being at the right place at the right time was what narrowly pushed our team to victory. Besides Turf Wars, Ranked and League Battles are where more precise and objective-based modes await. Theres a king-of-the-hill-inspired Splat Zone, a tug-of-war style payload mode called Tower Control, and a spin on capture the flag where you carry a powerful but movement-impeding weapon to the enemy base called Rainmaker. Splat Zone is the most basic of the trio, and I prefer the modes where teams fight over a moving target like the mobile tower in Tower Control, and the Rainmaker weapon that was constantly changing hands. Even when both teams are working well together and locked in a tug-of-war for control, matches move at a quick pace, which prevents drawn-out stalemates. Even though Ranked Battles rotate between modes every few hours, Im glad each mode has their own ranking system so I can see which modes Im best at and where I need to improve. The only real problems Ive encountered so far are the lobbys matchmaking system and the lack of a between-match loadout screen. Like in most games, once youve picked your mode of choice youll be sent to a room awaiting seven more players to begin. The catch is that nobody can cancel out or do anything else (such as the minigame the first Splatoon gave us to kill the time here) until either the match fills up or the timer runs out a couple of minutes later. Even if your group does fill up fast (which we can assume will be more likely after launch) and you get to play a round, you're still left with the problem of being unable to swap out weapons and gear between matches. I dont mind not being able to switch during a match because that makes you carefully consider your choices and commit to the role your weapon fills, and the matches arent that long to begin with. But after playing with a great group and leveling up, the last thing I want to do is ditch them just so I can put on a new pair of shoes. Cooperative Calamari Where Splatoon 2s single-player campaign gently guides you through Octoling enemies, the new Salmon Run mode is an excellent cooperative foil. As hilarious as it is addicting, this mode puts you and up to three other players up against three timed waves of relentless enemies while collecting a quota of golden eggs from boss creatures and depositing them in a basket. Unlike other horde modes, Salmon Run deftly uses Splatoons ink and territory mechanics to ensure youre not only splatting fish but also struggling to maintain control of the ground as enemies try to stifle your movement. The Boss Salmonids you face are some of the most memorable enemies Ive seen in a horde mode since Left 4 Dead, wielding trash as makeshift weapons and armor and shooting beams of ink from atop a tower of pots and pans. Their distinct looks help you assess threats quickly, which is essential because your team must neutralize them before being overwhelmed. When playing online, youll be given one of four random weapons to use for every wave, and I love how it challenged me to adapt and fill new roles on my team: In one wave I was sniping bosses with the Splat Charger, but in the next wave I had to clear a path to the egg basket with the Roller instead. Difficulty can be set when playing locally, and steadily grows when online thanks to the randomized nature of enemy waves and weapon loadouts, boss configurations, and special events like rising water levels or egg-stealing mothership invasions. Those shifting conditions kept me coming back to see what would happen next. The Boss Salmonids you face are some of the most memorable enemies I've seen in a horde mode since Left 4 Dead. Playing locally with friends is a blast  my teammates and I frantically screamed out boss names and locations of golden eggs to direct each other to counter problems and capitalize on opportunities. But this also highlights how key communication is to survival, something that doesnt currently translate well in random online matchups, where you can only give basic callouts. Fortunately, with Nintendos new companion app you can create voice chat groups with friends on your phone - but there are some significant problems. While you can check out nifty details about matches and order more gear from your app, the voice chat system feels woefully lacking. You can only chat with friends in certain modes, and while chatting your phone cannot be used for anything else (even turning off the screen will mute all conversation). Given that the app wont let you talk to friends outside of specific lobbies, and that Im not a fan of having my phone battery drained by a screen that cant be turned off, Im much more inclined to use Skype or Discord to talk with friends. And speaking of bizarre catches: for some reason, the excellent co-op mode can only be played online on certain days for specific amounts of time  for instance, 5:00AM to 5:00PM  which is truly frustrating considering just how fun it is. After a fun weekend playing with friends, finding out I cant play again for two days can get annoying, especially when I cant discern any rhyme or reason to the Salmon Run schedule. Not being able to easily remember the next available slot time forces me to constantly check in-game for the next five openings. I get that Nintendo wants to ensure full rooms on the days Salmon Run is active, but this seems like a poor way to do it. Id rather have the option to queue up with friends online or have a way to easily back out if nobody is around to play with (going it alone is pretty much a death sentence). On the days the mode is active, you can earn quick rewards not found anywhere else which is a nice bonus; if you choose to play locally you can play as much as you want, but it takes much longer to earn bonuses. Theres a lot to love in Nintendos second iteration of its quirky shooter, especially the way Splatoon 2 emphasizes splatting the ground just as much as it does inking your opponents. The new additions to its single-player campaign and multiplayer modes are a step in the right direction, but it still has some work to do to make joining online games and voice chat less of a hassle. Still, with an addicting new Salmon Run co-op mode and the promise of free updates like the ones that helped the original Splatoon come into its own, I expect Splatoon 2 to keep me hooked.", "date": "July 25, 2017,"}