{"name": "Lenovo Legion Y545 Gaming Laptop", "name_review": "Lenovo Legion Y545 Gaming Laptop Review", "ref": "https://me.ign.com/en/lenovo-legion-y545-gaming-laptop/167414/review/lenovo-legion-y545-gaming-laptop-review", "text": "Lenovo's Legion line is, for the most part, priced at the affordable end of the gaming laptop spectrum. That is, you can get a decently specced laptop that can play most games over 60FPS without any hiccups for under $1500. The Lenovo Y545, which were taking a closer look at here, is priced even more aggressively at under $1000, and offers over 100FPS in games like Apex Legends. What makes the Legion Y545 appealing is that it can be equipped with Nvidia's GTX 1660 Ti, which leverages Nvidia's Turing architecture (sans real-time ray tracing), providing a performance boost without adding to the cost. Of course, if you want to pay more for an RTX graphics card in the Y545 you can, with the RTX 2060 currently listed as an option. But as you'll read below, you may want to save your money. Here are the specifications of the Lenovo Legion Y545 we're specifically evaluating here: Model: Lenovo Legion Y545 (81Q6) Display: 15.6-inch FHD IPS (1920 x 1080) Graphics: NVIDIA GeForce GTX 1660 Ti w/6GB GDDR6 Processor: Intel Core i7-9750H at 2.60GHz (Hexa-Core, 12MB Cache, up to 4.5GHz w/ Turbo Boost) Memory: 16GB DDR4 OS: Windows 10 Home Storage: 128GB NVMe SSD, 1TB 7200 RPM HDD Ports: 3 x USB 3.1 Gen 1, 1 x USB-C, 1 x HDMI, 1 x miniDisplayPort 1.4, 1 x Ethernet, 1 x audio in/out Connectivity: 802.11ac Wi-Fi, Bluetooth 5.0 Web camera: 720p Dimensions: 14.22 x 10.5 x 0.97-inches (WxDxH) Weight: 5.1 pounds Price: $999 Lenovo Legion Y545 - Design The Y545 isn't huge, but it's not impressively thin either like a Razer Blade. It's of average size for a 15-inch laptop. It measures 14.22 x 10.5 x 0.97-inches and weighs 5.1-pounds. You'll notice when it's in your backpack or bag, but you're not going to be weighed down by it. Carrying it around the house, I found it portable and not as unwieldy as, say, the Predator Triton 900. The entire housing is a dark grey, save for the Legion logo on the lid. The logo lights up when you open the 15.6-inch FHD IPS display, as does the power button that's centered just below the display. Right above the power button is the 720p webcam, that almost blends into the bezel under the display. It took me a few minutes to find it once I realized there isn't a camera in the normal spot above the screen. The biggest downside with placing the camera below the display is feeling like everyone you video chat with is looking up your nose, instead of being closer to eye level. I'm still fond of Lenovo's approach to putting the majority of ports on the back of their gaming laptops. On the back of the Y545, there are six ports -- a USB-C, MiniDisplayPort, USB 3.1, HDMI, Ethernet, and the charging port. On the left and right side, there are three ports in total. A USB 3.1 port and an audio jack are on the left side, with another USB 3.1 port on the right side. The ports on the back of the laptop are those that you'll typically plug in and leave plugged in -- whereas the USB ports on either side come in handy for a gaming mouse or portable external drive. It provides a cleaner look when your laptop is connected to a bunch of stuff on your desk. The keyboard is backlit, but with white lights across the board. To the right of the main keyboard is a miniature number pad that takes some getting used to, to make room for directional arrows. The keyboard itself is spacious, with keys that have a nice smooth feel to each press. The keyboard, even when gaming, is fairly quietsomething roommates and coworkers will surely appreciate. There's nothing fancy about the Y545's design, and there's nothing wrong with that. It's a nearly all-black gaming laptop with a little personality on the lid, and that's it. Lenovo Legion Y545 - Performance and gaming The Y545's spec sheet reads almost identical to the Helio 300's, save for storage space. Inside the Y545 is an Intel Core i7-9750H, 16GB DDR4 memory, a GTX 1660 Ti, 128GB SSD, and a 1TB HDD. Because of their similarities, I put the Y545 up against the Helios 300 and kept the Razer Blade 15 on the benchmark comparison. As you can see, the Y545 and the Helios 300 kept pace with one anotherand mostly beat the RTX 2060-equipped Blade 15. Both GTX 1660 Ti laptops are priced within a couple of hundred dollars of each other, making either one a compelling pickup. As for real-world use, I spent the vast majority of my time playing Apex Legends. In Apex with everything set to high, the Legion Y545 hovered right around 100 frames per second at 1080p.. Even though the GTX 1660 Ti doesn't have dedicated ray tracing cores, I also spent a lot of time playing Battlefield V. I left the graphic settings to Ultra, out of habit, and the Y545 stayed right around 60FPS. At one point I bumped it down to High, and the result was around 70FPS. I could tell real-time ray tracing wasn't present after reviewing so many RTX-equipped machines, but at the end of the day, it doesn't make or break the experience. Though it certainly adds to it. The fans aren't terribly loud, even with the system's thermal mode set to performance. The speakers are loud enough to overpower the fans, but the sound quality from them is just OK. The sound isn't as crisp and clear as I'd like, but if you're gaming a lot, you're likely using headphones anyway. If you opt for a Y545, I wouldn't go with the storage configuration on the review sample I received. 128GB SSD is handy for core files, but it's not near enough space to store more than one AAA game. A system with a 256GB SSD at the minimum would be the route I'd go. The 1TB HDD is nice to have for extra storage, however. Lenovo Legion Y545 - Battery life The Legion Y545's battery is a bit of a letdown, only because the similarly equipped Helios 300 had previously set our expectations. The Y545 lasted 108 minutes when looping a video with the display set to 50% brightness, Bluetooth and location turned off, but Wi-Fi left on. That's long enough to get through a short movie, but not much more. The Helios 300, on the other hand, lasted 136 minutes in the same testa noticeable 23% difference Lenovo Legion Y545 - Software Lenovo takes a somewhat light approach to preinstalled software on the Y545, not counting McAfee LiveSafe. But that's to be expected with a gaming laptop that's priced right around the $1,000 mark. In addition to the intrusive antivirus software, Lenovo's Vantage app provides system stats at a glance and controls for things like changing thermal mode (to boost performance) or check for system updates. There's nothing fancy about the Y545's design, and there's nothing wrong with that. I didn't spend much time in the Vantage app, mainly because I didn't have a reason to use it outside of checking for system updates. The Y545's keyboard doesn't use RGB lighting, so creating or setting keyboard themes isn't possible -- you can't set macros, or create system profiles that launch when you open a game. If I had to choose between the Helios 300 and the Legion Y545, I'd be hard-pressed to pick. They are both stellar machines for a stellar price. I might lean slightly towards the Helios 300 simply because of the distinct difference in battery life. Although, if you can find the Legion Y545 at the $949 price that it sometimes lists for, then it's a steal and something you should jump on if your budget is around the $1,000 mark.", "date": "Nov. 12, 2019,"}