{"name": "His Dark Materials: Episode 1", "name_review": "His Dark Materials: Episode 1 Review", "ref": "https://me.ign.com/en/his-dark-materials-episode-1/167193/review/his-dark-materials-episode-1-review", "text": "This is a mostly spoiler-free review of His Dark Materials Season 1, episode 1, which premiered on BBC One in the UK on Nov. 3 and HBO in the US on Nov. 4. His Dark Materials fans have been hurt before. New Line's 2007 adaptation of the first book in Phillip Pullman's young adult series boasted an impressive cast and the budget necessary to bring the world to life, but they squandered those riches on a story that didn't dare address the book's more free-thinking themes. Thankfully, co-producers the BBC and HBO have learned from those mistakes to deliver both spectacle and story in their adaptation. For those who haven't read the books, His Dark Materials takes place in an alternate world where the human soul manifests as an animal companion called a Dmon, its form ever-changing during childhood before settling on one in adulthood. This world is ruled by the Magisterium, a theocratic government that suppresses free thought everywhere save for scholastic institutions, and even then, with strict guidelines forbidding outright heresy. The story follows Lyra (Dafne Keen), a young girl left at Jordan College as a baby by her uncle, noted explorer Lord Asriel (James McAvoy). The pilot throws a lot of mythology and world-building at viewers up front, so if youre not familiar with the source material, this approach might make your head spin, but stick with it and youll be rewarded with a rich world that grows far wider and deeper as the story progresses. Lyra is restless and thirsts for adventure in the world outside Jordans oppressive walls, but usually has to settle for chasing her friend Roger across the rooftops of the college, since her uncle is, to put it mildly, distant both physically and emotionally. Once Asriel returns for one of his intermittent visits, Lyra learns of a recent discovery he has made in the frozen North: the existence of parallel worlds, which is tied to a mysterious substance called Dust. Dafne Keen acquits herself well as Lyra and it's easy to see how the feral energy she brought to Laura in Logan will assist her going forward, only now with the benefit of more dialogue to compliment her physicality. James McAvoy's Asriel is intense and driven, and he's clearly having fun playing a character so self-assured and zealous in his hunt for the truth. Immediately, His Dark Materials feels like a living world full of danger and intrigue. Asriel's discovery directly contradicts Magisterium doctrine, and agents of the organization are already moving to silence him. More than that, this discovery provokes an attack on Asriel by one of his own allies, quickly establishing that trust is in short supply in this world. These scenes provide some of the best assurance in the pilot that the showrunners are tackling the more mature aspects of His Dark Materials with resolve. Thats reassuring this early on, as Lyras journey in the novel eventually sees her face moral quandaries with world-altering ramifications. If the show were to be flinching on something as quaint as an attempted poisoning, it wouldnt be an encouraging sign that theyd handle the high-concept finale of the series well. Despite Asriels groundbreaking discovery, it's Lyra's journey, but frustratingly, her perception of these conflicts is limited by virtue of the fact that Asriel refuses to tell her the truth about his mission. That feeling of being trapped at Jordan College leads Lyra right into the arms of Ruth Wilsons Mrs. Coulter, a mysterious scholar whos a little too eager to take the girl on as her ward. It's clear that she's a force to be reckoned with, her sweet demeanor unquestionably hiding darker motives. Wilson brings a necessary magnetic quality to Mrs. Coulter, and just as Lyra discovers, its hard not to hang on her every word. Lyra is clearly enamored with the idea of having a female role model after having been raised almost entirely by men. The fact that Wilsons Mrs. Coulter is obviously exploiting that makes you afraid of her and afraid for Lyra. The series premiere is well-paced and economical, introducing only the lore it needs, rather than trying to cram witches, armored bears, and Lin-Manuel Mirandas into the first hour. That's not to say book fans won't be able to spot seeds planted for later storylines, as the set decoration and even the opening titles reward eagle-eyed attention. If any part of the opening hour distracts, it's the storyline involving the water-faring Gyptian community and the losses they're incurring at the hands of a shadowy gang of kidnappers called the Gobblers. The Gyptians and Gobblers have an important part to play, and this point in the story is really the only place to introduce them, but the awesome scope and implications of Asriel's discovery still pull focus from what's going on down on the riverfront, and those scenes feel unavoidably shoehorned in. The BBC and HBO clearly spared no expense realizing Lyra's world. The visual effects that bring the Dmons to life feel natural, and their inclusion here is seamless. You'll see Pantalaimon, Lyra's Dmon, notice something out a window, only to have Lyra herself notice it moments later, with no words passed between the two. It's small touches like this that really sell the Dmons as an integral and intriguing part of this world rather than a gimmick. The same attention to detail goes for the feature film-quality production design. From the grandeur of Jordan College to the grimy docks of Oxford, everything has a lived-in feel that helps the more fantastical elements seem plausible. It'll be interesting going forward to see if the series can maintain this impressive scale which, like the book's more adult themes, only grows as time goes by His Dark Materials' first episode sets the stage wonderfully for what's to follow. Benefiting from an unflinching respect for the source material, strong visual effects, and a talented cast, the show establishes itself as an engrossing fantasy for both children and adults. Lyra's adventure only gets bigger in scope going forward, but if the series can manage to keep up, it feels like an adventure we'll be happy to go on with her.", "date": "Nov. 5, 2019,"}