{"name": "Black The Fall", "name_review": "Black: The Fall Review", "ref": "https://me.ign.com/en/black-the-fall/135477/review/black-the-fall-review", "text": "You'll be forgiven if you look at a screenshot or video of Black: The Fall, rub your eyes and, for a moment, think you're looking at Inside. In fact, I spent my first several hours of playing Black a little angry at the gall it had to so blatantly follow in Playdeads footsteps. Some of that faded away as it introduced a few ideas of its own, but Black never comes close to living up to the comparison it forces you to draw. Who knows if Black was in development prior to Inside's release or not, but in coming out a full year later, one can't help but compare one to the other. Like Inside (and I mean exactly like Inside), Black: The Fall is a monochromatic side-scrolling puzzle-platformer where your nameless protagonist is dropped into a massive, gloomy industrial complex full of gruesomely lethal traps with no context or explanation whatsoever. Black does, at least, add a couple new wrinkles to its puzzles: early on, youll acquire a laser pointer used to take control of enemies or cause distractions. Soon after that, you get a robot dog sidekick who youll need to solve some of Blacks more difficult puzzles and is The Falls most interesting gameplay hook. Those puzzles run the gamut from dead simple to multi-layered challenges. Its a good mix. The times I did get stuck, the solution usually ended up being some subtle environmental interaction Id just mistaken for part of the background rather than a failure of puzzle-solving logic on my part. Also, its rough animations and mediocre graphics stand out more than normal because you cant help but compare it to Insides near-perfect polish. Again, Black makes it all but impossible not hold the two up, side-by-side. Though Black deserves credit for adding new puzzle mechanics along the way, it couldve easily seen its 6-8 hour runtime chopped in half and still gotten its message across. That entire time I found myself wondering if, like Inside, Black would have anything to say. When I finally discovered its message at the end of the campaign, it did inspire me to look up the real-life issue it was drawing attention to and learn more about it. I applaud it for that. Sure, it couldve done so with a bit more subtlety  it's a bit heavy-handed at the very end  but at least Black does have a point to make. Its just a shame that it wrapped that in a game thats so shamelessly and distractingly derivative.", "date": "July 21, 2017,"}