{"name": "Maleficent: Mistress of Evil", "name_review": "Maleficent: Mistress of Evil Review", "ref": "https://me.ign.com/en/maleficent-mistress-of-evil/166645/review/maleficent-mistress-of-evil-review", "text": "It's been five years since Angelina Jolie took on the iconic role of Maleficent, reimagining the stylish but one-note villain from Disney's classic Sleeping Beauty for a whole new generation. Its sequel, Maleficent: Mistress of Evil, is a definite step up from the first movie by expanding the story beyond its fairy tale inspiration and bringing in compelling new characters (and actors to play them), though it is held back by pacing issues. The first movie expanded on the fairy tale by introducing a backstory that saw the horned fairy betrayed by the ambitious and cruel man that she once loved so he could become king, and eventually having her become surrogate mother to Aurora (Elle Fanning). Though you don't need to have seen the first film to enjoy Maleficent: Mistress of Evil, this sequel gets the audience up to speed from its opening ~Once Upon a Time~ intro. It follows on directly from the end of that fairytale with Aurora living as the Queen of the Moors (the fairy folk), but both their lives are upended when Prince Phillip (Harris Dickinson) asks Aurora to marry him, setting off a devastating chain of events. Though the film sticks to the world established by the first film, the creative team does an incredible job of creating new expansive spaces as well as introducing an entirely new cast of characters in the Dark Fae. Led by Chiwetel Ejiofor and Ed Skrein -- both made up in impressive practical makeup -- the new creatures give the story of Maleficent a new, interesting angle and the filmmakers the chance to craft multiple gorgeous new facets to the already impressive world. The Dark Fae and their journey are one of the strongest parts of Maleficent: Mistress of Evil and it's a shame that they don't play a larger role, though the film does leave that open for a potential third entry. The human cast here is also impressive with Jolie returning to camp it up as the knife-cheekboned dark fairy, and Elle Fanning as charming as ever as Aurora. The big get here, however, is Michelle Pfeiffer who excels at bringing to life the new and potentially dangerous Queen Ingrith, the mother of Prince Phillip and potential new in-law of the girl once known as Sleeping Beauty. Pfeiffer is a joy to watch as she dazzles in the astonishing costuming by Ellen Mirojnick, and flits between maternal warmth and militaristic brutality with ease. Director Joachim Rnning has a deft touch when it comes to visualizing these near unimaginable worlds of Maleficent, and there's plenty to ooh and ahh over as the film both figuratively and literally swoops through the subterranean nests of the Dark Fae and up into the skies above Queen Ingrith's towering castle. Where the film may lose some viewers is the narrative; once again, this tale of Maleficent is more of an atmospheric and fluid exercise, more interested in the fairytale universe it inhabits than the sometimes predictable story it's telling. This sometimes works to its advantage, but occasionally leaves the film feeling stretched out. Both the first and third act feature sequences that could have easily been tightened up and these overextended scenes bog down the movie's pacing and the audience's engagement with the story. Despite that, Rnning brings enough originality to the idea of a what a ~Once Upon a Time~ can lead to that it'll keep most audiences engrossed, and the cast of creatures and their co-starring humans elevate this to a solid fantasy watch. Something that immediately jumps out about Maleficent: Mistress of Evil is how far Disney's computer animation departments have come. The sequel visually echoes previous live-action flicks from the studio like Alice in Wonderland and, of course, the original film, but the effects have progressed by leaps and bounds. The technicolor world of the fairies is immersive and enjoyable. It looks almost real and the character work means the creatures appear kind, alive, and far less creepily dead-eyed than in Disney's previous live-action ventures. Similarly, the creature work here is impressive and a couple of the creations look like they may have been inspired by one of Disney's more recent acquisitions, Star Wars, and are a big step up from the often uncanny valley-inducing examples of past years' CGI creations. Like its predecessor, Maleficent: Mistress of Evil is an ambitious fantasy epic that sometimes loses its way when it comes to pacing and tight storytelling. Unlike the first film, though, this sequel flies outside of the constraints of the classic fairytale it's based on. Impressive visuals and a very watchable cast make this a fun popcorn fantasy flick that's at its best when it leans into its genre roots and aims to create a truly fantastical fairytale world.", "date": "Oct. 18, 2019,"}