{"name": "John Wick Hex", "name_review": "John Wick Hex Review", "ref": "https://me.ign.com/en/john-wick-hex/166273/review/john-wick-hex-review", "text": "In preparation for playing John Wick Hex I rented John Wick Chapter 3: Parabellum. That was probably a mistake. Going directly from its artful action choreography to the distractingly janky animations of this simultaneous turn-based tactics game made it harder to enjoy what it does well. Adapting John Wick to this slow and deliberate genre of game instead of the predictable shooter was an admirably bold move, but some of the risks taken did not pay off. The flat, graphic novel look is a smart and stylish choice for a game like this (aside from the odd hot-pink blood sprays). Each of the seven chapters has a distinct setting, from back alleys to nightclubs and banks to snowy exteriors, which keeps them looking fresh even though they play largely the same. John Wicks face, seen in comic book style cutscenes and cinematic replays, is frozen in a determined, stoic glower, which is in character but still seems stiff even for Keanu Reeves. He lets his guns and his fists do the talking, because while Ian McShane and Lance Reddick reprise their roles as Winston and Charon, respectively, Keanu himself mustve been too busy with Cyberpunk 2077 to appear here. Instead, Troy Baker stars as the power and revenge-hungry rebel assassin Hex, and the prequel story he tells is one of the better parts of John Wick Hex. The dialogue is better than the movies, for the most part, and the score by composer Austin Wintory sets a strong tone. Flawlessly taking out a group of three or four attackers feels great.Fighting your way through the linear series of levels definitely has its moments. Its not turn-based in the traditional sense of the term: instead, time pauses whenever you complete a move or action on the hex-based map (get it?) or spot a new enemy, giving you all the time in the world to make what would normally be a split-second decision. In certain cases, its a genuinely cool system: using the timeline at the top of the screen that shows how long your next action will take relative to the next actions of all visible enemies, you can almost always predict how a fight will go. Chaining together a series of gunshots, melee strikes, and evasions to flawlessly take out a group of three or four attackers feels great. Its even better when you take down the last guy by hurling an empty gun at him  an extremely quick attack with a longer effective range than a shotgun. Its hilarious. However, those moments are the exception rather than the rule, and most of the time the absurdly glitchy animations make what should be a graceful ballet of gun-fu look like a battle between stiff, broken action figures. Even when the repetitive strike animations or the position-reliant takedown move work correctly, theres a good chance the ragdoll animation of the dead body will cause a hand pointing a finger to rotate like a helicopter blade or a leg to jiggle uncontrollably. We see this kind of glitch occasionally in just about every game, but in John Wick Hex its almost constant. And yet the end of every level lets you put it on full display by watching a real-time replay of your successful run from close-up camera angles  this makes all of the animation snafus and mismatched sound effects even more apparent. The real-time replay of your successful run puts the animation snafus on full display.Things are kept fairly simple, by tactics game standards, because youre only ever managing a single character and your contextual attack menu never has more than a handful of options. Theres a good selection of guns, from pistols to assault rifles, though a few  revolvers and shotguns, specifically  are all but useless since they take so long to fire. Being quick on the draw is everything in John Wick Hex, and being slow means youll be shot and interrupted before you can fire. Other guns fire quickly but lock you into a long series of shots at a single target, even after theyre dead, leaving you vulnerable. Learning the nuances of each gun is one of the more interesting parts of the combat system. You do have to manage your Focus, a resource thats used to perform powerful melee takedowns, evade close-quarters attackers, or dodge-roll from a crouched position, but replenishing it is as easy as pushing a button, even in the middle of a fight. More importantly, many enemies also use Focus, and an enemy with a lot of it becomes all but impossible to shoot at any range until you get in some good punches to dizzy them up. Its a smart system that prevents you from just shooting your way through every level and forces you to get in close and engage in some John Wick-style fisticuffs. Boss fights can be kind of a joke once you figure that out. Each chapter  a linear sequence of stages  gives you some opportunity to customize things at the outset with an allowance of coins to spend on global bonuses and stashing extra weapons and bandages in each stage. In my experience, though, it doesnt make a ton of sense to spend coins on anything but the more powerful global modifiers, which can reduce the Focus cost of dodging or increase your max health. You can spend to stash guns, but I was almost never left wanting for firearms because of the piles of them dropped by dead enemies. You can stash bandages (and you should, with the leftover coins) but doing so anywhere other than the early levels is pointless because the later ones cost more and theres no limit on how many you can carry from one stage to the next. But because your health and equipment carry over within a chapter, I often ended up in a situation where I was low on health and out of bandages toward the end, with no way to get more other than restarting the entire multi-mission chapter from the beginning (and theres no menu option for that). That meant I was forced to try again and again to execute a few of the later and more difficult levels basically flawlessly. Its a blessing and a curse that enemy locations are slightly randomized on each level restart  you have to actually pay attention instead of mindlessly repeating a routine each attempt, which makes replaying more interesting but its also frustrating when you have to spend five or 10 minutes just getting back to the trouble spot where you keep dying. This inflated my completion time to around 14 hours, but if you learn to restart a stage when you take unnecessary damage early on, even when you have bandages to heal with, itd probably be more like 10. Learning to manage your health like this is counter-intuitive and makes the design idea of having persistent health feel misplaced. There's a score-chasing incentive to replay each chapter and ~earn your name~ by beating par in a time requirement, using a lot of weapon types, not consuming bandages, etc, and perfecting your performance could get you some extra mileage out of John Wick Hex. There's also the Expedited mode that limits each ~turn~ to five seconds or else the enemy gets to move for a fifth of a second while you hold still, but I didn't find that I was typically spending that long with a move anyway unless I was struggling to move the camera to a distant target, so for me it didn't do much to increase the difficulty. Its not totally fair to expect the animations of a turn-based strategy game to match up with the elaborately violent choreography of a series of action movies that is defined by little more than that, but John Wick Hex doesnt even come close. Its hard to appreciate its handful of smart ideas when every slick series of moves you pull off by deftly managing a group of enemies attack timelines is countered by a dozen other encounters that play out awkwardly due to animation glitches and a stingy persistent health system. John Wick Hex certainly does have its moments of tactical joy and tells a decent simple story, but its so consistently unpolished that its hard to appreciate them.", "date": "Oct. 9, 2019,"}