{"name": "Elite: Dangerous", "name_review": "Elite Dangerous PS4 Review", "ref": "https://me.ign.com/en/elite-dangerous/135038/review/elite-dangerous-ps4-review", "text": "As I drop out of hyperspace flight, the whine of my engines resonating throughout the cockpit of my Cobra Mk III spacecraft as they screech to a halt, a Methane Dwarf star stares back at me. The purplish light of the star bounces off the dashboard of my spacecraft, filling the area with a melancholy glow. This peaceful moment leaves me awestruck as I take it in, making me hesitant to move on to the next leg of my journey. Elite Dangerous is a game full of drastic swings between peaceful, poetic moments like this, others that are full of danger and action, and some of the most boring stretches of empty space Ive ever navigated. Though this deep and vast space fighter sim has been out (first on PC and then on Xbox One) for a few years now, Elite Dangerous has finally brought its 1:1 scale model recreation of our Milky Way Galaxy to the PlayStation 4. At least in this version of the 3rd millennium, this is a place rife with political intrigue, trading empires, space fighter combat - all separated by tracts of empty light years. Elite Dangerous can be played fully solo with just the stars to keep you company, or it can be played online in its Open Play mode. The latter is a persistent online universe where youre constantly bumping into other players, known as Commanders, but interacting with other players is pretty limited. You can group up and run missions, trade routes, or simply explore together, but the vast majority of human interaction boils down to piracy and bounty hunting. It's up to you, Commander, to decide how to start.Whats not easy, however, is learning how to play Elite Dangerous. The learning curve is tough, especially when it comes to piloting your craft or simply trying to figure out what the heck to do next. Sure, you start off with tutorials teaching everything from basic flight, combat situations, and even landing procedures (the bane of many commanders experiences), though those can only go so far. Once you jump into the shared online universe for real, however, youre thrown into the cockpit of a basic Sidewinder spacecraft, in a space station, orbiting a planet in a random star system with no direction as to how to proceed. Its up to you, Commander, to decide how to start. I suggest searching YouTube for some starter guides, because otherwise Elite Dangerous risks blowing its precious first impression on its deep trading system, or even to learn more about the political struggles which hang over every corner of civilized space. This level of freedom is often teased in open-world games, but with Elite Dangerous its fully realized. You can become a prolific trader, capitalizing on trade routes between stations and amassing millions of credits with each trip you take. If piracy is more your thing, more power to you: you can hunt down unsuspecting pilots, steal their cargo, and sell it to some shady dealer in a fringe system, risking bounty hunters in every flight. If you enjoy the solitude and simplicity of traveling light years beyond the borders of civilized space you can explore the unknown, bringing back cartography data of a far-off star no one has heard of before. Some will be content to simply stick to one role the whole time, but I realized early on that I was going to bounce between play styles depending on my mood. I found myself mostly specializing in trade with the occasional bounty hunting when the constant travel started to wear on me. Wisely, Elite Dangerous doesnt put any barriers in your way when you want to change things up. Elite Dangerous becomes increasingly satisfying.There is no overarching campaign to complete, though there are political intrigues and storylines to be found in every starport. It's up to you how to shape these stories, good or bad. Its daunting, especially to those accustomed to a more focused space adventure like No Mans Sky - which is open world but had a defined goal to work towards at the end - or Wing Commander. But as each layer is peeled back, the gameplay of Elite Dangerous becomes increasingly satisfying, leaving me with the feeling that even the time spent traveling from one dot on my heads-up display (HUD) to another isnt entirely time wasted. I find it fulfilling to pore over trade data Ive logged, maximizing the route to take in order to make the most money off a trading haul. I also love to study the Galaxy Map  a dizzying display of systems, trade routes, and power struggles  in order to find potential conflict zones I can take part in. Some of these moments can be a challenge to enjoy, though, since the PlayStation 4 version suffers from some pretty crippling performance issues, even after the patch that cleaned up the frequent screen tearing. Most severely, framerates plummet when blasting into a busy star system or arriving at a large, complex space station. The latter causes further annoyance since these issues mess with the responsiveness of the controls, making landing safely (which is difficult under the best conditions) a struggle not against game mechanics, but input lag. Learning how your ship handles in stressful situations can go a long way to surviving.It helps that Elite Dangerous is one of the most beautiful space games Ive played. The inside of each ships cockpit is intricately detailed, with a level of care usually reserved for racing sims. Effects - such as the lessening of light pollution as you move away from a nearby star, making nebulae, stars and more become more visible as you continue to fly away - are subtle, but help to reinforce this convincing sense of place. Each spacecraft handles distinctly, from the quick and speedy Eagle to the slow and lumbering Hauler, and learning how your ship handles in stressful situations can go a long way to surviving in the long run. The biggest part of that is combat, which also feels great. Combat in Elite Dangerous isnt just a point and shoot affair. Each instance is different, bringing with it a bevy of on-the-fly decisions that can make the difference between winning and ejecting into cold space. One time I dropped into the system of Eravate and immediately headed to the Nav Beacon, and was greeted immediately with the sight of a group of players and AI ships alike engaged in a space battle with a poor soul sporting a pretty large bounty (which you build up through acts of piracy). Id upgraded my ship a few times since starting out, so I sent my Cobra Mk III into high gear to engage and collect a portion of the spoils. Soon I was staring down a large Anaconda-class ship and settled in for a bumpy fight. My Cobras hardpoints lashed out, sending beams across the enemy ship. His did, too, and my shields were gone in what felt like an instant. Shields gone, I had to figure out how to survive against this massive ship while staying in the fight. I kicked my throttle into gear and performed a quick-axis turn by turning flight assist off, keeping my eyes on the enemy while moving out of range of its weapons. Thankfully, a ship upgrade I made in the previous station meant my shields recharged faster, which allowed me to get right back into the fray. Throttle still fully engaged, I turned back on flight assist to stabilize my fighter as I set my ship's power to focus on its weapons, and gave it everything my beam weapons could. Its shields were now down, and with the Anaconda weakened I used my cannons and multi-guns to tear apart its hull till it met its demise. A bounty of 201K credits flashed across my heads-up display, ready to collect at the nearest starport. Even with all these moments in mind, though, it is hard to shake the fact that for much of your time spent in Elite Dangerous will be spent traveling in essentially a straight line - whether from port to port, system to system (or even planet to planet with the $30 Horizons DLC). Its easy to fall into a routine, but that routine largely becomes dull and uninviting. Thankfully, Elite Dangerous on PS4 launches with the Arena mode, giving a reprieve from the mundane moments of interstellar travel. The game modes in the CQC (or Close Quarters Combat) Arena are nothing to call home about when it comes to objectives: you can take part in either team or free-for-all deathmatch, or a capture the flag mode. But the constant action keeps me engaged. Within the Arena, there is a separate progression system: youre not bringing in your incredibly outfitted ships from the main game, but ranking up and unlocking new ships, weapons, and items to take into combat. Ranking up doesnt take too long either  within about five or six deathmatch rounds I found myself with a few unlocked ships and loadouts to rival some of the better fighters in the Milky Way, which left everything else to a test of pilot skill. Space is big and empty, dotted with small points of brilliant light. Elite Dangerous is much the same way: it can at times be boring or mundane, as much of it is spent flying from point A to point B. Thankfully, whether youre soaking in the cosmos around you, banking large sums of credits from a well-planned trading haul, or surviving a harrowing encounter with space pirates in dazzling ship-to-ship combat, Elite Dangerous has plenty to keep me excited to come back. And when those long-haul sessions become too much, Arena mode is there to inject some much-needed action at a moments notice.", "date": "July 8, 2017,"}