{"name": "Borderlands 3", "name_review": "Borderlands 3 Review", "ref": "https://me.ign.com/en/borderlands-3/165214/review/borderlands-3-review", "text": "Stubbornly refusing to reinvent itself after a five-year absence, Borderlands 3 sticks to its guns and manages to outdo itself. Refined movement and shooting, a legion of enjoyably challenging enemies, and the single largest arsenal of mechanically distinct firearms Ive ever seen in a video game easily make this the best in a great series of co-op shooters. Its trademark stylized art, on-the-nose humor, and tattoo-fueled storyline are all enjoyable enough in their own right, but what really makes Borderlands 3 excellent is the addicting item chase that unfolds over the course of 30 hours worth of lovingly crafted main and side missions. Whats more, this is an adventure I could see myself happily undertaking again from scratch with a new character and a fresh group of friends. Youll arrive on the familiar planet of Pandora to find it overrun by bandits and on the verge of total collapse so, normal. But this time around you arent stuck on stuck on Pandora. Youll venture to several varied and jaw-droppingly beautiful planets, from the grimey neon metropolis of Promethea to the cherry-blossom-speckled peaks of Athenas, and each stands out visually in a way the series rarely has before. Though few have mechanical differences that distinguish them from the rest, every nook and cranny is generously littered with chests, collectibles, and amusing Easter eggs that make exploration and looting almost as much fun as the combat. I made frequent use of vehicles to get from one place to another on these large maps, but as with the previous games, vehicular combat is still so clumsy and relatively dull that I only fought in one when a mission required it. You'll venture to several varied and beautiful planets, each standing out visually in a way the series rarely has before. This time around you and your team of up to four will take control of Moze the Gunner, Zane the Operative, Amara the Siren, or FL4K the Beastmaster. Theyre a personable bunch: FL4Ks backhanded compliments are always good for a laugh and Mozes mid-combat pop-culture references are pulled from refreshingly eclectic sources like Ariana Grande and John Wick. Theyre fairly standard fare for a Borderlands game at this point, but unlike the previous games casts, every class has their versatility boosted by a choice between three different action skills selectable at the top of each notably beefed-up skill tree  except for Moze who gets to customize her mechs loadout. My current Moze skill build is focused on being able to summon my mech for the maximum amount of time on a short cooldown and boosting damage output. Thats helped along by class mods and Anointed item effects that add powerful class-specific bonuses to loot, like an extra charge for FL4Ks Rakk Attack action skill that calls down a fiery pair of flying beasts to dive-bomb enemies. There are a lot of neat details to sort through when it comes to your class progression, like skill augments that evolve FL4Ks pet or give Zanes drone an airstrike. For my money, though, the most alluring skill point options are the one-and-done passives like Rushin Offensive, which allows you to sprint and shoot at the same time, or Dakka Bear, which adds a manable turret to Mozes mech for co-op play. The cast of supporting characters found in these cosmic backwaters candidly edge out the generic but somewhat amusingly villainous Calypso Twins when it comes to delivering a compelling story. Interacting with Rhys Strongfork (of Tales from the Borderlands fame), Katagawa Jr, and Wainwright Jakobs (the figureheads of the Atlas, Maliwan, and Jakobs megacorporations, respectively) provided interesting insight into the ideological differences between my favorite gun manufacturers. Its a wonderful marriage of storytelling and gameplay that gives extra depth to the weaponry you collect. Similarly, I love that Borderlands continues to put player characters from the previous games into major roles. Lilith (the original playable Siren) shines in her role as the leader of the Crimson Raiders, but the fact that not everyone is doing as well as she is hits home. For example, visiting the memorial for Roland, who was my very first Vault Hunter back in the day, and finding it littered with heartfelt graffiti certainly struck a sentimental nerve. The cast of supporting characters candidly edge out the generic but somewhat amusingly villainous Calypso Twins. Playing with friends is better than ever thanks to a ping system which can be used on enemies, items, or the environment to quickly clarify who you think should be shooting what or going where even if your teammates dont have mics. (Thanks, Apex Legends, for making this a mandatory feature in co-op games going forward.) Having a friend to pick you up from a downed state is always nice but the co-op feature that really stands out in 2019 is the ability to share or trade weapons and other gear after youve used them, since they dont bind to your character after being equipped. Its also notable that your team can choose to play in Cooperation mode, which turns on instanced loot and forgiving level scaling, or Coopetition mode, which disables scaling and lets the fastest player hoover up all the item drops like in the old days. (Also, Borderlands 3 includes matchmaking for various activities but I wasnt able to test it out before launch.) Weapons Free Perhaps Borderlands 3's greatest triumph is that it never felt monotonous over more than 30 hours. I kept waiting for the energetic pace at which new enemies, weapon archetypes, and mission structures were introduced to slow to a grind but it never did. For starters, if your ECHO 3 mission log didnt clearly label them as such, I wouldve had a hard time distinguishing Borderlands 3s side missions from its main story missions  and I absolutely mean that as a compliment. The optional tasks divvied out by the denizens of Pandora and its neighboring planets are creative, enjoyable, and rarely the kind of formulaic, repeatable filler usually associated with optional tasks. There are definitely still some fetch and kill quests, but theres almost always a twist that makes them feel unique  and when theres not, Borderlands 3s self-deprecating humor makes light of that situation. My absolute favorite side missions were the ones that completely side-stepped convention for quick laugh. For example, Tyreen Calypso offering up a legendary weapon if you simply kill yourself, and the catch this decision comes along with it had me chuckling for hours after the fact. Even more importantly, I'm every bit as giddy about the purple glint of an epic drop now as I was when I saw my first, and thats because the incredibly diverse and constantly surprising arsenal absolutely steals the show. Like with its predecessors, Gearbox cooks the books a bit when counting up to the advertised ~one billion guns in Borderlands 3 by defining nearly mechanically identical weapons with slightly tweaked stats as unique guns. In spite of this fuzzy math, the illusion of infinite firearms is sold much better than ever before thanks to the sheer number of randomized elements with significant and legitimately unique effects, like an otherworldly, organic growth that turns bullets into elemental energy, a rocket-stabilized bipod, or even a barrel that spews radioactive goop. Even optional missions are creative, enjoyable, and rarely formulaic. This meaningful weapon variance is further helped along by a greater emphasis on what differentiates each manufacturer. For instance, all Vladof weapons can switch between two firing modes, like a gatling gun that toggles to an underslung grenade launcher, while Children of the Vault weapons dont need to be reloaded at all but can overheat and need to cool off if you hold down the trigger too long. But what's most impressive about Borderlands 3's arsenal is how these weapons looks and feel when you use them. Its the delightful little touches  like cocking the hammer on a revolver, the red-hot smoking barrel of a shotgun, or a bolt chattering away on an assault rifle  that are the types of details I'd expect to see on handcrafted models, not these procedurally assembled ones. In the same vein, many weapons feel fantastic with a mouse and keyboard on PC thanks to pronounced recoil and crisp sound design. My only minor criticism of the gunplay is that the sight picture (the parts of your gun that appear on screen when you raise it to your eye) on many weapons too often obscures your target, somewhat defeating the purpose of including the ability to aim down sights in the first place. Then comes the creme de la creme of loot: legendaries. Like in Borderlands 2, these guns and gadgets fill out the upper echelon of the loot table with hand-crafted effects that are, in many cases, a celebration of how far Borderlands 3 is willing to go to be absurd and surprising. My favorites so far are the Laser-Sploder that spits out rockets and a laser at the same time, the Cloud Kill (Maya, anyone?) which leaves enemies choking on corrosive fumes, and (through what must be the result of a backroom handshake deal between Texas-based developers) the Hellwalker, which is a dead ringer for the Super Shotgun from Doom. It should come as no surprise that youll be getting plenty of use out of these badass guns thanks to a varied and creative horde of enemies. While the familiar menagerie of foes like bandits, skags, spiderants, and more all return with fresh coats of paint, youll also encounter a handful of new archetypes like the monstrous tink-topped hag or a long shot sniper, the latter of which will straight up kill you if you dont find cover fast enough. Without giving too much away, youll also square up against several new enemy types like the futuristic forces of Maliwan and swarms of skittering ratches. Combat encounters with any adversary are enjoyable, even if ratches, varkids, and skags all feel functionally the same. Bandits and Maliwan troops do a great job of keeping you on your toes with increasingly diverse squads thrown at you once you get deeper into the campaign. Things arent as consistently excellent, however, when it comes to bosses. Borderlands 3 is at its most hit-or-miss in the quality of its boss encounters, which, frankly, are all over the place. The bulk of them (especially toward the end of the campaign) are particularly good. Theres the exemplary Agonizer 9000, who comes complete with crit spots, flaming vents to dodge, a massive saw blade to jump over or slide under, and even a second phase which mixes things up further. And the good news is that every other boss with major plot significance follows this great formula: precise telegraphs, challenging mechanics, and mostly avoidable damage. At the opposite end of the spectrum is Killavolt, who covers the entire arena in unavoidable, mostly-lethal electricity that can easily down your entire team at once. Worse, his electricity even zaps the smaller enemies that would otherwise give you a chance at reviving yourself with a Second Wind kill. This was unnecessarily frustrating to the point where I even reached out to Gearbox to make sure I wasnt missing some mechanic meant to make this fight less of a headache. I wasnt. Im not sure what the designers were trying to put down here, but Im definitely not picking it up. Your adventure doesnt end when the credits roll. Borderlands 3 has several new ways to play, most notably Mayhem Mode, which incrementally ups the difficulty and adds random effects (like Double Whammy which doubles projectiles fired) to some enemies for greater rewards. After unlocking Mayhem Mode youll also start earning all-new Guardian Ranks which provide further stat increases like gun damage and cool effects like increased loot luck after scoring a kill. Couple this with True Vault Hunter (AKA new game plus), the Circle of Slaughter (horde mode by any other name still smells as sweet), and the all-new Proving Grounds (sort of like a non-randomized Diablo 3 rift) and there are many enjoyable ways to skin the endgame cat  more than weve seen in any previous Borderlands game. The Honor System Borderlands 3 is not a game-as-a-service like Destiny or The Division 2, which means that all of your data is stored locally. Thats great news for those of us who want to play offline. However, theres a tradeoff: local storage means its item economy is vulnerable to some easy exploits. If youre on PC (as I was for this review) youll have to exercise restraint to not exploit the obvious item-duplication loopholes that allowed me and a partner in crime to (for science!) duplicate a legendary multiple times. If you want to play legit, its best to play with friends who appreciate the merits of doing so. I fully expect that a lot of people will take advantage of these cheats when they see the first signs of a progression grind in the late game  though if that makes Borderlands 3 more fun for them, more power to them. If Borderlands 3 is what happens when a modern looter shooter doesnt concern itself with the longevity of its item economy and daily quests then you can sign me up for Borderlands 4 right now. Being untethered from persistent servers and able to trade loot at will is a refreshing change of pace, but thats hardly the only reason why this such an amazing co-op FPS. The sheer magnitude and diversity of its arsenal of fun and surprising weaponry is unmatched, and the striking amount of loving detail and variety packed into its energetic and replayable 30-hour campaign is what makes Borderlands 3 a high-point for the series  and the genre as a whole.", "date": "Sept. 9, 2019,"}