{"name": "Catherine: Full Body", "name_review": "Catherine: Full Body Review", "ref": "https://me.ign.com/en/catherine-full-body/165049/review/catherine-full-body-review", "text": "Even eight years after its initial release, theres still nothing quite like the fever dream that is Catherine. It remains an excellent fusion of thrilling block pushing puzzle mechanics and an exciting love story about the deathly consequences of infidelity. Catherine: Full Body is a complete re-release of the 2011 PS3 classic with a slew of added extras including online versus, a handful of new endings, a new remix mode, and most substantially, a completely new character named Rin that gets stitched into the story, adding a few hours of new gameplay and cutscenes. These extras arent quite enough to justify a full $60 price tag for returning customers, but for those that missed out on Catherines twisted tale of love and deceit, Full Body is a temptation worth giving into. For the uninitiated, Catherine is part action puzzle-platformer, part visual novel/dating sim. Its unusual story takes place over the course of several days and centers around the turbulent love life of the at times frustratingly dumb, but deep down good hearted Vincent Brooks. Vincent is in a stable but stagnant relationship with his former high school crush, Katherine, and is having trouble committing to taking that next step. This simple setup sends you on a roller coaster of emotion when Vincent meets Catherine, a blonde bombshell who offers a new relationship option: One that isnt burdened by the immense stress and expectations for the future that comes with being with Katherine. Catherines story is a definite high point, telling a dark and mature tale that molds itself based around the kind of person you want Vincent to be. Youre asked a multitude of moral questions over the course of Catherine, such as does life begin or end at marriage, and your decisions affect not only the outcome of the story, but also how Vincent reacts to big moments. Its a very neat twist on the light side/dark side mechanic that was so prevalent in games around 2011, actually forming its alignment based on questions it asks you rather than questions it asks your character. That said, Catherine has a frustrating tendency to present highly dramatic scenes that seem impossible for Vincent to navigate out of with his relationships intact, but then ends them abruptly before anything is resolved. As an example, a lunch between Katherine and Vincent gets extremely tense when Vincent hears Catherines voice; as she starts making her way to the smoking area where he is, Vincent goes to the bathroom and the scene just ends. Its like the writers wrote themselves into a corner and just decided to put a period and move on to the next page, leaving both me and any satisfying resolution to that build up hanging. There are a few other similar instances, but if youre able to look past them, Catherine is still very engrossing. Its characters are charming and relatable, and they actually get even better in Full Body thanks to the addition of Rin. Love Quadrangle Atlus did a wonderful job of making sure Rins arc didnt feel tacked onto the main plot of Catherine. Its woven directly into the already existing story. After getting rescued by Vincent from a mysterious pursuer, Rin starts work at the Stray Sheep Bar as their resident piano player, and also moves in as Vincents next door neighbor. From there, Rin appears periodically in cutscenes both at the bar and at Vincents apartment complex, with new scenes and re-recorded transitions that truly make Rin feel like a natural part of the cast. It also helps that Rin is just adorable, and brings out a side of Vincent that we never really got to see before It also helps that Rin is just adorable, and brings out a side of Vincent that we never really got to see before. One that is genuinely kind, thoughtful, and removed from having to deal with either the stress of his strained relationship with Katherine, or the guilt and fear that comes with his infidelity with Catherine. Rin also has probably my favorite romance route in Full Body, complete with an extra chapter that wasnt present in the original game and some downright wild scenes that are best seen for yourself. Edge, Edge, Edge, Edge Catherines story is great, but its the absurdly deep and rewarding puzzle gameplay that keeps me coming back. At night, when Vincent goes to sleep, he turns into a sheep-man and is plagued by nightmares that you must play through in order to survive to the next day. Conquering the nightmare is a wonderfully frantic challenge as youre forced to quickly climb a tower by pushing and pulling individual blocks to make stairways and bridges, all while avoiding various traps, hazards, and all other forms of nastiness. It may sound straightforward on paper, but once the towers start to get a little more complex and the hazards a little more hazardous, Catherine has my brain firing on all cylinders like few other puzzle-platformers do. Whether its by getting on a roll and deftly climbing 50+ stories without stopping, or the tension of slowing down to figure out how to fix a mess Ive gotten myself into. The puzzle design is extremely flexible and allows for so much improvisation. Theres really nothing quite like it. For those who are looking for a new challenge, Full Body adds a Remix Mode that throws in large tetris-like blocks that must be moved all at once, or sometimes are unable to be moved at all. Remix was definitely worth playing through for a fresh experience and certainly ups the difficulty by throwing in very unwieldy blocks, but I still personally prefer the classic mode. Remix mode can feel inconsistent with some levels that worked great, others that had extremely easy layouts that required very little thought, and others still that were so puzzle heavy that they felt like they had just one solution, removing the improvisational element that makes Catherine so special. While Remix Mode, Rin, and the inclusion of a new alternative ending for both Catherine and Katherine are the biggest additions to Full Body, there are a number of quality of life improvements as well. Theres now a retry assist option that you can toggle on and off that allows you to undo the last move you made before you died instead of just sending you straight to the game over screen. Its a great option both because it means you arent forced to watch that screen a million times and also because it turns undos into a valuable currency as opposed to just something you use before realizing that youre in too deep with your mistake and have to inevitably hit retry. On top of that, Vincent can thankfully now view previously learned techniques from the save menu, theres a ton of new music from various Atlus games that you can unlock and play in the Jukebox (including some choice songs from various incredible Persona soundtracks), the Rapunzel arcade game has a new set of levels, and theres now a fully featured online competitive mode. Unfortunately, even with all of these impressive improvements, nothing will save us from the voice that still says New Record! every time you take a new step in Babel. Catherine is a timeless classic, and Full Body does a great job of adding meaningful new content and plenty of small tweaks that breathe fresh life into it. Its the perfect entry point for those who missed the 2011 original. It may be a little too familiar for those who already experienced everything Catherine had to offer eight years ago, but theres still value to be had with Rins excellent story arc, remix mode, online multiplayer, and plethora of new puzzles.", "date": "Sept. 5, 2019,"}