{"name": "Philips 328E9FJAB Gaming Monitor", "name_review": "Philips 328E9FJAB Gaming Monitor Review", "ref": "https://me.ign.com/en/philips-328e9fjab-gaming-monitor/165041/review/philips-328e9fjab-gaming-monitor-review", "text": "Philips has been making a big push into the gaming market lately, releasing a number of FreeSync gaming monitors this yearfrom the super-budget 326E to the costly, superwide, high-quality 499P9H. Its 328E line definitely leans more toward the former, providing solid picture quality at a wallet-friendly price. They lent me the 328E9FJAB model to try out, which provides a massive 32-inch, 1440p display at 75Hz. Heres how it performed. Philips 328E9FJAB Gaming Monitor  Design and Features It may be $329, but for its size, this monitor definitely falls into the budget categoryits cheaper than most comparably-specced gaming monitors on the market, with only a few caveats here and there. You wouldnt know its a budget monitor by looking at it, though. I has a sleek, nearly-frameless design with a gentle 1800R curvature, which I found rather welcome in a monitor this large. The square stand is easy to attach, and while the monitor definitely wobbled when I bumped my gaming desk, it never felt like it was going to tip over or break. Unfortunately, the stand doesnt offer much adjustment, allowing for the typical -5 to 20 degrees of tilt and nothing elseno height adjustment and no swiveling. The lack of height adjustment is particularly brutal with a panel this large, since it sits a little higher than is ergonomically idealI felt like I was looking up at the monitor rather than looking at it straight on. But this will vary from person to person and desk to desk. You wouldn't know it's a budget monitor by looking at it, though The I/O on the back is perpendicular to the panel, rather than pointing downthat means you wont necessarily be able to put it up right against a wall (not that the stand would really let you anyways), but it does make plugging things in much easier than on most other displays. The I/O is rather basic, offering one HDMI port, one DisplayPort, and one D-SUB port for legacy VGA connections, as well as audio in and out jacks. The monitor comes with an HDMI cable as well, and has built-in speakers if you dont have a separate set of computer speakersthough the quality is about what youd expect (that is, not great). The 328E9FJAB uses a VA panel with a resolution of 2,560 x 1,440. Thats only 91 PPI, which isnt super sharp, but if youre using it primarily for gaming, its not too noticeable. Desktop work is less forgiving, though, and this particular panel has quite a bit of screen door effect on solid blocks of white or color. I found this pretty distracting, but again, its less visible during games. The refresh rate is where Philips cost-cutting comes in, clocking in at 75Hznot terrible for the price, but you can find monitors with 144Hz for just a tad more money. Onboard FreeSync means you wont get screen tearing, though, which is pretty much a necessity in any gaming display these days. The on-screen display is easy to control through a single joystick button on the bottom of the panel, allowing you to adjust things like Brightness and Contrast or enable features like SmartResponse, which reduces ghosting on moving images. It also has presets for different game types like FPS, Racing, and RTS, though Ive never been a fan of these as they severely alter the colors. The LowBlue mode is particularly terrible, producing a bright yellow tint that is seriously inferior to the Night Mode built into Windows. So youll probably leave most of these settings alone, and thats okay, because the image quality is fine without them. Philips 328E9FJAB Gaming Monitor  Testing I ran the 328E9FJAB through a few of Lagoms test patterns to judge its out-of-the-box performance. Black levels were quite dark for an LCD, thanks to the VA panel, and I didnt notice any glow around the edges. Each shade of Lagoms black steps were just barely distinguishable from the next, meaning black details should be clearly present in a dark room. White saturation produced similarly positive results, and I didnt notice any banding in gradients. Gamma hovered right around 2.2, as it should. With the SmartResponse turned on, the flicker reduced considerably. Response time and viewing angles are usually the bigger question marks with these VA displays, but the Philips performed decently in both areas. To test response time, I use Lagoms pattern that produces an animated GIF rapidly switching pixels between two shades. In an ideal world, this would happen instantly, but on panels with slower response time, the squares within the GIF will flicker, indicating that youre more likely to see ghosting in games. The Philips out-of-the-box response time is bad, producing noticeable flickering in four of the eight transitions in Lagoms testwhich is not surprising, given that Philips clocks it as 22ms in their user manual. With the SmartResponse turned on, however, the flicker reduced considerably. Philips claims a 5ms response time with this feature on, presumably using the strongest of four settings (Fast, Faster, and Fastest). In Blur Busters UFO test, I found that Faster was the most ideal setting, since the Fastest setting produced some overshoot that would create its own artifacts in games and movies. You may want to try them both to see which you prefer. The VA panel provides viewing angles that are miles better than most TN displays, but still cant quite measure up to IPS, so you will see some degradation when sitting off-center. This can be rough on large panels like this one, since the sides are on the edges of your field of view and thus produce some degradation around the edgesbut the 328E9FJABs curve helps mitigate this. As long as youre sitting dead center in front of the monitor, you should have an undistorted picture from edge to edge. Philips 328E9FJAB Gaming Monitor  Gaming Playing on this curved gaming monitor is very satisfying, as long as you arent a stickler about refresh rate. Ghosting abounds with the Philips out-of-the-box settings, but once you turn on the aforementioned SmartResponse feature, motion is smooth and clear, and the VA panel provides respectable black levels for gaming in the dark. The 32 size is imposing, and really adds a level of immersion to your games thats hard to match with other 16:9 displays. Even casual games like Rocket League feel large and in-your-face. Id call the 75Hz fine, especially given the price of this monitor, but if youre used to gaming at 144Hz (and you have the graphics horsepower to drive it), you might be a little disappointed. At least FreeSync keeps things tear-free, though youll want V-sync (or a frame limiter) turned on in tandem with FreeSync to avoid tearing at 75FPS and above. The 328E isnt perfect, but for $329, its hard to beat, and Id argue that they cut corners in all the right places to keep costs down. If you want as large of a monitor as you can get without spending a ton, Id recommend giving it a shot. Philips even more budget-oriented 326E is even cheaper at $279, but the image quality is noticeably lowerif you can spare just a bit of extra cash, theres no reason to buy the 326E when the 328E provides such an improved experience. Again, you can get almost twice the refresh rate for even more money, but if your budget is tight, the 328E hits a good sweet spot in the low end. Purchasing Guide The Philips 328E9 can be found at Amazon for $299. The 328E cuts some corners to keep costs down, but its a good monitor if youre on a budget and want a large, immersive screenespecially if your focus is gaming rather than productivity type of work.", "date": "Sept. 5, 2019,"}