{"name": "Control", "name_review": "Control Review", "ref": "https://me.ign.com/en/control-1/164737/review/control-review", "text": "I wish Remedy could make even more games, because Control reminded me of this studios knack for crafting engrossing, oddball worlds with an incredible sense of place. Control is perhaps Remedys weirdest yet, with the talking upside pyramid whos also your boss being about the sixth-strangest part. But thanks to sharp writing, a set of awesome and varied psychic combat abilities, and an impressively thought-out world, it was easy to wrap my head around what made this adventure tick. Infiltrating the Federal Bureau of Control as Jesse Faden and her blue wavy spirit buddy, I found myself fascinated. The Bureaus headquarters seems like a drab, nondescript office building at first, and Jesses search for answers to events in her past was equally mundane at first. But Control quickly reveals what lies behind those concrete walls: within the first chapter I became both the janitors assistant and the new acting director of the Bureau. Jesses search is then sidetracked by solving everyones problems. And while taking over the bureaucracy of a federal institution may sound like a dull time, when its filled with this many weird and distinctive characters and overrun by an interdimensional force known as the Hiss, it rarely ever is in practice. Mind Over Matter As a kid who grew up on the X-Men, Ive always wished Id discover some latent psychic powers, or at least the ability to grow my fingernails super fast or something. Controls lineup of moves is the closest Ive gotten thus far to wielding supernatural abilities, and Remedy has made each of them fun to use. Theres enough variety for most of the 10-hour story campaign to make almost every move feel important. Jesses telekinesis is the best of the bunch. With a wave of her hand a crate or table or ever-reliable chunk of concrete snaps to your side with satisfying urgency, and then hurls at foes and the destructible environment with just as much of a thrilling zoom. I easily relied on this form of attack the most, and while its not quite the same level of tactile satisfaction as Kratos Leviathan ax, the oomph of hurling heavy objects around with my mind is as close as Ive felt since. The other abilities arent quite as handy but mostly still fun to use. Late-game hovering allows for even more mobility, and Jesses shield is great when enemies with telekinesis of their own force you to go on the defensive. Controls combat encourages constant movement, and finding cover is frequently necessary to survival, even if you have to summon it yourself. The standard difficulty level isnt unfairly hard, but I died a fair number of times when I didnt think to balance both offensive and defensive skills and got too cocky with jumping into the fray, for example. Getting up close and using the psionic wave force melee ability can be advantageous when youre down to just a couple of foes, but any more than that and short-range combat usually led to a swift death, in my experience. Jesse's telekinesis is the best power of the bunch. Instead, hanging back and finding a balance of when to strike and when to defend brings a nice rhythm to combat, and also lets you make good use of with Jesses sole firearm, the Service Weapon. Sole is a bit of a misnomer, though, because the Service Weapon has several unlockable modes that shift it from a standard pistol to a fast-fire revolver to a more shotgun-esque spread shooter, and more. I eventually settled on the fun rhythm of the revolver and sniper-like pierce gun combo to keep enemies at bay at both short and long range. When it comes to enemy variety, however, Control doesnt match the variety of Jesses combat options. The Hiss-controlled members of the Bureau who are now fighting against you typically have one or two of your own moves and ammo options, and it is fun to see how Control mixes and matches them in the early goings. But by the end of the storys 10 chapters there was little challenge to these encounters, other than fighting Controls performance. When too many enemies were on screen firing at me and getting blown up by my explosives at any given time, I ran into some huge hitching issues  even on my PS4 Pro. Theyd only persist for a few seconds, but those seconds are often crucial and led to frustrating deaths. Those were mitigated by Controls forgiving checkpoint system, at least, and it hasnt stopped me from continuing to explore the Oldest House  which is Controls main setting and the headquarters of the Bureau  even after completing the story. A House Divided Remedy has somehow made all of this gray concrete consistently fascinating. The Bureau is divided into a number of different business sectors, and though theres certainly an overriding corporate theme, each area feels different enough that I wanted to know about the work being done there and how I could save it. And, thanks to the Oldest Houses ability to change its shape and internal structure at will, it can keep pulling the neat trick of rebuilding locations. Its as if the paranatural forces at work treat cement and rebar like Lego bricks. Its always impressive to watch how the various new sectors will conform to the nefarious presence and my attempts to stop it. The Bureau is divided into a number of different business sectors, and though theres certainly an overriding corporate theme, each area feels different enough that I wanted to know about the work being done there and how I could save it. And, thanks to the Oldest Houses ability to change its shape and internal structure at will, it can keep pulling the neat trick of rebuilding locations. Its as if the paranatural forces at work treat cement and rebar like Lego bricks. Its always impressive to watch how the various new sectors will conform to the nefarious presence and my attempts to stop it. The charm of the place comes, in part, from Controls eclectic main cast. From Ahti, the janitor with serious Log Lady vibes, to Emily Pope, the information delivery service-slash-researcher, every character feels original and right at home in the Oldest House. Each sector brings with it a new character with a distinct, engaging personality, and yet they all absolutely made sense for someone who works in a secret government agency focused on paranatural forces beyond our understanding. In short, theyre all distinctive weirdos. Every characters absolutely makes sense as someone who works in a secret government agency focused on paranatural forces. Remedys sharp writing extends from the dialogue into the collectibles and their descriptions or text. Control is not a story to just blaze through as you go  if you pick items up, you should absolutely take the time to examine and read them. Theyre not only well written and frequently funny but often contain context that sheds new light on Jesses current point in the story. I could have done without some of the hokier thoughts from Jessies inner monologue, which often explicitly blurt out how shes feeling rather than letting lead actress Courtney Hopes strong performance convey that on its own. That said, there are enough winners (in which she often says what I was thinking) among those lines to make her constant asides worth it. Of course, alongside the main story, Jesse is pursuing a very personal goal as well, and shes always looking to explore the Bureau for clues tied to her past. Without spoiling why or what that translates into, I really enjoyed how Remedy tied Jesses personal story into the weirder corners of the Bureau through most of the journey. The ending of the 10-chapter story sadly doesnt quite stick the landing, though, due in part to what felt like a bit of a rushed final chapter that left some of the most interesting aspects of Jesses personal stakes to be uncovered in collectibles. And the endings anticlimactic final moments dont work nearly as well as the highs of the couple of chapters that precede it. That last-minute fumble certainly didnt ruin Control for me, but Remedy lays such a solid foundation that I wished those final moments were as impactful as the rest of the story. Thankfully, theres plenty left to explore in the Oldest House after the conclusion. Controls fascinating cast have left me with plenty of side missions that offer fights more unique and fun than most of whats in the main campaign, plenty more great dialogue, and a continued reason to explore every nook and cranny of the bureau. Add to that a host of kill-based objectives to earn crafting materials, the upgradeable Service Weapon forms and skill trees still to fill out, and the ever-present Bureau Alert side missions (timed opportunities to tackle extra objectives) and Control has conjured up plenty of reasons to stay on my mind. Don't Ignore the Side Stuff Controls story drops plenty of breadcrumbs leading you to side missions and info that are just as good as, if not better in some cases, than the main campaign. There are some great character moments and bits of lore that further contextualize the world. But chief among the reasons to delay your main goal, or hang around the Bureau after its completed, is a series of boss battles that become available a little after the midway point of the story. Without spoiling anything, these fights deliver on the challenge and combat variety some of the latter chapters are missing, delightful visual spectacles in their own right, and serve as further signifiers of just how weird life at the Bureau can be. I havent played them all just yet, but what Ive seen makes it clear Remedy has put just as much thought into the surrounding material as it has Jesses driving story. Collectively, the battles open another door into the weirdness of Control that you should not leave shut. Control is set in an engrossingly weird paranormal world that I couldnt help but explore. Jesses versatile psychic skills and main weapon make for thrilling ranged combat. And thanks to a strong supporting cast, a well-written script, and plenty of intriguing breadcrumb trails, Ive thoroughly enjoyed my adventure through the shifting rooms of Oldest House. Jesses personal story feels like an afterthought next to that, but theres enough to Controls world that I remain invested in uncovering every secret, even though the storys over.", "date": "Aug. 26, 2019,"}