{"name": "Telling Lies", "name_review": "Telling Lies Review", "ref": "https://me.ign.com/en/telling-lies/164498/review/telling-lies-review", "text": "Telling Lies is a storytelling marvel. Every smile, every kiss, every lie reveals something meaningful about the characters and the way their lives intertwine, and seemingly insignificant comments link together to become crucial revelations. It follows the same structure as developer Sam Barlows previous game, Her Story, with a database of video clips that you watch out of sequencebut Telling Lies is bigger and better in every way. Sublime acting by a cast of four main characters makes every scene believable, and each clip is a potential door into a new sub-plot. One shows David, who features most often, talking to a woman on the phone while in bed, their conversation veiled in subtext and secrets. The next might show an environmental group organising a protest that you know must be important because youve heard about before. If you tug on any thread it will slowly unwind, and I wasnt able to let go until Id fully unravelled it and learned how it fits into the wider story. You play from the perspective of a woman on her laptop in a sleek apartment, trawling through an NSA surveillance database for an unknown reason. Searching keywords shows clips organised by date: search something vague like love and youll get 34 matches, but the system limits you by only allowing you to watch the five earliest clips. By watching more, you learn to narrow your searches to focus on specific topics, eventually getting to the juicy bits. You follow the interconnected lives of Emma, a nurse, played by Kerry Bish (Argo), environmental activist Ava, played by Alexandra Shipp (X-Men Apocalypse), webcam model Michelle, played by Angela Sarafyan (Westworld), and the mysterious David himself, played by Logan Marshall-Green (Spider-Man: Homecoming). To say more would be to spoil it, because figuring out exactly how their lives interact is the best bit of Telling Lies. It starts off simple and becomes wonderfully dark and twisted, and each new storyline you discover is another rabbit hole to dive into. You can scrub through clips by clicking and dragging your mouse to speed up or slow the footage, which made me feel like a cop in a police procedural, and I regularly rewound through sections to pick up scraps Id missed the first time around. The acting is some of the best I've seen in any video game.The acting is some of the best Ive seen in any video game. What makes the performances so remarkable is that even though every word in Telling Lies script is deliberately placed so that you can search for it in the database, nothing feels forced. The cast make me feel the weight of each line, whether theyre crying to a loved one or having phone sex. I often lost myself in the raw emotion of a scene, forgetting my task at hand. Shipp is particularly good as Ava: likeable, tragic, and complex. The writing matches the acting for quality, and theres always a deeper meaning to what a character says and doesnt say, such as when David reads bedtime stories to his daughter. Conversations between two people are split into separate clips so that you can only hear one side of the audio at a time. Theyre written so that, if you think hard enough, you can pinpoint the other perspective in the database, which is often a missing puzzle piece. Its clever. I like how the plot meanders and then changes pace abruptly. Some clips are five-minute monologues, others are 30-second arguments. Action punctuates the conversations: youll see gunshots, protests, parties, and fights, and youll start to organize the timeline around these key events. Clips vary in style from simple front-on webcams to shaky handheld footage, and youll be taken into boats, bedrooms, tents, cars, and community halls. The variety kept me on my toes throughout the six hours of footage. You constantly flip back and forth in the timeline, which lends the plot an imperfect, very human feel. Its messy in the way few games stories are, and I couldnt predict where it was going. I like that it never hurries you, and unlike in Her Story you cant track what percentage of the total videos youve watched and what remains unseen. It lets you follow a side plot blindly, only stopping to jot down a pertinent name or a potential keyword for later. Or, if you cant wait to find out what happened, you can just rush towards the ending. And just like in Her Story, every playthrough feels different and personal. Youre supposed to be the mystery woman at the laptop, but the ambient noise from her apartment and the clack-clack of her keyboard as you type made me feel like I was the one sifting through the data. The route you take to the end changes your perception of what you see, and nd theres something magical about knowing youre probably the only person who has watched that exact combination of clips. My only complaint is the occasionally clunky UI.My only complaint is the occasionally clunky UI. Its little but persistent things, like the way the laptops note-taking app doesnt automatically scroll to where youre typing, nor does it respond to your mouses scroll wheel. To type past the bottom of the page you have to click and drag on the scroll bar, which is annoying, and I found a bug where my cursor was one line lower than everything I was typing. Additionally, the video player is always full-screen and you can't minimise or resize it to jot down your thoughts. It doesn't save your position in clips, either, so if you close a clip to make that note and then re-open the video, youre back to where you originally started watching. Basically, it gives you no reason to use the in-game note app instead of a physical pen and paper, which takes you out of the world. Tagging clips to organise them for later is also a pain because you cant create tags in the video player itself: you have to bookmark the clip, close it, open the database, find the clip in your bookmarks, bring up the tag menu and then label it. Its not worth the hassle. I could forgive Her Storys clumsiness because it fit the fact you were trawling through an old police computer system. But when youre sitting on a modern laptop in a contemporary apartment it feels awkward, and sometimes broke the flow of the story. But that story is bold enough that Ill happily put up with the UI issues. I finished my first playthrough in just under four hours, but learning that Id left two hours of footage untouched meant I couldnt help but jump straight back in to learn more. Now, Ive nearly exhausted the database and Im still finding fascinating details about the characters backgrounds, their motivations, and the lies theyve told along the way. Telling Lies is a rich, deep story that keeps on giving, even after youve finished your first playthrough. Every one of its short video clips is packed with meaning, and working out where you should go next is rewarding because each subplot is gripping: once Id started following a thread it was hard to stop, and the more you do the more youll find connections to the main plot. I sometimes felt like I was battling the UI, but it was worth it to watch this talented cast bring a complex story to life.", "date": "Aug. 22, 2019,"}