{"name": "Remnant: From the Ashes", "name_review": "Remnant: From the Ashes Review", "ref": "https://me.ign.com/en/remnant-from-the-ashes/164452/review/remnant-from-the-ashes-review", "text": "Remnant: From The Ashes demands a lot from you while offering very little in return. Its excellent combat and high-stakes, randomized progression system gives it moments of pure blissful excitement, especially in co-op. But its frequent difficulty spikes and underwhelming gear system rob it of the consistently tough but fair feeling that gives Souls games their infamous appeal. The elevator pitch for Remnant is basically Dark Souls with a heavy focus on ranged, gun-based combat, and it sticks closely to that format. Your team of three fights across randomly generated maps and slays boss monsters in the hopes of earning extremely rare loot. Gunfire Games did a good job of building out a world that feels unique with lots of fine details that are fun to uncover, but the actual post-apocalyptic story about a battle against an evil called The Root lacks personality and a driving purpose to keep things interesting on that front. I found myself being told where to go and what to do a lot by sparse voice acting, but I was never given much of a reason to care about anything but the basics. Visually, Remnants environments are grotesquely stunning. Each zone has a beauty all its own while also leaning into a dark, twisted vision of the world. The swamp zone in the second half of the campaign is at first familiar at first, seeming similar to real swamps on Earth right up until you see the slimy, aggressive creatures swimming through the water to sneak up on you, or the beautiful moth-like women that scream and dance around in big flourishes while fighting remind you its very much not of this world. (The first time you encounter a new enemy like this youve got to stay vigilant, because basic grunt is just as capable of killing you as a boss if it catches you unprepared.) Since bosses appear in randomized order and each gives a unique trait, playthroughs can be quite different.The flow of progression from boss to boss is pretty simple: you enter a new zone, explore until you find a door to the next area or a checkpoint, go forward, fight the eventual boss, and repeat. Zones are small enough that you dont really get lost, but large enough that it doesnt just feel like a linear series of corridors. Each of those areas is one of a great variety of pre-made hunks that are rearranged each time a world is loaded for the first time (but can be reset without losing your characters progress by re-rolling a campaign), keeping things from becoming predictable even after youve completed the first 18-hour playthrough. Since bosses appear in randomized order during dungeons, and each one gives you a unique trait when you kill it, subsequent playthroughs can be quite different. For example, if you kill The Unclean One boss in the Swamp zone youll get the Glutton trait, which increases how quickly you drink consumables with each trait point spent. Or, if you defeat the Ent boss in the Earth zone, hell drop the Quick Hands trait which improves reload speed. (The developers say youll only see around 45% of the content in a single run.) Its very roguelike in its progression systems, though definitely not in how it handles death  you dont lose everything. But that randomness makes boss encounters even more stressful and rewarding. On top of all that, enemies are randomized to great effect as well. Initial placement of each monster is set when the world generates the first time you enter it, but while youre playing through a level theres a behind the scenes AI director (in the vein of Left 4 Dead) thats picking and choosing when to throw the kitchen sink at you, making sure nothing is ever too predictable. If things are particularly intense, sometimes Remnant will decide to crank things up to 11 and spawn a swarm of small enemies and a miniboss or two and just try to overwhelm you. In the interest of fairness, theres a suspenseful, high-pitched noise when this happens so you arent caught completely off guard. Hearing that sound always gave me anxiety, but it plays in a descending tone once youve killed whatever it spawned to let you know you can rest easy for a few seconds. Combat is absolutely fantastic.Combat is absolutely fantastic. Everything has a satisfying weight behind it, whether it be each of the various gun types or individual melee weapons. Swinging a heavy hammer down to smash through enemies before switching to a shotgun and blowing off heads, then dodge-rolling out of the way of a charging brute is the kind of intensity you can expect in a standard enemy encounter. Theres no block button, so dodge-rolling and stamina management is crucial. You can dodge through enemies and attacks if you time it correctly, so getting into a rhythm is super important and satisfying when you execute it well. Technically speaking there are no classes in Remnant, but at the start you pick one of three different archetypes that simply define your starting weapons, armor, and weapon mod. As you play youll discover new weapons and gear scattered throughout the world every now and then, mostly as hidden secrets, but the majority of your new loot is actually crafted from the materials boss monsters drop. Between these special, secret loot finds, and just upgrading existing gear, that forms the vast majority of the looting experience. Its an interesting way of handling loot in a game like this, but ultimately a more frequent loot drop rate with more potential items would have been far better. Youre more than welcome to re-explore and re-fight zones to grind for experience, but bosses arent there so its not like you can grind for materials to make more of the weapons and gear you want. This meant, for me, that I used the same two starting guns continuously upgraded for the entire first 10+ hours with no need to switch and few options to experiment with even if I wanted to. I was able to upgrade the gear I already had at a far faster rate than the new stuff Id found, which feels like a balance issue. There are certainly some other balance challenges right now, too, especially if you believe the marketing line that says Remnant is playable either as a co-op game or solo. Some bosses feel nearly unbeatable alone, including one that was still standing after more than 40 attempts to take him down by myself. And one enemy type is so aggressive with melee attacks its easy to get stun-locked to death if you dont perfectly dodge each assault, so without backup theyre really irritating. Even given Remnants identity as an unforgiving, punishing experience, some of the difficulty spikes feel arbitrary and absurd. The system works beautifully 90% of the time and will make it much more replayable than its contemporaries in this genre, but there are those rare pockets that just feel out of place. Remnant: From the Ashes delivers a beautifully deranged vision of the apocalypse overflowing with twisted creatures hellbent on making you suffer. The thrill of finally beating a boss thats had your number for hours is right up there with the Souls games that so clearly inspired it, though the underwhelming gear system sometimes brings down the high of overcoming the frequent difficulty spikes. Overall its a solid game that offers one of the best and most rewarding co-op experiences in quite some time, as long as you have a hint of desire to challenge and punish yourself over and over.", "date": "Aug. 20, 2019,"}