{"name": "Rebel Galaxy Outlaw", "name_review": "Rebel Galaxy Outlaw Review", "ref": "https://me.ign.com/en/rebel-galaxy-outlaw/164171/review/rebel-galaxy-outlaw-review", "text": "In spacefaring sci-fi shows and movies  eg Star Wars and Battlestar Galactica  there are two very different kinds of space combat: the slug-fests where battleships duke it out with massive broadsides, and the fast, twitchy dogfighting of fighters buzzing around them. 2015s Rebel Galaxy is an excellent RPG built around the former, and now its prequel spin-off, Rebel Galaxy Outlaw, is an action game that specializes in the latter. Its a flashy, modern revival of the gameplay style of classics like Wing Commander: Privateer and Freelancer, and it even all but eliminates the most annoying part of dogfighting with a creative and entirely optional piloting assist. The campaign missions are stretched over an open region of space thats probably two sizes too large, but theres more than enough going on to make Rebel Galaxy Outlaw a stellar single-player game. You begin this appropriately small-scale, non-galaxy-threatening story as seemingly every space mercenary/merchant/smuggler/miner does: taking any odd job you can find in the hopes of upgrading your bottom-of-the-line ship to something a little less crappy. Protagonist Juno Markev (the aunt of your capital ship-commanding character in Rebel Galaxy) is about as gruff and ornery as they come, and her initial motivation of tracking down the brute who killed her husband sets a determined mood that justifies whatever approach you want to take to fund your quest through a universe full of aliens and Han Solo-esque smugglers. Combat is an absolute necessity for most of the story missions  and for getting from point A to point B in a region of space where the population appears to be about 45% pirate  so it limits your playstyle slightly in that you cant play primarily as a pacifist trader. However, your primary source of income can be anything from bounty hunting (including taking down extremely tough Pirate Lords) to mining asteroids to buying low and selling high as you skip from system to system. Or, alternatively, you could turn to straight-up murderous piracy, attacking juicy freighters and their escorts and stealing their cargo for sale on the black market  at the cost of only being able to dock at pirate or neutral stations. Or, alternatively, you could turn to straight-up murderous piracy.If youve played a 3D space combat game before you may already be pretty weary of endlessly chasing a directional indicator to try to bring your target into your sights before you can even fire a shot  and, considering theyre trying to do the same to you, that may lead to near-endless circling. But Rebel Galaxy Outlaw has a bold and absolutely shameless solution to that, one thats quickly become one of my guiltiest of gaming pleasures. You simply hold a button (left trigger, if youre playing on the strongly recommended gamepad) to automatically pilot your ship, homing in on your target to bring it into view so you can do the fun part of blasting it. Holding LT alone doesnt guarantee youll hit your target, but it gets you pretty close  and thanks to the aim-assist on most weapons on normal difficulty, if you time your shots right you can basically treat it kind of like GTA 5s shooting: left trigger, right trigger, left trigger, right trigger. It sounds incredibly lazy but Im here to tell you it feels fantastic because it creates the illusion of being a great pilot without the drawn-out game of cat and mouse. Before old-school dogfighters are scared away, note that Rebel Galaxy Outlaw comes with a difficulty setting  literally called old-school  that turns all of this assistance off, and also deprives you of everything from a useful weapon to a radar system that tells you anything beyond that there is something there. (If you want to know if that something wants to kill you, youll have to pay for an upgrade.) Having to start from the very bottom definitely makes those first hours more of a challenge  theres significantly more you have to do before you become capable in combat. And once you do, theres some good nuance to fights to learn: besides optimizing your power management, you can execute exciting moves like killing the engine, allowing you to rotate your nose (and weapons) freely as you continue moving in the same direction. The old-school and sim modes also disable the third-person view, which became my preferred perspective because it shows off the highly detailed ships and my custom paint jobs. Ship Painter Rebel Galaxy Outlaws ship painter tool is one of the most elaborate Ive ever seen in a game. Its basically a light version of a painting program like GIMP or Paint.net that allows you to free-hand draw or stencil directly onto your ships textures, and even allows you to use multiple layers for elaborate projects. Its not the most intuitive thing in the world, in part because youre painting on a 3D object instead of a flat canvas, but after watching a quick YouTube tutorial I was able to import a PNG of the IGN logo and splash it all over my ships. Its going to be a lot of fun to see what kind of art people come up with. You can even order a 3D-printed physical ship based on your design, directly from the tool (price TBD). Ain't she a beaut? Its a little disappointing that, despite a good range of ships flying around to shoot at, Rebel Galaxy Outlaw has only five ships you can actually purchase and fly: the starting flying dumpster and two tiers of light freighters and fighters. [Edit: It turns out there are four additional ship variants that can be unlocked through some side missions I didn't stumble upon in my playthrough, bringing the total to nine.] It takes a good amount of grinding out bounties or commodities trading to be able to afford and upgrade each one with new weapons and accoutrements (power plants, afterburners, shields and armor, anti-missile defense, tractor beam, hyperdrive, mining gear, etc) which made progress feel a little slow at times. And once you do get that high-end ship  which is basically essential for surviving on the eastern half of the map, where much of the story takes place  theres not much left to work toward or spend money on beyond repairing your ship after you take a beating in a fight. Every ship is a big deal because they each have their own unique cockpit and HUD layout.But every ship is a big deal because they each have their own unique cockpit and HUD layout, so hopping into a new ship feels like much more than just upgrading your weapon hardpoints, speed, turning radius, and cargo space. As a VR guy, though, its a small heartbreak that Rebel Galaxy Outlaw doesnt let me strap into my headset appreciate them from a true first-person perspective  and follow targets through my canopy as they fly overhead in combat, like you can in Elite Dangerous, Everspace, or EVE: Valkyrie. (Note to modders: if there is no X-Wing/TIE Fighter mod within a week of release I will be forced to take legal action.) Dogfights can get pretty hairy when there are multiple enemies ganging up on you, but there are several ways to turn the odds back in your favor. For one, you can pause the action by bringing up your radial menu at any time, which allows you to take a moment to adjust your power-generation balance between weapons, shields, and engines (or do a quick power dump between weapons and shields) and go into a tactical radar view to get a sense of your situation and set targets. To survive some of the most brutal fights it wont do to mindlessly attack the nearest target, rinse and repeat  you have to take out bigger threats first. Playing the story missions unlocks wingmen who can be called in every 10 minutes, which is essential for making the enemy split their fire between the two of you and take some of the pressure off in a big fight. Each has their own combat banter that led me to quickly pick favorites (I wont say who due to spoilers) but theyre functionally very similar in combat ability. They only stick around for 10 minutes, though, so that 10-minute cooldown can be a little annoying as it sometimes forces you to kill time for a few minutes before starting a tough mission with backup. Most of what youre doing is inherently repetitive  shooting down fighters is pretty much the same thing over and over, and most of the time the generic missions youre sent on have you clearing out pirates who are sometimes attacking freighters or mining ships. Mission variety does eventually improve when Rebel Galaxy Outlaw starts throwing larger frigates, destroyers, and cruisers at you that have turrets you need to strafe, but if youre playing in long sessions, as I was, that can get a little tedious. But of course, the light show of multi-colored lasers, missiles, and explosions flying every which way is constantly entertaining. The light show of multi-colored lasers, missiles, and explosions flying every which way is constantly entertaining.It does do a fairly good job of giving you other things to do between missions, however. When you land on a space station or planet and are treated to a pretty impressive range of landing animations and space dock facilities, visiting the local bar gives you the option to play several minigames  if, that is, you consider a fully functional game of pool to be a minigame. Theres also a slot machine, dice poker, and an Asteroids arcade game clone, most of which can be played for money or, occasionally, a piece of ship equipment. None of it is super deep or meaningful to the story, but it provides a nice break from the grind. Rebel Galaxy Outlaw also does its best to automate away the genres other tedious activity  long-distance travel  but is less successful here than it is with combat. Its a sound idea: if you dont want to sit through the faster-than-light transit between space stations and mission waypoints, you simply hold a button to activate auto-pilot and, after a brief flyby animation, you instantly skip to your destination, unless youre interrupted by pirates or a distress signal (which gives you an optional side mission to rescue a freighter, discover some loot, or get ambushed). The problem is that, on long runs, its just annoying to repeatedly activate autopilot over and over. You jump to a gate, jump through that gate, jump to the next gate, and jump through that  and repeat as many times as is necessary. I wished I could automate the whole process and only get knocked out of it when I had to fight, because seeing a mission description that required more than three jumps immediately made me want to skip it in favor of something more local. When the missions required me to jump long distances I found I was simply chasing the quest indicator on the radar and rarely had any idea where I was on the map  and it barely mattered, because the factions that control or inhabit various regions arent super well fleshed out. They all have their own ships and battle chatter, so in that way fighting the religious fanatics (led by Space Colonel Sanders) is different from fighting the Steel Rat or Red Devil pirate gangs, or the police, but you rarely interact with characters from those factions and you never get a sense of their goals. And because faction relations are limited to your status as either lawful or unlawful, which basically determines whether youre with the pirates or against them, theres little need to keep track. I was generally left with the feeling that a lot of this travel is there to pad out the length of the campaign, which took me around 35 hours to battle through. Trimming some of that out mightve cut down on the feeling of repetition that creeps in midway. The music, though, never gets repetitive because theres simply so much of it. The soundtrack includes more than 20 hours worth, grouped into seven GTA-style radio stations which come complete with their own DJs and in-universe ads. There may not be a lot of recognizable tunes among the country and Latin-rock songs, but its all generally good stuff to cruise and fight to. Rebel Galaxy Outlaw is a very successful throwback to the days of dogfighting games like Star Wars: X-Wing and Wing Commander: Privateer. It smartly updates the gameplay with optional assists that make it a snap to jump in and get right to the most satisfying parts of the action. This open area of space were free to defend or exploit is full of side activities (including a crazy ship-painting tool), and those blunt the inherent repetition of fighter-vs-fighter combat scenarios. And the story  while definitely padded out more than it needs to be  is suitably small-scale and personal for a mercenary/smuggler type like Juno Markev.", "date": "Aug. 14, 2019,"}