{"name": "Fire Emblem: Three Houses", "name_review": "Fire Emblem: Three Houses Review", "ref": "https://me.ign.com/en/fire-emblem-for-nintendo-switch/163616/review/fire-emblem-three-houses-review", "text": "Before its resurgence in popularity on the 3DS handhelds, there was a time where the Fire Emblem series once lived on home consoles. Twelve years after Radiant Dawn on Wii, Fire Emblem: Three Houses has finally returned to the living room on the Switch, and its better than ever. With a vast and open base hub to explore, new ways to turn the tide of battle with your chosen band of colorful characters, and a story thats as brutal as the choices youll have to make on the battlefield, Three Houses is everything Ive ever wanted in a turn-based strategy game. Its grand adventure is filled with drama and intrigue across whichever of the titular three houses you choose to join, and each brings its own unique perspective. Following just one of these paths from humble beginnings to a full-blown war for dominance took me over 70 hours, and left me hungry for more. Battles take full advantage of the relatively powerful Switch (as opposed to the 3DS) to create some impressive looking maps. With new battalions that you can equip to enhance and support your units, armies actually start to look like armies as the map zooms right into the fight to show the opposing forces slam into each other. The music dynamically shifts when moving into combat from its upbeat rhythm to heighten the percussion  raising the tension in the process  before soaring back over the battlefield. I was amazed to find you can even zoom in when inspecting the map to glide along the terrain and see the armies assembled, taking in some extraordinary sights that youd normally only get glimpses of in combat. Youre even able to select and command units by having them run around the field while zoomed in instead of just picking a map point to move to  though its a lot harder to get a sense of the battle from this angle. Fans of the series may notice that the traditional weapon triangle of swords beat axes beat lances beat swords has been all but abandoned in Three Houses. Instead, theres a bigger emphasis on choosing the right weapon for the right person  depending on their skill level and the stats of the weapon itself (swords still have the best overall accuracy, while axes unleash the most raw power, and lances are balanced in the middle). Training up units unlocks many custom moves to make them more effective against armored or cavalry units, and those with high enough proficiency can even unlock breaker skills to give them advantages against a certain weapon type which brings back that weapon superiority feel. Because of this, I hardly noticed the weapon triangles exclusion. I was especially surprised to see several combat arts lifted from the Fire Emblem Heroes mobile game, of all places, and the inclusion of strategic unit repositioning abilities was a most welcome one, allowing me to swap, shove, or quickly relocate my more vulnerable units out of danger. Having equippable battalions of troops that could bolster an individual characters stats meant new strategies too, including the ability to stun attackers in place  and beware, the enemy can use that trick on you if you get complacent in simply forming a wall of tough units. That made me rethink my defensive strategies. Permanent character death is still present if you so choose, and the thought of losing your best units feels as terrifying as ever... Permanent character death is still present if you so choose, and the thought of losing your best units feels as terrifying as ever, until you realize how many options are available to you. Being able to rewind time a bit (which made its debut in the last 3DS game) alleviates many of those fears, and seeing which units your enemies plan to attack can save you a lot of grief as long as youre paying attention. I appreciate that if you challenge yourself to keep going after a beloved character falls, there are many opportunities to try and recruit faculty or students from other houses to join your ranks  or even ask another student to tag along for a single mission. Study Halls Unlike those that came before it, Three Houses provides a welcome respite from battle after battle by introducing the Garreg Mach Monastery, a huge explorable fortress thats home to both a church housing the dominant religion of the land, and an officers academy for the three nations that make up the continent of Fodlan. Students are divided into houses representing these nations, and youll choose one of the houses to teach and lead into battle. Imagine Harry Potters Hogwarts except teenagers come to learn how to do battle instead of magic and Dumbledore is also the archbishop of a powerful militarized church who routinely orders teachers to lead students to war against bandits and blasphemers. The houses of the Black Eagles, Blue Lions, and Golden Deer are unique in more ways than one. Each boasts a lively cast of endearing characters that instantly drew me in, and their individual skills, flaws, and personalities offer an incredible amount of possibilities. Even though your initial house choice is only skin deep, each one gives you so much to work with and discover along the way. What really excited me was just how fleshed out each character was beyond the face value of their personality archetype  and how interconnected and important their own stories were to the world at large. Ingrid from the Blue Lions house idealizes knighthood due to her late fiance (who was the brother of another student), but his recent tragic death caused her to be deeply mistrustful of the people she believes to be responsible (which includes yet another classmate). The young leaders themselves  Edelgard, Dimitri, and Claude  are equally full of promise in both their abilities and backgrounds, and leave enough of an air of mystery to leave you wholly unprepared for where their stories lead when war engulfs the land after a five-year time jump. But a continental war of this scale doesnt just happen overnight. Instead, youll spend the first half of Three Houses epic 70-hour campaign acclimating to life at the monastery through teaching students, wandering the grounds, and undertaking missions for the church. Where instructing students is concerned, Three Houses could have easily fallen into the pitfall of monotony. Instead, the entire process of building up your students abilities and combat arts is quick and efficient, and can even be automated if you so choose. Training becomes a very satisfying way to alter the makeup of your army and adapt to new confrontations. For instance, when my land-heavy army had to fight along the water, being able to plan ahead and reclass several units into wyvern and pegasus riders made me feel like a tactical mastermind. If you dont feel like spending time setting specific goals for your team or nurturing budding talents, letting Three Houses automate the process still ensures your units will follow their own class goals and be ready to fight. the entire process of building up your students' abilities and combat arts is quick and efficient, and can even be automated if you so choose. Three Houses moves the story along on a month-to-month basis, and with a weeks worth of decision making done at a time (which concludes in a few short moments), the bulk of your time is spent on free days at the end of the week, and the story mission battle that caps off each month. Youre smartly given multiple options on how to spend each day off  which lets each of us focus on what we want out of Three Houses. The Explore option lets you walk around the impressively sized monastery in a fully 3D environment  a series first. Its practically bursting at the seams with students and faculty wandering the grounds, so its no surprise that I encountered a few areas of minor slowdown when trying to sprint through crowded areas. Fast-traveling gets around that annoyance, of course. There's so much to see and do that it becomes almost overwhelming, and thankfully the additional areas and activities are gradually rolled out over the course of the year you spend teaching. Despite my lust for battle, I was excited to come back each new month to find new opportunities, like going to the monastery pond for a fishing minigame and then cooking up the fish into stat-boosts for my team, or entering students in tournaments and watching them endure a tough gauntlet of fights to win prizes. Certain activities limit how much you can do in a session, adding an additional element of strategy as you plan out how to spend your finite time. Even hosting tea parties to raise your bonds with a character requires some strategy  as youll need to keep your partner interested by picking from a list of conversation topics that reward you for paying attention to what that characters likes and dislikes are. The amount of choice and freedom of how to spend free days is impressive, and there are pros and cons for every option. If you stick with only one option on your days off, you may find your character and team slipping in certain areas. By exploring the monastery, I was able to chat with students to unlock support conversations and raise motivations, as well as getting faculty training for my own character. But training up skill levels is nothing without a characters own experience, and by taking on auxiliary missions I was able to line my pockets and increase unit levels and stats so they could hit harder using the skills they learned from my teaching. Even resting on a day off ensures that students have an increased amount of motivation to raise their skills during the next weeks lessons, which can heavily impact how much they can learn from a weeks session. I found myself changing up my plans from month to month to better prioritize whatever I felt was lacking, and never once felt like I made a wrong turn to where I was unable to continue. If I had chosen to neglect my time at the monastery, Id likely miss out on some interesting conversations, whereas if I passed over all the side quest battles, I might have missed out some rare loot. Not only does this Fire Emblem have choices that appeal to everyone, it does so in a way that never gets in the way of a continually rewarding sense of progress. Heroes of Academia Bonding with your characters and learning more about them via support conversations has become increasingly popular in Fire Emblem games over the years, and to say Three Houses pulls out all the stops to serve that ever-growing demand doesnt do it justice. The writers and voice actors have done an impeccable job of making each characters quirks, hopes, and fears seem believable  and having a chance to pick some dialogue options (some answers can even further increase your bond) is a nice touch that made me feel more involved instead of just a bystander. It also shows admirable restraint: Three Houses has dialed back on concepts like every character being able to become romantically involved with any other character, and the resulting conversations are better and more focused for it. I especially loved seeing the more hostile character interactions, as having units that worked well together in battle but not in the monastery made these relationships feel more nuanced and human. Certain conversations are only available once the war is underway in part two, giving actual weight to the idea that years have passed since the last heartfelt talk. My only real complaint comes not from the conversations themselves, but the settings they happen in. Instead of putting both characters in a legitimate 3D room for their scenes, they are placed in front of a still image backdrop thats been warped to create the illusion of a 3D environment, and the results range from distracting to disastrous due to the low resolution of the background. Still, Im thankful theres at least a healthy dose of character animations happening to distract from whats going on behind them. While the monastery is loaded with an impressive amount of side activities, Fire Emblem is still, at its heart, a turn-based strategy game  if theyre not your cup of tea (sometimes quite literally) youre able to skip right to the main story mission of the month and automate everything else. I dont entirely recommend doing so (the amount of story content and activity rewards in exploring the monastery at least once a month should absolutely not be missed), and yet its a testament to how much work has gone into making every choice viable in Three Houses. You might be making things harder on yourself by hitting that automation button, but youll still find your team adequately skilled and ready to fight at the end of each month. The amount of story content and activity rewards in exploring the monastery at least once a month should absolutely not be missed. As for the missions themselves, I was really hoping to see more varied main objectives besides the usual defeat the enemy commander or rout the opposing army. Thankfully, many missions include some interesting side objectives  like racing to the aid of trapped allies or cutting off the escape route of thieves  that rewards you for taking on more risks in a heated battle. While Three Houses provides an assortment of enemies to go up against, the three-way battles between the titular groups are easily some of the standout missions of the bunch, and depict the chaos of battle alarmingly well. One such mission (which you can see an excerpt of in the video below) against the other teams found me trying to avoid antagonizing Claudes matured group of Golden Deer students to the west while moving the bulk of my units up to hit Edelgards Black Eagles forces in the east. Without warning, Claude revealed a horde of mounted reinforcements to my side and behind me before all of them charged straight towards my own character  leaving me just a single turn to find a way to reform my ranks before getting flanked. These particular battles required constant rethinking of strategies to emerge unscathed, not to mention having to kill many characters I once regarded as friends at the monastery. The story of Three Houses is expertly woven into the world it builds up: one thats full of political intrigue, deception, and even religious dogma. While part one largely focuses on the mysteries surrounding your own character and their connection to the world and the Church of Seiros, it also sets the groundwork for the transformations of the young leaders set to rule their respective realms. In my first playthrough, I ended up choosing the Blue Lions and aiding the young prince, Dimitri, and Im extremely glad I did. The way Three Houses reveals darker aspects of Dimitris past culminates in a satisfying way, and watching his character arc unfold through the second act was incredibly engaging, down to the way his shouts when performing critical moves reflected his changing personality. I loved how much attention was focused on the relationships between the opposing leaders, Dimitri and Edelgard, in the route I chose, though I did feel like Claude got the short end of the stick in terms of screen time  at least in the Blue Lions path. Even though your days as a teacher are over in the second part of the story, fate has you returning to the monastery regardless of your chosen path to use as a base of operations during the war, and the lack of new activities for your second year at the monastery felt like a bit of a missed opportunity to keep exploration fresh by the end. That said, seeing my students return all grown up was an especially great moment, as was learning how each of them had to adapt during an age of conflict. Three Houses rarely shys away from the grim realities of war  as many of the opponents youll have to face were once students themselves, and the ramifications of fighting former friends is not lost upon your team. An especially somber moment came after a tough battle where one of my units  who I had convinced to join my house five years prior  quietly reflected on how we had just killed her former friend. Its safe to say that any expectations I had about how the story progressed through the war were deftly subverted multiple times. While Three Houses has a definite conclusion to the events of the war that dominates part two, it never truly reveals its full hand in a single playthrough. Seeing so many plotlines left unresolved surprised me, even though I found fulfillment in the 20+ story missions Id completed. But it wasnt until I started again in New Game+ and joined the Black Eagles that I truly realized how much more complementary story content the other two houses had to offer. Im still only a little over halfway into my run with the Black Eagles, and Im already amazed at how much a change in leadership has altered the course of the story. Unlike the routes of Fire Emblem Fates that were two sides of the same coin (and the cant we all just get along extra route), each road taken by the different leaders in Three Houses feels incredibly driven and motivated. These paths may retread some familiar ground in their missions, but the new context and understanding of character motivations, as well as new surprises in some of the maps that are reused make each of the four(!) total routes worth investing in. Fire Emblem: Three Houses succeeds in its ambitious telling of a land at war helmed by captivating leaders, in which no side has all the answers. Its tense battles are made all the more harrowing thanks to new strategy elements, and the colorful cast of troops you send into the fray are incredibly charming. With a new take on training and bonding with your units, and the many activities and options available to sample, its absolutely begging to be played multiple times.", "date": "July 28, 2019,"}