{"name": "Origin EVO16-S Gaming Laptop", "name_review": "Origin EVO16-S Gaming Laptop Review", "ref": "https://me.ign.com/en/origin-evo16-s-gaming-laptop/163479/review/origin-evo16-s-gaming-laptop-review", "text": "Ordering an Origin laptop is as close you can get to a custom built laptop, without actually building the laptop yourself. The company offers a wide range of laptops and even more configuration options. It's likely no two orders from Origin are alike; there are just too many components available for you to pick from. You can even have custom artwork printed on the lid, just to make your laptop yours. And when you're done building the exact system you want, Origin will even ship it in a wooden crate to protect your custom machine for an extra $31. I've been testing a configuration of the company's new EVO16-S that walks the line between high-end performance and affordability when you consider what's inside. It even has a custom Battlefield V paint job, showing off a common scene from Firestorm. Here are the specifications of the Origin EVO16-S I am evaluating: Model: Origin PC EVO16-S (EVO16-S) Display: 16.1-inch FHD 144Hz (1920x1080) Processor: Intel Core i7-9750H at 2.6GHz (12M Cache, up to 4.50 GHz) Graphics: NVIDIA GeForce RTX 2070 with Max-Q (8GB GDDR6) Memory: 16GB DDR4 OS: Windows 10 Home Storage: 500GB PCIe NVMe SSD, 2TB Seagate 2.5~ FireCuda Webcam: 720p Ports: 2 x USB-C Gen 2 port, 2 x USB 3.0, 1 x HDMI 2.0, 1 x miniDisplayPort, 1 x Ethernet, 1 x audio-in port, 1 x audio-out port, 1 x 6-in-1 card reader Connectivity: 802.11ac 2x2, Bluetooth 5.0 Dimensions: 14.9 x 9.9 x 0.78-inches (WxDxH) Weight: 4.5 pounds Price (as configured): $2,539 Origin EVO16-S  Design and Features The EVO16-S is a mid-sized gaming laptop that measures 14.9 x 9.9 x 0.78-inches and weighs a modest 4.5-pounds. Origin shipped my review unit in a huge wooden crate to keep it safe, which seems a bit extravagant but that's kind of the whole deal when you go with a boutique vendor like this. In addition to the review laptop's custom lid, Origin also sent me a standalone lid to show off the company's UV printing. The second lid has a picture of the RPG Dauntless and is my favorite of the two panels I have on hand. The quality, color, and clarity of the prints is impressive. However, I'm not sure I would have a game printed on the lid of a laptop that I'd likely use for a few years. Instead, if I was going to spend $149 for a custom printed lid, I'd opt for something a bit more personal that I'll want to look at a few years down the road. If you don't really care for a custom look, you can pick from a black or red lid at no additional cost. Inside the EVO16-S you'll find a 16.1-inch FHD (1920x1080) 144Hz IPS display with a 720p webcam just above it. Beneath the display is the keyboard with individually lit keys, including a number pad and a glass trackpad that's centered with the keyboard. The trackpad has two physical buttons below it, instead of acting like a giant button itself. Underneath the trackpad is a fingerprint sensor that's invisible until it's needed. At first, I assumed the review unit I received came without the fingerprint reader since most fingerprint readers either take up a corner of the trackpad or are located on either side of the keyboard. However, I began the Windows Hello fingerprint setup process and that's when the fingerprint sensor came to life, revealing its location. The entire look and experience is very similar to that on the Samsung Galaxy S10 or OnePlus 7 Pro. I didn't have any issues with the fingerprint reader. It was active and accurate when I needed to log into my account. The implementation is something more hardware makers need to borrow from Origin. There are ample ports on the EVO16-S, and I fully embrace having two USB-C ports on a laptop. Both USB-C ports join the charging port, an HDMI port, a miniDisplayPort, and a USB 3.0 port on the left side. On the opposite side of the housing are an audio-in and audio out jack, another USB 3.0 port, the 6-in-1 card reader, and an Ethernet jack. That card reader will accept MMC, RSMMC, SD, miniSD, SDHC, and SDHX cards. Origin EVO16-S  Software Origin takes a hands-off approach to software that comes preinstalled. My favorite part? No spammy antivirus software comes preinstalled. The only custom software I found installed on the Origin is Control Center 3.0. This is where you can find system controls for different power modes, FlexiKey settings for macros, fan speed control, and keyboard lighting themes. It's barebones and lacks the ability to save custom lighting profiles and assign them to specific games. The included keyboard effects are par for the course with almost any gaming laptop, as are assignable profiles. Origin EVO16-S  Performance and Gaming Out of all the various configuration possibilities, the review sample I have on my desk right now has an Intel Core i7-9750H, Nvidia RTX 2070 with Max-Q, 16GB of G.Skill Ripjaws memory, 500GB Samsung 970 EVO Plus SSD, and a 2TB Seagate 2.5~ FireCuda HDD for extra storage. Here's how that stacks up compared to other RTX 2070 laptops in our suite of benchmark tests: Even though the EVO16-S was outperformed by the Alienware m15 in nearly every test, those results aren't disappointing. With all three systems having the same core components, the difference in performance comes down to how each laptop maker tunes and optimizes the Max-Q version of the RTX 2070 for their respective setups. Alienware tuned the m15's RTX 2070 to a base clock of 1,080MHz with a boost clock of 1,305MHz. The RTX 2070 in the EVO16-S and the Lenovo Y740 have the same base clock speed of 885MHz and boost clock of 1,185MHz. When you take that into consideration, the benchmark numbers begin to make sense. The Alienware is also more expensive. Benchmarks only tell part of the story, with real-world use and gaming making up the rest. And when it comes to both scenarios, the EVO16-S held its own. I spent most of my test time in Apex Legends gearing up for Season 2 and experienced consistent performance around 95 frames per second with graphics settings on high. Occasionally that would jump up to 110 FPS and stay there for a minute or two, but 95FPS seemed to be the sweet spot. With a custom Battlefield V panel on the back of the laptop, it was only fitting that I test out the RTX 2070's real-time ray tracing capabilities. With DXR (and the rest of the graphics settings) set to high, the EVO16-S hovered right at 100FPS. My time playing Fortnite was limited, however, the EVO16-S handily kept the FPS right at 120 with Epic graphics settings. I can't help but think that the display on the EVO16-S is one of the better FHD displays I've used. As a byproduct of my job, I've looked at a lot of laptops screens. A lot of FHD laptop screens, at that, and I can't help but think that the display on the EVO16-S is one of the better FHD displays I've used. The colors are tuned just right, there's ample brightness and plenty of clarity in the graphics. I don't know if there's some sort of magic sauce that Origin uses when tuning its displays, but whatever it's doing, it works. The housing surrounding the keyboard, especially on the left side, gets warm even after short amounts of taxing the system. The fans do a good job of staying quiet while not letting the housing get too hot, but you'll surely notice the heat when you place your palm on the housing. I liked using the trackpad for non-gaming tasks. It's smooth and responsive. The keys on the keyboard are evenly spaced and trigger with little pressure. The keys are similar to a lot of gaming laptops in that they mimic smaller keys, but provide some tactile feedback when pressed. With all of the customization options that Origin offers, I would love to see an option for a more robust mechanical keyboard. The EVO16-S can but upgraded at home by removing a handful of screws from the bottom of the housing. There are a total of three storage slots and a max of 32GB of DDR4 RAM. The 500GB SSD included on my build was enough space for all of my games and test programs, and the additional 2TB of storage is way more than I use even in my desktop. If you're like me, save yourself some money and opt for a 500GB SSD and a smaller hard drive. Origin EVO16-S  Battery Life Battery life of the EVO16-S is not that good. Origin's claim of six-hour battery life is overly optimistic. I looped a video with 50-percent display brightness, keyboard lighting, Bluetooth, and location services disabled and the EVO16-S lasted 97 minutes, or 1 hour and 37 minutes. You'll want to keep your power adapter with you if you plan on using the EVO16-S in school or work. The Origin EVO-16S can be as powerful or affordable as you want to make it. The core experience and performance is going to remain mostly the same regardless, and overall it's pretty awesome. That means there's little to complain about aside from meager battery life when it comes to the EVO16-S.", "date": "July 23, 2019,"}