{"name": "Sea of Solitude", "name_review": "Sea of Solitude Review", "ref": "https://me.ign.com/en/sea-of-solitude/162895/review/sea-of-solitude-review", "text": "In this beautiful, flooded world, humans turn into monsters when they become lonely - but that loneliness takes plenty of different forms. Sea of Solitude is all about navigating dangerous waters, both literally and metaphorically. Its a story-driven adventure game with powerful and surprising moments. It reaches a narrative high point early, but unfortunately and cant ride that wave for the entire story. The gameplay fails to evolve, resulting in a monotonous experience that feels like a missed opportunity when compared to its strong start. Guided by your trusty flare, you play as Kay, a young woman who is desperately trying to become human again. I adored traveling through Sea of Solitudes gorgeous and ever-changing environments and was happy to see the light flare mechanic used in creative ways, beyond just giving directions. Kay is tasked with getting rid of corruption swarms scattered around the world in the hopes of shining a little light for other monsters and herself. This involves walking up to light thats trapped by dark clouds and then holding down a specific button. Sometimes these corruptions are a challenge to reach, but more often than not theyre just a matter of walking right up to them and, well, pressing a button. Its something to draw you through the world, but its rarely satisfying to pull off. Your boat is your main mode of travel and it provides refuge from the darkness the monsters thrive on. Its convenient and intuitive to use, and Sea of Solitude provides a good mix of sailing and exploring on foot to keep things fresh. There are two specific monsters that serve as recurring obstacles throughout the story: a sea monster that can make crossing over water from buildings to bouys a heart-pounding race and a shelled monster girl who blocks paths and loves to explain how you suck. The first time I saw Kay get caught by the sea monster and tossed in the air like a rag doll I was thrilled. But that same animation plays every time it catches you, so what was impressive initially felt like old news by the fifth or sixth time I saw it. The magic of it was replaced by disappointment. Monsters Sink But youre not just avoiding monsters, there are also some you help turn human again by clearing corruptions and listening to their stories. And throughout the adventure, Kay is constantly reminiscing on her own behavior when it comes to the people in her life. Sea of Solitude does a good job tackling relatable situations that I dont often see represented in games. For instance, one of the first story arcs deals with Kay neglecting her brother because shes so infatuated with her boyfriend. And it was genuinely compelling, getting to know the winged monster that helped her take ownership of her shortcomings was lovely and heartbreaking all at once. Sea of Solitude's heavy-handed writing often gets in the way of the story it's trying to tell. Most of all, I respect that Sea of Solitude isnt all happy endings. Things dont always turn out how Kay wants, but eventually she accepts that the right decision isnt necessarily the ideal one and that not all relationships can last. Its a shame that Sea of Solitudes heavy-handed writing often gets in the way of the story its trying to tell, since its hard to buy into a relationship where someone says youre the kind of person I could imagine having kids with on the first date. If that was me, I would be asking for the bill early. Intense screams and overuse of exclamations such as leave me alone! felt overly dramatic and consistently took me out of the story. The voice acting didnt help in this regard because the larger than life cadence of the monsters often made things feel like an overacted stage play rather than a series of real conversations. High and Low Tides Scattered throughout the world are different collectibles to find, the best of which are the messages in bottles. They serve as both a fun thing to hunt for and an interesting and eerie reminder that others have been here before. While these are optional to the main campaign, going out of my way to get them was a great way to add an extra challenge. Plus exploring and enjoying the lovely environments was one of the best parts of Sea of Solitude. The other collectible you can track down is, by comparison, a snooze. You just have to find seagulls and shoo them away. Thats it. Theres no real point to it, no story reason for doing so, and it seems unnecessarily rude to the seagulls. Every area you discover looks beautiful, but a lot of it also looks extremely similar. This made it hard to tell where Id been before when hunting collectibles and made certain sections, such as the skyscraper, dull to explore. That said, the challenge of making it to the top of that tower was a welcome change of pace because it ramped up the otherwise easy platforming obstacles with plenty of jumps and some strategic gusts of air. There are other sections in Sea of Solitude that made me uncomfortable and anxious in the best way possible. The school chapter, in particular, was my favorite. From close calls with evil bullies to fumbling around in the dark, I felt like I was living the nightmare Kays brother Sunny faced every day. It was a good kind of awful that was narratively eye-opening. There were sections that made me uncomfortable and anxious in the best way possible. The school chapter also establishes that gameplay loop of meeting a monster, getting to know their problems, and then getting rid of corruptions until theyre human again very early on. Thats fun for a time, but unfortunately it never really changes in interesting ways as you play, eventually getting overly repetitive. Towards the end of the four- to six-hour story, theres a slight variation on how you clear corruptions where you have to work with NPCs to reach some swarms that are otherwise inaccessible, but this quickly becomes a boring back-and-forth. Sea of Solitudes potential is never fully realized. Its beautiful to look at, but it ends up being a lovely splash in a shallow pond. The story was compelling enough that I wanted to see it through to the end, but the repetitive tasks within it lost their charm in the first half. While not a long game, by the end of Sea of Solitude I just wanted things to be done. It felt like it ran out of things to offer me long before it ended. There are some enjoyable, even magical moments, in Sea of Solitude but theyre mixed in with some mediocrity that make it just a decent experience rather than sublime one.", "date": "July 7, 2019,"}