{"name": "Steel Division II", "name_review": "Steel Division 2 Review", "ref": "https://me.ign.com/en/steel-division-2/162713/review/steel-division-2-review", "text": "One of my only disappointments with Eugens Steel Division: Normandy 44 was the lack of any love for my beloved Eastern Front of World War II. Steel Division 2 corrects this, adding tons of new, historically-grounded units and divisions from the iconic T-34 tank to the lesser-known woman-led Soviet sniper teams. It does almost everything Normandy 44 did as well or better. But just about everything new it tries gets bogged down in the mud. If you played the original, Steel Division 2s multiplayer and skirmish vs AI modes are going to seem very familiar. You select one of 28 thoroughly-researched historical divisions from either the Allied or Axis side to serve as the base deck for your forces. There is a lot of fun tweaking to do here as you have to consider trade-offs like having fewer, more hardened troops with higher stats but also higher costs, or a larger number of weak and cheap rookies. And Steel Divisions three-phase battle system makes a return, adding the extra wrinkle of having to think about which units are going to become available in the early, middle, and late parts of the battle. Not all of the units are impressive to look at, though. The tanks, planes, and other vehicles are lovingly modeled to a very high level of detail. But infantry didnt get the same treatment. You wont be zooming down close enough to see them very often, but most humans in Steel Division 2s world look like action figures that got left out on a hot day for too long. Its slightly terrifying. Division Decisions Attacking on a Breakthrough map is tense and can alternate between euphoric and frustrating based on how well your advance is proceeding. The available divisions include some very interesting new possibilities that open up tactics you wouldnt see in Normandy 44. The late war on the Eastern Front saw two juggernauts that had been bashing heads for years having to make due with what was around, leading to some memorable and different formations like the ragtag and disheveled German Gruppe Harteneck, which takes the normally pressed and prepared Wehrmacht and shows off what theyre reduced to after a hard night of trying to invade Russia. The Soviets really steal the show, however. I fell in love with the long-suffering 184-ya Strelkovy, a defensively-minded infantry division that gives a starring role to sharpshooters and offers that dramatic feeling of holding the line against overpowering odds. The 184-ya do particularly well in the new Breakthrough mode, which is the best new feature of Steel Division 2. Rather than having two sides try to fight for control of a neutral battlefield, Breakthrough gives the defenders almost all of the map to deploy on and challenges the attackers, who start with just a sliver, to break through the enemy lines by any means necessary. Building defense in depth is extremely important on the defensive side, and the way it forced me to think in terms of multiple, flexible lines instead of a single, rigid one felt refreshing. Attacking on a Breakthrough map is tense and can alternate between euphoric and frustrating based on how well your advance is proceeding. General Disaster Unfortunately, Steel Division 2s biggest new feature is kind of a flop. The Army General mode tries to add a strategic campaign layer on top of the tactical battles, and it has some good ideas. Units move across the turn-based strategic map with realistic speeds depending on terrain, roads, and whether theyre made up mostly of guys, tanks, or trucks. When meeting the enemy, the phase each unit deploys in is based on how far they are from the initial point of engagement. This sounds cool in theory, but it led to some vexing situations like going up against an enemy armored emplacement with artillery support using only recon units and having to wait an excruciatingly long time for my armored support to show up... at which point the battle was pretty much lost already. The amount of fiddly campaign movement needed to alleviate this makes the whole thing feel like herding cats. Steel Division 2's biggest new feature is the Army General mode, which has some good ideas but is kind of a flop overall. To frustrate me further, I ran into a couple of instances where the End Turn button would lock up and stop my progress entirely. And the whole thing is also very poorly explained. There is no tutorial, but rather an in-game manual that I was never told about until I found it by accident after several turns of flailing around trying to figure out how anything works. Its text-heavy, without only static images and charts as examples. Oh, and theres not even a tutorial for the tactical battles anywhere. Normandy 44 had a very good one, but those who are picking up the sequel as their first Steel Division game are going to be very confused. And for such a complex game, that is not a small problem. Overall, the map design remains strong. Eastern Europe offers a wide variety of forested wildernesses, marshy flatlands, and rugged villages that feel much wilder than Normandy 44s green fields of France. Hit-and-run tactics and commando gambits with roughnecking infantry work great on many of these battlefields and are a lot of fun to pull off. Unfortunately, they also share some unintuitive line-of-sight issues with Normandy 44. Placing a sniper on a hilltop feels like it should give them good vision of the entire village on the other side of the river below. But due to the engines overly strict, simulationist rules for acquiring targets, something like a very minor contour in a hillside that you cant even see from a birds eye perspective may prevent this. Steel Division 2 continues the series tradition of tactically deep, enjoyable, historically-grounded World War II real-time combat. The new Eastern Front divisions bring plenty to the table to reinvigorate the multiplayer and skirmish modes. The combat mechanics themselves havent evolved all that much, but they work well enough without trying to reinvent the wheel. Just stay away from the Army General campaign. And if you didnt play Normandy 44, youll probably need to give it a spin first as it does a great job of explaining a lot of things that Steel Division 2 wont even bother to.", "date": "June 30, 2019,"}