{"name": "Bloodstained: Ritual of the Night", "name_review": "Bloodstained: Ritual of the Night Review", "ref": "https://me.ign.com/en/bloodstained-ritual-of-the-night/162613/review/bloodstained-ritual-of-the-night-review", "text": "The thriving subgenre of Metroidvania games exists to try to recreate the magic of classic Metroid and Castlevania games -- because original developers Nintendo and Konami dropped the idea long ago. Bloodstained: Ritual of the Night achieves this goal better than most because it plays and feels almost exactly like the legendary Castlevania: Symphony of the Night. It should, considering that was the whole pitch of the Kickstarter back in 2015, and that the team behind it is led by Symphonys assistant director, Koji Iga Igarashi. Granted, not all attempts at crowdfunded spiritual successors to beloved games end up successful (looking at you, Mighty No. 9) but the stars have aligned for Bloodstained. Ritual of the Night has emerged as a game worthy of its heritage. The number of Castlevania games Iga has been part of stretches into the double digits, but he couldnt just bring Dracula back again and throw another Belmont into a castle this time. While the gameplay is familiar, an interesting new world with its own heroes, villains, and stakes (not the vampire-killing kind) has been created, and every aspect of it seems to be designed specifically to support the mechanics of this type of game. You play as Miriam, an orphan girl with the ability to absorb and wield a ridiculous number of demon powers. A lot of care was put into Miriams design, and shes cosmetically customizable as well  its a shame that the supporting cast did not receive the same TLC as our heroine and are all pretty ugly. Bloodstained plays and feels almost exactly like the legendary Castlevania: Symphony of the Night. As luck would have it, this evil castle just popped up and its filled with demons! So, in you go to methodically expose the enormous castle map, fight cool monsters, gain experience, and craft increasingly powerful weapons with all the bizarre loot you find. (Why was that demon dog carrying curry powder?) Weve done this a dozen times in Castlevanias, but not since Symphony have we been able to do it with the power and real estate of a home console and a television. Its clear Iga and his team put as much content as they could into Bloodstained to make sure their return to the genre was a triumphant one. My adventure took about 20 hours to track down the real ending, which is quite a bit longer than the 12-or-so hours you might spend with Symphony. Even after all of that, Im excited to get back to it because exploring the castle is so much fun and I still have two percent of the map to uncover and more demon powers to unlock. There are some expected (double jump) and unexpected movement abilities to find that really let you master the terrain. The locations gradually expand from typical haunted castle areas like cathedrals and secret labs to some surprising environments you wouldnt normally expect to find, um, indoors. There are also darkly beautiful sights in the castle that showcase impressive lighting effects and moonlit vistas. Even the save rooms and fast-travel locations look great. The enormous wealth of powers and weapons to find means there is a lot of room to customize your own play style. I had a lot of success with a good one-handed sword and a passive ability that increases its damage combined with a shield of portraits that float around my body (think the leaf shield from Mega Man 2), an arrow attack for when I needed to take out an enemy at range, and a familiar I could summon that can point out destructible walls hiding secrets. But if youre more comfortable with slower, more powerful weapons, guns, or kung fu, there are options for you to hack, shoot, or kick your way through the castle. I found 79 demon powers (63 percent) in my playthrough, and just over 50 percent of the discoverable items. So theres a lot out there! The randomness of loot drops means its not always straightforward getting the tools you want, but Bloodstained never feels like too much of a chore because simply running around slashing monsters is fun. Of course, that randomness is one of the key features that separates these Igavanias from similar games. The monsters are some of the best parts of Bloodstained. Despite the fluid and satisfying combat that feels lifted directly out of the classic games, a few fights  especially one late-game boss battle  produced some slowdown even on a PlayStation 4 Pro, and there were a couple of crashes when I was attempting to read a tome. There can also be a slight delay when bringing up the pause menu for some reason. The monsters are some of the best parts of Bloodstained. From giant cats with demon horns to horses that can swim underwater to shredding guitar players, there is always something fun to kill while exploring the castle. Some of the bosses will be familiar to people who played the 8-bit prequel game, Bloodstained: Curse of the Moon last year. Having played that spinoff, it was pretty cool seeing those characters return as gigantic 3D models. All characters are capably voice acted, and they even got Solid Snake himself, David Hayter, to voice a significant role. Both English and Japanese voice tracks are included, something I always appreciate for Japanese-made games. The soundtrack was composed by Castlevania veteran Michiru Yamane and Mega Man veteran Ippo Yamada. Its a very nice score that evokes classic Castlevania adventures, but I dont think it matches the mastery of Symphony of the Night. Im still humming that games tunes 22 years later, and I dont see Bloodstaineds music sticking with me the same way. Note that the Switch version is currently experiencing major performance issues and INTI Creates has issued a statement that it is shifting focus to address them. There is no shortage of good Metroidvanias these days, but Bloodstained does show that Koji Igarashis particular brand of Igavania still has teeth. Exploring the castles many secrets is a delight, and there is a dizzying array of weapons and powers waiting to be bent to your will. Castlevania: Symphony of the Night, one of the greatest games ever made, finally has a worthy successor on consoles and now on PC.", "date": "June 26, 2019,"}