{"name": "Samurai Shodown [2019]", "name_review": "Samurai Shodown Review", "ref": "https://me.ign.com/en/samurai-shodown-2019/162555/review/samurai-shodown-review", "text": "While it may not be a household name like Street Fighter or Mortal Kombat, Samurai Shodown is a storied fighting game series with a legacy to uphold. The 2019 version, which is simply titled Samurai Shodown, does a great job of bringing its unique brand of methodical footsies-based 2D duels into this modern era of fighters. Samurai Shodown finds itself on the fighting game spectrum somewhere in between Street Fighter and Divekick, meaning its not about combos, juggles, block strings, frame traps, or other high-level fighting game techniques. Instead, it strips all of that away, leaving a game that is laser focused on careful positioning, reading your opponent, and brutally punishing their mistakes. This level of simplicity definitely has its appeal, and Samurai Shodown strikes a good balance between approachability and deeper mechanics that helps separate those who just mash special and heavy attacks from those who take the time to learn. Nuances like the best times to deflect, when to spot dodge, when to trigger rage explosions, when to use Lightning Blade attacks, and when to close your eyes, cross your fingers, and use a Darli Dagger punch to pull a victory out of thin air are all part of the mix. Back to Basics Despite the graphical facelift, not much has changed in the decade since the last Samurai Shodown with regards to the basics of combat. Theres a great and easily understandable logic behind each of Samurai Shodowns four buttons: light attacks and kicks are quick and can interrupt slower attacks, medium attacks generally have long reach and can serve as great pokes in the neutral, and heavy attacks are huge, slow swings that deal appropriately massive damage but also come with a significant risk. Getting a heavy attack blocked generally means youre open to eating a huge punish, but whats wonderful about Samurai Shodown, is the fact that mind games are prevalent at just about every juncture. As an example: Let's say my heavy just got blocked, which is typically very bad. But, if I predict that the opponent is going to retaliate with their own medium or heavy, I can use a deflect to cancel the block stun animation, knock the sword out of their hands, and score a counter for myself. On the other end of that though, if they predict Im going to do deflect, instead of using a heavy strike, they can utilize a move that cant be deflected, like their one-time-use super-special move and deal about 80% of my life as damage. And thats one of the things that makes Samurai Shodown so much fun. You get massively rewarded for good reads and massively punished for big mistakes, and while thats true in other fighters too, its on another level here. There's an extraordinarily tense style of fighting that is unlike just about anything else in the genre. There's an extraordinarily tense style of fighting that is unlike just about anything else in the genre There are a few elements on top of the four-button simplicity that add some extra depth. Returning from previous Samurai Shodowns is the rage gauge, which increases as you take damage or land well-timed Just Guards. Maxing it out increases the strength of your attacks for a short while and also gives you access to your weapon-flipping super-move, which not only does huge damage but also disarms your opponent, forcing them to scramble to pick their sword up off the ground. Alone, the rage gauge is a great comeback mechanic, but what makes it extra special is the ability to use a rage explosion at any time to instantly gain full rage and the ability to use the devastating lightning blade attack. The trade-off is that once you trigger a rage explosion, you lose your rage gauge for the remainder of the match, which puts it in a good spot as a big risk vs reward trump card. My only issue with the whole system is that I wish the rage gauge had some sort of timer or something to let you know when its about to run out, because theres nothing worse than having an opening for a weapon flipping super, inputting it, and then realizing that your rage had just expired. If you get disarmed, you're at a huge disadvantage, but you're not completely helpless. Each character has a unique set of punches and kicks, with some characters even still having access to their command grabs even while weaponless. The coolest part about trying to fight while disarmed though, is when you're able to perform a deflect at just the right time to catch their sword with your bare hands, disarm them, and even the playing field. The Seven Samurai Plus Nine Samurai Shodowns cast of 16 wildly different characters is one of the best things it has going for it. Each one is brimming with personality, from the returning screen-filling Texan ninja, Earthquake, to the brand-new clumsy Chinese warrior Wu Ruixiang, who summons a dragon on accident for her super move and fumbles around looking for her glasses when shes disarmed. Its adorable. There are a ton of interesting small details to each character as well. The seven-sword-wielding Yoshitora has a ridiculously overpowered special move that he can only use if he manages to land all six of his other special moves in a round; Nakoruru can hang on to her bird and freely fly around or shoot towards her opponent on a split-seconds notice; and then theres the aforementioned Darli Dagger, who can deal 60 to 70% damage with an unarmed armored punch. You can learn a little bit about each of these characters through a traditional, by which I mean outdated, story/arcade mode that gives each character an intro, a conversation between themselves and a rival character, and an ending  and thats it. That may have been fine in 2005, but the bar has been raised for fighting game story modes since then, not only by big-budget games like Mortal Kombat and Injustice, but also by Guilty Gear Xrd, BlazBlue, and SoulCalibur 6. The worst part of it all, though, is the 30 seconds of a boring black loading screen that happens between each match. Thats far too long for a fighting game. Hitting the Dojo Along with Story Mode, Samurai Shodowns set of modes is pretty standard. Theres a basic tutorial that teaches you about the various mechanics; a score-driven gauntlet, survival, and time-trial modes. Theres offline versus and online versus for both casual and ranked play, with the casual option sporting rooms for up to 10 players; and finally a Dojo mode that allows you to play against ghosts of other players, which are created based on their playstyle. Or at least, thats the idea, but the reality is... not very impressive. I dont know how many fights you need to play to really program your ghost to behave like a real person, but every ghost Ive played essentially just jumped up and down, never approached, and utilized special moves seemingly at random. I did get to test the netcode while playing against a buddy in casual play, and the results were remarkably smooth. However, the real test will be at launch when youre able to match against all sorts of connections, so Ill keep an eye out. For as much as Samurai Shodown manages to successfully modernize the classic fighting series and recapture the tension of its high-stakes duels, in other ways it remains woefully in the past. The archaic story mode and long load times are a bummer, but in the areas where it matters the most, Samurai Shodown shines as a fundamentals driven fighter that can appeal to players of all skill levels with its easy to grasp combat, wonderful cast of characters, and deep mechanics.", "date": "June 25, 2019,"}