{"name": "Nex Machina", "name_review": "Nex Machina Review", "ref": "https://me.ign.com/en/nex-machina/134682/review/nex-machina-review", "text": "When a top-down shooter like Nex Machina comes along, Im reminded that even in this age of procedural open worlds and emergent storytelling, you dont need a lot of buzzwords to have a good time. Its five stages of simple, fast, sometimes frantic bot-blasting can be daunting to the unprepared. But when I got a good run going, the responsive controls and exciting, sci-fi graphics made my frustrations with its sometimes nasty death penalty worth it. Each stage is divided up into rooms where you have to defeat several waves of robotic enemies, optionally saving defenseless humans to increase your score, before proceeding to the next. The baddies are both visually interesting and clever in their design, and every world introduces new ones so the combat never feels repetitive. Like in one of developer Housemarques previous games, Resogun, saving the human hostages adds a sense of urgency and encourages you to take risks and get aggressive. One of the main twists that separate Nex Machina from the typical top-down shooter is that as you progress through a level youll accumulate a set of power-ups that can come in any order. These include increasing your weapon spread, granting you a single-hit shield (normally you die from taking a single hit), and upgrading your dash from a speedy escape tool to an attack that deals explosive damage. Getting fully powered up is fun and rewarding, but it lacks variety since a fully powered-up character always has the same set of abilities in each of the five levels. Getting fully powered up is fun and rewardingThe way the powerups work with death also lends itself naturally to a sort of failure spiral that I wasnt especially fond of. When you die, you drop one power-up and have to get back to the place you died to recover it. Corpse runs are a fine challenge, except that if you lose all your lives and are forced to use a continue, you lose all but one of your power-ups. That creates some ridiculously tough situations because the difference between a full brace of power-ups and none at all, especially on some of the stage bosses, is absolutely night and day. More than once, this forced me to restart a level because I died at or just before a boss, after having slogged through over a dozen extremely challenging rooms, and simply didnt have enough mobility or firepower to have the slightest chance of coming back from that to win. Its a sort of artificial spiral that punishes you for failure with more failure, making subsequent attempts more difficult than the first, which doesnt make a lot of sense. Expect a lot of restarts to get that one, perfect run on higher difficulties. The art really steals the show from level to level, acting as a bit of a balm on the grind of getting demolished over and over as you learn the ropes. Each environment, from the depths of a smoldering volcano to a brutalist, dystopian cityscape, has a strong sense of personality and is filled with little details that add to the ambience without becoming distracting. The enemy designs are simple but effective, with distinct silhouettes that let you quickly distinguish which ones are dangerous in which specific ways while theres utter chaos unfolding all over the screen. The explosions for the various special weapons and death animations for bosses and minions are also highly satisfying, and supported by impactful sound effects. Depending on the difficulty level and your own skill, it might take you anywhere between three and 10 hours to beat Nex Machinas arcade mode, in which you play through all the levels in order. But beyond its first playthrough, its set up to be a great platform for challenge-seekers and high-score chasers. The most interesting of these is arena mode, which challenges you to complete a single level with some kind of modifier (enemies are sped up, or having to complete the level in a limited time), awarding you bronze, silver, and gold medals for meeting certain score thresholds. Youll also be ranked on a global leaderboard for each challenge and earn XP to level up your profile, all of which seems like an exciting way to engage the community with an ongoing quest for bragging rights. Despite the frustrations its upgrade system often caused me, I had a good time navigating Nex Machinas array of twin-stick shooter challenges. The appealing art, energetic soundtrack, and pixel-perfect gamepad controls made me own every failure and look forward to whatever might come next. Arena mode seems to be where most of the lifespan on this one will come from, and I look forward to seeing people who are better than me at it pull off some crazy runs to climb the rankings. Nex Machina is not for the faint of heart, but a recipe to delight those looking for an attractive, arcadey challenge to overcome.", "date": "June 24, 2017,"}