{"name": "My Friend Pedro", "name_review": "My Friend Pedro Review", "ref": "https://me.ign.com/en/my-friend-pedro/162443/review/my-friend-pedro-review", "text": "The crazy 2D-shooter action of My Friend Pedro is about one thing and one thing only: the word cool. It almost feels like it was developed with the single-minded purpose of distilling the pure essence of the word, then somehow translating that into a video game. And in that singular pursuit, My Friend Pedro is a resounding success. My Friend Pedro is an arcadey score-attack game thats all about maintaining a multiplier by killing enemies quickly, avoiding getting shot, and finding creative ways to take down each bad guy to maximize your score. Its an age-old concept (especially not getting shot), but where My Friend Pedro sets itself apart is in its sheer commitment to making you feel badass as hell while doing it. Bullet time is the core that My Friend Pedro is built on, and while the mechanic itself is obviously nothing new, its implementation here is one of the best its ever been. It serves not only as a vital means of slowing down the action, but also as a way to enhance the absolutely wild stunts that your character can perform. Few things in video games can come close to matching how cool it feels when you swing from a rope, crash through a window in slow motion, blast two enemies to smithereens with a shotgun while in mid-air, and then stick the landing on a skateboard. The few things that do come close are probably also things that you can do in this game. Bullet time is the core that My Friend Pedro is built on, and while the mechanic itself is obviously nothing new, its implementation here is one of the best it's ever been My Friend Pedro is made up of a ton of awesome moments like these, and throughout its short but sweet four or five-hour run time developer DeadToast does a great job of introducing new mechanics that prevent the action from ever becoming stale. Whether it be the aforementioned skateboard, a weapon that opens up excitingly deadly possibilities, new stage hazards, enemies, or its own twist on a motorcycle stage. My Friend Pedro has some sort of new idea for just about every level. That being said, the first half is certainly the stronger of the two. The stunts flow together much more cleanly with very little downtime between enemy encounters; enemies are less bullet spongey, allowing you to focus more on the spectacle of the action as opposed to just surviving it; and overall, the levels are just structured in a way that allows you to have more fun with the environment. My favorite level in the whole campaign is an early one with a section that has you shooting your way through a kitchen, with knives flying everywhere that can be kicked into enemies, a frying pan hanging from the wall that can be used to ricochet bullets  and then, in the room right after that, theres another area where you can throw a frying pan into the air to take out all the enemies above then kick the pan through a window in the next area and take out the baddies without even stepping through the door. The later sewer and internet levels just dont come close to matching that degree of flow from one area to the next. Thats not to say that the back half is bad, and there are certainly high points. One such highlight is a train level that has you jumping from car to car, leaving a trail of blood and body parts in your wake. But the most creative and exciting levels are definitely frontloaded. Graceful Destruction Beyond the bullet time and the stunts, My Friend Pedro simply feels great to play. The animations do sometimes look a little wonky, especially during wall jumps, melee attacks, and when your character has to unexpectedly land on an object. But its a small price to pay for how dynamically your character flips through the air, seamlessly moving from a dive to a rope swing and back to a dive, all while conveying a real sense of weight and momentum. While the arsenal of weapons is fairly limited and conventional, theres a great balance between each gun that helps ensure that no weapon ever becomes obsolete. Shotguns, for example, are obviously great up close and can blow enemies to pieces (and you can use those pieces as weapons to kick at other enemies), but they lack the range and flexibility of the dual uzis and pistols which can split their aim to attack multiple targets at once. Story is obviously not a focus of My Friend Pedro, which is great because its pretty awful at telling one. You play as a nameless and voiceless protagonist who wakes up in the basement of a butcher shop where youre greeted by your friend, Pedro: a talking banana who tells you to do bad things. The few jokes that attempt to bring life to an otherwise-dead script fall completely flat, like one about a place called The Internet literally being a series of tubes, or how hardcore gamers all moved to the sewers because... there are always sewer levels in violent games, and they wanted to move someplace familiar. Fortunately, the story doesnt get in the way of the action. The few cutscenes that do exist are short and painless, and any added dialogue takes place while youre able to play, making it unobtrusive. It is also a short adventure, but the length wouldnt be as much of an issue if there were any sort of incentive to replay on its harder difficulties, such as striving to get those S ranks. There are leaderboards, and sure, bragging rights are great, but it would have been nice to have a few more tangible rewards like unlockable costumes, weapons, or anything to keep me chasing those high scores. Like the John Woo movies that it successfully emulates, My Friend Pedro is all about the action  and that action is excellent. The slow-motion gunplay, fantastical stunts, and score-attack-driven mechanics all work together to create one hell of an adrenaline-filled ride, even if it doesnt give you much reason to come back to it once that ride is over.", "date": "June 22, 2019,"}