{"name": "Turtle Beach Recon 70 Gaming Headset", "name_review": "Turtle Beach Recon 70 Gaming Headset Review", "ref": "https://me.ign.com/en/turtle-beach-recon-70-gaming-headset/160632/review/turtle-beach-recon-70-gaming-headset-review", "text": "The $39.95 Recon 70 is the entry-level model in Turtle Beachs line of gaming console headsets. Its a basic, wired headset with different colored versions for the Nintendo Switch, Xbox and PS4. I received the Switch model, which features a red-and-black color scheme. The Xbox model features green accents, and the PS4 model features blue accents. Other than color scheme, all of the Recon 70 models are the same. The headset connects via a standard 3.5mm audio jack, so you can use it with a console, PC, laptop, tablet or phone  anything with a standard audio plug. The headsets cable is short, however, so its best suited for a game controller as opposed to a PC under your desk or a phone in your back pocket. As always the big question with a really affordable headset is whether or not it's a good value, or just cheap and flimsy? Lets take a closer look. Turtle Beach Recon 70  Design & Features Theres no denying that the Recon 70 is a budget headset, but its not bad looking. Its made entirely of plastic, from the headband and telescoping extenders to the earcups and boom mic. The plastic surfaces have a matte finish, however, that lends a hint of luxury to the design and is pleasing to the touch. The headset also feels rather solidly constructed. It doesnt creak or crack when you take it on and off your head, and it has enough heft that it doesnt feel like a cheap toy while also not feeling too heavy either. It pretty light at just 232 grams, whereas something like the HyperX Cloud Stinger weighs 275g. The earcups and headband padding are coated in a synthetic leather that feels smooth but can get a little toasty during a long session. Still, I prefer pleather to a rough, scratchy cloth covering. The padding under the headband is minimal but offers enough of a cushion that the headset felt comfortable on my head. The padding on the earcups, however, is ample. The earcups are ergonomically oval in shape  preferable to round in shape  but they are on the small side. I have smaller-than-average ears and had to slide the earcups back and forth a bit each time I put the Recon 70 on my head so that my ears slipped inside the padding instead of being pinched by it. Lastly, you can rotate the earcups, which helps create a comfortable fit against your head and especially against your upper chest when the headset is resting around your neck. Controls are minimal on the Recon 70. Theres a volume dial on the back of the left earcup but no mute button. The affixed audio cable is unbraided and short, measuring only 48 inches in length. On a PC, youll need to connect it to a combo headphone/mic audio port in order to use the microphone. If your PC has separate headphone and mic ports, then youll need an adapter. Also on the left earcup is the flip-down microphone that is not detachable but mutes when flipped up. The boom arm of the microphone is short at only three inches. It does not reach to your mouth but hangs out by your left cheek. My initial concerns about its ability to pick up my voice cleanly, however, where assuaged, which Ill cover in detail in the next section of this review. Finally, the Recon 70 has 40mm drivers, which isn't unheard of at this price point, however some of its competitors such as the Corsair HS50, HyperX Cloud Stinger, and Roccat Cross offer more powerful 50mm drivers. Turtle Beach Recon 70  Performance Turtle Beach sent me the Switch version of the Recon 70, but I have an Xbox One, so I used that for my console tests. And then I connected the headset to my iPhone to test how it handled music playback and to my MacBook Pro to test how videos sounded. High frequencies of pistol and rifle fire snapped and sounded crisp. On the Xbox, Star Wars Battlefront 2 started the Recon 70 off on the right foot. The John Williams-inspired score by Gordy Haab sounded dynamic, and the games dialog was clear, but more importantly, the games sound effects exhibited great power and dynamic range. Explosions and lightsabers clashing sounded big and powerful, and the high frequencies of pistol and rifle fire snapped and sounded crisp while rockets and heavy blasters sounded and felt concussive. The games stereo sound moving between the left and right channel was convincing and made the sound field feel large. It also helped provide a sense of direction in the game because I could hear from which direction shots and enemies were approaching. Next, I played Need for Speed, and the Recon 70 put me right behind the wheel, with rich, realistic sound effects as I careened down the road. I did feel the need to turn down the volume level for the music in the games settings to bring the sound effects more to the forefront of the mix, but I do that when listening on my TVs speakers, too. I played Need for Speed, and the Recon 70 put me right behind the wheel, with rich, realistic sound effects as I careened down the road. I also played Madden 19 and NHL 19. The ambient stadium sounds of the crowd sounded loud and detailed in both, and the announcers calling the game could be heard clearly, and the big hits on both the gridiron and ice could be felt. On my MacBook, the Recon 70 displayed its dynamic range while listening to Vulfpeck videos on YouTube, from Joe Darts bass on the low end to Woody Gosss keys on the high end, with Jack Strattons funk guitar filling in the mids. On my iPhone using Spotify, Courtney Barnett and Kurt Viles song Over Everything sounded a tad flat, with little separation between Barnetts and Viles vocals and the rest of the mix. Instant Disassembly from the Parquet Courts showed the same lack of depth, favoring the low frequencies at the expense of the highs and mids. Also on my MacBook, I tested the mic by making a voice recording. Despite its short boom that positioned the mic next to my cheek instead of out in front of my mouth, it was able to cleanly pick up my voice, which sounded clear and natural. With its attractive design, solid build quality, and strong gaming performance, the Turtle Beach Recon 70 is a great budget headset, but the slightly more expensive HyperX Cloud Stinger delivers a bit more comfort and audio oomph.", "date": "May 5, 2019, 1"}