{"name": "SteamWorld Quest", "name_review": "SteamWorld Quest Review", "ref": "https://me.ign.com/en/steamworld-quest-1/160300/review/steamworld-quest-review", "text": "Despite being full of cards, SteamWorld Quest doesnt feel like a card game. As the first RPG in the SteamWorld series (the excellent SteamWorld Dig 2 being the previous entry), it bears far more resemblance to a game like Final Fantasy than Hearthstone or Gwent. Instead of letting its deck-building mechanics take over entirely, they instead give SteamWorld Quest one of the most flexible and fun turn-based RPG combat systems Ive played with in a long time. Steam World Quest tells the charming tale of a group of ragtag fantasy robots out to save the world from an evil army, rising to the threat before them despite their inexperience. Its not exactly a unique premise (except for the robot part, I suppose), but the twists and turns it takes along the way make it stand out in interesting ways, and the big bad behind it all is a compelling one to fight. The story digs into larger themes about heroism and growing up with some nicely written dialogue thats never long enough to drag the action down, and can even be genuinely funny or touching at times. You assemble a traditional RPG party of three fighters, but instead of giving you the routine choice of regular attacks and spells to use each turn, youre limited to only the six Strike, Upgrade, or Skill cards in your hand. Those are drawn from a 24-card deck made up of three individual eight-card decks that you build for each of your active fighters, making it a mix of moves that could change dramatically depending on who you are using in any given fight. That unpredictability keeps you from falling into any sort of repetitive rut and constantly forces you to improvise. Quest's characters can each be built a variety of different ways depending on what role you want them to fill. Each of Quests characters has their own varied and specialized pool of cards to pick from, as well as an appealing personality that I enjoyed watching grow over the course of its roughly 15 to 20-hour campaign. While they generally stick to recognizable RPG archetypes  the small but passionate Copernica acts as the mage, while the large but lovable shut-in Galleo is more of a tank  each one has a multitude of different strategies available to them. You could outfit Copernica with nothing but damage-dealing spells, or skew her more toward a support role with buffs and shields. Similarly, while Galleo has plenty of cards to taunt enemies and soak up damage, he can also be used as a healer or even a damage dealer in his own right with the proper setups. I loved that none of those inherent styles felt wrong, and I frequently switched them up or mixed them depending on the roles I picked for other people in my party. Every characters card pool grows and upgrades significantly as you progress and Quest really starts to shine as your options expand. But even as more strategies open up, you are still only ever picking any eight cards you want each character to equip at a time, and that simplicity keeps deck building from ever feeling overwhelming. Its all the choice and variety I love from card games like Slay the Spire in a bite-sized form  granted, I missed many of Slay the Spires quality-of-life touches, like automatically updating a cards displayed damage based on an enemys weaknesses or being able to look through your remaining deck, but it works well enough. In combat, you always draw up to a hand of six cards and get to play three per turn before the enemy gets to attack, keeping things straightforward on the surface with lots of room for strategy underneath. While basic cards can be played for free, they generate Steam Pressure (SP) that powerful cards then need to spend to be played. That means you have to build up and use your SP carefully, taking potentially weaker turns to prep for future (harder) hits. Building your deck with the right balance of cards that consume and generate SP is also vital, and a fun puzzle to solve. The battle system kept me constantly thinking about what to do next and which move was best. On top of SP is a clever combo system that went a long way toward constantly keeping battles fresh. Playing three cards from the same character in a single turn activates a special fourth card for them that's determined by their equipped weapon  for example, Copernicas ability to shield her entire team was a staple of my current run  while some other cards get bonus effects if they are played after one from a specific teammate. I loved how much that made me think about every choice I made, whether I wanted to go all-in on one character or use multiple people for a wider variety of effects. It also made weaving together the strategies of my different decks feel important and engaging. If the partys plucky leader, Armilly, was in my line-up with Copernica, I might use her cards that weaken an enemys fire resistance alongside Copernicas fire attacks. But if I swapped Armilly out, Id usually revisit Copernicas deck and replace her fire cards with ones that dealt lighting or ice damage. These intertwined combos are all over the place, and constantly switching my party up to find new strategies never got old  especially as I got more characters and loads more cards. New cards arent awarded on level-ups, instead unlocking through hidden treasure chests, cute story events (if a character has a formative moment, they might get a card to represent that growth) or through crafting in the shop. SteamWorld Quests economy can be seriously pricey, though, and I never felt like I had enough money or crafting materials to get everything I wanted, sometimes to my frustration. You get so many cards already that I was never hurting for choice, but it could often be discouraging to have to pick just one or two options out of a dozen or more each time I went shopping. Quest's card crafting can be discouragingly expensive, but it thankfully never felt like I needed to grind to progress. Granted, and crucially, you dont need to get everything. Nothing about the campaign felt unbalanced, and I never once had to grind to stay up to snuff with enemies. It was just a little bit of a bummer to see so many different and cool options in the shop that I wasnt able to invest in. Again, I was never left wanting when it came to discovering new strategies, but I also had to leave a few intriguing ones on the table that were just too hard to pivot to in the mid-to-late game. That immense card variety is seriously important, too, because while the combat was always fun and changing decks could often result in entirely new and unexpected playstyles, the enemies dont stay quite as interesting. Bosses are unique and exciting, but there just arent that many types of the basic grunts. They come in different flavors throughout, and theres definitely enough that it doesnt feel jarring or anything, but it was a shame to occasionally see stuff like recolored versions of enemies I fought in the first couple levels show up later on with higher stats and only slightly altered attacks. SteamWorld Quests levels are split into chapters rather than having a more traditional open RPG map to explore, which somewhat annoyingly forces you to mash B to skip through all the cutscenes when you replay them looking for any secrets you missed. They are mostly just a series of simple corridors to fight enemies and look for hidden chests in, with some light puzzles to break up the pacing. They range from a cheery, green village to a pompous magic academy to a dangerous, snowy fortress and beyond, and the varied art and music behind them are so lovely that it kept things fresh all the way through the 17 hours it took me to finish its story. SteamWorld Quest is far more of an RPG than it is a card game, but its deck-building twists offer an insane amount of gameplay choice. Its charming characters have tons of individual strategies to explore, which are then influenced by who else is in your party, and again by what cards you actually draw and the order you play them. Because of limited enemy variety and level design, it doesnt change a whole lot throughout the campaign unless you actively play around with your combat options, but doing so is endlessly rewarding. Its simplified deckbuilding makes Quest an RPG thats as accessible as it is flexible, and its one worth playing even if you dont care about card games at all.", "date": "April 24, 2019"}