{"name": "Super Smash Bros. Ultimate: Joker Challenger Pack", "name_review": "Super Smash Bros. Ultimate: Joker Challenger Pack DLC Review", "ref": "https://me.ign.com/en/super-smash-bros-ultimate-joker-challenger-pack/160209/review/super-smash-bros-ultimate-joker-challenger-pack-dlc-review", "text": "If theres one thing thats become readily apparent with DLC guest fighters appearing in the Super Smash Bros. series, its the unreal amount of care and detail put into making them feel right at home in Nintendos fighting game. Persona 5s Joker is no exception. The first of the five planned Super Smash Bros. Ultimate Challenger Packs, which are available for $6 individually or $25 for all five, Joker may seem like an odd duck at first, given that his native JRPG isnt even available on the Switch (for now?). But between the flashy fighting thief and his bombastic stage, the choice is a surprisingly fitting one. And even if you arent familiar with Persona 5, its signature slick design is present and eye-catching in almost every aspect of the Joker content. As a fighter, Jokers moves translate extremely well into the realm of Smash Bros., between the sharp red accents flying alongside his knifes slash and his cinematic final smash that might be one of the most entertaining finishers yet  and winning the match with the All-Out Attack is just icing on the cake. Even his victory screens take perfect cues from his source material, and yet never feels out of place. Joker's stylish moves translate extremely well into the realm of Smash Bros., especially his epic final smash. Jokers fighting style isnt the most technical or complex to get into, and theres just the right amount of individuality to his moves that make him an interesting fighter to pick up and learn. Hes fast, but not the fastest, and his pistol shots and side special can be used in inventive ways to reach where his short-range dagger cant. I really enjoyed Jokers added movement abilities when using his firearm to give him some interesting options compared to other fighters  like being able to seamlessly dodge back or jump over an opponent while laying down fire to hamper incoming attacks. The pistol itself doesnt have too much power or speed to it, but the trade-off for its mobility softens that blow. The big trick up Jokers sleeve is the ability for him to raise his Rebellious Nature meter, which happens more rapidly when taking damage or using a special blocking move. Filling this meter will summon his Persona, Arsene, as a phantom ally that increases his damage output and puts some fun twists on his special moves. For instance, his Grappling Hook recovery move is fairly limited in use and scope  but with his Persona powering him up, Joker is able to fly upwards at a much higher rate while also evading incoming attacks, which can put a wrench in an opponents plan to guard the stages edge. That said, Im not quite sold on Jokers Rebellious Nature meter slowly raising even when just standing around. Sure, it does take three whole minutes for a full charge if you arent doing anything else, but being able to play keep-away from opponents as the last of your meter fills feels at odds with the nothing ventured, nothing gained mechanic of soaking up incoming damage in order to raise it more quickly. Having to put yourself in harms way felt like a proper check and balance on how much more powerful Joker is with his Persona. The included Mementos stage is chock-full of tiny details to appreciate and fun references to its source material Jokers Challenger Pack also comes with his own stage, Mementos, which has to be one of the most eye-popping arenas in Smash Bros. history. The stage is chock-full of tiny details to appreciate and references to its source material, from the subtle purple sparks that fly along your feet to the cameos from Jokers friends and the subway cars that roar by and threaten to slam into opponents falling below the stage. Persona 5s acid jazz-inspired tunes might not perfectly sync with the more hectic matchups of a Smash Bros. fight, but theres something groovy about a 1v1 match-up set to Persona 5s Rivers in the Desert. Having the stage change from its stark red to cool blue or yellow as a reference to Persona 3 and 4 when one of their songs is playing from the 11 new music tracks is another really fun touch. I was also really happy to see a special DLC Spirit Board included that allows you to fight 11 Persona-themed Spirit Battles that have a great range of difficulty and can all be replayed. Its easy to tell just as much thought went into making Joker as structuring rules for these battles, like having each of the spirit characters aided by a huge ally acting as their Persona. And of course Futabas Spirit Battle would be represented by an Inkling who looks just like her. The Joker Challenger Pack is a great addition both for Persona fans and those looking to add another unique fighter to Super Smash Bros. Ultimates already diverse roster. With the inclusion of an incredibly flashy stage, new Spirit Battles to challenge, and tons of visual touches that go beyond just adding a new fighter, this content has a lot of heart.", "date": "April 20, 2019"}