{"name": "Pathway", "name_review": "Pathway Review", "ref": "https://me.ign.com/en/pathway/160183/review/pathway-review", "text": "If youve played your fair share of roguelikes and turn-based tactics games, Pathway presents as a familiar and extremely appealing package. Most obviously, it is a hybrid of XCOM-style combat and board game-style movement punctuated with text-adventure-style scenarios, a la FTL. But upon closer inspection, youll also find shades of Into the Breach, Diablo, and Dead Cells. All of this is neatly wrapped in pixel art representing World War II-era colonial Africa and the Middle East, which loudly calls back to Indiana Jones. It delivers the promise of putting all those pieces together seamlessly, but only to a point: Pathway is designed to be endlessly replayable, but barely has enough variety to sustain a single playthrough of its five mini-campaigns. Pathway is, more than a strategy game or an RPG, a run-based procedural adventure game. You lead a crew of up to four adventurers on a road trip across the desert, charting their path by moving their jeep from node to node on a large and relatively plain game-board-like map. Each node presents a flavorful text-based scenario that generally leads to a handful of options, like giving or taking resources, presenting a tactical choice, or combat (some of which is optional and some mandatory), which plays out in turn-based tactical battles on a grid. In addition to those on-the-spot choices at each stop, some light resource management creates a broader tactical layer on the world map. You have a limited amount of gas for your jeep  far less than youll need to make it across a map, much less doing so while making detours to check out to the few highlighted spaces where you can find a shop, a place to rest and heal your team free of charge or add a new character to your party. Similarly, your crew shares a cache of ammo which needs to get topped off every so often. Youll find both resources at random points and get a chance to earn them after winning a battle. Managing these resources, plus your characters health and armor, creates an exciting tension when it comes time to choose between picking a fight, which risks health and ammo, versus fleeing and risking the possibility of your gas tank running dry and forcing you to take damage by marching through the desert on foot. This is where Pathway gets really interesting and starts to fall apart all at once.This is where Pathway gets really interesting and starts to fall apart all at once. Almost every step of each journey is randomized to some degree. The tactical maps and the scenes they offer are procedurally generated; when youre presented with a choice, such as whether to sneak into a Nazi campsite and steal supplies rather than just fight, the results are decided with a dice roll. The emphasis on randomization keeps each scenario exciting even if youve seen it before, as you can't ever memorize how to handle them. But that level of randomization goes a little too far, as its all too possible to run out of gas by virtue of a few bad dice rolls early on, through no fault of your own. Wisely, Pathway gives you a way to avoid this: In addition to the varying difficulties of each campaign, there are two difficulty sliders  one that makes enemies weaker, and a second that lets you start with more gas and ammo. While it takes a little bit of drama out of crossing the desert, I found that starting with extra resources offset the frustration that arose the few times fate left me high and dry. To maximize its variability, Pathways story is broken up into smaller chunks that give you more options from run to run. You choose one of five campaigns at the outset, each of which has a setup thats loosely based on popular movies set in the period. One is essentially a retread of Raiders of the Lost Ark; another sounds very similar to the 1999 action movie version of The Mummy. No matter what you do, the functional task is the same: Race the Nazis and/or an ancient, zombie-loving cult across the desert to save something. The stories are basically inconsequential, as you only hear about the plot a few, very brief snippets. That the journey feels like window dressing shouldnt be an issue since you are meant to see each portion of it many, many times as you replay it, but the writing is drawn too broadly in most cases. Most of the adventures you get into, both the central plots and individual scenes you come across along the way, have very little detail and rarely go beyond a basic functional explanation. One of Pathways main draws, at least for me, was its aesthetic and the potential for worldbuilding in a setting thats familiar but rarely used in games, so it was disappointing to scratch the surface and find it was only a thin coat of paint. Moreover, since youll play through at least 10 to 15 scenes per map screen, that paint gets routinely stretched over a very large space even on the first playthrough, nevermind the tenth. Though each run is highly changeable, Pathway is a roguelite, meaning that your characters upgrades are persistent from one randomized run to the next. At the start of each adventure, you choose a pair of adventurers from a cast of cliche but effective archetypes who range from Baron Von B. German, monocle-wearing conman, to American Globetrotter Jackson Sheffield. As in other roguelites, the characters evolve and grow across each adventure, gaining experience and leveling up regardless of whether you win or lose, and keep whatever gear they find: There are multiple versions of each weapon, armor type, and item, plus color-coded variations on each, so they are bound to improve over time. Pathway smartly mandates some variation in your tactics.Each character has his or her own stats, skills  most of which dictate what kind of weapons they can use  and perks, which create extra opportunities in some scenes outside of combat: In one scenario, for example, I came across a man lamenting that his camel was sick and dying. Most of the time, nothing happens in this scenario  you just move on  but if you have Natalya, the medical expert, she can treat it to earn a reward for the whole team. Alternatively, the archeologist Leonora De Quincey knows ancient languages, so she can read inscriptions on temple walls and monoliths that, more often than not, keep you from falling into ancient traps. Even with persistent characters, though, Pathway smartly mandates some variation in your tactics. Over the course of each story, youre likely to expand your crew from two to as many as four by recruiting other random members of the team who are scattered across the desert. (There are also a few hidden characters not on the roster who can only join your adventure mid-way). Though starting with only two characters can be a hindrance in the early goings, as youre always outnumbered in combat, it is always exciting to bring a new character aboard, and figure how to use a team that hasnt been built to work together presents its own challenges. Speaking of which, when you get into a fight, the combat feels like very simple, very standard tactical-RPG fare. You move around a grid, looking for XCOM-style full or half-cover positions that minimize your risk of getting shot while giving you the highest aim percentage, increasing your chances of taking your opponents down. The combat is meant to move fast  your health and armor, both of which only recover using recovery items, are pretty limited resources, so you need to take enemies off the board as quickly as possible. While that tracks  most of my battles only lasted a few minutes  the fights dont feel all that tactical. Each character gets a couple of special abilities based on their equipment and every weapon type and most armors confer a special combat action, which is powered by Bravery points you earn every time you use a standard attack. Many of those abilities give you more firepower  both shotguns and assault rifles have special attacks that let you shoot groups of enemies, for example  rather than a tactical advantage that will allow you change AI patterns and control the battle. Without many options for defense or deterring mobility, most fights really boil down to who can outflank the other and pull the trigger fastest. Also, win or lose, any characters who die on your journey have to sit out your next run, unless you pay your persistent currency to expedite their recovery. That system has advantages and disadvantages: On the one hand, it deftly pushes you to use and build up all of your characters instead of focusing on a chosen few, especially in the early going when you only have a handful of choices. They differ enough that each starting pair has their own appeal. On the other, it sets a meandering pace, especially as youre working through the campaigns for the first time. If you see one specific duo as your A-team, using other characters every other round feels like a waste of time. Pathway is a small game with big ideas. Sometimes that makes for an excellent adventure, but in this case the two feel out of sync. There are a few outstanding big-picture ideas, like the concept of a procedural road trip with survival mechanics and the thought to blend roguelite elements with tactical-RPG combat: Those ideas really shine when you first start playing, but it becomes very clear over time that each of its core components needs more depth to be as replayable as the games it takes inspiration from. Like bubble gum that loses its flavor, you can keep chewing on Pathway as long as it makes you happy, but that rush you enjoyed when you first unwrapped it isnt coming back no matter how hard you grind.", "date": "April 18, 2019"}