{"name": "Dangerous Driving", "name_review": "Dangerous Driving Review", "ref": "https://me.ign.com/en/dangerous-driving/159841/review/dangerous-driving-review", "text": "Arcade racing games havent exactly been plentiful in recent years  nor has EA shown the slightest bit of interest in reviving the best of them all, Burnout (which saw its last new, proper entry in 2008 with Burnout Paradise). And so here comes Dangerous Driving  made by some of the original creators of Burnout, no less  to pick up the slack. The good news for both Burnout and arcade racing fans is that outside of a padded-out campaign and a bit of high-speed frustration, it largely succeeds in picking up the mantel. Dangerous Driving follows developer Three Fields Entertainments own Danger Zone 2, its excellent revival of Burnouts most memorable section: Crash mode. Dangerous Driving resurrects the rest of the Burnout modes, including races, face-offs, eliminations, burning lap (now called Shakedown), and most notably Road Rage mode. It feels as crunchy and sadistic as ever to strafe the bumper of the car just ahead of you at 150mph, especially knowing youll send it slamming into the guard rail in a fiery explosion and be rewarded for it. Later versions of Road Rage races  you get at least one in each of the six vehicle-specific campaigns  add welcome and challenging wrinkles like requiring you to smash rivals into civilian traffic in order for your takedown to count. Above: Our review of Danger Zone 2, that last game from Three Fields Entertainment that revived Burnout's Crash mode. Later Pursuits throw several vehicles at you and up the chase speed so it gets really hectic and really fun. The other highlight mode is Pursuit, which mixes Burnout with Need for Speed: Hot Pursuit (which these developers also worked on after Burnout) by requiring you, driving a police car at recklessly high speeds, to wreck a fleeing suspect before they can escape. Naturally, they wont go down in one hit, and later Pursuits throw several vehicles at you and up the chase speed so it gets really hectic and really fun. It comes with a catch, however, in that not every mode is nearly as good as those two but youre forced to play most of them to unlock the next group. In fact, theres a pretty steep drop-off. Elimination events, in which the last-place finisher of each lap gets booted from the race, works nicely enough, but standard Races get repetitive rather quickly due to how long they get, the one-on-one Face-Offs grow stale when you either get crazy far ahead or left hopelessly behind, and overall the six driveable vehicle classes dont feel different enough to merit slogging through the same 12+ events in each on the same handful of tracks just to unlock the best car classes later. If Dangerous Driving were to drop the SUV and the Coupe requirements and let me go straight from the Sedan to the Supercar  or perhaps structure the campaign so that you had more free reign over what events to do and what cars to drive  it mightve actually been better off for it. Sometimes less is more. Exacerbating this is a menu system that doesnt describe what each event is; you dont learn that until you sit through a loading screen and get ready to race. And while I do love how absolutely blazing fast the events get towards the end of the campaign  you basically have to hit your turbo as often as possible and keep the pedal to the metal and power slide your way through the corners to have any chance to win, truly requiring the dangerous driving for which this game is named  the margin for error becomes so impossibly slim that you sometimes cant avoid crashes on blind corners or hills. That can frustratingly ruin your chance to place in the event by shoving you too far back in the pack to catch up before the end of the run. But it sure feels good to be back in these familiar surroundings. Burnout fans will likely appreciate that Dangerous Driving makes no attempt to hide its Burnout-y intentions. Everything about it, from the interface to the fonts to the track settings to the sound effects, are either literally or damn near straight out of the beloved old arcade racing series. It looks and feels as if Three Fields sought to rebuild Burnout in the Unreal Engine, running at 60fps on modern consoles (up to 1440p on Xbox One X). The sensation of speed absolutely comes through, complete with sparks shooting out of the bottom of your race car at 220mph. As a long-time Burnout devotee, Im very glad Dangerous Driving got made. It is a wonderful complement to Danger Zone 2; together, they are basically Burnout 6 and the world is better off for it. That said, a drawn-out campaign and less-fun secondary events create a little too much drag on its standalone fun.", "date": "April 9, 2019,"}