{"name": "One Piece: World Seeker", "name_review": "One Piece World Seeker Review", "ref": "https://me.ign.com/en/one-piece-world-seeker/158928/review/one-piece-world-seeker-review", "text": "I love One Piece. I love its world, its characters, and its sense of humor, all of which are wonderfully realized in One Piece World Seeker. As an original and interactive One Piece adventure, World Seeker actually delivers a respectable story with interesting new characters, written by Eiichiro Oda himself. Of course, in order to get to that story you have to first play One Piece World Seeker, which is about 20 hours of boring, repetitive, and at times downright infuriating open*world gameplay. World Seeker drops you into the red vest, blue shorts, and flipflops of Monkey D. Luffy as he and the rest of the Straw Hat Pirates arrive on Prison Island in search of treasure. As it turns out, the treasure was a lie, and the crew now find themselves split up and stranded on the island as a nefarious plot starts to unfold in the shadows, with the islands warden, Isaac, at the center. Though it starts slow because of the sheer volume of inconsequential sidequests that get in the way of the main plot, the overarching story is by far the best part of World Seeker. Prison Island is an interesting setting that I was happy to learn more about as the story went on, and the two original characters, Jeanne and Isaac, wound up being the highlights as the story approached its climax and surprisingly emotional ending. World Seeker's story is surprising in all the right ways.Its nowhere near the quality level of a standard One Piece arc, but for what essentially amounts to filler, World Seekers story is surprising in all the right ways. It helps, too, that it looks way better than it plays, and that the big moments are told via beautifully rendered cutscenes featuring full voice acting from the usual cast, along with the fantastic Rikiya Koyama and Ayumi Fujimura as Isaac and Jeanne respectively. The smaller moments are told with single-line quips and text, but the animations are charming and perfectly encapsulate each character. Unfortunately, while the story gets much better as it goes on, the actual gameplay of World Seeker does not. Punching and Gathering World Seeker is a bland and formulaic open-world adventure, which means youll spend a lot of time going from waypoint to waypoint, taking on main missions and side missions that both have you going to a spot, beating up a bunch of dudes, collecting a bunch of meaningless sparklies on the ground, or opening treasure chests that take an excruciatingly long time to reveal their contents. This wouldnt be quite as tiresome if at least the gameplay offered some variation in how you accomplish this same handful of tasks, but the combat in World Seeker is just as repetitive and boring as its mission design. To his credit, Luffy has two Haki stances that he can swap between on the fly: Observational Haki stance focuses on quick strikes and evasive movement, while Armament Haki focuses on slow-but-strong attacks and a tankier style of defense that allows you to block powerful strikes. Enemies barely do anything that would require you to give any thought to the combat whatsoever.The problem is that the enemies barely do anything that would require you to give any thought to the combat whatsoever. For the most part, it didnt matter what kind of enemies I faced or which of the stances I use, because I still just got up in their face and mindlessly mashed the same button until everything was dead. (Its hard to get creative when the obvious solution is right in front of you, and less obvious solutions arent any more fun in the first place.) There are a few enemies, like the shielded marines and robots, that require you to use ranged attacks, but apart from that, every fight against regular enemies played out almost exactly the same way. That got old within an hour, and there were 19 left go. Completing missions rewards skill points that can be used to purchase new abilities from four skill trees, but none of them evolve the combat in a way that makes it any more interesting. Sure, getting Bazooka in the Armament stance gave me a way to deal huge damage to single targets, but ultimately all it did was make it so that instead of running into a fight pressing one button a bunch of times I just ran into a fight holding one button for a few seconds. Its not interesting. The issues go way beyond just the repetition, though. Several aspects of both the combat and mission design are at best poorly thought out or at worst straight-up terrible. There are insta-fail stealth missions despite the fact that World Seeker has basically zero stealth mechanics, and there are needle-in-a-haystack missions where you must talk to virtually every NPC on the island to find the three that actually have relevant information. The worst is a required treasure hunt mission with a map thats ridiculously misleading and doesnt correspond to the landmarks in the world. Not Quite Spider-Man World Seeker is at least close to making navigating its large open world a joy, but it doesnt quite hit the mark here either. Luffy can zipline to them and propel himself forward. In certain situations, this is fun in the same way that web-zipping around New York City is fun in Marvels Spider-Man. But while Spider-Man has a whole assortment of moves designed to keep his momentum going in just about any environment, Luffy isnt quite built the same way. He cant run up walls, he only has one-air dash that can only be used once he loses momentum, and he can only swing at designated areas in just one city. This makes traversal feel way more stop and go than it really should be in a game like this. Not to mention the fact that if you try to rocket around any heavily guarded city or base, snipers will just shoot you out of the sky, forcing you to take the long way around. Fortunately, theres a generous fast-travel system, so getting from place to place is at least quick and painless as long as youve already been there. Perhaps the biggest shame about World Seeker is that One Pieces greatest strength is in its characters, and yet the rest of the crew are not much more than glorified NPCs. Franky and Usopp sell equipment and costumes, Sanji sends other crew members off on expeditions with boxed lunches he makes, Zoro is lost all the time, and the rest of the crew just typically just show up in random quests to tell you to collect X amount of Y. Its too bad, because a lot of the issues regarding the repetitiveness of gameplay feel like they could have been remedied if the entire burden of 20+ hours of gameplay didnt have to fall squarely on Luffys rubbery shoulders. World Seeker looks the part of a breakout single-player One Piece game, but its many problems become apparent almost immediately after picking up the controller. Repetitive combat, cumbersome movement controls, and a few outstandingly bad missions get in the way of what otherwise would have been a very respectable One Piece story. Quite simply, One Piece deserves better.", "date": "March 14, 2019"}