{"name": "Danger Zone", "name_review": "Danger Zone Review", "ref": "https://me.ign.com/en/danger-zone/133548/review/danger-zone-review", "text": "On paper, Danger Zone looked set to be a Burnout fans dream come true. In it, Burnouts original creators would take a fresh crack at the gameplay that defined their careers  all while the actual Burnout IP collects dust on EAs shelf. And while it does perfectly recreate the memorable Crash mode from a gameplay mechanics perspective, it omits almost all of Burnouts summer-y, tongue-in-cheek personality, and alternate modes. The result is a bare-bones game thats good for a few hours of fun, but lacks staying power. Danger Zone does indeed only consist of one mode: Crash Testing, which includes 20 Crash Test Junctions. Each Junction is an intersection you launch your car into at high speed, and they have to be approached strategically to inflict maximum damage and collect as many power-ups as possible. Who should you hit first? Where should you fling your car using the mid-air Aftertouch controls after triggering your Smashbreaker explosive? All that experimentation makes it feel more like a puzzle game than a racer. Know too that youll fail, and fail often; the Retry button will get a workout. And though loading times arent too bad on PS4, theyre just not quite quick enough to be painless. When you get a good run, medals ranging from bronze to platinum are awarded based on your score, with built-in leaderboards serving as a passive nudge to keep you playing for a higher cash total. And thats...about it. There are no new cars to earn. Plus, theres no summary screen to give you a big-picture look at how youre doing across the three Test Phases that make up the campaign, theres no soundtrack to speak of, and every junction is set inside the same drab, gray concrete virtual simulator. With no sunshine, no busy, realistic metropolitan intersections, and (I cant believe Im saying this) no DJ Stryker, Danger Zone just comes across as lifeless. Furthermore, the lack of car deformation is disappointing. Sure, your ride will get scuffed, scraped, and scarred to Hell and back, but the lack of proper damage modelling  in a game purpose-built for crashing cars into other cars  is quite unfortunate. Though, to be clear, it nevertheless remains fun to smash into cars and cause giant explosive pile-ups. Its as if Danger Zone, taken as a whole, simply reanimates Burnouts body but cant bring back its soul. Danger Zone is a simple and barebones game that manages to recapture some of the car-smashing action of the classic Burnout series, but not enough of the joy. Though Burnouts Crash mode was always the star of the show in those games, it turns out that Road Rage, Burning Lap, etc. defined Burnout just as much as Crash did, as well as its personality. Their absence here is felt deeply, though to Danger Zones credit its priced accordingly at just $13. As such, its worth a look for Burnout veterans, as long as you calibrate your expectations appropriately.", "date": "June 2, 2017,"}