{"name": "Trials Rising", "name_review": "Trials Rising Review", "ref": "https://me.ign.com/en/trials-rising/158498/review/trials-rising-review", "text": "Ive long since stopped physically leaning into my turns while playing racing games, but something about the Trials series still has me twisting and jumping in my seat as if doing so will just give my rider that little bump they need to get over an obstacle. The nail-biting reaction time and delicate finesse required to get through the hardest courses Trials Rising has to offer makes them as thrilling to overcome as ever, driving me to return to them to crash and burn and improve my times endlessly. Counterproductively, though, it works against that urge with some tweaks and new additions which take the focus off of that loop of self-improvement and put it instead on repetitive challenges and discouraging PvP competition. Trials Rising is still fundamentally Trials, which is good because Trials is still fundamentally awesome. Something as simple as driving a bike across a 2D level with nothing but gas, brake, and leaning left and right to control yourself wouldnt seem too complex, but theres a pool of technical skills to master here as deep as an ocean  and Rising gives Fusions unwieldy (if occasionally amusing) MTX trick system the boot to keep moment-to-moment gameplay closer to the core of what makes Trials fun. Speeding through a course for the very first time is a tense game of quickly reading the terrain in front of you and adjusting your speed and balance on the fly to smoothly roll through it as fast as possible. Doing so takes far more than just holding down the accelerator because there are lots of little tricks you need to learn in order to master Trials physics-based movement. Earning a gold medal on my first try was always a proud moment, but I was just happy to have made it to the finish line at all on some of the more technical courses. Going back and improving on those levels was a different game altogether, one thats more about solving a momentum-based puzzle and then perfecting my route. Rising is a great looking game, even if it isn't any sort of huge graphical improvement over Fusion. The 100-plus levels in Trials Rising are well designed in both layout and visuals, generally going with more grounded themes than Trials Fusions abstract areas, now based loosely on real-world locations like skateparks and the Great Wall of China. The soundtrack has also switched to almost entirely grungy licensed music including Motorhead and Stone Temple Pilots  it sounds like it was taken straight off of my middle school iPod, which initially gave a nice Tony Hawk-vibe but quickly wore thin when I realized how small (and thus repetitive) the library was. It didnt take long for me to mute it entirely and resort to Spotify for my own soundtrack. Rising is a great looking game, even if it isnt any sort of huge graphical improvement over Fusion. Its levels feel visually deeper and lusher, and a little bit less like sets and more like real places where these tracks could have been set up in. The backgrounds have more detail and seem to stretch further into the distance, and cool moving elements like trains and cars can zoom in and out of your path to make the tracks feel less isolated from the environment around them, though less so once you get into the super technical late game stages. Most levels still manage to remain fairly easy to read at a glance, too, as Ubisoft has developed a great visual language for when objects will move or shift, usually marking them with orange and white lines that enable you to react faster even on a first playthrough. That makes unexpected and unfair crashes as the floor falls out from under you an uncommon occurrence  assuming youre paying attention. I particularly loved levels that really broke out of the straightforward track formula, letting you drive through a crashing airplane or along a moving train. A Hollywood level early on shows just how crazy the environments can get, including with a CGI alien movie blipping in and out of existence as you briefly ride through a blue-screen studio. Some of these locations do get revisited and remixed as harder versions in later levels though, which was a little disappointing, but they are generally different enough that they dont feel like cheap rehashes. Grinding for the Sponsors Unfortunately, unlocking all of Trials Risings levels really starts to drag because of an ill-conceived change to the way the series has traditionally worked. The courses are split into nine main leagues, most of which have eight tracks with a few that have less toward the end, and you unlock new leagues by beating the previous ones Stadium Finals: a fun series of three shorter, multi-lane races which only unlock once youve earned enough XP to reach a certain player level. Tying new stage unlocks to your level instead of the medals youve earned like in previous Trials games is Trials Risings largest misstep  far larger than I initially thought it would be. For the first half of the campaign I was generally a high enough level to unlock a new Stadium Final well before I finished that leagues courses, but the second half slows down to an unreasonable degree. It took me over 13 hours to unlock the bulk of Risings courses not including some secrets I wont spoil  but a large part of that time was spent grinding its new sponsor Contract challenges for experience. Risings Contracts replace Fusions Challenges, rewarding you with experience and cosmetics for beating a stage while completing a particular set of requirements. Those can range from something as simple as getting a bronze medal or doing six backflips to a combination of multiple objectives at once, like beating a specific level in a certain amount of time while doing 50 meters of wheelies and 10 front flips while on fire. Contracts offer so much more experience that improving medals is essentially a waste of time when it comes to progressing. Some of those Contracts are fun, especially the simpler flipping ones that made me look at a course differently as I tried to figure out all the best places I could weave in a flip without losing too much speed. At their best, Contracts are an amusing way to shake up the Trials formula. But as they get harder they can start to get downright infuriating. And apart from finding some hidden collectibles in levels, there arent any Contacts like the cool challenges in Fusion that would ask you to hit secret buttons or finding hidden areas  at least not that Ive found. While I would gladly put these contracts off until later, the kicker here is that Contracts are the fastest way to get experience by an enormous margin, making them essential to leveling and unlocking new Leagues in a reasonable amount of time. Later on you need 10,000 experience for one level-up, and it wasnt uncommon for me to unlock a new League and need nine more level-ups to get the next one. Thats 90k experience I needed to earn, with the hardest Contracts only offering roughly 3-5k each. Many of the earlier Contracts will offer around 1k or less, and simply improving your time on a Hard track from a silver medal to a gold one without a Contract offers up a meager 450. That means that the part of Trials Ive always loved  beating my times, gradually getting faster, and earning better medals  is essentially a waste of time when it comes to unlocking everything. The balance for experience gains here is totally out of whack. Trials Risings late game should be a celebration of its well-crafted and satisfyingly challenging final levels, but instead it's a daunting grind as I did wheelies and flips until I just couldnt take it anymore. I still havent even managed to unlock its ultimate final track, The Grand Finale, because the idea of grinding the level-ups needed to get there hardly seemed worth the reward of a single new track. The core problem here is that you arent really given a choice between doing Contracts or improving your times. In Trials Fusion, you could either go for better medals to unlock more tracks or do challenges to gain experience for other rewards. Having both leveling and unlocking leagues tied to optional Contracts makes time improvement completely secondary to progression. Not only does that seem backwards, it makes failing on Contracts I essentially have to complete whether I want to or not frustrating in a way crashing never was before. That frustration is compounded by Trials Risings more enthusiastic focus on competition, always pitting you against ghosts of random players to race against. That isnt too dissimilar to past games in theory, especially when they are ghosts of friends, but since every single-player run is now framed as a race it can substantially sour victories. It sucks to be proud of finally completing a hard Contract or course, only to be greeted by the random player avatar that got first place slapping its butt at me to a taunting kazoo song. In contrast, Fusion would encourage you by focusing on the friends times that you did manage to beat instead of taunting you with who you lost to. None of this ruins the satisfying glee that comes from getting better at Trials once everything is unlocked  the Trials fundamentals are still executed flawlessly here, and Im excited for the community to start populating Rising with impressive custom levels that I dont need to worry about unlocking. But the change of direction and attitude makes the prospect of filling its swanky world map up with places to go more discouraging than it ought to be. Trials Rising also has simultaneous PvP in addition to its asynchronous options, but I wasnt able to test it out ahead of release. There was an open beta event the weekend before launch, but I couldnt actually find any opponents when I tried to use its matchmaking during that period. Teach Me How To Bunny Surprisingly, learning how to actually play Trials Rising is far easier than its ever been, as its new tutorial is undoubtedly the most impressive addition. Its the first time Ive felt like a Trials game has actually taught me the techniques needed to best its challenging end-game levels instead of forcing me to resort to YouTube videos that better explain its trickiest moves  and thats partly because Ubisoft hired the person making the videos I was watching to help. Having this instruction included, and in such detail, is revelatory for the Trials series. Concepts like bunny hopping, throttle control, and more arent just told to you and then moved past like in previous games. Instead, each one has its own course dedicated to teaching, showing, and then letting you practice that move as much as youd like. They have detailed explanations of the physics behind the moves, an NPC rider next to you demoing exactly what to do, and increasingly difficult obstacles for you to slowly improve on. At the same time, all of this is out of the way if experienced players want to ignore it, but these tutorial levels go a long way toward teaching hard moves to people who might otherwise never learn what theyre doing wrong. And, in opposition to the almost combative nature of the rest of Trials Rising, the tutorial is constantly encouraging you to do your best and just manage what you can. Its positive attitude took the sting off sucking at a new move (more than a random avatar mooning me, thats for sure) and it made me wish the whole game took that stance. The level editor, on the other hand, throws you right into the deep end. It remains an unbelievably powerful tool  potentially one of the robust level editors in any game around  but at the expense of accessibility. Its not poorly designed or laid out, just nigh-infinitely complex, and as a result can create nigh-infinitely complex levels. I am happy it continues to be such a strong inclusion, but mostly because it means I get to play the shared creations of people with more patience and talent for using it then Ill ever have. A Note on the Nintendo Switch Version The Nintendo Switch version of Trials Rising is similar enough that this review still holds true, but its definitely not quite up to par with the others. The graphics are reduced (though not distractingly so, especially in handheld mode), but the Switchs lack of analog triggers is the real pain point here. It means you have zero throttle control with the right trigger and instead have to use the right stick to subtly control your speed. Its not ideal, but it makes the later levels possible. The Switch version is still suitable as long as your goal isnt to blaze to the top of the hardest leaderboards, but you should probably get Trials Rising elsewhere if playing on the go isnt important to you. That emphasis on customization has also been extended into your riders cosmetics this time around, and with it comes everyones favorite 2019 progression mechanic: loot crates. Leveling up earns you a crate filled with three cosmetic-only goodies  you can also buy them for in-game currency but not real money, though a premium currency that can be bought with real money or earned by finding hidden collectibles is needed for a small handful of special cosmetics. Crates can contain pieces of clothing, bike parts, or nearly any of Trials Risings copious amount of stickers that are used in its extremely impressive character customization. Pretty much every item can be decked out with up to 200 individual stickers from a selection of hundreds of unlockable ones, which you can then modify, color, and place wherever youd like. Its a fiddly and slow process, especially if you arent using a mouse and keyboard on PC, but one that can reward you with your dream custom character. And if youre too lazy to make your own, you can head over to the community market and spend in-game currency on cosmetics other players have customized themselves and shared. The versatility of the customization and the fact that it doesnt affect gameplay in any way doesnt mean its loot crates dont totally suck, however. There are hundreds and hundreds and hundreds of stickers, compared to a relatively smaller pool of clothing and bike pieces. That means loot crates are a non-stop stream of obscure and often boring stickers (mostly varying squiggles, paint splats, or geometric shapes, with an occasional cool one like a tiger thrown in) that get dropped into a messy sticker menu where you may never be able or even care to find them again. The cosmetic sticker system is powerful and impressive, but it also makes the loot boxes chock-full of boring rewards. The loot crates seem to have an issue with duplicate drops as well, as I unboxed the same front fender part for a bike five times in my first 10 loot crates, two of which were literally in the same box. Those can thankfully be sold for in-game currency, which can then be used to quickly unlock specific items or stickers you like. Again, this is all just cosmetic, but its almost laughable how stupid these loot crates are. They are thankfully unobtrusive too though, and I was able to find a look I was happy with for my character fairly quickly despite all the unnecessary clutter. Another new addition to Trials Rising is the inclusion of the Tandem bike, which gives two local players control over the same bike. It almost feels like a Skill Game (special levels that also make a return with wacky tasks like bailing out to bounce along explosive barrels as far as you can), but you can amazingly use it on nearly every course. Its hard as nails and requires a ton of coordination to lean and accelerate properly together, but its definitely a creative novelty with which to break up solo play. Trials Rising offers some of the coolest levels in the series to date, and its new tutorial system does a better job of teaching you how to actually execute its hardest techniques than any game before it. That wide variety of tracks is unfortunately bogged down by the frustrating grind it takes to unlock them all and some strange decisions that lead to a more discouraging experience, but its still satisfying to get back on the bike and try for better medals if you can make it to the finish line.", "date": "Feb. 26, 2019,"}