{"name": "Tetris 99", "name_review": "Tetris 99 Review", "ref": "https://me.ign.com/en/tetris-99/158372/review/tetris-99-review", "text": "Tetris 99 is the ~This is Fine~ meme in video game form  only instead of ignoring encroaching flames, you have to keep your cool during an onslaught of gray garbage blocks piling onto the screen from any of 98 other players in the match, making each moment more panicked than the last. Sometimes it really is fine, and the right sequence of movements mixed with a little luck returns my grid to a nice, orderly structure. Other times the garbage is too much, and all that remains of my screen is a gray dumpster that signals an early exit from this frantic, pulse-racing spin on one of the most beloved puzzle games of all time. I get irrationally nervous during a seemingly solid run; a palms sweaty, heart beating out of my chest, jittery kind of nervous. If I had a blood pressure cuff on during a top-10 run, my doctor would probably tell me I need to be on medication. When I make it into the top five, I feel like I can run through a brick wall. I also feel like Im going to pass out. Im 99 percent sure Tetris 99 is bad for my health. Its a vice I will gladly live with, though, because the overbearing tension is also what makes it such a thrilling and ultimately fulfilling multiplayer experience. Multiplayer Tetris is nothing new, but the massive player count really ups the intensity because danger can come from any direction. This is you and 98 strangers in a battle to see who can be the last person standing, with all of their screens shown, in miniature, in the borders of your own, lending it a very busy look and feel. Other than that, Tetris 99 appears to be pretty much the same old competitive Tetris, including the classic music. Clearing lines and getting combos sends garbage blocks at your opponents, but here theres a new layer of risk-and-reward strategy in where you choose to send them. It's classic Tetris at its core, but with a new layer of risk-and-reward strategy in where you send your attacks. In the two games Ive managed to win, Ive used a combination of the targeting options to my advantage. You can either manually move the cursor to choose a player to target, or pick between one of four presets: Random, K.O.s, Attacker, and Badges. K.O. piles onto players who are already close to death, and if youre the one who strikes the killing blow it increases your multiplier (from 25, to 50, to 75, and 100 percent) for how many garbage lines you send to future targets when you clear them. Attacker automatically sends cleared lines to those targeting you  represented by yellow lines from their miniature screen to yours  which can be helpful as a defensive strategy. Alternatively, Badges targets players with the most knockouts, which is a risk because they are typically among the best in the field and will likely fire back, but the reward is that if you knock them out you absorb their multiplier. It would be nice if Tetris 99 had a tutorial to explain that these cool new mechanics exist, though, because it currently doesnt bother. Tetris 99 often feels like a lot to handle, especially when the speed increases at the top-50 and top-10 marks; but like in any version of Tetris, if you play quickly enough its possible to keep your board relatively clean, which enables you to fight back when attacks come. Theres a helpful delay of a few seconds between when youre notified of incoming garbage and when it actually fills the bottom of your grid, and clearing lines during this brief window goes towards eliminating that pending onslaught rather than sending it to another players screen. Its not all about skill, however  sometimes it does feel like luck plays a large role, either for or against you. In my 125-plus rounds played so far there have been at least a half dozen where I made it to the top 10 without getting targeted more than a couple of times. And then there are rounds where Ive been perpetually in five or more players sights until my early death, outside of the top 50. Random targeting seems to lead to this excessive deluge of garbage blocks on my grid. And that only multiplies when youre near death and you start taking heat from those hunting for knockouts. Reversing my fortune when Im a line away from death feels unbelievably good, and chipping away enough to throw the garbage back where it came from makes me positively giddy. Sometimes it does feel like luck plays a large role, but Tetris 99 still largely rewards skill. Even with some occasional losses that felt unfair, Tetris 99 still largely rewards skill. By no means am I an expert Tetris player, but Id consider myself above average. Playing both quickly and with forethought led to a ton of high finishes. Earning that number one spot for the first time honestly felt like one of my best gaming triumphs. My longest round took less than 10 minutes, so Tetris 99 is an ideal game to play in short spurts in handheld mode. My Switch, however, has been glued to my hands since Tetris 99 launched (for free for subscribers to Nintendo Switch Online), as dutifully noted by my overall playtime in the stats. It also tracks a bunch of stats like cleared lines (singles, doubles, triples, Tetris, T-spins etc.) and career wins. I do wish it kept count of top five or 10 finishes, too. Theres technically a leveling system, but as of now its nothing more than a number that shows how addicted you are to Tetris 99. There are no other modes or features beyond that, which makes it feel a little barebones  but this single mode is interesting enough on its own. Tetris 99 is a maniacally intense battle royale that forces you to make strategic decisions beyond just where to drop your next piece. This is Tetris on steroids, where a good run can quickly turn into a disaster and a bad run can turn into a surprising comeback. Theres a lot of luck involved, which can lead to some unfair-feeling knockouts, but its quick and easy to jump back in. This nerve-wracking and utterly delightful take on one of the greatest games of all time feels perfect on Switch, and on its own it justifies the $20 annual cost of the Nintendo Switch Online subscription.", "date": "Feb. 20, 2019,"}