{"name": "Far Cry: New Dawn", "name_review": "Far Cry: New Dawn Review", "ref": "https://me.ign.com/en/far-cry-new-dawn/158255/review/far-cry-new-dawn-review", "text": "I liked the ending to Far Cry 5. There, I said it. (Spoilers for the ending of Far Cry 5 ahead, though the existence of this game probably already ruined that for you.) It may be an unpopular opinion, but I appreciated that, for once, we didnt vanquish the bad guy, save the day, and walk off into the sunset. Joseph Seed kind of won. So Im a little bummed that the very silly developments of Far Cry: New Dawn walk back a lot of that bleak, dark finale. That said, the very familiar Far Cry gameplay formula is just as fun as ever in the post-apocalypse, and I had a blast clearing outposts, hunting for treasure, and absolutely brutalizing the Highwaymen who have seized control of whats left of Hope County, Montana. Much like Far Cry Primal was to Far Cry 4, Far Cry: New Dawn is a standalone sequel to Far Cry 5 that redresses the same map, but here the events are set years later instead of millennia before. (Its not mandatory, but to really get the most out of it youll want to have played Far Cry 5 first.) Many characters return, youll revisit locations that have been damaged or otherwise altered, and the events of Far Cry 5 are mentioned often. Despite its post-apocalyptic setting, this really feels like more Far Cry 5. Its only been 17 years since the bombs dropped, but Hope County was far from leveled and nature has already completely returned, bringing with it lots of pink flowers. That means this version of Hope County looks and feels... mostly the same. Longtime series comic relief Hurk Drubman Jr. even jokes that your character seems familiar and he gets a sense of deja vu that youve done all this before. To make things feel comically similar, if you finished Far Cry 5 you even unlock the outfit your character, the Rookie, wore. Youre running around the same map wearing the same outfit, only now there are a lot of pink flowers around and some buildings are covered in rubble. It looks completely fine, but not up to the level of something like Ubisofts own Assassins Creed Odyssey. New Dawn feels like a ~budget~ version of Far Cry  which is probably why Ubisoft's asking $40 instead of $60. That, along with the occasional graphical bug, is one of the features that makes New Dawn feel like a more budget version of Far Cry  which is probably why Ubisofts asking $40 instead of $60. But returning to the same map didnt keep me from enjoying it. You start out in a different spot than you did in Far Cry 5, and the whole thing needs to be uncovered from fog all over again. Every so often Id stumble onto a location that I remembered, and that familiarity is actually kind of cool. Its also fun to take a friend through in the two-player co-op, even if they missed Far Cry 5. Youre given a lot of freedom to invest your scavenged resources in your home base to upgrade everything from the available selection of weapons to health, and those decisions can meaningfully affect your playstyle throughout the roughly eight-hour campaign and its many hours of surrounding activities. If you choose to upgrade your armory, for example, you can quickly find yourself with weapons that are a higher level than your current enemies, making you feel like an overpowered Rambo-type character. That customization extends to your nameless, speechless character in some kind of absurd ways: You can spend perk points on a bigger inventory, greater lung capacity, or a double jump? Yes, you control a human in the not-too-distant future America, and one of your perks is jumping and then jumping again while youre in the air. Sure, why not? It may not be realistic (even by Far Crys action movie standards of realism), but this Blood Dragon-ish upgrade definitely makes getting around the rugged terrain of Hope County easier. Ubisoft describes New Dawn as a light RPG, and the RPG elements are very light indeed. Yes, numbers fly out of enemies when you shoot them and there are a few escalating levels of enemy difficulty (i.e. how big a damage sponge they are) which is good to know. But you dont earn experience points or level up, because that progression is handled by gathering and spending resources in camp. Frantically running towards the extraction point makes for some genuinely tense moments. While the main map is largely recycled, we do get a much-needed change of scenery in the new Expedition missions, which shuttle you away from Hope County to exotic locales like Alcatraz, an amusement park, and a crashed space station. Your mission in each is to find and steal a package, then make it back to your helicopter alive with every enemy in the area hot on your tail (they home in on the GPS signal from the package, so theres no stealthing your way out of these). Frantically running towards the extraction point makes for some genuinely tense moments, and every mission is replayable with randomized item locations and escalating difficulty. The template established by Far Cry 3 demands a psycho villain, and Ubisoft loyally follows it here. But while New Dawn delivers a double dose of crazy in twin sisters Mickey and Lou, they dont hold a candle to the series more memorable antagonists. Even though their character design is badass, theyre pretty uninteresting, one-dimensional sadists. It makes me miss Joseph Seeds manipulative, religious fanaticism, and I didnt like what hes reduced to when he shows up in this unnecessary epilogue. Plus, the final boss fight is as out-of-place as the double jump, without being fun enough to earn a pass. Thankfully, New Dawns moment-to-moment gameplay does not disappoint. There are few things Far Cry fans like myself love more than clearing outposts, and New Dawn smartly doubles down on that. At any time you can take a detour to scavenge an already-cleared outpost for resources, but when youre done the Highwaymen will reclaim the outpost, this time with more advanced soldiers who bring even more of the precious ethanol you need to upgrade your base. I spent a lot of time delaying the story because the outpost gameplay loop is so much more fun. Far Cry 5s useful Guns for Hire system returns, with mostly new faces. These are class-based companions you meet through side missions that will fight alongside you and complement your playstyle. Hurk Jr. is a returning Gun and is as crass and funny as ever. Pastor Jerome, also from Far Cry 5, is back to deliver justice with a shotgun blast to your enemies faces. Nana, the grandma sniper, can pick off enemies through smoke and cover. Timber, your scout dog, will tag nearby enemies and crafting materials for you. Speaking of guns, while much of your arsenal here are colorfully junked-up cosmetic variations of familiar pistols, shotguns, and sniper rifles, there are a few delightful new weapons. Most notable is the Saw Launcher, a crossbow modded to fire saw blades that ricochet off surfaces. At its highest level, you can one-shot almost anything that gets in your way, including the new shield-carrying enemy types, which makes it a must-have. One of my other favorite things to do in Hope County is the Treasure Hunts, which are fun environmental puzzles that take the place of the Prepper Stash puzzles of Far Cry 5. Following the cleverly placed clues for valuable rewards is absolutely worth it. As someone who loves the Far Cry formula and will take my fix wherever I can get it, revisiting Far Cry 5s slightly reworked open-world map in New Dawn proves theres still quite a bit of joy to be found in clearing outposts and generating as much chaos as possible, in single-player or co-op. I couldve done without the silly story and disappointing final boss, but Expeditions are a thrilling new mode, and the story missions are exciting more often than not. New Dawn is an enjoyable diversion while we wait for Far Crys next big thing.", "date": "Feb. 14, 2019,"}