{"name": "Jump Force", "name_review": "Jump Force Review", "ref": "https://me.ign.com/en/jump-force/158251/review/jump-force-review", "text": "With Weekly Shonen Jump hitting its 50 year anniversary last year, Jump Force is meant to be a celebration of the many legendary anime and manga series born from its pages. And to its credit, this anime/manga mashup fighting game certainly looks the part on the surface, with flashy combat and a roster of 40 characters hailing from 16 different series, portrayed with a unique aesthetic that takes popular characters and places them into the real world. Unfortunately, Jump Force falters at just about every other point. Its weak story mode does practically nothing with its stacked roster, an all too basic fighting system gets old quickly, and a number of smaller issues add up and round out an altogether disappointing anniversary gift. Jump Force certainly starts on a high note as it drops you right into the middle of a conflict in Times Square between Jump heroes and super-powered, mind-controlled villains. You play a random victim of collateral damage during a battle between Goku and Frieza whos revived and given powers. But once youre recruited into the Jump Force, the story takes a painfully long time to get going again as youre forced to explore the base, meet with Goku, Luffy, and Naruto and pick which of their teams youd like to join. Its a beginning to a story that takes about 12 hours to run through, not including a fair amount of side content. Before that, though, youre able to build your character as you see fit, giving him or her a fighting style and slapping on a couple of abilities borrowed from other Jump characters. Jump Forces character creator doesnt have a ton of options, though, and it doesnt let you really customize the look of your character beyond a handful of premade faces, hairstyles, eyes, and so on. It does at least have several options that are obviously nods to other anime characters that didnt make it onto the roster, including Kurama, Urahara, and Kuwabara, just to name a few. I personally went a different direction and made a bald dude dressed in all yellow, put some red gloves and boots on him, and called him Saitama. In general, Jump Forces plot takes itself a little too seriously and misses out on a huge opportunity for some fun interactions between beloved characters that would otherwise never have a chance to meet. The bland story is done no favors by the fact that most of the cutscenes are devoid of voice acting, so what few interesting interactions between characters we do get  like one involving Kenshin challenging Zoro to a duel after taking issue with his strict teaching methods  are left completely silent and lifeless. The biggest problem with Jump Force's story mode is how you progress through it. It doesnt help that during cutscenes everybody looks like barely animated action figures with bad lip-syncing and mostly frozen facial expressions. Also, for some strange reason that developer Spike Chunsoft describes as a design decision, Ryuk from Death Note doesnt have any voice at all, despite everyone else in the scene talking and responding to him. On top of that, the framerate in the biggest and most important cutscenes is terrible, theres no way to skip them (or any other cutscene), and theres no English dub. So thats not great.. The biggest problem with Jump Forces story mode, though, is how you progress through it. Youre not given waypoints to show you where you have to go for the next main mission, the animations outside of the actual combat are straight-up bad, upgrading your character is needlessly convoluted, and towards the end the difficulty spikes in the worst possible way: With enemies suddenly able to shave off nearly half your health with simple combos or special moves while their AI remains as dumb as ever. Its artificial difficulty at its worst. Ill say this for it: Jump Forces combat is a lot of flashy and simple fun  for the first few hours, at least. Matches are 3v3 with a two-button combat system made up of light attacks (called rush attacks) and heavy attacks. Rush attacks can be mashed to do an auto combo that results in the opponent getting ping-ponged back and forth across the arena, while heavy attacks are much slower but can be canceled into at just about any point of a rush combo. You can also close the distance extremely quickly with either a high-speed dash tied your teams mobility meter or by simply tagging in your teammate, which facilitates a very fast pace to the action. Each character also comes with four special moves, performed by holding the right trigger and pressing one of the face buttons. Finding the right combination of rush attacks, heavy attacks, knowing when you can throw in an assist, and then knowing which special move to finish with is generally the way to find the big-damage combos. Spike Chunsoft did an admirable job of making sure everything in Jump Force has a counter. To its credit, Spike Chunsoft did an admirable job of making sure that everything in Jump Force has some sort of counter. Auto-combo spam can be beaten by blocks, sidesteps, or by charging armored heavy attacks; predictable dash-ins can be blown up by invulnerable-on-startup special moves or counters; and excessive guards can be broken with powerful unblockables or throws. Theres also an emergency-escape button that allows you to get out of a combo while youre getting hit, at the expense of your mobility meter. All of this is a great start, but thats about as deep as it goes. Despite being a 3v3 tag fighter, the tag mechanics feel like an afterthought since all three characters share the same life bar, the assist maneuvers dont feel particularly well thought out, and since combos mostly only start from a rush attack theres no real need to learn anything beyond one combo per character. This makes every fight kind of feel the same and leads to the combat getting stale pretty quickly. And the load times for getting into a match are longer than in most fighting games, too. Playing online or locally against friends is Jump Forces saving grace, as the AI is pretty terrible even on the hardest difficulty and what depth the combat system has is intrinsically tied to being able to read your opponent, which doesnt work against the predictable and dumb AI. And so far, its been technically smooth in that area: in my experience playing online in pre-release, multiplayer has held up very well with virtually no matches that were affected by lag at all. If youve got like-minded anime fans who are down to smash some buttons and watch the sparks fly, Jump Forces fighting system allows for at least a few hours of shallow fun before it gets stale and repetitive. The bland story feels half-baked and never does anything interesting with its impressive roster of beloved characters whove rarely or never had the chance to meet before, making this celebration of 50 years of Weekly Shonen Jump a disappointment overall.", "date": "Feb. 14, 2019,"}