{"name": "Metro Exodus", "name_review": "Metro Exodus Review", "ref": "https://me.ign.com/en/metro-3/158174/review/metro-exodus-review", "text": "It turns out that what makes Metro  a series named and known for its dark, subterranean survival-horror atmosphere  work was never really dependent on being underground at all. The third game, Metro Exodus, successfully brings its lengthy single-player campaign to the post-apocalyptic surface without sacrificing any of the series signature tension. In an era where most first-person shooters seem to be intent on constantly upping the tempo, Metro Exodus is refreshing in its demand that you take your time. This is not a run-and-gun experience; its a stay-low-and-go-slow crawl through some of the most atmospheric and detail-rich settings Ive ever experienced in a story-driven shooter. With a storyline that sidesteps the supernatural themes of its predecessors in favour of focussing on a more affecting human experience, and level design that affords you significantly more freedom without giving you too much room to relax, Metro Exodus feels like the full realization of this series potential. Picking up two years after the events of Metro: Last Light, the largely self-contained story of Metro Exodus follows the plight of main protagonist Artyom, his wife Ana, and a crew of surviving Spartan Rangers led by Colonel Miller as they set out from nuclear-war-ravaged Moscow in search of safe harbour aboard the train Aurora. That mobility brings a dazzling variety of settings weve never seen in a Metro game: their year-long, cross-continental journey ushers in a seasonal shift as you reach each stop, taking you from snow-blanketed sprawls of urban decay to sand-swept deserts and lush forest settings, each incredibly well-realised and populated by a healthy variety of deadly mutants and pockets of humanity both friendly and hostile. No Rushin' These levels are also far more open than what weve come to expect from the previous two Metro games, but thats not to say you wont spend a considerable amount of time exploring the traditional dank underground corridors. Many story objectives still require you to descend into the sorts of dread-filled subterranea that the Metro series was built upon, and thanks to a generational jump in lighting effects and high-quality ambient audio they feel more ominous and claustrophobic than ever. Metro Exodus successfully manages to put you in wide-open spaces without ever giving you much room to breathe.Up on the surface, the larger, sandbox-style levels relax the leash and let you sniff around with more freedom, finding enemy camps and abandoned houses that can be scoured for precious resources or diary scraps and audio logs which flesh out the fiction. But even when youre out in the open, Metro Exodus finds ways of keeping your anxiety levels in the red by obscuring your surroundings with intermittent sandstorms in the Caspian desert level or introducing packs of snarling dogs in a forest valley section that can attack from any direction and have you frantically scrambling for higher ground. The day/night cycle also dictates that when the sun goes down, more mutants come out to surprise you on your way from A to B (its a cycle which, if youre more risk-averse, you can manually shift by using one of the beds littered about the landscape). With all of those factors in play, Metro Exodus successfully manages to put you in wide-open spaces without ever giving you much room to breathe. Metro Exodus features incredibly detailed environments and exceptionally eerie sound design, but its strict minimising of intrusive menus and on-screen indicators is of equal importance as far as successfully grounding you in its world. Your next objective isnt spelled out for you by a garish waypoint marker hovering on the horizon, but by the subtle swing in direction of the compass needle on Artyom's wrist. Similarly, theres no map in the corner of the screen overwhelming you with areas of interest; instead, the flickering candlelight of a cabin in the distance was typically enough to pique my curiosity and tease me into an exploratory detour. If the HUD elements in Metro Exodus were any more organic they'd be blended with wheatgrass and served as a smoothie.If the HUD elements in Metro Exodus were any more organic theyd be blended with wheatgrass and served as a smoothie. However, the one thing that does dent the immersion is that, despite reading out aloud the diary entries that open each level, Artyom is once again an entirely silent protagonist in Metro Exodus. It makes no sense to hear his voice one minute and then see him go mute when spoken to by other characters face to face, and even more absurd when theyre contacting him by radio from the Aurora when hes out in the field. How do they even know hes listening when he cant even mumble a meagre ,opy that? If youre going to do a silent protagonist you have to commit to it completely or it doesnt work. Backpacking Tour This system is still very much geared around conserving ammunition and making each shot fired a carefully measured one.Metro Exodus does away with the ammunition-based currency system and weapons merchants from its predecessors in favor of workbenches that can be found in a handful of locations across each level and a backpack that can be used to craft certain items on the fly. Since the backpack can only be used to craft stealth-oriented projectiles such as crossbow bolts and throwing knives, and bullets and shotgun shells can only ever be created at workbenches or scavenged from fallen enemies one handful at a time, this system is still very much geared around conserving ammunition and making each shot fired a carefully measured one. I found the backpack to be an invaluable addition to the Metro Exodus experience, particularly since it also brings with it the ability to swap out weapon parts without returning to a base. When night fell I was able to quickly swap the eyepiece on my sniper rifle for a night vision scope, for example. Or, if I found myself up against a more mobile set of enemies, it was always handy to tweak the components of my shotgun in order to increase its stability. In fact, steady aim is more crucial than ever this time around since human enemies seem noticeably smarter, communicating with each other during a firefight and intelligently maneuvering around to flank. While you can still unscrew light bulbs or extinguish lamps in order to fill an area with shadows to hide in, if an enemy notices that a light goes out they will now come to investigate it. That keeps you a bit more on your toes even when youre trying to play things safe. Metro Exodus still gives you ample opportunity to scratch your itchy trigger finger, though, since the covert approach goes out the window anytime mutants unleash their more erratic and hurried attacks and you invariably end up spending your hard earned, lead-based life savings within the space of a few panicked bursts from your assault rifle. There are also a welcome handful of special sequences that shift the pace considerably  such as a thrilling shoot em up through an installation overrun by axe-wielding cannibals  so that youre not experiencing the entirety of Artyoms journey in a permanent crouch walk. Metro Exodus' combat rarely becomes mired in repetition.The gunplay is nice and crunchy and theres a broad range of mutant enemy types to tackle, from the humanimals that camouflage themselves in the desert surroundings and surprise you at the last minute to the light-fearing spider creatures found in the deeper underground sections that must be weakened with the beam of your torchlight before you can finish them off up close. Each mutant type requires its own unique strategy to overcome, which means Metro Exodus combat rarely becomes mired in repetition. Train of Thought Since so much of your time in Metro Exodus is spent on tense and lonely excursions away from the Aurora, the playable vignettes aboard the travelling train that bookend the main levels give you an opportunity to relax and bond with the rest of the characters. Whether it was sharing a smoke with Colonel Miller, or spending quiet time with Ana in the privacy of your shared cabin, I relished the chance to get to know the crew a little better as the journey went on and I became more invested in their individual plights as a result  despite the inconsistent quality of the voice acting. I particularly liked seeing the more minor impacts of my actions in these sections too; I went out of my way to take on an optional and dangerous hunt for a lost teddy bear in one level for the sole child passenger of the Aurora, and I was happy to see her playing affectionately with it aboard the train several hours later. Of course if youre only into Metro Exodus for the action, you can just head straight to the map in the main cabin to trigger the next stop and resume the horror at will. Other actions in Metro Exodus have much more dramatic ramifications, although the stakes in play arent always made clear to you. When I disobeyed one characters instructions to steal a boat from a cove of pirates without shedding blood, she subsequently took vengeance on one of the members from the Aurora crew, which seemed just. Yet at another time I finished a level and got an achievement for keeping the character named Duke alive, which surprised me since I wasnt actually aware he was ever in peril. Since all of these actions snowball into determining which of the possible endings you will achieve, its hard to try for a different outcome at the end of a second playthrough when the parameters that influence them arent always obvious. The most exciting moments of Metro Exodus are centred around the middle act.Speaking of that ending, while the plot delivers an emotional payoff, the lack of any main antagonist in Metro Exodus means theres no climactic showdown to speak of at the storys end. After surging forward with slow-paced yet sustained momentum for the bulk of its 20-hour runtime, Metro Exodus ultimately grinds to a halt as opposed to going out with a bang. I was compelled towards its conclusion by the strength of its story and I was ultimately satisfied with how it resolved, but I cant help but feel that the most exciting moments of Metro Exodus are centred around the middle act. Metro Exodus takes the fear-inducing formula of the series and transplants it into expansive, sandbox-like levels without losing any of the oppressive tension that makes the Metro games memorable and distinctive among post-apocalyptic first-person shooters. Its a frequently exhilarating and densely atmospheric journey across a Russian dystopia brimming with detail and deadly inhabitants, and well worth the trip for its consistently effective use of survival horror and hair-raising action.", "date": "Feb. 13, 2019,"}