{"name": "Assassin's Creed Odyssey DLC  Legacy of the First Blade: Shadow Heritage", "name_review": "Assassin's Creed Odyssey DLC – Legacy of the First Blade: Shadow Heritage Review", "ref": "https://me.ign.com/en/assassins-creed-odyssey-legacy-of-the-first-blade-episode-2/157271/review/assassins-creed-odyssey-dlc-legacy-of-the-first-blade-shadow-heritage-review", "text": "The second episode of Assassins Creed Odysseys Legacy of the First Blade DLC, Shadow Heritage faithfully follows the formula Ubisoft laid out in Episode 1: Hunted. Fortunately, that formula works just as well this time around, drip-feeding us small doses of faction backstory, while focusing on the drama of its characters. With another branch of cultists to track down and murder, a couple of new tricks of the trade to put to use, and some well-delivered moments between characters, Shadow Heritage is yet another good 3-5 hour serving of Assassins Creed Odyssey. Shadow Heritage picks up shortly after the events of Hunted, and youre once again working with the mysterious character from Assassins Brotherhood lore. This time around theres less historical backstory to enjoy, with the focus shifting toward the current machinations of the Order of the Ancients in their pursuit of Alexios or Kassandra. Like Hunted, this episode doesnt add much to Odysseys now-defined gameplay recipe: help the people of Greece in exchange for clues, track down targets, and kill cultists. But it still works. Shadow Heritage does a good, subtle job of hitting home with its themes.The majority of its plot revolves around The Tempest, Shadow Heritages new mythical, tyrannical antagonist, a master naval commander and part of the Order of the Storm, the next branch of cultists to dismantle. Though I ultimately didnt find her as menacing as The Huntsman from Episode 1, The Tempest sets the stage for a naval centric episode where ship-to-ship combat gets an equal share of the billing, and youre given a new tool with which to terrorize the Aegean: an unsurprisingly devastating frontal flamethrower. But Shadow Heritage does do a good, subtle job of hitting home with its themes of identity  as numerous characters come to terms with what kind of life they want for themselves with the time they have left. This allows for some touching personal reflection alongside some surprisingly light hearted moments. But as is tradition in Odyssey, just as many of these moments are delivered over the top. Shadow Heritage takes place entirely in the sunny region of Achaia.And similarly to episode 1  can you see the pattern yet  Shadow Heritage takes place entirely in one area: this time its the Summery region of Achaia, its coastline, and the glassy water that surrounds it. But like Episode 1s Macedonia-focused experience, your mileage may vary depending on how much time youve already spent there. Finally, Shadow Heritage does add a new skill to the Hunter Skill tree called Rapid Fire, allowing you to consume adrenaline to fire your bow in quick succession. Its another tool in the mercenary toolbox though I didnt find particularly useful, but outside of a couple new Legendary weapons and the aforementioned flamethrower, its the biggest change introduced to the gameplay. Shadow Heritage delivers more of the formula set out in episode one: a new villain and a few new tools to continue pulling at the threads of a larger story. Though there are less details concerning assassins and templars in this naval focused chapter, engaging moments and character reveals punctuate another good portion of Odyssey.", "date": "Jan. 15, 2019,"}