{"name": "Roccat Renga Boost Gaming Headset", "name_review": "Roccat Renga Boost Gaming Headset Review", "ref": "https://me.ign.com/en/roccat-renga-boost-gaming-headset/156903/review/roccat-renga-boost-gaming-headset-review", "text": "At $59.99, the Roccat Renga Boost is the least expensive over-the-ear headset in Roccats line-up of gaming headsets. Despite its budget price the Renga Boost delivers big stereo sound courtesy of beefy 50mm drivers, which are the same size as the drivers in the more expensive Cross model. They also feature a rotating boom mic along with a Y-connector for cross-platform gaming on mobile and consoles. Can the Renga Boost give gamers a lift at such a low price? Let's find out. Roccat Renga Boost  Design & Features The Renga Boost features an all-black, all-plastic design. You wont find any color or chrome accents in the design nor will you encounter any metal in its construction. The headband is simply a wide piece of plastic that mimics a leather strap and sits below a frame of two thin, plastic arches. It offers adjustment via elastic bands that stretch when you put it on your head to give you a snug fit. Despite its lack of padding, the headband provides a comfortable fit  in large part because its generous portions that has it widening to 2.25 inches at its center. It also helps that the headset is light at only 253 grams (or roughly 9 ounces). Despite its all-plastic design and light weight, the Renga Boost doesnt feel cheap or particularly fragile. The earcups are round in shape and feature memory-foam padding covered in a leatherette material. Leatherette earcups can heat up during long sessions, but the Renga Boost features an open-earcup design that allows for some ventilation. There is a gap between the leatherette ear cushions and the foam material covering the speakers to let off some steam. The open design also means that whatever you are listening to can be heard by those around you, and you can hear ambient sounds as well. Lastly, the earcups cannot be rotated flat, however, which makes it more comfortable when you take it off your head and rest it around your neck. There are no controls to be found on the earcups themselves. Instead, Roccat offers an inline control on the audio cable for volume and microphone muting. The microphone mute switch is large and easy to find without needing to look, but I wish the volume dial were bigger. I have no wishes, however, for bigger sound. Youll find 40mm drivers in many headsets in this price range, but the Renga Boost boasts 50mm drivers with dynamic, full stereo sound. The Renga Boost has a frequency response range of 20Hz to 20,000Hz. By comparison, the hi-res Roccat Khan Pro has a wide range of 10Hz to 40,000Hz. The Renga Boost is a wired headset. Its audio cable terminates in separate 3.5mm plugs to use with PCs that have separate headphone and microphone jacks. For added versatility, Roccat includes a Y-adapter that funnels those separate plugs into a single 3.5mm jack for use with laptops, consoles, phones, and tablets. Even with the Y-adapter, you are unlikely to use the Renga Boost for listening to music on your phone while skipping about town because the microphone is not detachable so you'd look kind of funny. Since you can't remove the microphone, the Renga Boost is unable to mask its primary purpose as a gaming headset. Plus, the audio cable is more than 8 feet long, so its a lot of cable to deal with when you are on the go. The two audio cables  each with its own microphone  of the Roccat Cross offers greater versatility. Roccat Renga Boost  Gaming and Performance To test the Roccat Renga Boost, I ran it through some popular games on a PC and an Xbox One and then connected it to an iPhone to test how it handled music playback. Playing CS:GO on a PC, I was impressed with the sound mix. The highs sounded crisp and the low frequencies thundered, but the mids sounded a bit compressed. The snap of rifle fire sounded accurate and clean on the high end, and explosions on the low end felt concussive and huge. The mids were a bit muddy, however, with shotguns and other heavy artillery sounding less dynamic and realistic. On an Xbox One, I played Star Wars Battlefront 2 and Madden 19. I heard good separation between highs and lows in Star Wars Battlefront 2, and the dialogue remained clear in the middle. While the mix was well balanced, I wanted more of a bass response from explosions and the groan of heavy aircraft. I had a better experience with Madden 19; the crunch of pads hitting sounded powerful and the announcers calls could be heard clearly above the rich, ambient noise of the crowd and stadium. Lastly, I connected the Renga Boost to an iPhone and listened to my two test tracks on Spotify  Steely Dans Dirty Work to test the high and mid-frequencies and DMXs X Gon Give It To Ya to get a sense of the headsets bass response. With Dirty Work, the vocals and guitars came through cleanly and accurately, but the headset failed to show good separation on X Gon Give It To Ya. The bass was lacking and seemed to compete with DMXs vocals instead of supporting the vocal tracks from below. Perhaps the Renga Boosts open earcup design prevented the headset from effectively capturing the bass response. I also tested the mic by making a voice recording. The Roccat Renga Boost was below average with its microphone performance. My voice was not as clear as other budget headsets, including the Plantronics Rig 400HX and the Turtle Beach Recon 50. The mix was too bass heavy; my voice sounded too deep. Im all for sounding like a big, tough guy when playing games, but my deep voice sounded muddy and was harder to understand what I was saying than it need be. The Roccat Renga Boost earns points for its low price, comfortable design, and versatility of working with PCs, laptops, consoles, and mobile devices. It's a pretty good gaming headset, but just don't expect the same audio quality with your tunes.", "date": "Dec. 28, 2018,"}