{"name": "Katamari Damacy Reroll", "name_review": "Katamari Damacy Reroll Review", "ref": "https://me.ign.com/en/katamari-damacy-reroll/156613/review/katamari-damacy-reroll-review", "text": "Id like to share a truth with you. And that truth is that even Time  that Great Devourer of early polygonal graphics, that beast which hath smote and sullied many a PSone and PS2 icon, that ravager of (gaming) worlds  is powerless against the might of Katamari Damacy. This joyous games deliberately low-poly art style has proven to be not just a great artistic choice in its era, but the key to ensuring it ages with grace. About the only thing the PS2 version needed was a bump in resolution to really ensure its blocky aesthetic works on a modern screen, and with Reroll, thats exactly what we have  and its glorious. Of course, the real genius of Katamari Damacy is its central, simple, Blob-like idea: roll up things that are smaller than you (as represented by your katamari ball) in order to absorb them and grow, which then allows you to roll up larger things. Its a through-line that takes you from rolling up thumbtacks and takoyaki all the way up to people and trees, and then onto an apocalyptic scale where youre consuming ocean liners, cities, and the clouds themselves. As a big-picture concept its inspired, but it also translates to compulsive gameplay that challenges you to evaluate how to harvest items in your surroundings based on your current size, and plan out how to keep moving and growing to make the most of the time available. Katamaris levels are nothing more than spaces filled with stuff  everyday stuff at that  but it taps into the innate motivation to collect things and makes it the prime driving force, teasing you with the idea that  if youre efficient enough  you can collect the entire world. Most levels dont have the full shift in scale, but every change in scale is somewhat magical. The same environment is re-invented over and over again within a single mission, allowing you to see it from a new vantage point and to double back and subsume things that were obstacles only a few short minutes ago. The same environment is re-invented over and over again within a single mission... Its conceptually elegant, and paired with controls that are deliberately a little unwieldy to give your ever-growing katamari a feeling of weight; its something your tiny character has to wrangle to keep under control. The battle to find precision with a massive, knobbly, protuberance-laden ball of things is part of the charm, even if it can be frustrating to get wedged somewhere and slough off bits before you manage to extricate yourself, or to be blindsided by larger creatures or vehicles. Theres also the minor issue of the sometimes-arbitrary-seeming rules about what is or isnt small enough to roll up at your current size. Katamari Damacy is not a hard game, however, so youre unlikely to fail a level because of a momentary hiccup or two. For the main levels, its mostly just a question of how much bigger than the initial target you can get your katamari before the time limit hits. These levels start out at five minutes and gradually get longer and encompass bigger changes in scale, culminating in an epic, delightfully surreal 25-minute finale. Its a testament to the strength of the vision that Katamari Damacy can take everyday settings and a huge catalogue of - mostly - real world objects and animals, and tease out something so bizarre and wonderfully absurd. Of course, it doesnt hurt that the soundtrack is infectious, wide-ranging, and well-produced, nor that the story is anchored by one of the most memorably offbeat characters ever given life in a video game. Yes, Im talking about the King of All Cosmos  the self-obsessed space deity and absent father to the player characters Prince. He sets the story in motion by shattering all the stars in the night sky while on a bender, then demands that you help create new celestial bodies by rolling stuff up with your katamari. Its all the story Katamari Damacy needs, and a handy jumping-off point for many of the side-missions. These riff on the celestial theme by demanding that the Prince replace the constellations of the zodiac. Need to make a new Pisces? Roll up as many fish as you can. Gemini? Roll up twins! These levels feel particularly quirky thanks to the narrower focus. Youll discover crowns growing in the radish patch in Make Corona Borealis, for instance, while in Make Virgo youll roll up so many maidens that your katamari ball will be a writhing mass of flailing appendages  like a playful, pop art version of Insides final moments. The story is anchored by one of the most memorably offbeat characters ever given life in a video game. Unlike the main missions, these have no fail state but offer a good challenge for those who want to actually find all the requisite objects in each. There are a handful of other twists, too, such as Make Taurus, which simply asks you to roll up the largest cow you can. Here, the trick is to grow large enough to roll up a hefty heifer without accidentally rolling up something cow-related  like a carton of milk  that will instantly end the level. This level may have a time limit of 10 minutes, but it can be over in 10 seconds before you learn what to avoid. Its an interesting but somewhat unsuccessful experiment, as the larger you get the more likely it is youll accidentally run over something tiny that counts as a cow by accident and lose all your hard-earned progress. It can be frustrating and punitive in a way other levels arent, in other words. More successful is Make the North Star, in which youre not told how big your katamari is and instead must nominate an end point to the level when you think youre close to 10 metres in size. As a long-term fan, its cool revisiting all these levels again, not to mention rolling up absolutely everything in the time limit-free Eternal stages. I should mention, however, that Reroll doesnt feel great with the Switchs Joy-Con thumbsticks, and I wouldnt recommend the newly implemented motion controls either. I spent most of my time on Switch using a Pro Controller and on PC using a DualShock 4. Your mileage may vary  I think the Switch sticks are uncomfortable and lack precision in general, and also refused to play Breath of the Wild on the road for the same reason. It only took me a couple of good sessions to play through everything Katamari Damacy Reroll had to offer, but the vast majority of those six or seven hours was spent with an enormous grin on my face, my head nodding along to the incredibly catchy, eclectic score. Katamari Damacy was a breath of fresh air on first release and it still is today, almost 15 years later.", "date": "Dec. 12, 2018,"}