{"name": "Tinykin", "name_review": "Tinykin Review", "ref": "https://me.ign.com/en/tinykin/202069/review/tinykin-review", "text": "My desire for a new Pikmin game is borderline rabid, so I got very excited when I saw that Tinykins army of adorable followers might potentially fill the sprout-shaped void in my heart. But while its simple environmental puzzles may not have entirely sated that craving, its joyous world and extremely satisfying platforming unexpectedly fed a different hunger. Tinykin feels more like a modern evolution of the N64-era 3D platformer formula than most other attempts Ive played, and its laidback exploration and collectible hunting was an absolute delight from start to finish.You control a space explorer named Milodane as you wander your way through a fairly regular two-story home  of course, doing so is made decidedly irregular by the fact that youre the size of a bug. Along the way youll meet the literal bug citizens of this enormous house who have repurposed its rooms into a thriving and elaborate kingdom, complete with an amusement park, nightclub, and slightly worrying church. Each of the six rooms is a distinct level to complete, and the designs of both the environments and the charming bugs that occupy them are a consistent high point of Tinykin.As you complete jobs for the locals and try to assemble the pieces of a device that can hopefully bring Milodane home, youll get a helping hand from the namesake of this game: Tinykin. These colorful creatures can be collected from eggs in fixed locations scattered around every map and then thrown to help you navigate the world or solve puzzles within it. That could mean using the stronger pink Tinykin to carry an object to a specific location or the explosive red ones to blow up an obstacle. There are a set amount of Tinykin to collect in every room and they dont follow you between them, so finding enough to complete the tasks in front of you is a part of each puzzle in itself.One thing you wont be using your helpful little friends for, however, is combat. Tinykin is a completely non-violent game, with no enemies to avoid or health bars to worry about  in fact, the only ways you can die are from falling too far or going in water, and even then you quickly respawn where you were just a moment before the accident with no other consequences. This may sound low-stakes or even boring to some, but its a huge reason for why the vibe of Tinykin is so delightfully chill, putting the focus on exploration and discovery and providing plenty to make that fun enough on its own.Levels are open, but they masterfully draw you between little self-contained areas.Every room is a relatively open playground to run around, but the way those levels draw you into little self-contained areas that then branch off to others is masterful. For example, you could set yourself toward collecting the golden pollen scattered around a piece of furniture only to meet a bug with a tempting optional quest to complete, or instead start climbing the leaves of nearby house plant upward toward some other home decor waiting to be explored, or maybe unlock the silk string of a bug that you can ride all the way to the other side of the room. Its so easy to get distracted by all the things you could be doing, and that meant I rarely had a dull moment as I tried to explore every corner of each room before moving on to the next.It also helps that moving around as Milodane just feels great. It can be a touch frustrating that you dont linger at the top of your jump arc for very long, but the upgradeable bubble hover ability eventually lets you drift remarkably long distances, and the soapboard you use to glide across the ground (and even grind on platform edges) is ultra satisfying. Theyre not the most complex movement mechanics in the world, and there arent really any true platforming challenges to put your mastery of them to the test, but even relatively straightforward tasks like climbing up a piano are made more fun by the feel of the controls alone.In that sense, Tinykin executes its concept immaculately, but that doesnt necessarily mean that concept is too robust mechanically. For example, its fun to run around a room collecting the Tinykin you need to progress, but their abundance and the freeform nature of exploration means doing so only ever felt like an actual limitation at the very start of a room  after that I usually had enough of a given color well before Id found the spot where I needed them. Similarly, the puzzle of throwing the right color at an obstacle isnt exactly a difficult one, so the joy of each room really does come from that initial wonder as you explore, which can leave them a bit hollow once youve done so.However, the creative themes of each room more than make up for this relative flatness. I loved running around a kids room where all the toys had been turned into amusement park activities, or a kitchen where the bugs had turned into tiled floors into agricultural fields. These level themes dont just reach for the lowest-hanging fruit either, with a standout being a bathroom thats split between a group of party-obsessed silverfish and a faction of party-pooping dung beetles. The writing is consistently funny no matter who youre talking to, and this particular feud is elevated further but Tinykins fantastic soundtrack, with the music growing more energetic as Milodane helps to get the party going again. In the true spirit of an N64-era platformer, these levels are also awash with collectibles. Every room has hundreds of golden balls of pollen to pick up, and grabbing enough of them will earn you duration upgrades for your hover jump. There are also a handful of optional quests to find in each new level that will unlock relics to be displayed in a little museum back at you hub base, as well as plenty of side characters to chat with as you progress through the story  including an adorable ghostly ant named Ghasper who likes hiding in dark corners.Its not too hard to 100% every room if you are keeping track of where youve already looked, but I still had a lot of fun for roughly nine hours it took me to do so. That said, because finding new types of Tinykin in later rooms is the only way you get new abilities and those helpers dont follow you between rooms, its a bit of a bummer that you never get that fun feeling of returning to an area with new powers and fresh eyes. That makes fully completing one fairly straightforward, but that challenge at least has a perfectly tuned approachability to it, with collectibles occasionally hiding in some sneaky spots without ever feeling unfair. Tinykin is a vibrant delight, mixing Pikmins army of helpful followers with the spirit of the N64s best 3D platformers. Its far from the most complex game Ive ever played, both in the simple but entertaining puzzles it asks you to solve and the ultra-satisfying but mechanically straightforward movement mechanics youll use to do so. But its levels and characters are overflowing with charm and personality, and the way its oversized rooms are themed and structured hooked me in and didnt let go until every last ball of pollen was in my pocket.", "date": "Oct. 4, 2022,"}