{"name": "Fallout 76", "name_review": "Fallout 76 Review", "ref": "https://me.ign.com/en/fallout-76/155496/review/fallout-76-review", "text": "After more than 50 hours plundering the irradiated wasteland of Fallout 76, the greatest mystery still lingering is who this mutated take on Fallout is intended for. Like many of Vault-Tecs underground bunkers, Bethesdas multiplayer riff on its post-nuclear RPG series is an experiment gone awry. There are bright spots entangled in this mass of frustratingly buggy and sometimes conflicting systems, but what fun I was able to salvage from the expansive but underpopulated West Virginia map was consistently overshadowed by the monotony of its gathering and crafting treadmill. On the surface, Fallout 76 is another dose of Bethesdas tried-and-true open-world RPG formula on a larger-than-ever map thats begging to be explored. As you emerge from Vault 76 youll start in a relatively peaceful forest and venture out into more dangerous pockets of the irradiated wasteland. My favorite is traveling the lengths of the Cranberry Bog, where the pinkish-red fields are seemingly inviting from afar but turn out to be full of a snaking system of trenches and alien forests that hide the worst horrors of the wasteland, but there are many more. But while the lighting and art direction of these different regions are great at setting the eerie mood and tone of a destroyed Appalachia, the actual objects like trees, shrubs, buildings, cars, and more somehow look flatter and less detailed than those in Fallout 4 did three years ago. Coupling that with Bethesdas still-unimpressive character animations, Fallout 76 isnt a good-looking game except when viewed from the exact right angles. Fallout 76 isn't a good-looking game except when viewed from the exact right angles.When you look closer, it becomes obvious that Bethesdas ambitious idea to replace all human NPCs with other players results in a lack of meaningful interaction with the world. Other than 20-something other players spread so thinly over a massive map that chance encounters are rare outside of quest locations, just about the only voices youll hear are recordings of long-dead questgivers, robots, and AI constructs who simply deliver information at you. Where past Fallout games have more than made up for some of their frustrations with brow-furrowing questions like whether to destroy the town of Megaton or what should become of the New Vegas Strip, theres no opportunity for the morally tricky decision-making in Fallout 76 because no one talking to you can hear you. Because of that, the so-called main story quests to track down and eliminate the source of a spreading plague boil down to obediently following a breadcrumb trail of journals and notes. With the exception of some occasional goofy and creative tasks, it all feels like chasing ghosts. And though later missions mask the shallowness with some cool large-scale battles and events, theyre fleeting moments. Wandering the diverse wasteland does reveal one of Bethesda's great strengths: environmental storytelling.Wandering the diverse wasteland of Appalachia does reveal one of Bethesdas great strengths: environmental storytelling. Discovering a goofy teddy bear playing pots-and-pans drums in a shack in the middle of nowhere tells me someone was here for a time, and so very bored. A skeleton holding flowers, a bottle of wine, and a stuffed animal reveals that someone was about to take the plunge and profess their admiration when the world burst into flame. A half-sunken church with tunnels leading into a deeper, icicle light-adorned cavern has me wondering who reclaimed this place? Was it a sanctum? A place to hide from everything outside? All of these little moments and so many more are dotted across the landscape of West Virginia, and though theyre such small things, they speak volumes about the diverse variety of lives that were led before the bombs fell and in the times shortly thereafter. But really, it just made me want to meet some of them. Wasteland Infestation By now this shouldnt be news to anyone, but: a new Fallout game has bugs. Yet even by the notorious standards of a Bethesda open-world game, Fallout 76 is technically shaky, and unlike the radiation-soaked radroaches and bloatflys you encounter these annoying bugs cant be resolved by incinerating them with a laser pistol. Technical problems occupy the spectrum of severity. Some can be endearing: Ive casually shot the head off a feral ghoul, sending both parts cartwheeling into the air at hilarious speed, and watched a hulking crustacean get caught in a small patch of trees, unable to free itself from what, to it, shouldve been a tiny weed. Thats not ideal, but in dour moments they can add an absurdist sense of humor to the otherwise-dreary wasteland environment. I've had quest targets already dead upon arrival, forcing me to jump from server to server until I found one where it was still alive.Im far less amused, however, by the hive of deeply frustrating bugs thats infested virtually all of Fallout 76s systems. There are noticeable framerate dips and freezes for several seconds at a time that sometimes recover and sometimes crash the application, and these are as common as the rising and setting sun.There are quests that cant be completed  some of which were addressed with a ridiculously large post-launch patch, but others have not  and Ive had quest targets already dead upon arrival, forcing me to jump from server to server (not easy to do because theres no server browser  youre automatically assigned one on every login) until I found one where it was still alive. Im looking at you, Evan. Ive seen whole sections of my camp suddenly disappear, or load in 30 seconds after Id fast-traveled to it, or duplicate all the materials for no reason, forcing me to delete the entire blueprint and rebuild piece by piece. Ive been stuck on never-ending loading screens. Ive watched wasteland cows glitch 30 feet into the air, and back down, over and over. Ive stared in disbelief as power armor turned player characters into long-appendaged vaguely humanoid monsters (Okay, maybe that one should be in the funny category) or cause players to go invisible. One of my cohorts characters became stuck for a full day and couldnt play at all. The list goes on and on and on. But despite their frequency and severity, most are corrected when you quit the application and relaunch - but because you cant declare one server your home and find it again on demand, that means any server-specific things you do, like taking over workshop camps and building resource generators, are left behind and become casualties of Fallout 76s rampant issues. Bethesdas open-world games have always had a touch of random instability, but at least everything was usually as we left it when we restarted and came back. I imagine the fact that Fallout 76 is an online game has ratcheted all the usual problems up quite a bit. Mr. Oppenheimer's Neighborhood What I appreciated most about playing with friends is the companionship and levity they add to this lonely world.On paper, encountering a stranger controlled by another human in the dog-eat-dogmeat world of Fallout sounds like a dangerous thrill. But instead of playing up the kind of uneasy alliances and backstabbing weve seen in other survival games and battles royale, in Fallout 76 youre almost prohibited from engaging in anything resembling player-versus-player aggression. You cant do any significant damage until both people have attacked each other, so theres no element of surprise and no sense of danger. Its the most kid-gloves version of competitive multiplayer Ive ever seen. And even if you do kill someone, or even just pick the lock on their camp, theres virtually nothing to be gained but a price on your head and a bright red marker on the map inviting everyone to take a shot at you. Instead, Fallout 76 is more of a cooperative PvE game, and thats where its at its best since the solo experience is desperately lonely and you have to find everything yourself, rather than have your friends divide and conquer by building their gear into different styles and share finds they dont need or want. Loot is individual to each player, so everybody gets to loot the same corpses  hence, the more players you have, the greater the payoff for each kill. The mechanical benefit of grouping brings the ability to freely fast-travel to one other, use teammates custom-built camps, and of course the added firepower your friends and their guns bring certainly helps later on when youre fighting two, or three Skyrim dragon-like scorchbeasts at once, or any of the other more deadly dangers in the wasteland. But what I appreciated most about playing with friends is the companionship and levity they add to this lonely world. You can also share a subset of cards in the flexible new Perk system. Fallout has always allowed us to customize our characters by picking every so often from a handful of gameplay-altering modifiers, such as making certain items weigh less, doing more damage while sneaking, or even more creative bonuses like Cannibal, which allows you to regain health by eating the flesh of humanoids. Fallout 76s take on this system is actually pretty clever - everybody gets packs containing random perk cards which can be assigned to your SPECIAL (Strength, Perception, Endurance, Charisma, Intelligence, Agility, and Luck) slots. Mechanically, Fallout 76's combat falls somewhere between floaty and just fine.But there are some frustrating UI elements that come with grouping, alongside a barebones friends list menu. Additionally, I found it frustrating that members of the team dont get experience for a kill unless they tag it before it dies. I understand this is likely to prevent power leveling, but the difference between hiding behind a rock while a higher level teammate does all the work, and hiding behind a rock and shooting an enemy with a single bullet in the same scenario is the smallest of differences. More often than not, it meant our team was more focused on making sure everyone shot every target at least once before it was killed, rather than enjoying the fight. Mechanically, Fallout 76s combat falls somewhere between floaty and just fine. I leaned into rifles at long range and shotguns or melee swipes up close - but always in first-person, because hitting anything up close in third-person is hit-or-miss. With only a watered-down real-time version of Fallouts signature VATS auto-targeting available, which is really only useful for spotting enemies at a distance or taking out obnoxiously small targets, every little bit helps against the inventive and varied enemies. The recognizable insects, ghouls, robots, super mutants, and not-so-super mutant animals are all here, alongside some strange, creepy, and downright bizarre creatures that reside in the fringes of West Virginias distinct and atmospheric biomes. Even after 50 hours, Im still occasionally coming across a new variety of man-eating monstrosity, and thats one of the few things left to look forward to. Unfortunately, poor AI and pathing means most of these monsters  even the mightiest beasts  can be killed in the cheesiest ways you can imagine. That takes some of the sense of achievement out of it. One of Fallout 76s brightest ideas, though, is your portable camp which can be built up and dropped almost anywhere in the world that isnt too close to an existing structure. Thats a big improvement over Fallout 4, which limited you to building on specified plots. I'm still coming across new varieties of man-eating monstrosities, and that's one of the few things left to look forward to.In your camp youre given a budget of items allowed to build, basically, whatever you want. A three-story mega structure? Go for it. A platform with no walls, just a stash box and workbench? Thatll work in a pinch. A house complete with chairs, beds, lights, a Nuka Cola machine, and even some motel-esque artwork? Do it. Thats a largely cosmetic choice for people who enjoy building for the sake of building, but the camp system is most powerful when used a mobile repair and resource shop, using the limited budget to build a weapons, armor, tinkerer, and chemical crafting stations, along with resource-generating machines so you can return and collect materials for future crafting. The fact my camp was mobile meant I could deploy it in the middle of a high-level warzone and find relative respite and to repair when fights against more difficult monsters wore me down. However, because theres no real PvP, theres little need to fortify it with buildable auto-turrets other than to lure enemies to yet another cheap-feeling death. While the defense options are impressive, like no-nonsense artillery cannons, going that extra mile is expensive and I found the budget was consistently better spent on maintenance and resource options. And like just about everything else in Fallout 76, this system suffers from a number of bugs that makes moving camp a huge hassle. Sure, you can save your blueprint, or store a completed structure for quick deployment later, but the placement system is so finicky that something as small as a rock or tree intersecting with a single part of your base means you cant set it down. Ultimately, I was able to pick up shop and drop it down somewhere else, but the majority of attempts I would spend too long trying to find the perfect spot without success, so I would regularly need to scrap the structure and lay each piece down individually. The Cost of Creation Tracking down the plans to create new gear is one of the best-feeling measures of progression.When youre not running quests youre scrounging for pretty much anything thats not nailed down, scrapping those items for materials, and crafting better stuff. Tracking down the plans to create new gear, or pieces for your camp, or even recipes for better food or stimulants is one of the best-feeling measures of progression. Largely because once you own it, its yours. Youll never need to worry about using it, or losing it, or repairing it, and when I was able to craft a power fist that exponentially improved over my other melee weapons after tracking it down and spending hundreds of caps on the plan, I had a genuine sense of pride. And there are a wealth of weapons, armors, and items to collect, assemble, and mod. In the beginning youll be taping a pipe to a trigger and using it as something resembling a gun. Or boiling smelly leather for makeshift scraps of armor. Theyre entry level, sure, but there the best you can make and that makes them valuable if only for a short time. Toward the late game, the emphasis swings almost entirely from exploration and discovery to resource and inventory management.Eventually youll find pre-made weapons, and then the focus becomes scrapping enough desk fans for screws, wonderglue and duct tape for adhesive, and cans and canisters for aluminum to make mods like scopes, better receivers, stocks, and more. Augmenting your found or crafted gear into more formidable implements. Theres a genuine satisfaction to creating something from scraps, but the constant hunt for household items to breakdown for materials to feed your ever-growing arsenal is a monkey youll never get off your back. In fact, toward the late game, the emphasis swings almost entirely from exploration and discovery to resource and inventory management support your repeated attempts at endgame scenarios. Thats when youre required to build, maintain, and carry your entire arsenal of power armor, a hefty selection of weapons, and ample ammo alongside the food, water, and chemical stimulants that you have to regularly pop to render the light survival elements (consisting entirely of a food meter and a water meter) all but completely irrelevant. All of this weight easily bogs you down, and your personal stash box in your camp has an absurdly tiny 400-pound limit. Remember, this isnt a traditional Fallout game where you could drop 15 gatling laser cannons into a single desk drawer and expect them to be there when you return 15 hours later  Fallout 76 barely has a sense of object permanence. So by the time I reached late-game levels I was spending at least five minutes of every hour I played just managing and sacrificing inventory to avoid the severe mobility consequences of becoming over-encumbered. That got old quickly. The Nuclear Option But by this point  the late level 40s  Id become bored with the monotony of Fallout 76s endless loop. Yet finally, after dozens of hours grinding missions, searching for launch codes, solving a cypher, my team of weary survivors approached the ultimate goal for one last thrill: we invaded a pre-war silo and fought off wave after wave of the same super-powered robots for the privilege of launching a nuclear weapon somewhere on the map. By this point I'd become bored with the monotony of Fallout 76's endless loop.Though going through the many steps seems needlessly convoluted  traveling all across the map to find a number of codes with an expiration date, along with specially marked key cards, that then needed to be deciphered with a cypher that left plenty of room for error and the possibility of losing all these materials without ever getting a chance to complete the objective. Fortunately we figured it out, and fought more robots, and more robots, and then once we started the sequence, we fought even more robots. But I must admit: the seconds just before and just after the warhead fell to Earth were the highest of highs Fallout 76 had offered me. The explosion was spectacular from my planned vantage point. And that's when I knew I was done with Fallout 76.Yet when we ventured to the impact site, now glowing bright orange, in search of high-level goodies, what we found was deeply discouraging. Even the power of a nuclear explosion couldnt shake up the Fallout 76 gameplay beyond nudging the number of hitpoints the bullet-sponge enemies possessed even higher, which meant it boiled down to fighting stronger versions of the same enemies wed already killed hundreds of times. The reward: rare plants and resources that would allow us to craft more powerful weapons and armor to I guess, do it all over again, except more easily. Was the slog worth it? Not really, no. And thats when I knew I was done with Fallout 76. Finally, the fact that theres a cash shop with obscenely expensive cosmetic items  like power armor skins that cost somewhere around $15 USD if you havent acquired enough of the secondary currency yet. That Fallout 76 is in need of so much other attention, but youre still able to spend money on cosmetics from the storefront adds some insult to the overall injury. In an effort to do everything, Fallout 76 fails to do any of it well enough to form an identity. Its multiplayer mindset robs its quests of all the moral decisionmaking that makes the series great, and all thats left is a buggy mess of systemic designs that never seems to work together and regularly contradicts itself. It all culminates in an aggravating endgame thats more busywork than satisfying heroics. Bethesda missed the mark with Fallout 76, in part because it seems like it could never decide what it was aiming for.", "date": "Nov. 22, 2018,"}