{"name": "Battlefield V", "name_review": "Battlefield V Review", "ref": "https://me.ign.com/en/battlefield-v/155863/review/battlefield-v-review", "text": "Welcome, Battlefield fans! Now that weve taken in-depth looks at the single-player and multiplayer sides of Battlefield V, its time for our final overview and verdict. For the full picture, make sure to check out each part. While its absolutely a massive and addictive shooter, theres little question in my mind that Battlefield V launched well before it was ready. Between the brevity and lack of gameplay variety in the single-player campaign, the problems that arise when playing anything other than Conquest on certain maps, and perhaps most troubling of all, the frequent and sometimes game-breaking bugs are all issues that seem like they could be solved with a couple more months of development time. As I said in my review of the centerpiece multiplayer modes, the good news is that Battlefield Vs new design features, like the attrition system which limits health and ammo availability, succeed in enhancing class identity and teamplay. Meanwhile changes to recoil, time to kill, spotting have the effect of making the battlefield a more lethal, and immersive place. Heres my verdict on the multiplayer modes. The feeling of getting in on the ground floor of something that will inevitably much better mere months from now is unavoidable while playing Battlefield Vs multiplayer. Squadplay and infantry combat, in general, is taken in a very worthwhile direction with smart tweaks to guns and resources, but the same care hasnt been applied throughout. Rampant bugs, wildly varying mode times in similar playlists, and half-baked features like Combat Roles take their toll. The good news is that patches are already rolling out, and with a year or more of free maps and modes on the way, Battlefield V can only get better from here. Score: 7.5 Read the full Battlefield V Multiplayer Review Single-Player Elsewhere, the fact that only three of four single-player campaigns are available right now only adds to the feeling that Battlefield V was rushed out. Its baffling that you dont even get to drive a tank outside of the intro. Whats here is decent, even though theyre a little short at only about five hours, and there are some moments that genuinely strike a chord. Heres Dan Stapletons verdict. Battlefield V's single-player campaigns have a heavy reliance on stealth that doesnt always play to the series strengths, but they do tell some poignant stories and deliver great-looking and sounding gunplay in explosive battles. A lack of enemy variety or consistent AI makes it feel a little whack-a-mole in the more linear segments, until it opens up and gives you some options for how you want to tackle its objectives. Score: 7.3 Read the full Battlefield V Single-Player Review Like a fresh recruit, Battlefield V was clearly deployed into action without adequate preparation. And a variety of bugs, underdeveloped features, and placeholder menu screens remind you of that at nearly every turn. However, theres a great deal of raw potential here that could, with time and luck, be forged into one of the series best. Bold changes to Battlefields traditional gunplay, essential resources, and team dynamics create a strong foundation. On the single-player front, Battlefield V presents three short but distinct vignettes that weirdly focus on small-scale stealth instead of bombastic vehicular warfare. Their successful story moments arent really enough to go out of your way for but theyre worth playing once youre here. Overall, Battlefield V can be lots of fun to play today, even if theres still a lot of building left to do.", "date": "Nov. 21, 2018,"}