{"name": "Steel Division: Normandy 44", "name_review": "Steel Division: Normandy '44 Review", "ref": "https://me.ign.com/en/steel-division-normandy-44/133305/review/steel-division-normandy-44-review", "text": "Steel Division: Normandy '44 accomplishes one of the most difficult feats in strategy gaming: it's a historical wargame where the fun of the game and the accuracy of the history are intertwined, instead of at odds. Developer Eugen Systems has had success with real-time wargames before (with its cleverly titled Wargame series) but with Steel Division its escalated both the production values and tactical complexity, with remarkable success. Unlike the stereotypical World War 2 strategy sim, Steel Division isn't about pushing counters across a map and waiting for some dice rolls to turn out in your favor. It's a great-looking game, for one, with lush, detailed maps and units. Controlling it feels good too  any real-time strategy veteran should almost immediately feel at home with its interface. There is a significant learning curve in terms of how to play Steel Division well, but it's attractive and enjoyable enough to get started with that it's hard not to want to play more. Conceptually, Steel Division works like a rock-paper-scissors game with 10 different options instead of three. Infantry can hold most defensive positions, but move slowly and are easily pinned down in the open. Tanks are the most versatile offensive unit, but well-positioned anti-tank guns and enemy tanks can knock them out with ease. Anti-tank guns can be negated by artillery, but both are susceptible to bombers, which can be deterred or destroyed by fighters and anti-air. It's a complicated dance, and it can be punishingly difficult if you don't get it right. Defense is easier to grasp than offense, so even if you're losing you can still pin down opponents and feel like you've accomplished something This complication is what makes Steel Division special.Yet this complication is what makes Steel Division special. It never feels like there's a layer of abstraction between the tactical choices you might make and the historical simulation of the wargame. The relatively simple interface and clear, great-looking graphics make it easy to tell what's happening in an engagement while an incredibly detailed simulation runs under the hood. It's not like a wargame that's more about figuring out how the spreadsheet underneath works, nor is it like a real-time strategy game that requires deploying skills and special moves at the right time. It's the complexity of the former with the accessibility and excitement of the latter. Preparing to attack. What makes Steel Division even neater is that the tactical combat of individual tanks and airplanes also matches the grand strategic goals of World War II; success comes from pinning down an enemy with infantry and artillery, then flanking with tanks and vehicles. At both the macro and the micro levels, Steel Division is a superb WWII wargame. Eugen used actual Royal Air Force recon photos to create the maps.This is reinforced by the chosen setting of Normandy, France, in 1944. Eugen Systems used actual Royal Air Force recon photos of northern France to create the maps, which include some of the most famous battles of the campaign, such as Hill 112. But every map (there are over a dozen) has certain features of the Normandy campaign, most notably the hedgerows and treelines that gave the area its nickname ~Hedgerow Hell.~ These features give each map its own very specific tactical choices  at Colombelles, for instance, there's a long, straight road approaching the main battleground that's a perfect place for an anti-tank gun  but an enemy who knows that will consistently pound that spot with artillery Very specific quirks like that give Steel Division more depth, as veteran players can end up engaging in a poker-like set of bluffs and counter-bluffs. Some matches are brutal, World War I-style slugfests of infantry constantly being thrown into the meat grinder, while others have long, slow feeling-out processes where two players may not even significantly engage with one another directly and try to find victory by focusing on other regions of the map. The Beute Firefly: Devastator of multiplayer matches. That's possible because every map in Steel Division is designed for up to 4v4 matches, except for a couple of gigantic 10v10 battlegrounds (which are far more impressive in theory than practice, as they tend to be won by whichever team has the fewest disconnects). Six or eight players is Steel Division's sweet spot. It can be overwhelming to try to manage every aspect of a battlefield as a single player, but with teammates (either as AI in Skirmish mode or human in multi) the ebb and flow of the battle becomes far more manageable as players cover each others flanks or focus on different aspects of the battle to overcome weaknesses, like a plane-heavy division providing air support to an infantry battle. It's seriously imposing for people who aren't WWII buffs.In fact, Steel Division's biggest weakness, especially for new players, is that there is so much detail that it can feel overwhelming. In addition to that bevy of maps with their nooks and crannies, it also has 18 different historical divisions from both sides of the war with a huge variety of different units in each, and it asks you to not only pick between them but also to create ~Battlegroups~ (somewhat like decks of cards) from the different units within them. This means, for example, picking between multiple fast-moving mortar artillery units or a single long-range howitzer. This level of customization can be great once you've gotten a good feel for how the maps and combat work, but a lack of straightforward description of what makes each unit different makes it seriously imposing for people who aren't WWII buffs and don't know the difference between each kind of tank, for example. Yet once you do get deeper into Steel Division, that level of variety and customization can turn into another strength. Each division has its own personality and unit quirks: the American 101st Airborne, for example, is heavy on air power but light on tanks, while the Scottish 15th Infantry can flood the field with elite foot squads but has very little air support. Steel Division is detailed enough that a single unit can totally alter an encounter  such as how the German ~Hitlerjugend~ division can deploy an elite Beute (captured) Firefly tank in a match's earliest phase. Lines of sight: they're a little bit important. While Steel Division has a great engine, interface, and maps for World War II combat, the structure of its matches can feel arbitrary. Each match is divided into three phases  A, B, and C  with a certain set of units available in each. Phase A has largely recon, infantry, and outdated/cheap tanks and airplanes, B has the bulk of conventional units, and C has the elite and high-tech units. Every few minutes, each player is granted a certain number of points to purchase units which then drive up to their deployment spot (there's no resource gathering of any kind). This does do a good job of making sure that a wide variety of different units are used, but it also feels somewhat over-rigid in terms of the internal narrative of each battle. Steel Division is entirely focused on constant and fair tactical combat.Likewise, the victory conditions in the skirmish and multiplayer modes are mildly unsatisfying. There are two: Conquest, where victory is won by having more control over the map; and Destruction, where victory is achieved by destroying a certain amount of enemy units. What's unsatisfying about each may be self-evident: Conquest doesn't take casualties into account, while Destruction doesn't factor in map control. On the other hand, it's hard to see how Eugen could have done better  thanks to the balance of divisions and lack of resource-gathering, Steel Division is entirely focused on constant and fair tactical combat, which doesn't lend itself an obvious endgame. There are a set of single-player campaigns which are cleverly put-together, but they are not Steel Division's main selling point. Each campaign follows a single division through four battles in the Normandy campaign. For example, in the first scenario of the easiest campaign, as the 101st Airborne, you land behind German lines and take out their artillery so the troops from the beaches can progress inland. Each of the missions in the campaign is around a half-hour each, so it's possible to complete one in a single sitting if you're winning. Defending a town in the campaign. What the campaigns do manage to do (especially the first American one) is introduce Steel Division's concepts in a more controlled fashion than the skirmish mode. First you learn deployment and defense, then recon and offense. The next mission trains you to use forests to cover infantry units while also pointing out great points to place anti-tank units for long sightlines down key roads, which is probably the single most important tactical concept new players needs to learn. The campaigns are helpful for learning at the planning level as well. The Battlegroups you put together are much smaller and more manageable initially, and helpfully introduce new tactical choices slowly over time  the 101st Airborne, for example, doesn't have tanks and airplanes available initially, but gets them after a couple missions where you have to show you know how to use infantry and artillery. There's also a narrator who explains the strengths and weaknesses of specific units, a feature unfortunately missing from the rest of Steel Division. Steel Division: Normandy '44 succeeds both at being an entertaining real-time tactics game and a compelling simulation of historical combat, which is a remarkable combination. Not to get ahead of things, but playing this excellent World War II game makes it hard not to get excited about the potential of Steel Division: Stalingrad '42 or Rome '43. Future games or expansions might even smooth out Normandy 44s small drawbacks, specifically its occasionally overwhelming amount of detail and lack of context to its huge number of options, but its successes wildly outweigh its failures.", "date": "May 26, 2017,"}