{"name": "Battlefield [2018]", "name_review": "Battlefield V - Single-Player Review", "ref": "https://me.ign.com/en/battlefield-2018/155472/review/battlefield-v-single-player-review", "text": "Welcome, Battlefield fans! This year, we've broken up the review into its single-player and multiplayer components to give fans of each style of play a better idea of what's up. This review covers only the single-player mode, with our multiplayer review and overall Battlefield V review coming soon. All too often, the single-player campaign of a primarily multiplayer shooter is little more than a glorified tutorial. The Battlefield series has certainly been guilty of this in the past, but Battlefield V's set of three two-hour campaigns definitely isn't. Each has a fairly interesting story that guides you through a series of locations that are diverse and beautiful when they're not being reduced to flaming rubble around you. I just would have loved if it made better use of Battlefield's awesome set of tools to put us in the middle of a full-scale war more often. This is a run-and-gun shooter, where the health is regenerating and the weapons and ammo are plentiful. As a result, whenever the action heats up the pace is generally as fast as the explosions are spectacularly loud. So it's an odd design choice by DICE that two out of the three campaigns have you fighting almost entirely on your own and emphasize the just-okay stealth gameplay. That's fine, except that it doesn't put the Battlefield series' strength of huge maps with room for lots of large-scale warfare to good use. It doesn't put the Battlefield series' strength in large-scale warfare to good use.Also strange is the fact that these missions are fought almost entirely on foot, aside from a few maps that give you the option to hop in a jeep or a plane. The only time you get to drive a tank or fly a real airborne mission is for around a minute in the brief tutorial, which is a bit of a tease. The three stories together are still a fun six or so hours to fight through, but there's a lot left on the table in that regard. The first campaign, Under No Flag, stars a young delinquent recruited by a gruff veteran to join Britain's Special Boat Service which, it turns out, has very little to do with boats. The pair's sabotage mission in northern Africa begins with a fairly linear, stealthy stroll onto a Nazi airfield where the most memorable moment comes from the banter between the two. Their mentor-protege relationship is cliched but well written and acted, with a few moments of genuinely funny humor to strengthen their characters in the short time we're with them. Under No Flag's second mission is where it gets interesting: a wide-open map gives you your choice of three targets to tackle in any order. Technically it makes little difference what you do, since none of the facilities you're out to bomb affects the other two, but the freedom to approach them from any angle  stopping to tag enemy soldiers with your binoculars and plan your assault, Far Cry-style  gives an illusion of control. The map is big enough to allow you to steal a plane and fly around, though on normal difficulty the enemy planes barely seemed to fight back so controlling the skies wasn't as challenging as it seemed like it should've been. You can stop to tag enemy soldiers with your binoculars and plan your assault, Far Cry-style.The campaign is capped off with a holdout mission against waves of Nazi infantry and vehicles, which is a decent fight as long as you avoid thinking about how absurd it is for one man to run between anti-tank, anti-air, and anti-personnel turrets to single-handedly fight a small army to a standstill. It helps in that effort that enemy AI is pretty weak throughout. German soldiers will sometimes take cover, but just as often they'll charge into machine gun fire out in the open. And once you've shot one, you've shot the vast majority of them  variety is limited to standard troops with various but similar weapons, up-armored versions of those same soldiers who can absorb an annoying amount of bullets, and occasional flamethrower soldiers. That does give the vehicle encounters a boss fight feel, especially since anti-vehicle weapons are harder to come by. The second campaign, Nordlys, sends us to frozen, Nazi-occupied Norway in the clogs of a young female resistance fighter who  I kid you not  kills enemies by throwing knives at them while zooming by on skis. Those are pretty tricky to pull off, for obvious reasons, and once you've nailed one to satisfy the mission's challenge you're probably best off sticking to stealth, where those throwing knives make things drastically easier. You can whip out the skis at any time, though, which is fun to play around with  especially if you aren't too concerned about being spotted or having to reload a checkpoint after careening off the edge of a cliff to your death. They get much more useful in her second-to-last mission, which again opens things up and lets you choose your targets. Skis are no substitute for planes, though, which are sadly absent here. You can kill enemies with throwing knives while zooming by on skis.In a boost to variety, Nordlys makes use of the freezing weather to introduce a unique gameplay mechanic in one of its missions where you must warm yourself at a fire every so often to keep from freezing to death. However, I wouldn't have wanted this to go on any longer than it did, since patient stealth kills and time limits dont mix well. I had a harder time getting interested in this character than in the British one, in part because it's hard to read subtitles for the Norweigan voice acting while you're being shot at, but also because her motivations and origins are so straightforward. The final campaign available at launch, Tirailleur, is by far the best, for several reasons. The first is its story, which deftly handles its commentary on race during the liberation of France by having it take a back seat to a more universal commentary on the human costs of bravery and ambition, thus avoiding feeling heavy-handed. History, it says, does not always favor the bold. Despite similar problems with forcing non-French-speakers to divide our attention between lining up headshots and reading subtitles, Tirailleur's protagonist comes across very effectively as a man whose noble goals drive him to reckless methods. Tirailleur is the only campaign that makes me feel like I'm an important part of an army in a war.Second, Tirailleur is the only campaign that makes me feel like I'm an important part of an army in a war rather than a super-powered Rambo. Right from the start, you fight alongside your fellow troops who're being cut down right and left, and their presence makes the whole scenario feel much more plausible. The fact that the wind blows a ridiculous number of autumnal leaves over the corpses of soldiers from both sides as you charge past makes it that much more poignant. These battles  including its impressive coup de gras mission to capture a fortified chateau on a hill  are large-scale, and even though you never really get to drive or fly any vehicles at all we get to see the spectacular sights of a battle raging across the map, with artillery and rockets raining down in the distance (or on top of you if you don't keep moving). This is clearly what Battlefield is best at, and I have to wonder why DICE didn't lean into it more. Replayability in the campaign missions comes from scattered collectibles and achievement-style challenges, such as taking down an airplane with a handheld weapon or rescuing a resistance fighter without being detected, which gives you something to do besides the path of least resistance. It should be noted that the campaign screen has a spot held open for The Last Tiger, which at some point in the near future will let us play from the perspective of a non-Nazi German conscripted into a tank crew. EA hasn't said specifically when this fourth campaign will be available. Battlefield V's single-player campaigns have a heavy reliance on stealth that doesnt always play to the series strengths, but they do tell some poignant stories and deliver great-looking and sounding gunplay in explosive battles. A lack of enemy variety or consistent AI makes it feel a little whack-a-mole in the more linear segments, until it opens up and gives you some options for how you want to tackle its objectives.", "date": "Nov. 11, 2018,"}