{"name": "Deracine", "name_review": "Déraciné Review", "ref": "https://me.ign.com/en/deracine/155396/review/deracine-review", "text": "Dracin is haunting, and not just because you play as an invisible ghost-like figure wandering the halls of a boarding school. Its thanks to a smart focus on character and place that come together to produce an eerie, surprisingly moving fairytale that, mostly, overcomes its pedestrian use of VR. Dracin is fairly conventional in the how of its VR interaction: you teleport from spot to spot, using two spectral hands to interact with key items. Theres no health or mana bar, no fights to prepare for  rather, as a spectral faerie caught between time, youre free to move about the mansion setting at a leisurely pace. Across a number of chapters, FromSoftware and SIE Japan's five or six-hour adventure functions like a point-and-click adventure you just so happen to be physically standing in the middle of. Find an item in one room that can lead to opening a chest in another, but you may need to listen to a line of dialogue to figure out where that initial item actually is. Deracine unfortunately makes little use of its most interesting mechanic.While the gameplay itself is relatively uninspired, there is a central mechanic that opens up intriguing possibilities. As a faerie, you possess two rings which allow you to essentially sap a living organism  from fruit to a person  of its remaining time in the world and imbue another living thing of similar size with that essence. Its a pretty intriguing concept whenever its employed, but thats unfortunately only a few times. Thankfully, the why of being in VR is more interesting. Stuck between time, you have the ability to interact with the inhabitants of a large orphanage-slash-school both as they are, frozen in that particular time, as well as their past echoes. And youll essentially want to check in with the kids no matter when they are, not just for clues about how to pull off a mild-mannered prank or aid but because of the great character development. Interacting with most people, past or present, triggers a small globe of light that is effectively an audio diary to appear. While the saccharine dialogue threw me at first, I quickly became enamored with its earnest charm. These kids dont fully comprehend the life theyre leading but theyre all trying to get along, and observing their interactions with one another made me care more deeply for them than I expected. I thought of Dracin's mansion estate as fondly as I would a childhood home.Part of that came from the space itself, because Dracin does a great job of emphasizing nearly every nook and cranny of its large estate. And while the mundane tasks of fetching herbs or finding a certain book arent innately interesting, backtracking through familiar rooms and hallways is rarely a chore. Each chapter opens and closes select parts of the estate to suit the story, which let me become familiar with certain areas of the mansion over time. By the storys end I came to think of it almost as fondly as I remember my childhood home. And the mundanity of the tasks feels intentional. Not only does it allow for some good character development, but it also allows an uneasy sense of darkness just below the surface to pervade. Part of that expectation for things to go south comes from FromSoftwares pedigree for the dark and twisted, so when things eventually do take a macabre turn, its not so surprising. But I did come away surprised at how much I wanted to ensure the future of Dracins core cast. The feeling of being a faerie serves as a pretty satisfying metaphor for how and why we use VR itself  to observe a world and scenarios we otherwise couldnt and maybe even leave our mark on these worlds. Time was often frozen, but I wanted to intercede often so that when it flowed, it moved toward a positive end. How Dracin addresses that human desire  to improve the present and even fix the past  is often touching and even lyrical. Whats more, the story hints at more lore than I expected, and by the end I became just as interested in the childrens future as I did this worlds past. Im not sure I understand every facet of what makes Dracins faeries tick, but what I did learn captivated me, and made me hope for a bit more time in its world. FromSoftwares foray into VR is as fascinating for its storytelling ambitions as it is disappointing in its overly familiar gameplay. Intriguing mechanics are just waiting to be taken advantage of, but the act of playing Dracin never rises above other, similar VR experiences. Nonetheless, FromSoftwares knack for worldbuilding shines in this contained environment with a delightful cast of characters, intriguing lore, and a beautiful, metaphorical examination of our human desires to see the ones we care about be happy.", "date": "Nov. 7, 2018,"}