{"name": "iPhone Xr", "name_review": "IPhone XR Review", "ref": "https://me.ign.com/en/iphone-xr/155186/review/iphone-xr-review", "text": "The base model iPhone has remained relatively unchanged since the iPhone 6. But with the iPhone XS, XS Max, and XR, Apple has moved the entire lineup to an edge-to-edge, home button-less form factorwith the XR acting as the most budget-friendly option (well, budget-friendly in Apple land at least!). While early adopters have had their hands on this design for a year in the form of the iPhone X, the XR will be many peoples first foray into the brave new notch-based world. Even though the XR is positioned as the affordable iPhone X variant, at $750 it's still quite expensive, so it needs to deliver. iPhone XR  Design and Features At first glance, the iPhone XR looks a lot like last years X: an edge-to-edge display with a notch along the top, a swipe up line in apps where the home button used to be, a glass back for wireless charging, and a larger power button on the side. But once you get it in your hands, youll notice a few differences from the X. First, the 6.1~ display on the XR is larger than the iPhone 8 with its 5.5~ panel, and the X and XS with their 5.8~ displays. While its price lies below the XS and XS Max, its size actually occupies a space in between: slightly taller and wider than the XS/8, and slightly thicker than even the Max and Plus models. This gives the phone some serious weight in your hand, which makes it feel premium, but a bit too hefty for my tastes. The extra thickness is surprisingly noticeable, and will certainly make the phone feel a tad bulky if you put a case on it. The camera bump also feels thicker compared to the 8, though is probably on par with the X and its newer siblings. Speaking of the camera, it uses a large single lens on the back, unlike the X, XS, and XS Max, which all have dual cameras. However, its still able to take portrait photos using software, though it has a few caveats (which Ill get into in a bit). Finally, lets talk about the display. While the XR adopts the edge-to-edge design of the X, XS, and XS Max, it isnt completely edge-to-edgewhile it still uses almost the entire face of the phone, there are some slightly thicker almost-bezels along the sides, top, and bottom. In addition, instead of using an OLED panel like the other X models, the XR uses an LCD that Apples marketing team has named Liquid Retina. I was still impressed with how dark it could get... As a result, it doesnt have quite the killer contrast ratio of the other X phones, so the notch and edges are slightly visible against a black background. But frankly, I was still impressed with how dark it could get, and its unlikely to annoy you unless you have a very discerning eye. The display also has a lower pixel density than the XS and XS Max, at 326 PPIthough its the same as the iPhone 8 and older non-Plus displays, so frankly, it still looks fantastic, especially with the wide color gamut, 120Hz touch sample rate and TrueTone color shifting (if youre into that). All of these differencesthe thicker body, single camera, the toned-down display, and a slightly lower IP67 water resistance (compared to the XS IP68)are obviously cost-cutting measures, which Im more than willing to accept for a phone under $1,000. Apple has also granted the XR better battery life than its more expensive siblings, even with the same A12 Bionic processor. So if you can get behind the phones sizewhich is the most noticeable difference, and may only annoy some usersyoull probably find the XR offers a great balance between features and cost. It's also available in six different colors, unlike the XS and XS Max, which are only offered in three. iPhone XR  Usability If this is your first iPhone without a home button, youll have to get used to the new way of doing things. Instead of pressing the home button to wake up the screen, you either lift the phone, tap the screen, or press the power button on the side. Lifting the phone felt a little sluggish to wake in my experience, but the other two were quite snappy. To access the home screen, you just swipe up from the bottom edge. In practice, doing this on such a large screen feels a bit clunkier than using the old home buttonespecially if you have smaller hands, like mebut you get used to it after a while. Other gestures are a bit tougher, though: to open the app switcher, you swipe up from the bottom and hold your finger in place until it appears, which takes a bit of practice to get right. 3D Touch is also gone, which is frustrating since Apple doesnt seem to have replaced that functionality with anything yet. If you previously used 3D Touch to, say, access Google Maps quick shortcuts on the home screen, youll be missing those features for now. 3D Touch is also gone, which is frustrating... With the home button kicked to the curb, youll also be relying on Apples Face ID to unlock your phone. The XRs iteration of Face ID is faster than the iPhone Xs, and it does feel zippy (though you still have to swipe up from the bottom to get to the home screen, which feels like it slows the process down compared to the old fingerprint sensor). However, while Face ID was quick enough to be invisible on the home screen, I felt like it worked slower when using it in apps. For example, when I open LastPasswhich itself is protected by another layer of Face IDI felt like I was sitting there waiting for Face ID to register, compared to tapping the old fingerprint sensor. To be fair, this may just be due to the fact that Im waiting for Face ID, rather than doing something when I put my finger on the home buttonkind of like how sitting in traffic feels slower than driving down side streets, even if it takes you the same amount of time to reach your destination. All in all, the new gestures take some getting used to, but after a few days, Im had gotten the hang of it. I still miss the home button and TouchID, and its a bummer to see them goneespecially since it feels like theyd just reached their prime with the iPhone 8s super-fast iterationbut this is the future, so perhaps I just need to get with the times. Finally, the battery life seemed really good in my daily usage. I didn't run any official benchmarks, but I can definitely say that I had no problem making it through a whole day of usage on a single charge, with some to spare. iPhone XR  Camera Tests Like every modern iPhone, the XRs camera is very goodone of the best on the market. Its HDR is arguably weaker than the Pixel 3s according to most reviewers who have seen both, but its still a step up from even the iPhone 8 Plus and X cameras, so if you liked the camera on your old iPhone, youll like this one even better (especially now that the its infamous over-softening has been improved in iOS 12.1). ...the XR's camera is very goodone of the best on the market. The single-lens Portrait Mode is one of the XRs most notable features, and it can produce some good looking shots...under the right conditions. First of all, since it uses software to detect faces, it only works on peoplenot objects or pets. Second, since it adds blur to the background using software rather than actual depth perception, certain photos will look more natural than others. Take the following two portraits my wife took of methe left with her dual-lens iPhone 8 Plus, and the right with the iPhone XR. Notice how the 8 Plus dual lenses are able to create a more realistic depth of field, with the leaves getting blurrier as they get farther away. Meanwhile, the XR just blurs everything behind my headit still looks good, just not as good. However, conditions arent always ideal for those portrait shots. In the shot below, youll see that the XR blurred my glasses right out of the shot, leading to something that looks glitchy and fake. Similarly, in the rightmost shot of my son in his Halloween costume, you can see the right eye on his hat is blurry when it probably shouldnt be. The XR does allow you to adjust its fake depth of field tricks using the Depth Control slider in the Photos app, but even that cant really fix the issues aboveit can just make the blur more or less aggressive. If you take a lot of Portrait Mode shots, Id spring for the dual-lens iPhone. But if you only see yourself using it very occasionally, youll probably get by with the XRs software implementation just fine. iPhone XR  Gaming The mobile gaming ecosystem has its problems, but mobile hardware is not one of them. There are few, if any, games that can truly max out Apples last gen A11 processor, so as expected, the A12 kicks serious butt when it comes to graphically-intensive games. Asphalt 9 played at a smooth 60 frames per second with no stuttering, and apart from a bit of aliasing around the edges, the graphics were beautiful (at least on the smaller 6.1-inch screen). When it comes to internal power, the iPhone XR games as well as any other mobile device on the market. The lack of 3D touch is a bit of a bummer, though, as I always found it useful in games that took advantage of that feature. The biggest gaming hindrance, however, is the screen. Games that support the edge-to-edge display look fantastic, providing a large, pixel-dense field of view. But not all games support it, and some older or lower-budget games may still play at their old aspect ratio with black bars on the left and right sides. The difference is noticeable when switching between games, especially in titles that use the sides of the screen for touch controls, like Breakneck. You have to make sure youre tapping on the side of the games screen, rather than the phones screen, for your taps to actually register. Thats kind of annoying once you get used to playing newer, X-compatible games and dont have to reach your thumbs as far. Thankfully, developers have had a year to update their apps, meaning lots of titles should be compatibleyou arent dealing with early adopter levels of incompatibility.", "date": "Nov. 3, 2018,"}