{"name": "FIFA 23: Legacy Edition", "name_review": "FIFA 23 Legacy Edition (Switch) Review", "ref": "https://me.ign.com/en/fifa-23-legacy-edition/202005/review/fifa-23-legacy-edition-switch-review", "text": "The year is 2022. EA has returned with their annual gift of regretful dj vu for Nintendo Switch owners. A dystopian future is (mercifully?) nearer than we think. Nintendo Switch (OLED Model) - Neon Blue/Neon Red Int'l Version . . 1,218.00 View on Amazon  I could copy and paste my review like I did two years ago, but unlike some of the folks at EA I dont take much satisfaction in reusing material. Oops, I think thats what I said last year, actually. I struggle to care at this point. For the FOURTH year in a row, EA Sports has released a virtually unchanged edition of FIFA onto the Nintendo Switch. As stated on the official website, FIFA 23 Legacy Edition will feature the same gameplay innovation from FIFA 22 without any new development or significant enhancements. As a reminder, heres what was written there for last years game: FIFA 22 Legacy Edition will feature the same gameplay innovation from FIFA 21 without any new development or significant enhancements. Oh, and the year before: FIFA 21 Legacy Edition will feature the same gameplay innovation from FIFA 20 without any new development or significant enhancements. And to complete the set: FIFA 20 Legacy Edition will feature the same gameplay innovation from FIFA 19 without any new development or significant enhancements. And let me remind you that FIFA 19 on Switch wasnt exactly great in the first place FIFA 19 Legacy Edition Verdict FIFA 19 is a threadbare experience on the Switch. The inclusion of the Champions League and a significant graphical upgrade goes some way to approaching the levels of presentation found on the PS4, Xbox One, and PC version, but on the pitch its a mile away from being a premium football simulation and fails to build on last years game. I can see myself having some fun playing the new House Rules modes locally with friends, but in most single-player modes there is no doubt that it is a repetitive and unfulfilling experience. Due to the FIFA license sailing away from EA towards pastures new next year this will be the final EA game called FIFA to appear on a Nintendo console. What a sad legacy to leave behind. Next year we'll likely be reading EA Sports FC 24 Legacy Edition will feature the same gameplay innovation from FIFA 23 without any new development or significant enhancements.~ Lets hope for better. FIFA 23 on Switch is a prime example of minimal effort for maximum profit. If you've bought the Nintendo version of FIFA at any point in the past five years, there's very little reason to buy it again now.", "date": "Sept. 30, 2022"}