{"name": "Dark Souls", "name_review": "Dark Souls Remastered for Switch Review", "ref": "https://me.ign.com/en/dark-souls/154636/review/dark-souls-remastered-for-switch-review", "text": "Dark Souls Remastered has, after a lengthy delay, finally arrived on Nintendo Switch. While this is really a technical and graphical polishing of the original  theres no major new gameplay content  the Switchs handheld mode adds an absorbing new dimension to what is, for me at least, a very familiar experience. But it also did something I wasnt expecting: it made the return to Lordran feel oddly new. If you dont know much about Dark Souls, heres what IGN said when it first came to consoles... ...if you're interested in the limits of the video game form  to see just how focused, how pure and how uncompromising in its vision a game can be  Dark Souls is unmissable. If you take the time get into Dark Souls' mindset, to begin to understand the twisted way in which it operates and taste the rewards behind its cruellest challenges, this is one of the most thrilling, most fascinating and most completely absorbing experiences in gaming.  Keza MacDonald And all of that still holds true. Dark Souls remains one of the most demanding yet rewarding action RPGs ever made, set across an intricately designed world that yields its secrets only to the most intrepid and curious. One criticism that can be fairly levelled at the original is its shocking performance in certain areas. Blighttown  already a hostile environment for any player  was plagued by crippling frame rate issues that made navigating its gauntlet of dung pies and toxic darts even harder. Thankfully those problems have been ironed out in the Remastered edition. I reached the end of the game, regularly switching between docked and handheld mode, and never encountered anything that diminished my experience. The Switch version supports 1080p in TV mode, which is an improvement on the original, and 720p in handheld mode. Both run at a fairly steady 30fps. While this is technically inferior to the 60fps, 4K experience available on PS4, Xbox One, and PC, its still such a refreshing upgrade from the original that it really didnt affect my enjoyment whatsoever. While it doesnt have all of the texture improvements you can find on those other platforms  bonfires don't burn as realistically, chugging estus has a less showy visual flourish  it only really suffers in a direct side-by-side comparison, and wasnt something that detracted from my experience, especially in handheld mode. Its important to remember this is a remastering of the 2011 original, not a remake  these minor graphical improvements mostly to polish the original rather than pave over it, which is still a welcome improvement. Dark Souls Remastered includes the exceptional Artorias of the Abyss expansion, but outside of that, there are no major changes to the core experience. There are a handful of quality-of-life improvements that address some very small, dated issues from the original. You can now easily consume multiple items at once, making it much less laborious if you want to buy something with collected souls or deepen your allegiance to a covenant. Incidentally, its possible to switch covenants at any bonfire. (Previously you would have to pay a visit to the covenant leader, which could involve a lengthy trek.) It's yet another small change but one that makes exploring Dark Souls oblique multiplayer aspects just that much easier. These are minor amendments to the original, changes made with seven years worth of hindsight that longtime players will feel more keenly than newcomers, but theyre welcome nevertheless. The option to play Dark Souls in handheld mode is the best thing about the Switch version. When it was first announced for the platform, the idea of confronting Ornstein and Smough on public transport sounded farcical, but in practice, Dark Souls feels oddly suited to a portable device. I found myself using commutes to get to the next bonfire, do one more boss run, or mindlessly grind souls to buy upgrade materials. If youre familiar with the structure of Dark Souls and its world, its easy to give yourself errands to do which suit the pick-up-and-put-down nature of a portable console. (That said, occasionally you will get engrossed in odd places. I sat on the Southbound platform of the Northern Line for 40 minutes until I beat Artorias.) Initially I thought it would be a nice option to have, but it quickly became my preferred way to play on Switch, giving me a fresh new way to experience a familiar adventure. Watch Blighttown gameplay from the Nintendo Switch version in the video below: The surprisingly interconnected world of Lordran looks lovely on the Switchs smaller screen, despite its lower resolution. One slight grievance is that I had to frequently adjust the brightness setting when switching between TV and handheld modes, and theres bizarrely no option on the Switch to downsize Dark Souls jumbo-sized HUD, which is available on other versions of the Remastered edition. But both are minor gripes against what is otherwise a fantastic port. Dark Souls Remastered is a technically better version of an already-exceptional game. While the Switch version may lack some of the higher-end features available on other platforms, it still presents a more pristine version of the original, and importantly adds the exciting and absorbing dimension to explore Lordran on a portable device.", "date": "Oct. 18, 2018,"}