{"name": "Sinner: Sacrifice of Redemption", "name_review": "Sinner: Sacrifice for Redemption Review", "ref": "https://me.ign.com/en/sinner-sacrifice-of-redemption/154532/review/sinner-sacrifice-for-redemption-review", "text": "Everyone whos played enough of the Dark Souls series and its contemporaries has probably asked themselves at least once, wouldnt this be better if you could just skip the levels and fight the bosses? Sinner: Sacrifice for Redemption, an indie boss rush Soulslike from developer Dark Star, explores that question, distilling the Soulslike experience into eight devilishly challenging duels. Though it is not quite an airtight proof of concept, the ideas at its core make Sinner an interesting blueprint for a boss rush twist on the classic Dark Souls model. More than simple pattern recognition, learning the quirks in each of the long winded fights demands situational awareness and experimentation. Decoding the bosses is as important as being able to react to their attacks, and the process of figuring out whats going on each phase of each fight binds an engaging intellectual exercise to the technical mastery (and muscle memory) that the genre generally demands. Seven Deadly Sins, One Track Mind While its conceit is sharp and well thought out, much of Sinner feels rough and under-developed. The story is simple and vague: As the nameless wanderer, you must defeat the avatars of the seven deadly sins, each one drawn from the wanderers past. The bit of narrative you get in a series of short cutscenes make the stakes seem high, but you never actually find out what is on the line, which ultimately made it hard to get too invested. If you need a reason to fight beyond embracing the challenge, you will be left wanting. The characters and levels feel similarly bland. The protagonist is a smooth graphite-skinned boy with no distinctive features other than glowing retina-less eyes, lacking much personality of its own. Likewise, many of the levels are similarly simple arenas surrounded by blurry, shapeless vistas. The generic settings led to situations where it became difficult to keep track of my surroundings in combat, which can be deadly since most levels have bottomless cliffs or rivers of lava into which I repeatedly rolled by mistake. The lack of visual specificity in the arenas feel like a missed opportunity: Each boss fight creates a snapshot of a story, and while the arenas are all visually distinct enough to tell them apart, none of them feel especially memorable. The one exception is, of course, the bosses themselves, who feel much more defined than the worlds around them. From Envy, a headless woman in an armored ballroom gown, to Greed, a scythe-wielding plague doctor spewing poison from every pore, each sinful challenger has an interesting set of skills and aesthetics. The great care put into the bosses, however, feels like a double-edged sword, as it makes the lack of detail in the story and setting even more noticeable. Leveling Down, Not Out Sinner weakens the powers and abilities you have throughout the game rather than giving you new ones. All of this makes Sinner feel pretty rough and tumble, but if you can look past it, there is an engaging experience at its heart. Though Sinner is largely derivative of Dark Souls and its ilk, it subverts the genre in a few key ways (beyond just cutting out the in-between levels) that pack fascinating ideas and meaningful progression into a game that purposely limits the number of chances it has to make an impression. The moment-to-moment controls feel similar to every other Soulslike. Most of your movements  attacks, sprinting, rolling, blocking  are limited by a stamina meter. Your attacks and abilities are dominated by animation priority, where a button press triggers an action that takes several seconds to carry out. Mastering your timing, to the point where you have a precise mechanical control, is essential to taking down your opponents. The things that separate Sinner from its peers are actions that affect the spaces around each boss, both before and during combat. In keeping with the punishing aesthetic of the genre, Sinner weakens the powers and abilities you have at the start, rather than giving you new ones. Before entering each boss fight, the wanderer must level down, which imposes a new penalty from reducing his health and stamina, to weakening his attacks, to making his shield breakable by heavy attacks. The system creates a Mega Man-style strategy to choosing the order of your fights. By the time you reach the final fight, youll accept all of the penalties, but youll get to decide the order you take them on. There is a balancing act between avoiding the penalties you find most severe and prioritizing the enemies you want to fight unhindered. It can lead to some devastating self-doubt in low moments: When youve fought a boss five times in a row and made no progress, you may start to wonder if you chose poorly. Its a brutally effective mind game, which pairs well with Sinners intimidating challenges. The punishing leveling down system can lead to some devastating self-doubt in low moments. The penalties make it harder for you to beat the bosses, but before you take them down, you have to figure them out. Sinners second great strength is in how it forces you to engage with each fight as a multi-stage puzzle, as well as a technical challenge. Every boss has at least one attack or string of attacks that can kill you outright if it lands, making them seem unstoppable. To circumvent the seemingly impossible odds, many of their attacks have special interactions with either one of your abilities or the environment, which offer you an opening or, at the very least, a way to avoid dying instantly. Envy, for example, opens the fight by throwing a variety of projectile weapons, including some axes that stick into the ground. Later, she switches to an array of magical lightning attacks, which are tough to dodge but can be blocked by her leftover axes. There is no indicator to suggest that you should use the axes as shields  in fact, theres another fight where similarly long-standing projectiles become an issue if you dont clear them out. If you pay close attention, though, youll eventually pick up enough meaningful interactions to create a strategy. Between figuring out each boss and perfecting your play, each win feels like a masterstroke. Though its achievements feel very incremental, Sinner: Sacrifice for Redemption moves the Soulslike genre forward in some interesting ways. The slimmed down structure presents some challenging and entertaining boss fights, but doesnt quite feel like a complete package. It lacks narrative and aesthetic detail, but there are a few clever new ideas hidden inside its generic shell.", "date": "Oct. 17, 2018,"}