{"name": "Soulcalibur VI", "name_review": "Soulcalibur 6 Review", "ref": "https://me.ign.com/en/soulcalibur-6/154579/review/soulcalibur-6-review", "text": "After a six-year absence from the 3D fighting scene, Soulcalibur makes a triumphant return in its seventh entry in the main series. The next in Bandai Namcos line of arcade fighting games keeps true to its unique brand of weapon-based combat while sprinkling in just the right amount of new mechanics. The combination not only sets it apart from its predecessors, but also keeps it competitive against all others in its genre. The story goes back to its roots, retelling the events of the original Soulcalibur, and provides two very different but equally worthwhile story modes that flesh out the tale of swords and souls in a way thats more digestible than ever. But above all else, Soulcalibur 6 is pure fun. Its fun to play, fun to learn, fun to watch, and even when some dated presentation issues rear their heads, they do very little to tarnish Soulcalibur 6s luster. Mechanically, everything thats made this series great returns in Soulcalibur 6: the 8-Way-Run, the well balanced fighting system of vertical and horizontal attacks, and the ever-so-satisfying weapon based combat that makes every character feel distinct and powerful. New to the series is a mechanic called Reversal Edge, which puts your character in a stance that allows them to absorb several hits before delivering their own strike. This attack initiates a rock/paper/scissors-like minigame to decide who deals the next hit and recovers the momentum of the fight. On the surface, this might seem like a luck-based guessing game on top of a duel of skill, but once you really dig into it, it opens the door for some really tricky mind games. For example, if Kilik wins a reversal edge duel with a kick, he doesnt get much out of it outside of a bit of small damage, making it a non-optimal option for him, basically only good for beating a vertical attack. The Reversal Edge mechanic rewards those who do their research while adding a deeper level of mind games mid-match. However, both vertical and horizontal attacks allow him to get great follow up damage, with a horizontal attack even allowing him to combo into a Critical Edge. And thats specifically just for Kilik. Other characters have their own ideal outcomes from a Reversal Edge clash, rewarding those who do the research while adding a deeper level of mind games in matches. Every character now also has a Soul Charge. Players can build meter by landing attacks, then at the cost of a bar of meter, give themselves a unique buff and access to new powerful moves and combos. Its a great addition that adds further distinction between characters. And Soul Charges add a choice for players when spending their meter: Either dump a bar of meter on one huge move that deals damage up front, or use a Soul Charge to potentially deal more damage over a longer period of time. The rest of Soulcalibur 6s mechanics feel like a refinement of an already fantastic combat system. Im thankful guard impacts no longer cost meter. I love that lethal hits are new super counters that are very similar to crush counters in Street Fighter 5. And even with all the new mechanics that could complicate Soulcalibur 6, its still one of the easiest fighting games to jump into, start slamming buttons, and still have a great time. A Tale of Souls and Swords, Eternally Retold Libra of Souls and Soul Chronicle are Soulcalibur 6s two story modes. Yet rather than telling two different stories, they actually cover the same timeline in wildly different ways. The main attraction, Libra of Souls, is an RPG-esque mode that focuses on your created character, known in the world as The Conduit. Youll level up, buy new gear and items, travel around Europe and Asia via a map screen, and complete missions, sometimes with crazy conditions like beating a series of enemies in an arena as slippery as an ice rink. Libra of Souls starts slow with a story presented almost entirely without voice acting or cutscenes. But after a couple of hours, it quickly became one of my favorite story modes Ive ever played in a fighting game. Libra is challenging, its mission variety does a great job of keeping the combat fresh, and it forced me to explore movesets in ways I otherwise wouldnt have. Theres also a great sense of progression thanks to the RPG elements and smartly designed weapon upgrade system that kept me coming back. Unfortunately, that lack of voice acting and those static screens mean the plot can get a little dry at times. But its overall narrative kept me invested enough to want to see it through to the end, with encounters with other characters adding a nice dose of context to the other story mode, Soul Chronicle. Soul Chronicle is the main story that runs parallel to Libra of Souls. Its fully voice-acted offering is the more traditional single player Soulcalibur story experience involving the cursed sword Soul Edge as it follows the main trio of Kilik, Maxi, and Xianghua, and their pursuit of Nightmare. You can also select each individual character and experience a quick mini-campaign that focuses on what theyre doing at a specific period on the timeline. Basically, it takes the individual character stories of an arcade mode, lays them all out conveniently on a timeline, and lets you tackle them in any order you want. Its a great addition and ties the character roster together in a very cohesive fashion. Soul Chronicle mode is a great addition and ties the character roster together in a very cohesive fashion. The rest of Soulcalibur 6 is pretty standard: an Arcade mode, Training Mode, and online play for both casual and competitive. Training mode feels a bit bare bones this time, with no combo challenges to give you a clear path on getting better with a character outside some combat tips buried in menus. The tips themselves are great, but a mode that actually teaches them to you and allows you to see how they work in practice wouldve been much appreciated. While competition in online casual play was sparse pre-release, the matches that I did have felt pretty smooth, addressing the hit-or-miss netcode of the series' past. Its also worth mentioning that on a base Xbox One, long load times pervade every mode, with it taking as long as a full minute in between matches in arcade mode. Playing on an Xbox One X cut the load times by about half, as does playing the game on either a Base PlayStation 4, or a PlayStation 4 Pro. The on-disc roster is disappointingly small at only 20 characters, but those that made the cut are almost all of the series favorites. And of course, Id be remiss to not mention the fact that Geralt of Rivia makes a special guest appearance as a playable character, with a fighting style that combines swordplay with his magical signs that makes him feel both unique and right at home among the cast. Despite some minor issues, the soul of Soulcalibur 6 is so strong that they dont do much to bring down what is one of the best entries in the series. The new Reversal Edge and Soul Charge mechanics add new layers of strategy and mind games while the one-two punch of Libra of Soul and Soul Chronicle will provide hours upon hours of fantastic single-player content. Beyond that, Soulcalibur 6 is just straight up fun for players of any skill level.", "date": "Oct. 17, 2018,"}