{"name": "The DioField Chronicle", "name_review": "The DioField Chronicle Review", "ref": "https://me.ign.com/en/the-diofield-chronicle/201937/review/the-diofield-chronicle-review", "text": "Its easy to draw lines between The DioField Chronicles sweeping story of war, magic, and shady politics and those of Game of Thrones or Fire Emblem. I'd have to write off the whole fantasy genre if borrowing were a deal-breaker, but they still have to figure out how to assemble those parts into something that stands alone. In this case, it ends up feeling like, at best, a generic version of its inspirations. And while its real-time combat system is an exciting twist, it's often difficult to work with the controls as you fight through its quick, engaging battles. Even the characters who end up having unexpected or interesting roles to play in the unfolding tale end up coming across a bit dull, though that's no fault of the veteran voice cast. Sony Playstation 5 Console Standard Edition . . 2,498.00 View on Amazon  The world of DioField feels like anyone's first try making up a whole new setting for a Dungeons & Dragons campaign, complete with an evil empire trying to conquer everything and characters earnestly named things like ~Fredret Lester.~ You have corrupt nobles scheming, a fanatical church, beast men  it's all well within the Big Book of Fantasy Tropes, but it's not entirely without charm. There is something homey about it all, even if it feels fairly predictable. I was impressed with the entire voice cast who bring this world to life, including some excellent, gravelly narration from Geralt of Rivia himself, Doug Cockle. But the voice direction leaves a lot to be desired, with many important conversations let down by stiff and unenergetic deliveries. While each member of the main cast has a complex and interesting backstory and motivations, the way the English dialogue is written doesn't always come across as very authentic. The variety of enemies and diverse encounter design keeps any two missions from feeling too similar. The same is true of combat, as well. The fundamentals are strong: it's sort of a pausable real-time Fire Emblem with waypoint-based movement, lots of environmental interactions, and plenty of diverse classes and abilities to weave together. When it's running smoothly and I'm blasting my way through hordes of foes using careful positioning and skill combos, it makes me eager for more. Across six chapters and more than 40 hours, it can certainly deliver plenty of new adventures, too. The variety of enemies and diverse encounter design, which may have you desperately defending a castle gate or taking on a multi-stage boss fight, keeps any two missions from feeling too similar. The figurative bugbear looming over all of this is the control scheme, which is just a pain. It seems designed for a controller, but I actually find it equally annoying whether I chose to play it that way or with a mouse and keyboard. Selecting units is imprecise. You can pause the battle by selecting units, but there's no standalone pause button. Certain simple actions just take more steps than I feel like they need to. If I have my knight selected and I hit the key to bring up the special moves menu, why does it switch to a different character and make me select him again? I thought I would eventually get used to frustrations like that, but at best I learned to tolerate it a bit more by the end. I thought I would eventually get used to control frustrations. And it's a bummer, really, because the kinds of clever things you can pull off would have made me look forward to every mission otherwise. Each one is brisk, about five to 10 minutes long even with a lot of pausing, which keeps the action fierce and the campaign from ever bogging down  even if you do all the optional stuff like I did. Mission types that I would normally find annoying, like escorts, become almost a speedrunning puzzle that encourages me to think about the optimal path of destruction before I even hit ~go.~ Single-target damage is fairly hard to come by, on purpose. So the flow of a battle usually revolves around luring or forcibly moving enemies into a spot where you can dump all of your area attacks on them for maximum effect. Attacks from behind always deal extra ambush damage, so abilities that let you redirect aggression and reposition your own party go a long way. Charging in head-first will almost always get you killed, but it's incredibly satisfying when you manage to line up a cavalry charge, an exploding barrel, a summon ability, and a magical meteor shower to melt an entire army in the blink of an eye. Failure usually isn't that big a deal, since missions are fairly short and designed to be replayed. Bosses like the fearsome wolf Fenrir have multiple health bars you have to deplete, which changes up the pacing of some missions in interesting ways, allowing healers more of an opportunity to shine. And of course, enemy casters and elite fighters have area attacks of their own that you have to scramble to avoid  which made me even more annoyed at the lack of a simple pause button I could hit to collect my thoughts. At least failure usually isn't that big a deal, since even the longest missions are fairly short and designed to be replayed for bonus objectives. However, some missions do feature long dialogue sequences you have to button mash through every time you replay them. Its worth it to go back and check all those boxes, since they give you more resources to use in the expansive progression systems. It can be a bit overwhelming at first to keep track of all the different currencies: individual characters earn ability points to boost their stats, while each character class can be upgraded with skill points, and your company of mercenaries (and later Knights) gains Unit XP as well as ranks in individual facilities like the shop and the blacksmith. Oh, and I didn't even mention how you can spend rare resources to unlock new summons and weapons. But once I got a handle on it, I really enjoyed the level of customization it gave me over my four-character party. There's a satisfying sense of taking a ragtag group of sellswords and training them up into one of the most feared fighting forces on the continent. And the economy is very well-balanced, so I never got to a point where I couldn't find anything meaningful to spend my shiny treasure on. DioField is pretty good-looking, too. The lighting and character models aren't going to blow anyone's mind, but it shows a strong art direction and creates a sense of identity for everyone, from the main cast down to minor characters. I may not always approve of their fashion choices  purple boots with a blue uniform, really? But looking at anyone in this world tells you a lot about who they are and what they do. That being said, the vibe is a bit too much generic medieval fantasy. Square Enix is usually good at putting its own spin on these tropes in games like Final Fantasy and Chrono Trigger, but I just don't see it here. In addition, while characters will often talk about what they're feeling, their faces arent very emotive in most conversations, which contributes to the sort of dreary, boarding school atmosphere. This whole world could have benefitted from someone turning the attitude dial up three or four notches.Of course, every time I summon Bahamut from the sky to rain destruction on my foes, these concerns fade away, if only for a moment. Big dragon shoot shiny fireball good. As an able, fast-paced tactical JRPG that spins a respectable, if generic swords and sorcery yarn, The DioField Chronicle is mainly let down by frustrating controls and stiffly-animated characters performing what is often a stiffly-written script. Shorter, action-packed missions make it an ideal Switch or Steam Deck game: something to chip away at little by little in your free moments. But even with its deep, multilayered progression system, there isn't enough heft here to make me want to sit back in my chair and sink into its uninspiring fantasy world for many hours at a time.", "date": "Sept. 29, 2022"}