{"name": "Logitech G Pro Headset", "name_review": "Logitech G Pro Headset Review", "ref": "https://me.ign.com/en/logitech-pro-g-headset/154002/review/logitech-g-pro-headset-review", "text": "The idea behind Logitechs new G Pro lineup is simple  provide a lean, elegant and high performing gaming peripherals that aims for the competitive crowd, and not for those that wants the extra bling that usually comes with gaming hardware these days. This means that neither the G Pro mouse, keyboard or the headset have any RGB lights, or additional G buttons attached onto them. They are stripped down to their bare minimum and the price reflects that too. Of the bunch, we will be looking at the G Pro Gaming Headset today. Its a $90 wired gaming headset that is supposedly designed with the help of pro gamers, and promises competitive advantage thanks to its Pro-G audio drivers. Its got a 3.5mm jack for cross-platform compatibility and a Pro-G microphone, but beyond that, the overall package is as lightweight as it gets. While its feature-set might not be enough to stand-up against rivals in the same price category, which is crowded with a number of fantastic devices, my time with the G Pro headset proves that, at the very least, Logitechs new audio peripheral is no slouch either. Design and Comfort The G Pro Headset is strikingly similar to Logitechs own G433 headset, except that it ditches the mesh covering for a soft-touch finish on the earcups and hard plastic on the headband. While others might take the headset as rather bland looking, I actually appreciate the sleek and sophisticated look that Logitech is going for. Its all black, except for a logo on the earcups, and the devices appealing contours keeps it for being too simple. The unassuming look also helps using them out in the public without drawing too much attention to yourself as other, more game-ified headset might do. There are no controls on the headset itself, but instead they are relegated to an inline control on the detachable, and lengthy, audio cable. The inline control is tiny and lightweight, so there is no pull on one side, or any kind of discomfort. It features a clip so you can attach it to your shirt, a smooth volume rocker, and a mic on/off switch. The audio cable ends on a single 3.5mm jack which makes the headset compatible with the PS4, Xbox One, or any device that takes a 3.5mm input. The package also includes a headphone/mic Y-splitter cable so you can use it on a desktop PC. The included boom mic looks like any other mic that comes with other headsets, with a bendable wire-like structure and a pop-filter covering the end. Its detachable so you can get it out of the way if you are using the headset outside or are simply enjoying a single player game. But it is also fairly adjustable and easy to position during online play where chatting with your teammates is required. The G Pro headset comes equipped with soft leatherette ear pads, but can be switched out for a set of included microfiber ones if you prefer that. But no matter what style of ear pads you use, the G Pro headset are extremely easy to wear, and I have no qualms about saying that they are one of the most comfortable headsets I have ever used. The clamp force, earcup padding and the headset weight are superbly balanced so that you can use these headset for hours on end without any discomfort whatsoever  a necessary requirement, I guess, when you are in a high stake competitive match. I used the headset to play the entirety of Shadows of the Tomb Raider and Spider-Man on the PS4, with tons of Fortnite and Overwatch matches thrown in for good measure, and not once did I felt the need to remove the headset to give my noggin a break. Performance The biggest knock against the G Pro headset is that it does not come with a surround sound solution. It is indeed odd, especially since the Logitech G433 is slightly cheaper and does include virtual 7.1 surround sound support. However, it should be noted that stereo headsets rarely benefit from virtual surround sound, which usually adds plenty of shallowness to the audio in order to simulate an expanded soundstage. This results in a loss of details and bass, which makes most games sound quite weird. Most headsets include the DTS Headphone: X 7.1 surround sound, which from my experience, is absolutely terrible. If you are indeed desperate for surround sound, Windows and Xbox One both feature Microsofts own surround sound solution called Windows Sonic for Headphones, which is by far the best software-based virtual surround sound I have used. And its free, too. Not that the G Pro headset needs any sort of virtual help at all  its got a massive soundstage (or as big as a closed-back headset can go), which creates a roomy surround sound experience even in stereo mode. I was able to judge both the range and depth of sounds in Battlefield V Beta, Overwatch and Fortnite, helping me gauge exactly where the attack was going to come from. Logitechs Pro-G drivers are certainly tuned for the high-end in order to enhance gun shots and footsteps but they arent harsh on the ears and causes minimum fatigue. The mids and low-end are also given proper care, where neither muddies the other, so dialogues and explosions come out with pristine clarity. I thoroughly enjoyed using the G Pro headset for single player and multiplayer games, but music is where they seem to suffer a bit. The headset are rather flat sounding, and lacks the fidelity of other headset in its category, so the music sounds sort of lifeless and doesnt have the pop and richness to deliver a lively performance. Songs sound clear and with plenty of detail but it just doesnt have the energy to get your foot tapping. Coming to the microphone, its an extremely competent piece of kit that isnt too raspy and has plenty of detail and richness to the sound to deliver your voice across clearly. It is one of the best mics I have tested on a gaming headset before, and could easily substitute for streaming if your higher quality mic is out of order. Heres a sample of the microphones quality below: The Logitech G Pro Gaming Headset launches into an extremely crowded sub $100 market, but manages to hold its own with phenomenal comfort and extremely competent audio drivers that delivers plenty of detail and packs a massive soundstage.", "date": "Oct. 3, 2018,"}