{"name": "Fire Emblem Echoes: Shadows of Valentia", "name_review": "Fire Emblem Echoes: Shadows of Valentia Review", "ref": "https://me.ign.com/en/fire-emblem-echoes/132921/review/fire-emblem-echoes-shadows-of-valentia-review", "text": "Call me a bit old-fashioned, but sometimes I like things a little more direct. A written card instead of an evite. A face-to-face talk instead of a Twitter DM. Or a straightforward strategy RPG that gets right to the point and lets me learn from my mistakes. Fire Emblem Echoes: Shadows of Valentia  a well-done remake of 1992s Fire Emblem: Gaiden  is exactly that, and it makes me happy. War and tactics are the backbone of any Fire Emblem, and  surprise!  the story is all about guiding not one but two armies led by a pair star-crossed teens named Alm and Celica against an evil empire attempting to conquer the continent of Valentia (because there is always an evil empire). A hackneyed premise? Yup, but it still makes for a good soap opera, one that wildly oscillates between joy and sorrow as the heroes slowly unspool the truth behind the unending war. The ensuing drama is even better when fortified by the addition of well-made animated cutscenes and strong voice acting. The teens have two different missions on opposite sides of Valentia, which meant I spent most of the 30ish-hour adventure shuffling their respective armies between battlefields on the world map. Fights with enemy soldiers and their monstrous minions, known as Terrors, broke out everywhere and often. Since doing just about anything related to special abilities  from drawing a bow to throwing a fireball  drains HP and increases fatigue (a sort of inverted stamina bar), I had to keep an eye on both armies limited inventory as they quaffed nourishing wines and nibbled cheeses to replenish themselves. Im not crazy about being tethered to this glass cannon mechanic, where you can dish out damage but you can't really take it. I'm aware it's meant to add a strategic element to enemy encounters, but swapping tired units for fresh ones or wasting a turn in combat so a Paladin can use a sack of flour as a feedbag grew tiresome. On the other hand, I liked the addition of the Convoy, an inventory management system that allowed each of my two armies to visit travelling merchants in towns and send supplies to the other team, a convenient feature for when arms reserves got low or my mages needed an extra wine break between casting spells. Although Echoes is a fully tinseled remake of a 25-year-old game, its roots are still firmly grounded in the past. That means that combat --even with a few modern tweaks--isnt nearly as deep or nuanced as it is in modern Fire Emblems. At first I was disappointed by the lack of features. Theres no rock-paper-scissors weapons mechanic to help dictate which units counter which, adjacent allies dont doubleteam enemies or shield each other from attack, enemies and maps offer very little variation, and my dreams of hooking up devil-may-care mercenary Saber with pious priestess Celica were dashed because theres no marriage system. As time went on, however, I came to fully embrace the more straightforward style. Theres a simple joy to the cerebral gymnastics involved in intensely studying an opponents stats and movements. I felt especially clever whenever I managed to subvert enemy maneuvers by using a few tricks of my own. (Highlights include using boarding planks to bottleneck pirates so my mages could throw fireballs at them and having a Pegasus Knight wing over stone ramparts to open the gates of an enemys castle.) And though wedding bells weren't in most characters' immediate future, I could still enjoy the unfolding camaraderie between heroes by placing allied units near each other in battle. This led to some pretty amusing scenarios, especially between the mouthy Mae and her bestie Boey. It's moments like these that make Fire Emblem Echoes rewarding to play. As fun as combat is, there are also plenty of head-banging, soul-crushing, Im-going-to-frisbee-my-3DS-straight-into-the-recycling-bin difficulty spikes. Spell-casting baddies known as Cantors spammed my forces with wave after wave of dragons and skeletons, and witches ping-ponged between trees picking off my most vulnerable units, turning them into fiery ash. I love the challenge of modern Fire Emblem games, but these types of scenarios are frustrating even when playing in casual mode. Developer Intelligent Systems apparently knew this, because they introduced a handy device called the Mila Wheel that let me turn back the clock on battle-related brain farts and erased memories of a unit missing their target. (Even when the target was right there. Right in the adjacent space. Seriously, Leon?) If youve bought the amiibo pack, you can also summon ghostly apparitions of Alm and Celica for a single round of combat. These eerie doppelgnger cost a chunk of health every time they're called upon, but in too-close-to-call battles their presence sometimes made all the difference. (They also unlock a couple of exclusive dungeons on the world map, which is a nice bonus.) That said, it's no huge loss if you decide to pass on the amiibo pack; they're beautifully sculpted, but you don't need them to win. Feeding a hungry army with floor fish is weirdly satisfying Those small tweaks to the battle system arent the only update in Echos. In an intriguing toe-dip into the world of more action-based exploration, this new version lets you guide Alm and Celica through 3D dungeons as they scrounge for coins to pay for weapon upgrades, test their strength against hard-hitting dragons that guard valuable treasure, and participate in hidden-object mini games where you scoop up rare weapons and health-replenishing food someone carelessly left on the ground. Smashing gold-filled crates with a sword and feeding a hungry army with floor fish is weirdly satisfying, and a welcome reprieve from the daily grind of combat. And if I ever found my troops struggling against the scaly beasts and skeleton hordes who haunt these dungeons, I could conviniently hit up the local goddess shrine to promote my troops or change their vocation. Thank the goddess Mila it's easy, too: no need to find magical seals here. Only experience and a conversation or two with one of Milas servants is required, thank you very much! On the battlefield, Fire Emblem Echoes: Shadows of Valentia is a delightful look into the simpler combat of Fire Emblems past. Elsewhere, it carefully guides the series forward into new territory. Theres not as much depth as I expect from this series, but whether I was exploring 3D forests, shrines, and caves in a series first, or learning first hand why Fire Emblems early entries are considered a formidable challenge, it was usually good old-fashioned fun.", "date": "May 17, 2017,"}