{"name": "Destiny 2  Expansion III: Forsaken", "name_review": "Destiny 2: Forsaken Review", "ref": "https://me.ign.com/en/destiny-2-expansion-3-forsaken/152816/review/destiny-2-forsaken-review", "text": "Destiny 2: Forsaken is everything I could have hoped for in an expansion to Bungies shared-world shooter  and more. With impressive cutscenes, including the gut-punch death of Cayde-6, it adds drama and a darkness that keeps me motivated. The raid offers intricate challenges and larger-than-life bosses to destroy for any team brave enough to face them for a chance at great rewards. Stunning new locations, like the Dreaming City, keep me in awe while hunting for secrets and a plethora of incentivisation improvements to the Power Level grind make Destiny 2 feel like the game I fell in love with again. This quest for vengeance, which begins with a grandiose prison-break sequence filled with witty wisecracks, introduces you to new friends like an overweight Fallen crime boss named Spider and returning faces like fan-favorite Petra Venj. Each brings a welcome voice that adds a new mystery to the universe we thought we knew so well. Spider, specifically, acts as a catalyst to weave the Adventures right into the campaign by sending you on missions around the Tangled Shore. Its nice to see this adjustment in delivery, in contrast to the previous approach where it was easy to miss these side quests stories about characters from the main storyline. Now we chase down all the Barrons responsible for Caydes death, and each of them comes to a head with an interesting boss battle featuring unique mechanics or challenges to overcome. One of my favorites is the Mindbender, who received a power buff for his part in the killing of our Vanguard hero and, with his new abilities, sends us on a chase into a hive-themed lair for the final fight. I absolutely think that this is exactly how a raid encounter should be and I hope Bungie continues with this trend.Im going to talk a bit about the raid here and Ill do my best to avoid spoilers, but if you want to completely avoid them youll want to skip over the next two paragraphs. The Last Wish raid begins with a few encounters that are fairly easy to complete with good team coordination, but the later missions have a level of intricacy to them that will push any team to their limits. As a fireteam, you need to know every part, be able to adjust to unforeseen changes to your plan, and work together to support each other. I absolutely think that this is exactly how a raid encounter should be and I hope Bungie continues with this trend. Even as players reach a higher Power Level in the coming weeks, the precision required to complete the challenge is going to be difficult to overcome  and thats only speaking for the PC, which is where I played. (It may be easier to pull off on PC, because according to Destiny Raid Report, after three days only seven groups on console were able to complete The Last Wish Raid while 68 have done it on PC.) The level of execution required needs to be flawless and a few mechanics will make things a little tougher for people using a controller as opposed to mouse and keyboard. For comparison, 761 teams completed Leviathan, Destiny 2s first raid, on the day it launched. The toughest encounter is easily the larger-than-life boss Riven, who has 13 eyes, six of which you need to remember and shoot at the same time. However, before you even get to her encounter you need to solve a puzzle involving one teammate carrying a ball that will reveal an image to only that player. A second player needs to look through a set of glass, find that picture within a field of 12 others intricate images, and direct the ball carrier verbally to that location so he can detonate the orb within a set amount of time. Both of these examples will force you to trust your teammates and ensure youre able to communicating effectively. The entire reason the raids in Destiny are my favorite parts of the experience is because of the camaraderie and precision youre ingrained with by the time you come out of these trials by fire victorious. The investment system was slightly unbalanced at the launch of Destiny 2: Forsaken and that held back a lot of contenders from finishing the raid in week one. Thats been contentious, but the idea that the raid is a special experience to work toward is something I, as a dedicated Destiny 2 player, like. However, with the new Powerful Engram system in play, if youre exceptionally unlucky your weekly engram could continually drop the incorrect item and hold you back from progressing. During the first two weeks of Destiny 2: Forsaken there have also been bugs that prevented some players from receiving a key item, called an offering, that held them back  or they had a bug that prevented them from being able to acquire more power early on. Thankfully, Bungie has acted quickly and fixed one issue immediately by offering a new weekly reset, and is also looking into what caused the Ascendant Blessing bug. Thankfully (as Im obsessive about my inventory space) I was never impacted by either of these issues. Since the world's first Raid completion there have been a few in-game changes to the Dreaming City, which is an interesting new approach for Bungie. Now a cutscene will play the first time you return, adding context and lore involving the Guardians who defeated the raid. Its an incredibly smart way to reward the efforts of those playing: an in-game effect everyone will see. Becoming Legend seems to be actually plausible now. The raid completion also unlocked a new Strike that offers more lore and backstory as to why this might not be the victory wed hoped for. One of the best ways Bungie has improved the Destiny 2 experience is by respecting your time. Its a great example of how the excellent storytelling and gameplay extends to the new Strike missions. In the Warden of Nothing, you visit a new area of the prison where Cayde died. Rebellious inmates need to be put in check, and that sends you through an impressive sequence in which you have to dodge a train system while enemies lay in wait. But as you dive deeper in youll also be greeted with moments of nostalgia designed to catch the attention of a longtime player of Destiny. Then, in the Hollowed Lair Strike, you face off against a boss that has some interesting mechanics, such as a beam that pulls you in and requires fast reactions to disable. Its a good way to teach you that not all bosses are simply bullet sponges waiting to die  some can actually put up a fight. The boss youre pursuing also challenges the idea of murdering his comrades and I liked that it questions our revenge motivations. Potentially the best addition for Forsaken is an entirely new enemy type known as the Scorn. No more re-skins here, for once. The Scorn werent initially that exciting to me because, at first glance, Id assumed theyd behave like a variation on the Fallen, but thats not the case. Each character type reacts in a new way and visually its quite clear that the new models got some tender loving care. For example, you can shoot the weapon the flaming Ravagers wield, causing a large explosion of fire that engulfs them and anyone nearby. The main story wraps with an unsettling conclusion after about five or six hours, but then theres more to see in The Dreaming City once unlocked that will give longtime players a peek into some interesting backstory elements. Here you have access to new secrets, Petra Venjs unique bounties that encourage exploration of the tricky secrets as well as the toughest activities, and the wave-based challenge of the Blind Well. Thanks to the gaudy towers spewing out from rocky terrain covered in fog the location emits a feeling of mysticism from every corner. Once inside, the impressively modeled interiors clearly convey the feeling that a deity resides within, and while youll have to discover its secrets for yourself I will say its a big step up from the original four planets. The Dreaming City also surprised my by addressing one of my long-time gripes with the patrol system. The subtle change has actual NPCs in the world deliver the mini-quests to you, and I was delighted to see that Bungie thought of this small, but important gameplay system. The main draw of The Dreaming City is the Blind Well, which feels very similar to Escalation Protocol or Destiny 1s Court of Oryx and Archons Forge. I love hopping in with friends to take on the waves of enemies that flow in from all corners and require you to stay on your toes. A lot of loot drops and its a great way to farm for items you may desire, but dont expect a Power Level jump for completion. There are a few distinctive mechanics, such as a Harmony buff that will allow you to drop the shields of certain enemies, but thats about it. All of these wave-based modes have been fun, but in order to get the full group participating it still requires some odd networking trickery I had hoped Bungie wouldve addressed for Forsakens launch. Once youre in and firing away there are a few rewards youll get that make it worthwhile, but for the most part the loot pool is a somewhat sparse payoff to whats otherwise an enjoyable run. All of these additions are complemented by a complete rework of the sandbox, with refinements that bring back what my crew and I loved about the first Destiny but found sorely lacking in Destiny 2 until now. Bungie has taken its old playground full of confusing mods, armor with boring perks, and bland PVP and revamped all of it to make everything more interesting. If you want to wield any crazy loadout, like three shotguns, you can do that now, which adds more flavor to the mix instead of mandating more practical options. Armor and weapons of the same type will have unique aspects that encourage you to keep different sets until you get that perfect drop. This makes Destiny 2 feel mysterious again, and each drop is exciting right now as it could be that perfect roll, or bring you one light level closer to the max. Theyve also added a new weapon type: the bow. Nocking an arrow and lining up a headshot with the No Turning Back bow will result in an explosive pop as the explosive tip finishes off an enemy in spectacular fashion. The weapon play here just feels right and theyve done a great job at capturing what makes archery so fun while adding a bit of that Bungie weapon flair we all love. The Crucible benefits the most from the sandbox changes. Not only has Bungie addressed the time-to-kill issue so many fans have been asking for adjustments to, but with the weapon and armor changes your rewards are better than ever and could directly impact your PVP performance. This will give you new things to strive toward should a particular weapon shine, or encourage you to figure out new counters which could prompt even more time in-game to earn said weaponry. Team up with a small group and youll fare much better with coordinated attacks, but its also rewarding to go solo into something like Rumble, where its a free-for-all. There are a few overpowered pieces of armor, like Ursa Furiosa, which Ive seen allow up to four supers back to back. This is because it restores super energy when stopping damage. Thankfully, Bungie has a good track record of addressing imbalances like that quickly, and even if it doesnt, once players learn not to shoot defending Titans it could become a non-issue. Gambit mode is another new addition and it truly is superb. Facing off in a mix of PVP and PVE challenges is exhilarating, and planning the appropriate strategy with my team gives me a great feeling of camaraderie and accomplishment. The goal is to kill enemies, grab the motes that drop, and throw them into a bank as fast as you can to spawn enemies and mess with the progress of your opponents. Deposit enough motes and an extremely powerful Primeval will spawn which your team needs to fill full of bullets before the opposition does. During this entire ordeal the opposing side will be able to invade and try to murder you. When successful, this will make the tricky Primeval regain its health. Gambit is unlike anything Ive seen before and Bungie has again created one of the best experiences out there. While I usually focus on the power level grind I found myself enraptured in the experience of stopping invaders with my teammates, and melting final bosses with our carefully planned strategy that we implemented for an amazing streak of wins. It was extra rewarding because when you stay in any game mode youre also rewarded with power gains, armor drops, and new gear just for playing what you love the most. I believe that one of the best ways Bungie has improved the Destiny 2 experience is by respecting your time. With Forsaken, you can do whatever you enjoy the most to level up, and it all of it feels like its in a great place right now thanks to all the system changes. Also, the collection system allows you to see what you still need to acquire to complete a set of armor or weapons and it can all be grabbed from your inventory for some resources if its from before Forsaken. Hopefully, Bungie will extend this to all of the new armor and weapons once it figures out what to do with random roll items. Infusion is a controversial topic at the moment because gathering resources requires you to return to old destinations, but I actually think Bungie has been really smart about constantly rewarding you with the items you need for completing bounties, picking the resource up in the wild, doing public events, or any task at all. The masterwork core shortage is going to present a difficult choice for some, however. Youll need to carefully decide which weapons youre going to power up as this rare resource will make you take pause before blindly leveling all your gear. I prefer having tough decisions to make about what comes up with my power-level climb. The collection system and some quests that require full armor sets meet another need for Destiny 2: exciting moments from getting loot. When I finally grabbed the last piece of gear for the Gambit set or Vanguard armor I was ecstatic. Not only had I completed a set, but I eagerly jumped into the next mission to give my reward a test run. That Triumph tab has also finally brought lore into Destiny 2 with compelling stories you can read at your leisure as you discover scannable items or dead ghosts in the wild. Bungie has even implemented a system called Bungie Rewards to give anybody who completes enough in-game challenges some real-world rewards. This incentive system links to the Bungie store, where you can now sign up for the chance at items for completing in-game challenges. For example, if you complete the Forsaken campaign before the end of September youll get a copy of the soundtrack for free. There are also a ton of future rewards teased with Coming Soon text and a description of new challenges. For example, acquiring the Ace of Spades weapon will be next, but the reward is obscured for now. Its amazing to see that Forsaken delivers a memorable story for casual fans and the depth the hardcore players like myself have been longing for. The entire Destiny experience in a great place for all right now. Stay tuned to IGN for more on Destiny 2 or check out our weekly show Fireteam Chat dedicated to all things Destiny. With Destiny 2: Forsaken, I keep coming back to the old aphorism,~A rising tide lifts all boats.~ This update not only has improved Destiny 2 for those buying the expansion, but also for all players, regardless of the version they own. Playing on an account without Forsaken I was able to acquire gear from the new expansion, and the new daily and weekly challenges were also available on the account meaning the incentivisation loop that keeps you playing is there for all players. Thus far, Bungie has delivered on all fronts and even admitted its mistakes with the launch and first year of Destiny 2. Now its not only brought back what made me love the first Destiny when it was at its best, but also added a ton of requests that fans  myself included  have wanted for years.", "date": "Sept. 19, 2018"}