{"name": "Injustice 2", "name_review": "Injustice 2 Review", "ref": "https://me.ign.com/en/injustice-2/132798/review/injustice-2-review", "text": "Like its cast of heroes, Injustice 2 is exceptional. The fight mechanics have been guided in the right direction following 2013s Injustice: Gods Among Us. The hours of play potential in the new Multiverse mode alone is impressive. The heroes and villains of the DC Universe look better here than they have in any game before, even as they star in a grim and joyless what-if storyline. Just like its heroes, though, Injustice 2 overcomes that adversity and soars, with more single-player content than Ive ever seen in a fighting game at launch and an unrivaled combo system that is a sheer joy once you master it. Injustice 2 strikes a fine balance between retaining the strengths of Gods Among Us and making smart changes to improve mechanics. On top of new versions of memorable environmental attacks in which you slam enemies with everything from cars to giant stuffed alligators on the detailed stages, flashy transitions between different areas of the battle locations, and a full arsenal of over-the-top Super Moves including everything from mowing over your enemies with the Batmobile to traveling through time to slam your opponent off the hide of a dinosaur, it makes several big changes. Some of my favorites include the ability to spend meter in order to gain invulnerable movement to escape projectile-happy enemies, allowing you to block some environmental attacks, and a global increase in the speed sharpen the action. Faster walking speed makes matches feel quick and agile, a change from the at times plodding pace of Gods Among Us. New defensive options make fighting ranged specialists like Deadshot or Green Arrow less frustrating than the sometimes oppressive and seemingly endless barrages in we saw in the last game. Plus, the new additions to the cast ably fill a range of niches, such as Dr. Fate and Deadshot and their strong zone control, Black Canary and her quick and technical offense, or Atrocitus and Gorilla Grodds more methodical, heavy-hitting styles. Injustice 2's combo options are rivaled by few other games. One of the most impressive mechanical aspects is Injustice 2s combo options, which are rivaled by few other games. For someone like me who enjoys spending time just beating up the training dummy and seeing what sort of insane juggles I can put together, its supremely enjoyable. You can bounce opponents off walls or the floor and launch them high into the air for juggle combos. Spending meter may alter the traits of a special move and open up new uses for combos: for example, Jokers BANG! normally sees him pull out a revolver and fire a shot at his target. However, when used with Meter Burn, the revolver bullet launches his foe into the air, allowing Joker to juggle his victim. Each character has multiple ways to extend combos that are unique to them, and you can add onto that further by factoring in environmental attacks and positioning on the stage. There is an incredible amount of content here for people that love fighting games but perhaps dont enjoy competing against other people, or even for those that do like to mix it up with others but also enjoy chasing that next milestone or piece of loot. Hour for hour, Injustice 2 may have more content for solo players than any fighting game ever released. Most of it is excellent, except for the centerpiece: the story campaign. I found little to love about the way the heroes are presented. I wasnt a fan of the dark take on DCs heroes in Injustice: Gods Among Us, which is a what if story about Superman going off the deep end after a tragic loss. So even though Injustice 2s character animations in cutscenes and in-game are outstanding and border on photorealism for certain characters, I found little to love about the way theyre presented here. Even beloved symbols of light and hope advocate killing their enemies, arguing that the harrowing events around them are the result of having not permanently dispatched their villains in the past. Batman seems to be the lone voice of reason until you consider he is chastising Superman and Wonder Woman for their actions while allying himself with someone like Harley Quinn. Injustice 2 does attempt to break up the dreary proceedings with the genuinely amusing Green Arrow and always likable Flash, the latter personifying the struggle between Batman and Superman and the things for which they stand. At the same time, it features a Joker that has to go down in history as one of the most tone deaf and misguided takes on the Clown Prince of Crime. Gone are the charm and black humor of the utterly mad wisecracking clown with the literally infectious laugh and flamboyant wardrobe, replaced by a Hot Topic psychopath growling generic threats and waving a knife around. Like the recent DC films, Injustice 2 confuses bleakness for gravity, and it stands in stark contrast to the whimsy, humor, and colorful settings increasingly favored by media rival Marvel Comics and in games like Marvels own upcoming fighter, Marvel vs. Capcom Infinite. You're expected to learn 28 characters on the fly. As you explore the conflict between Batman and Superman and the greater threat looming behind their war, you take control of nearly every playable character. This imparts a feeling of epic scale, giving you a glimpse into a global threat through the eyes of every central player in that saga, but in doing so Injustice creates a situation where youre expected to learn 28 characters on the fly. The transitions from hero to hero can be frustrating, as you suddenly find yourself playing as a character you dont know against a fairly proficient AI. There are no universal combos or combo mechanics in Injustice, so even a simple two or three-hit combo for Green Lantern may not exist at all for Batman. Every hero is unique, even down to basic attacks. Some have complicated inputs and cancels that arent immediately clear, like Robin or Bane. While this storytelling style helps to convey the massive scope of the DC Universe by allowing you to witness events under the ocean, on Krypton, or deep under Gotham taking place simultaneously, it affects the pacing of the story and makes it feel frustrating and uneven relative to something like Street Fighter or BlazBlue where you explore the universe around the characters via their individual stories. Multiverse mode is fighting games' answer to Destiny. Even though I didnt care much for this particular DC story, I found a lot to love with the Multiverse. Multiverse mode is fighting games answer to Destiny, giving you the opportunity to level up your fighters, earn and equip gear for them, and use those power gains to take on increasing challenges that change every day. Common and rare gear pieces might simply augment one of four character statistics: strength, defense, health, or ability. However, rarer pieces and legendary gear sets can do everything from changing the color and size of projectiles to allowing your hero to start a match with a stock of meter. This imparts strategic depth to choosing just which pieces of gear to pair with your character and allows you to augment your abilities to something customized for your personal play style. Though Injustice 2 evens out the base statistics of all characters when playing competitively online, you can always choose to fight your friends drawing upon the full strength of your gear or to ignore those bonuses to level the playing field. Either way, the cosmetic changes remain. I was pleased to see that the rarer equipment changed my characters appearances, allowing you to tailor a unique look for your fighter. Changes can be as minor as the style of a breastplate, adding glowing eyes to Batmans cowl, or giving Scarecrow a hood  or they can be something as major as changing the logo across Supermans chest. Between the different shaders you can unlock and options for arms, leggings, chest plates and shirts, helmets and headpieces, and new weapons, there are a surprising amount of options for those of us that enjoy dressing for success. Injustice 2 also allows you to try your luck for rare equipment by earning loot crates by completing objectives, such as scoring well in Multiverse missions, completing the character-specific tutorials, or completing chapters in Story mode, giving you even more reason to check the Multiverse daily. Fair warning: between Multiverse mode, five to 10 hours of Story mode (depending on your skill), and the deep offensive trees unique to each character, the sheer depth of content present might get intimidating for a newcomer once they begin to fully grasp what theyre getting themselves into. Though there are both general and character-specific tutorials, these walkthroughs only scratch the surface of the juggernaut beneath, especially in the case of the latter. Character training gives a brief overview and the bare basics for each face on the roster, but the gap between those introductory fundamentals and the 20-hit, 600-damage combos is wide, and Injustice 2 does little to guide beginners across it. Compared to Street Fighter Vs Mission modes, which teach you useful bread-and-butter combos of increasing difficulty, Injustice 2s character tutorials impart only the bare minimum to get you started. Those that feel comfortable in executing complex inputs or training muscle memory can jump right in and have a blast, but if youre new to fighting games you should know that pushing your success beyond the beginning stages will take some practice and time. In our testing on live servers the online multiplayer was as solid as a Kryptonian, with minimal frame delay and no freezing or lag stutters. Network connection strength between players is rated at one to four bars, and even at two bars, I was able to find playable matches. With more and more opponents taking the fight online, I noticed no initial stress to multiplayer servers and was still able to easily find ranked opponents to pummel. And, while online play can never reproduce the completely lag-free experience of facing a friend sitting next to you, Injustice 2 helpfully includes delay simulation in its training mode options. That allows you to replicate the slight amount of input delay youd get playing a match online to help you hone your online combo execution to practice and adapt to that specific timing. Injustice 2s fights improve on Gods Among Us in nearly every way, specifically addressing fan concerns about movement speed and giving you new ways to burn meter. Visually, the DC roll call shines even as they star in a flat and unnecessarily grim story. The unrivaled amount of single-player content to explore, especially the highlight Multiverse mode, and the height of Injustice 2s skill ceiling make it an easy environment in which to lose hours of your day without ever even challenging another human or giant telekinetic gorilla, as it were.", "date": "May 17, 2017,"}