{"name": "Madden NFL 19", "name_review": "Madden NFL 19 Review", "ref": "https://me.ign.com/en/madden-nfl-19/151494/review/madden-nfl-19-review", "text": "Madden NFL 19 keeps its focus where it belongs: its moment-to-moment gameplay. This years entry comes with the promise of improved player motion, a more intimate franchise experience, and the return of two hometown heroes as the Longshot story continues with a new chapter. But does Madden 19 have the balance needed to stay between the uprights and keep both newcomers and long-time Madden fans happy? In short: Yes, yes it does. A Beautiful Game In a surprisingly - yet welcomed - straight-forward call, Real Player Motion is touted as the marquee gameplay enhancement and allows more control in game-changing situations. In year two of the series move to the Frostbite engine, its apparent the development team is learning how to maximize the technology. Both sides of the ball have gotten a noticeable bump from last year.You can see that growth on display in the excellent fluidity your players bring to the field. Basic moves like spins, jukes, and the ability to adjust your speed and hit the gap all look fantastic. Its a noticeable improvement that you will see across speed changes, cuts, and tackling with crushing blows when you hit the Truck Stick. The feel of the game continues to improve, especially with Madden 19s enhanced controls. Youll see your stick talent translate on screen in fluid motions thatll have you pumping your first in the air while you beat down your friends. And its not just what you see while playing on offense juking and spinning your way to a touchdown. On both sides of the ball, player interactions have gotten a noticeable bump from last year. Its the way a defensive lineman can break off a tackle to crush the halfback in the backfield. The way safeties can track down the ball and pick it off before momentum carries them out of bounds. And the way play action breaks down as the edge blitz catches you off guard, nearly causing you to jump in fear. EA has done a great job capturing the speed, momentum, and impact of football in Madden 19. The power of the engine combined with the PS4 Pro (and likely Xbox One X) is a sight to see. Maddens visuals and that player movement look better than the series has ever known. The graphical push in this years offering is amazing, and player models (for those that are in the game) look more realistic than ever in both the menus and on the field. In short, not only does Madden 19 feel great to play, its great to to look at, too. Live Your Best Franchise EA has finally added customization options to Madden 19, allowing the Madden community to create their own draft classes. This sorely missed mechanic adds a new layer of realism to the season-long experience. After you advance to week 3 of your season, these draft classes can be saved and shared with the community, encouraging all fans to download realistic classes with some of college footballs most notable athletes. You can even edit players after the draft class has been uploaded. EA has finally added Franchise customization options to Madden 19.This new feature let me feel more connected to my team  a point I sincerely appreciate considering how much time I spend with it on and off the field. And with 450 roster spots in each draft class, you can be sure roster projects will start spreading across online forums in search of the perfect draft class that will become a go to addition for every Franchise mode player. Additionally, Franchise mode has also introduced offensive and defensive schemes this time around. And while diehard football fans may not see the benefit in this, casual players may appreciate the assistance as schemes help highlight the best players in trades, free agency, and the draft for you particular scheme. A simple change from one scheme to another can drastically alter your teams play. In my Titans franchise, I swapped from a Tamp 2 (42% scheme fit) to a 46 (92%) without needing to alter my roster. Specialty positions such as slot cornerback and slot wide receiver are now included in your teams depth chart too, giving you more options for fine tuning. Free Agency and the Draft seem largely untouched this year. The Madden series has yet to find a perfect process for keeping free agency engaging, but its draft process is in a great comfort zone which will only get better as the draft class creation starts ramping up. An Untouched Gem Madden Ultimate Team continues its formula of collecting cards and fielding a roster to compete against opponents online. The biggest new addition in Madden 19 are the solo challenge tournaments that offer up new opportunities to play  this time against teams created by Madden developers, NFL athletes, and celebrities  creating another strong vein of content in the mode. And with a leaderboard system built in, theres a great opportunity to dabble in an esports-adjacent environment. A new wrinkle in Ultimate Team this year requires you to upgrade players to fit your teams mold, and the more you play the more you can upgrade. The downside is that this will likely become the new grind of the Madden franchise, however its mitigated by the fact you can downgrade those same players to refund resources youve invested if you want to go another way. It is cool how you can grow your best player rated in the late 60s up to a potential 90. For those of you who have trouble throwing anything away, this may be the best fit for you. In complete transparency, Im not a frequent visitor to Ultimate Team, but its a mode that rises and falls with gameplay. These new ways to play Maddens most popular mode will most definitely be a hit to fans of the collectible mode. Devin and Colt Return In Madden 19 EA has doubled down on one the best features of Madden 18  The Longshot Story mode. Its a direct sequel to the storyline from last year, this time dubbed Longshot: Homecoming, which follows the struggles of Devin Wade and Colt Cruise as they navigate the NFL and their personal lives. This second slice of the Devin and Colt show feels forced.Devin continues to battle his play-calling woes, showing nice continuity from last seasons story, as Colt endeavors to land a tryout or his next hit song. The mode does put a larger focus on including gameplay this time, but it simply feels like an excuse to run a drill that youre required to pass to proceed. It becomes more of an annoyance than anything to Try Again.~ Unfortunately, this second slice of the Devin and Colt show feels forced and clich. It left me feeling like the opportunity to build something special was wasted. Despite its brisk three-hour runtime, its still a few hours I wish I could get back. Madden 19 returns the primary focus where it belongs: that moment-to-moment gameplay between the end zones. Its only true stumbling point is the lackluster story mode that fails to recapture the magic of the first, but that's entirely offset by the new player handling that once again leverages the power of the Frostbite engine. Most importantly, Madden 19 has finally cracked that slightly repetitive feel that can make it tough to go on, game after game. With Real Player Motion delivering a fluid on-the-field experience, and Franchise mode customization offering another level of realism, Madden is in a great place.", "date": "Aug. 2, 2018,"}