{"name": "Salt and Sanctuary", "name_review": "Salt and Sanctuary Review", "ref": "https://me.ign.com/en/salt-and-sanctuary/119532/review/salt-and-sanctuary-review", "text": "Editors Note: Salt and Sanctuary originally released in 2016 for PS4, Vita, and PC. With the release of the Switch version, we decided to dive back into the sanctuary and update our review for Nintendo's hybrid console. Forget about mages and warriorsin an RPG with a name like Salt and Sanctuary, I figured it was only appropriate to save the world as a chef. It's one of the eight starting classes, after all, and thus, clad in apron and armed with a three-foot iron pot and a handful of potatoes, I left the sanctuary of my galley to slay the pirates stealing our princess from our ship and murdering my crewmen. Larry never brained Curly with such vigor. Gordon Ramsay never unleashed such spite. At last I made it to the deck, where I faced off with what looked like Cthulhu himself. I tossed a potato at him. He killed me in two hits. At last, I awoke on a far shore. Sound a little like Dark Souls? It's no accident. Salt and Sanctuary pulls liberally from From Software's series for this 2D adventure. In less capable hands, it might have devolved into parody, but instead Salt and Sanctuary establishes itself as a lovingly crafted reimagining that usually succeeds in capturing the spirit of From Software's adventures in a format that initially seems incompatible with it. It's not without its own identity, even if that, too, rides on the shoulders of other giants. It establishes much of it with a rough-brushed art style, which greatly resembles that used by developer Ska Studios' own Dishwasher series. Inspired by comic strips and angry marginal doodles in high school notebooks, the aesthetic allows for spectacles of blood splatters and gore that might otherwise be disturbing if paired with a style more inclined toward realism. The color palette may be wider than what we find in The Dishwasher, but its nevertheless dull and earthy, thus punctuating the idea of the menace of its world even if the circly heads and strangely drawn beards do not. Beyond that, Salt and Sanctuary brilliantly recalls the earliest Castlevanias, right down to the zigzaggy side-on stairs and the bats who swoop down and try to knock my Chef Belmont down into the abyss. If I were to choose an old-school sidescroller to base this kind of experiment on, I could think of no better source. The Apprentice or The Master? But otherwise this is very much Dark Souls in 2D form. It's what Terraria is to Minecraft and with similar success. Name almost any feature common to Hidetaka Miyazaki's punishing games, and it almost certainly asserts itself here in some form or another. There are, for instance, the souls themselves, which drop from enemies and serve as currency for leveling and weapon and armor upgrades. The difference? They're called salt here, and in a nod to Bloodborne, you have to kill the enemy who killed you to get them back if you lose them. Here, too, is the minimalist story, imparted only by sparse NPCs who seem more interested in being cryptic than being helpful. Death, particularly on bosses, comes swift and easily. The mainand hugespot where the comparisons falls short is in the absence of PVP combat, although you can leave bottles for other players with messages composed from a limited set of words. (A little hilariously, ~Praise the Salt!~ is a common one.) It does, however, feature a workable couch co-op option that can make boss battles much breezier.Name almost any feature common to Hidetaka Miyazaki's punishing games, and it almost certainly asserts itself here in some form or another. Remarkably, this kinship extends to the combat as well. Though the action has shifted to profile view, the core abilities remain the same, although mapped a little differently by default when played with a gamepad. Light attacks and strong attacks, blocks and rolls, charged attacks and shifts to hold a one-handed weapon in two handsall share time in the spotlight here. The brawling itself is never quite as demanding as it is in the games that inspired it, but neither does it ever devolve into mindless hacking and slashing. I initially saw it all come together in the first boss fight, where a hulking chump called the Sodden Knight waits atop a rickety tower. When he charged, I'd roll past him. When he slammed lightning on the ground, I'd jump over it. The fight demonstrates Salt and Sanctuary's commitment to Mega Man-style memorization, but it also highlights the volatility of its approach. Just when I thought I'd learned his rhythm, he shook it up by attacking more swiftly and ferociously. He eventually fell to my iron pot of doom, but not before I'd had to adjust to Salt and Sanctuary's little idiosyncrasies, such as how attacks make my salty chef pause for a second in midair. I never really got used to it. That's a common theme. Whenever Salt and Sanctuary elects to let go of Miyazaki's hand, it runs the danger of losing its way. When the time finally came for me to put aside my pot and apron and become the greatsword-swinging warrior I suppose I was born to be, for instance, the transition wasn't quite as fluid as it might have been in Dark Souls on account of a sprawling skill tree in the style of Path of Exile and Final Fantasy 10. Its interconnected paths offer a great deal of choice as to whether I want to specialize in weapons like spears or axes, sure, but it's not quite the same thing as freedom. Even its massive, Castlevania-style labyrinth filled with castles, swamps, and inky black dungeons can get a little out of hand, as I eventually found myself struggling to find my way after unlocking multiple shortcuts and combing ever further into the depths. A Soul of its Own Salt and Sanctuary's stabs at originality do hit the mark in the titular sanctuaries, even if they, too, are essentially riffs on Dark Souls' bonfires. These are the places where you'll refill your flasks and regain health (and reset enemies, naturally), but they're also instanced hideouts where you can drop off totems that conjure NPCs like blacksmiths and the mercenary that serves as as the avatar for your couch co-op buddy. It's a smart system that captures Souls' emphasis on risk and reward, as you'll need to think about where to place these guys so you're not continually running to an inconvenient spot to find the artisan who can craft the sword you want.Whenever Salt and Sanctuary elects to let go of Miyazaki's hand, it runs the danger of losing its way. These specific sanctuaries are controlled by ~creeds~ with specific bonuses and craftable goodies, whichc'mon, you can probably guess at this pointstand in for the covenants of that other series. You can only be a member of one, though, so ~defiling~ one of your existing sanctuaries with another one's idol renders all of its adherents enemies. All of this isn't explained as well as it could be in-game, though, so it's worth it (but not essential) to partake in that grand Souls tradition of checking wikis for more information if you're embarking on a serious playthrough. Salt and Sanctuary clings so laughably much to the Dark Souls template that I joked to myself that this review probably would have been better off as a two-columned comparison checklist. But in truth, this ranks among my favorite games I've played in the last few months. Salt and Sanctuary's mimicry is born out of love, and it pulls it off with a flair that could come only from a team who drinks and breathes Dark Souls in their after hours. All in all, it's worth its salt. Switch Port Update Releasing back in 2016, Salt and Sanctuary helped set the standard for the Souls-like sub-genre of games that derive their core mechanics from From Softwares Souls series. The same holds true for the Switch version. While it is a straight port with no new features added, it makes the jump to Switch without any sacrifices; running at a smooth 60 FPS, with only slight and infrequent dips in certain spots. Salt and Sanctuary on Switch provides the same brutal, yet satisfying challenge that helped make it one of the best indie games released in 2016. One relatively minor complaint about the Switch port is the fact that the game is naturally very dark, with many enemies that blend in with the backgrounds. While playing in handheld mode with less than ideal lighting, enemies can often end up being harder to see than they were initially designed to be. Its a small price to pay though for the ability to play on the go, and Salt and Sanctuary on the Switch remains every bit as good as it is on other platforms. - Mitchell Saltzman Pros Huge, sprawling mapExcellent Souls homageGrim, attractive art styleFun combat Cons Poor explanation of some mechanics You could call Salt and Sanctuary a 2D mashup of Dark Souls and Castlevania, and you'd be right. But such a simple pronouncement would be a disservice to the tremendous amount of thought that's gone into Salt and Sanctuary, whether it's in the graphic style that evokes horror through the style of comic strips or in the intricate web of dungeons and castles serves as it map.", "date": "Aug. 1, 2018,"}