{"name": "No Man's Sky NEXT", "name_review": "No Man's Sky NEXT Review", "ref": "https://me.ign.com/en/no-mans-sky-next/151236/review/no-mans-sky-next-review", "text": "With its latest update, called Next, No Mans Sky has rounded off enough of its rough edges and piled in enough content that exploring its weird galaxy is usually rewarding. Its definitely a treadmill, though, and while there are countless upgrades and ships to acquire, bases to build, and resources to mine, the process of earning them involves hours upon hours of mindless and repetitive work. Hopping in a spaceship, flying out of the atmosphere into space, then landing on another planet that looks completely different from the one you just left is as amazing as ever  a feat that still hasnt been matched. Some worlds are scenic and beautiful, begging you to use the camera mode to capture the views of rolling hills with colorful plants and animals dotting the landscape and a ringed planet hanging over the horizon and peeking out between clouds; others are barren and ugly wastelands; and others are just bizarre. There really is an impressive range of sights. The new option to play in third-person perspective is more than welcome because the nicely animated and customizable character models (which can be of any of the available species) really seem to be having a great time bouncing around with their jetpacks. It makes No Mans Sky much more fun to see someone moving around and interacting with these sparsely populated (by intelligent life, anyway) landscapes. Characters seem to be having a great time bouncing around with their jetpacks.But even though each world looks different, theyre all still functionally identical. The same environmental shielding bar that decreases when its blazingly hot also decreases when its absurdly cold or toxic  faster when a visually impressive storm hits  and you always fill it back up by injecting it with with the same cure-all resource. While animal life is hugely varied  sometimes hilariously so, with bouncing blobs, giant rabbit-crabs, flying sharks, and full-on dinosaur-like beasts roaming everywhere  but they have few unique behaviors to distinguish one from the next when you want to do more than look at them. Most resources are mined in the same handful of ways, everywhere in the universe. You either hoover them up with one type of laser beam, drill them until they explode with another type, or walk up to them and pick them up. (Or you can shoot rocks in space.) After the first few hours, there arent many new tricks up No Mans Skys sleeve when it comes to the moment-to-moment gameplay. And that remains the biggest problem with No Mans Sky: You spend the majority of your time monotonously gathering and refining the materials you need to do everything else, from simply surviving to repairing and upgrading your ship. Thats fairly typical of survival/crafting games, but No Mans Sky denies you the ability to automate any of the basic resource generation until many hours in. Resource gathering becomes even more of a hassle when you run afoul of the annoyingly touchy Sentinel robo-cops, who are offended by your doing anything more than looking at their precious rocks in their presence, or occasionally get attacked by pirates. Combat is simplistic and weak both on the ground and in space, with a small selection of weaponry to work with and uninteresting AI to shoot at. Dull fights and relentless pursuits (its impossible to jump away or evade ships in space without landing on a space station, and killing one just brings more after you) make all the combat-based missions you can run a drag. Upgrades come at a pace that's just rewarding enough to keep me chasing the next one.What No Mans Sky does have is lots and lots of things to pour your hard-earned resources and money into for upgrades, which come at a pace thats just rewarding enough to keep me chasing the next one. Most enhancements, like a gauntlet that allows you to harvest poisonous plants or a shotgun-like attachment for your gun, require you to go on scavenger hunts for specific materials, and that gives meaning to the endless searching. The new base system that lets you build simple structures anywhere seems conceptually at odds with the nomadic nature of No Mans Sky, but if you do decide to put down stakes on a favorite planet you can build handy teleporters can warp you back there whenever you want. You can even build up a mobile base in the form of a massive freighter that follows you around and carries huge quantities of resources, providing some relief from the strict (but more generous than before) inventory limits. It, too, is hungry for upgrades, and you can even build up an entire fleet of escort frigates with their own specific stats that can be sent on off-screen timed missions to collect resources for you  one of the few bits of automation were allowed. Joining a multiplayer game makes this universe feel a lot less lonely by letting you team up with up to three other players to explore and run missions together. Its fun to goof around by building together or digging holes and sealing each other into them. But eventually youre all going to need to pause to collect more materials to fuel your antics, and it turns out that lasering rocks together isnt any more entertaining than doing it by yourself. (And how is there no cool effect for crossing the streams?) That slowed down the pace of my fun and made me feel like I had to save up in single-player before joining a multiplayer game. No Man's Sky becomes dramatically buggier when there are other people involved.But there are a few reasons to be careful about diving head-first into multiplayer: for one, you lose the ability to pause your game, but thats kind of a given. More specific to No Mans Sky, it becomes dramatically buggier when there are other people involved. While my single-player bugs were limited to problems with mission scripting sometimes not working correctly, in multiplayer I constantly had issues with the indicator markers for other players being in the wrong spots, hearing the audio of a distant player as though they were right next to me, crashes, and, most disturbingly, falling through the floor of a freighter into space where I immediately died from exposure to solar radiation. The kicker, in that case, was that I wasnt able to retrieve my corpse, which contained my entire inventory. Id highly recommend creating a manual save (which you can do by building a save point) before you jump into multiplayer. Also, be aware that performance isnt great on any platform. Theres hitching and major pop-in on the PS4 Pro and Xbox One X, especially when landing on a new planet. And on PC, while planetary landings are smoother I couldnt get a reasonably steady 60 frames per second on any resolution higher than 1080p even with a GTX 1080 and a Core i7-7700. No Mans Sky doesnt look good enough to justify that kind of sluggishness. Flying from planet to planet in search of the universes rarest materials and technologies in No Mans Sky NEXT scratches an exploratory itch. It still carries a lot of caveats: Its mechanically repetitive no matter what planet youre on, the dull combat should be avoided whenever possible, and bugs are plentiful. But buying new ships and building new things is enough motivation to make it entrancing  for a while, at least.", "date": "July 28, 2018,"}