{"name": "NBA Playgrounds", "name_review": "NBA Playgrounds Review", "ref": "https://me.ign.com/en/nba-playgrounds/132595/review/nba-playgrounds-review", "text": "NBA Playgrounds takes a decent shot at revitalizing the once-great genre of arcade basketball games. It comes close to pulling it off, too, and even as it handed me some unfair-feeling defeats its retro style and simple gameplay reminded me why I still love this style of 2v2 basketball. What stands out from the start in NBA Playgrounds are the aesthetics. From Oscar Robertsons sideburns to Magic Johnsons short shorts, the developers at Saber Interactive appreciate the past and present style of the NBA. They also went out of their way to add signature animations to certain players, so Shaquille ONeal has his thunderous two-handed jam and Allen Iverson has a unique crossover thats immediately recognizable. There was love and attention paid to the hundreds of dunk and pass animations in Playgrounds, and these visual payoffs are what give it a standout quality. In a similar way, Playgrounds is pretty clearly trying to pay homage to old arcade classics like NBA Jam and NBA Street. What Playgrounds gets right about that is that its easy to pick up a controller and quickly feel at home. In no time I was drilling three-pointers and spinning into the lane for massive hammers. Its artistic style and tight controls are good at creating highlight reel-worthy moments, letting you meet someone at the summit to block a would-be ridiculous dunk or hit a late, long shot to seal the game. Its pace of play is slower than something like NBA Jam, but it works for Playgrounds. Its not so much about darting up and down the court to get power-ups, but rather about timing a crossover to coincide with when your opponent reaches for a steal or throwing a timely elbow to clear some space before going up for a three-point shot. This pace and timing is something I only started to truly get a feel for after multiple hours of play time, adding some level of depth. Some things felt unfair or difficult to read. But in that same way, the more I got into Playgrounds, the more I noticed some things that felt unfair or difficult to read. For example, you build up a meter by doing things like throwing alley-oops and blocking shots to get a random power-up, like in Mario Kart. The problem is some power-ups are much better than others, and the system can come off feeling unbalanced when your opponent gets the equivalent of the blue shell and makes a shot worth 12 points. It feels bad to lose completely randomly like that. The timing-based shooting mechanic is another element that does not quite fit this style of game. The intent is to add an element of skill that separates experienced players from the inexperienced by rewarding a perfect release with an extra point, but the animations just arent consistent or readable enough. Theres no way to really know if shot timing is tied to each shot or alley-oop animation, or if its the same across all of them, so even after playing for many hours I am no closer to deciphering the perfect timing that the AI can execute reliably. This lack of explanation also caused confusion when it came to the shoving mechanic. Its never explained that shoving will deplete the meter youre trying to build up, and so it took me a bit before I figured out why I was never filling my meter enough to get a power-up. Once I knew how these two things relate to each other, I never used shoves unless I already had an empty meter because the payoff wasnt worth the downside. Instead, it just seemed more logical to mostly use the steal button, which is strong enough on its own. Importantly, there are no microtransactions. These hiccups are frustrating because the core of Playgrounds is solid. It takes a page out of NBA 2Ks myTeam or EA Sports various Ultimate Team modes by having you start off by opening three packs of cards to unlock your initial players, and earning more packs immediately becomes the main draw here beyond the gameplay. Importantly, there are no microtransactions  you simply get new packs each time you level up by playing the various modes. I love opening a pack of cards to hopefully find one of my favorite players like Allen Iverson, or Steph Curry, or Alonzo Mourning. The roster has impressive depth, with each team having three to eight current and former players available. Saber Interactive has promised that more players will find their way into the mix post-launch. For example, Giannis Antetokounmpo is not currently available, but if I were a betting man Id say hes likely to appear later. Speaking of post-release content, one other update that will be a welcomed addition is four-player online play. Currently, its limited to two players online, with each controlling a team with an AI partner, and as of now the teammate AI is functional but not ideal. For example, sometimes when I tell my teammate to go up for an alley-oop hes very delayed or never does it at all, which leads me to idly dribbling around or trying to score a different way before I lose the ball. Those little miscues can be the difference between a win and loss, and so the high-level competitive aspect of this game online will rely on four players being able to control all the action. The players you use will also level up as you play more games with them, giving them new animations in the process. Unfortunately, Playgrounds does not make it clear what types of animations are being unlocked, so I didnt really care much about getting my players from the bronze to gold level. This is a missed opportunity to me because there are a ton of awesome dunks and a healthy variety of dribbling animations, but without telling me what Im getting, I dont know what to look for game to game. Tournament mode, exhibition, and online play are the three modes available, and winning each of the six tournaments the first time rewards you with a new court, a golden pack of cards (which gives you a better chance of finding Epic and Legend players like Allen Iverson, Magic Johnson, and Shawn Kemp) and a new power-up. Tournament mode took me roughly four hours to complete, but it only took that long due to a couple of frustrating difficulty spikes. Going up against a dynamic duo like Shaquille ONeal and Allen Iverson required some trial and error to find the right combo, which felt jarring because Playgrounds didnt usually ramp up the difficulty match to match. Playgrounds is not a game I would want to keep playing for long if I were only going to play against the CPU, and so couch play and online is where Ive spent more of my time. However, its not very well built out at the moment  at launch youre limited to matchmaking only, so there is no way to play with friends online. (The Switch version has no online play at all right now, but Saber says it will be added in a post-release patch.) This, in conjunction with the lack of four-player online play, really hurts the online component for now. But Ive still had more fun online than off. NBA Playgrounds isnt as deep as NBA Street or as beautifully simple as NBA Jam, but the gameplay is still well paced and the controls are still tight. It mixes this gameplay with cartoonish qualities and a retro style that fits an arcade basketball game, and earning new packs of random players is always rewarding. That said, Ive taken some bad beats from the random power-ups system, and the online options are slimmer than Id like. But as long as Saber Interactive delivers on its post-release updates, Playgrounds will have enough going for it to keep me coming back for more.", "date": "May 10, 2017,"}