{"name": "Captain Toad: Treasure Tracker", "name_review": "Captain Toad: Treasure Tracker - Switch and 3DS Review", "ref": "https://me.ign.com/en/captain-toad-treasure-tracker/150418/review/captain-toad-treasure-tracker-switch-and-3ds-review", "text": "In 2013, Super Mario 3D Worlds Adventures of Captain Toad challenges impressed Shigeru Miyamoto so much that he requested a full game be made out of them. Captain Toad: Treasure Tracker was released for Wii U a year later, comprising 68 intricate levels based on the Japanese tradition of hakoniwa, or miniature gardening. Heres what we thought at the time: Captain Toad: Treasure Tracker is one of the smartest, most charming puzzle games of 2014. Id also call it one of the best platformers of the year, except these characters cant jump. It speaks volumes about Treasure Trackers wit and environment design that it completely strips us of the mobility powers that weve come to expect from a game set in the Super Mario universe and still provides lots of interesting puzzle options. Read the full Captain Toad: Treasure Tracker review. In 2018 on the Nintendo Switch and 3DS, Treasure Tracker remains a rare delight, nabbing iconography from across the core Super Mario series - characters, blocks and power-ups all function exactly as you expect them to - but recontextualising them under a single new ethos: What if Jumpman couldnt jump? Theres still nothing quite like it. The Switch and 3DS versions dont add much to the original, but they never really needed to. The Wii Us failure means there will be a swathe of players who didnt get a chance to play this the first time round, which makes this re-release as much an act of game preservation as it is an easy stop-gap between truly new first-party releases. Each of Treasure Trackers levels (not counting the bonus remix stages) is a miniature obstacle course with a Star to collect and hidden Gems to uncover, but the pleasure is in how many ways that single thread is spun into different shapes. Some levels are more like optical illusions, twisting in on themselves and asking the player to swing the camera around to find hidden doors or sneaky secrets. Others are more like Rubiks Cubes, needing to be physically shifted into new positions to let you get around. There are minecart dashes, timed chases, battle arenas. Ideas are introduced and thrown away at crazy pace. If you ever wanted to demonstrate why people talk about Nintendo designers in hushed tones, this might not be the absolute best example, but its certainly the most efficient. Changes from the Wii U original are minimal, on the whole. The levels themselves are only slightly altered: on Switch, there are no platforms that require you to blow into a microphone to move, while 3DS has had the number of enemies reduced in most stages, probably to account for the drop in movement accuracy when moving from analog stick to Circle Pad. A new two-player mode on Switch is welcome, but probably wont be of interest to many. With one player controlling the lead character, the other can use a Joy-Con to point at elements in the world and fire turnip projectiles at them - think Super Mario Galaxys Star Bit-firing second player. At best it feels a little redundant, and at worst it makes certain combat-focused levels completely pointless, as every threat can be cleared before the person controlling Captain Toad reaches it. It feels like the best solution for co-op play, however - having two entirely separate characters would require many of the existing levels to be redesigned, and that clearly isnt part of the brief here. Some of the originals little problems persist. Theres a little too much reliance on the touchscreen, which becomes annoying when your own fat hand blocks your view of a threat. Playing docked on Switch with motion controls should solve that problem, but a giant cursor hovers over the screen at all times, which is hardly the most elegant solution. These new versions have at least removed the maddening decision to map camera control to the Wii U GamePads shaky internal gyrosensor, meaning you dont have to stay stock-still to play anymore. But its Nintendos borderline magical work with its proprietary engine that makes this remaster shine. Like Mario Kart 8 before it, the Switch versions sharpened 1080p docked output reveals a game that genuinely ranks among the years prettiest, despite being almost 4 years old. Every level hides something gorgeous, whether thats the particle effects bursting from magically extending minarets in Double Cherry Spires, the gleaming, giant pinball table that makes up Razzle-Dazzle Slider, or Captain Toads shivering idle animation on any Boo Mansion level. 3DS is a different beast; it understandably looks worse than the original version on such dinky hardware, but it feels frankly miraculous that it works at all. In its more spectacular moments, this is among the best-looking games in the consoles history. Better, in a game entirely about space, angles and perception, the 3D effect isnt just impressive, but useful. Many of Treasure Trackers more fiddly puzzles feel a tad more readable on the less powerful platform, particularly with the New 3DS eye-tracking to keep the effect stable. But perhaps the most interesting effect of returning to Treasure Tracker is in realising how influential this little spin-off became within Nintendo. Another game loudly drew on the principles of hakoniwa after Treasure Tracker came out - Super Mario Odyssey. The scales might vary, but both present intricate, self-contained environments, where attention to detail is prized over sheer size. Both place the pleasure of curiosity above and beyond anything else, rewarding players for prodding at and messing with their gorgeous worlds. And both make those rewards for curiosity the only way to progress: Treasure Tracker with Super Gems and Odyssey with Power Moons. It quickly becomes clear that Nintendos best platformer of recent years is perhaps more in debt to Captain Toad than it is to 3D World. The lines never more clearly drawn than when Treasure Tracker drops 4 Odyssey-themed levels into the mix towards the end. Recreating Odysseys Kingdoms as Captain Toad-friendly challenges feels weirdly natural. Not only do they look the part, but they act it, too. If youve covered the length and breadth of New Donk City already, the miniaturised version of it isnt just smart, its familiar. Well, unless youre playing the levels on 3DS, where it feels astoundingly odd - its always amazing to see how flexible Nintendos game engine seems to be. My only complaints here are selfish ones - why cant there be more of these, and why did the original Super Mario 3D World bonus levels have to be cut to fit them in? Pros Gorgeous, colorfulSmart puzzlesSense of discovery Cons Cumbersome controlsUnintuitive menus Treasure Tracker still feels close to unique, and gains new life on both of Nintendos current systems. Switch is very much the better choice, but 3DS is by no means a bad option. Still smart, prettier than ever and, in retrospect, genuinely important as part of Nintendos modern history, Captain Toad: Treasure Tracker is a rare example of a game that actually feels better for being a few years old.", "date": "July 12, 2018,"}