{"name": "Red Faction Guerrilla Remastered", "name_review": "Red Faction: Guerrilla Re-Mars-tered Review", "ref": "https://me.ign.com/en/red-faction-guerrilla-remastered/150123/review/red-faction-guerrilla-re-mars-tered-review", "text": "When we first reviewed Red Faction: Guerrilla in 2009, we gave it an 8.0, for Great. Heres what we said about it back then: If all you care about is blasting things to pieces, you're going to love Red Faction: Guerrilla. Seeing a tower topple to the ground in a seemingly realistic fashion after smacking away its support beams with a sledgehammer is really a thrill, and though it may lose its appeal as you continue through the lengthy campaign, it's still worth checking out, particularly after you unlock some of the better weapons. What's more disappointing about Volition's effort is the rocky mission design, bland artistic style, weak plot and anemic character development, which shifts too much focus to the element of destruction to maintain a level of excitement. Its enjoyable gunplay mechanics, along with the weapons and opportunity for tearing apart structures, carry over into the online space, where Volition has built an impressive multiplayer suite that includes stat tracking, unlocks, and a number of game modes that focus on flattening buildings. While the game may not do everything right, it's your best bet for free-form demolition and unpretentious entertainment. - Charles Onyett Even almost a decade later, Red Faction: Guerrilla is still my gold standard for destructible environments in games. I dont know whether thats a testament to Volitions GeoMod engine or an indictment of modern games lack of devotion to freeform demolition, but either way, Red Faction: Guerrilla Re-Mars-tered still makes it insanely satisfying to level an enemy base with little more than a few demo charges and a big hammer. It's not likely to fool anyone into thinking it's brand-new. The updates to lighting, shadows, shaders, and post-processing effects combine with improved textures to make a convincing argument that this game didnt come out before Assassins Creed 2. Its not likely to fool anyone into thinking its brand-new, of course  the pre-rendered cinematics alone give away that its not up to modern standards, and certain textures, especially those on the Martian soil, are sub-par and repetitive. It does perform reasonably well, though: it runs at 60 frames per second in 1080p on standard consoles or in 4K Performance mode on the PS4 Pro and Xbox One X (technically, 1500p and 1800p, respectively), with frame rates only occasionally taking more than a slight dip during even the most destructive battles. We did, however, notice some considerable slowdown during big explosions playing in full 4K resolution. All of the upgrades in this new version are visual, though  aside from the bundled-in DLC from the original, theres no new content to be found anywhere in Re-Mars-tered for returning players. No new guns or explosives, vehicles, buildings, missions, challenges, or behind the scenes featurettes or commentaries. That means the originals problems remain intact, such as the vast swaths of Martain terrain that dont contain anything worth swinging a hammer at. While thats probably an accurate depiction of what a recently colonized planet might look like, it doesnt make for particularly interesting gameplay when you just want to get to the next clump of buildings you plan to destroy. Nothings been done to spruce up or expand the story, either, which is still about as exciting as trip to the DMV. Still, theres tons of fun to be had experimenting with physics, both in the open world and the separate challenge modes and PvP matches. Despite having a title that deserves a firm slap across the face for the marketing executive who thought it up, Red Faction: Guerrilla Re-Mars-tered is a great get for those who may have missed it the first time around, or anyone who might want to revisit (and re-destroy) the red planet. It may not add any new content to address the empty open world and bland story, but it does perform well, and everything I loved about Red Faction: Guerrilla is still front and center and looking better than ever.", "date": "July 4, 2018,"}