{"name": "Call of Duty: WWII -- United Front", "name_review": "Call of Duty: WW2 - United Front DLC Review", "ref": "https://me.ign.com/en/call-of-duty-wwii-united-front/149964/review/call-of-duty-ww2-united-front-dlc-review", "text": "All in all, Call of Duty: WW2s United Front DLC feels experimental and exciting in some ways, while safer and dull in others. The changes to the Zombies mode dramatically shake up the formula and make it a high point worth visiting, but otherwise, the mostly underwhelming new maps arent breaking any new ground. When I first played Call of Duty: WW2 at release, it felt like a bizarre omission to not visit Stalingrad as a multiplayer destination. Over the years I feel like Ive fought battles on that field countless times, because as the largest conflict to take place in all of WW2, its always been a staple for shooters based on the war. United Front finally brings it back, and its the best of the three new maps. Stalingrad is a classic arrangement: two bases at opposite ends of a war-torn city with plenty of carnage in between. Id have loved to see the map adapted to a larger-scale War mode mission, but it feels great to return there even still. It really doesnt offer anything we havent seen in these types of shooters before, but it fits like a glove. Seeing the snow flurries and dilapidated buildings rendered in gloriously high resolution with HDR on the PS4 Pro made a setting Id seen many times feel new again. For that reason, Stalingrad is easily one of my favorite maps in all of CoD: WW2. Stalingrad is easily one of my favorite maps in all of CoD: WW2.The other two new maps for multiplayer arent as memorable. First up is Market Garden, which takes place at a mansion in the Netherlands. Its a tight-quarters map with lots of walls and corners making it difficult to really take in and appreciate the more natural beauty on display. Visually, its quite impressive and that contrasts well with the violence and bloodshed. The center of the map is laid out well for Domination and other similar game modes, except that camping is extremely easy and rampant. Overall, Market Garden is just fine, but it feels a whole lot like what CoD: WW2 already has plenty of: smaller scale, close-quarters maps. Finally, the third new multiplayer map is Monte C W2DLC_VDR_062918 assino and its probably the worst of the bunch. The setting is a badly damaged Italian village beneath a monastery, and the semi-unique hook is the focus on verticality created by plenty of rooftops and cliff edges to flank along. The problem is that this style of map doesnt really lend itself well to the lack of mobility found in a WW2-era shooter. Something like this in Advanced Warfare or Black Ops 3 might fare better because you can easily scale and access high points in those games, but as it stands it just feels a little tedious. If youre not sniping from a rooftop or trying to sneak up on snipers and campers then youre just running around getting shot by someone you didnt see. The best CoD: WW2 maps have a hint of verticality, but instead focus on varied yet level playing fields. The last two additions found in United Front are a new War mode mission called Operation Supercharge thats mostly more of the same and a new Nazi Zombies story called The Tortured Path that dramatically alters the flow of a Zombies match. For Operation Supercharge the battle moves to a sandy Tunisian location in which Allied soldiers airdrop into the skirmish to try and capture a Nazi-occupied village and gain important supplies, blow up a bridge, and then capture key objectives at the end. The new Tunisia setting is a good shakeup from the typical retreaded European ground weve seen a million times, but the gameplay loops ends up feeling eerily similar to existing War missions after completing the first objective. It starts out on a high note as Allied forces have to capture supplies that are literally raining down from the sky, adding a lot of nuance and excitement that makes each match play out a bit differently. But after that, the typical blow up a bridge then take these outposts objectives funnel in. The finale has moments of excitement since the objectives are located in exposed bunkers, making it tricky to capture for the attacking team, but overall Operation Supercharge doesnt do enough to really stand out. The undead cherry on top of the United Front sundae is The Tortured Path.And the undead cherry on top of the United Front sundae is The Tortured Path, a multi-chapter Zombies map. Under the hood there are lots of cool ideas on display here, such as its nifty sub-chapters that feature different locations, a more involved XP system, and actual objectives that build toward an ending to the story, but its all nestled in mostly uninspired map layouts. Instead of just being one large Zombies map with an endless stream of undead to kill, Tortured Path is actually more like three smaller maps that stand on their own as you progress through them. The first chapter is mostly outdoors with a collection of small buildings surrounding a courtyard full of vehicles. Between buildings there are lots of tight corridors and some of the objectives are extremely tough given how wide open most of the map is. Chapter two takes place on a boat and features some excellent particle and weather physics. The final chapter, and the toughest of the bunch, is an underground ice cavern with lots of entry points for the hordes to flank and swarm. In Tortured Path the story involves Allied forces continuing to struggle against the Final Reich, and sends you across the zombie-infested landscape to deliver the pieces of Emperor Barbarossas legendary sword you (presumably) finished assembling in The Shadowed Thrones Easter egg story. For each section of Tortured Path youll complete objectives, fight a boss monster, then go to extraction for the next phase of the mission. Objectives are randomized for each map and consist of things like repairing valves, defending a machine, or stopping a specific zombie from reaching its destination. Each section has nine core waves, topped off with a tenth wave boss fight. The result is that each section of Tortured Path feels frantic and intense almost all the time, rather than a slow-burning build to a chaotic finale like in other Zombies maps. I wasnt a big fan of the changes to weapons in The Tortured Path. Instead of pre-determined weapons dispersed at specific locations that you can save up for, you instead spend points on random weapons. You have no choice, though if you get a weapon you like you can buy ammo for it (or pick up a Max Ammo drop if youre lucky) to keep it a bit longer. It feels almost like the randomized loot box-style system is being forced into the Zombies mode, and it ruins a bit of the fun when you cant plan ahead for specific weapons. Luckily, another new addition  the XP system  helps soften the blow as you earn perks as you play that level up your character for Tortured Path specifically. Call of Duty: WW2 - United Front is a bit all over the place. The three new multiplayer maps do very little to deliver anything fresh or new, and the new War mission is also mostly more of the same. But the changes to the Zombies formula in The Tortured Path really shake up the experience and deliver something that feels more nuanced and original from what weve seen out of that mode in years. As a package, its mostly just okay, with only a couple of true high points.", "date": "June 30, 2018,"}