{"name": "Mario Tennis Aces", "name_review": "Mario Tennis Aces Review", "ref": "https://me.ign.com/en/mario-tennis-aces/149497/review/mario-tennis-aces-review", "text": "Playing a match in Mario Tennis Aces is like challenging someone to an arm wrestle and a staring contest simultaneously. Muscling your opponent around the court with clever shot selection and proper baseline positioning during a rally is as essential as ever, but its the layer of fighting game-inspired mechanics applied on top that adds unblinking tension and strategy to each and every point you play. As a result, Mario Tennis Aces serves up some of the most refined and rewarding gameplay in the series to date, but passes up the opportunity to make the most of it with an underdeveloped single-player mode and slight customisation options. The nuanced play on the court comes from the depth of some smart new mechanics. Each player in Mario Tennis Aces has an energy gauge that can be filled by performing charged-up strokes or trick shots, the former requiring you to be in the optimal court position to meet the ball, the latter a riskier move that demands pinpoint timing when the ball is just out of reach. How you expel that energy has a substantial influence on the outcome of each point; do you gradually deplete it by using the slow-motion zone speed ability to chase down a drilled crosscourt passing shot and keep the ball in play, or do you keep banking energy until the gauge is full so that you can unleash a special shot to put an explosive exclamation mark on the end of the rally? And in the case of the special shot, do you aim it down the line for a likely winner or violently smack it right at your opponent in an effort to John McEnroe their racket into pieces and potentially end the match prematurely by knockout? Seemingly triumphant smash shots are swiftly countered with deftly timed blocks.Its a system that does a lot with a relatively simple set of mechanics, facilitating dynamic swings in the momentum of a rally as energy gauges surge and drain, and seemingly triumphant smash shots are swiftly countered with deftly timed blocks. Its further enhanced by the flexibility of its inputs. For example, if you plant yourself for a charge shot on one side of the court only for your opponent to drive a forehand to the other, you can cancel the charge and pull off a vaulting trick shot at the last second to nail a winner down the line. Moments like that demonstrate how Mario Tennis Aces is a far more fun, well balanced and less gimmicky brand of superpowered tennis than that of its disappointing Wii U predecessor, Mario Tennis: Ultra Smash. Adventure Time Another big reason that Ultra Smash sailed well wide of the service box was that its single-player features were almost non-existent. Mario Tennis Aces takes some steps to remedy that complaint, albeit not nearly to the extent of making itself viable as a single-player only game beyond the short term. In Adventure mode, Mario travels around a world map taking on challenges and bosses in a variety of vivid locales, such as batting back fireballs at Piranha Plants in a jungle setting, or playing a match against a Shy Guy on a snowy train platform while sidestepping in and out of a stream of passengers hustling across the court to make their departure. The boss fights, in particular, make smart use of Mario Tennis Aces special moves, with the Madame Mirage mirror in the haunted mansion requiring the reticle-based zone shot to blast the ball through the gaps in a wall of floating furniture, and the tentacle swipes of the huge Gooper Blooper sea monster which must be hurdled with a well-timed trick shot. Completing each challenge earns XP to level Mario up and strengthen attributes like shot speed and agility, giving a decent sense of progression from one level to the next. In addition, there are six rackets to win along the way which both further Marios shot power and also give him spares to fall back on should one break in the middle of a match. Its a shame that there isnt more of a tangible difference between each racket beyond increased power  youd expect that the ice racket would give Mario the ability to freeze an opponent, or maybe the old wooden racket could have imparted additional sidespin to slice shots. But this is not the case, and consequently theres little reason to switch back and forth between rackets to suit a situation as you collect them. Its also somewhat curious that these rackets arent available anywhere outside of Adventure mode. In fact, its disappointing that theres precious little to unlock in general. The biggest problem with Mario Tennis Aces Adventure mode is how poorly it incentivises you to keep playing. I had completed all 27 of its levels and unlocked all of its courts and rackets by the time I was on level 34, which was around a half a dozen hours of game time. Out of curiosity, I replayed a number of the challenges and boss fights several more times over to grind my way up to level 55, but was rewarded with absolutely nothing aside from incremental boosts to Marios stats, thus making the existing challenges even easier. With no New Game+ or more challenging versions of its levels to unlock, or even the option of playing through it with a different character, Mario Tennis Aces Adventure mode becomes increasingly simple and repetitive the more time you put into it. As an alternative, I found 2017s Golf Story to be a lengthier and more diverse sports RPG adventure to enjoy on my daily commute. Mario Tennis Aces' single-player content is ultimately a pretty baseline effort.The other single-player mode, Tournament, is also more short-lived than a book of Toads memoirs. There are Mushroom, Flower, and Star tournaments, each consisting of three rounds of increasingly tough opponents to topple. But its all stick and no carrot. Completing a tournament with each of the 16 characters nets you the same trophy splash screen and nothing more - there are no rackets, alternate costumes, or additional characters to be discovered. (All 16 characters are unlocked from the start, with Koopa Troopa and Blooper coming via a free DLC update post launch.) Theres also no option to play these tournaments with an AI partner in a doubles pairing. While certainly an improvement on Mario Tennis: Ultra Smash, Mario Tennis Aces single-player content is ultimately a pretty baseline effort. Mixed Doubles Multiplayer has a considerably longer lifespan by comparison but it, too, is not without its quirks. For starters, most same-screen multiplayer matches have a mandatory vertical split-screen. Presumably, this is to make it less disorientating for the human players on the far side of the court when the perspective switches to first-person for a zone or special shot, but it results in a fairly narrow field of view, particularly for doubles matches. I would have at least appreciated the option of disabling it. Theres a decent variety of courts in the rotation, a handful of which featuring game-altering hazards such as portal mirrors that reroute the trajectory of the ball, or explosive Mechakoopas that turn a doubles match into a spectacularly chaotic warzone. Yet actually setting up a match on them is cumbersome. Rather than simply choosing the court you want, you have to toggle off all the courts you dont want instead, which feels unnecessarily convoluted. On top of this, the absence of the ability to play an offline tournament with friends seems like a glaring omission. Lastly, while there is a notable difference in the strengths and weaknesses of each character, (for example, Boos slice shot can hoop around corners while Bowser is all about lumbering brute force,) I cant help but feel that Mario Tennis Aces longevity would have benefited from more customisation options, a la Mario Kart 8 or ARMS. If you could change your racket type or perhaps choose from alternate special moves and thus create more permutations within each match up, then Mario Tennis Aces multiplayer mode would likely have had longer legs than a pair of Waluigis dungarees. (Note: As of the time of writing this review, Nintendo is yet to enable online multiplayer, so Ive based my impressions on local multiplayer and my experience in the pre-launch Online Tournament demo. If online doesnt work as expected at launch, this review will be updated.) Rounding out the Mario Tennis Aces package is the Swing mode, which invites you up out of your armchair to play your strokes via the JoyCon motion controls. Despite the fact the JoyCon has a more sensitive gyro sensor than the Wiimote, I found Swing mode to be too inconsistent in terms of differentiating between a flat shot and a slice, or even a forehand and a backhand. As a result, it felt like a far more unreliable and frustrating alternative to button-based inputs  somewhat flying in the face of its more accessible, family friendly intentions. Mario Tennis Aces is an extremely fun arcade tennis experience, colourful and dazzling to look at and smartly balanced in its back-and-forth play. With a little bit more care and depth given to the simple single-player mode and more variety added in the way of character and tournament customisation to give its multiplayer extra spice, Mario Tennis Aces could have been a true all-rounder. As it is, Mario Tennis Aces is still a lot of frantic tennis fun with friends.", "date": "June 21, 2018,"}