{"name": "Far Cry 5: Hours of Darkness", "name_review": "Far Cry 5: Hours of Darkness DLC Review", "ref": "https://me.ign.com/en/far-cry-5-hours-of-darkness-dlc/148615/review/far-cry-5-hours-of-darkness-dlc-review", "text": "Hours of Darkness is a bit of a misleading title for this Far Cry 5 expansion, considering your primary objective can be completed in just over a single hour. It is (slightly) more Far Cry, though, and its heavily focused on stealth. Thats a good thing for gamers like me who just love sneaking through outposts. The setting here is completely different than Far Cry 5s fictional Hope County, Montana cultist shooting gallery. You play as Hope County resident Wendell Redler, a Vietnam War veteran who is recounting the tale of how he was shot down behind enemy lines and had to survive as he fought his way to an extraction point. Its basically Rambo: The Video Game, except much better than Rambo: The Video Game. Hours of Darkness puts you on an entirely new jungle map to do your Far Cry thing in, filled with new outposts, jungle cats, P.O.W.s to rescue, and enemy soldiers to put down. As mentioned, you can beeline to your extraction point in just over an hour. However, many distractions will appear on your path that can triple your playtime, and plenty are worth doing. Most notably, several members of your company survived the plane crash and have been taken captive. Rescuing them will add them to your crew much like the Gun for Hire system in Far Cry 5, and their help is quite beneficial during the climactic standoff once you reach your destination. Ubisoft clearly expects us to spend the time doing these sidequests. Looking out for teammates keeps firefights from being completely mindless. After completing your mission on Normal Mode, youll unlock two more. Survivor Mode is basically the Hard Mode, giving you less health and a smaller inventory. Then theres Action Movie Mode, an easier experience with more explosions and a bigger inventory. One big difference between Hours of Darkness and Far Cry 5 propper is that your buddies arent invincible  even after youve rescued them they can be permanently killed in combat. So in order to leave no man behind, youll need to keep an eye on their health and be ready to revive them if they go down. They can also revive you  even more incentive to keep them in mind. I like that extra level of team management because it gives you a little more to think about, keeping firefights from being completely mindless. A new perk system also significantly changes the gameplay in this expansion. As you make stealth kills youll activate perks like faster movement and automatic enemy tagging, but if you are spotted by the enemy youll lose the perks. Since these benefits are gained by using stealth, its pretty clear how the developers want you to play Hours of Darkness. While I do like this perk system  especially since I like to play stealthily anyway  one of the major drawbacks is that when you dont have any perks activated you feel painfully slow. If you happen to end a firefight without any perks, youre in for a long walk to your next encounter, and thats kind of a bummer. Even in those slow moments, my spirits were lifted by a North Vietnamese woman who shouts propaganda at you from radios scattered about the jungle bases. Destroying all the radios is one of your extra tasks, but I hated to do so because her threats were so amusing. In menacing broken English she baits you with things like, We have your friends. No one is coming to save you, American. You die alone in the jungle! Okay, it looks dark when you write it out like that, but the delivery makes it funny. As for weapons, Vietnam War-era guns have supposedly been added, but I couldnt tell you the difference between them and the regular Far Cry 5 arsenal. Hours of Darkness is a clever and fun but brief twist on the Far Cry formula. Its new approach to Guns for Hire AI companions gives you something other than yourself to worry about during battles, and its use of perks as a reward for stealth kills encourages my favorite style of play in an interesting way, but can bring your momentum to a screeching halt when you slip up. Just like the Far Cry series previous jaunts to new locations, this trip to Vietnam is a good time.", "date": "June 5, 2018,"}