{"name": "SEGA Genesis Classics", "name_review": "SEGA Genesis Classics Review", "ref": "https://me.ign.com/en/sega-genesis-classics/148403/review/sega-genesis-classics-review", "text": "Just as every generation needs a revolution, so too does it need a new SEGA Genesis Collection. The first 28-game package arrived on PlayStation 2 in 2006; three years later we received the excellent Sonics Ultimate Genesis Collection on PS3 and Xbox 360, packing a much meatier 48. Now here we are with the latest bundle, SEGA Genesis Classics, collecting 53 little pieces of our childhoods (those of us born in the 70s and 80s, at least). Its a good selection, featuring a variety of absolute bangers (Sonic the Hedgehog, Streets of Rage) and some cult favorites (Shining Force, Landstalker), though some glaring holes in the lineup prevent it from feeling comprehensive, but this is the best way to sample the SEGA Genesis library today without the actual original console, CRT television, and carts. I revisited all 53 games for this review and found that about 90% of them are still fun to play today. There is a nice variety on display here, showcasing several different sides of the Genesis personality  brawlers, platformers, RPGs, puzzle games, and, um, whatever Decap Attack is. Heres the full game list: Alex Kidd in the Enchanted Castle Alien Soldier Alien Storm Altered Beast Beyond Oasis Bio-Hazard Battle Bonanza Bros. Columns Columns III: Revenge of Columns Comix Zone Crack Down Decap Attack Dr. Robotnik's Mean Bean Machine Dynamite Headdy ESWAT: City Under Siege Fatal Labyrinth Flicky Gain Ground Galaxy Force II Golden Axe Golden Axe II Golden Axe III Gunstar Heroes Kid Chameleon Landstalker Light Crusader Phantasy Star II Phantasy Star III: Generations of Doom Phantasy Star IV: The End of the Millennium Ristar Shadow Dancer: The Secret of Shinobi Shining Force Shining Force II Shining in the Darkness Shinobi III: Return of the Ninja Master Sonic 3D Blast Sonic Spinball Sonic the Hedgehog Sonic the Hedgehog 2 Space Harrier II Streets of Rage Streets of Rage 2 Streets of Rage 3 Super Thunder Blade Sword of Vermilion The Revenge of Shinobi ToeJam & Earl in Panic on Funkotron ToeJam & Earl Vectorman Vectorman 2 Virtua Fighter 2 Wonder Boy III: Monster Lair Wonder Boy in Monster World Highlights include Shining Force 1 and 2, which are a couple of the finest turn-based strategy games ever made. Streets of Rage could shake down Double Dragon. Gunstar Heroes and Dynamite Headdy are run-and-gun classics from one of the greatest action developers of the 90s, Treasure. Similarly, the obscure run-and-gun affair Alien Soldier, another Treasure joint, makes its North American debut here. Phantasy Stars 2 and 4 are still terrific JRPGs  you could kill 50+ hours with just these two quests. Beyond Oasis was SEGAs attempt at a Zelda clone, but it really stands on its own as a charming action-adventure game. And Landstalker is a clever isometric action-RPG. But while theres plenty of meat on the bone, fans will no doubt find many of their favorites missing. For example, theres nothing here from Capcom or Konami. That means no Strider, Ghouls & Ghosts, Contra Hard Corps, or Castlevania: Bloodlines. Nothing from Disney, so the best version of the Aladdin platformer is in a whole other world. There are also no sports games in the mix, which is a bit of a surprise considering the Genesis positioning as being the 16-bit console for that genre. Those absences can be explained away with licensing complications, but there are also some notable and confusing first-party exclusions. Sonic 3, Sonic & Knuckles, and Ecco the Dolphin are all absent, despite being present for previous collections. The This Should Have Stayed Dead Award goes to Virtua Fighter 2. This is not the respectable arcade version  its the Genesis version, which never should have been attempted as the console simply cannot handle the 3D graphics. Instead, it spat out what IGNs 2007 Virtual Console review called a nearly unrecognizable port that failed to capture even a hint of the magic of the arcade original. The charming menu screen is presented as a 90s kids bedroom with Golden Axe and Shinobi posters on the wall and a pretty radical Sonic the Hedgehog rug. Youve got your game library displayed next to your TV, but I really wish we could see the box art  instead, we can only see the spines. There are some nice emulation settings, meta game challenges, and online multiplayer for 21 of the 53 games that aims to drag these 90s kids kicking and screaming into the twenty-tens. From Streets of Rage to Golden Axe to Altered Beast, now you dont need a friend IRL to play with (although you can still do that, too). Note: This review was written several days before release and I havent had a chance to try out the online multiplayer. Im assuming it works since these arent exactly the most high-tech games today, but if it turns out to be a disaster well update this review accordingly. In addition to trophies/achievements, there are challenges for performing very specific feats in certain games. In Columns, you must start with a mid-game save and reach a score of 5,000. In Flicky, youre asked to complete round 10 in under two minutes. The collection tracks your number of attempts and gives you another goal to shoot for besides game completion or high score. I appreciate that this isnt a bare-bones pile of old games  SEGA gave us a little something new to chew on. (Speaking of high scores, there are online leaderboards for comparing your scores with the wider world of SEGA fans.) The Mirror Mode is a cool way to experience a game you've played a million times in a fresh new way. As for emulator settings, there are various options for pixel smoothing and scanlines. One really nice feature allows you to slightly distort the edges of the screen in order to simulate the curved shape of a CRT television. Several different borders are available to frame your 4:3 gameplay with, including a few themed after Streets of Rage and Sonic. Some of the adventurous emulator settings include a switch to disable the sprite limit. In theory, this would override a limitation built into the SEGA Genesis that prevents too many sprites from appearing on screen and slowing down the action, but a warning advises that it may cause other graphical glitches. So have fun! I flipped the switch but didnt notice any discernible difference. Then theres Mirror Mode, which reverses all gameplay and text on screen. Virtually every side-scrolling game ever created sees you walking right, but now with this revolutionary feature, you can walk to the left. All joking aside, its a cool way to experience a game like, say, Streets of Rage 2 that youve played a million times in a fresh new way. A modern retro collection should have a good batch of games and some extra niceties like save states and emulator settings. SEGA Genesis Classics checks those boxes, providing the best way to do what Nintendont today. But considering it doesnt even have all the first-party hits that it should, much less the most memorable third-party ones, its hardly a definitive package.", "date": "May 30, 2018,"}