{"name": "What Remains of Edith Finch", "name_review": "What Remains of Edith Finch Review", "ref": "https://me.ign.com/en/edith-finch/132126/review/what-remains-of-edith-finch-review", "text": "What Remains of Edith Finch sits alongside Kentucky Route Zero as one of the finest magical-realism stories in all of video games. A first-person, story-driven experience akin to Gone Home and Firewatch, it tells the incredible, tragic, and constantly surprising multi-generational history of the Finch family. As you explore the the gorgeous labyrinthine home, youll go on a guided history of each family member, delve into what may or may not be a familial curse, and ultimately learn how each one succumbed to it. Developer Giant Sparrow (known for The Unfinished Swan) has once again created something truly special. In the two hours it took me to fully explore I ran the emotional gamut from feeling completely devastated to full of an energetic light to annoyed by noticeable performance dips, especially when I approached the house for the first time. The only challenge is finding a way into each locked room of the house, generally through the use of secret passages that make the whole thing exude the charm and imagination of a pop-up book. While exploring the house, the last living member of the Finch family, Edith, narrates with stories of the house, her family, and how the incredible lives they lived untimely came to an end. While the whole thing is pretty much devoid of any friction preventing you from progressing (there are even fewer puzzles here than in the aforementioned Gone Home), the joy of Edith Finch is in fully immersing yourself in the final moments of each Finchs life. Once you find a specific momento in each of their rooms, youre treated to a story of their death, told through fantastical allegories. Each one is presented through a completely different gameplay experience that continually subverted my expectations. With each one, nothing is safe when it comes to art style, perspective, or gameplay genre. I dont want to spoil them because I got so much joy out of never knowing where the next memory would take me. With the exception of one awkward sequence where you control animals from a first-person perspective, theres a dreamlike nature to the way these sequences not only bend the rules, but completely obliterate them. While each story is ultimately about death, its wonderful how full of life each and every tale is. Even something as heart-wrenching as the death of a child is presented with such exuberant creativity and magic. While experiencing the final moments of their lives is unquestionably tragic, they way they embrace it and welcome whatever might come next filled each story with light. The eccentric family themselves reminded me from The Tenenbaums from Wes Anderson's The Royal Tenenbaums, or the Glass family from J.D. Salingers various works. Learning how they they were all related and how the various deaths impacted each surviving member is something that I wont soon forget. One thing I absolutely love about the house itself is how incredibly lived-in in feels. It doesnt come across as a set designed around the idea of a video game level, but rather a home that a dozen members of an impossibly creative family lived in over several generations. Part of this comes at the cost of interactivity  theres very little in the house you can actually touch or manipulate. Like a museum, theres a look, but dont touch policy here. But honestly, this didnt bother me given how much I enjoyed the act of meticulously looking at every beautiful detail of the world. Though it only took me just under two hours to complete, the second the credits stopped rolling I immediately restarted What Remains of Edith Finch. Each of the vignettes is so distinct and surprising that I didnt have enough time to absorb and dissect what I had just played before being whisked away to the next one. But after fully piecing together the threads of the family and sifting through the allegories of their final moments, I was left with a beautiful, heartbreaking mosaic that exudes life, even when mired in death.", "date": "April 27, 2017"}