{"name": "Voodoo Vince: Remastered", "name_review": "Voodoo Vince Remastered Review", "ref": "https://me.ign.com/en/voodoo-vince-remastered/131855/review/voodoo-vince-remastered-review", "text": "There's a wonderful scene toward the start of Voodoo Vince where our hero, a raggedy voodoo doll newly brought to life through magic, grabs a trumpet and shades and ambles up to a skeleton jazzman with a trumpet of his own. Much like this remastered version bridging the 14-year gap since Vince's first appearance on the original Xbox, it's a meeting of the old and new, and it works well. For a few wonderful seconds the pair slips into a jazz duet that's so dang cool I half forgot I was playing a game, and that moment is what's stuck with me several hours later. That's the remastered version of Voodoo Vince for you. This might be a fairly by-the-numbers platformer, but its unique personality makes it tough to get out of your head. Voodoo Vince Remastered is a remaster in the truest sense of the word  you'll find no new levels, bosses, or challenges lurking among the tweaks. That means it's also as short as it ever was, with a thorough playthrough demanding only around eight hours. I find that barely matters, though, since Vince has been off the radar for so long that it almost feels new. Games with a more ~realistic~ art style might suffer after such a long absence, but Voodoo Vince's vaguely Pixarian look allows it to enter the modern age with only a few signs of wrinkles. It looks all the more modern with a new 1080p resolution, 16:9 aspect ratio, and generally steady 60fps frame rate that holds its course on both the PC and Xbox One versions. Nothing makes Voodoo Vince a joy to play quite like the music. These improved visuals are important, as there's no better reason to play Voodoo Vince than to revel in its style. Vince's adventures unfold in a warped version of New Orleans' French Quarter and its surrounding swamps, and he's called on to rescue his creator, Madam Charmaine, after the goons of a long-faced jerk named Kosmo the Inscrutable kidnap her and run off with her zombie dust. It nails the imagery, from a crazy take on Jackson Square where eerie cracks pierce the cobblestones to jaunts through swamps where Vince must make precarious leaps to pick up items for extra lives. Yet nothing makes Voodoo Vince a joy to play quite like the music, which peppers each of the six zones with Dixieland jazz that's always catchy and seldom intrusive. Voodoo Vinces personality further manifests itself in the many puzzles, which might have Vince turning a clock ahead to the right time so he can visit a jazz club for items to complete a level, or riding in a minecart on a subterranean clothesline where he needs to pick up dozens of shirts. It's got some deadpan humor, too, although it's often a bit on the lame side. At one point Vince comes across a turtle scientist bragging about his supposedly great genius, and Vince's witty reply is merely that he can figure out that he's making a balloon. Naturally, Vince has to hunt down the supplies for this balloon (and other items, depending on zone), and it's moments like these when Voodoo Vince rolls into action. Developer Beep Industries' game was often lightly chastised back in the day because its action barely differed from games that were already on shelves, and that much remains true. Vince spends most of his time bouncing from platform to platform collecting optional items like vials of dust to give him more health or pages that unlock an item that gives him more powers, and his basic skillset includes old standbys like double jumps, spins, head stomps, and the ability to slowly glide down while falling. Strictly speaking, that combat isn't even that fun. Vince's punches feel as though they hit only a little harder than what you'd expect from a dude made out of burlap, and he can usually ignore and run past most of the enemies he comes across anyway unless he wants to pummel them a bit to regain health or other boosts from the items that drop. Even bosses, while fun to look at, barely pose a challenge until the end. But Voodoo Vince is not without its own identity. Being a voodoo doll, Vince harms others when he harms himself, and environmental puzzles sometimes lead him to, say, slam an anvil on himself in order to smash a malevolent piggy bank. Vince also picks up around 30 ~voodoo powers~ in his journeys through exploration or hidden bosses, and there's great fun in finding which one randomly goes off when you pull both triggers on a gamepad. Sometimes a chainsaw might appear and chop Vince in half, simultaneously causing every enemy in the vicinity to share in the horror. There's William Tell, where a hail of arrows hits everything on Vince (and the enemies around him) except the apple on his head. It's all a bit macabre, but it's pulled off in such a perfect Looney Tunes fashion that it always prompts laughter rather than disgust. And that's the bulk of Voodoo Vince. It's a relatively short, simple platformer, but it oozes with personality and a constant sense of fun that tend to make it more memorable than some of its peers. Voodoo Vince's action doesn't deviate much from the standard conventions of early 21st-century platformers, but its jazzy music and bizarre New Orleans look render it a memorable experience. With modernized textures, resolution, aspect ratio, and frame rate, this remastered version updates Vince for a new generation, and hopefully ensures he won't get buried like he was in his former incarnation as an Xbox exclusive.", "date": "April 18, 2017"}