{"name": "Loopmancer", "name_review": "Loopmancer Review", "ref": "https://me.ign.com/en/loopmancer/199703/review/loopmancer-review", "text": "Something occurred to me as I poured hour after hour into Loopomancer: Roguelites have become so ubiquitous that playing a new one has become a sort of meta-loop of its own. It can feel like you are playing through a remixed version of the same concepts, just with different titles and gimmicks, time and again  lather, rinse and repeat. To stand out, a game must either do something extremely creative, or distinguish itself with quality and polish. Loopmancer, which follows in the footsteps of other 2D action platformer roguelites such as Rogue Legacy and Dead Cells, opted for the latter  to great success. None of its mechanics are groundbreaking, and the cyberpunk story  while cool  is filled with cliches. But after riding this loop for close to 20 hours its clear to me that what it lacks in originality it more than makes up for by nailing the most important elements of the genre: outstanding gameplay, and making each run fresh and meaningful.You play as Xiang Zixu, a generic tough-guy detective in techno-futurist Dragon City, who has been killed while investigating a missing person. Immediately after dying he wakes up in his bed, on the same morning of that same day, and given the same dispatch to investigate the same missing person. Its a tried-and-true time loop formula, and effective as a premise for a roguelite. Zixu doesnt have much in the way of personality, but it is enjoyable to listen to him impatiently explain to his handler at the detective agency that he already knows everything that is going to happen. Progressing further allows him to piece together the interesting details of whos pulling the strings and why. There are some branching paths along the way, and following them on successive runs leads to different story reveals and seven different endings. Even if the answer always seems to be pulled straight from Philip K. Dick knockoffs, theyre fun to watch as they unfold. The Tang Dynasty Hotel, in particular, stands out for its varied design.The Cyberpunk setting is leveraged very effectively in creating interesting environments. One minute you are beating down henchmen across grimy city streets while dodging oncoming traffic, the next you are fighting cyber ninjas in what feels like a modern recreation of Elevator Action as you search for the correct lift to ascend an office building. The Tang Dynasty Hotel, in particular, stands out for its varied design: you must navigate by grappling hook or elevator in one section and then engage in a massive, multi-tiered battle in which the action is shown only in silhouette behind hundreds of crimson banners. Each level is divided into subsections with cohesive themes, and they remix each run in small but meaningful ways. Paths that had been open become blocked, while new routes become available. Enemy types reshuffle, powerups change locations. One visit to the dilapidated slum known as The Ditch may have you smashing giant spiders with a battle ax while you tiptoe between tripwires. Then you die, come back again, are shotgunning giant mutants while trying not to fall in electrified water. Its enough to keep Loopmancer feeling fresh for a good while.Loopmancer is unabashedly an M-rated game. The art style and framing make most of the gore comical, as your foes turn to shrapnel after meeting your incoming attacks. The melding of flesh and technology is a common cyberpunk trope, and leads to a few instances that border on body horror. Its not gratuitous, but may make some folks squeamish. Meanwhile, what human enemies lack in fighting ability they tend to make up for in creative uses of obscenities directed at Zixu. Combat is fast and aggressive. Melee weapons like swords and hammers mix with ranged attacks like shotguns or lasers to deal damage, while defensive dodges and parries add fluidity to exchanges. Tech items, like turrets or mines, can be deployed, and special attacks in the form of Skill Chips can instantly end a skirmish but come with a cooldown timer. Enemies have a lot of variety, and their design materially affects how best to approach them. Your melee weapon might make quick work of a generic street gang member, but the expert martial artist right behind him will shrug off your attacks and counter. Emptying your best attacks into the giant mutant may sound like a good idea until you are swarmed by poisonous spiders. Sometimes all you can do when you are surrounded by invisible ninjas is start shooting and hope you hit something  ideally not the explosive barrel you didnt realize you were standing on. Enemies have a lot of variety, and their design materially affects how best to approach them.The best way to survive varies by the weapons and tools you have, and types and numbers of enemies coming at you. As a result, heavy fighting becomes an intricate dance of mixing attacks with quick twitch dodges, all while making snap decisions about when to use your limited ammo and tech items. Its exhilarating, and keeps the experience fresh throughout. With nearly 50 melee weapons, and dozens of guns, tech skills, and abilities, the variety of tools at your disposal is very similar in scope to your arsenal in Dead Cells. Ive run into battle wielding swords, bo staffs, my fists, large fish, golf clubs, a frying pan, and much more as my primary weapon, and all have their own unique properties and animations that make them viable. The decision of which to take with you is rarely black and white: It may be tempting to take the grenade launcher into combat for its sheer explosive damage, but that poison-spewing SMG has much more ammo. Sure, a crowd-clearing grenade can help you get to the boss, but those deployable auto turrets would be a big help when its time for that big fight.It may be tempting to take the grenade launcher into combat for its sheer explosive damage, but that poison-spewing SMG has much more ammo.Speaking of big fights, the diversity of bosses is another one of Loopmancers strengths. Most levels feature a challenging fight against a unique enemy with patterns to memorize and windows for attack to learn. Earlier bosses, like the aptly named Big Guy, are easy enough to defeat with well-timed dodges and strikes, while others, like an AI-powered hacker, unfold more like puzzles and really benefit from carefully choosing the right tools before the fight. A boss fight against a man in a mech suit ended many early runs of mine, but later that encounter transformed into a speedrun as I memorized his attack patterns and gleefully unleashed righteous fury with whatever weapons I managed to get my hands on. I found the fights tough but fair, and the first time I beat the final boss (which I wont spoil), I could feel my heart pounding and forehead beginning to drip with sweat.The weapons and abilities are largely found scattered throughout the levels, and can be unlocked and upgraded by spending e-Coins, a currency that  in true video game tradition  flies out of defeated enemies and broken pots or crates. When you die you lose all of your equipment and must start anew from a random assortment, but the unlocks and upgrades are permanent, and there is a chance these new weapons will be among your selections at the start of the next loop. After struggling to defeat them in the early hours, theres a supreme satisfaction to be had shredding an early level boss with a maxed-out, endgame rocket launcher. On top of that, Zixu has a persistent upgrade tree of his own where you can increase your health, unlock new combat moves, or buy new cosmetic outfits. Alternatively, you can dump your upgrade cores into terminals scattered throughout levels to increase their healing ability. This presents you with another decision to make: Do you focus on your next upgrade to power up for future runs, or do you go all in on this one? Optional challenges appear on screen throughout levels, prompting you to kill a certain number of enemies or eliminate them in a specified way. Its completely optional, but their rewards can be well worth your time. Sure, maybe youve already sliced these goons to bits a dozen times already, but can you take them out with explosive barrels, or throw them into traffic for some extra cash on the side? Maybe youll earn a memento that you can view back in your apartment for some additional worldbuilding. Its an added layer of intrigue, but naturally it can easily lead to unnecessary deaths if you stray too far from what fits your equipment and playstyle. This risk-reward calculation is a constant part of progressing through Loopmancer (and any good roguelite). A key example is that each group of levels will have a defined exit, but many will also reward exploration (presuming you dont die in the process). You could go through the elevator to the boss, but there are potential Buff Bots to be found if you are willing to climb some chandeliers or brave oncoming trains to reach a hidden platform. These are boosts which can enhance your health, increase the damage you deal, and speed up how quickly you can use abilities, among other things, for the duration of the run. Some will be hidden, others will be readily visible but surrounded by enemies. Of course, opportunities to refill your health are limited, so every hit you take materially affects your chance of survival. On more than one occasion I found myself torn, at a crossroads between advancing to the next section and pursuing a dangerously located Buff Bot. Those are the moments that make games like this shine even out of combat, and Loopmancer has no shortage of them. Loopmancer is a great roguelite. Repeating the same day over and over again is anything but routine thanks to great combat, compelling progression, and consistently refreshed levels stocked with a huge variety of weapons and enemies. Even after dozens of loops I feel compelled to jump back in and see what random assortment of gear I end up with, and how quickly I can make it through to the end. This is a loop well worth getting caught in.", "date": "July 14, 2022,"}