{"name": "Nighthawk X4S Smart Wi-Fi Gaming Router", "name_review": "Netgear Nighthawk X4S Smart Wi-Fi Gaming Router Review", "ref": "https://me.ign.com/en/netgear-nighthawk-x4s-router/131200/review/netgear-nighthawk-x4s-smart-wi-fi-gaming-router-review", "text": "The Netgear X4S is a high-end AC2600 router that is in the upper echelon of the Netgear's lineup at around $200, and is just one rung below its extremely serious (and ultra expensive) money-is-no-object 8000 series routers that looks like spacecraft and are designed for enterprise or tech mogul deployments. Its model name is the R7800, and its what I consider the companys top of the line offering for regular consumers. Its also marketed as a gaming router, and on the routers webpage the very first words in its description are, Fastest gaming performance. That is indeed what I want as a gamer, so lets examine this bad boy and see how she runs. Design and Features The X4S is an AC2600 router, meaning its a dual-band model that offers a combined total maximum throughput on both bands of 2,600Mbps. Its divvied up into 1,733Mb/s on the 5GHz AC band and 800Mb/s on the 2.4GHz band. Since each AC stream is capable of 433Mb/s, with four streams on the X4S (via its four antennae) you get 1,733Mb/s. Of course it would never be able to achieve that in the real world, but this is marketing copy, not real world measurements. The R7800 sports five Gigabit Ethernet ports (4 LAN and one WAN), and two USB 3.0 ports for connecting storage or a printer for sharing, and also has an eSATA port for some reason. The X4S is whats known as a Wave 2 router (or second generation AC wireless, to the layman), so it offers a bunch of features that were left out of the first wave of AC routers. One of these much-touted features is MU-MIMO, which stands for Multiple User-Multiple Input, Multiple Output meaning it can broadcast to three MU-MIMO clients simultaneously, which is an improvement over standard AC wireless which sends data one client at a time. The only catch is those clients need to be MU-MIMO capable and far enough apart that the router can recognize them as separate streams. MU-MIMO wireless adapters are still quite uncommon, however, but it speaks to the future-proof nature of the X4S as it may be more commonplace in a few years. The same goes for the routers support of 160MHz channels, which it accomplishes by bonding two 80MHz channels together. This is similar to MU-MIMO in that though the router supports it, the client needs to support it too, and those wireless cards are still rare as of this writing. Under the hood is a 1.7GHz dual-core CPU, which is on the potent side for a router. As far as its gaming credentials go Netgear makes all kind of wild claims about how its ready for 4K gaming, but the actual feature it promotes is its dynamic Quality of Service, which can intelligently prioritizes packets, hence the word smart in its title. In my opinion, this is really the only feature that a router can boast to improve gaming, since youre typically hard-wired to a PC or console. However, if you are gaming wirelessly then obviously overall speed plays a massive role and really separates one router from another. The problem is nobody will ever achieve the maximum speeds quoted by Netgear, and wireless speed can be impacted by a range of factors that are unique to your environment, so you have to take all test results with a grain of salt. Admin Software Ive been reviewing routers for a few years now and Netgears admin interface has always bothered me, as it looks totally outdated and doesnt jive at all with the look and feel of its routers. Whereas the companys routers are sleek and sophisticated, its software looks like it was made in the 90s and never updated. Not only do I object to the use of the colors green, purple and orange but the layout on most of the pages looks like it was imported from a spreadsheet. Regardless of all that, it works and provides a ton of functionality, which, like most routers, the majority of users will probably never access. The basics are covered for novices, and there are a ton of options for IT pros as well. When it comes to gaming, Netgear has a dynamic Quality of Service (QoS) feature that you can either turn on or off; theres no customization or prioritization available. This makes it somewhat of a black box, but it claims to be able to prioritize traffic based on a database it keeps updated regarding specific types of traffic. Also, like an anti-virus application its updated but Im not sure how often, and you can allow it to download these updates automatically (I did). Netgear also offers a companion mobile app for iOS and Android named Genie, and it looks just as lame as the browser interface, and like the browser admin controls is not the easiest to use but gets the job done. Its better than nothing, is about all I can say. Wireless Performance To test how the R7800 performs, I set up a server/client scenario with Netperf and two Windows 10 PCs, then measured the speed of the TCP connection between them. I measured at both 15 feet with line of sight, and at 30 feet with two walls between the computers. I ran the TCP test at least three times to make sure my results were consistent, and if they weren't, I re-tested until they were, trying at different times of the day until I was satisfied. Though everyones environment is different, and you wouldnt be able to exactly replicate my results, they are a good way to get a ballpark estimate of how the router performs. I also performed a real world 2GB file transfer test at 30 feet as well. 5GHz at 15 Feet 5GHz at 30 Feet I can summarize the Netgear Nighthawk X4S 5GHz performance in two words  the best. It topped the chart in both 5GHz band TCP transmission tests, though by a very small margin over the Linksys WRT. Still, it was incredibly fast in both tests, with nary a drop off in speed as distance doubled and two walls were added to the equation. This is a very fast router, no doubt. 2.4GHz at 15 Feet 2.4GHz at 30 Feet Unfortunately, as is often the case in this cruel world, the situation was the reverse in my 2.4GHz tests, as the R7800 languished towards the bottom of the pack, but again, barely slowing down as distance increased. Still, it wasnt the strongest showing at 2.4GHz, making it one of the slower options if youre still running legacy devices. 2GB File Transfer at 30 Feet Finally, in my file transfer test it once again topped the Linksys WRT by five seconds, taking just 52 seconds total to transfer 2GB of data wirelessly at 30 feet. This jives with its overall 5GHz test results, since it was indeed the fastest. Its 1.7GHz CPU no doubts helps here as well. The Nighthawk X4S is a very strong package, let down only by its slow 2.4GHz performance and antiquated admin software. Still, it has the goods where it really counts, as it was the fastest 5GHz router I tested and also the fastest for file transfers, which is what the majority of people would use it for. It also has next-gen features such as MU-MIMO and is relatively affordable too, making it my top pick for a high-end AC router. Also, Netgear sells a slightly downgraded model named the R7000 if you don't care about MU-MIMO and want to save a few bucks.", "date": "March 30, 2017"}