{"name": "The Elder Scrolls Legends", "name_review": "The Elder Scrolls: Legends Review", "ref": "https://me.ign.com/en/the-elder-scrolls-legends/130821/review/the-elder-scrolls-legends-review", "text": "The CCG (computer card game) space is an increasingly crowded one, but Legends is hoping to stand out from the pack by tapping into the rich lore of the Elder Scrolls series, and by bringing some new gameplay ideas to the table. It succeeds in both regards, offering up a compelling competitive experience, as well as solid single player content. Legends incorporates elements from both Magic the Gathering and Hearthstone. From the former it has a colour/attribute system in place of classes. Players build their deck of (at least) 50 cards using no more than two of the games six colours. Each colour represents a broad theme, so green is Agility, purple is Endurance, blue is Intelligence, red is Strength and yellow is Willpower. Neutral, colourless cards complete the pool and can be used in any deck. The colour system is less evocative than having classes represented by defined personalities, but it certainly makes for a lot of potential attribute combinations, and thus, gameplay variety. Archers, for instance, combine Strength and Agility, giving them damage dealing potential paired with excellent tools for removing enemy creatures and extracting value out of cards. (A minion with Pilfer, for instance, triggers its ability each time it attacks the opponents hero, so can do things like stack stat buffs or repeatedly draw cards.) Mages, on the other hand, combine Intelligence and Willpower, so a Control Mage build is able to lock the board down using a wealth of removal tools, as well as debuffs, ward minions, guard minions and more, all of which stall the game until it can get to its powerful late game drops. Like Hearthstone, both players start with 30 health and one point of magicka (the games resource), which increases by one at the start of each turn. Your total resources determine what cards you can afford to play, and there are four categories of cards: creatures (minions), items (buffs), abilities (spells) or supports (ongoing aura-style effects or abilities that are manually activated), with a host of keywords on top of that. These cover things like locking creatures in place, blocking damage and regenerating health. Unlike Hearthstone, your hero's health isn't capped. What really sets Legends apart, however, is its use of lanes. The playfield is divided down the middle, with a field lane on the left and a cover lane on the right, and creatures are (almost always) only able to attack other creatures in the same lane. The cover lane is particularly interesting because when you play a creature to that side, it is cloaked during the opponents next turn. This means it cant be attacked by another creature in that lane. Cloaked creatures, however, can be targeted in other ways  they can be damaged or killed by actions or summon effects. The lanes create an interesting, and strategic, cat and mouse dynamic. The core gameplay atop this is defined by making efficient minion trades and building a board advantage. There are plenty of buffs to make that interesting, as well as single target removals, while big board clears are much less common than in something like Hearthstone. Legends isnt just about tempo, however, as the inclusion of so many buff and support cards means that there are some powerful combo strategies you can go after too. Legends also integrates a really clever counterplay and comeback system. Each player has five runes on their health bar, at 5, 10, 15, 20 and 25 respectively. When your health is reduced to  or below  one of those levels, a rune breaks and you draw a card. This means that the player thats losing in terms of health is gaining resources  and thus options  to help him or her get back into the game. More interesting still, if the card drawn has the keyword ~Prophecy~ you can play that card for free  during your opponents turn. Yes, control comes back to you while you decide what to do with the card. Not only does this create games that swing back and forth, but its additional layer of strategy. Prophecy cards, after all, can be used to deal damage, to destroy creatures and to play creatures to the board. For free. The downside is that they generally have slightly lower stats than they otherwise would, so you have to balance the massive potential upside  hitting one when a rune breaks, with the reality that most of the time youll be playing them from your hand. Anyone who has played a CCG before will likely see how interesting this is as a mechanic, and it really alters how games play out. You now think twice before attacking, for instance, as hitting any of those health thresholds isnt just risking a Prophecy card, its giving your opponent resources, and in card games, having more resources than your opponent generally gives you the advantage. Depending on the deck youre facing, you may want to just contest the board until youre ready to go in for the kill. You may want to break some runes, but hold off on certain attacks to leave your opponent just above a threshold when it makes sense. Game changing. The next level players, of course, will have a good idea what Prophecy cards their opponent is likely to be running, and can thus evaluate the risk versus the reward. If you know that Willpower decks almost all run Piercing Javelin (a five cost action that destroys a creature) and you have a wide board then you might break a rune to get it out of the way before playing down your big creature. The rune mechanic and the use of lanes really set Legends apart, and give it the kind of strategic depth that Im looking for. Importantly, Legends also has a good selection of modes to back up its gameplay chops. Story mode acts very much as the games tutorial, introducing you to the mechanics and the many strategies youre likely to face. The presentation of the narrative is cheesy at best, but serves its purpose, giving you a reason to battle all manner of beasts, spirits, pirates and the like across 20 chapters. The rewards here make it well worth playing through too. The same is true of Solo Arena and VS Arena, which see you draft a deck of 30 cards then face off against nine opponents. Solo Arena battles will often tweak the rules, introducing new lane types or giving your opponent a starting advantage, whereas VS Arena battles obviously keep the playing field level (outside special events). After each victory youll get to pick another card  from a choice of three  allowing you to adjust your deck as you go. Solo Arena has nine tiers, so you start at rank 9 and with each nine win run you go up a tier. Both versions costs gold (or real money) to play, but theyre a great source of cards, packs, gold and soul gems for crafting. They offer quite a different challenge to one another too. In Solo your main focus is drafting an aggressive curve, whereas youll get crushed if you try and pull that off against a human in VS. In general Legends is pretty generous with its rewards for beating PVE content, playing Arena, doing dailies and levelling up your character, and if you put the time in each day you can amass a half-decent collection relatively quickly. This is not a game that withholds its legendary creatures, either  the drop rates seem reasonable and youre even given legendary cards as part of the levelling process. That said, there are a lot of epics and legendaries, and the fact that you can include three copies of most legendary cards (some are unique and thus can only be singletons) in a deck means its still a long road to build a cohesive collection - particularly if you want to play several archetypes. Trying to fast-track it winds up being really expensive too  buying packs in this game is not cheap, and crafting cards eats your precious precious soul gems at a furious rate. A typical reward for a nine win Solo Arena run. Of course, thats the balance that most free-to-play CCGs typically strike, so is not unique to Legends. Its also not unique to Legends that youll reach a point on the ranked ladder  part of the central Play mode that sees you climb from rank 12 to Legend - where your homebrew decks are much less effective, and you find yourself battling players with much deeper card collections. The good news is that  whether you dedicate the time and energy to grind out a collection, or you just bite the bullet and spend the money  once you move from homebrew decks to more refined lists, The Elder Scrolls: Legends hits a whole new level. This is because you can take better advantage of the synergies within and across attributes, and because, well, epic and legendary cards tend to have pretty cool effects. You can also rapidly improve your game because if youre playing meta decks you can read in-depth guides or learn from watching streamers or tournament players pilot them. Gaining a deep understanding of a CCG is hugely satisfying, and Legends seems to have what it takes in terms of gameplay and community to make spending the time worthwhile. Its worth pointing out, however, that its presentation isnt especially conducive to being innately fun to watch as a spectator. The upsides of being based on The Elder Scrolls are that Legends has a whole world of characters and events to tap into, and a large potential audience of series fans, but one major limitation is how the existing Elder Scrolls aesthetic fits into this genre. Where Hearthstone was able to take the already rounded, cartoony edges of World of Warcraft and make them even more colourful and comical, The Elder Scrolls starts in a place thats meant to be relatively believable high fantasy, and the result when brought across to Legends is ultimately less varied and characterful. Fans of The Elder Scrolls world and lore will likely warm to it quickly, but the card art is certainly less striking than some other games in the genre - despite being attractive. This overall design of the UI too, is functionally good, but not particularly alluring. The reality is that Hearthstone sets the gold standard for UI, visual design, sound design and the feel of playing, and this isnt even close. There are some suitably impressive animations for legendary creatures, however. That said, like Hearthstone, Legends iPad client is fully featured, good to use and stable. It obviously feels best to play on a PC, but I typically spend most of my CCG time on tablet, so its great to have that parity. About my only gripe with Legends on iPad is that deck-building is awkward  getting pop-up information for cards in your deck is clumsier than it should be. The Elder Scrolls: Legends may not be the most visually appealing CCG, but what it lacks in looks it makes up for in modes, mechanics and card design. This is well worth checking out for fans of The Elder Scrolls or digital card games in general. And like all great CCGs, the more you put into it, the more youll get out of it.", "date": "March 20, 2017"}