{"name": "Blaster Master Zero", "name_review": "Blaster Master Zero Review", "ref": "https://me.ign.com/en/blaster-master-zero/130693/review/blaster-master-zero-review", "text": "Blaster Master Zero is built upon the same offbeat premise of the 1988 original - a young boy, Jason, follows a frog through an interdimensional portal and winds up exploring a series of mutant-infested subworlds in an upgradable jumping tank. Its a pretty silly set up, but developer Inti Creates doesnt allow the paper-thin plot to stand in the way of a mostly fun Metroidvania-style exploration experience - even if the combat is surprisingly easy for a classic-style platformer. What distinguishes Blaster Master Zero from many other games of its type is the ability to switch control between the SOPHIA III tank and go on-foot as Jason. (Heavy Rain fans take note, you literally press X to Jason in this game). That creates several distinct types of gameplay, which gives Blaster Master Zero an uncommon variety. Jason is far more vulnerable than the more rugged SOPHIA III, not to mention prone to instant death when falling from even modest heights, but his more diminutive stature allows him to crawl through tunnels in the terrain in order to access switches and the like that are otherwise blocked off from the tank. Its in these side-scrolling hubworlds that I found Blaster Master Zero to be at its best, purely for how well it rewarded me for exploring it. Upgrades unlocked along the way, such as the ability to drive up walls and along ceilings or boost up to higher ledges, leant themselves to backtracking and discovering hidden areas and power-ups. Elsewhere, the distinct features of each of setting, such as the use of switches in the ice station to freeze and unfreeze pools of water in order to navigate to new areas, brought additional variety to how I traversed the world. Dotted around the eight main hubworlds are dungeon doors that can only be accessed by Jason. Once inside, Blaster Master Zero switches to a top-down shooter and Jason suddenly becomes an exponentially more powerful mutant hunter. Outside of the dungeons Jasons only weapon is a popgun of a blaster which makes every step he takes an exciting risk; inside them he has an arsenal of nine different blaster types plus upgradeable sub weapons that range from simple grenades at the start through to full-on airstrikes launched remotely by the SOPHIA III later on, making him a markedly overpowered one-man mutant extermination squad. In an attempt to balance out his power, Jasons blaster types have their own health bar of sorts; the more hits he takes the weaker the assortment of attacks at his disposal. Yet so many aspects of the dungeon areas are designed to keep Jason at his most devastating, to the point where most of Blaster Master Zeros combat presents almost zero challenge. Health and weapon pickups are plentiful and the majority of enemies can only fire vertically and horizontally, which means you can hang back and murder them diagonally from the safety of their blind spot. Its as though youre the only bloodthirsty bishop on a chessboard covered in dim-witted pawns. Certainly, it was rare in my eight-hour playthrough of Blaster Master Zero that I found myself without access to Jasons most powerful main attack, the Wave weapon. Firing three high-powered rounds simultaneously, its able to cut through walls that enemy fire cant penetrate, which meant for the most part I was able to kill everything in my path from a screens width away without ever being exposed to danger. It also brought a premature end to boss fights - Inti Creates may have choreographed some complex attack patterns for Blaster Master Zeros biggest nasties, but they neednt have bothered since the majority of them were dispatched in a frenzied few seconds worth of button spamming. Add to that the modern conveniences of generous checkpoints and unlimited lives, and Blaster Master Zero never offers an old-school level of adversity to match its charmingly chunky 8-bit aesthetic. Theres a certain level of satisfaction to be gained from slaughtering pixels left and right, but I would have preferred at least some resistance along the way. Since theres no option to increase difficulty or tackle a New Game+ mode after you complete the campaign, Switch owners after a meatier challenge served up in a retro skin would be better off picking up Shovel Knight: Treasure Trove. While its a shame that its dungeon dwelling enemies are far too easily exploited, Blaster Master Zero is ultimately an enjoyable reimagining of a largely overlooked 8-bit classic thanks to the rewarding exploration-focussed structure of its side-scrolling overworld. There are enough secret rooms and power-ups to seek out (including an additional ending), that I was compelled to scour every last inch over the course of my eight-hour completion time. Its a good reboot; just not a Masterful one.", "date": "March 16, 2017"}