{"name": "Neon White", "name_review": "Neon White Review", "ref": "https://me.ign.com/en/neon-white/199454/review/neon-white-review", "text": "A brash blend of lightning-quick platforming, fast and frantic combat, and a peculiar, card-based resource system, Neon White is a slick and special speedrunning FPS thats simple to understand but hard to put down. Think Doom Eternals platforming sections, only replace the grim hellscapes with the floating architecture of an abstract heaven and youre part of the way there. Add a little of Trials HD trying to ride the perfect route over the corpse of Mirrors Edge and youll be even closer. With its precise and elegant controls and its uncanny ability to make even an average shooter player feel lithe and lethal its extremely easy to get lured into Neon Whites loop, even if the story stitching it all together immediately overstays its welcome.Neon Whites oddball premise  which sees sinners plucked from purgatory to serve as parkour pest-exterminators, clearing out a demon infestation in heaven as part of an annual contest where the winner gets to remain there  certainly sounds interesting on paper. In practice, however, it makes a large portion of Neon White a young adult visual novel where a bunch of brightly-coloured, dead millennials reminisce about their past lives and argue a bunch. I do appreciate the effort to slow down and add context to the 12 chapters and 97 levels developer Angel Matrix has built here  rather than just machine-gunning them directly into our veins non-stop, that is  but overall Neon Whites slightly over-assertive blend of pop-punk Christianity and off-brand anime didnt grab me. You can fast-forward through it, but its always there.God SquadThis makes for a lot of chat to wade through outside of the otherwise impeccable puzzle platforming, delivered by a cast of goths, gym bros, and cloud-riding capsule toys that are as irritating as they are horny. Theres the titular White, a spindly-legged man who wears three belts  none of which appear connected to his trousers  and who likes to stand with his shoulders pulled back and his crotch thrust forward. Then theres Violet, a knife-wielding pixie with an infantilised voice thatd open a remote garage door, and who seems like the kind of woman whod dot the is on her ransom letters with love hearts. Theres also a cigar-chomping cat, a BDSM redhead in a collar, and a spiky-haired meathead. Its like the first page of a Deviantart search up in here.It's like the first page of a Deviantart search up in here.If this is exactly what youre after, youre in luck. For me, I honestly cant tell whether the dialogue is deliberately bad or accidentally bad  but I guess its probably immaterial, because theres no real difference in the end result.Repent, Repent, Repeat, RepeatDespite the fact there are vast slabs of this visual novel regularly wedged throughout Neon White, its a testament to the quality of the action itself that its well worth enduring. Inside the levels themselves Neon White takes on a completely separate identity, where the hokeyness is elbowed aside for some absolutely razor-sharp FPS action.Inside the levels themselves Neon White takes on a completely separate identity, where the hokeyness is elbowed aside for some absolutely razor-sharp FPS action.The objective? Kill all enemies and reach the exit as quickly as possible. The catch? Each level is a parkour puzzle, and reaching the end within the allotted time limits requires judicious juggling of the finite weapon and ability cards. Why are they cards? Other than allowing White to briefly look like an edgy street magician in the intro movie, I dont know  but it works. Each card grants White the limited use of a weapon, alongside the use of a one-time secondary ability. The pistol turns into a double-jump, the rifle a high-speed air-dash, and the machine gun a destructive grenade that doubles as a vertical boost. Shotguns turn White into a sailing fireball, rocket launchers become grappling hooks, and SMGs become devastating ground pounds.Using an ability to clear a gap, breach an obstacle, or destroy an enemy burns the card that granted it  but theres always another. The beauty of Neon White is that the precise assortment of cards youll need to nail a level is always there  its just up to you to gather and execute them all in the perfect spots. This ended up being a lot less intimidating than Id feared as theres a very well-considered visual language at work within Neon White. With sharp and simple graphics and very deliberate use of colour, Neon White usually makes it quite clear which direction you need to travel, the barriers you can smash, and the gaps you need to leap. Its remarkably intuitive, seeping its way into my brain before Id even realised it. There were definitely instances where Id find myself jumping into a void during a first run through a level and dying without a clear idea of where I was supposed to be headed, but these were exceptions.Neon White boasts not only a marvellous sense of momentum, but also a fantastic ability to flatter you. As a result, Neon White boasts not only a marvellous sense of momentum, but also a fantastic ability to flatter you. There were certainly many occasions during Neon White where I felt like the greatest dead parkour assassin in the universe; breathless moments where Id reached the end of a level and picked up my trophy by bounding and blasting by the seat of my pants, and playing the footage back felt like watching someone else playing. Someone much better than me. For an entirely unexceptional shooter player, Neon Whites capacity to make you feel like you look good playing it is a real credit.Better still, the faster you go, the more it encourages you to keep improving  first by giving you your own ghost to chase, and next by revealing new shortcuts to you. After mastering the moves I found myself searching for other hidden jumps and bits of level geometry that could be scaled or exploited. It hooks you into its just-one-more-try loop. Levels can take between 10 to 20 seconds to a few minutes, although the sweet spot seems to be around a minute-or-less. The longer levels and boss battles towards Neon Whites end do introduce a potent new card and some new traversal techniques, but I found these pretty tiresome on account of their punishing lengths. With no mid-level checkpoints by design (and extremely limited health) the longer levels are honestly just more frustrating than fun. Neon White is a quick and compulsive first-person platformer thats surprisingly simple to understand and play, but packs a very stern speedrunning challenge at its core. Tying your combat options to your traversal mechanics, Neon White makes every encounter a deadly parkour puzzle that can be replayed over and over, in search of the perfect run and the tightest time. The dialogue between its unlikeable troupe of angst-ridden, anime-inspired assassins may be a hokey misstep, but its airtight level design and fantastic sense of momentum ensure Neon Whites gameplay is something to celebrate.", "date": "July 5, 2022,"}