{"name": "Tom Clancy's Ghost Recon: Wildlands", "name_review": "Ghost Recon: Wildlands Review", "ref": "https://me.ign.com/en/ghost-recon-wildlands/130316/review/ghost-recon-wildlands-review", "text": "After 42 hours, 1,415 enemies, and 17,644 bullets, I have completed Ghost Recon: Wildlands campaign and hit the level cap. I also crashed some helicopters, which may or may not have led to the accidental deaths of my fellow IGN teammates. Thats classified. Wildlands map is, outside of MMOs, the largest Ive seen in a game in a long time. If you played the beta (6.8 million of you did), you were restricted to only one province; the final game includes more than 20 provinces, some smaller, some larger, all packed with things to do. Each area includes at least one Santa Blanca Cartel boss, hidden weapons and attachments, enemies to interrogate, fast-travel locations, skill points and resources, commendation medals, bases to raid, and more. If you want a game thatll keep you busy for a while, Wildlands absolutely has your back. Biomes aren't just eye candy; they have a major impact on how you play.No matter which part of the map you explore, Ubisofts in-game version of the South American country of Bolivia looks great. From the get-go, youre free to roam the entire map, which includes jungles, mountains, deserts, salt flats, lakes, swamps, quarries, and caves. These biomes arent just eye candy; they have a major impact on how you play. Areas thick with foliage are perfect for hit-and-run guerrilla warfare. Deserts have little or no cover, so fighting from range works well and having an escape vehicle ready is imperative. In the mountains, with a bit of leg work, you can usually hike to the high ground and assault your enemies from above. Wildlands leaves the strategy up to you, and because vehicles and fast travel points are so plentiful, the wide-open Bolivian landscape feels like a land of opportunity, not a burden. Speaking of vehicles, yes, the chatter is true: many of them dont control well. Even on a bone-dry dirt road, some cars and jeeps feel like theyre skidding around on slick ice. After 15 or so hours I was able to pilot anything without much trouble, but it took far too long to nail Wildlands feel. Choppers, in particular, take a while to break in: once youre cruising, youre good, but building up to that speed requires a weird dance of tipping the nose up and down and easing up on the throttle. And, because the map is so large, youre forced to spend a ton of time in vehicles to get to locations between fast-travel points. Also, its very common for high-priority targets to jump into a vehicle and flee, and if they get too far away youll often lose them and fail. These situations take an already uneven driving and piloting system and push it to its frustrating breaking point. Wildlands main issue, however, is poor mission variety. For the first five or so provinces everything felt exciting. The next 15? Not so much. Until I switched to playing co-op, it descended deeper and deeper into repetition. Flamethrower Guy, RPG Guy, and Guy With The Big Shield don't make an appearance.The cycle begins with a boss hunt. Each province has a boss, and to learn that boss identity and draw him/her/them out from hiding you need to complete four to six missions. Thats not a major ask, but the missions are usually a rote combination of the following: blow up an inanimate object (cocaine cache, equipment), extract and interrogate a high-value target (an assistant, a family member), steal or photograph something (a car, documents), or just kill some stuff. It doesnt help that enemy variety that stands between you and your objectives is almost non-existent. There are standard enemies, heavily-armored enemies, and snipers  thats about it. Even common video game mainstays like The Flamethrower Guy, The RPG Guy, and The Guy With The Big Shield dont make an appearance. Sometimes youll face other obstacles, like an enemy chopper or a jammer that keeps you from using your drone. They definitely crank up the intensity, but youll quickly learn how to deal with them, too. Even the variety that comes from the diverse locations isnt enough to mix it up. These issues might have doomed Wildlands if not for its highly satisfying sandbox antics. When youre a kid and you only have four action figures, what do you do with them? You fire up your imagination, go outside, and make your own ridiculous fun. The same goes for Wildlands. Yes, you may be on your umpteenth extraction mission... but this time, what if you throw your target in the trunk of a car instead of lifting him out by helicopter? That seems like a good idea, but before you can get into the drivers seat an enemy truck rams that car down a hill. Now youre running downhill to check on your VIP passenger, all while shouting at your friends to find a new escape vehicle. In the distance, you hear mortar fire. A second chopper is closing in. Then, maybe next time youre on an extraction mission enemies may take out your escape vehicle and youll have to run through the woods at night, holding your target by the neck and taking out pursuing enemies with only a pistol. Just when you think youre home free, youll get spotted. The chase continues. Yes, the missions are too similar in design. Youll undoubtedly feel the deja vu. But most of the time things dont go the way youd planned. The madness that ensues is what saves Wildlands, and what compelled me to keep playing well past the hours a human being should normally be awake. These are the moments I talk about when people ask me how Im liking it. Some of those moments are made memorable by the boss characters. Wildlands standard enemies may not be special, but it does a fine job of turning cartel bosses into more than just targets. None of them will join the pantheon of great video game villains, but in games like this, its often the case for underlings to simply feel like rungs on a ladder, something you just step on in order to move up. Middle-earth: Shadow of Mordor got around this issue by imbuing its minibosses with personality, and so does Wildlands. These characters are outlandish, unnerving, and pulpy. Remember when Walt and Jesse dissolved bodies in barrels of acid in Breaking Bad? One of the cartel bosses does that too, but he also has a beloved stuffed animal and the mental capacity of a child. Another boss duo of former doctors plays weird sex games while they torture and interrogate the cartels enemies. Its decidedly silly, and often more than a little bit on the nose, but they left a mark on me nonetheless. 12", "date": "March 9, 2017,"}