{"name": "Fire Emblem Heroes", "name_review": "Fire Emblem Heroes Review", "ref": "https://me.ign.com/en/fire-emblem-app/129336/review/fire-emblem-heroes-review", "text": "While playing Fire Emblem games like Awakening and Birthright, I always thought it was cool that you could recruit heroes from the past to help out in combat. Because these characters came as DLC add-ons they rarely interacted with the story directly, but knowing my favorite Swordmaster or Pegasus Knight from yesteryear was there to back up a younger generation of heroes felt reassuring. Now, developer Intelligent Systems has taken that auxiliary feature and built a free-to-play adventure around it in Fire Emblem: Heroes, and Im happy to report that for the most part it works. This iOS and Android spinoff is a simplistic but entertaining spin on the strategy RPG series that offers long-time fans something light to chew on in between last years Fates and next years still-untitled Fire Emblem for Nintendo Switch. Heroes dispenses with virtually all elaborate introduction (aside from the hilariously melodramatic opening movie) and gets right to the point: as a rare class of Summoner, youre charged with visiting individual Fire Emblem worlds in order to fight legendary warriors being controlled by an evil empire. In defeat, these heroes will be freed and aid you in saving other Fire Emblem characters. Thats about the long and short of it, with the story coming to an abrupt halt after nine chapters. The weapons triangle is easily the best part of Heroes. This type of ending isnt a huge surprise considering most mobile games roll out their stories over time, but I was still pretty bummed by the lack of resolution, especially coming off of Fire Emblem Fates much more engrossing tale of family and betrayal. It wasnt a deal-breaker though, and the joy of recruiting long-time favorites like Lucina and Lyn and pitting them against other fan favorites in exciting turn-based combat makes up for the lack of plot. Heroes is designed to provide a tapas-sized tactics session on the go, which means combat rarely lasts more than a few minutes at a time. Story Modes 45 bite-sized combat maps, which are based on familiar Fire Emblem locales like Hoshido and Nohr, are perfect for this: their beautifully rendered castle walls and pools of hot magma act as choke points that add welcome bits of challenge in increasingly creative ways. You can only take four units into battle at a time in Heroes, but I found smart positioning and playing close attention to enemy types made these tiny platoons effective in the same way it always has in a Fire Emblem game, especially when properly utilizing the super fun weapons triangle. This rock-paper-scissors mechanic is easily the best part of Heroes, and I spent nearly two dozen hours (which included plenty of level-grinding) giddily finding new ways to crush the enemy, smiling every time the stuffy Virion one-shotted a Pegasus Knight with an arrow or my uber-tank Sheena managed to absorb an enemys blows with her Buckler skill. That said, I was a bit crestfallen that the more in-depth mechanics of traditional Fire Emblem games, like weapons durability, permadeath, and unit pairing have been taken out of Heroes equation (permadeaths absence is especially strange since it robs harder difficulty modes of their excitement), but this more streamlined approach does make Heroes more accessible for on-the-go play. I had to do multiple rolls before acquiring anyone of value. Like in all RPGs, the key to victory lies in how powerful your characters are, and this is where Heroes somewhat intrusive gacha-style gambling mechanics come into play. Rather than asking units to join your ranks or taking them prisoner like in previous Fire Emblems, here you enlist them by spending magic orbs. Each champion is drawn from a pool, and then is randomly assigned a star rating that determines their strength. Unfortunately, the chances of drawing a high-ranking version of powerful warriors like Lucina or Marth are slim, which meant I had to do multiple rolls before finally acquiring anyone of value. Rolling for better options can be an expensive habit, as orbs are scarce and summoning a single hero costs five of them (though you get a slight discount if you summon multiple heroes at once). Since I also needed orbs to increase experience percentages through castle upgrades, regenerate fallen units (a common occurrence later in the story), and replenish stamina needed for missions, I began to resent having to pay a princely sum of in-game currency every time I wanted to enlist a new recruit into my ever-growing army. Of course, you can spend real currency to buy orb packs, starting at $1.99 for a three-pack, but after awhile this option started to hurt my wallet. Luckily, there are other ways to muscle-up your party members. Daily challenges allow you to try to recruit new party members for free, with the added incentive of merging duplicates together for higher stats should you already the character available that day. You can also earn experience points by level-grinding in a training tower and battling other players units in the Battle Arena. Both activities earn you a variety of useful items: crystal shards are useful for faster levelling, while feathers and badges unlock a units full skill potential and increase their star ranking. Of course, accessing these maps requires some sort of entry fee like stamina points, which limits how often you can do them, and because feathers and badges are somewhat hard to come by (you cant buy them), raising a characters star rating can become rather time consuming. Still, the gacha mechanics are never unfair, and youre rewarded with a few free items every day, which meant I never felt completely stuck as I bounced from map to map looking for ways to improve my ever-growing army. (I should add that Heroes requires an internet connection at all times, which means you'll need reliable Wi-Fi to play.) Fire Emblem Heroes is simplified, but certainly a good start when it comes to bringing the series beloved combat to phones and tablets. The flimsy story doesnt bring any new ideas to the table and the blind-item system can get frustrating when it refuses to give you a competent hero, but the fantastically fun battles and ability to reunite with old Fire Emblem friends from anywhere makes it worth the free download.", "date": "Feb. 8, 2017,"}