{"name": "Cuphead: The Delicious Last Course", "name_review": "Cuphead: The Delicious Last Course Review", "ref": "https://me.ign.com/en/cuphead-the-delicious-last-course-1/199348/review/cuphead-the-delicious-last-course-review", "text": "Despite what the title suggests, Cuphead: The Delicious Last Course is much more than just a fancy flan or fruit tart to top off the gourmet meal that was the original game. This is an expansion that certainly favors quality over quantity, consisting primarily of only six mainline boss fights, but theyre six incredible boss fights that each stand tall as some of the most fun, challenging, and visually jaw-dropping ones yet. Sweetening the pot are several new weapons, new charms that each add subtle new approaches to fighting bosses, some tantalizing secrets with worthwhile reward, and a brand new character in Ms. Chalice, who comes with several skills that take some of the edge off of Cupheads intense difficulty without outright feeling like an easy mode.. My first playthrough was over in just a few hours, but they were hours Id deem essential for any Cuphead fan. The Delicious Last Course is all about making Ms. Chalice, a character who appeared in the main game only as a super-move-granting spirit, a real living and breathing cup person. To that end, Cuphead and his pal Mugman head towards a brand new isle where theyre told that Chef Saltbaker, the greatest chef in the land, is able to create a Wondertart that can permanently grant Ms. Chalice a body. The catch, of course, is that they must collect its ingredients by defeating the powerful foes that are guarding them. The story obviously isnt the reason anyone is here, but its nonetheless charmingly told with quick cutscenes and more of the outstanding art that fans have come to expect. ... Some of the most spectacular 2D action-platformer bosses I've ever faced.Thus the stage is set for another round of some of the most spectacular 2D action-platformer bosses Ive ever faced. The content of The Delicious Last Course is accessible nearly right from the start of a new game, just after you clear the first mausoleum and meet Ms. Chalice for the first time  but if youre new or rusty, youll definitely want to get your feet wet with some other foes first as the six bosses in this DLC do not pull their punches.The very first one has you contending with projectiles in the air, spikes on the ground that force you to keep moving, shifting platforms that put you in danger if they raise you up at the wrong time, little gnomes that emerge from the floor to shoot more projectiles at you, and more gnomes that appear on the platforms and will hammer you if you stay on for too long. And thats just the first phase.While the mechanical difficulty of the bosses in The Delicious Last Course are cranked up, Studio MDHR is not without mercy. Theres of course still an easier difficulty, but there are also a number of new charms and weapons that help tip the scales back in your favor, including the one that lets you play as Ms. Chalice herself. When you play as Ms. Chalice, youre unable to equip any other charms, but she comes naturally equipped with a double jump, a dodge that she can use while on the ground to roll through obstacles, a dashing parry that makes it much easier to parry objects coming straight at you, and most crucially, four HP instead of the standard three. Some may look at that and think oh, so its essentially an extra easy mode, but thats not quite right. Ms. Chalice also has a much worse single jump than Cuphead, so she has to use her double jump in order to get over certain obstacles that Cuphead would easily be able to clear; her dash parry is great for objects coming straight towards her, but is harder to use than the traditional double jump parry in some situations; and shes unable to equip any of the other powerful charms that are available  like my new personal favorite, the heart ring, which rewards you with HP on your first, third, and sixth parries, essentially giving you the ability to double your HP if you can successfully parry a bosss attacks. Another powerful one is the Coffee charm, which passively refills your super meter alongside all of the normal ways to build it, meaning you get access to your super moves far more regularly. As for the new weapons, I'm a big fan of the homing weapon called the Crackshot, which can be fired without worrying too much about aiming and has a special EX move that drops a turret, which can then be parried and launched into an enemy for big damage. Another great new addition is the Converge shot, which fires three full-screen projectiles in a wide spread, and that spread can be constricted by holding down the aim button. Its a great weapon for quickly clearing out small weak enemies that get spawned by a boss, making it a perfect pairing for my usual go-to weapon, the Charge shot.To get the coins needed to afford these new weapons and charms, The Delicious Last Course introduces a replacement for the run-and-gun levels of the main game in the form of a series of mini bosses led by the King of Games. Early on in the DLC, youll be able to climb a ladder to reach the King of Games castle (which is a totally awesome hand-sculpted stop motion model, by the way), and from there youre free to challenge his champions. The catch is that each of these chess piece themed mini-boss fights arent won with your weapons or charms  theyre won entirely with your parry technique. One fight requires you to parry all of the tops of an army of pawns, while another requires you to blow out a bunch of candles in order to make the boss damageable with a parry. Theyre all clever fights, and tackling them is a fun change of pace and a unique challenge, especially when you try the gauntlet mode and attempt to beat them all in a single life. More than anything though, its certainly a step up over the run-and-gun levels when it comes to earning the currency needed to purchase new equipment.Everything else in The Delicious Last Course is what youd expect from Cuphead, but taken to an even greater degree. Studio MDHRs Maja Moldenhauer has stated that the animation frame count in this DLC alone is comparable to the entire core game, which sounded crazy to even think about before playing  but now that I have, its not a hard thing to believe. Every phase of every boss in The Delicious Last Course totally transforms the battle. Youll go from fighting an ice magician to a diabolical refrigerator to a deranged snowflake all over the course of one fight, with each phase having anywhere from three to seven unique attacks, and each attack being so absurdly packed with detail that I didn't even notice most of the smaller bits until I recorded and watched back my footage. That includes things like the way those gnomes climb up the side of the mountain and scootch under the fur, the way the background subtly changes during every phase of the fight against Sheriff Winchester, or the way the aforementioned deranged snowflake literally wrings its own body to pop out its eye for one of its attacks.Every attack is exceptionally well telegraphed The magic of Cupheads boss design, and something that all of the bosses in this DLC exemplify, is that while it throws a ton of stuff at you, everything is generally pretty easy to avoid if you know it's coming. Every attack is exceptionally well telegraphed, patterns are easily recognizable, and the visual language is always simple and clear. So even if I was expected to do something thats not normally very intuitive, like parrying a pink bell to close the mouth of a cow skull floating in acid in order to create a platform, its something that I can quickly pick up on because I had already been taught to parry pink objects before now. The Delicious Last Course skillfully nails that hard to hit balance of being tough but fair, and saves the truly difficult stuff for expert mode, which provides a very worthwhile challenge for hardcore fans once the main campaign is completed. And for those that want even more of a challenge, well theres something for you too, but I wouldnt want to spoil what it is or how to get it. Cuphead: The Delicious Last Course is the perfect send off for a game that embodies the phrase one of a kind. Experienced players will likely muscle their way through the six bosses and optional King of Games minibosses in just a handful of hours, but the quality of those hours far outweighs their quantity. All of the bosses, including the King of Games minibosses, are among the best in the whole game, and thats saying a lot when you consider how high the bar was already set. Im not normally one for dessert, but if you dine on Cuphead, you dont want to miss The Delicious Last Course.", "date": "June 30, 2022,"}