{"name": "Resident Evil 7", "name_review": "Resident Evil 7: Biohazard Review", "ref": "https://me.ign.com/en/resident-evil-7/128686/review/resident-evil-7-biohazard-review", "text": "Resident Evil 7 takes some big risks with the long-running horror series. But even as some succeed and others fall flat, this new first-person take on the formula wisely remembers that its survival-horror adventure  composed of tense exploration and careful item-hunting  and not solely its action that made its early predecessors memorable. With one of the creepiest single settings since the Spencer Mansion and an enticingly bizarre mystery to unravel, this is the most fun Ive had with a Resident Evil game in years. The atmosphere in Resident Evil 7 is the strongest the series has seen in a long time, and thats owed entirely to the eerie Dulvey plantation, to which the player character Ethan has been summoned by a cryptic email from his missing wife. If classic Resident Evil games were rooted in the zombie films of George A. Romero, this is Resident Evil in the tradition of The Texas Chainsaw Massacre, with all the gruesome imagery, dilapidated old shacks, and cannibalistic horrors that come with it. Resident Evil 7's change in style and setting never fails to deliver a strong sense of place. Sometimes that makes for an interesting backdrop, especially as you begin to trace the residents of the Dulvey Mansions descent into savagery and uncover the way its manifested in their domestic life. Traces of humanity arent hard to find behind all the locked doors: old photographs, trophies for academic achievement, a discarded football helmet. Compared to the cold, medieval interior of the still-beloved Spencer Mansion, the Baker household actually feels like a lived-in space rather than a grandiose maze of traps and hidden laboratories, which is an interesting and more intimate change of scenery that focuses on something that the series has never fully explored before. Other times, Resident Evil 7s roots in hillbilly horror relies too heavily on overplayed tropes about rural America and begins to border on the cartoonish. The Bakers are disgusting, dysfunctional, and at times pretty laughable, but most of this is at least explained later on, which  without spoilers  satisfactorily avoids putting the blame entirely on their rural upbringing. But even with its faults, Resident Evil 7s change in style and setting never fails to deliver a strong sense of place that makes frequent exploration and backtracking through the dingy Dulvey property and its secret underground lairs work without wearing out its welcome. Puzzles are disappointingly rare and far too simple. The settings only real failing is its puzzles, which were disappointingly rare and far too simple. Rather than hiding codes and passwords behind riddles or forcing some kind of threat or fail state on me if I entered in an incorrect solution as previous games have (think of the Armor Room puzzle from the first Resident Evil), Resident Evil 7 doesnt even seem to try to make its obstructions interesting or challenging. I felt like I simply stumbled upon answers more than I did employed any kind of real problem-solving to get there. On more than one occasion, the solution to a problem was handed to me before I really felt like I was given the chance to start investigating it. In one area that required me to open up a wall panel that housed a secret room, a childs drawing just a foot or two away from the wall panel in question circled exactly where I needed to look to find it. A more subtle approach that let me investigate the room on my own accord would have greatly improved scenarios like this one, especially because the first-person perspective lets you take a more detailed look at your surroundings than the traditional third-person view of other Resident Evil games does. Fighting Evil The Baker family, like unstoppable tyrants with unpleasant personalities, are among the first enemies youll encounter, and theyre by far the most interesting. The first fight with Jack Baker had me both laughing hysterically and scrambling frantically for a way to defend myself, a winning combination that made the unpredictable encounter one of Resident Evil 7s highlights. Jacks patrolling of the mansion  at one point even bursting through a wall, Mr. X-style  actually felt like a real threat, even after I was armed with more than a knife. To survive, I needed to either flee or fend him off by unloading my handgun on him, which is a decision that can come back to haunt you. Resident Evil 7 has no hiding or heavily stealth-focused gameplay, contrary to what its first-person horror style might lead some to believe. Its still a Resident Evil game, and you still need to shoot enemies to kill them or else theyll continue to roam around where you left them, waiting to kill you the next time you backtrack on by. Only this time, you cant rely on the safety of load screen doors to keep baddies out, which only ups the tension when low health or low ammo means you do need to just make an escape. Better get really good at closing doors behind you, because not even safe rooms are safe anymore. A wider variety of new enemies and situations to face them in would have made it a lot scarier. But while the Bakers are the best enemies, theres an extremely wide gap in quality between them and the only other prominent enemy type in Resident Evil 7. Throughout my roughly 10-hour journey, just about the only other enemy type I encountered were hulking, oil-black creatures called The Molded. They come in a few varieties: the standard Molded; the ones with a giant, warped arm reminiscent of classic tyrant designs; ones that crawl around; and heavyset ones that vomit acid. (There are also bugs in one area, but they serve more as obstacles to overcome than hostiles with distinct behaviors.) While visually repulsive and threatening enough to cause more than a couple of tense combat encounters, The Molded lost their ability to shock me very quickly  especially because the scenarios in which you encounter them are all so similar. I was glad to see micromanagement make a comeback. When I think of my favorite Resident Evil moments from past games, two come to mind: the first time Hunters appear in the original and 2002 remake of Resident Evil, and the first time you encounter a Crimson Head in the wild. What made these moments good was their unpredictability  you had no idea what you were about to face after that first-person sequence marking the Hunters arrival, and seeing a dead zombie youve passed by a dozen times already suddenly leap to life  and then a second time, even stronger  was something horrifyingly new. Resident Evil 7 could have used more moments like this, but it does far too much signaling ahead of everything it does. The Molded tear themselves out of the wall with a distinctly slimy sound, and they only do so in areas overtaken by mounds of black mold. So even when there are opportunities for them to at least deliver a jump scare, youll be anticipating it at the first sight of a molded wall. (Though there is one moment where one of the crawlers burst through a wall in an area that I had already passed by a few times, so props to that guy.) Most of Resident Evil 7s tension comes from finding yourself in tough situations and struggling to adapt, since its all about scavenging for items and conserving what little ammunition and resources you do have. (In other words, classic Resident Evil style.) With limited inventory space and a familiar reliance on item boxes to manage your belongings, I found that constantly storing small amounts of handgun and shotgun ammo as I found it, granting myself a safety net of health-restoring green herbs, and keeping psychostimulants handy for tracking down well-hidden items was a welcome layer of micromanagement on top of every larger objective. Im happy to see that core Resident Evil idea make a comeback in 7. But being forced to change up my survival tactics in the face of new, unpredictable enemies and situations throughout the campaign would have made the experience a lot scarier. 12", "date": "Jan. 23, 2017,"}