{"name": "PUBG Mobile", "name_review": "PUBG Mobile Review", "ref": "https://me.ign.com/en/pubg-mobile/145509/review/pubg-mobile-review", "text": "If youd said a month ago that PUBG Mobile would run better than PUBG on Xbox, and that itd be free, youd have gotten a lot of strange looks. Yet here we are, and mobile gamings future has never looked brighter. Its absolutely remarkable that it runs so well and manages to fit all of PUBGs features onto tiny touch-screen displays. Make no mistake: this is the real PUBG experience. One hundred people hunched over their Android or iOS phones and tablets fly over a deserted island and skydive down from a plane to loot abandoned buildings, gather up resources, and duke it out until theres only one person left standing. The first time you drop onto a map and see all of the island of Erangel sprawled out before you in real-time, on your phone, is a surreal experience. While the mobile version only has the original map available, its otherwise about as close to the PC iteration as could be hoped for in terms of performance. In fact, its somehow significantly better than the Xbox version from a technical standpoint. Textures are nicer, the framerate is more stable, and it hasnt crashed. While it may not have crossplay support with PC and console (like Fortnite Battle Royale Mobile), that just means that theres no danger of opting into a lopsided match against people playing with more accurate controls. However, it would have been nice to at least carry over account customization items at least. Overall it feels a bit better than other mobile shooters.But of course, this is a multiplayer shooter, and this kind of game doesnt have a great track record with touchscreen controls. Overall it feels a bit better than other mobile shooters, but still not that great. You can easily move around using the joystick, rotating the camera by dragging your right thumb across the screen, and there are on-screen buttons for things like opening your backpack, crouching, going prone, and even jumping. When a guns equipped, buttons pop up for aiming down the sights or through the scope, and you can fire with either thumb. But doing them all at the same time is pretty cumbersome. After spotting someone, you typically have a second or two to line up your shot, which is tough, and if you miss youll need to swipe your thumb to rotate and line up the shot again, making it hard to quickly line up shots. After playing a few matches I started to get used to the controls, even if theyre nowhere near as sharp. But PUBG Mobile isnt supposed to be better than the other versions, it just feels like a nice way to play the same game anywhere at any time. For example, you shoot by tapping on-screen buttons, but those buttons just so happen to be in a spot where youll often drag your thumb across. When that happens youll accidentally fire off shots, which not only wastes precious bullets but alerts enemies to your position. Its a little cumbersome to loot non-essential items and swap healing items, too. I found that I played PUBG Mobile very differently from how I play on PC and console. On the tied-down systems, its beneficial to take your time slowly moving across the map, hiding behind trees and creeping through houses to avoid detection. But on mobile, I busted into areas guns blazing with a much greater degree of confidence in my abilities. It appears as though the vast majority of players struggle to aim right now, though its unclear if thats a general lack of skill or because some of them are actually easy-to-kill bots in the lower levels of matchmaking. Developer Tencent took a few liberties to compensate for the controls by automating some simple tasks. When you walk over a gun, for instance, your character automatically equips, loads, and switches the gun to autofire. If you walk over ammo for a gun you have, youll pick it up right away. The same goes for health items, unequipped attachments, and armor. And theres even a visual indicator on the map and sometimes minimap showing which direction shots are coming from, in case youre playing without good headphones. Theres a line on the main map showing the planes path at the start of matches, too. Since this is a mobile game, I initially went into it expecting some minor pay-to-win elements or gratuitous ad placement that would be hard to look past. But even almost a week after launch, you cant buy any items that give you an advantage and I dont recall seeing many ads at all. The mobile version has a few more progression mechanics in place that bring it up to speed with most other mobile games, such as refreshing Seasons to work toward timed rewards, you get daily login bonuses, there are objective-based event rewards, and you can connect your profile to Facebook to find friends quickly. More than anything else, the portability and accessibility of PUBG Mobile more than make up for its limitations. Being able to pull your phone out of your pocket and drop into the tense battle at any time is a remarkable technical achievement. PUBG Mobile is a remarkable technical achievement and deserves commendation for being a fully playable, feature-packed, and stable iteration of a demanding PC and console game. Touchscreen controls can be finicky and it will never be as accurate as playing with a mouse or gamepad on a PC or console, but the portability and accessibility of PUBG Mobile more than make up for it.", "date": "March 24, 2018"}