{"name": "The Walking Dead Season 3 Episode 1", "name_review": "The Walking Dead - A New Frontier Episode 1 Review", "ref": "https://me.ign.com/en/the-walking-dead-season-3-episode-1/127792/review/the-walking-dead-a-new-frontier-episode-1-review", "text": "Both a continuation of the last two seasons and, as its name suggests, a fresh chapter in Telltales ongoing saga, The Walking Dead: The Telltale Series - A New Frontier kicks off with a tightly paced, engaging premiere episode that has me excited for what lies ahead this season. Ties That Bind Part I is not a complete departure from what made previous seasons work, but it does feel like an attempt to correct some of the series wrongs; and so far, its succeeding. Episode 1 starts off with on just the right note by introducing a new playable protagonist, Javi, in one of the series best-directed sequences. Set during the initial zombie outbreak, the opening sequence plays out like a tense, well-shot indie horror film, with stylish editing and directing that delivers substance (in the form of Javis family) to match. A New Frontier doesnt want to do away with what a longtime player like myself loved from the last two seasons  namely, Clementines continued character development  but the premiere smartly establishes Javis band of survivors before returning to the familiar baseball hat-wearing protagonist. Skipping years ahead, Javi is working to keep the remnants of his family together, alongside his brothers ex-wife Kate and two kids. The idea of family as one born out of circumstance has certainly been part of Telltales corner of The Walking Dead universe since its inception, but Javis situation differs greatly from that of Lee and Clems in season 1 and then Clementines options in season 2. I found myself invested in building out Javi and Kates relationship, even knowing the troubled past it likely comes saddled with, while also molding Javi into a source of light in this dark world, and this episode allowed me to shape him that way. I wanted to make my Javi a source of light in this dark world, and this episode allowed me to shape him that way.He is unfortunately saddled with a clichd whiny teenager, but for the most part my desire to make Javi a beacon of hope, particularly when it came to his interactions with Kate and Mariana, the daughter of Javis brother, had me being just as thoughtful about my dialogue choices as I ever have been in a Telltale game. Naturally, trouble finds Javi and his family very quickly, and Clementines unexpected and amusing introduction not only offers some semblance of comfort after the familys search for supplies falls apart but also further opens up this new pocket of the walker-infested world. As Clementine introduces Javi to a new group of survivors in a safe haven, I appreciated seeing the choices I made in Clems earlier years defining the woman shes growing into now. Telltale has implemented a system to allow you to import saves from previous seasons, recreate choices, or start as if you dont have a clue who Clementine is when launching A New Frontier. Aside from the appreciated ease of the recreation system  a short questionnaire about key moments from seasons 1 and 2  its gratifying to see a matured version of the Clementine I helped establish in one playthrough while noticing the slight changes to her interactions in another. Ties That Bind - Part I doesnt handle her backstory as deftly as Javis, however, with a flashback scene that feels unnecessary other than as a symbol of more Clementine revelations to come in further flashbacks. But Clementines return, as well as the way she brings Javi into a wider world of survivors, is very much a welcome one. And as its title suggests, the season premiere is very much the first half of a whole, leaving things on a powerfully affecting cliffhanger that actually left me shouting out a cry of No! as it concluded. Episodes land on shocking twists all the time, yes, but the premiere is very much about shaping Javi from the man we first meet to the fearless leader, compassionate family man, bitter survivor, or whoever each of us chooses to make him (within Telltales bounds). Without spoiling a thing, Part II forces Javi to reckon with the premieres events and us as the player to decide what matters to our take on Javi. Read the Walking Dead: A New Frontier Episode 2 review. I dont have a clear sense of where the season as a whole aims to go just yet, but Ties That Bind Part I is one of Telltales strongest openers in recent memory. Scenes feel carefully constructed in their camera direction and editing, and Telltale avoids the pitfalls of its most egregious past issues  only one environmental exploration sequence temporarily slows things down  but for the most part the episode moves along at an exceptional clip. But thats not just thanks to Part Is style. Smart characterization and writing for Javi and his family, plus the return of Clementine, add weight to a largely unfamiliar but already engaging new frontier that I cant wait to continue to explore.", "date": "Dec. 20, 2016,"}