{"name": "Pokemon Sun and Moon Version", "name_review": "Pokemon Sun and Moon Review", "ref": "https://me.ign.com/en/pokemon-sun-version/126729/review/pokemon-sun-and-moon-review", "text": "Like re-reading a favorite book in an unfamiliar place, Pokemon Sun and Moon combine a lot of my favorite things about Pokemon into an adventure that reminded me why I fell in love with this RPG series in the first place without simply repeating what came before. With equal attention given to roleplaying (my first obsession) and battle (my more recent interest), Sun and Moon both honor the 20-year legacy of Pokemon and improve upon it in a number of ways, making for a surprising and engaging tropical adventure that is as much about the journey as it is the destination. Arguably the biggest and most important change in Pokemon Sun and Moon is the Island Challenge in its new setting, Alola. Instead of taking on a series of gyms as weve done many times before, you embark on a variety of battles and non-combat challenges, such as scavenger hunts and quizzes, that culminate in a fight against a stronger foe. One trial sent me on a hunt for ingredients so we could attract a local Pokemon with a traditional meal, while another involved memorizing luau-esque dances atop a volcano. Its similar enough to previous Pokemon games to avoid alienating veterans but also an inventive take on the formula that fits with and plays off of the island setting beautifully. Bringing the challenges out into the world, rather than keeping each step toward becoming a champion segmented in its own gym, helped Alola feel more like a place where things happen instead of an overworld map. It also kept the Island Challenge from becoming mindless  I couldnt autopilot my way through it like I could with a lot of X and Y, for example. I didnt always know when or where a trial would start or what exactly would happen when I got there, and that kept me on my toes, frequently fine-tuning my team and trying out a lot more Pokemon than I usually do during an initial run. The themed minigames also kept each trial surprising until I reached the final fight. The Island Challenge is a welcome change from traditional, run-of-the-mill gyms. The trials are a good way to get to know the charming captains that run them and learn about the history and traditions of Alola  even on the first island, Id heard bits and pieces about the elusive guardian Deity Pokemon and come to understand the trials purpose in the local legends surrounding them. After two trials, I was as fully invested in the new region as I was with my familiar quest to become the champion. The reward for completing a trial is a Z-Crystal, an item which allows the Pokemon holding it to attack with an extra-strong ultimate move once per battle. Its Alolas take on Mega Evolutions, designed to add something to the familiar mix of battle, and I have yet to see past its novelty. I didnt really need to use these Z-Moves during my Island Challenge (though part of that was wanting a bit more flexibility with difficulty, which Pokemon has always been good at granting by making these things optional). Theyre kind of cool to have as a panic button in a tough battle, so Im interested to see if theyll be allowed in official competitive matches and how they might shake things up. A Whole New World Alola is the most inspired region in Pokemon so far, and that made exploring it fun and rewarding. Instead of just looking for items or places to grind, I was taught to expect the unexpected. Alola is based on Hawaii, and from the smaller, quieter island you call home to another with a luxurious resort and a volcano, each of the four main islands has its own feel. I definitely didnt think Id find myself in an Old West-style ranch town, for example, and was delighted as I walked through it. It doesnt feel out of place, though, since its where the new horse Pokemon, Mudsdale, is kept for riders looking to traverse rocky trails  which Id need later on. Alola is the most inspired region in Pokemon so far. Among the surprises, there are a lot of details in Alola that nail the tropical theme and fit well. The Alola forms of first-generation Pokemon, like the more colorful Grimer and the infamously tall Exeggutor, for example, are smart changes that are in sync with the ecology of the islands. They also work well with the strong roster of new Pokemon features interesting type combinations with some pretty good stat spread options, and Im excited to see how they work their way into the competitive scene. Ive happily added quite a few to my team, like Charjabug, a tankier take on the electric/bug typing previously belonging only to the more fragile Joltik and Galvantula. The music, too, is island-inspired (and, in some cases, based on other Pokemon regions) and reimagines a lot of the original music, including the battle theme, quite well. Places, people, and Pokemon that connect even in subtle ways make Sun and Moon more engaging. Victory Road to Hana The 30-plus-hour story of the Sun and Moon adventure also contributes to that vibrant world-building. Its the first Pokemon game in a while that kept me focused on the journey and discovery, rather than setting my sights on the post-game and grinding until I reached it. Thats not to say that the plot is compelling on its own  its a fine story for a Pokemon game, but its plagued by awkward dialogue on the part of Team Skull and some predictable events. There are times when it pokes fun at itself for its sillier parts, and I appreciated that even when I wasnt as excited about a scene. But theres a general mystery to Alola that serves as a carrot drawing you forward, and as a result those story pitfalls take a back seat to let Alola and its inhabitants speak for themselves. Even the slower scenes are made better with vastly improved camera work  learning about how Pokemon battles work for the thousandth time is less boring when the conversation looks almost like an anime rather than static frames, and the characters are more expressive than in any previous game. And almost everything from the new Alola forms of first-generation Pokemon (like Marowak, which went from ground-type to a fire-ghost wielding a flaming bone club) to the Island Challenge in general is different enough from what Im used to as a lifelong player, in that they feel like fresh discoveries. What's Old Is New Again Sun and Moon are also approachable for new or rusty players thanks to a streamlined battle interface. The move-selection screen now has way more detail at a glance, including information about what the moves do if you forget. Move effectiveness is also displayed, which means its a lot easier to battle effectively without having the type matchups memorized. Its a good way to learn the nuances of battle, and its not cluttered or obtrusive if you do know your way around the type chart. For me, it was especially helpful in quickly learning the strengths and weaknesses of new Alola Pokemon  and they grew on me faster, too. The new interface is one of quite a few upgrades that add up to a great improvement. The bloated HM system has been replaced with Poke Ride, which opens up Alola to exploration early on. Its a seriously important change that frees up your party for the interesting new Pokemon (my favorite being the ghost/fairy Mimikyu, who dresses up in a Pikachu costume because its lonely and wants friends), and theres a much wider variety of Pokemon available at the start than in previous generations, too. Having access to ghost-type Pokemon right away made the early team-building process a lot more fun than in the days of being surrounded by rodents, bugs, and birds for three routes. Upgrades both big and a bit smaller add up to a great improvement. There are even small upgrades to more recent additions to Pokemon, and though theyre less noticeable, theyre welcome. Pokemon Refresh is a slightly altered version of X and Ys Pokemon Amie that serves more of a tangible purpose in healing status conditions after battle. Trading with and battling real-life players is similar to the previous generation, complete with one of my favorite features, Wonder Trade, but with a festival-themed site as the base of operations and a variety of item rewards for engaging in multiplayer. Theres also a cool new minigame-style feature called Poke Pelago in which you upgrade a series of small personal islands, one of which makes the tedium of hatching eggs easier (finally) while another works like Super Training. As an avid Pokemon player, the littlest additions did a lot to make doing the things that are still the same in Sun and Moon better this time around. After 20 years of slow but steady evolution, Pokemon gets a bit of a reinvention in Sun and Moon. An engrossing and rich new region makes the Alola journey  along with all the changes Sun and Moon make to the existing formula  enjoyable throughout the main adventure, and small interface and variety of upgrades along the way make a few of the things that stayed the same feel better than before.", "date": "Nov. 15, 2016,"}