{"name": "Outriders Worldslayer", "name_review": "Outriders Worldslayer Review", "ref": "https://me.ign.com/en/outriders-worldslayer/199220/review/outriders-worldslayer-review", "text": "Ever since Outriders released early last year, Ive held a theory that it's the ultimate fast food game: a bland story filled with cheesy one-liners and mindless encounters that you know arent good for you, but undeniably awesome combat thats easy for you and your friends to lose hours in just makes it so dang tasty. In that context, if the base game was a Big Mac, then the latest expansion, Worldslayer, is that one sandwich from KFC where the bread is replaced by fried chicken. With a fine-tuned combat sandbox, expanded build-crafting options, and a drastically upgraded endgame, Worldslayer improves upon a lot of what was already great about the original, but it also doubles down on many of its shortcomings. That includes another weak story, annoying boss fights, and an overall lack of stuff to do. The result is a fleeting evolution of its spacemagic mayhem, but one thats still entertaining enough to leave me feeling good about making a return trip to Enoch.Like the vanilla campaign, Worldslayers borderline incoherent story takes place on an alien world where you play as a magical soldier called an Outrider, complete with a stupid sci-fi haircut and some of the cringiest dialogue in all the cosmos. The same mysterious anomaly that gave your character powers now threatens to destroy the entire planet, plus theres a new scary lady that wants to kill everyone, and yadda yadda yadda  now youve gotta murder thousands of people and animals in the name of all thats good.What We Said About Outriders~Outriders offers some genuinely great sci-fi action, alongside some really interesting world and creature design that I'd love to see more of. Its mostly satisfying take on RPG loot progression is well worth putting up with a lackluster story, a few clunky interfaces, and some lingering technical issues. Outriders is the good kind of grind - especially if you're into goo-ifying your enemies with a couple of friends.~ - Jon Ryan, April 16, 2021Score: 7Read the full Outriders review.It isnt exactly high art, and the morbid curiosity that kept me following along meant I frequently found myself to be the one holdout in my group who didnt vote to skip most cutscenes. That said, the story does actually answer some key questions I had after the main game and, crucially, addresses the ECA/Insurgency civil war that was left unresolved in the base campaign. Its just unfortunate that a sci-fi world with this much potential is bogged down by bad dialogue and vague cutscenes that feel like theyre rushing through the beats to minimize the amount of time spent not killing things.After roughly seven short hours thats mostly mindlessly killing waves upon waves of enemies, youll wrap up the core Worldslayer campaign in a pretty disappointing fashion. Having defeated enemies you hardly had a chance to meet, made new allies that speak mostly in cryptic riddles, and saved bland characters from an early death, youll walk off into whatever the Enoch equivalent of a sunset is to advance towards the equally indecipherable endgame story. The story falls comically short, but combat picks up the slack.But while the plot falls comically short of pushing you toward the action, the satisfying-as-heck combat picks up the slack in a big way. Whether youre pulling off insane DPS as the ninja-like Trickster or Hulk-smashing groups of enemies as the unstoppable Devastator, turning whole groups of enemies into bright red giblets hits all the right notes. Automatic shotguns tear through and dismember people at short range, submachine guns apply nonstop pressure on waves of enemies, sniper rifles allow you to cover your friends from afar, and running and gunning with a crew just feels so darn good  not to mention all the wonderfully over-the-top space magic you can use.While all of that was true with the base Outriders package, Worldslayer significantly improves the sandbox with more weapons and armor, and importantly, Apocalypse items that grant an additional mod slot which opens up a whole bunch of new possibilities. Now youve got a potential for 50% more ways to grab new perks that synergize with your build on every slot of your inventory, and that allows for some insane stunts. In my Trickster build, I managed to equip a full set of mods that made me a nightmare against large groups of enemies, where damaging one poor soul meant damaging everyone in the vicinity. In another build, I made all my equipment either apply freeze or increase damage against frozen enemies, which left the baddies hilariously helpless against me.The one major exception to the otherwise excellent combat is that, as was true with the base game, fighting bosses is usually not a good time at all. Where Outriders generally makes you feel like a complete badass, boss fights pit you against an enemy with a health bar a mile long that youve gotta shoot at for several centuries before they finally die. Meanwhile youre spinning your wheels spamming abilities and killing adds while you wait for the bad guy to eventually drop dead. It just goes on for so long and makes you feel like a complete wimp in the process  plus its got that classic game problem where the boss only has a few voice lines they repeatedly scream at you the whole time, and that gets old really fast.On top of the new weapon and armor options are some endgame progression systems like Pax Points, which are used in an advanced skill tree that lets you pick five new, uber-powerful perks, and Ascension Points, a slow-burning progression system that reminds me of Diablo 3s Paragon system and allows you to make small, incremental improvements the longer you play. These systems not only give you plenty of reasons to continue beyond the first campaign playthrough, but also offer some serious game-changer abilities. For example, one standout power caused critical hits with weapons to make my Anomaly powers more deadly, while using Anomaly powers made my weapons do significantly more damage. Working my build around these abilities made my character feel more powerful than Ive ever felt in Outriders, which is no small task.The endgame fights are some of the best in Outriders so far.These new progression systems give you the perfect opportunity to put them to the ultimate test in Worldslayers endgame, which centers around a dungeon-delving activity called The Trial of Tarya Gratar. This challenging activity is a dungeon in three acts, with an aforementioned bullet sponge of a boss to fight at the end of each act and some smaller battles along the way. There are also branching paths that give you multiple ways to get through it and even offer some optional encounters that can be tackled to target-farm certain pieces of equipment  a godsend for those really looking to grind this endgame.The actual content in The Trial isnt terribly different from what you get during the regular Worldslayer campaign, with waves of enemies to defeat and loot to claim along the way, although its much more difficult than everything else and can be scaled to your level to be near-limitlessly daunting. If you were hoping for a procedurally-generated dungeon thats different each time you enter though, youll be sad to learn that The Trial is essentially the same every run, with only your chosen path leading you to different encounters. Thats a bit disappointing in terms of replayability, but the good news is the encounters baked into it are some of the best in Outriders so far.My favorite encounter is the second boss fight, which features a floating monster that isnt a complete bullet sponge and instead requires you to deactivate his invulnerability shield before he can be damaged. Taking on waves of adds while quickly performing a ritual to make the boss damageable before he begins casting deadly spells is an absolute thrill, and it made me annoyed that every other boss fight just amounted to staying alive for a very long time while you slowly whittle down their health. Hopefully theyll do more boss fights like that one in the future, because it makes all the others look downright awful by comparison.Another interesting part of the post-campaign content is that it continues the (still bad) story, which was an unexpected but welcome surprise since plenty of similar games dont even bother trying to tie a story into the endgame  including the base Outriders campaign. Unfortunately, without going into spoilers, the main issue with all this new story content is that your character has almost no role in it. You arent really the protagonist, and as a result you feel like a bystander in a story thats happening around you, or in many cases youre getting history lessons on stuff thats already happened that has little to no impact on what youre doing moment-to-moment. This all culminates in the expansions anticlimactic final plot points during the endgame, where the twists seem to have very little bearing on anything. Its great that theyre trying to weave the story into the grind  I just wish that story was better than what we got. Outriders Worldslayer is an enjoyable but unambitious expansion that improves the endgame while falling short in many of the same areas as the base game before it. The story is still pretty lackluster, most boss fights are irritating slogs, and even with the added endgame grind there isnt a ton of content to chew on, but most of whats been added is at least a ton of fun. The improved options with Pax Points, Ascension Points, and Apocalypse items are a stat-obsessed players dream and had me tweaking my build for maximum devastation, and the Trial of Tarya Gratar endgame dungeon is challenging and memorable if also a bit repetitive. Still, getting another chance to run amok on Enoch was time well spent.", "date": "June 27, 2022,"}