{"name": "Ashes of the Singularity: Escalation", "name_review": "Ashes of the Singularity: Escalation Review", "ref": "https://me.ign.com/en/ashes-of-the-singularity-escalation/126536/review/ashes-of-the-singularity-escalation-review", "text": "As a stand-alone expansion, Ashes of the Singularity: Escalation takes Ashes of the Singularity, which is a pretty good, high-level real-time strategy game in the vein of Supreme Commander that never quite clicked and turns it into something great. Additions to the campaign, unit roster, and environmental detail prove an undeniable improvement over the original Ashes, even if some minor issues still remain. Unit variety in Ashes huge armies has increased a fair bit, with notably welcome additions in the realm of heavy aircraft (basically flying equivalents of the middleweight cruiser-class ground units) and upgradeable defensive structures. Having a bit more punch behind static emplacements makes turtling against frigate or bomber spam a more viable strategy. Pre-Escalation, the only reliable ways to counter this kind of harassment were blanketing the map in radar stations to create an early warning system, leaving area control units at every vulnerable point, and/or frantically deploying your own aircraft wings to whack-a-mole the enemys swift-strike forces. Some other new units include the Masochist, which increases its firepower as its health bar drops, and the Harvester, which can camp out on a resource node to increase its output. The latter sort of units provide a strategic economic value, which makes them the most interesting and match-altering additions. I sometimes found myself questioning whether adding so many new specialized ground craft was really worthwhile in a game about colossal engagements where anything smaller than a Dreadnought can tend to get lost in larger army compositions. (Dreadnaughts, somewhat disappointingly, are the one class of ground vessel that didnt see a roster expansion.) They simply didnt feel like as impactful an addition (at least at my level of play) as the heavy fliers, economy boosters, or defensive upgrades. My favorite new feature is the Supreme Commander-style strategic zoom.Possibly my favorite new feature is the addition of Supreme Commander-style strategic zoom, which allows you to pull back and see the majority of all but the largest maps, with units, structures, and resource points represented by distinctive and highly readable colored icons. I didnt truly realize just how desperately the gargantuan-scale battles in Ashes were in need of this until I got to play around with it. The one minor annoyance is that you cant really see precise topographical data in the strategic view. Since elevation can matter a whole hell of a lot when choosing an approach angle for a closely matched engagement, I often found myself using lower zoom levels that dont include the overlay more often, just so I could keep track of what kind of height map I was dealing with. A simple set of banded elevation markers like in Homeworld: Deserts of Kharaks strategic view would have been most welcome. The campaign was definitely the weakest portion of the original Ashes, and that remains true with Escalation. However, its clear that a lot more effort has been put into the design and presentation. The voice cast has been greatly expanded, and the simple addition of character portraits lent a lot to my sense of who these cybernetic warriors actually are. All of the missions and cutscenes are fully voiced, and while the dialogue writing is borderline cringe-worthy in a couple cases, the story remains interesting, complex, and intelligently crafted. I also appreciated that almost none of the 14 new campaign missions were of the plain old just win this multiplayer map against the AI sort. Almost every one of them has some kind of twist or unorthodox objective, like having to raid enemy bases for resource caches on a map with no traditional gathering nodes, and the later ones hint at promising story developments that could expand the universe and the faction roster of Ashes in the future. Frustratingly, there is still some weirdness lingering in the pathfinding AI and the combining of large groups of units into formation-bound armies. Like in the base game, the Form Army button refuses to function reliably past a certain number of units selected. If theres an upper limit the engine can handle, Id prefer the interface to just make me aware of it and grey out the button when Ive selected too many. Having a maximum size for armies would also force some interesting strategic choices in terms of how I divide my forces, which I feel would outweigh any sense that it restricts my gameplay. Escalation succeeds at making Ashes of the Singularity a bigger, better, sleeker RTS that allows you to play its great new content alongside just about everything from the base game (including the lacklustre original campaign missions). Not all of the new unit options feel especially meaningful, but the extra variety for aircraft, defensive structures, and economic boosters shake things up enough to make the Ashes formula feel fresh, especially when viewed from the new high-level strategic view. An all-new campaign thats more than an afterthought brings a good deal of value to the package, and the story presents a more engaging way to get a feel for the lore and mechanics. Even though the Form Army button remains an enigma I cant fully unravel, I look forward to pitting my wits against fellow commanders in some of the largest, most complex, and lovingly detailed mega-wars on any platform.", "date": "Nov. 11, 2016,"}