{"name": "Tyranny", "name_review": "Tyranny Review", "ref": "https://me.ign.com/en/tyranny/126527/review/tyranny-review", "text": "Sometimes evil wins, Tyranny says, and you have to live with it. But Obsidian's latest RPG doesnt leave it at that. It reveals its brilliance early on by sneaking mercies into a world conquered by the oppressive armies of Kyros and where freedom is a fading memory. Sometimes this means finding a way to spare entire warring factions, earning you names like ~Peacebinder.~ And sometimes it means forcing a prisoner to kill her former comrades with a rock to save face in front of your superiors. Sometimes you have to work with what the world gives you. It's brilliant, its painful, and its relevant. Pillars of Eternity, Obsidian's previous RPG, was brilliant in its own ways too, but it was chained to the traditions of Infinity Engine games in the vein of Baldur's Gate 2. Tyranny shares that look (and Pillars' Infinity-style engine), but is freed from nostalgic obligations and allowed to experiment. It emerges as one of the most remarkable RPGs of our day because of its themes and its devotion to making our choices play out in meaningful ways. It works in part because it focuses on the evils of mundane complacency rather than mustache-twirling villainy. Tyranny casts you not in the role of the big bad guy or even a cabinet member, but rather as a rank-and-file official of sorts who's sent out to stamp out the last flickers of rebellion. I may have wielded a shock staff and lit enemies aflame with a touch, but ultimately I was a guy with a job. Its not unlike being a low-level German government employee in 1940; youre not a Nazi, but you have to work for them. Hand-drawn, stylized cutscenes beautifully complement the detailed world and characters. That job, at first, was to read an edict from the warlord that threatened to cast doom over an entire region in order to get them to stop fighting within eight days' time, or Hell would rain on us and kill us all. I had that pressure to find a way to stop it looming over my head, but I also found it disturbing how quickly I came to accept the excesses of the empire of Kyros as business as usual. And to be sure, this is a richly realized world. It's stuffed with fascinating lore that's imparted in text-heavy conversation dialogues, and I admired the way Obsidian set it on the cusp of the Iron Age rather than in the overused castles-and-knights medieval era. Pillars of Eternity did this kind of thing, too, but never with such style. The text here is almost always worth reading, and numerous links provide mouseover refreshers about who this woman is or what this name means when needed. Hand-drawn, stylized cutscenes beautifully complement the detailed world and characters, which retain their Infinity Engine pedigree but look much improved from Obsidian's previous games. Though most of it is raw text, it's also heavily and admirably voice-acted in key scenes, so much so that I sometimes marveled at the work it must have taken to accommodate the choice-driven plot. Few RPGs handle choice so well as Tyranny. From the very beginning it let me customize my tale, kicking off with a choose-your-own-adventure-style recap of the pre-game conquest displayed over a war table, allowing me to be merciful toward some parties or send a powerful being called an Archon to wreak earthquakes on the region's breadbasket. In other games these choices have typically amounted to little more than lip service. But in Tyranny I found changes everywhere (especially in first eight or so hours), including the appearance of towns going from ruin to normalcy in different playthroughs. In my main good playthrough, the rebels gratefully remembered my sparing them; in my ~bad~ one, they hated me on sight for the disregard with which I'd treated their lives. Broken peasants cowering in shadows would mention the earthquakes I was responsible for. Whole areas might show up in one playthrough that I'd never seen in another because of those initial decisions. Few RPGs handle choice so well as Tyranny. At one point I found myself shocked to discover I could betray everyone around me, kicking them off towering spires while I took the glory for myself. Moments like these were perhaps my favorite, as they threw wildcards into the choices I anticipated, and they continue to pop up at memorable times. They bring an additional layer of complexity to a tale that's already full of surprises, such as when the Fatebinder discovers mysterious new powers to interact with ruins that he or she is no mere pawns. The surprises continue right down to the end, though youll never achieve ultimate satisfaction. Sometimes even going through with them and reloading a previous save after the deed was rewarding in itself for the glimpse of what might have been. Tyranny embraces choice to a fault, in fact. With all the alterations demanded by the different decision, the story sometimes feels like it lacks the punch of a more focused tale. Obsidian itself seemed to sense this, as the impact of the choices feel less (literally) earthshaking in the final hours as they do in the riveting first. And then it denies choice at strange times. Eventually you have to choose a side between two almost comically opposite factions, and in this world of deceit and frequent ~lie~ prompts in conversations, it seems strange that you can't have second thoughts and go turncoat. Even the ending may disappoint, as the cliffhanger suggests new DLC to enhance the saga. Or maybe it just didn't know what to do with all those extra threads. When it rewarded me with skills based on my reputations with factions like the staunchly disciplined Disfavored or the ragtag Scarlet Chorus, which welcomes captured prisoners into its ranks, I sometimes found myself choosing answers that would eventually lead to a new skill rather than what I'd actually say in character. That derailment of the roleplaying spirit is one of the few weaknesses of Tyranny, and it's a blessedly small one. It's a weakness I was drawn to in part because I found the pausable real-time combat so much more gratifying than the version that Obsidian gave us in Pillars. Improved animations and spell effects make combat fun to watch, especially when co-op abilities that require two characters to pull off (such as a knockdown and a followup stab) come into play and make it fun to set up. I found a lot to admire in a spellcrafting system that lets you use items you find to make new abilities, and I relished the little timers above character's heads that signaled when they were about to use a skill I'd commanded them to use while paused. I do wish, though, that there were a little more varied enemy and encounter types throughout (a problem that's largely created by the rebellion focus), and I wish most encounters had more thought to them besides rushing my party at a group of enemies. It helps that the combat's not so punishing here as it was in Pillars  resulting in a ~Story~ mode that's actually easy for a change, and a normal mode that didn't leave me banging my fist on the desk  but I do wish they'd compensated for that accessibility with more creative setups. Cutting the Clutter Relative to Pillars, Tyranny also knocks the maximum party size down to a far more manageable four members, which makes simplifies focusing as well as divvying out gear and engaging in long chats. Seemingly as compensation, it also brings the welcome ability to improve skills based on how often you use them, allowing a mage to become a tank if needed.Tyranny is a tightly, attractively focused game. Tyranny sees Obsidian showing that it knows how to wisely cut away the clutter. It's a tightly and attractively focused game, wasting little time in humdrum exposition and instead kicking you almost immediately into the first act's eight-day doom timer. Even its upgradeable stronghold bases enhance and complement the gameplay, providing faster travel times for the missions that need it. Somehow, over the course of around 25 hours of missions in the main campaign, it never really loses this focus compared to ponderous other RPGs. Tyranny is the better for it. Its heavy emphasis on choices and their implications make the idea of replays appealing. Such replays are almost therapeutic, especially if you're trying to make your way through as fairly good, as I was. They emphasize how easy it is to slip into acceptance of tyranny, to the point where it felt as commonplace as walking. It worked so well that I, dubbed the ~Peacebinder,~ found myself pummeling a Scarlet Chorus officer because he refused to order his troops to cross a broken bridge to chase a water mage. I only meant to punch him once, but his continued refusal seemed to demand a forceful show for the sake of his violent band. One punch became another. And another. But when Barik, my companion who struts around in unremovable armor and cheers death and punishment, started expressing horror at my actions, I winced. Just like that, I'd become what I hated. It's scary, and it's relevant. And it's good. Tyranny is a memorable RPG that looks great and feels fresh, even while largely working in the confines of the old Infinity Engine style. It's also the rare sprawling RPG that invites you to replay it, as its comparatively short running time and significant changes based on choice greatly change the experience from playthrough to playthrough, and combat is deep enough to last. With Tyranny, the old feels new again.", "date": "Nov. 11, 2016,"}