{"name": "Call of Duty: Modern Warfare Remastered", "name_review": "Call of Duty: Modern Warfare Remastered Review", "ref": "https://me.ign.com/en/call-of-duty-4-modern-warfare-remastered/126431/review/call-of-duty-modern-warfare-remastered-review", "text": "[Editors Note: at the time of review, Call of Duty: Modern Warfare Remastered is only available as an add-on to Call of Duty: Infinite Warfare, and must be purchased as part of a bundle.] Once held up as the great example for contemporary-era shooters, Call of Duty 4: Modern Warfare is now an enlightening time capsule for an style of Call of Duty that no longer exists. When IGN first reviewed it back in 2007, we gave it a 9.4 and said this about it: ~Call of Duty 4: Modern Warfare is a fantastic game. The single-player experience is easily Infinity Ward's best work to date. Calling it intense may be an understatement. The overall story is standard action movie fare, but the relationships built over the short five hours of play are surprisingly strong. Though the single-player lacks length, the multiplayer should keep you invested in COD4 for the long winter. This is a truly fantastic multiplayer offering that's as deep as any other online game available. Infinity Ward has done it again. Call of Duty 4 is a winner.~ Read the full original Call of Duty 4: Modern Warfare review here. After years of futuristic CoDs, going back to the present day with Call of Duty: Modern Warfare Remastered is a welcome return to combat that makes me feel simultaneously powerful and helpless due to the way its both literally and figuratively grounded. Though the sprawling level design and pacing are definitely dated, the core of Modern Warfares combat has aged remarkably well, and that foundation keeps its action movie-style campaign and its multiplayer fun even nine years later. However, outside of its impressive face lift it offers only a few additions to make it feel new to returning players. My strongest memories of my original runs through Modern Warfares campaign were of levels like the tense, stealth-focused All Ghillied Up and the hectic race against the clock that is Mile High Club. Those missions still play well even though theyve been emulated and improved upon countless times in the years since. Lying underfoot as tanks and an enemy squadron passed over me was even more exciting and petrifying in HD  the grass and the tanks look way better than before, of course, which adds to the dramatic and cinematic nature of the iconic level. But in Remastered, its the combat that stands out most. Modern Warfares relatively human-feeling speed and range of movement is unchanged, and that means things like mantling, reloading, and throwing grenades require the same (sometimes appropriately slow or clumsy) timing. It left me feeling relatively weighed down, encumbered, and more desperate in the fray. Desperately running through Mile High Club on Veteran, for example, is just as gratifying as it once thanks to Remastereds faithful preservation of the originals movement timing. Animations and graphics are significantly better than the 2007 version, though not quite as good as a new CoD. Textures are sharp, faces are completely redone and brought nearly up to modern standard, lighting and effects are greatly enhanced, materials like wood and brick have updated ballistics physics, and even the campaign runs in a smooth 60 frames per second. This is an impressive update in most respects, and it has far more than the simple retexturing and increased resolution we see in most remasters. But there are cracks in the facade; a checkpoint-triggered cloud of smoke near the end of the campaign was jarringly rough around the edges, for instance, and there were times when Id get momentarily stuck on the geometry of a door and unceremoniously shoved to the side by a scripted ally charging through. Thats the kind of clumsy thats less endearing. There are moments that still truly stand out in Modern Warfare Remastered, brought into relief by much-improved graphics. In particular, the nuclear explosion in Shock and Awe and the short death scene in Aftermath both hit much harder in the remaster, even knowing they were coming  crawling helplessly by a dying squadmate coughing out her last breaths is more upsetting when her expression is brought into focus. And the point of the mission is more meaningful for it. Sometimes being a hero and fulfilling the objectives isnt enough. That message is timeless. The still-strong combat fundamentals combine with campaign levels that send swarms of enemies your way to make for white-knuckle warfare that still works. On higher difficulties, sacrificing mobility by throwing myself down to the ground to go prone or finding cover at the very last second made me feel powerless; even calling in an airstrike or commandeering an enemys RPG felt like it put me right in the enemys crosshairs as opposed to helping me get out of them safely. It made me flex FPS muscles I havent used in a while. That muscle memory carries over to multiplayer. Where modern CoD is fast and bombastic, Modern Warfares multiplayer is chaotic and explosive in a very different way  you cant double-jump your way out of the line of fire, so finding cover from gunfire or taking shelter from an airstrike in a wrecked building is paramount. I relished running to safety at the last second as bombs come down around me  it feels urgent, and its still really satisfying even next to a contemporary, faster CoD. Thats not to say that Modern Warfare is slower in all respects, though, since it still has CoDs signature quick time to kill. The level design itself has definitely aged less than gracefully, though. Modern Warfare Remastereds linear warzones littered with blown-out cars and buildings scattered haphazardly throughout still work in that they contribute to the stress of finding shoddy cover or a decent vantage point, but a lot of the campaign levels and most of the multiplayer maps are designed for little more than to create areas to duck behind, as opposed to a more modern map design that makes good use of vertical space and gives you options in combat for a competitive match. Bog and Overgrown in particular are frustratingly muddled maps with arbitrarily open spaces and buildings that serve only as unnecessary clutter  theyre fun for some low-key matches, but trying to go for a real strategy in Team Deathmatch on those maps was only frustrating. As far as new content that was not in the original version, Remastered doesnt bring a lot to the table. There are no developer commentaries or behind-the-scenes featurettes (which may be due to the fact that much of the original talent is now at Respawn). The biggest change is that its retroactively added Modern Warfare 3s Kill Confirmed to the lineup of multiplayer game modes, which is a good call  its one of my favorite ways to mitigate any map problems. Kill Confirmed definitely discourages camping by making you go to your targets location and collect tags after getting a kill, and that helps keeps the game moving. Also, be aware that while Modern Warfare Remastered currently includes only 10 of the original maps, six more are planned to roll out for free in December. Put simply, Modern Warfare is no longer modern  though the combat and, in some ways, the action-movie story at its foundation are ageless, its level design and lack of campaign progression reveal its true age. But its not outdated, its classic, and the considerable effort that has gone into improving the models, textures, and effects have enhanced it enough that playing through the campaign again was rewarding. Multiplayer also benefits from the graphics upgrade, and its refreshingly old-school pace is fun and explosive in its own right. It might not have the same effect it did the first time around, but it works as both a great embodiment of what shooters used to be and one that still plays well.", "date": "Nov. 9, 2016,"}