{"name": "Gravel", "name_review": "Gravel Review", "ref": "https://me.ign.com/en/gravel-2/145317/review/gravel-review", "text": "Gravel is an arcade-style off road racer that eschews tight and twisty traditional rallying in favour of mostly high speed assaults on generously wide tracks carved through a variety of exotic locations. Think less Codermasters Dirt and more a store-brand SEGA Rally Revo. The problem is that Gravel sits in a weird place on the racing spectrum; the casual driving dynamics are easy enough to pick up but the racing itself is surprisingly plain and basic for a game unshackled from any licensed motorsport organisations. The result is a passable yet unremarkable racer in a marketplace thick with better ones. Gravels solo mode revolves around a globetrotting, fictional racing TV show dubbed Off-Road Masters  but its only a thin thread of context to string together whats essentially an entirely conventional single-player racing career mode. Other than the occasional boss race the only real baggage the TV show premise comes with is an unlikeable announcer I turned off very quickly. Let me stress, the boss races are also a lot less interesting than they sound; theyre ultimately just standard events against a single opponent instead of seven of them. There are five rivals spaced throughout the career who are introduced via some surprisingly dorky FMV vignettes. Theyre all American blokes who race in unsponsored cars with their actual names written on them, like theyre afraid of losing them in a parking lot. Each has no distinguishing characteristics other than a name and a home state so their presence adds very little to the experience. The career spans a handful of racing styles, from cross country checkpoint chases to tarmac-based time attacks, and cramped, arena-style races to rallycross-inspired events. Some are considerably better than others; I quite enjoyed the high speed cross country races along the Namibian coast; strewn with shipwrecks and snaked over giant sand dunes theyre probably the best tracks in the game. Theyre certainly the best-looking. On the other hand, I hate the Smash Up events. These are races against the clock where strips of mystery boxes are placed at regular intervals along the track and we need to crash through the green ticks and leave the red crosses intact or suffer a time penalty. The gimmick is that the ticks and crosses arent revealed until youre a very short distance away and they change on each attempt. I found them frustrating and not particularly fun. Its like competing against a slot machine. At around 50 vehicles Gravels car roster isnt huge but it is licensed, and there are at least a few rides that rarely pop up in rally games, including a handful of Dakar-bred SUVs and pick-ups, a Porsche I havent seen in a racing game since EAs 2002 off-roader Shox, and an iconic Toyota that mysteriously disappeared from the Dirt series after 2011. They look nice enough clad in their most recognisable liveries (like the famous Castrol Celica, or the equally iconic 555 Impreza) but less so in Gravels wide range of generic alternate paint jobs. Aside from new cars these extra wraps are one of the key unlocks rationed out as we progress but I never felt any desire to use them. The driving dynamics are quite numb with the available driving assists switched on because theres neither a decent sense of weight nor the arcade-bred slipperiness of the ever-underappreciated SEGA Rally Revo. Getting rid of the assists brings back some depth to the handling, although there still doesnt feel like theres much difference in grip across the games several surface types. There are more granular tuning options which ostensibly relate to specific handling characteristics but they seem out-of-place in this sort of racer. Gravels lighting is generally good, from the beaming desert sun to the soft red glow of taillights in the evening. Standing water tends to have a nice glint to it, too, although the actual water effects in Gravel are otherwise disappointing. Come on, folks; Colin McRae Rally 3 had raindrops that slithered across the windscreen over 15 damn years ago. The presentation is clean and tidy but post-race Gravel has an aggravating habit of sending us back out to the main race menu and forcing us to scroll through several unavailable races to get back to where we were previously. Why it doesnt just default to the next logical race is a mystery; its very irritating. Online multiplayer options are bare-boned; you can simply jump into a quick race or create a lobby of your own. Its a ghost town at the moment, though, and sadly theres no splitscreen to ease that issue. Theres nothing inherently wrong with building a racing game atop a straightforward handling model geared at casual racing fans keen for some simple thrills and spills, but Gravel has little beyond that. The very best arcade racers layer on lashings of special sauce to imbue them with identities of their own. Split/Second arrived with dynamic race tracks that were literally blown to pieces as we blasted through them. SEGA Rally Revo was resurrected with the same intense speed we remembered but bolstered with incredible visual design and eye-catching deformable surfaces. Blur brought Mario Kart-esque combat to street racing in licensed cars. Trackmania Turbo is stunt racing on a four-day Froot Loop bender. Gravel has no special sauce. Right now its just beef on a bun. It has a handful of decent tracks and small smattering of rarely seen cars, and thats kinda it. It has no unique flavour. Perhaps with bolder and wilder track designs Gravel couldve made a better case for itself, or maybe it needed more cars on course for more frantic racing. Gravel is a game displaced. Its a competent and occasionally pretty pick-up-and-play arcade racing game at its core, but it has the whiff of a game released in the wrong era  a scent it just cant shake. A 2018 rendition of 90s ambition. Gravel certainly channels the spirit and straightforward simplicity of Milestones own 1997 arcade off-roader Screamer Rally but it has no unique hook for todays audience; no over-the-top arcade pizazz that folks will still be discussing 10 or 15 years down the track. Its functional and fun enough in small bursts, but arcade racers have come a long way over the past two decades and Gravel doesnt bring any new ideas to the paddock.", "date": "March 20, 2018"}