{"name": "World of Final Fantasy", "name_review": "World of Final Fantasy Review", "ref": "https://me.ign.com/en/world-of-final-fantasy/125794/review/world-of-final-fantasy-review", "text": "For the past several years, Square Enix has released a landslide of Final Fantasy spin-offs with varying success: toe-tapping rhythm adventures, adrenaline-fueled fighters, and some forgettable mobile titles. Adding to the list is the cute-as-can-be World of Final Fantasy, a warm and fuzzy blend of nostalgic turn-based combat and monster stacking that had me alternately squealing with delight and sighing with boredom throughout the more than 60-hour campaign. Lets cut right to the chase: this is the cutest Final Fantasy Ive ever played, and Ive played just about all of them. The vertically arranged world of Grymoire is filled to the brim with pixie-sized NPCs and cuddly, shrink-wrapped versions of Final Fantasy monsters like baby Behemoths and onsie-wearing Tonberries. Amplifying the sugary sweetness are Lann and Renn, an energetic pair of apple-cheeked twin heroes who spout pun-filled dialogue as they zigzag up and down a chain of floating islands collecting special monsters called Mirages. Their light-hearted banter imbues the increasingly bizarre story about a time divergence that could either save or doom the world with some much-needed humor. Silly 2D animation interspersed with quirky CGI cutscenes are also a welcome bit of fun. If nothing else, World of Final Fantasy has oodles of charm. Even the turn-based combat starts off endearing. Instead of wrangling random NPCs into your party, you venture into the wild to capture Mirages, then use skill points earned in battle to evolve them, Pokemon style, via a node-filled skill board that very much reminds me of Final Fantasy Xs Sphere Grid. Each of your twin heroes can then take two of these cuties into battle, and either stack them like a wobbly totem according to size (smallest on top) or have them fight alongside their human masters, both of whom can grow or shrink between enemy encounters to create slightly different stack formations. Stacking Mirages is a little risky because it means accumulating your allies weaknesses and gives you fewer opportunities to strike at enemies, but it also combines character strengths and abilities while unlocking more powerful versions of spells like lightning and fire when using monsters with similar skill sets. This is the cutest Final Fantasy I've ever played. There are literally hundreds of Mirages to collect, and pairing the twins with everything from Moogles to Cactaur to Malboros offered a breathtaking array of ways to manipulate my combat stats for maximum effectiveness. Ganging up on enemies was definitely my prefered way to play, especially if foes were also arranged in a powerful pancake formation. Plus, it looks really, really cute. Mirages arent the only adorable things to collect. I smiled with nostalgia whenever I acquired special medals that allowed me to summon miniature versions of Final Fantasy heroes. Having Shelke or Celes appear in battle to deal out extra damage and buff my stats was extremely handy in the final acts tough boss fights. And if that wasnt enough, I was later able to conjure oversized Espers like Leviathan and Odin, adding an extra explosive cherry on top of my already formidable flapjack formations. Unfortunately, while there was always a steady stream of new monster friends and human champions to assemble, the repetition of capturing and evolving so many of them  especially ones with similar attributes  resulted in boredom about halfway through the lengthy campaign. It was also a hassle having to constantly swap out so many allies to ensure everyones levels and abilities were up to par. Extracurricular activities, like fighting for rare loot in a colosseum or participating in sidequests involving Cloud, Lightning, and other Final Fantasy heroes helped break up some of the monotony, but it wasnt enough to stave off battle fatigue. Even a much-appreciated fast forward button in combat and clever button-mapping that enabled quick access to essential Cure and Esuna skills couldnt prevent my eyes from glazing over. Towns and dungeons offer little opportunity for exploration. Combat wasnt the only thing to drain my enthusiasm. Towns and dungeons are little more than a series of cramped vertical corridors that offer little in the way of opportunities for exploration. In fact, one area was just series of bridge cables that shot upward into the sky, while another dungeon was a series of chainsthat shot upward into the sky. I get that the design is meant to mirror the verticality of Grimoire, but it was disappointing that that a series of right angles walled me off from spelunking a fiery cave and sightseeing in Cornelia, the series very first town, and one that always makes me feel misty-eyed with nostalgia. Even the hub town of Nine Hills has few areas to explore, and for reasons I dont understand, is the only place you can shop for items. That meant schlepping it back there whenever I was low on supplies. Its too bad areas dont offer more variety, because I enjoyed exploring the rare bits of expanse that let me use my monster friends to find hidden treasure or flutter across gaps to snatch up loot. If theres one upside to mindlessly pushing up on the analog stick, its that it allowed me to kick back and enjoy the catchy remixes of classic Final Fantasy tunes playing in the background. World of Final Fantasy is a humorous adventure that is just too cute for words, but its combat and exploration arent diverse enough to support a campaign nearly as long as this one. However, I did enjoy it for a long time - more than 30 hours - before it wore out its welcome.", "date": "Oct. 26, 2016,"}