{"name": "Ni No Kuni II: Revenant Kingdom", "name_review": "Ni No Kuni 2: Revenant Kingdom Review", "ref": "https://me.ign.com/en/ni-no-kuni-2-revenant-kingdom/145248/review/ni-no-kuni-2-revenant-kingdom-review", "text": "In many ways, Revenant Kingdom follows in the tradition of the Ni No Kuni series, once again putting a young boy at the heart of an epic story across a gorgeous cel-shaded land. In other ways, however, Ni No Kuni 2 sets its own course, with completely overhauled combat and a new focus on kingdom building. Its a meaty, fun adventure that feels much snappier to play than its predecessor, but falls short in a few key areas. Revenant Kingdom is set long after the events of Ni No Kuni: Wrath of the White Witch, and is centred around Evan Pettiwhisker Tildrum, the heir to the throne of the fabled city of Ding Dong Dell. Evan is part human, part cat  or Grimalkin  and is part of a ruling dynasty that presumably stretches back to King Tom Tildrum, who we met in the PS3 game. On the day of his coronation, however, Evan is deposed in a coup and must flee. In exile, he decides to create his own kingdom and to unite all the nations of the world. Its a grand ambition, and reflective of developer Level-5s broader storytelling focus this time around. Wrath of the White Witch was much more personal  its hero Oliver loses his mother in the opening moments of the game, and is transported to a strange fantasy land where he hopes he may be able to save her. Much of the early going sees Ollie attempting to help other people in pain, and in doing so, dealing with his own loss. Evan also loses people important to him  his father, the king, and Aranella, his mother figure, but these largely serve to set the wheels in motion. Revenant Kingdom is not the story of Evans grief and fear about the future, it is about making the world a better place; about compassion, healing societal divides and being hopeful for the future. These themes fit the gameplay very well, and ultimately make for a memorable journey, but they dont do a great deal for developing Evan and his friends. Despite his age and character-defining innocence, Olivers story was more immediately relatable: you felt the shock of his mothers death and it gave an emotional anchor point from which to engage with the adventure. Revenant Kingdom lacks this. A deposed boy king on a wildly optimistic and seemingly nave quest to create a kingdom where everyone can live happily ever after? It just doesnt resonate in the same way, and there isnt much more to Evan than that for the bulk of the game. His companions are also little more than sketches  they possess an identifiable trait or two, but ultimately dont contribute much. Roland, for instance, is a president in our world, but is magically transported to Evans - becoming inexplicably much younger in the process. His experience running a country and dealing with the affairs of state make him an ideal advisor for young Evan, but Level-5 just doesnt capitalise on him as a character for the majority of the game. There are so many aspects of Roland that could have been explored throughout that arent, and the game's weak characterisation also often dovetails with clumsy storytelling. At one point midway through Revenant Kingdom, for instance, Roland is given a chance to take centre stage, but the implementation of the short story arc is limp and lacking nuance. Theres another factor that works against Revenant Kingdom, and thats the sparsity of both voice acting and fully realised cutscenes. This may come as a shock to anyone who remembers the gorgeous 2D cutscenes at the start of Wrath of the White Witch and the extensive in-engine cutscenes that peppered the game. Those helped sell it as a blockbuster RPG and also went some way to establishing personality for the main characters. Wrath of the White Witchs Drippy the fairy is the perfect example, as the extensive cutscenes allowed the team to really lean into his dialect and abrasive personality, forcing you to either love him or hate him. That then laid the groundwork for scenes like the fairy comedians which I genuinely enjoyed. Lofty plays a similar role in Revenant Kingdom, but hes so much less forceful because the vast majority of the time youre reading text on screen and watching characters stand around. Lofty has his moments, but really needs more fully voiced scenes. The difference between the two games really is significant, with Revenant Kingdom only delivering the level of presentation youd expect in its final climactic scenes. Throughout the rest of the game, fully-voiced and directed cutscenes are restricted to short snippets. Even static, voiced dialogue scenes are few and far between. The majority of the time youre reading text on screen, either with no voice work or short expressions to illustrate overall intent. It all leaves Revenant Kingdom feeling very flat, and the writing and characters simply arent good enough to bridge the presentation gap. Life is breathed into the world by some suitably zany side quests and the odd genuinely funny moment, however, and Level-5 has done a good job creating distinct places to visit. Among others, youll journey to an Eastern-flavoured city where all decisions are made based on the roll of the dice, and a water world in which a literal giant eye polices every move of the populace. Goldpaw is a stunning-looking city. I also enjoyed Evans overall journey, and found the quest to build and grow Evermore, his kingdom, quite compelling. You start out with a simple camp and grow it into a town and beyond. Its fun to have a base of operations you can return to thats always evolving as you add new facilities and expand its scope. It also gave me more reasons to engage with all the side quests in Revenant Kingdom, as many of them allow you to recruit new citizens, who can then be assigned specific roles and help research new capabilities and improvements that touch basically every facet of the game. Its a neat way to give a greater purpose to fetch quests too - in addition to levelling your characters, youre also trying to level your kingdom. The other major focus of Revenant Kingdom is combat, and this too represents a radical departure from Wrath of the White Witch. Forget any link to the turn-based traditions of old, Revenant Kingdoms combat is fully real-time and feels wonderfully fast and responsive. Youre leaping at enemies with light and heavy attacks, casting spells, blocking or dive-rolling to avoid damage, and largely letting your party members take care of themselves while you focus on controlling your character of choice. In dungeons the transition into battle is seamless  you simply attack the enemies you come across. When crossing larger distances on the field map, you can still choose to try and avoid or engage enemies, but this too is zippy  run into one and youre almost instantly in combat. Theyre big changes, but the combat feels great, and the fact that fallen foes are constantly dropping loot only adds to the action-RPG feel, encouraging you to regularly revisit your equipped weapons and gear to build the optimal load-outs. Of course, this is still very much a straight JRPG in other respects, so back in Evermore you can use the world's plentiful crafting materials to boost the power of your spells and unlock new ones, to create new weapons and armour or upgrade existing gear, and to level up your Higgledies - elemental helpers that join you in battle and can serve as additional damage dealers, healers and more. The Higgledies are adorable, but far less central to combat than the Familiars of White Witch. You can also use points earned in battle to tweak your tactics, allowing you to do things like choosing to be stronger against certain elemental enemy types or less susceptible to specific debuffs. You can even make other adjustments to suit your play style. Like to be nimble? Put some points into the dodge skill to increase the length of time youre invulnerable while rolling. Want to hit harder? You can choose to boost the damage done by heavy melee attacks. Or, if you want to prioritise earning XP over rare materials from victories, or gear drops over coins, you can make those changes too. Theres even a whole other type of combat in the form of Skirmish challenges, which see you take four units of troops into battle. Theres a rock, paper, scissors element to these encounters as you rotate your units around Evan to try and counter the enemy unit types. I found Skirmishes a little clunky and unrewarding, but at least youre only forced to play them a handful of times. Revenant Kingdom is not a hard game, and a little grinding can take you the vast majority of the way. Theres a lot to digest, and many of the systems arent really explicitly introduced or adequately explained, instead relying on you to dig into menus and go walking around Evermore. Youre not really penalised for failing to interact with them, however, as Revenant Kingdom is not a hard game, and a little grinding can take you the vast majority of the way. Indeed, while brainlessly cutting down enemies has a certain appeal when the combat feels this fluid, Id definitely have preferred more challenge. There were essentially no times in the entire game when I was forced to go in and make changes in the Tactic Tweaker or equip specific gear or rotate in a particular character. I even defeated the vast majority of bosses in one shot. This gives Revenant Kingdom real forward momentum, which I do appreciate, and you can always choose to go and take on much higher level enemies if you want a challenge, but Id have liked the baseline difficulty on offer to be a bit steeper, or at least to be forced to respond to elemental effects or debuffs. Ni No Kuni 2: Revenant Kingdom distinguishes itself from its predecessor by layering fast-paced, real-time combat and an engaging kingdom building system atop more traditional RPG systems and quests. Its a shame it delivers so few truly memorable characters and restricts so much of its storytelling to text on screen, but by the end of Ni No Kuni 2 the broader themes certainly resonate and the 40+ hour journey has been well worth it.", "date": "March 19, 2018"}