{"name": "Shadow Warrior 2", "name_review": "Shadow Warrior 2 Review", "ref": "https://me.ign.com/en/shadow-warrior-2-1/125214/review/shadow-warrior-2-review", "text": "~Intimidation is the tool of the fearful mind,~ said the dude across from me, trying hard to live into his sensei role. ~Hey, better than being the fool of the tearful fart,~ said Lo Wang, ~hero~ of Shadow Warrior 2. I was already giggling at that point, and even more so when Wang's chatmate remarked on what a ~deeply stupid~ reply that was. Sure, it's kind of a ~You had to be there~ thing, but you can safely take it is as a test of how much you'll get out of Wang's ever-extending story. There's satisfying combat beyond all that and great co-op fun, but it's stuffed with hours of penis-shaped swords on display stands, penis constellations in the sky (which must be the ~high wang~), and a mountain of off-color quips. It's crass and juvenile, and it reminds me a little of Duke Nukem in his better moments. But Duke never managed to make me laugh quite like this. Wang's remarks are violently stupid, but there's a hint of genius about them. Believe it or not, there's a decent story here about a young woman whose soul gets trapped in Wang's body, but their effort to restore her to her own body by killing lots of interdimensional demons and robots doesn't matter so much as their endless banter about each other and their surroundings. Wang's remarks are violently stupid, but there's a hint of genius about them, to the point where I heard co-op friends in my voice chat channel routinely stop talking to hear whatever awful thing he said next. You got a lot of that in 2013's Shadow Warrior reboot, too, but Shadow War 2 goes well above and beyond that game. Shadow Warrior embraced linear level design, but Shadow Warrior 2s roughly 12-hour single-player and co-op campaign thrives on roomy, open zones that are accessible through quick-travel points on a world map presented before each mission. Its environmental diversity and consistent attractiveness surprised me to the end. Within the space of an hour or two, Wang's adventures could find him in steampunky cities awash in glowing neon or Japanese gardens where stoic torii stand guard among light-splashed forests, and the transitions between them always seem to somehow make sense. They offer a good mix of the horizontal and the vertical, offering numerous chances for Wang to leap up on rooftops and bound about the terra cotta. Some of the secondary mission areas even boast a degree of procedural generation for the sake of replayability, although this somehow also creates long stretches where I didn't find any enemies at all. Shadow Warrior 2 plays like Doom with a potty mouth and Japanese decor. In the heat of the action, Shadow Warrior 2 plays like the 2016 Doom with a potty mouth and Japanese decor, and that's high praise. It's fast and furious, with much of its fun springing from the way Wang dashes and double jumps with no fear of falling damage, dodging out of the path of enemy strikes. With a surprisingly diverse arsenal of both physical and spiritual weapons, he can blast enemies in their faces with bursts of chi to knock them back, stealth through demon hordes with a timed invisibility spell, or unleash pent-up fury, and there's beauty in how each action rolls into the other. But it's melee that shines the brightest here, thanks to the ability to precisely lop off arms, legs, and heads with precise katana slices using the mouse and keyboard or gamepad thumbsticks. It encourages jumping into the thick of things, complete with upgradeable abilities that let Wang cut demons down like a steel tornado or skewer them from afar. It's weapon variety that keeps Shadow Warrior 2 entertaining. Placing skill points allows you to focus on melee or ranged, but one of Shadow Warrior 2s strengths is that preferring one doesn't forbid the use of the other. An emphasis on melee often meant ranged combat suffered in the original game, but in Shadow Warrior 2 guns and other weapons hold their own. The shotguns roar with much the same force as those in Doom, machine guns with skull ornamentation pepper demons with satisfying rattles, and chainsaws allow such precision I probably could have carved my initials with them. Its variety like that which keeps Shadow Warrior 2 entertaining, and thanks to its more than 70 weapons, it lasts a good while. Even when I was merely upgrading from, say, a regular bow to a compound bow, I always found myself admiring the detail and personality given to each weapon model. Many battles rely on an intense juggle, switching between favorite weapons with the tap of a button. One time, on the glassy decks of a soaring skyscraper, I battled with a named robot that looked like a sleeker cousin to Robocop's ED-209, staying out of the firing arc of his guns by swatting at its legs with dual katanas. When Id cut him down to 50% health he went into a shield mode, spitting out floating spherical drones which made my swords feel like ineffective fly swatters. So out came my shotgun, felling each with two blasts a piece. Just for a bit of flair, I finished it off with a rocket launcher. Far too many bosses rely on the same shielding design. Named, bigger guys like this are usually what count as minibosses in Shadow Warrior 2, and they often make for a satisfying change of challenge from the ordinary rabble. I just wish some of the variety I found in combat and environments carried over to them, as far too many rely on that same design of shielding and then forcing you to fight minions, regardless of whether you're dealing with a giant robot, a giant samurai, or a trident-toting snakeman. Hours in, watching that shield go up again is one of the few things I found annoying me. But other ~real~ bosses pick up the slack a bit, such as one of the first major ones, who towers over you like a slender mountain while jabbing down with legs meant to impale. At times multiple beams shoot out from her across the arena, largely forcing you to fight within them while she summon demons to rough you up (and, happily, drop the occasional badly needed health pack). None of the bosses are particularly memorable, but neither are any of them especially dull. Dead enemies drop loot, and loot is in fact king in Shadow Warrior 2  a strength it borrows from the likes of Borderlands and Diablo. The vast majority of said loot comes in the form of weapon mods, which add effects such as an extra crit chance or flame damage. Around five hours in, you can use the ones you haven't used to craft new and better mods. It's a smart design because the relatively rare weapons are always a joy to find, but the more common items still have value. Replaying levels in groups is renewed fun. Shadow Warrior 2 is also great to play in the co-op mode for up to four players, especially when those players specialize into roles with either a melee or ranged focus. (You all play as Wang, but you just see each other as random ninjas in action.) Replaying levels in such groups is renewed fun, particularly since the light randomization often throws in different enemies on different playthroughs, sometimes creating significantly different experiences. If there's a drawback to the co-op design it's that some of the enemies end up feeling like bullet sponges due to the greater health pools needed to absorb punishment from four players at once. Even so, I found myself enjoying the way most enemies responded to my attacks in some way, particularly when slicing them up with twin swords that fire energy rays or giving them a rough back scratch with Wolverine-like claws. A little more variety in demon types would go a long way, though. Wang's stupid wisecracks kept me smiling from start to finish, and the variety of melee and ranged combat and the loot that dropped from it was satisfying enough that I came back with friends for more. It's great fun in solo or in co-op, and its small degree of randomization is enough to keep the action fresh for at least a few runs.", "date": "Oct. 13, 2016,"}