{"name": "Mafia III", "name_review": "Mafia 3 Review", "ref": "https://me.ign.com/en/mafia-iii/124947/review/mafia-3-review", "text": "My 30 hours with Mafia 3 were filled with fantastic highs and baffling lows. Its writing and performances are some of the best of this entire generation, and it isnt pulling punches with the themes it tackles. But the minute-to-minute gameplay between the story segments rarely broke the open-world mold, and it recycled its few tricks far too often. Lincoln Clays story couldve unfolded as a cliche tale of revenge, but developer Hangar 13 dove past the superficial level to deliver a story rife with social commentary on post-Vietnam America and filled it with three-dimensional characters who Ive grown to either genuinely care about or really want to see dead. I loved the way the story hops between the events you play, a deposition centered around the ramifications of your actions, and a faux-documentary where the incredibly well written and acted Father James talks about his time with Lincoln. New Bordeaux, a fictionalized take on New Orleans in 1968, is full of diverse architecture and nature. From Mardi Gras parades and above-ground cemeteries to bayous filled with gators and riverboat gambling tours, it took me to some settings I cant recall ever exploring in a video game before. Along with this are some pretty heavy themes consistent with the era: Mafia 3 does not shy away from dealing with racism and what America was like in the fallout of the Vietnam War, but all of it is done smartly with tact and in ways that affect gameplay. For example, if you steal a car in an affluent neighborhood, cops will show up quickly and in full force. Steal a car in a poor neighborhood, and the cops might not even show up at all. All of this is only heightened by the fantastic soundtrack, which does as good of a job at delivering a sense of time and place as Grand Theft Auto: Vice City did for the 80s. The Rolling Stones, Sam Cooke, and Creedence Clearwater Revival all add to Mafias already incredible atmosphere. Bad Moon Rising In between the chunks of plot is the familiar open-world infrastructure that Grand Theft Auto 3 set in place 15 years ago. You drive around New Bordeaux, get missions from various characters, reap your rewards, and occasionally get sidetracked along the way. I really love the big, story-driven missions set in unique, well-designed locations. Making my way through a creepy abandoned amusement park, escaping a bank vault after a heist, and sneaking aboard a sinking riverboat all provided some awesome, memorable action. That being said, the path to these big encounters isnt nearly as exciting. Taking over parts of the city involves repeating the same handful of tasks like simple assassinations, destroying some sort of cargo, or stealing something from a well-guarded compound. The first time I did each one of these was great; the literal 20th time, not so much. Whats even worse is that a lot of locations are used as the setting for multiple missions, meaning I had to clear out the exact same bath house filled with enemies twice in a row, which is pretty nonsensical. Even that wouldn't be a big deal if Mafia 3s combat were interesting enough to make each encounter feel different, but instead it definitely falls into the realm of familiar, but functional. The cover system is adequate when it works, but it occasionally wonked out and wouldnt let me hide behind something, which led to a handful of frustrating deaths. And while theres a standard array of weapons at your disposal, Ive found that the most useful ways to kill enemies are whistling to get their attention while Im in stealth and silently stabbing them or just using my basic pistol. Enemies dont really get any stronger or learn any new tricks as you progress, so my tactics in hour two were pretty much the same as they were in hour 20. Also, the enemy AI lacks any sense of self-preservation, so many missions just turned into bland shooting galleries in forgettable locations. At least the consequences of all of these raids play out in a super cool way in Mafia 3s lieutenant system. Once you own a neighborhood you assign it to one of your three partners, which gives you new abilities and weapons specific to your choice. However, if you neglect one of them enough theyll turn on you. This led to some genuinely tough decisions, and even impacted how the ending of my game played out. I really dug having to balance wanting to help out Cassandra as a character with the desire to get Vitos health perks. While the upgrades arent really different enough to get me to play through again, the story changes that come directly from my decisions were hugely varied (I viewed the alternate paths on YouTube) and lend to a sense that your actions actually do matter. Born on the Bayou While Mafia 3's design generally checks all of the GTA-style boxes, it completely drops the ball on certain features that are all but ubiquitous in open-world games of 2016. For example, it doesnt allow you to fast travel at all, which became a hassle when I had to drive across the map to an objective that took only a few seconds to complete, only to find myself having to drive all the way back across New Bordeaux to continue with the story. Considering the designers knew there would be no fast travel option, it's confounding that they'd create missions like this at all. The driving definitely isnt bad -- it errs on the fast and loose arcade side, which I appreciate more than a rigid simulation because it lends itself to more dramatic crashes-- but having to trek back and forth across the same stretches of Louisiana became a slog by the end. Some of this pain is alleviated in other ways. For example, you can call in favors that take care of menial tasks like storing your money so that you dont lose it if you die, delivering you a fresh car, or hailing a mobile arms dealer to meet you wherever you want. Mafia 3 isnt the first game to do this, but its a much-appreciated feature that should become standard across the board. However, despite loving the setting in terms of the story, the open world of Mafia 3 definitely feels a bit barren because there isn't that much to do. Collectables like Playboy covers and albums from the era are scattered around, but there really isnt any gameplay incentive to find them other than completionism. Couple this with the lack of interesting sidequests, and Mafia 3 is best played mainlining the story without many detours. Finally, while theres been a lot of talk online of Mafia 3 being full of glitches and bugs (some of which we even rounded up ourselves) I didnt encounter anything remotely resembling some of these during 30 hours on the Xbox One version, and none of the IGN staff playing the PS4 or PC versions have reported personally coming across anything major either. Obviously the bugs exist, but they aren't happening to everybody. That said, it did hard crash four times throughout my playthrough, though thankfully I never lost any progress because it loaded me right back where I was. Also, there were several instances where the frame rate (which usually does a good job of maintaining 30) stuttered and froze for a few seconds before resuming. PC Version Impressions by TJ Hafer The visuals in Mafia 3 arent going to blow any PC enthusiasts CUDA cores off. I used Nvidias recommended settings for my GTX 770 (with a couple tweaks, like enabling Vsync), which let me crank up just about everything but anti-aliasing. A lot of the environmental textures are muddy and flat on close inspection, and dont seem to make use of tessellation or other PC staple features of the latest DirectX versions. And most of the actors have a bad case of Plastic Ken Doll Helmet Hair. Fortunately, while it might not be the prettiest game around, it runs pretty smoothly in most situations. After enabling the post-launch 60fps patch I was able to easily stay at a stable 60 when indoors no matter what was happening. Cruising around under the open sky I was usually bouncing between the mid-30s and mid-40s, with occasional drops into the 20s during cutscenes and moments of heavy action. The reflections and shadows also look great, even when I tried out some of the lower graphical settings to see if I could get a more stable framerate outdoors (which met with moderate success, though cutscenes were still an issue). All the options youd expect to be able to tweak in a major PC release are present and accounted for, including adjustable FOV up to 90 degrees. The same control problem that has plagued every GTA-style game on the PC is apparent in Mafia 3: Handling a vehicle with WASD and no analog acceleration control is a nightmare, but for a dedicated PC shooter player, aiming a gun with the thumbsticks is as frustrating and imprecise as it is sacrilegious. Luckily, most notables of the genre since GTA 4 have implemented the ability to switch on the fly between mouse/keyboard and gamepad without having to futz around in the options menu, and Mafia 3 is no exception. It was relatively painless to pick up my trusty 360 controller when I got behind the wheel of something fast, relying on more traditional PC controls when on foot. The on-screen button prompts even adjust to the last input method used with no lag, which is always a nice touch. The menus are definitely not designed with the mouse and keyboard in mind. Theyre not very responsive to mouse input and behave awkwardly if you try to navigate quickly between tabs with the cursor, similar to Skyrims default UI. Its almost easier to use the gamepad any time youre in the menus. This became especially frustrating any time I had to interact with the map screen to figure out where I was and select objectives. Its usable, but far from comfortable. The default mouse sensitivity is also absurdly high, but thats easily adjustable. And while the interface might not have been a joy to work with, Mafia 3 is extremely Alt + Tab friendly. I didnt have any issues putting it on hold to check email, nor did it self-destruct when I returned after leaving it running in the background for a while. Mafia 3s strong characters and confident storytelling kept me engaged, even if the gameplay rarely delivered anything but bog-standard and repetitive open-world action. Thats a bummer, because Lincoln is an incredible protagonist and New Bordeaux is a fantastic setting thematically, and it wouldve been great to see them put to better use.", "date": "Oct. 11, 2016,"}