{"name": "Wayward Sky", "name_review": "Wayward Sky Review", "ref": "https://me.ign.com/en/wayward-sky/124835/review/wayward-sky-review", "text": "Wayward Sky is a surprising proof of concept for the potential of VR-based storytelling outside of a first person perspective. I felt like I was floating inside a beautiful diorama come to life, which allowed me to take scenes in as a whole rather than from one limited perspective. This drew me into Wayward Skys warm-hearted tale in a surprisingly commanding way, despite the straightforward simplicity of its puzzles and dialogue. Right off the bat, Wayward Skys pastel colors and charming-looking characters elicited a smile from me. The art direction mixes a sort of rustic humility with more clockwork technological sensibilities to create a look that has a strong sense of identity. It also uses a perspective thats not tethered to any specific character, which gives you the best seat in the house for some really well-animated set pieces, usually involving cool-looking robots running amok. Pair it all with a warm, understated soundtrack, and you have a VR world that I found difficult to pull away from once it had worked its magic on me. The intrinsic joy of just looking around and taking in Wayward Skys world elevates its relatively basic gameplay, which is totally serviceable for a point-and-click adventure, but unremarkable all the same. Youll find an abundance of switch and lever puzzles, which are made a bit more enjoyable by the mostly reliable hand tracking you get with a pair of Move controllers. Though it does a good job of steadily ramping up the complexity along the way, even at its peak its basic puzzles rarely made me think for more than a few seconds. The intrinsic joy of simplyd taking in Wayward Sky's world elevates its relatively basic gameplay. Thankfully, new gameplay elements are added regularly to keep things from ever getting monotonous. One minute youre assembling wind chimes, the next youre enlisting adorably clumsy service bots to hit switches you cant reach; I was never stuck doing one thing for too long.By the end of the two to three-hour ride, I felt like Wayward Sky had chosen just the right moment to end, before its gameplay had a chance to wear thin. The story is a surprisingly heartfelt tale about family and loss, but it isnt given quite the gravity it deserves. Potentially emotional moments are glazed over a bit too hastily to have real impact, but the can-do attitudes of all the characters lend it an energy and optimism that fits the visuals well. This makes Wayward Sky a great way to introduce young people to virtual reality, despite lacking that Pixar-esque extra layer of emotional depth for adults. Wayward Sky is a good example of how well suited VR is for point-and-click style adventures. It uses perspective and gesture-based gameplay to immerse you in a world that is, on its own, a well made and inviting one. Though Ill most likely forget forget much of its gameplay sooner than later, Wayward Skys setting and ambiance will stay with me long after.", "date": "Oct. 5, 2016,"}