{"name": "Job Simulator PlayStation VR", "name_review": "Job Simulator PlayStation VR Review", "ref": "https://me.ign.com/en/job-simulator/124824/review/job-simulator-playstation-vr-review", "text": "One of the greatest things about virtual reality is the way it invites you to reach out and touch objects that arent really there, and gives you the ability to do impossible things with them. Job Simulator is an excellent demonstration of that potential, putting you in mundane situations and letting you have cartoony fun with them. In four different colorful recreations of menial job scenarios, youre given things to do: Eat a doughnut. Make soup. Fix a car. Ring up customers. That sort of thing. What makes doing all this stuff fun instead of actual work is that the robots who are running this recreation of human society dont understand or don't care how you do it, as long as you follow a very literal description of the task. So theres plenty of room for doing creative and ridiculous things, and lots of absurd tools to do them with. The fun of Job Simulator comes from combining objects in goofy ways. Each of the jobs (office worker, gourmet chef, convenience store clerk, and automotive repairman) has its own series of tasks thatll take at least 15 minutes to get through. They go longer if you spend some time just messing around  which you absolutely should. The fun of Job Simulator comes from combining objects in goofy ways, testing to see if the developers have thought of what might happen when you put dish soap in a smoothie in the restaurant or when you put your hand on a copy machine or throw everything you can find at a robot. Its really impressive how many things theyve anticipated and come up with funny reactions for your actions, and how interactive all of these environments are. Every drawer or cabinet opens, and theres usually something fun to play with hidden there. Because Job Simulator is always encouraging us to experiment, I quickly ran into the main limitation of the PlayStation Camera that's used to track your hand movements. First, unless your camera is very well positioned, some of the cabinets and items placed below waist level can be hard to grab because they're right on the edge of the viewing range. Anything dropped on the floor automatically warps back to the table in front of you, which mercifully prevents you from having to try to reach the floor (but will sometimes create big piles that are hard to get rid of). Plus, though there's rarely anything going on behind you, trying to turn all the way around and interact with something will make your hands vanish because your body gets between them and the camera. The other thing that slows it down is that at the end of the day Job Simulator is effectively one joke stretched out over four different scenarios. It wears a bit thin after awhile. Theres some funny dialogue and some good gags, but not really enough to sustain it for a long play session by yourself. So this is a game thats best played with some friends, swapping out whos playing and having everyone else shouting suggestions from the couch. The audience gets to watch the goofiness play out on the TV as the player pantomimes the action, and thats a good time for everybody. Job Simulator's simple tasks are made fun by its absurdist sense of humor and goofy props. It'll test the limits of the PlayStation VR's motion tracking abilities by enticing you to reach for every object and device you can see, which sometimes makes things a little frustrating. But the rewards for experimentation make it well worth doing.", "date": "Oct. 5, 2016,"}