{"name": "Harmonix Music VR", "name_review": "Harmonix Music VR Review", "ref": "https://me.ign.com/en/harmonix-music-vr/124821/review/harmonix-music-vr-review", "text": "I expected a lot better from the folks that invented Guitar Hero and Rock Band. Harmonix Music VR is a collection of four music-themed VR experiences, none of which are all that interesting or entertaining. It wouldnt be worth five dollars, much less $25. The Easel is Harmonix Music VRs most interesting element, probably because it lets you scratch your own creative itch. It lets you draw with the Move controllers in 3D space with dozens of tools and styles and then manipulate your creations in that same 3D space  again with everything you do bopping to the music. Its very similar to the HTC Vives Tiltbrush, and its a trip to lean your head inside your creations, but its a short-lived distraction at best. In The Dance, you can manipulate the poses and movements of goofy monsters inside a high school gym, again to the beat of the music. Eat a slice of nearby cake once youre satisfied with your custom dance troupe and youll warp behind the DJs turntable, where you can tweak the speed of the music and shoot goofy items at your poor dancing monster slaves with a toy gun. A final bite of cake puts you into a godlike overhead view. Using the Move controllers to grab onto the dancers below and dunk them through the basketball hoop or fling them into oblivion is amusing...for a moment. Its the closest Harmonix Music VR comes to offering actual gameplay, but theres little replay value. The other two modes are barely even interactive. The Beach puts you on a polygonal, low-fi island where you set your playlist  choosing from over a dozen electronica songs, including a selection from Harmonixs own Amplitude or your own MP3s loaded off a USB drive. But instead of letting us touch the music, you cant use the Move or the DualShock 4 to play. Instead, you just sit there, watching the equalizer on the horizon pulse to the beat. All you can do is look around, using your head as a mouse pointer to target certain items that will come alive if you lock in on them for a couple seconds. None create much of any surrounding virtual reality effect, because if you turn around to look behind you it just exits you back to the standard beach. Its supposed to be relaxing, I think, but I found it boring. Finally, theres The Trip, which also involves no controllers. You just sit there as you move through a kaleidoscope-y tunnel that thumps (sort of) in rhythm with your song. I didnt find it so much relaxing as just plain weird. Sadly, even loading an MP3 of 90s favorite Mr. Jones by Counting Crows didnt make any of these four music mini-games and passive experiences any less boring or more bearable. If my friends came over to check out my new $400 VR headset, Harmonix Music VR is the last thing Id want to show them.", "date": "Oct. 5, 2016,"}