{"name": "Mr. Robot: Season 2", "name_review": "Mr. Robot: Season 2 Review", "ref": "https://me.ign.com/en/mr-robot-season-2-1/124672/review/mr-robot-season-2-review", "text": "Note: This review contains full spoilers for Mr. Robot: Season 2 in the latter half, but you'll find a spoiler warning when those kick in. Sam Esmail's Mr. Robot continued to be one of the most unique experiences on TV this year, though perhaps dragged down a bit by overindulging in layers of cerebral trickery. When a series arrives on the scene that contains an offbeat tone and narrator -- be it Dexter or Twin Peaks (hey, Cooper sort of narrated his exploits) or what have you -- there are a couple of paths it can take. One road leads to a show hitting quickly, creating a ~lighting in a bottle~ effect that fizzles by Season 2 when the original hook fades and things start meandering. That was Twin Peaks. Then there's the chance the show can grow repetitive and defiantly outstay its welcome - or at least go past a point or story that felt like it could be the show's natural end. That's Dexter. What we saw with Mr. Robot's second season was a smidgen of Twin Peaks. The longer season hurt the series, as did some of the longer episodes. A tighter run would have kept the show focused and less apt to indulge in oddities that worked to create a template of straight-up bizarreness. Mr. Robot has a lot to say, and it has a great homage-style blueprint for getting its words out, but the last thing you want, in the end, is for viewers to dismiss it as being too gimmicky. The core of the season, from a Five/Nine hack standpoint, was the chaotic and messy aftermath of fsociety's Season 1 scheme. They struck a near-fatal blow at E Corp and now was the time to go in for the kill. But what did that mean? And were Darlene (Carly Chaikin) and the rest merely being used as disposable pawns in a greater plot hatched by Whiterose (BD Wong) and the Dark Army? Once the show honed in on this arc more specifically, in the back half of the season, things got grim and tense. The show felt like it had gotten back on track after the first half of Season 2 more devoted itself to Elliot (Rami Malek), in exile, warring with the Mr. Robot (Christian Slater) side of his brain while dealing with Craig Robinson's smooth criminal, Ray. It took a while for Elliot to accept Mr. Robot and stop trying to oust him from his brain. All so that, by the end, he could reverse his decision after discovering some of the darker, truer aspects of Mr. Robot. It was a case of Elliot being lied to by his own mind (for protection), and then lying to us as viewers (for protection) and pretty soon the story got buried several layers deep under cerebral coping mechanisms containing all sorts of imagined realities. All that being what it is, once Elliot eventually rejoined his crew the show felt like it was back on track. Not that the first half of the season was bad, just less disciplined. There were still great moments, but everyone's arc -- including Angela (Portia Doubleday) and Darlene's -- didn't begin to truly pick up until after episode 7, ~eps2.5_h4ndshake.sme,~ as Grace Gummer's Dom and the Dark Army began to truly close in on our heroes. Warning: Full spoilers for the season follow. You can skip to the Verdict section if you want to avoid. I don't mind the twists and turns that come with watching Mr. Robot. I also don't care about being able to spot some of the swerves ahead of time. Season 1 had a twist that many fans saw coming and that never stopped it from being devastating (of course, there was the added Darlene/sister twist too, compounding the effect). Season 2 however felt like it was drowning in hidden code at times, perhaps going to the well once too often. Mr. Robot features a severely fractured main character but the last thing you want is for ~Tonight on Mr. Robot, some crazy WTF stuff happens!~ to stand as a vague synopsis for every episode. The huge reveal that Elliot had been in prison, and not his mother's house, was this season's ace. Helping this turn stand apart from the Season 1 twist was the fact that Elliot himself had somehow ~fourth-walled~ the fake reality onto us, the viewers, when he (for the most part) knew where he was all along. It was a lie for our benefit. It was clever, but it didn't ultimately change anything like Season 1's surprise did. A few episodes later, the show would level us with a much more meaningful move, making Mr. Robot the fanatical architect of the Dark Army's ~Phase Two~ - which meant Mr. Robot stood as both an antagonist and a paternal protector. Oh, and he was prepared to die (and for Elliot to die) in order to go ~all the way~ with E Corp's obliteration. It was ferociously Fight Club, but it worked well. Likewise, at this time, Angela started getting cornered by the FBI while Darlene spiraled as the over-her-head leader of a crumbling fsociety. Whiterose was pulling strings from afar and someone was going to have to pay the price. What was Phase Two? Where was Tyrell (Martin Wallstrm)? What did Joanna's (Stephanie Corneliussen) side story have to do with anything? The finale wrapped up some of this, while also leaving us dangling over a ledge. Whiterose successfully converted Angela to his side (we still don't know how), Darlene got busted, and Elliot got shot while mistakenly thinking Mr. Robot was playing yet another mind game on him. Oh, and Joanna had been grooming Derek as a witness who could frame Scott for the murder of his own wife. It all worked really well, but you still got the feeling the series could have done more with less. Fewer episodes (with a shorter run time) and less reliance on cerebral shell games. Mr. Robot continued to dazzle us with sight and sound (I particularly enjoyed the use of PIL's ~The Order of Death~), and the choice to have Esmail direct every episode was a bold undertaking (as with other single-director shows like True Detective, The Knick, Quarry, etc). The second half of the season, which focused more on the dangers facing fsociety following Five/Nine, felt stronger than the first as Mr. Robot perhaps started to over-rely on cheat codes and mental mischief.", "date": "Oct. 3, 2016,"}