{"name": "Destiny: Rise of Iron", "name_review": "Destiny: Rise of Iron Review", "ref": "https://me.ign.com/en/destiny-rise-of-iron/124466/review/destiny-rise-of-iron-review", "text": "In a lot of ways, Destiny: Rise of Iron is more of the same. When it does the Destiny formula well, its polished with challenging combat and plenty for a veteran Guardian to do. A lot of the time, though, it falls into the same trap Destinys always been susceptible to and turns into a seemingly endless, repetitive grind. It often feels empty, even with a challenging and satisfying raid dangling as a big incentive. The new two-or-so-hour campaign is emblematic of how Rise of Iron as a whole stacks up. It definitely brings more of what I already like about Destiny, like taking on waves of spongy enemies in a series of fights that are all about your positioning in the area, but it does little to improve upon Destinys strengths or fix its problems. The difficulty mostly comes from a mysterious, virus-like nanotechnology called SIVA enhancing the power of the Fallen, which obviously makes them harder to kill. The campaign relies heavily on the buffed Fallen to be challenging rather than doing anything we havent seen from Destiny before. You kill a wave of Fallen, move to another room, and kill another wave of Fallen. Destinys combat remains as fun as its ever been, but thats the problem: its pretty much exactly the same in Rise of Iron, which raises the question of why this expansion exists at all. Enemies are all just reskins of existing ones  even the first mini-boss is a buffed-up version of Year One boss Sepiks Prime. Ive done all of it before. But, to its credit, the environments are familiar in a much more interesting way. Most of Rise of Irons new content takes place on Earth in areas weve already seen, but now that SIVAs literal tendrils cover the land there are new and clever places to take cover that make it feel fresh (or as fresh as a neurotechnology-infested ruin in what used to be Russia can possibly be). In a shooter that focuses on how you use your environment to survive a horde, an update to existing areas goes a long way. I've done all of it before. The new zone, Plaguelands, is a SIVA-infested expansion on the familiar Cosmodrome and complements the reimagined areas well, which makes it a compelling area to explore. Its a bit of an homage to Year One Destiny while still being a totally new location, and that makes fighting reskinned enemies a bit more interesting than it is elsewhere in the campaign. Tale as Old as Time The story itself unfolds more clearly than most in Destiny, which was refreshing, though its not a terribly good story in general. Its a lot to cover  the truth of what happened to the once-immortal Iron Lords and how the Fallen found SIVA in the first place  but Rise of Iron does it succinctly. The letdown is that without any original twist or surprises, it falls a bit flat by the end. The story of heroes who sacrifice themselves for the greater good can be exciting if done well, but Rise of Irons retelling is a simple and uninspired version of it. Its also a little short, and a lot of that is due to how combat in the campaign fails to match the scale of the threat portrayed by the plot. SIVA seems far too easily subdued considering how much its built up as an apocalyptic problem. Of course, like with other storylines in Destiny, youre not supposed to totally eliminate the threat or thered be no point in doing all the side quests and grinding against those new enemies. But the big reveal and subsequent (really fun) boss fight happen too close together, almost as if something was cut out. One mission, were just trying to get more information about SIVA, and the next were suddenly facing the baddies head on. Rise of Iron definitely didnt need to be nearly as long as The Taken Kings eight-hour campaign, but it was strange to go from a few missions of fighting regular waves to a much more intense, strategic boss fight without much of a ramp-up. Combat in the campaign fails to match the scale of the threat portrayed by the plot. Luckily, that pacing problem doesnt take too much away from that fight itself. Up until the end, combat is more about positioning than anything else, and its difficult because the waves of SIVA-infused Fallen can quickly overwhelm an area. Those initial missions are fun because I had to move constantly to cheat death, but theyre one-note in that what happens in any one mission is pretty similar to the next. The final fight required me to take what Id learned about positioning and apply it carefully, and it was the only time during the campaign that I felt like I needed a concrete strategy. Again and Again and Again Like in the campaign, the post-story gameplay of Rise of Iron is at its most interesting when bosses are in the mix. The new strike mission is like the final story mission boss fight in that it requires careful, more strategic positioning, and I loved it because it built upon the campaign while being different enough to not feel repetitive. Rise of Iron couldve used a lot more of that. Rise of Iron is at its most interesting when bosses are in the mix. After that, its disappointing that theres little to alleviate the repetition that comes in between finishing most of the new content and doing the raid. Playlists let you play random strikes to get better gear, but I hadnt leveled up much at all before Id exhausted them and had to start repeating those same strikes over and over. It definitely kept me and the most hardcore of my friends occupied for a while, but a few powerful new weapons werent enough to cure my intense sisyphean frustration. Archons Forge, the new Horde-style arena similar to The Taken Kings Court of Oryx, is a good place to experience those satisfying boss fights. But, like with a lot of things in Rise of Iron, the idea is not new  its just a slightly altered take on something weve already done. While combat holds up well here, too, its also not introducing a different or improved way to do the things Destinys been doing all along. The saving grace is a challenging, satisfying raid that combines greatly increased difficulty with far more intense tactics than anything else in the expansion. Each of the five sections (technically, including two with the same boss) builds on the last, and coordinating an effective strategy is as hard as it is to execute the first time around. It doesnt reinvent the Destiny raid, but its worth the grinding it takes to get there. Rise of Iron has just enough new content to keep me coming back for a while, but it feels like the bare minimum. When I wasnt absentmindedly grinding against reskinned enemies until I couldnt do it anymore, I was falling down the rabbit hole of side quests and trying out new weapons while patrolling the Plaguelands. The satisfying but still not groundbreaking raid is a decent reward at the end. I wish this expansion had focused more on fixing Destinys repetition problems, because it has a few good ideas  but with all its pitfalls, this is just Destiny going through the motions.", "date": "Sept. 28, 2016"}