{"name": "Virginia", "name_review": "Virginia Review", "ref": "https://me.ign.com/en/virginia/124312/review/virginia-review", "text": "The first thing we see in Virginias opening shot is a woman sliding a key into a locked box. The camera cuts away before we get to see whats inside, gracefully setting the tone for the haunting, enigmatic tale to follow. Whats most impressive about the interactive story that unfolds across Virginias emotionally compelling two hours is the depth of character and absorbing mystery it builds without a single line of dialogue. While there were times I wished I could break away from my limited role in its story, Virginias soaring symphonic score and brisk cinematic pace are so dense with drama that I was usually happy to play my part just to get the next piece of this beautifully crafted narrative puzzle. Virginia is told from the perspective of newly minted FBI Agent Anne Tarver, an ambitious rookie plagued by nightmares about her career and a recent loss in the family. Tarver is easily controlled in the first-person, with either a typical keyboard and mouse setup or just the mouse, with left-click to interact and right-click to conveniently walk forward. This is the extent of your control in this interactive story, which essentially has you acting out linear roles in scenes punctuated by clean cinematic cuts. Its easy to pick up and dive right into, though theres a strange motion blur effect that my GTX 760 didnt like, creating some annoying input lag. Reducing settings to medium resolved that (without much sacrifice considering the low-poly art style still looks good on medium settings), as did playing on a GTX 980. But even with the lag, I soon found myself so engrossed by Tarvers journey to the small town of Kingdom, Virginia that I hardly noticed. On her first day at the FBI, Tarver is partnered up with the secretive, stone-faced Maria Halperin to investigate a missing persons case, but also given a confidential directive from Internal Affairs to monitor Agent Halperin on the side. This sets Tarver and Halperins tense partnership into motion, giving every subtle, wordless gesture and awkward interaction between the two an exciting importance. Details carry so much weight that missing a single second can be like skipping an entire cutscene. Virginia is full of small, emotionally substantial moments like this; scenes that illustrate the tone of every action through smart body language and music rather than dialogue or exposition. Something as small as a sideways glance speaks volumes, heightening my awareness of its storys most minute details and demanding my attention in a way that made investigating the tiny, secretive town of Kingdom that much more engaging. The music (performed beautifully by the Prague Philharmonic Orchestra) is gorgeous, memorable, and often enough to carry or accompany the emotional weight of a scene in combination with its quieter elements. In one scene, you wander into the dark, cobwebbed hallways of the FBIs headquarters trying to find Halperins office, only to be greeted with an unimpressed glare and the cold shoulder from your strange new partner. Halperin will impatiently switch off the radio in her car if you try to turn it on, and make a prominent display of dining and dashing at a small-town cafe, leaving you, the pitiful rookie, with the bill. But despite her coldness towards you she also has a lot going on inside that makes her more than the cool, uncaring partner  she wears a cherished locket with an unidentified womans photo inside, entrusts you with her wedding ring during a mid-week visit to a bar, and lets you crash on her couch after a night of drinking beers on the water tower overlooking the town. In the morning, she cooks you two eggs and herself just one. Watching Tarver and Halperins friendship develop under the strain of an unsolved mystery and the looming possibility of your betrayal is one of the more riveting stories Ive experienced in a game this year. Virginias nuanced storytelling extends beyond just the relationship between Halperin and Tarver. A stick of lipstick tossed bitterly into the trash, two separate beds in a married couples bedroom, a father refusing to hug his son  details carry so much weight that missing a single second can be like skipping an entire cutscene or tearing a page from a book. Every little thing is deliberate and demands contemplation. This all culminates in an emotionally climactic ending that delivers satisfying answers to some questions, but also raises a few new ones, demanding I return to it twice as observant as before. Three complete playthroughs later I find myself still dwelling on even its most unassuming mysteries as I try to fully piece together the latter half of its increasingly surreal story. Multiple playthroughs is easy thanks to Virginias brisk pace and option to skip ahead to any one of its 41 chapters. Its a story you can complete in under two hours if you dont take it slow, though if you do choose to there are a number of collectable feathers and flowers scattered around certain scenes that give additional incentive to replay. While I had fun collecting them, I found that the frantic pixel-hunting required to track them down felt at odds with the somber tone or carefully crafted flow of most scenes. The story itself is enough of a reward for making a return visit. Despite each scene being very carefully put together and paced out, there were a few times where I wished Id had just a bit more freedom as Agent Tarver. Left-clicking the right objects or simply navigating to the correct location at the right time moves each scene forward in a strictly linear fashion, similar to interactive stories like Firewatch or Thirty Flights of Loving. This suits its snappier scenes well, where Tarver is fixed in place in a car or sifting through records in an FBI database. Virginia shows instead of tells. But in sections without this pre-existing momentum or urgency, where I was given time and space to wander and explore on my own accord, I found myself gravitating to things I couldnt do anything with. I wanted to put my hand on the shoulder of the mother whose son was missing. I wanted to explore my messy apartment  still full of moving boxes and adorned with beer bottle vases for the flowers Id collected around town  and see if there was something I could learn about Tarver that wasnt of immediate importance. In the end, though, my impact or interference in the story Virginia wanted to tell mattered less to me than the beautiful, ambiguous, and haunting conclusion it builds up to, which Im still left reflecting on almost a week later. Virginia shows instead of tells, with a raw, understated power and a calculated nuance that make even the smallest, most mundane details brim with narrative and emotional significance. While I never found a way to impact or change significant story events, the tale of family, friendship, career, and identity that Virginia tells (without uttering a single word) was enough of a reward for my limited input. The mysteries that remain by the end especially justified a second and third visit, and even now I can feel the secrets of Kingdom, Virginia and the two women whose lives changed there luring me back for another.", "date": "Sept. 23, 2016"}