{"name": "Mario Strikers: Battle League", "name_review": "Mario Strikers: Battle League Review", "ref": "https://me.ign.com/en/mario-strikers-battle-league/198328/review/mario-strikers-battle-league-review", "text": "Look, I enjoy the realism and attention to detail of a FIFA game as much as the next person, but sometimes you just want to swallow the soccer ball, pop it out as an egg, and then bounce that egg downfield until it hatches and wizzes past the goalie. Thats just one of the incredibly silly moments that only the Mario Strikers series can provide, and Mario Strikers: Battle League is no exception. Trying to outmaneuver your friends and score a goal while engaging in a distressing amount of cartoon violence with no referee in sight had me howling with laughter one second and snarling in anger the next, and you cant ask for much more than that. Although its been 15 years since Nintendo gave us the last Mario Strikers and shockingly little has been changed since then, that over-the-top mayhem and competitive intensity is a formula that holds up remarkably well.Mario's twisted version of soccer has two teams of four compete to kick, throw, headbutt, or butt-stomp a soccer ball into the rival teams net in a highly chaotic fashion that only bears the faintest resemblance to the real-world sport that inspired it. The premise is simple to pick up and learn in a matter of seconds, but whats impressive is how complex it can get as your skill and desire to win grows. Perfecting your power shots, learning to time your dodges, and figuring out how to best make use of on-field item pickups are all ways to make you a master out on the pitch. After a few hours of practice, it begins to feel similar to a well-tuned fighting game, where every action has a natural counter to it and each match becomes a test of your reflexes and ability to read your opponents intentions. That level of balance and depth is pleasantly surprising for what looks like a minigame you might find in Mario Party at first glance.A good example of that balance is in the ability to tackle enemy players to the ground at any time, immobilizing them for several seconds. That can feel pretty toxic if youre playing against an especially rude team, and you might even be subjected to the completely awful experience of being repeatedly tackled even when the ball isnt in your possession. But this scenario has a clever counter-measure: tackling someone who isnt in the immediate vicinity of the ball grants that team a free item to be used immediately. So if the enemy is playing especially dirty, theyre also arming you with stuff like a bob-omb that can be lobbed back at them or an invincibility star that can give you free reign of the field for several seconds.In order to become a Battle League champion, youll need to learn the ins and outs of both those basic soccer techniques like passing, shooting, tackling, and handling the ball, as well as the ridiculous stuff like items and making use of your characters special abilities and stats. While throwing a turtle shell at someones face brings no end of joy, the fundamentals still play a hugely important role in actually getting the ball in the net. For example, learning dodge at just the right moment grants you a short speed boost afterward, whereas getting the timing perfect when charging up your tackles or shots at the goalie makes them more effective  both of which can be extremely helpful in breaking through your opponents defenses....the fundamentals still play a hugely important role in actually getting the ball in the net. The characters youve chosen for your team are also an important factor in what youll be able to do in the heat of this fight of feet. If youre playing as Toad, for example, youll be extremely fast but will also need to charge up all of your tackles if you want any hope of being able to take the ball away from someone beefy like Bowser. If you play as Donkey Kong on the other hand, youll be a face-slapping machine but also much slower. If a character doesnt feel exactly the way you want them to, you can even buy gear with the coins youve earned from playing to augment their stats to be better in the areas you care about at the cost of being worse in others. Being able to tweak my Mario into a goalies worst nightmare with a maxed out Technique stat to curve my shots around them was extremely satisfying, and giving my Toad a full loadout of strength-enhancing gear so he could easily tackle some of the chunkiest enemies was enormously amusing. Plus, the gear actually changes each character visually, and dressing Rosalina up like shes straight out of Tron just looks cool.The other major difference between characters is their Hyper Strike: a unique ultimate ability that lets you execute an absolutely ridiculous move to score points. These can be activated after picking up a floating orb that spawns on the pitch and include everything from Wario smashing the ball with his stinky butt to Rosalina literally kicking it into outer space until it comes crashing back down to the field  utter insanity. One of my favorites is Peachs, who uses her charm to simply make the enemy fall in love with her so the goalie just voluntarily tosses the ball into his own net. Activating one of these moves requires clearing the field of enemy defenders so you can charge up your ability and play a short quicktime event to execute the move, but the risk involved is well worth it. Not only do you get to see a dope cutscene play out, but successfully pulling one off grants your team two points.This is all a lot of fun, but very little of Battle League strays far at all from what weve seen in the series before. Not only are all the central mechanics nearly identical to its predecessors on the Gamecube and Wii, but there are also fewer characters than in the past (just 10 total) which seems like an odd move. Theres no story mode or campaign of any kind either, and no game types aside from the standard one you play across every mode. Its a pretty bare bones package all-in-all, even if that package is extremely replayable.The main offline mode is called Cup Battles, where you enter your team in a routine and extremely brief tournament against computer-controlled opponents with a trophy up for grabs if you can best the enemy. These tournaments are a great way to learn the ropes and build up your skills before playing with friends or in matches online, but they offer few surprises and only minor differences between each of the cups you can enter into  usually just different AI teams that use slightly tweaked strategies and items from each other. The good news is that some of the later cups offer a greatly increased difficulty for those looking for an increased challenge against the AI, but I wish there was more diversity in what each of the tournaments offer....the leap forward in supporting a competitive landscape is a massively unexpected delight.Outside of the AI modes, it's pretty impressive that Battle League supports eight players on a single Switch, which makes it the perfect party game. Its hard to beat the friendship-testing onslaught of dividing a room full of people against one another in a sport so immediately confrontational. That said, its a little disappointing that you can only play as one of the four runners on each team while the goalies are always computer-controlled, especially since those goalies are sometimes grossly incompetent and wildly inconsistent in their skill level from moment-to-moment. It would have been nice to let me assign that job to a real human I know I can trust, or can at least direct my rage at.But the biggest improvements Battle League makes over past entries is in its online multiplayer, which lets you join or manage a Strikers Club where you and your friends can compete against other clubs in a ranked playlist and claim seasonal rewards for reaching different divisions. Compared to the very limited online functionality available in the Wii-era Strikers, the leap forward in supporting a competitive landscape is a massively unexpected delight. In my pre-release time with Battle League, I only briefly got to try out this mode, but so far it seems to have a surprising amount of bells and whistles to sustain a sweaty community of tryhards, which I fully intend to count myself among. My one gripe is that you can only join online matches with two players playing locally on the same Switch, which means you cant take a full in-person hangout online without multiple systems. Mario Strikers: Battle League is part skillful soccer game, part ruthless brawler, and almost always a complete blast to play. If youve played any games in the series before, there wont be many surprises in store for you and the small roster of characters and game modes is definitely disappointing, but whats there is incredibly fun and replayable. Im impressed by the online mode in the time Ive had with it so far too, as it sets the stage for a ranked playlist that I look forward to grinding my way to the top of.", "date": "June 8, 2022,"}