{"name": "Hardspace: Shipbreaker", "name_review": "Hardspace: Shipbreaker Review", "ref": "https://me.ign.com/en/hardspace-shipbreaker/198158/review/hardspace-shipbreaker-review", "text": "Its one thing to blow up a spaceship; its another to dismantle it piece by piece, systematically reducing it from a hulking barge to a pile of valuable scrap. Theres a great sense of satisfaction in doing that job well, especially when performing it efficiently requires careful planning and carries a not-insignificant risk of killing yourself in a wide variety of ways in the process. Hardspace: Shipbreaker does a fine job of empowering us to carve up these gigantic space turkeys like every day is Thanksgiving and smothers it in a thick blue collar gravy, but it does wear thin with time. By the end of its campaign, the repetitive objectives and intentionally slow progression made shipbreaking start to feel like exactly what its simulating: hard labor. Almost immediately upon stepping into the vacuum of space, an excellent tone is set with twangy music that takes me back to an early scene of the pilot episode of 2002s Firefly, where the crew raids a derelict ship for valuables by cutting through the hull and floating away with them. Swimming through a shipyard with a full six degrees of freedom feels serene and control is smooth, thanks in large part to the brake button that allows you to come to a stop more or less whenever you like (as long as you don't run out of thruster fuel). Physics aren't truly Newtonian, in that objects will eventually slow to a stop, but innertia is a powerful force to be reckoned with in both your own movement and when moving objects around. And while the graphics and lighting arent cutting edge by any means the spaceship designs are distinctive, often asymmetrical, and interesting  if I hadnt already known that the developer, Blackbird Interactive, is also at work on Homeworld 3, it wouldve been easy to guess.The plot isnt at all subtle about its comical corporate dystopia where workers are kept in indentured servitude to a tyrannical interstellar business empire that exploits them relentlessly, even resurrecting them after accidental deaths on the job so that they can continue to work off their crushing debt. There are a few good lines in there, such as a low air warning coming with a reminder that oxygen deprivation can cause a loss of company profits, but its largely on the nose and its humor relies entirely on that simple setup. The story that plays out over unskippable audio is equally one-note, with your faceless, mute characters crew of salvagers being basically forced to unionize to fight back against their corporate overlords. There are twists, but theyre so clearly telegraphed that theres not much by way of memorable moments or surprises, and the supervisor villain is a standard-issue middle-management caricature. Outside of that, theres a fair amount of world-building lore to be found in emails and data drives you can retrieve from salvage missions, though I never came across anything revelatory.Explosive decompression can blast you into walls with enough force to splatter you like a bug on a windshield.Dismantling a large spaceship in zero gravity is definitely a rewarding exercise. It boils down to zapping yellow bits that join hull plates together with your cutting laser, then using your handheld tractor beam and deployable tethers to toss chunks of scrap and machinery into whichever of the red, blue, or green ports in the surrounding space station youre told to. While certain materials can be cleaved apart freeform with your lasers wide beam mode, most of the cutting has a paint-by-numbers feel to it because only those cut points can be disintegrated. However, upon approaching a new ship you do have to worry about explosive decompression which  if you cut into a hull improperly  can not only launch precious salvage out into space and destroy sensitive equipment, but also blast you into walls with enough force to splatter you like a bug on a windshield. Making sure to separate out different types of components takes a keen eye and the use of your suits sensor views if youre trying to get the absolute maximum out of every salvage operation  thats something I wish could be automated to a certain degree, because its frustrating to be penalized for missing a single light fixture or neglecting to manually detach every last computer console and door control aboard before you toss a chunk of hull into the furnace, and it becomes a chore to then hurl each of those small pieces into their own receptacle individually.Where shipbreaking gets more complicated is when youre handling the valuable reactor, which is very much like disarming a bomb. While a Type 1 reactor can simply be grabbed and tossed into the recepticle before it goes critical, more advanced versions have an order of operations that must be completed first to maximize the amount of time you have between when its detached from its housing and when it goes boom, causing an explosion that makes my GeForce RTX 3080 cry uncle as it tries to keep up with all of the resulting chunks of shrapnel. That has the same tension as figuring out whether to cut the red wire or the yellow wire on an explosive first, and mistakenly firing your cutting beam at a fuel line that hasnt been flushed yet can instantly vaporize you (sometimes a bit unfairly, if you ask me) and spray tiny fragments of the ships hull everywhere. But pretty much everything is spelled out for you if you know where to look in the tooltips that pop up when you target something, so it never felt obtuse.What Shipbreaker desperately needs to keep things interesting is different objectives.There are several different classes of ship to dissect, each of which has its own layout, reactor configuration, and peculiarities you must learn to disassemble them efficiently. Thats a good initial challenge, but what Shipbreaker desperately needs to keep things interesting is different objectives within that  beyond simply breaking a ship down into its parts  and those rarely pop up. I enjoyed it most when I was given a secondary shopping list of parts to acquire to work on a side project, but that only goes so far and is even removed entirely for the third act for story reasons that dont replace it with anything else to do. Also, when mysterious ghost ships arrived to be disassembled I was intrigued but was let down when it turned out to be what amounted to barnacles that must be lasered off before turning in a piece of salvage. (The music takes on a nice spooky tone for those, at least.) Even when you unlock the remote-detonating demolition charges, nothing really changes because those simply allow you to destroy cut points that are rated too high for your laser  and I didnt encounter more than a handful before I unlocked the charges.As time went on in my 35-hour playthrough I wanted more variety and more pressure, or more ways to subvert the authority of the evil corporation through sabotage or other covert action, but it never came. Unlike that scene from Firefly where Mal, Zoe, and Jayne have to improvise to get back to Serenity before an Alliance ship catches them in the midst of their illegal salvage operation, in Hardspace theres never any tension or reason to hurry beyond the threat of meaningless fees. The ships may be varied in shape and size, but every salvage operation takes place in the same spacedock facility and youre always alone, never at risk from anything but your own carelessness. It isnt until the final mission that the objective is shaken up at all, and thats in the most basic of ways, with only one iteration on that idea to play with. It took me 25 ships to complete the story, with each one taking an average of an hour and a half to hack to pieces  and that, frankly, was about twice as many as Id have expected given the amount of content here. The fees you incur by moving slowly are meaningless because Hardspaces economy makes no sense. For the entirety of the campaign youre trying to work your way out from under a mountain of debt $1.2 billion tall, which means that unless youre keeping careful tabs on your ledger you might not even notice the dent that a $10 million haul makes in the total. It certainly drives home the storys point about being effectively trapped in this Sisyphean servitude forever, especially when you finish a shift and are presented with a screen tallying up the charges youve incurred  such as equipment rentals and administrative fees  that take a sizable chunk of your earnings back. At the same time, when the number is so big it makes decisions like whether to buy equipment repair kits for $9,000 or to wait as long as you can to top off your thruster fuel for $10,000 per charge seem utterly inconsequential (unless youre competing on the scoreboards for every penny in the free-play mode). You're already deep in the hole and can never run out of money to spend, so what's a little more? Besides which, its not like you have a choice of whether or not to buy oxygen for $16,000 per tank anyway  the alternative isnt great.You're always alone, never at risk from anything but your own carelessness. So while it purports to be all about money, and thats whats constantly shown in the largest fonts at every opportunity, in reality, Hardspaces true currencies are the two types of points you earn for filling each increment on the salvage bar. One of these lets you improve your tools with mostly dull, incremental upgrades like better cooldown speeds, capacities, and durabilities that dont do much to change how you play, while the other ranks you up, which in turn unlocks new upgrades to be purchased and progresses the story. Its oddly camouflaged, though I suppose you could interpret that as a message that money isnt whats really important.But if thats so, whats with the time limits on shifts? Every time you go out into the shipyard youre given a 15-minute countdown within which youre encouraged to do as much work as possible, and at the end youre booted back to your dormitory. Then you can simply go back to the ship you were working on in the next shift (or move onto a new one if youre satisfied youve done all thats worthwhile) with the only cost being the monetary fees associated with each outing. That makes the entire concept of getting pulled out for the end of a shift feel as pointless as the money does, and the fact that you already have to return to your base every few minutes to restock oxygen and thruster fuel makes it just another annoying interruption. Sure, your living quarters have a nice lived-in feel and its a nice touch that you can customize it with posters you pick up from the ships youre salvaging, but its off putting to go from the freedom of zero-G movement to the oddly constricted movement system where you cant even walk freely, only move from station to station.It should be noted that you can turn shift timers (along with oxygen and fuel limits) off in the non-standard Open Shift mode, and if I were to play through the campaign again I definitely would. The puzzle-like concept of dismantling Hardspace: Shipbreakers starships in zero-G is sound and its actually very fulfilling and Zen-like to learn to do it well, especially to the tune of its mellow Americana soundtrack. When youre still learning the ropes, extracting a reactor without blowing yourself to Hell is a tense kind of slow-paced action. The problem is that outside of its handful of ship types with different layouts and reactor disassembly procedures, that task is almost never evolved or riffed on in any meaningful ways, so it descends into routine labor fairly quickly. At the same time, Hardspace's use of money may be thematically appropriate to the amusing corporate dystopia, but being crushed under such a giant mountain of debt makes several other systems feel like pointless inconveniences rather than decisions on how to spend your resources or a sense of progression. The fact that the story requires so much padded-out repetition of the same tasks eventually lets all the air out of it well before completion.", "date": "June 4, 2022,"}