{"name": "The Turing Test", "name_review": "The Turing Test Review", "ref": "https://me.ign.com/en/the-turing-test/123446/review/the-turing-test-review", "text": "While The Turing Test generally walks an interesting if familiar line, it excels when it introduces some genuinely fresh ideas in its latter half. In the first, The Turing Test is a traditional first-person puzzler in which you navigate a series of rooms in a desolate research facility and solve a bunch of single-serving challenges, all while a questionable AI narrator guides you. Its devoid of Portals incredible humor, but the writing and acting do a good job of posing interesting questions revolving around free will, what it means to be human, and of course, the artificial intelligence test from which this game draws its name. The Turing Test also throws in an effective bit of environmental storytelling which has you parsing through personal items left behind by the researchers who formerly inhabited the Europa Space Station facility. Im a sucker for learning about characters through this Gone Home-esque style of voyeurism, and The Turing Test handles it well. This adds a nice bit of personality to the seven-hour experience. That said, the environments themselves always felt a bit too familiar and unremarkable. Like Portal, most of the chambers feel like antiseptic hospital rooms with splashes of colored lights to guide your eye towards an important piece of the puzzle. While none of this is necessarily bad, Europa Station never developed a sense of character in and of itself like Aperture Science did in Valves games when the facade fell. All of these puzzle elements are familiar.While none of The Turing Tests puzzle elements are bad, theyre all familiar to anybody whos played a modern first-person puzzle game. Mechanically, the goal of each of the 70-ish rooms in The Turing Test is powering up a specific number of batteries needed to open a door and progress into a new room. This is done by either physically moving power cubes from place to place or using your energy gun to transfer electricity from one spot to another. All of this is compounded by the slow trickle of familiar obstacles like moveable walkways, magnetic cranes, and elevating platforms. The arrangements of these are new, but their concepts are familiar and never made me think outside the box. The Turing Test usually seems content with merely scratching the surface of an idea.And unlike superb games like Portal or The Witness, its ideas are never stretched to their limits. The Turing Test usually seems content with merely scratching the surface of an idea or mechanic without really digging deeply into it. This was disappointing because The Turing Test shines when it combines many of its familiar elements into something new, and if fleshed out more these mightve been right up there with some of the mechanics that Portal perfected. Even as the number of variables in a given puzzle continued to grow throughout the campaign, I never really found myself overwhelmed in any given challenge, which actually disappointed me. I like my puzzle games to knock me around a bit and force me to really wrap my brain around its mechanics to figure out how to progress. As they stand, challenges throughout most of The Turing Test are generally simplistic to mentally solve, but oftentimes devolve into mostly physically demanding tasks. I far too often found myself figuring out a solution quickly, only to have to go through the chore-like series of moves to actually navigate myself through it. This led to some pacing problems that had me sighing my way through a handful of puzzles. Instead of trigger those aha! moments that make a truly great puzzle game, it felt more like I was just going through the motions. But while the first two-thirds of The Turing Test definitely fell into the been-there-done-that realm, theres a super smart twist in the later on that flips the whole thing on its head. I wont spoil it, but it the way it subverts expectations and marries the story and mechanics that had at that point become all too familiar is genuinely original and incredibly interesting. That moment and the challenges that followed made up for a few hours of ho-hum puzzle solving. As someone who loves games like Portal and The Witness, The Turing Test definitely scratched that familiar puzzle itch, even if it fails to scratch more than the surface of most of its ideas. Its mechanics are solid but largely unoriginal, and its themes and world-building are genuinely great. And while it never reaches the originality and heights of its inspirations, it still manages to deliver an interesting world with one heck of a twist.", "date": "Sept. 1, 2016,"}