{"name": "Master of Orion", "name_review": "Master of Orion Review", "ref": "https://me.ign.com/en/master-of-orion-wargaming/123252/review/master-of-orion-review", "text": "An unremarkable 4X game by any other name is just as unexciting, even if that name is one of the great nostalgic darlings of strategy games past. In the case of NGD Studios Master of Orion reboot, wrapping itself in a legendary title and attempting to distinguish itself with flashy real-time combat and an all-star voice cast dont make its bog-standard turn-based backbone any easier to get excited about. I dont want to spend this whole review comparing the New-MOO to the old, because when put directly side by side this game is arguably better. But the reason the original and its sequel hold a special place in gaming history are because of a pioneering spirit thats simply lacking from this conservative reimagining. In the mid-90s Masters of Orion 1 and 2 offered a thrilling galaxy beckoning for exploration that inspired the imagination. But by modern standards New-MOO feels small and mundane. I feel like Im looking at a diagram of a galaxy in a middle school textbook rather than an adventure-laden expanse of space. Its something that has been done many times recently, and better. The series signature race designer makes a return, but most of the bonuses available to customize your robot people or bug people or plain ol people people are of the flat, plus-some-percentage to resource generation type. With a couple of exceptions, most pre-set and custom races will play roughly the same. Even mechanical entities need food for some reason, there arent any race-specific techs or ship types, and almost everyone can get along just fine on any habitable planet type. Alien races have some very cool animated leaders and advisers with excellent voice acting.One area where New-MOO does a fine job of recreating the wow moments of the original is in the diplomacy screen. The alien races have some very cool animated leaders and advisers with excellent voice acting. Top-tier sci-fi alumni abound, from Star Trek: The Next Generations John de Lancie as the charismatic and imposing human president and Michael Dorn as the booming narrator, to Fireflys Alan Tudyk as a quirky, big-headed alien scientist. I wasnt the biggest fan of the robotic news anchors who show up from time to time to present a comedic update on the state of the galaxy, which felt like a tonal break from most of the rest of this self-serious universe, but the rest of the cast of racial leaders and advisers were a treat to converse with. Unfortunately, I dont get the sense that these larger-than-life characters are the ones making decisions for their races on the strategic map. As a matter of fact, their behavior often seems to be guided by nothing but nonsense. For example, I would often use a small fleet to block off my sovereign space from pirates. Almost inevitably, a fleet from some neighboring empire - usually one I was on good terms with - would show up to blow up my blockade, without even declaring war, then go home for no reason I could see. Any ship in your combat fleet can be controlled directly on the battle map.At least when I was randomly getting my ships shot to pieces I was treated to some highly enjoyable, highly tactical real-time combat. Any ship in your combat fleet can be controlled directly on the battle map like an RTS unit, and more hands-off admirals have control over interesting and useful options like engagement range, thruster settings, and formation. Theres also a ubiquitous ship designer, though I found myself most often defaulting to the recommended loadout for my combination of unlocked technologies rather than tweaking every ship design every time I developed a new shield modulator. Its not quite Homeworld-level spaceship combat, but for what is mostly a turn-based game the skill cap of these battles is quite high and creates lots of opportunities for stunning, against-the-odds victories. I once outmaneuvered a massive armada of bloodthirsty cat aliens with my scrappy sector defense fleets of stock frigates, sending them licking their wounds and preventing a full-scale invasion of my core worlds. New-MOO's battle engine could be spun off as its own separate spaceship skirmish game, and if it were it would be a respectable one. Alas, the strategic map is a pretty dull and pedestrian recreation of old-school MOO, which means it feels just like nearly every space 4X Ive played in the past couple of decades. After hundreds of turns of colonizing planets in star system after generic star system and routinely balancing my population between food, production, and science output, I craved something creative or out of the ordinary to shake up the routine. But New-MOO fails to really take chances or borrow cues from all the evolution that has gone on in the strategy sphere since the 90s. The most interesting run I had was when I created a challenge of my own devising, building a race of expert farmers and using our sprawling homeworld as a breadbasket, shipping its ever-teeming population out to my backwater colonies on transport ships to jump start their own labor bases. Most of the goals New-MOO lays out for you are straightforward and uninteresting.But most of the time the goals New-MOO lays out for you are straightforward and uninteresting. Find a new system. Kill the pirates. Set up a colony. Terraform it to be more habitable. Repeat. A pollution system that requires you to manage the ecology on your more industrialized planets tries to throw a wrench into this formula, but only really succeeds in forcing you to stop production to put your workforce on a giant roadside cleanup operation every couple dozen turns. Theres not much thats outright wrong with Master of Orion, but theres not much memorable or endearing about it either. Its built on a moderately successful but bland execution of the inside-the-box space 4X formula. The moments when its flair for leader characterization and an enjoyably complex combat engine take center stage are the only times anything about it really stands out. Theres definitely enough game here that I wouldnt turn anyone away from giving it a spin, but I also cant say youd be missing anything special by skipping it.", "date": "Aug. 28, 2016,"}