{"name": "Madden NFL 17", "name_review": "Madden NFL 17 Review", "ref": "https://me.ign.com/en/madden-nfl-2017/122939/review/madden-nfl-17-review", "text": "There isnt much better than going head-to-head against my buddies in a good Madden game, talking trash, bragging about that big play, and flaunting my victories to the point of unsportsmanlike conduct. Madden NFL 17 couples all of that with elevated gameplay mechanics, improved on-field player interactions, and a long-awaited emphasis on franchise mode. Its great to see that this series has finally found the sweet spot it hasnt seen since Madden NFL 05. Madden 17s gameplay has risen above the last decades worth of iterations, and it starts with the feel I get when I grab the sticks. Madden 15 and Madden 16 focused gameplay tuning on defense and receiving, respectfully, due to the NFLs shift towards the two play styles. It was EAs reaction to the shift in the NFL. I was surprised to see the limelight on the running game this year, mainly because its EA with a proactive approach, a refreshing turn of events for the studio. This year Madden continues to strengthen its gameplay by integrating the consistent button-pressing mini-game into the ground game. It gives you options to spin, juke, and stiff-arm, and its invigorating to scamper for a long gain thanks to a well-timed spin-break-spin combo. The new ground game is refreshing, keeping you honest on both offense and defense. Its so easy to get caught up in pass after pass in todays NFL, but with such a large emphasis in Madden NFL 17s run game it encourages you to be patient and to run an offense the way its meant to be in the real sport. Seeing play styles come across so fluidly creates realism. For example, the Vikings run a ground-heavy attack with Adrian Peterson, as do the Titans with the newly acquired DeMarco Murray. Peterson and Murray bowl through opponents, shove them to the ground, and fight for the extra yards. Thats a great positive contrast to Madden 16, where each team felt so similar on the ground that it didnt matter if you were using Peterson or Murray or some no-name rookie. Seeing these play styles come across so fluidly in Madden 17 creates the realism factor the game has been sorely missing. Part of the reason the run game works so well with the Vikings and Titans is because of the above-average offensive line each team rosters. I was easily able to gain downhill momentum to carry Murray to extra yardage, and it was awesome using Petersons strength to keep pushing defenders to the ground thanks the holes created. Meanwhile a team like the Seahawks, who have one of the highest team ratings, sports one of the lowest-rated lines around. Playing as them its tough to run between the tackles as the line gets pushed around. Even on pass plays, I found myself using Russell Wilsons legs as an escape route to avoid pressure. Again, this tweak to the ground game balance makes a team play more like its real-life counterpart than ever before. In addition, broadcast camera angles during and between plays represent a lifelike television experience Ive grown to love. The improved realism doesnt stop on one side of the ball. Newly introduced gap assignments have me focused more on the defensive front seven, giving me the opportunity to shut down any given play if executed properly. Thats a huge and important change, because in the past few Maddens the defensive gameplay has been so boring I felt like I could put the controller down and let the CPU play for me. Now Im engaged on every single defensive play, because you have to be in order to succeed. Its like theres an entire half of the game that wasnt there before. Plus, I can trust my AI teammates to make plays and stay where they need to. And as players crash through each other during play, slick and unobtrusive in-game overlays effectively convey essential stat information, such as rushing yards, tackles and pass completions. At the same time there are a few new features that flounder. There was a lot of offseason jargon about letting special teams make an impact in Madden 17, and in the lead up to starting launching the game I enjoyed drills on how to block kicks, run trick plays, and strategically punt. They all worked surprisingly well in the training mode, and found myself smirking after a perfectly blocked field goal thinking about how Id use these moves on the field. But once I entered real gameplay, special teams felt the same as it always has. After playing multiple games I didnt once have a successful attempt at blocking a kick or punt. They should be few and far between to feel realistic  I get that  but after all of that training I expected to have at least one special teams play that truly shifted a games outcome. Their rarity is disappointing. Each of these new gameplay mechanics can seem daunting, especially for a Madden newcomer. I would recommend trying out the Skill Trainer, which will teach you how to read formations and play the right coverages. Its beginner mode, but its where champions are made. The instructions make the basics of Madden 17 simple and easy to learn. Ive been playing since Madden 01, and I still jump in for a refresher every season. The duo of Brandon Gaudin and Charles Davis taking over in the booth for commentary is a long overdue change, but despite EAs promise that this would be a more conversational commentary team, Im not convinced. The play-by-play from Gaudin sounds very similar to past versions. Davis commentary is okay, as he does have player-specific lines that tell stories of yesteryear, but that comes with the drawback that I was already hearing repeated lines in the second game I played. Wheres the banter? Wheres the chemistry? There is EAs promise of updated and relevant commentary throughout the season, but as of now Im unimpressed. This pair of wet blankets set the presentation back a few notches. As expected from an annual update, popular modes such as Madden Ultimate Team and Draft Champions have returned largely unchanged. Ultimate Team has added additional customization options as well as a new chemistry feature, while Draft Champions is identical. Ill be the first to admit Im not the biggest fan of the collectible trading card modes, but this years game has such a huge focus on gameplay and franchise that most everything else is secondary. Living The Dream I love being able to take control of a franchise; its my favorite mode in any sports game. Its that gratifying feeling of drafting a super stud in the fifth round and seeing him develop into a top-tier talent. In Maddens upgraded Franchise mode, that concept is kicked into overdrive and gives me everything I want at a more rapid pace. This new mode has me flying through each week of my franchise completing every single task. Franchises new Play the Moments super-sim mode places you into a game only during key moments, like third downs, red zones, and defensive stands. Ive never been a super-sim fan before, but this new mode has me flying through each week of my franchise completing every single task. Its great that Play the Moments gets me through a game with realistic statistics within 30 minutes, leaving ample time to complete weekly tasks. In another very smart tweak, upgrading players now happens immediately following a game, with practice second on the list. I used to skip all of these tasks to get to the next week as quickly as possible, but now it keeps a constant flow of progression. All of them are now pieces that are vital for success. It reminds me of how immersed I used to get with EAs old NCAA Football franchise, which is a sports gaming compliment of the highest order. The already-awesome scouting system returns, but the biggest changes happen during the NFL Draft. The coolest part is how you will receive feedback immediately following your draft pick, showing the players overall True Talent ranking compared to his draft selection. Even better is the AIs competency; teams actually draft based on need! My jaw dropped looking at the positional needs lining up with the teams in the draft. I was pumped to see the Bears take a quarterback at No. 1 overall; Seeing the 49ers trade up and reach for a quarterback at No. 6 was even better. Realism! At offseasons end you can move onto preseason, or you can sim ahead a full decade  an option that simulation nuts like myself love. When I tried it, to my surprise each team was balanced with only a few superstars scattered throughout the league, including the aforementioned Bears draft pick sitting pretty at 95 overall. The majority of the league was filled with EAs created draft classes, but it was properly balanced throughout each roster - proof that the progression system is working. Major community-requested features have been added as well. Full player editing and accurate equipment pieces add another level of customization that the franchise has been lacking for years. The score ticker has also been added, sharing scores and stats from across other games at the bottom of your screen. The ticker will highlight important updates, including divisional opponents. I found myself getting excited seeing my rivals fall as I was gaining them in the standings. My personal favorite, which had been absent from this series for far too long, is the return of formation subs. These seem like small details, but its all necessary to recreate a Sunday afternoon in loving detail. Im already itching to restart my franchise when the season begins. Madden has finally found its comfort zone between the tackles, and offense and defense have reached a great balance. The communitys gameplay wishes were granted with a new focus on Franchise mode, led by the Play the Moments feature. Outside of its mood-killing commentators, Madden 17 is just about everything weve been waiting for since EA Sports took full control of the NFL license. Football is back, and its only a yard or two short of becoming an all-time great. <i>[Disclosure: Dustin Toms once worked with a colleague who is now an employee of EA Tiburon.]</i>", "date": "Aug. 21, 2016,"}