{"name": "Kao the Kangaroo", "name_review": "Kao the Kangaroo Review", "ref": "https://me.ign.com/en/kao-the-kangaroo/197944/review/kao-the-kangaroo-review", "text": "Kao the Kangaroo reminded me why I fell in love with 3D platformers back in the N64 days. While I missed the Dreamcast console-exclusive original back in the day, it surprised me how familiar this reboot of the 22-year-old series felt, though the revived Kao doesnt exactly try hiding how its looked to other modern platformers to create a highly derivative comfort-food experience. Its a lot of fun, colorful, and certainly rather nostalgic; just dont come in expecting a Crash Bandicoot 4-level challenge. Stories of heroes rescuing loved ones against the odds is nothing new in this genre, so suffice it to say that Kaos not breaking from tradition here. Dialogue couldve been stronger, too; theres good humor to it, but thats sometimes weakened by outdated pop-culture references. Kaos mom referencing taking an arrow to the knee is hardly topical, and the younger crowd a game like this is aimed at probably wont recognise it. Still, theres a pleasant cast joining our young hero like his wise teacher, Walt, whose more grounded nature keeps scenes entertaining by acting as an effective straight man for Kao. Now, this wouldnt be much of a mascot platformer without wildly varied environments, and Kao packs four visually appealing worlds. Between the uncomfortably warm Lava Caves hiding within the sunny Hopalloo Island, Hungry Jungles tropical sights, and the (hopefully) self-explanatory Frozen Mountains, theyre fun to explore even if they fall into the usual tropes. Each location serves as a hub thats filled with collectibles, though runes are the only batch you actually need to concern yourself with, since they unlock new levels. Once you begin exploring, Kao quickly finds his fathers old boxing gloves, which absurdly happen to be home to a strange and sassy entity who provides him with supernatural abilities. Alongside your standard jabs and combo strikes, Kao can build up to powerful finishers by hitting multiple enemies. These gloves also store up to three elemental charges, starting with fire before unlocking ice and electricity. They provide some nice visual flair to his finishers but, more importantly, also help him clear platforming obstacles like spider webs or freeze water to create a bridge. Otherwise, Kaos dodge-roll also attacks enemies, making it a blessing for defensive strategy, with an understandable trade-off in that these dont hit nearly as hard as a straight punch. Traditional ideas are sampled and remixed effectively enough.Kao's packing some strong moves and the new developer, Tate, has given us plenty to do with them by providing us with decent enemy variety. Weve got the usual grunts taking swipes at you up close, but things like goats firing sheep at you with a launcher keep this interesting. Every worlds capped off with a boss fight, each of whom provide some fresh tricks -- I wont spoil them all, but Hopalloo Islands boss, Terror, leaves a trail of fire behind him after attacking, while Hungry Jungles Jayabaya lobs projectiles from afar that Kao can punch straight back. Nothing groundbreaking, sure, but enough to avoid predictability.Between climbing across vines using his ears, grappling across floating hooks, and making temporary platforms appear once youve struck a purple crystal, levels carefully and effectively avoid repetition. Theres the odd bit of puzzle solving too, including one challenge where Kao must link the lines together on a crystal to make it whole, clearing your path upon completion. Another level had me running away from an enemy rolling towards Kao on a giant log, taking clear inspiration from Crash Bandicoots Boulder Dash. Again, nothing entirely original, but traditional ideas are sampled and remixed effectively enough.Youll find no end of hidden secrets, so Id recommend thorough exploration. Are there secrets behind those waterfalls? You bet! Levels hide plenty of collectibles: between extra lives, heart pieces, treasure chests packed with coins, and diamonds, theres plenty to grab, and cash can buy new costumes from each hub worlds shop. That includes a retro look for Kao, which will likely please original fans. Every level also hides three letters spelling KAO, which can be tricky to find, and some enemies drop scrolls that unlock fresh lore for the Kaopedia. If youre not feeling it for another platformer collectathon, fear not. Like I said before, only runes are essential for progression and nothing else is mandatory. But it does beg the question; why are some of these even here? The letters can be tricky to find, much like it was in Donkey Kong Country, so I understand theres a sense of accomplishment in finding them. But across my entire playthrough, I couldnt find any practical use for these collectible diamonds. That includes during the post-game, which takes you back to before the creative final fight, letting you complete things you missed.Kao is fairly quick, but it felt like the right length.Thankfully, items arent the only secrets found during exploration. There are 14 mini bonus levels, known as Eternal Wells, hidden within these stages, and each requires you to complete a set challenge. That can be something simple, like defeating several waves of enemies, though more commonly it involves completing trickier platforming challenges, earning more coins, or collecting more diamonds. Each hub world contains a separate Well, so if you find one but struggle to complete it you can still go back at any time, theres no need to dive into the main levels and find it again.That said, even after beating those wells, Kao is a quick experience that needed just nine hours to complete, taking 20 mins on average per level. If youre not fussed about exploration or the Eternal Wells and are simply here to see this campaign through, youd probably manage it in about seven or eight hours. In fairness, though, not many platformers are longer than that; big-name games like Ratchet and Clank: Rift Apart and Super Mario Odyssey are one thing, but smaller efforts like A Hat in Time or Ary and the Secret of Seasons clock in at similar lengths. Im just glad Kao doesnt overstay his welcome -- it felt like the right length, and Tates balanced this well.The main problem was that I just didnt find it particularly tough, and theres no difficulty settings to crank this up to challenge me on a second playthrough. Its not a complete cakewalk, (that dodge roll comes in handy when confronted by enemy groups), but those extra lives scattered everywhere quickly stack up. Death came infrequently, even more so once I began finding heart pieces to increase Kaos health. I didnt mind this so much, though. I wont pretend this structure doesnt feel formulaic after four worlds, yet Kao nails the basics. Kao the Kangaroo does an excellent job making me nostalgic for an old-school 3D platforming series Id never played. It doesnt try too hard to be gimmicky, packing a colourful aesthetic and light-hearted humor to carry it through the parts where it feels unoriginal. You probably wont find it particularly challenging outside of a few tougher platforming segments -- combats rather easy, and some may find the collectathon premise off-putting. Still, I never found it dull and Tates done a fine job reviving this obscure mascot, even if you can spot Kaos many modern influences from a mile off. If all youre after is a comfy platformer thats not particularly demanding, youll find an excellent choice here.", "date": "May 28, 2022,"}