{"name": "Deus Ex: Mankind Divided", "name_review": "Deus Ex: Mankind Divided Review", "ref": "https://me.ign.com/en/deus-ex-mankind-divided-1/122909/review/deus-ex-mankind-divided-review", "text": "Any game bearing the Deus Ex name sets a high bar for itself, and yet, Deus Ex: Mankind Divided clears it handily. The followup to Deus Ex: Human Revolution retains the strong gameplay blueprint of choice-driven stealth and RPG gameplay that defines the series, but its superlative map and mission designs elevate it to new highs. Mankind Divideds gorgeously realized version of Prague is deeply infused with meaty, multi-part quests that give you plenty of chances to leverage its toy chest of cool gadgets and abilities. Its story is just slightly limited in scope compared to the far-reaching conspiracies the plot often alludes to, but in terms of raw gameplay, this is the best the series has ever been. Even more so than its predecessors, this iteration of Deus Ex succeeds in making me feel like a cybernetically enhanced super agent that no security system can withstand. A handful of powerful, sexy new experimental augments that you can wire into grizzled cyborg protagonist Adam Jensen are at least partially to thank for that. The energy-draining Titan Armor ripples angrily as it shrugs off everything from bullets to grenades, the Tesla Arm attachment locks onto and incapacitates multiple targets at range, and when someone absolutely needs to die immediately, the arm-mounted nanoblade launcher pierces flesh and armor alike - knocking its target clean off their feet and pinning the corpse to the nearest wall with tremendous force. Theyd almost be too powerful if not for the associated energy and ammo costs that come with them, which are fine-tuned so that I wasnt too shy to use one, but it still felt a little bit special every time I made the decision to pull the trigger. Prague Is Your Playground These deviously fun gadgets would be good on their own, but its the thoughtfully crafted environments that tease out their true potential. For instance, the Icarus Dash allows you to cover short distances in the blink of an eye, which makes it a fine escape tool. Its also a great gap-closer for swiftly knocking out guards from a few paces out. But it wasnt until I started noticing subtle new routes I could take towards objectives that I was sold on it. I once used it to dash across a series of rafters high above an entire roomful of enemies with none of them the wiser. More often, I used it to dash directly from ground level up to a second-story window. That particular use synergizes perfectly with the Remote Hacking aug, which is probably the most transformative upgrade. Experimenting with it allows you to manipulate everything from laser grids and mines to ladders and window shutters, opening up whole new possibilities I had no idea were there upon first glance. Remote hacking a second-floor window shutter and then Icarus Dashing up to it became my favorite one-two punch of stealthy infiltration, granting me easy access to more than a few places where the front door wasnt an option. This harmonious relationship between mechanics and environmental design extends to the returning augments as well, lending a sense of value and purpose to even the most basic-seeming of upgrades. Being able to leap, sneak, muscle, or hack my way into almost anywhere wouldnt mean much if there wasnt anything there worth discovering, but my feats of high-tech infiltration were always rewarded in one way or another. An innocent-looking curio shop might have a secret passage leading to a storage locker full of valuable items, or sneaking through a neighboring apartment might lead to you stumbling into one of the meaty multi-part sidequests. Its a little surprising that Eidos Montreal is willing to allow us to overlook those if we dont search thoroughly because in terms of complexity and design these optional adventures are no less sophisticated than the main questline. You wont find any simple hit jobs or fetch quests here; these are long-form assignments with lots of moving parts, and they require you to find one of several possible solutions at every step. What's the answer? Hint: there isn't one  there are TEN. They usually begin simply, with a random email Id read on a laptop Id hacked or a shady police officer claiming I didnt have the proper papers to get through a checkpoint. Three steps later Im breaking up a kidnapping and extortion racket or sneaking into an underground drug lab to put an end to it. Do I have the Social Enhancement aug to convince a lab worker to help me shut down their manufacturing machines? If I dont, how do I even get to them, seeing as they are gated off by a high fence thats locked behind a computer keypad with maximum hacking defense? Even if I got past that, theres arrays of infrared sensors, cameras, and an automated sentry turret all overlapping each others sight lines. Whats the answer? Hint: there isnt one  there are TEN. That keypad? You could hack it if youve put enough points into that aug, though it would be a crazy hack given how much more interesting the expanded hacking mini-game has become. But with some luck and a healthy stack of the right hacking software, you could pull it off. Dont have the skills or the software? Bust out a multi-tool - a rare one-time-use item that can hack anything in a jiffy. No multi-tool? Craft one with some spare parts. Ah, no spare parts, huh? Did you check that lab assistants computer? Oh, youre hacking is THAT bad? No sweat, just start luring in and knocking out guards until you find one thats got the code for the keypad on him. Nice work! Except, that was just the keypad. Almost every mission is this meticulously designed, like an interlocking matrix of questions with a bevy of interesting answersand Mankind Divided never stops asking. Walking Softly, While Carrying a Big Stick None of this would work if Mankind Divided werent enjoyable to actually play, but developer Eidos Montreal has made many smart improvements to the moment-to-moment experience since Human Revolution. A new cover-to-cover movement system and the ability to mantle up ledges, for instance, make getting around much smoother. The UI also does a much better job of informing you when youve been seen, who sees you, and how close you are to inciting a gunfight. Additionally, some of the stealth-assistance augs that were optional in Human Revolution, like the ability to see a projection of your last known location or to have enemies appear on the mini-map without having to visually acquire them, are now given to you for free (a nice change from the usual sequel approach of de-powering the hero back to base levels, which Mankind Divided cleverly sidesteps). These are subtle choices, but taken as a whole they remove most of the guessing and hoping that made Human Revolutions stealth occasionally frustrating. Even better, when things do escalate gunplay feels precise, and resetting the situation after setting off an alarm is much more manageable. Where in Human Revolution being seen would almost invariably plunge encounters into total chaos, Mankind Divided allows a well equipped and prepared player to feel powerful even when bullets begin to fly. The new Crysis-style on-the-fly weapon modification plays a big role here, adding a ton of utility and flexibility to standard firearms. By quickly attaching a silencer, swapping the holo-scope for a 4X optical, and switching between full-auto to burst-fire modes, my mid-range spray-and-pray combat rifle could become a silent and serviceable sniper rifle in seconds. Finally, shooting no longer feels like something Im not supposed to do in a Deus Ex game. The only real criticism I can level at Mankind Divided is that, especially in the wake of the events that close Human Revolution, its plot is decidedly less ambitious. Its still well produced (barring slightly suspect lip-syncing) with dutiful, believable performances by the entire voice cast, but the story feels like its stuck in second gear. Rather than a steady ramping up of ever bigger and more ominous threats, the 20- to 30-hour campaign remains tightly focused on discovering the truth behind a bombing that occurs right off the bat. Over the course of the investigation it becomes clear there are larger forces at play, but unlike Human Revolution or the original Deus Ex, Mankind Divided never really follows that breadcrumb trail to the darkest corners of the cyberpunk world. It ends up feeling more like a first episode of a potentially great TV show rather than a complete feature-length film in that sense. Once More Unto The Breach Completely independent of the story campaign, Breach is a nifty little extra mode you can hit for a quick, short fix of Deus Ex-ish style gameplay in a VR-themed world. As time-trial modes go, Breach has a lot going for it: a striking visual style, unique augs and abilities exclusive to the mode, and leaderboards to compete on for record times. Its by no means revelatory, but its a welcome addition and a nice way to get that cybernetic badass rush in short, quick bursts while leveraging the same excellent mechanics that make the core game in a way that can keep going once the story concludes. Aside from the smaller-feeling plot, Deus Ex: Mankind Divided improves upon its excellent predecessor in every other way. Its impeccably designed environments are flush with possibility, remaining completely coherent while supporting a wide variety of routes and character builds, and Jensens prodigious new feats of techno-wizardry make add new dimension to both combat and exploration. Mankind Divided never stopped challenging me or rewarding my curiosity, which pushed me to thoroughly explore its beautiful, ruined world while carefully weighing my decisions along the way.", "date": "Aug. 19, 2016,"}