{"name": "Grow Up", "name_review": "Grow Up Review", "ref": "https://me.ign.com/en/grow-up/122876/review/grow-up-review", "text": "~Grow Up~ sounds like a mean-spirited command growled at someone enjoying some childlike fun. But it also speaks to how Ubisoft approached this sequel to last year's Grow Home. Its intentionally clumsy climbing and collection gameplay ideas feel more mature and well-considered here, while at the same time it celebrates the freedom to move about and explore by giving us a big chunk of a literal world. As a sequel, Grow Up fails only to meaningfully expand on the originals concepts to the point where they renewed the touch of childlike wonder that came from discovering them. The four to six hours of gameplay that follow your spaceships crash landing on a plant-rich world follow a familiar pattern, enriched by several smart additions. In fact, Grow Up usually assumes you've played the previous game (and you should), as it offers only the slightest introductory help when the adorably ragdolly robot protagonist B.U.D. first finds a star plant. Much like Jack's beanstalk, these twisting lifeforms stretch ever upward toward the sky as B.U.D. steers their shoots toward nutrients glowing in nearby glowing rocks.There are four now, all carefully positioned to aim toward fragments of B.U.D.'s ship, and as with Grow Home, much of Grow Up's fun comes from making careful ascents up their sides while avoiding the ever-present risk of falling back down miles below. It works so well that Grow Up is usually more concerned with improving the experience that worked so well last year, and it generally succeeds. The core act of climbing with the see-saw use of a gamepad's two triggers remains intact. But it's the toys B.U.D. finds while exploring that make Grow Up especially enjoyable, such as a ball that lets him roll, Metroid-style, across the landscape or the ability to coast over wide gaps with a glider. Grow Up allows B.U.D. to switch between these tools with ease, granting a sense of freedom the original rarely had. At times these climbs inspire almost zen-like satisfaction as B.U.D. glides across the planet's expanses and grips passing plants and rocks. Thats dampened somewhat by the return of Grow Home's unreliable camera, which tends to make gauging jumps more difficult than it needs to be. At least frequent respawn points ease the pain of dealing with mistakes. It's worth learning to live with these quirks to reach the views from Grow Up's heights, where a world far larger than the last spreads before B.U.D. in all directions. The world's small enough that you're always keenly aware of its curvature, but varied enough that B.U.D.'s hunt for parts and abilities takes him through a pleasingly varied geography of snowy peaks, barren deserts, and crowded mushroom forests. There's even a new companion to accommodate the extra elbow room called P.O.D., who acts as a world map and provides the useful ability to mark waypoints for new abilities and challenges visible from the B.U.D.'s-eye view. With all that space comes a generally welcome emphasis on moving backward and forward as well as up, and ostensibly the ability to scan plants into your memory and create them as needed could have memorably turned the whole world into a height-scaling puzzler. Throw down a champoline, for instance, and you get a bouncy mushroom that can boost you far higher than Mario ever dared to jump. Toss a funghigh, and a plant sprouts up that acts as a ladder. It's a great concept and useful for reaching the 150 crystal collectibles, but in practice I found that most important elements like star plants were already smartly placed, minimizing the need for much fungal experimentation. We're left with the simple pleasure of climbing that defined Grow Home. Beyond that, we're left with the simple pleasure of climbing that defined Grow Home. That remains the core experience, and as fun as the chance to glide and plop down chlorophyll-stuffed poof balls can be, every addition in Grow Up plays second fiddle to that theme. I sometimes found myself pushing the new abilities to the side when I focused almost entirely on growing starplants in order to reach M.O.M., the ship's A.I., which is stuck on the moon (who was cheerfully beating B.U.D. for more than 12,000 rounds prior to the crash). In those moments, Grow Up rarely differed from its predecessor except for a few hints of distinct flavor. That needn't be much of a problem. Grow Up has a strong foundation  one that easily supports this new setting. Sorry, M.O.M., but the journey here, as often in the best games, is much more important than the destination. And when Grow Up mixed that journey with a pleasing minimalist soundtrack that almost vanished in the background along with B.U.D.'s modem-like whizzes and whirrs, I found myself in a state of mind that usually inspired focus and concentration rather than frustration. When all its pieces worked together, I found I didn't want to reach the end. And maybe that's the true message behind Grow Up's roomier world and features: with all these wonderful things around us, why are we in such a hurry? Grow Up doesn't feel terribly different from Grow Home other than its larger world, but its main achievement is to strengthen some of its predecessor's weak points. The drive to climb to the top of everything remains, but here it's improved on with new methods of climbing and flying, and the option to toss down plants that serve as tools for any situation. The camera sometimes complicates this, but not enough to bury the charm of the original.", "date": "Aug. 19, 2016,"}