{"name": "Bound", "name_review": "Bound Review", "ref": "https://me.ign.com/en/bound-2/122702/review/bound-review", "text": "The act of moving through Bounds unique, abstract, and utterly gorgeous world is unlike anything Ive ever experienced in games. Developer Plastic, which previously worked on ambitious-if-not-strange PS3 projects like Datura and Linger in Shadows, has taken the simplistic core of a 3D platformer and injected it with some impressive style and vision. While the camera cant quite keep up with the world, the how and what of dancing through it makes Bound a memorable experience. Though you might not be able to tell at first glance, the story is as simple as a fairytale: you play as a princess who sets out to protect her mother and her kingdom from a beast known as...wait for it...The Monster. But it only takes a second to realize that the princess moves with the elegance and precision of a ballerina  the way you can glide across the air, transition from one motion to another, and use her body as a canvas of expression is unlike any other character I can recall, and controls so well I felt like a dancer myself. Theres also a series of interstitials that tell a tale much more grounded in reality. The delivery is obtuse, but the pieces I stitched together told an effective, if not entirely predictable emotional story. I wont go into spoilers, but it deals with some themes and ideas that games generally dont touch, which I definitely applaud. It's like an M.C. Escher painting colliding with Bauhaus. The worlds that you explore in Bound expand and contract like a living, breathing organism. Platforms manifest in space, the ground pulsates with an internal rhythm, and walls shatter apart and piece themselves together at will. Its like an M.C. Escher painting colliding with Bauhaus, which Ive never really seen before in a game, but holy hell do I appreciate it. While the camera does its best to keep up with the oscillations and transformations of the space around you, I oftentimes found myself having to come to a halt and rejigger the view in order to find my place in the environment. In a game thats at its best when youre moving, having to stop for this reason is a bummer. However, when I got going I found myself just rolling, leaping, and spinning around gorgeous minimalist spaces for minutes on end just because it looked and felt so unique. The levels also accommodate to your own personal skill-set. Once I became confident with my ability to bounce off walls and accurately long-jump, I found myself able to gracefully skip full sections of levels. What started as a timid trio of small hops turned into one gigantic, dangerous leap once I became adept at Bounds controls. The sensation of becoming better and more comfortable with the controller in my hand felt greatly empowering. So much emotion is gleaned from the animation. So much emotion is gleaned from the animation. The way the Princess body flattens against a wall, stretches mid-air during a leap, and controls during a pirouette is incredible. Its as effective a depiction of dance as Ive ever seen in our medium. Likewise, her body language tells a story in and of itself, especially when she cowers in fear in the presence of The Monster. That fear is unjustified, though, because there is no death in Bound, and theres no punishment for platforming failure other than a quick respawn to the site of the incident. The platforming isnt necessarily tricky or creative, but ledges can be narrow and the collision detection is a bit spotty, so I found myself falling every so often. But like Journey and Abzu, I really dont mind that lack of friction. The joy I got from Bound came from its unique mechanics and its visually fantastic worlds. Bound also did a great job of making me want to replay its three-hour story by offering up different experiences depending on the order you play the levels in. The stages themselves are bite-sized  each one can be completed in 15 minutes or so. But each one culminates in your character getting over a specific fear which manifests itself throughout the levels as things like paper airplanes and squid-like tentacles. If you enter a world rife with paper planes after youve already conquered that fear, then you can easily get past these obstacles and unlock different paths throughout the world. That said, I never really felt a sense of place to the spaces I was exploring. Maybe thats the point, given the surreal and obtuse nature of Bounds setting, but I was disappointed by the lack of cohesion in the world compared to platformers like Super Mario 64 or emotional adventures like Journey. Even having played through twice, I couldnt really map out any of the stages from memory. Despite being a relatively-simple 3D platformer, Bounds fantastic sense of movement and strange, dream-like world make it utterly unique. Its a testament to phenomenal controls and sense of grace that I was able to set aside the camera and design flaws, and fully immerse myself in this strange, beautiful story.", "date": "Aug. 16, 2016,"}