{"name": "Abzu", "name_review": "Abzu Review", "ref": "https://me.ign.com/en/abzu/122192/review/abzu-review", "text": "Abzu creates one of the most relaxing, stress-free underwater experiences Ive ever played. By emphasizing freedom of movement over survival, it gave me all the time I needed to soak in its gorgeous art direction, marvel at its fluid controls, and listen to its epic orchestral score. During the course of this fascinating three-hour adventure full of deep-sea mysteries and discoveries, its moving melodies ebbed and flowed with my emotions and fueled my curiosity to reach the finale, even when the story lacked context. What you actually do along the way is a little light on gameplay, but its still a spectacular journey worth taking. Each area shows off Abzu's fantastic art direction and attention to detail. Abzus intriguing underwater world is presented with little introduction  youre a mysterious diver who awakens and begins to explore  but it generates enough mystery to propel you through a series of stunning locations. From seaweed swaying in the current to mysterious sunken shrines, each area shows off Abzus fantastic art direction, attention to detail, and an impressive sense of scale as you swim through enormous chasms under the sea. This journey feels remarkable because of the way it constantly dangles the next intriguing area in front of you. I found myself traveling through its underwater rabbit hole into a strange, unfamiliar world full of cryptic iconography and ambient life such as fish, turtles, and whales. I was constantly wondering what I would find around the next bend, and each new area I discovered kept the surprises coming with fantastic architecture and some incredibly large spaces to swim in. And while nothing (including some intimidatingly large sharks) wants to actually eat you, its still a fish-eat-fish world down here, and you can observe the convincingly recreated circle of life by meditating at a shark statue if you want. Continuing on my journey I slowly waded into ancient ruins or completely lit-up, cathedral-like structures, and enjoyed the leisurely pace. In certain places it speeds up, and high-speed channels function like highways that pick up the pace and push you into beautiful new territory. One of the more memorable speedways had me swimming alongside a pod of incredibly large whales. It made me feel like a small fish in a very large pool. Even during the most spectacular moments the framerate was almost always consistent at 30 per second despite the density of life on screen. I noticed it slow down slightly a handful of times, like when ultra dense schools of fish would swim in a tight loop. The rousing orchestral melodies that stayed with me hours after I put down the controller. Abzus journey into the deep is conveyed primarily through pretty graphics, but its rousing, evocative musical score really steals the show. Each new area you explore is bookended by music from Journey composer Austin Wintory, and his contributions sound absolutely wonderful. The stirring ensemble of strings and flutes bounces back and forth between soothing tunes and rousing orchestral melodies that stayed with me hours after I put down the controller. The orchestrations are carefully used to punctuate emotional moments in a way that Ive seen few games do, with the tempo rising and melting away into the background appropriately. And whenever the music dissipated, the ambient sounds of the sea served as a constant reminder that I was mostly alone in this world. It all makes Abzu the closest thing to a playable version of Disneys Fantasia that Ive seen produced by a video game. But what are we actually doing here, other than taking in the sights and sounds? Abzu never makes that clear, either from a story perspective or with gameplay depth. I did enjoy my time swimming from the start because simple controls make is easy for almost anyone to pick up and enjoy moving around. Abzu uses a familiar control setup that resembles a driving game: holding the R2 button dives deeper and constantly moves you forward. You can boost to push through through areas quickly. Within minutes I could effortlessly maneuver in the water, do loop-the-loops, or break through to the surface and pull off a quick mid-air trick like a dolphin. And what limited interactions there are with the environment focus on helping you get around: you can grab onto fish when you want to move faster or slower. Abzu's simple puzzle are designed to keep you moving ahead. Its just a little disappointing that Abzus smooth movement isnt really put to the test by any form of challenge, like a race through the environment. You avoid a few hazards, but thats about it. Nasty underwater landmines are the only attacker you encounter, and outside of a worrisome warning bell when you get close their scary zaps are nothing more than a momentary hinderance. Abzu has some puzzles, too, but theyre little more than quick flip switches that dont require a ton of thought. Theyre only meant to open up the next breathtaking location and keep pushing you forward. The mystery Abzu presents at the start is intriguing, but the end of story is a little too abstract  even relative to other wordless storytelling adventures like Journey. There are a few cutscenes, but it mostly leans on environmental storytelling to fill in the gaps of what happened to an ancient, alien-looking civilization we find here. But what happened and why were very unclear, and on my first time through there wasnt enough context to give the ending the power it seemed to aim for. I couldnt quite place what Abzu wanted me to feel, so it just left me puzzled because I wasnt entirely sure what had happened. But considering the entire thing is just three hours long, its short enough that I didnt mind diving back in for another swim through to piece together the story, which revealed significantly more meaning now that I knew what to look for. Abzu takes the graceful feel of movement and subtle push toward discovery that Ive enjoyed in similar exploration games like Journey and Flower and builds a refreshing-yet-simple underwater adventure around it. The colorful settings, beautiful soundtrack, and basic controls made it a great experience that constantly piqued my interest, even if it never challenged me to master it other than deciphering its cryptic environmental clues. Instead, Abzu relishes in giving you freedom to simply enjoy exploring the fascinating deep blue sea.", "date": "Aug. 2, 2016,"}