{"name": "Human Fall Flat", "name_review": "Human: Fall Flat Review", "ref": "https://me.ign.com/en/human-fall-flat/122048/review/human-fall-flat-review", "text": "As people passed by my desk this week, they all invariably became intrigued and stopped to ask two questions: What game is this? was usually first. After I repeated Human: Fall Flat a couple of times theyd get it. Then, after taking a moment to thoughtfully examine the featureless, pudgy, toddler-like character stumbling around drunkenly on screen, theyd ask, Why does your dude have a buttcrack? Oh, that? I painted that on in the character editor, Id answer as nonchalantly as possible. Theyd nod, accepting the wisdom of my actions, and hang out for a few minutes to watch me struggle through a few physics puzzles with the intentionally klutzy controls and laughing at my Chris Farley-like ineptitude before moving on, saying theyd have to check it out. And the cycle would repeat itself: Human: Fall Flat. Buttcrack. Puzzles. Repeat. Overall, perhaps Human is a game thats more fun to watch for a bit than it is to play all the way through. Its not that it isnt generally fun to play, but that its guilty of the cardinal sin of slapstick-style physics puzzle games in the vein of Octodad: Dadliest Catch and Surgeon Simulator: it creates situations where once youve figured out what you have to do, executing on that solution is a matter of battling the controls and trying over and over until you get lucky. Its charm, comedy, and cleverness built up enough momentum to keep me going when the going got annoying, but man, does it get annoying sometimes during its six* or so hours. (*Estimating the time it takes to play through a puzzle game always feels so judgemental. If it takes you longer, thats cool. Likewise, if you complete it in three, dont tell me.) The biggest part of that charm is our doughy, completely untextured (by default) protagonist. His animations are driven by inverse kinematics, meaning theyre dynamic and react to interactions with the world around you, and that theyre hilarious. In the early levels I winced when he tumbled off cliffs and when physics contorted his pool noodle-like limbs in unnatural ways. But as soon as I learned that he feels no fall damage and will always eventually pick himself up off the ground, I laughed along as he clumsily waddled along like Gumby with a full diaper. As mentioned you can customize him in the menu, using MS Paint-style tools to fancy him up as you please, which I suppose could also be done tastefully. Likewise, virtually nothing in all of Human is textured  only colored and shaded  giving it the look of a work in progress, except with the consistency of a finished product. Each stage is distinctly different, ranging from a medieval castle to industrial loading docks, cliffs, and a garden. The lack of detail probably helps make the low-polygon environments look good, and also helps the almost flawless collision detection between objects that allows these puzzles to function. Controls are deliberately tricky, setting up the slapstick comedy. Controls are deliberately tricky, setting up the slapstick comedy of flailing to keep from dropping important items, dangling from ledges, and getting crushed by heavy things. Your right and left hands are controlled individually by the right and left mouse buttons (or gamepad triggers), respectively, which gives you a lot of opportunity to mess up simple, usually automated tasks like pushing blocks or grabbing onto a ledge and pulling yourself up onto it. Your arms work like two of those sticky gummy hands you had as a kid, before they were encrusted in lint and gunk, and will fiercely grab onto anything they come into contact with as long as you hold down the button. Thats where some of those disfiguring physics-based animations come in. For example, something as simple as climbing up a ledge that in most games is a one-button operation is a complex, easily failable task in Human. You have to raise your arms by pushing the mouse or right stick forward, then hold both buttons or triggers, then jump toward the ledge. Then, once youve gripped it (not too far up, or it wont work) you pull down to pull in your arms and drag yourself up and over the edge. Even after I felt I had this procedure down, I still messed it up routinely, and that led to countless falls to what would normally be a messy splatter of a death and an irritating respawn. When you fall off the world you paradoxically plummet down right near where you fell. But here, its played off as a joke. Demonstrating some clever less-is-more thinking, all of Humans levels take place on floating islands in the sky; when you fall off the world you paradoxically plummet down onto the same floating island, right near where you fell from. You have to respect a good respawn gag. Puzzles are fairly creative, bearing in mind that this is a game without a Portal-like twist to make you think outside the box of something resembling real-world physics. Mostly, they involve moving things around so that you can climb up to a higher platform or cross a gap. A few stand out, especially those that involve breaking down walls and watching them crumble into physics-affected pieces, or using the fully functional catapult (which is worth stopping to mess with after youve figured out how to solve the puzzle its used in) to launch yourself across the map. Some are less inspired, like plugging in cables to open doors. But few are tedious, and thats appreciated because the linear level design means they all have to be solved in sequence. Of course, Human has no special moves to avoid the same trap that many other physical comedy games fall into: several puzzles rely on fairly precise movements, such as picking up a plank and laying it across a gap to create a bridge, or having to use a hook to grab a peg extruding from a wall while mid-jump to swing to the other side, or using your bad controls to manipulate a vehicle that also has bad controls. (Its as if they heard you like bad controls, so they put bad controls in your bad controls so you can control badly while you control badly.) Because the controls dont always work the way you want them to it's often frustratingly difficult to pull off what should be simple. That sort of thing sometimes killed the absurdist mood, because laughing at failure only works the first couple of times. Then it just feels unfair. The best way to stave off this buzzkill is to grab one of those people who stop to ask what youre playing and make them play with you in the local-only split-screen co-op. (Note: for some dumb reason you must have two gamepads to play in this mode; you cannot play with one person on a gamepad and the other on mouse and keyboard.) Theres definitely something to having someone there to laugh at your failure in person, only to almost immediately do something ridiculously stupid themselves for you to laugh at. Mutual mockery takes the edge off of repeated failures, and thats great because for the most part co-op in Human is purely for the extra goofiness that comes from two people doing stupid things together, like trying to light your farts on fire. There are no co-op specific puzzles, and rarely did I find a solution to a puzzle that was only possible with two players instead of one, so the thinking doesnt change in the same way it does in Portal 2s co-op. Its just dumb fun, and frustration loves company just as much as misery. Human: Fall Flats slapstick controls and ridiculous animation do a great job of making repeated, frustrating, and unfair failure at physics puzzles seem fun for a while. And when that fun runs out, you can extend it by bringing in a friend and drawing silly things on your goofball character. If you dont play it, watch someone play it.", "date": "July 29, 2016,"}