{"name": "Quadrilateral Cowboy", "name_review": "Quadrilateral Cowboy Review", "ref": "https://me.ign.com/en/quadrilateral-cowboy/122015/review/quadrilateral-cowboy-review", "text": "Quadrilateral Cowboy doesnt just wear its charming cyberpunk heart on its sleeve. The fun, retrofuturistic look of its world and characters comes to life thanks to a clever hacking system that lets you put your creativity and problem-solving skills to the test as you pull off increasingly layered heists. While its best ideas never feel fully explored, it creates some rewarding puzzles out of its compelling, gadget-based cybercrimes that I know Ill be returning to for many more hours to come. This weird cyberpunk world combines the clunky, vintage charm of early 80s technology with a grungy, futuristic edge. As a hacker for hire, its your job to use the amusing contraptions of this imaginary era to plan out virtual heists. This is primarily done by typing out scripts in your portable computers command prompt. Accompanied by its own pleasing keyboard clack sounds and with a handy list of functioning keyboard shortcuts, manually hammering out these brief bits of code was a delightfully freeing and tactile experience that made each action I successfully executed that much more rewarding. These actions could be as simple as typing door1.open(3) to open locked doors or camera2.off(3) to turn off surveillance cameras, or as complicated as writing scripts to execute remotely as I snuck around top-secret government facilities, boarded flying trucks, or infiltrated satellites via space elevator. The focus on cool contraptions is where it really shines. It was fun to watch as these whimsical levels, from the floating vaults of Bergamot Towers to the massive zeppelin of the Malta Stock Exchange, bent to the will of my newly learned coding tricks, especially when I managed to formulate an especially efficient solution to a particular obstacle. I relished that creative freedom as I scripted my way through about five or six hours worth of missions, conceiving of new ways to more cleanly solve future puzzles and replaying past ones to top my own best times. Completing a mission also displays the global average and your friends best times, feeding into my competitive streak as I began planning out new ways to trim seconds off each levels current high score. Most levels are done in three stages to slowly familiarize you with new obstacles you encounter, or teach you new tricks youll use as heists get more advanced. The initial stage of each level was always a good opportunity to test the waters so that by the time I made it to the final (usually the third) stage, I was well-equipped to tackle whatever challenge itd been building up to. Sadly, some heists were much weaker than others, especially when they abandoned good ideas introduced in previous ones rather than layering them on as I grew more adept. Something as basic and seemingly vital as surveillance cameras, for instance, basically disappear after a few levels; obstacles that never needed to be dealt with again. Its ideas are great, but sadly underexplored in the long term. At one point the campaign almost literally flipped the table on everything and made me endure a couple bland platforming-heavy missions that had me switching off between two characters with unique abilities. These were weak and unwanted sequences that served only to introduce basic mechanics that didnt really need full levels dedicated to them, like forcing open certain doors with a timed hydraulic spreader, or using a buzzsaw to cut through vents. They also disrupted the pleasing pattern of the campaign thus far, and while it does eventually return to the code-heavy puzzling I adored from previous missions, it never fully recovers from the change in direction. The focus on cool contraptions is where Quadrilateral Cowboys hacking really shines. New gadgets, like a tiny, remotely operated robot that can fit into tight spaces, a swiveling rifle housed in a briefcase, and a portable launcher for flying across wide gaps, were added with satisfying consistency as I progressed. Each brought new layers of depth to the heists that followed. In one of my favorite missions, I setup my autocase rifle on the deck outside the luxury two-story apartment I had to infiltrate, launched aimbot.exe on my deck to deploy the rifle, and used my mini CCTV to narrow its sights on a switch beyond the homes glass walls. The switch would disable the security lasers blocking the front entrance and the staircase to the second floor, but would trigger an alarm if left off for more than three seconds. This was a frequent constraint also found on cameras and locked doors, which brought a welcome layer of challenge to heists. I may be playing as a mastermind hacker, but shes not a god. Having roadblocks to work around made the setup more enjoyably challenging, and the execution more of a rush. Watching my flawless system execute is the most satisfying and exciting part. With a satisfying click from my data jacking device, I popped open a window on the side of the house to welcome my autocases laser sight  this way, the shot from my rifle wouldnt break the glass and trigger yet another alarm. Past heists had already taught me that lesson. At this point, I felt like a pro. This is where things got more complicated, and consequently, more fun. The switch was two-tiered, with the top shutting down the staircase lasers and the bottom shutting off the entryway lasers. I trained my scope on the bottom and typed out some quick scripts: blink 1 fire to assign one blink from my cybernetic blinking ability  conveniently executed with the Q key  to my rifles shoot function. Then, blink 2 pitch 0.7. Two blinks to tilt my rifle up 0.7 degrees, then, blink 3 pitch -0.7 to lower it again. These setups are the most interesting part of Quadrilateral Cowboy; tense planning phases where I could take my time learning the ins and outs of a location, seeking out security flaws, and formulating how to break in where the system is weakest. It was here, during these absorbing puzzle-solving sequences, that I learned the language of these virtual heists, adding to the growing vocabulary of hacky maneuvers and tricks I could apply to make my crimes that much quicker next time. A ton of heart and creative puzzles make up for some of its shortcomings. But as interesting, clever, and fun as the setups are, watching my flawless system execute is the most satisfying and exciting part. Back at the villa, in a flurry of cybernetic blinks and flashing security lasers, I slunk into the upstairs bedroom undetected. I grabbed the target safe and ran back down stairs just as the safes 10-second timer deployed a home-defense turret to take me out. But by then I was already gone, disconnected from the virtual world Id infiltrated, left with just the immense satisfaction of another heist planned, coded, and executed to perfection and some cash for me and my hacker friends to buy a fun new gadget for future escapades. Those future escapades demonstrate Quadrilateral Cowboys biggest problem, though: its ideas are great, but sadly underexplored in the long term. While missions like the one above provided ample opportunity for testing out and mastering each new item, individually or in tandem with others, it never felt like my futuristic toolkit as a whole was explored to its fullest potential by the campaigns end. I wanted some kind of epic culmination of all that I had learned, but Quadrilateral Cowboy never quite delivers. The final heist combines a lot of the fun gadgets and hacking know-how Id collected up until that point, but it doesnt provide the kind of strong, all-encompassing conclusion Id anticipated. Its ending didnt leave me feeling empty or unsatisfied, but it did leave me wanting more. I can only hope for some awesome user-created levels via its built-in modding support to fill the void left by the base games campaign. But what Quadrilateral Cowboy lacks in late-game level design, it makes up for with a ton of heart and creative puzzles that will keep me coming back  theres so much speedrunning potential that Ive already had tons of fun replaying whats there. Quadrilateral Cowboys puzzles are mostly a joy to play. Its command line hacking is surprisingly accessible and pleasingly tactile, and when combined with its many interesting gadgets it allows for plenty of creative problem-solving and freedom in tackling all manner of whimsical cybercrime. While not all of its levels shine as brightly as the rest, Im already feeling beckoned back by its replayability and charm, eager to experiment more with the futuristic, hacker-themed playground it so stylishly constructs.", "date": "July 28, 2016,"}