{"name": "Monster Hunter X", "name_review": "Monster Hunter Generations Review", "ref": "https://me.ign.com/en/monster-hunter-x/121334/review/monster-hunter-generations-review", "text": "Monster Hunter Generations has the appeal of a greatest hits album. This is a worthy collection, one that folds 12 years of top-notch boss fights into one big action RPG. It doesnt contribute a lot of new ideas to the existing formula or fix the long-standing problems of the aging, clunky menu system, but its long list of tweaks and still-thrilling combat make it a great package you can easily sink (another) 100 hours into. The endlessly rewarding loop of Monster Hunter games is hunting packs of wild prey and enormous beasts over and over until you gather enough resources to turn their body parts into fantastic-looking weapons and armor. Repetition is a danger, but each battle can unfold in a variety of ways depending on your approach, so prep is an important first step. It can give you an edge, from using handy pitfall traps to keep a monster in place to setting off explosive barrels that deal big damage. The outfits and equipment offer a great incentive to keep hunting big game since they double as wearable trophies of your accomplishments. Generations big new marquee features are Hunting Styles and Arts, and both add a layer of customization that beefs up combat by making you pick from one of four fighting styles. You can settle on a traditional balanced character in the style of Monster Hunter 4 Ultimate, or go for one that quickly charges up special moves, or one that focuses on aerial attacks to make you more mobile, or another that rewards last-second dodges with punchy follow ups. Hunting Styles make learning a new weapon feel like a commitment, and it provides a unique way to tailor a hunters fighting style to suit the marauding foe youre hunting. The new Hunter Arts introduce extra flair that I wasnt expecting in combat. These special attacks unleash gratifyingly powerful Street Fighter-esque Super Moves, from quick evades to crushing charge attacks. It might sound like a win button, but theres always a risk because they can whiff or be countered by an attacking monster, leaving you vulnerable. The key to success is waiting for just the right time to activate these big attacks and send a foe reeling. And youll need Styles and Arts to topple Generations intimidating stable of beasts. Whether youre fighting the colorful Great Maccaos fierce outward-jump attacks, the sleek Nargacuga and its dizzying array of furious swipes, or the massive Glavenus, a large brute wyvern with a rock-like body that swings a wide, razor-sharp tail, each monster displays the kind of personality and aggressiveness that has defined this series for more than a decade. No matter the opponent, its always a knock-down, drag-out fight that ends with me throwing up my hands in celebration. Sadly, thats about it for new stuff. Generations doesnt introduce any new weapons into the fold, though it does rebalance all 14 of Monster Hunters deadly tools to make them work with the new style options. Likewise, Generations story and presentation take a back seat in this installment, which is definitely a bummer, but that lack of nuance at least speeds up the pace of campaign. As the new hunter on the block, youll unlock new quest ranks and the four hub villages quickly, with wonderfully honed art direction that brings locales from previous MH games onto the 3DS. Its neat to explore these throwbacks from past games on 3DS. The only part that drags is the boring fetch quests where you gather mundane resources. This is supposed to be Monster Hunter, not Mushroom Hunter, yet time and time again I was sent to gather 10 of the things. Playing the gatherer makes sense in a handful of situations where you need materials to make new gear, but otherwise these forgetful tasks pale compared to fighting the massive creatures preying on this world. While the storys thin, Generations paints a vibrant region full of villagers that communicate the joys and stress of daily living. However, its the wacky cat companions that steal the show through a plethora of cat puns and the helpful ways they can gather resources. You can go one step further and control your cat companion directly to gather items in the field without losing valuable pickaxes and nets from your inventory. Cat combat is relatively simple, but a pack of these fierce felines can still dole out decent combos and helpful buffs to take down roaming monsters. Multiplayer hunting is still the best part of Generations... Multiplayer hunting is still the best part of Generations, and the mode in which youll likely spend the most time after youve finished the 25-hour campaign. The four-player lobbies are easier to set up than ever thanks to the redesigned hub, so you can jump online or set up a local lobby and head off on your next hunt. And theres plenty to do, from special quests that toss multiple beasts into one map to high-ranking quests that toss you at the strongest monsters Generations has to offer. The fantastic headline battles in Generations require lots of prep, which tends to be the slower part of this action RPG. By amassing tons of raw materials, you can build lots of handy potions to lower stamina drain, increase your attack power, or improve elemental resistances. The problem is that actually combining them is a huge chore. The inventory interface mightve been tested over the past decade, but the underlying framework feels neglected and dated despite the updated art. I felt like I wasted too much time digging through layers of menus spread between two places looking for equipment, arts, and items to craft. Its familiar, but its also a major drawback that the next Monster Hunter game needs to recognize and reorganize to be more efficient. Monster Hunter Generations hits the core tenets of what makes this series great. Great gear drives the lust for the hunt even on the small scale, but the big, spectacular fights ultimately matter the most. Generations tweaked combat adds just the right tools to make slaying epic boss monsters a fun activity thats just as fun online or off. Playable companions help shake up the gathering game without taking away resources, and its fun to play as a wackier character. Generations only falters during slower moments spent on fetch quests and in wrangling through menus before the hunt.", "date": "July 13, 2016,"}