{"name": "Song of the Deep", "name_review": "Song of the Deep Review", "ref": "https://me.ign.com/en/song-of-the-deep/121316/review/song-of-the-deep-review", "text": "Whens the last time you remember playing a game with good underwater controls? Ecco the Dolphin, maybe? Its incredibly rare that a game gets the appropriately floaty feel of aquatic movement right, and thus frustrating underwater sections are a common problem that dates all the way back to the original Super Mario Bros. And despite taking place entirely underwater, Insomniacs Song of the Deeps clunky submarine controls exacerbate its repetitive puzzles, and together they drown out its serene and beautiful Metroidvania-style retelling of a fantastical Irish fairy tale. A painterly look and melancholy Celtic music are every bit as effective and enjoyable in the opening minutes as they are at the end of the eight-hour adventure. Characters, backgrounds, and animations remind me like a cross between Child of Light and Ori and the Blind Forest in a really beautiful way. There are some slight performance hiccups, specifically when you cross a save point, but it was nothing major enough to harm the overall style. Going deeper and deeper into the ocean in your submarine and seeing the strange mythological beasts that reside there continually drove me forward in eager anticipation of what new locale or creature would appear next. From the ruins of ancient forgotten kingdoms, to the spooky nest of a giant spider beast, the inter-connected world is full of interesting places to explore. This ties in well with its Metroidvania roots -- unlocking new abilities like being able to leave the sub and swim through tiny doorways made me always want to retrace my steps and see what new secrets they could unlock. And this exploration pays off in the form of giving you experience to level up. ...the inter-connected world is full of interesting places to explore. In the early hours, Song of the Deep does a good job of giving you the option to grow your submarine and character how you see fit. You can reap the benefits to exploration, jet across the ocean floor with speed and mobility, or fortify your weapons to be able to tackle even the biggest enemies. Having to weigh the pros and cons of how I spend my XP provided some genuinely tough decisions. However, there arent enough abilities to keep that going in the second half, and I ended the adventure with a nearly maxed-out, homogenized character. But as I said, having played from beginning to end, I never grew to enjoy how the act of movement feels in Song of the Deep. When mobs of enemies surround you, some of them firing projectiles while others surround themselves in a harmful electric barrier, you need tight controls and precise shooting to make it out alive, and here the submarine feels too sluggish in acceleration to avoid enemies that seem to be operating under different rules. Some can even pass through level geometry. I never quite felt the same level of prowess as I do in any of the great land-based platformers, which led to a solid amount of deaths that left me feeling like they werent entirely my fault. Checkpoints are plentiful, so it never set my progress back too far, but it was still a frustration. ...the controls are especially problematic when it comes to puzzles. However, the controls are especially problematic when it comes to puzzles. While the puzzles are fun to mentally figure out, they become a slog to physically finish. Having to quickly move keys from one place to another using your grappling hook or open a timing-based door and trying to slip through before it closes is all made more frustrating thanks to the fact that I never felt fully comfortable maneuvering my character or her submarine through the world. Song of the Deep makes a fantastic first impression. Its gorgeous world, charming characters, and melancholy tone make for a unique and effective aesthetic. But once you get into the core of the mechanics, combat and puzzles become a slog thanks to its cumbersome controls and wonky physics. Still, I found myself willing to put up with all of these frustrations in order to delve deeper and deeper into this beautiful world.", "date": "July 12, 2016,"}