{"name": "Technomancer", "name_review": "The Technomancer Review", "ref": "https://me.ign.com/en/technomancer/120950/review/the-technomancer-review", "text": "The Technomancer seems like an RPG inspired by the greats of the genre, but it never really understands the fundamental elements that made them great. It has all the moving parts of a mid-2000s BioWare game but lacks technical polish and storytelling finesse to a sometimes painful degree. Far too many crucial building blocks are poorly implemented for any piece to really break through the canopy of mediocrity. Theres no number or hint in the title, but The Technomancer is a follow-up to developer Spiders poorly received 2013 RPG, Mars: War Logs. The Technomancer takes place amidst the same war between dystopian corporations on a richly realized vision of the red planet. You control the bland Zachariah Mancer, a newly minted Technomancer (read: brooding cyberpunk Jedi) caught in the middle of a struggle between the army and the secret police of the Abundance corporation. Zach has some cool moments throughout the story, but never quite gets to shine as a character. Hes too much of a blank-slate protagonist, and where superior RPGs would allow you to mold such a persona through roleplaying, The Technomancers dialogue choices usually boil down to, Do I have the right non-combat skills to progress this quest without fighting? or Should I accept a mission from this person based on what I know about them? rather than any genuine character-building or world-affecting decision making. There is a morality system that allows you to adopt a Batman-esque code against killing, but its effects are rarely visible on the story or gameplay. The Martian setting and background and the environments used to introduce you to them are definitely the high points of this journey. From the monolithic, utilitarian metropolis of Ophir to the vibrant, rugged, Arabian Nights-esque merchant city of Noctis, the distinct cultural styles and small, convincing details really do a hell of a job bringing Mars to life. The story is presented without flourish or a true sense of stakes and tension.I wish I could say the same about anything else in this RPG, but I cant. While the story is complex, involving complicated questions of sovereignty and morality with many competing factions and subfactions, none of which are clearly good or evil, its presented without flourish or a true sense of stakes and tension. It certainly doesnt help that the voice acting tends to be too emotionally reserved when its not outright goofy or amateurish. Or that faces arent even animated beyond their mouths, so everyone retains the same static, eerily frozen expressions until the camera can cut away and allow a new set of eyebrows to be swapped in. You dont get the chance to really connect with the Technomancers cast in the same way you would those of the games its trying to emulate. Even if you could, most of your party members are two-dimensional characters written entirely around a gimmick, such as The Tomboy Mechanic Who Loves Her Car And Curses A Lot, or The Brooding Guy Who You Dont Even Remember Who He Is Or Why He Joined Your Party. Its easy to brush off rough acting and presentation if its merely a crusty layer on top of an otherwise entertaining game, but peeling back the surface of The Technomancer reveals something worse underneath. The combat may be fun to watch, with exciting melee animations and a variety of flashy abilities, but its clunky to control at the best of times and borderline intolerable at the worst. I would really be relieved and unsurprised to find that a programmer misplaced some decimal points, because that seems legitimately more plausible than the idea that this is really how battles were meant to feel. Imagine if you took the Batman: Arkham games, made Batman significantly weaker and less durable than every single mook the Joker throws at him, lifted the restriction on how many enemies can attack him simultaneously, and removed the excellent UI prompts that allow the Caped Crusader to react quickly to danger, flipping and dodging heroically around the battlefield while looking like a badass. Thats basically what almost every fight feels like in The Technomancer. It breaks the illusion that Technomancers are supposed to be mystical heroes.Even on Normal difficulty, playing on a character with over 20 hours of experience - well into the late game - with the best gear available and a balanced party, the standard humanoid enemies that you run into all over the place feel both significantly tougher and more deadly than you. One wrong move can get you killed almost instantly, while even the most common foes seem to soak up damage from my technomagically-buffed equipment like mercenary sponges. It really breaks the illusion that Technomancers are supposed to be the iconic, mystical heroes of the setting. And youre often required to fight severely outnumbered on top of it all. Theres also the matter of firearms. A lot of enemies carry them, and some of them even have fully automatic variants that your character cant even equip. They do loads of damage and can allow upwards of three or four enemies to plink away at your health from a safe distance while youre engaged with their buddies. You wont get any prompt that youre about to be fired upon, and since one or more shooters may be off-screen at any given time, its fairly common to die to gunfire in the middle of a brawl before you even know what happened. Gunmen dont even seem to have any weaknesses; you cant simply close on them and take them out quickly before engaging the rest of an enemy group because theyre just as capable of defending themselves in melee as any other class of foe. Were supposed to believe in this zany future where people choose to fight with metal shields and electro-staffs, but given the unmitigated lethality of guns, youre constantly reminded of the common sense question, If we have the technology to put entire societies on Mars, why isnt everybody using guns? Its not like you can deflect shots with your melee weapon Jedi-style, and there isnt even a cover system. Why are Technomancers significant in this world at all if you can point a rifle at them and take them out like anyone else? The button you're mashing is dodge rather than attack, and you have to be very careful about when to stop spamming.The relatively high enemy damage and health in comparison to what were able to wield seem like they might have been intended to keep fights from turning into a button-mashing exercises. The thing is, they actually make it more of a button-masher. Its just that the button youre mashing is dodge rather than attack, and you have to be very careful about when to stop spamming it and try to get a hit in or youll be toast. Theres no flow or rhythm to it, and the frustration scales up with the size of an enemy group. It doesnt feel difficult in the Dark Souls sense, where you learn to iterate and get better with each death. Its just random, tiresome, and annoying, no matter how much time or how many stat points you invest. I kept wondering if there was something I wasnt getting about Technomancers combat. But if I, as an experienced and adaptable RPG player, can make it through a 30-hour campaign without catching onto the specific way Im supposed to be playing to have fun, thats just a different brand of failure. This also contributes to watering down the RPG elements. You get to play around with fairly in-depth skill trees focused on three different styles of combat (offensive Warrior, defensive Guardian, and tricky Rogue, with a fourth, supplemental tree based on lightning-slinging Technomancy spells) as well as a deep gear modification system and a decent selection of non-combat talents. But every battle-related bonus you accrue feels like such a slight, incremental increase when youre still having to spam dodge and dying to random thugs on the street 30+ character levels in. You never hit a point where you feel like an ultra space warrior who can mow down corporate goons and thirsts for more potent prey to test his skills against. And thats totally dissonant with how Technomancers are presented in the lore. Pros World and environmentsComplex story Cons Combat systemUnconvincing charactersUnimpactful progression So much could have been forgiven if the central, action RPG pillar of combat wasnt constructed so poorly in The Technomancer. The world is clearly crafted with vision and attention to detail, but the characters who inhabit it come off too often as awkward marionettes who would rather be doing something else besides participating in this story. Its heart is in the right place, and that makes me wish Id enjoyed it more. But its like the pancakes an eager eight-year-old tried to make their dad for Fathers Day: the ingredients are lacking in quality and the skill to assemble them just wasnt present. All the little reasons The Technomancer is worth experiencing, all the little moments where the vision of a better game shines through, arent quite enough to justify choking down its shortcomings.", "date": "June 28, 2016,"}