{"name": "Biohazard: Umbrella Corps", "name_review": "Umbrella Corps Review", "ref": "https://me.ign.com/en/resident-evil-umbrella-corps/120821/review/umbrella-corps-review", "text": "Perhaps to avoid damaging the still-beloved horror series brand, the clumsy multiplayer shooter Umbrella Corps doesnt carry the Resident Evil name even though it takes place in the same universe. Its movements feel sluggish, its combat is mindless and predictable, and its lack of personality ensures its just another rotting face in the crowd. The few times Umbrella Corps brings good ideas to the table, it kills them with such efficiency that it almost feels intentional. I cant recall another recent game that feels as lost and confused as this one. So much about Umbrella Corps makes no sense. For starters, this is a cover-based shooter with cover that doesnt matter, and can even be a disadvantage. In addition to enemy players, multiplayer maps are dense with zombies that attack anything nearby. You know whats easy prey for the ravenous undead? A soldier tucked behind a wall or into a corner. By default, players are equipped with a jamming device that keeps zombies at bay, but its very easily disrupted or shot off by enemies. Sitting in cover for more than a few seconds is akin to basting your face in barbecue sauce. Additionally, standing and running around rarely feels like the best idea. In most games, you pay for the smaller target profile of a person lying on the ground with a severe movement penalty, but in Umbrella Corps crouched players move almost as quickly as standing players, and even prone characters are relatively fast. I played a few matches entirely from the prone position (I affectionately call it Worm Mode) and was able to kill enemies and avoid zombies with few drawbacks. Finishing off a kill feels more like a chore than a hunt. Firefights feel a lot more like the damage-absorbent Halo than the three-kills-per-clip style of Call of Duty, as far time-to-kill goes. The difference between this and Halo is that in Umbrella Corps characters feel clunky to control. Aiming down your sights in first-person mode hits your already shambling character with a significant movement penalty. Combined with characters that can eat far too many bullets, finishing off a kill feels more like a chore than a hunt. Guns also take far too long to reload, meaning if your aim isnt excellent, youll have to stop shooting to reload before you pursue. This wouldnt be a problem if your poor movement and weak weapons werent already working against you. After a few matches, I went into the customization menu to equip a new decal on my characters helmet. I couldnt help but laugh at one that said, 100 Shot 1 Kill!! One thing Umbrella Corps gets right is the pace at which it gives you new guns, attachments, armor variants, colors, and other customization items. You level up quickly, and the string of new toys would be a strong incentive to jump right into your next match if this were a better game. Some of the armor sets look cool, if a bit generic, but the flashy, high-level rewards, like the Soviet-style mask or the night assault gear, are tantalizing. However, this system is made almost entirely irrelevant by the Brainer. It's not difficult to run up to an enemy while under fire and initiate its finishing move. The Brainer, according to Capcoms description, is a powerful melee ax which goes straight into the skull. Its equipped for free on every player, and its benefits are simply too good to ignore. You move quickly while wielding it, and it has a one-hit-kill charge-up attack with an extremely generous lock-on range. And because players are bullet sponges, its not difficult to run up to an enemy while under fire and initiate its finishing move. In any given match, about half of the players (if not more) will be running around with the Brainer, braining away. Why be excited for new gear when you already have the best weapon? Its what youd call a no-brainer. Resident Evils influence is mostly seen in Umbrella Corps maps. Series fans will be familiar with Umbrellas facility, Tricells HQ, and the village from Resident Evil 4. The levels are detailed and look great at times, but they all share one big problem: theyre too cramped. Umbrella Corps 3v3 matches means theres never a large number of players, but when filled with dozens of mindless, roaming zombies things get claustrophobic in a hurry. Another side effect of the map size is that unfair spawns happen too often to excuse. Dying a second after you spawn is no fun, and if youre playing the mode where one player is marked as a priority target for the enemy team, it quickly turns from an annoying issue into a game-losing problem. This is the only mode that uses the random zombies in a way that matters. One mode, in which you must kill zombies and collect more DNA vials than the other team, is Umbrella Corps biggest success. This is not a unique idea -- its much like Call of Dutys Kill Confirmed mode -- but its the only mode that uses the random zombies in a way that matters. Your guns can mow down zombies in no time, but theyre also loud, and that noise alerts other players to your presence and makes you an easy target. Worse, if you just killed a pack of the undead and didnt yet move over to their bodies to collect the vials, an enemy could kill you and claim the DNA as well. Using silent melee attacks is obviously a stealthier approach, but it tends to be slower than using your guns. With the clock constantly counting down, I enjoyed switching between tactics to give my team an edge. The other modes are standard fare: kill the enemies, defend the point, collect the briefcases. They arent necessarily bad, just uninspired, and they dont make smart use of the zombies at all. With that potentially unique element stripped away, youre left with average shooter modes in a below-average shooter. Umbrella Corps has a single-player mode called The Experiment, but its too shallow to hold your attention for long. Across these 20+ levels, you have to complete mission objectives with only one life. If you die, you have to restart. There is a tension present here that isnt found in most of the multiplayer modes, as getting overwhelmed by zombies is a real problem. However, the mood is too often defused because zombies drop so many healing herbs. Its here that Umbrella Corps once again defeats itself. With healing so plentiful, The Experiment doesnt feel as tense or as challenging as it should. The end result just doesnt work. Pros Fun unlock system Cons Clunky shootingOverpowered BrainerRidiculous movementBoring modes Umbrella Corps is a bad competitive shooter that doesnt even know how to take advantage of its few strengths. Its mechanics frequently contradict each other, balance is absurd, controls are clumsy, and it fails to pull anything meaningful from the Resident Evil universe other than some recognizable settings. With no great story hooks for horror fans and mechanics that cant compare to most modern shooters, Umbrella Corps feels like a game made for no one.", "date": "June 25, 2016,"}