{"name": "King Arthur: Knights Tale", "name_review": "King Arthur: Knight's Tale Review", "ref": "https://me.ign.com/en/king-arthur-knights-tale/197704/review/king-arthur-knights-tale-review", "text": "King Arthur is dead and you, Mordred, died killing him. Now Arthur has cursed the afterlife. In order to bring peace to the island of Avalon, you must do what you do best: Kill Arthur  or rather, the variety of vile villains his soul has been twisted into. For those who were fans of Neocore Games' previous turn-based dark fantasy, King Arthur: A Role-Playing Wargame, the idea behind King Arthur: Knights Tale is very welcome indeed. Don't expect a retelling of the classical romances like Malory or cinematic depictions, but do expect your favorite Arthurian characters to appear in some twisted afterlife form, and for them to take part in battles between a handful of powerful knights and hordes of enemies using a rich combat system. It's a heck of a lot of game for what it is  a sprawling adventure that's perhaps too repetitive for its own good.It's some 120 GB installed  a giant, unoptimized game that's charming despite, or perhaps because of, its rough edges. Within that it packs everything I expect out of the setting: rescuing fair maidens, slaying dragons, fighting giants  it's all here, all with a grimdark twist, spread across a strategy RPG that can easily eat up 70 to 100 hours of your time as you align with the forces present in Avalon: The Old Gods, Christianity, Righteousness, and Tyranny. Favorites like Tristan and Isolde show up, but Tristan is a rotting zombie now; Percival is here, but the Holy Grail quest can now never be fulfilled; and Gawain's out trying to do some faerie genocide. What Knight's Tale gets right, just absolutely right, is the fantasy of being an armored knight. Your characters are, for the most part, tanks, and used correctly, they're like plows that tear furrows in crowds of enemies, one turn at a time. It is extremely satisfying, and Knights Tales rules are built around that experience. The base mechanics of fights are a great strategy RPG, in that they force you to pay attention to factors like facing, spacing, unit type, and more.Characters have what amounts to three health bars: Armor reduces incoming damage directly but can be lowered by armor-reducing attacks; Hit points are just what you think  and they replenish to max from mission to mission; Vitality is more long-term, a reserve of health to back up hit points that can only be restored by rest in the Camelot hospice. Plus, losing Vitality carries with it the chance of lasting injuries like broken bones and sickness. But fear not: as long as you're careful around enemies who can break it, armor will protect all but the most reckless of knights from lasting harm.To compensate for their ability to absorb punishment, your knights are nearly always outnumbered. To compensate for their ability to absorb all of that punishment, your knights are nearly always outnumbered. While early game combats are often on even stakes, by mid game it's rare to see an encounter that doesn't field 12 or more enemies against your four knights. Heck, some will throw several dozen enemies against you some of whom can summon even more baddies to the field. Your knights are only able to do so much in one turn, limited as they are by a fairly restrictive action point system, so getting more action points via advanced equipment, skills, and special weapons becomes the clutch play.Being outnumbered also means the direction your characters are facing is a key part of combat in Knight's Tale. Though it might not seem so at first, having your character's front arc towards the enemy is vital because it lets shield users block attacks, and everyone avoids brutal backstabs. Given how crucial it is its surprising that there isnt any visual indicator when you're being flanked, so you always have to double check all your characters facings before ending your turn or risk the consequences.Double check all your characters' facings before ending your turn or risk the consequences.Unfortunately, combat encounters don't always live up to the promise of their interesting rules because while there are plenty of highlights, there are just too many of them that bring down the average. Terrain is often bland, lacks variety, or is simply nonexistent. You're frequently up against the same four unit types, perhaps with a boss thrown in, in different mixes, for seven or eight fights in the same mission. Some fights are just frustrating wastes of your time: 12 of the same enemy at once, or worse, short interludes of two or three easily defeated foes that take longer to start and finish than they do to actually fight. Between these long quests you return to Camelot, where you can build upgrades to buildings, make lordly decisions like solve disputes between lords, and buy new equipment. Nothing too deep there, no big research tree or whatever to traverse, but it's a nice enough little meta-game between adventures.And make no mistake: adventures are the heart of Knights Tale. You've got a round table of 12 knights, with some alternates in the wings, but there are 30-some characters to collect, so you kick the ones you don't like to the curb all the time. To keep your benched party members leveled up you can train them off screen, but also there are enough missions that  especially on the harder difficulties  you need to run two or three separate teams of knights at once. I sunk 65 hours into completing King Arthur: Knight's Tale, though after a while I started just dropping side quests and rushing into the endgame because Id had enough of those repetitive battles.I sunk 65 hours into completing King Arthur: Knight's Tale.That experience of sending teams on epic quests is essential to the Arthurian feel, and I like that part of it, but individual quests in Knights Tale are just far too long. You wander around the map, getting ambushed and surprised by enemies constantly, picking up little trinket-filled chests, and generally doing what I'd call the very un-knightly equivalent of busywork for little reward. There's a reason that you don't have to run around looting after the mission in XCOM or Fire Emblem: It's not much fun.Perhaps I'd be gentler on the quests if the stories were excellent, but they dont earn that leniency. Some of them are fun, interesting twists on the stories of your Arthurian all-stars, but the majority are tired fantasy tropes or obvious journeys from start to finish. The one-note dark fantasy writing is serviceable at its best; more often it's both dull and riddled with grammatical errors.The overall story, though, is cool. It's fun to fight in this weird afterlife where no one's quite sure what the new rules are. The story goes deeper than you might expect, incorporating not just Arthurian legend and Christian myth but diving into pre-Christian Britannic practices, including the gods and spirits of Wales and Ireland. It also segues nicely into the optional post-campaign game where, having defeated the evil Arthur, you fight an invasion of giants and other mythical beasts. But this tale was already too long for its own good. King Arthur: Knight's Tale takes the classic ideas of the legend and remixes them into a familiar form. It's ambitious and lengthy with detailed tactical mechanics that emphasize smart positioning and facing in order for your small squad of heavily armored knights to overcome many times their number, but is undermined by a shallow story and repetitive mission design. There's fun to be found in its grim, scowling characters and knightly fantasy milieu, but if you're like me you'll get bored long before you see the ending of its dark retelling.", "date": "May 23, 2022,"}