{"name": "Teenage Mutant Ninja Turtles: Out of the Shadows", "name_review": "Teenage Mutant Ninja Turtles: Out of the Shadows Review", "ref": "https://me.ign.com/en/teenage-mutant-ninja-turtles-out-of-the-shadows/119889/review/teenage-mutant-ninja-turtles-out-of-the-shadows-review", "text": "More than once in Teenage Mutant Ninja Turtles: Out of the Shadows, the turtles themselves are introduced, with the movie offering up a brief explanation of each turtle's personality or how each one works into the group as a whole. Despite being a sequel, doing this onceespecially when Leonardo, Donatello, Michelangelo, and Raphael are being introduced to another charactermakes some sense. Doing it twice, however, is downright odd. There is in fact a lot that is odd in the Dave Green-directed film, but then the story operates in a world where mutant turtles have been taught martial arts skills by a mutant rat. It is also a world where these turtles use their skills to battle evil, evil that comes in the form of a different martial artists master, The Shredder (Brian Tee); his black-clad ninjas; and sundry others. Since the 2014 reboot offered up an origin story for many of these characters, Out of the Shadows is able to jump right into the action. Where the first film seemed hesitant to give us a good look at the heroes and placed a primacy on reporter April O'Neil (Megan Fox) and her cameraman, Vern Fenwick (Will Arnett), here the humans take a backseat to the heroes in a half shell. The Out of the Shadows title in fact functions in two ways  first, the turtles spend more time out in the world at large than in the first film and second, we get to the see more of them as well. In fact, the characters of April and Vern regularly feel like afterthoughts in the movie, something that was definitely not the case in 2014. While losing those two is a negative, it is great to see that Out of the Shadows, unlike the first movie, is not scared to offer us the four brothers who ought to be at its center. It is not scared to offer us Shredder's mutant henchmen, Bebop (Gary Anthony Williams) and Rocksteady (Stephen ~Sheamus~ Farrelly). It is not scared to take us to Dimension X and show us the classic Turtles villain Krang (essentially, a brain with tentacles). Green and company embrace the insanity of it all, and embrace it with gusto, making for a definite improvement on the last movie. The action sequences are better in this sequel as well. Where the first film offers up a fun-filled chase down a snowy mountain, Green improves upon the idea here with a battle along a South American river, one which starts with the Turtles skydiving from one plane to another before eventually getting everyone soaked. It is an adrenaline-pumping feast, and almost as good as a sequence with the Turtle Van earlier in the film. The climactic battle isn't as enjoyable as these two other pieces but still has things to recommend it. It must be said though that all of this action and additional Turtle time does not come without a cost. While the plot of the first film was rather nebulous, this one is off-the-wall crazy. It involves Krang needing bits of machinery so that he can bring his Terrordrome through to our world. A discussion with TMNT devotees may be able to clear up some of the things that don't make sense, but those not familiar with the ways of the Turtle will find many things to question, and even those who are familiar may not quite grasp the whys and wherefores of some moments. Diminishing the storylines for Vern and April also allows for more time for other characters, and Green does a wonderful job introducing not just the aforementioned Warthog and Rhino but also Casey Jones (Stephen Amell) and Baxter Stockman (Tyler Perry). And, not only are they introduced well, but they are all highly enjoyable on screen, even if Bebop and Rocksteady steal the show. As for Laura Linney's Police Chief Rebecca Vincent, while she is a fun addition, she isn't given terribly much to do. As for the Turtles' story, while it is here and more developed than previously, it also is rather stale. Team Leader Leonardo (Pete Ploszek) is having trouble keeping the merry band together. He, Raphael (Alan Ritchson), Michelangelo (Noel Fisher), and Donatello (Jeremy Howard) are suffering from general sorts of teenage anxiety about what kind of turtles they want to be and whether they truly belong in the world and the four don't see eye-to-eye on the answers and way forward. This plot is made worse by Out of the Shadows dropping it in favor of moving quickly towards the climactic action sequence. Beyond that, the effects, while regularly excellent, still falter at times. The Turtles have moments where they feel as though they might actually be wherever we see them, but other times they are quite clearly produced by a computer. Bebop and Rocksteady have fewer moments where they feel truly present and, as enjoyable as it is to see Krang (voiced by Brad Garrett), he never feels remotely realistic.", "date": "June 5, 2016,"}