{"name": "Dangerous Golf", "name_review": "Dangerous Golf Review", "ref": "https://me.ign.com/en/dangerous-golf/119888/review/dangerous-golf-review", "text": "What would a golf game be like if its cover athlete was Bill Murrays destructive greenskeeper character from Caddyshack? Its a question that almost certainly no one has ever asked, yet developer Three Fields Entertainment has made an attempt to answer it anyway in the form of its over-the-top debut, Dangerous Golf. This physics-based, smash-for-cash arcade golf game created by a team of ex-Criterion members could have been Burnout with balls, but a clumsy camera and unreliable physics engine prevent it from being an overall smash hit. Dangerous Golf appears to take more inspiration from Angry Birds than it does from the walk-spoiling sport. The goal for each of its 100 campaign courses is less about finding the hole and more about how much spectacular-looking, Unreal Engine 4-powered destruction your ball can achieve on its way there. The only green you ever need to target is the dollar value on your damage bill - which ultimately decides whether you receive a bronze, silver, gold or platinum medal. Theres no swing-timer to master nor is there a choice of different clubs. Dangerous Golf simplifies the act of taking a shot by putting the focus squarely on the aiming, which reinforces its accessibility and keeps its momentum fast-paced. All you really need to think about is which trajectory through this mens room is going to result in the largest insurance claim, flick forward on the thumbstick and enjoy the ensuing eruption of pulverised porcelain. Dangerous Golf feels a bit like a Rube Goldberg device built by a bored billionaire And theres no doubt about it: smashing stuff is fun. Well, it is for a while at least. At its best, Dangerous Golf feels a bit like a Rube Goldberg device built by a bored billionaire, particularly when youre firing your golf ball into a pyramid of champagne magnums so that their corks cannon into a wall of fine crystal, or bouncing it along a row of cocked crossbows that loose their arrows to clatter into a hallway of suited armour. Opulent vases shatter and scatter, bookshelves erupt into fountains of shredded paper, and splintered neon signs spit showers of sparks every which way. Unfortunately, all of this destruction too often obscures the view - which is from a camera thats tight in behind the ball for the most part - making it harder than it should be to nail the big-ticket targets during your manually-steered second stroke, called a smashbreaker. It also doesnt help that the cameras stubborn refusal to tilt along the Y-axis adds unnecessary guesswork to dropping the ball into the hole from the air. Further, much like Angry Birds, Dangerous Golf possesses a physics engine that is wildly unpredictable. Sometimes Id hit a poor shot and fluke my way to a room-razing platinum medal; at others Id drill a pistol tee shot and watch it get trapped in a kitchen sink, bouncing around infinitely until I hit the restart button. (On a handful of occasions, the ball left the course area entirely and got trapped out of bounds.) That unpredictability definitely creates surprising moments, but at the same time it makes success feel unearned and failures unfair. To its credit, Dangerous Golf does make attempts to compensate for these annoyances by switching up the strokeplay from course to course. Modifiers that trigger bombs wherever your ball lies, time-based putting challenges in rooms packed with more holes than the plot of The Dark Knight Rises, and rows of paint cans primed to wallpaper a decadent dining room with a special shade of Kindergartner's Homework are a few of the more memorable course types I enjoyed. Yet the overall novelty wasnt strong enough to pull me back after Id completed all 10 of its tours. I didnt care to try to platinum every hole, nor did the turn-based multiplayer introduce a different enough dynamic to make the one-note destruction grow any extra legs. Pros Impressive environmental destructionSmashing stuff is fun Cons  But the novelty doesnt lastDubious physicsCamera is often obscured Dangerous Golf dazzles with its impressive environmental destructibility and the general absurdity of its scenarios entertains for much of its 100 courses. However, blocked perspectives and fudged physics too often swap the fun for frustration, and ultimately you can only destroy the same expensive-looking props so many times before your appetite for destruction is well and truly sated.", "date": "June 5, 2016,"}