{"name": "Homefront 2", "name_review": "Homefront: The Revolution Review", "ref": "https://me.ign.com/en/homefront-2/119451/review/homefront-the-revolution-review", "text": "For all of its problems, 2011s Homefront introduced an interesting Red Dawn-like concept, and revisiting post-invasion America in an open-world first-person shooter format sounded promising; but this fledgling FPS franchise has let me down again. There are some genuinely good ideas in Homefront: The Revolution, but nearly every one of them comes with a big fat but. While initially engaging, the stealth and shooter gameplay quickly becomes tedious, the story is terrible, and a general lack of polish means Homefront: The Revolution fails to make finishing its 20-hour campaign feel worthwhile. Where The Revolution does succeed is in the atmospheric design of its world. The backstory of a North Korea-occupied United States is present in every part of developer Dambuster's version of Philadelphia. From bombed-out homes to historic landmarks converted into propaganda-covered re-education centers, the authoritarian atmosphere is ever-present. While its described as an open world, The Revolutions map is made up of eight separate districts that the main quest drives you through in a decidedly linear order, with few reasons to return to an old one when youre through. The Red Zones, where the fighting was heaviest during the initial invasion, are mostly defined by ruined buildings and piles of rubble. Aside from the occasional switch in color pallets and a few landmarks in the downtown area, these desolate no-mans-land areas feel almost indistinguishable from one another. Earlston is dirty, the people seem miserable, and it must smell awful.The populated Yellow Zones, however, are much more diverse and each tells its own story. Earlston, which you visit early on, feels like little more than a glorified refugee camp. Its dirty, the people seem miserable, and it must smell awful. Ashcroft, on the other hand, is where the American KPA collaborators reside, and the alleyways between brownstones are always alive with resentful chatter from the rest of the downtrodden population. While on a technical level the graphics may be underwhelming, the streets of Philadelphia feel world-weary and lived-in. Its a shame that such a well-crafted world is squandered on such a ponderous and uninspired plot. The story of Homefront: The Revolution is nothing more than a string of forgettable mission objectives sewn together with cliches pulled from the Big Book of Military Shooter Tropes. There were several times that I hoped I might be surprised by an interesting reveal, but alas I was merely treated to yet another facepalm-inducing ~twist~. Classic eye-rolling moments like Tertiary Character Gets Bonus Emotional Investment Upon Death or Curse Your Sudden-But-Inevitable Betrayal! are presented by a cast of characters who spend all their time yelling over one another with groan-worthy one-liners. While there are plenty of discussions meant to make us ponder the fine line between freedom fighter and terrorist, any weight these moments might have had is lost when our boring, mute protagonist silently nods and blindly agrees to blow up the next power station, drone factory or whatever else the Resistance points you at. There are no meaningful decisions to make, which makes me wonder why they didnt give the main character his own voice if his path is set in stone. The good news is that blowing up military police stations isnt inherently awful; it's just extremely repetitive. You arrive in a district and complete enough Liberation Activities to inspire the population to rise up and take back their neighborhood. These can range from blowing up trucks and fuel tanks with bombs strapped to RC cars to hacking security terminals with the same idiot-proof minigame every time. There were also unexpected bits of platforming that would unlock a new outpost for the resistance, which were a welcome breather from the routine. The Revolution couldve used a lot more diversions like these to keep monotony from setting in. Once the district has revolted, theres some rioting and a lengthy (but forgettable) story mission or two, then its off to the next district to do it all over again. And again, and again, until The Revolution just sort of ends, in an underwhelming finale. Bizarrely, you cant go back to finish anything you may have missed, even if you wanted to. Yes, I was provided with a point of no return warning, but I havent been locked out of revisiting an open world after the credits since Fallout 3 - it was especially odd considering that there are no custom save slots. Neither stealth nor shooting is worth writing home about.The repetitive sabotage missions are a familiar combination of first-person stealth and shooting. Neither style of play is worth writing home about. Sneaking through alleys and checkpoints is fun for a bit  the first few times I narrowly avoided detection were legitimately exciting  but doesnt hold up for long thanks to a lack of any unique stealth mechanics. Beyond the ability to hide in dumpsters and create distractions with various crafted bombs, incendiary devices or hacking tools, its very basic stealth  you cant even stash a body. Getting caught and forced into a firefight never feels particularly dangerous, either, especially once you realize you can just round a corner and wait for enemies to come at you one at a time until youre waist-high in corpses. As with the stealth sections, it's fun at first - but this is largely due to your limited starting arsenal. Once you obtain better gear, the slow-witted AI combined with the lethargic way both enemies and I moved around the battlefield makes gunplay feel sluggish, especially when compared to Homefronts finger-twitching contemporaries. The Revolution does distinguish itself from other realistic near-future military shooters with an interesting on-the-fly crafting and weapon conversion system. Bearing more than a passing resemblance to Crysis weapon modification system, this in-game menu allows you to quickly install attachments to a weapon at a moments notice. Being able to hot-swap the scope on a bolt-action rifle, for example, means youve got a much more versatile weapon: I could deal with shotgun-wielding shock troops up close, then switch to the long-distance scope to pick off a pesky sniper. You get to watch your character strip apart an assault rifle and attach new parts to its frame.It goes further than that, becoming in effect a lore-friendly solution to a common inventory problem, in that youre effectively able to carry more than the standard two (or three) guns. With some very cool animations, you get to watch your character strip apart an assault rifle and attach new parts to its frame until it transforms into a mine launcher, or convert a pistol into an SMG. Mechanically speaking theres no real difference between toggling between modes and just holstering one weapon and drawing another, but Homefront does it with some flair and is more believable than the bottomless-pockets inventory we see in games like GTA 5. While the weapons work reasonably well, what makes combat extra frustrating is the surprising number of bugs that constantly reminded me of The Revolutions lack of polish. In addition to constant framerate drops and slowdowns, enemies will frequently spawn on top of you as youre walking around, or may disappear entirely as you move around them. One of my personal favorites is the checkpoint save system which, on multiple occasions respawned me - weapon holstered - in the center of a large group of enemies. That one was extra fun because, with no option to restart the mission or generate a custom save, my only options were to repeatedly try to fight my way through or start the whole game over again. Theres also the co-op Resistance mode, where squads of up to four players can tackle missions set in the various districts around Philadelphia. However, with only six missions available to play, I was confused as to why Resistance mode includes such a huge number of unlockable items and skills. While exploring the world is a bit more fun with other people, I cant imagine wanting to play these missions enough times to unlock more than a few new abilities. Pros World designWeapon conversions Cons Generic storyRepetetive objectivesAnnoying bugs Though its world has some great aesthetic devices and a cool concept, ultimately all of Homefront: The Revolutions elements feel repetitive, unpolished, or downright unnecessary. Over the length of its campaign it fails to deliver a satisfying - or even fully functional - shooter experience.", "date": "May 17, 2016,"}