{"name": "The Darkness", "name_review": "The Darkness Review", "ref": "https://me.ign.com/en/the-darkness/119404/review/the-darkness-review", "text": "In a classic multi-part Brady Bunch episode, the Bradys run afoul of a Tiki curse in Hawaii. Essentially, by picking up a Tiki and removing it from its location, bad things start happening to members of the family. Greg McLean's new movie, The Darkness, is best thought of as a serious spin on that classic sitcom storyline. It is also equally scary. The story here finds the Taylor family on vacation near the Grand Canyon with some friends. The youngest member of the Taylors, Michael (Gotham's David Mazouz), soon finds himself in an ancient, buried, Anasazi chamber where there are spooky images on the wall and five engraved stones in front of him. Michael grabs the stones and leaves. Soon, naturally, bad things start to happen to the family which, in addition to Michael, includes Dad, Peter (Kevin Bacon); Mom, Bronny (Radha Mitchell); and daughter, Stephanie (Lucy Fry). At first, the Taylors are unsure that there's a problem at all, at least anything beyond the stuff that they have going on already. This includes Peter having cheated in the past, Bronny being a recovering alcoholic, Stephanie battling bulimia, and Michael being autistic. The Taylors are in fact so unaware of darker forces at play that when Grandma, who appears in a single scene, is attacked by a snake and winds up in the hospital, the Taylors never go to see her again. She isn't even mentioned again once the Taylors start putting things together. The Darkness is a movie where these sorts of things don't matter. It is entirely about being vaguely creepy and so busy pushing its ~evil forces at work~ plot that it can't get bogged down in specifics or worry about pesky things like logic. At another point in the movie, Bronny and Peter have a fight about the weird stuff taking place and bring up how one of Michael's expensive doctors said that the problems parents are having can be brought out in their children. Very quickly this discussion goes from being about marital strife to bad karma and literal (not figurative) ghosts. It is an incredible leap with absolutely no motivation for it save that the plot is in fact about supernatural things taking place. Beyond that, there is an implication made in the film that the anger between the parents is due to the evil spirits making them act differently than usual, but the anger being discussed at that moment has more to do with Peter's cheating. That took place way before the Anasazi stones were brought back to the house. In fact, all we see of Peter is a repentant individual who would never do such a thing again. Going with the lack of logic for a moment, for her part, Stephanie attends school, which tells us that this takes place during the school year. Michael, however, despite being school age never goes to school. He stays home with Bronny. He has a backpack he takes everywhere, but he doesn't actually go to school and Bronny doesn't appear to be homeschooling him either. Michael just sits around playing with his new imaginary friend, Jenny, who has something to do with the stones (not that Michael's parents know that). There are problems in the film beyond plot as well. Some of the things we most need to see to understand what is taking place are ignored. For instance, Michael finds the Anasazi stones initially because he's sitting on some rocks along a trail, drops a watch, and wants to retrieve it. We see him drop the watch. We see the watch's resting place. We see Michael lose control going down to get it and breaking through the ground to find the hidden cave. What we never see is just how far down the watch actually fell. McLean offers no camera shot to indicate that the watch is anything more than six inches beyond the reach of Michael. In fact, it very much feels like it is only six inches, making Michael's retrieval attempt perplexing at best. Later in the film, in order to learn more about what might be happening to her family, Bronny runs a web search, tossing together various words until she comes upon webpages that fit what she's looking for. Save for some YouTube videos however, the audience never gets more than a cursory glance at the pages. There are words and phrases that pop out due to the pages' layouts, dragging the audience, with Bronny, to the inevitable conclusion that there are supernatural spirits at work. As devices go, the web search is carried off poorly. The biggest surprise is that after Bronny puts in the family's symptoms, the search results don't return a cancer diagnosis. Finally, although the movie has a good castfolks like Paul Reiser, Ming-Na Wen, and Matt Walsh, all appear at least momentarilythere is little to no character development. This is most frustrating when it comes to Michael. He is a crucial part of what takes place, but his autism is never explored beyond the audience being told that he sees things in a ~different~ fashion. There is no attempt to offer his point of view and explore this difference. His autism winds up feeling like nothing more than a way to draw upon the numerous results one gets when they google ~autism and hauntings.~", "date": "May 14, 2016,"}