{"name": "Star Fox Zero (Wii U)", "name_review": "Star Fox Zero Review", "ref": "https://me.ign.com/en/star-fox-wii-u/118421/review/star-fox-zero-review", "text": "Star Fox Zero resurrects a classic Nintendo 64 plane and tank action game and reimagines it in a faster and more furious incarnation for the Wii U. The best levels capture the feeling of a wild rollercoaster, often showcasing addictive combat scenarios that incentivized me to get on the ride again and again. But, in order to build up my piloting skills, I had to adapt to a demanding and unintuitive control scheme that pushed my ability to focus on the TV and the GamePad to the limit. This radically redesigned Star Fox pays homage to its vintage late 90s source material, but the results of the modernization are mixed. On one hand, this is a faster-paced space combat game running at a high frame rate (a target of 60) and it tries out some fun new level ideas. However, it takes the retro look a little too far in places, with a lot of plain-looking enemy ships and tall tanks made of simple geometry and dull textures that looks out of place in an otherwise-modern 2016 game. Yet even without elaborate graphics, the frame rate dips noticeably under the weight of large explosion effects in a couple of bigger combat arenas. Overall, Star Fox Zero pulls it off, and part of that is thanks to the inherent charm from its zany cast of fly boys and their intentionally cheesy banter during the campaign. It taps into these one-note personality tropes with plenty of quips and one-liners that would please a writers room of Saturday-morning cartoon producers, complete with plenty of Ill get you next time! threats from villains. Zeros story is a predictable re-tread of the N64 original, but it does a good job of refreshing it for a new audience. Space Jam The campaign can be completed in roughly five hours, but you wont see everything on your first pass, and it does a lot to encourage more playthroughs so you can collect hidden medals and post high scores on the leaderboard. For example, some excellent skirmishes offer lots of targets to shoot, but if you keep your cool youll spot clever side exits that lead to entirely new areas. These hidden pathways crisscross through the galaxy, opening up challenging new courses featuring powered-up enemies or massive alternate bosses that must be defeated before a timer runs out. Carefully prodding and poking stages for secrets is the only way to unlock all 20 campaign missions. Others levels in Star Fox Zero pull off impressive scale and spectacle. The hyperspeed trek through the Gamma Sector is a delightful trip through a tight spaces and deadly obstacles, while the tumultuous trek through the desert planet of Titania is full of falling debris and loaded with enemy ships to shoot down with the firepower of an awesome tank at your disposal. The one lame trip in my tour through the galaxy was Zoness, a plodding stealth level that felt more like busywork than an action-packed Disneyland attraction. In it, I had to man a frustratingly slow craft and deploy a personable-yet-dull robot companion to deactivate enemy defenses. Zoness squanders a lot of its potential with uninspired design, which often sees enemies conveniently patrolling around explosives or other hazards that made them trivial to destroy. It just doesnt come together as well as Star Fox Zeros rocket-fueled missions through livelier planets of the Lylatt System. Big boss battles are Star Fox Zeros best moments, and each one feels different. From air-to-air dogfights with the rival pilots of Star Wolf to a nasty face off with Monarch Dodora, an enormous winged boss that shoots a powerful laser from its tail, each fight focuses on using crucial maneuvers like flips to get behind enemies, barrell rolls (do one!) to avoid incoming projectiles, or blowing up pieces of a boss to expose its main weak point. Theres some extra variety that comes from piloting a handful of different vehicles in certain missions, and Nintendo does a good job of making each craft feel unique, for better or worse. The Arwing quickly became my favorite because it can maneuver quickly in air-to-air combat, and while its clunkier and not quite as fun when it transforms into bipedal tank mode, its still much more enjoyable than the annoying and slow-as-molasses Gyrowing hovercraft. The Landmaster tank is another slow-moving vehicle, but it makes up for it with sheer, satisfying firepower that can take down enemies quickly. Collecting medals opens up difficult challenge missions for each vehicle so I could put my expert skills to the test, but youll have to stick with a frustrating learning curve to become an ace pilot at these controls. The Right (and Wrong) Stuff Whats baffling about Star Fox Zero is that piloting a vehicle is complex and awkward at times because Nintendo chose to split our view of the action across two screens. The TV shows a traditional third-person perspective so you can see the space behind your ship, while the GamePad displays a transparent cockpit view that you use to aim at enemies using motions controls. I eventually did get good at it, but the learning process made my first hours more frustrating than they shouldve been. I often ran right smack into enemies and walls since it was hard to focus on moving and shooting at the same time. The problem comes when trying to maintain control as you move your eyes between the two screens, especially since the perspectives affect how you aim. Even through the TV shows a larger field of view, sometimes using it to take an unassisted shot that looks like it should hit will completely miss. In those cases, you have to look down at the GamePad to line up a precise volley, then look back up to take in your surroundings and push forward. The good news is that the GamePads tilt controls feel competent no matter what vehicle youre in, and it was easy to manipulate the cursor and fire at targets. Nintendo also gives pilots lots of alternate input options that alleviate some of the stress of driving: you can choose between using the analog sticks or buttons to pull off somersaults, quick 180- degree turn, or fire smart bombs. It feels like a job made for two people, and co-op mode appropriately splits up the two screens into two roles. This is the best way to play, since one person assumes the role of a pilot while a friend mans the guns. But the lock-on camera introduces a problem on the first boss: Because the perspective is stuck in a fixed perspective, the pilot cant see directly in front of him without access to the view on the GamePad, and thats kind of important! Its difficult to pick up rings, or fly in general. Pros Thrilling stagesFun boss fightsReplayability Cons Awkward controlsGyrowing stages Star Fox Zeros fun stages and impressive boss fight give me lot of reasons to jump back in and play them over and over, and especially enjoyed them in co-op until I got a hang of juggling two screens myself. Ive played 15 hours and I still havent found everything. Learning to use the unintuitive controls is a difficult barrier to entry, though it comes with a payoff if you can stick with it.", "date": "April 21, 2016"}