{"name": "Fallout 4: Wasteland Workshop", "name_review": "Fallout 4: Wasteland Workshop DLC Review", "ref": "https://me.ign.com/en/fallout-4-wasteland-workshop/118180/review/fallout-4-wasteland-workshop-dlc-review", "text": "I never cared all that much for building settlements in Fallout 4, but since installing the Wasteland Workshop DLC Ive at least enjoyed turning them into the post-apocalyptic worlds worst zoos. It includes some fun ways to mess with the creatures and residents of the Commonwealth, though not much more than that. Its a bit disappointing that there are no stories or missions built around these new settlement options, but the new tools in the toolbox do make Fallout 4 a more creative game. Its amusing to capture raiders and deathclaws, imprison them in your settlements, and then force them through gauntlets of elaborate traps. Plus, the aesthetic effect of a pack of deathclaws wandering serenely through the early morning fog in Sanctuary is pretty cool. But the charm quickly wears off. A big reason why is that, considering capturing creatures doesnt really make your character more powerful, some of it is just a hassle to use. Monster cages are the most interactive new element, but the process of creating and using them is unnecessarily cumbersome. Theyre expensive to build, so expect to spend a lot of time foraging for materials (or just break down and cheat). And once you do build them, the act of trapping a monster isnt interesting or quick  you just have to place them and wait until a monster appears in them. Plus, if you didnt invest heavily in the charisma attribute, youll miss out on the essential creature-subduing device. I suspect Wasteland Workshops designers intend for you to conduct capture operations between other adventures so youll have something waiting for you when you return. But that doesnt really make sense for where Fallout 4 players are right now, more than six months after release. Having already done most of what Fallout 4 contains at this point and wanting to experience Wasteland Workshop as a way to refresh the experience, I would have appreciated a better way to accelerate my trapping than manually sleeping at a bed for several nights before a new beastie showed up. Blade Traps Another issue is that due to the lack of story or missions, actually enjoying your captives is largely a matter of making your own fun with the tools provided. I was briefly amused sending captured beasts through gauntlets of automated defenses like hallways full of spinning blades, but theres no challenge in it and nothing to gain from it. Likewise, theres no real reason to use the new arena markers that let you pair teams of settlers, companions, and pets in staged battles. If youve messed with console commands to spawn enemies at all, youve already seen all of these fights. And its not like the arena does anything to compliment that, like keep track of Preston Garvys win/loss record or organizing monster tournaments. ...the fights are frankly unexciting to watch. On top of not really contributing anything functional to your settlement, they can cause harm: turning settlers against one another in the arena means only one comes out alive, and that pretty much demands saving beforehand and reloading after to avoid permanent repercussions. Id have appreciated a non-lethal option, or even better, a reason to risk the lives of our followers, like wagering on fights. Since theres no way to really control them, the fights are frankly unexciting to watch. Its also a letdown that there are so few ways to use these creatures after youve captured and tamed them. After Automatrons introduction of customizable robot servants, I wish Wasteland Workshop would have gone all-in and allowed me to enlist my domesticated Deathclaws as Dogmeat-style companions in my wanderings in the Wasteland, or at least give them names and tasks. Alas, theyre limited to mostly serving as settlement security, which was already pretty well covered by turrets. In that vein, we also get a handful of new traps and defenses with an Indiana Jones-inspired aesthetic to them, though the floor spikes and spinning blades arent particularly practical unless attackers can be funneled into narrow corridors. This device pacifies captured enemies Wasteland Workshops more positive qualities are for settlement builders, and include pragmatic additions like a full-scale Fusion Generator to power all the neat new toys youll be scrambling to build. The neon lighting looks really cool, and using some bug-exploitation trickery I learned how to make glowing letters float in midair. Creative experimentation is at the heart of Wasteland Workshops best stuff, but its also part of the problem: with so much emphasis on just providing materials, there arent a lot of accompanying systems granting measurable rewards to reap from the work youre doing. Pros Capturing enemiesSettlement improvements Cons Lots of waitingNo monster controlLimited utility Wasteland Workshop adds some neat new cosmetic window dressing to Fallouts settlement-building systems, but the piecemeal additions didn't include enough new gameplay applications to hold my interest. The traps and creature-capture mechanics are briefly enjoyable but not fully fleshed out, which quickly makes them deteriorate into disappointments.", "date": "April 16, 2016"}