{"name": "Ratchet & Clank (2016)", "name_review": "Ratchet and Clank Review", "ref": "https://me.ign.com/en/ratchet-clank/117979/review/ratchet-and-clank-review", "text": "Insomniacs Ratchet and Clank on PlayStation 4 is one of the most charming, creative, and rewarding adventures in recent memory. Tagging along with the peppy Lombax and his stoic robotic pal as they jet across the galaxy and blow up everything in sight is an absolutely gorgeous adventure brimming with hilarious writing, beautiful worlds, and an awesome array of weapons. Pixar Come to Life Back in 2002, the original Ratchet attempted to capture Pixars magic formula of colorful worlds, expressive characters, and nuanced jokes that could be appreciated differently by fans of all ages. Cut to 2016, and Ratchet on PS4 has finally cashed in on all of those promises. The lighting, the character models, and the vistas are among the most impressive Ive seen in a game. Possibly most of all are the insane amount of effects that flood the screen during a particularly chaotic battle. Pieces of robots scatter across the environment, your weapons crack and boom like fireworks, and all the money that falls out of your victims is magnetized towards Ratchet, creating a beautiful maelstrom of destruction. Alongside this is the energetic, well-written story thats rife with character and humor that works on multiple levels. The 15-hour campaign follows some of the same whimsical, Star Wars-inspired storyline as the original game, but adds depth to characters while expanding the scope of the adventure. Tools of Destruction Insomniac has a superb penchant for wacky, satisfying weapons that its displayed in games like Resistance, Sunset Overdrive, and past Ratchet games, and here it is just as pronounced as ever. Whether its the Pixelator that turns enemies into a pile of voxels, or the iconic Mr. Zurkon, whom you can once again summon to blast away enemies while delivering a slew of cheesy '80s action cliches, its a weapon lineup thats full of visual surprises and humor. Aside from their variety and originality, I absolutely love the upgrade system at play here. Weapons level up as you use them, which rewards your specific play-style in a meaningful way. At the same time, I wanted to see how other weapons would similarly grow, which encouraged me to experiment with weapons I might normally pass on. Each gun also has a modifier grid you can slowly flesh out, which give you active aids like increased width for a flamethrower, or passive ones like a higher chance of item drops. I found myself playing Ratchet for ~just one more hour~ not only to make it to the next planet, but also because I became mildly addicted to growing and upgrading my arsenal. Youre encouraged to do that by revisiting planets you've already cleared and using new abilities to access new areas, but this leads to a disappointing revelation -- theyre empty. Mobs of varied enemies and awesome cinematic action scenes are replaced by long stretches of nothing but a scant smattering of low-level cannon-fodder. I wanted and was encouraged to go back and find all the hidden Bolts that unlock cool extras, in but I couldn't help but feel like I was visiting the set of a summer blockbuster years after the cameras had stopped rolling. The Spice of Life While blowing up anything and everything makes up the delightful core of Ratchet, the entire adventure is peppered with a generous variety of gameplay twists. Throughout your journey, youll acquire boots that allow you to grind on rails, leading to some exhilarating sequences where youre twisting and turning up the spiral of a tower, hopping from line to line while batting mines away. Likewise, once you stumble across the jetpack, youre able to more freely explore the nooks and crannies of a world, which yields great rewards as long as you can keep an eye on your fuel gauge. Pros Absolutely gorgeousCreative weaponsRewarding upgradesCharming story Cons Occasionally lonely Ratchet and Clank is a culmination of everything Insomniac has done with the series over the past 14 years. It takes the characters that we fell in love with long ago, and sets them off on their most gorgeous quest yet. The deep and rewarding weapon system, beautiful and varied worlds, and charming-as-heck story make it an adventure that anyone with a PlayStation 4 should strap in for.", "date": "April 11, 2016"}