{"name": "Starcraft II: Nova Covert Ops", "name_review": "StarCraft 2: Nova Covert Ops Mission Pack 1 Review", "ref": "https://me.ign.com/en/starcraft-2-vision-packs/117821/review/starcraft-2-nova-covert-ops-mission-pack-1-review", "text": "Short, contained single-player mission packs set after the epic saga of StarCraft 2 were a proposition I was ready to embrace. Unfortunately, the first mission pack for Nova Covert Ops fails to deliver, both as a compelling new chapter for the Koprulu Sector and as an interesting set of scenarios for veterans of StarCraft 2s three-part main campaign. The setup is actually clever and full of potential, which makes the lackluster execution all the more deflating. The ultimate bad guy of ultimate destiny has been defeated; the iconic heroes of StarCraft lore and legend have fallen in battle or ridden off into the sunset. Whats left is a wounded and confused Terran Dominion led by the charismatic idealist, Valerian Mengsk, and his top covert operative (and main character), the elite ghost Nova. With the help of some other returning faces like Matt Horner and Rory Swann, the two confront clandestine threats and internal strife with the potential to tear the stellar realm apart. It has the makings of a refreshing, less galaxy-shattering saga set against the backdrop of the rich lore Blizzard has created for their 18-year-old space opera. But these introductory chapters fall dishearteningly short of doing justice to their big ideas. The mission pack felt surprisingly small, even given my expectations for a lighter experience. Im by no means a pro at StarCraft 2, but I was able to easily clear each of the three missions on Normal difficulty in under an hour each. The entire package was over quicker than some individual Telltale episodes. That alone wouldnt really bug me, but I feel that giving the unfolding intrigue so little room to breathe is a big part of why it didnt work. From the outset, the story beats and pacing feel rushed and amateurish. Were introduced to Nova as a captive in a laboratory, being given instructions from some mysterious figures who apparently brought her there against her will. Its never explained, however, why they would have any expectation of her cooperation, especially considering they left her with her high-tech stealth suit. She, predictably, turns invisible and escapes, against their impotent protests, within a minute of regaining consciousness. Ghost Story From there, the minimalist plot unfolds mostly in fleeting, dialogue-focused cutscenes that tell far more than they show. And they dont tell all that much. They do say enough to get the beats of the story across, but only because the story is so straightforward and unambitious. One of the writers of Nova Covert Ops compared it to Game of Thrones in space at a BlizzCon panel last year. I find that a less than apt comparison. While some cool ideas bubble to the surface, with multiple factions of humans competing and developing complicated relationships, its just barely developed enough to tick a box. Even the worst episodes of HBOs Thrones adaptation didnt dumb down the source material to the point Blizzard seems to think they need to for us to be able to follow it. Whats supposed to be the big reveal at the end of the third mission is utterly predictable and, if anything, makes Nova Covert Ops more of a typical Blizzard, obvious good guys vs obvious bad guys affair. In spite of the writing, the voice acting is first-rate, which made me wish the main players had more screen time and more interesting things to talk about. It was particularly rewarding to hear Brian Blooms gravely, war-hardened Matt Horner return to center stage. His character was one of the best parts of Wings of Liberty, and I hope he gets to play an even larger role in the coming missions. Similarly, the back and forth between Valerian and Nova seemed to be crying out for more room to develop its nuanced chemistry.Rarely did any of the missions show the ambition and creativity of the best ones from StarCraft 2's main campaigns. The mission design doesnt exactly reach for the stars. There are a couple nuggets of ingenuity, like a segment where Nova has to escape a separatist facility on a vulture bike. You control the bike by right-clicking while the screen continually scrolls along a linear highway, forcing you to dodge out of the way of civilian traffic and use targeted abilities to take out pursuing enemies. The bulk of what youll be doing in Covert Ops, however, is building bases and sending out units to do stuff (bog standard StarCraft), mixed with the occasional stealth segment in which Nova goes solo and has to avoid enemy vision cones to infiltrate a facility. Rarely did any of the missions show the ambition and creativity of the best ones from StarCraft 2s main campaigns, which seems less forgivable considering they only needed to design a small handful of them. The saving grace for many of these missions is that Nova is a fun character to control with diverse and interesting upgrade options. I earned new gear after each mission and for completing bonus objectives, which could be equipped at the start of the next outing to change Novas capabilities and playstyle. In addition to the classic ghost set-up with a cloaking device and a sniper rifle, I could kit her out as a frontline badass with a jumpjet pack and a high damage shotgun that fires in a large cone  great for taking out lots of zerg units in a single blast. Im hopeful that as these options expand in the later mission packs, Nova will become an even more potent and flexible heroine. Pros Voice actingHero customizationInteresting premise Cons Mission designStory execution Nova Covert Ops Mission Pack 1 stumbles out of the gate by being too timid to go all-in and fully flesh out some of its more interesting ideas. Kicking ass with Novas diverse equipment builds can be entertaining, and the new and returning voice cast do a laudable job bringing the StarCraft universe back to life after the conclusion of its grand arc. Unfortunately, theyre given a pretty lame environment to do it in, both in terms of the scenario design and the story execution. I sincerely hope the remaining six missions get a better footing.", "date": "April 6, 2016,"}