{"name": "Enter the Gungeon", "name_review": "Enter the Gungeon Review", "ref": "https://me.ign.com/en/enter-the-gungeon/117797/review/enter-the-gungeon-review", "text": "Genre fusion can often be nothing more than a developer clumsily smashing together two popular things in order to make a third, ultra mega popular thing, but Enter the Gungeon makes skillful use of elements from both sides of its family tree. Even judged purely by arcade shooter standards, Gungeon makes the grade, and its carefully implemented roguelike elements add variety, structure, and replayability to that base. Its all wrapped up in a breezy, delightfully silly package that kept me shooting, smiling, and shooting some more. Enter the Gungeon is all about bullets and guns and shooting stuff. No really, it's all about that  to a hilarious degree. The story revolves around a giant uber-bullet that falls from the sky, shell casings and primer rims are worked into the otherwise-standard environmental art at every opportunity, and many of your enemies themselves are (you guessed it) actual bullets who fire what I suppose are their little cousins out of the guns they hold with stubby, T-Rex-like hands. This mix of goofy fetishism is immediately disarming, setting a unique, charming tone right away. Its not all just for looks either  a deep love of arcade shooters is present throughout. Aiming is precise, with just the right amount of stickiness to keep it from feeling too hard or too easy to hit moving targets. Right from level one, there are enemies capable of throwing sinkfulls of bullets your way, giving veteran shmup jockeys ample opportunity to show off their juking skills, while a partially invincible dodge roll can get you out of tight spots when your left thumb can't. The roll was clearly considered in the design of many areas and battles, making it a vital tool rather than an optional crutch for getting out of jail for free. Like a Boss This is especially so for the slew of memorable bosses, who will truly test your mettle by filling the screen with nonsense and plunging you into a true bullet-hell. The one-eyed Behoslter for instance, in addition to the standard array of bullet eruptions, will switch constantly between spawning little minions to take shots at you, firing homing rockets that need to be shot down before they reach you, and a continuously sweeping death beam that needs to be perfectly rolled over. What ensues is a fast-paced juggling act that challenged both my reflexes and my brain. All hail the Bullet King! The minions who fill the halls of the Gungeon are no less varied. From floating iron maidens that spew bullets that try to hit you coming and going to finger-wiggling bullet wizards who project astral copies of themselves to attack you around walls or behind cover, the enemy variety ramps up nicely as you go from level to level, providing an ever-shifting set of challenges to meet as you progress. Right from level one, there are enemies capable of throwing sinkfulls of bullets your way. As diverse and interesting as your foes are, though, the wide array of guns and gadgets is the true star here. Your arsenal is full to bursting with both conventional firearms like the enemy-penetrating sniper rifle or the winchester, and decidedly non-conventional ones like a fire-spewing pitchfork or a laser rifle that sends bullets flying back lightsaber-style whenever you reload. Things like clip capacity, accuracy, and bullet spread help differentiate your MAC-10s from your M4s, and nice reloading and shooting sound effects make even the most basic starting guns fun to fire off for a bit. Still, there are a few too many dull, conventional weapons  I couldnt help but feel pangs of disappointment whenever Id open a chest and find one of the many similar shotguns or handguns instead of something crazier. Guns. Lots of Guns. The funky stuff is where its at though, both for the humorous descriptions and clear pop-culture influences, and because much of it opens up altogether new ways to play. One passive item, the Metronome, lets out a little chime with every kill you make without switching guns or taking damage. That noise means your currently equipped gun is getting stronger and stronger with each downed foe, to the point where even a basic pistol can shave chunks of life off a boss if youve really been on a tear. One of my favorite guns fires two projectiles out in opposing sin curves, and if they come back together to intersect without hitting anything else, the resulting fusion reaction causes a massive explosion that can clear the screen if placed properly. These arent just laser guns of different colors and sizes, but wholly unique tools that provide a ton of fun, creative ways to blow enemies to bits. Roguelike elements are applied sparingly so as to complement the shooter gameplay rather than smother it. Each floor of the Gungeon is a made up of a random configuration of hand-crafted rooms, so everything feels well placed, but you never settle into a monotonous rhythm. Chests, shop items, and boss drops are all totally random, so one run I might be blanketing rooms with a molotov launcher and mopping up with a gun that fires homing skulls, and the next I might multiply the damage output of my Mega Man-inspired buster cannon with a projectile-doubling active item. Even the bosses you face are randomly pulled from a pool, so you can't lazily prepare for the same threats on every run. The only roguelike convention that felt underdeveloped was the selection of playable characters, who didnt feel different enough from one another for me to gravitate towards any one of them. As diverse and interesting as your foes are, though, the wide array of guns and gadgets is the true star here. A light spattering of dungeon traps, NPCs to save, and sacrificial shrines round things out, but these elements serve more to add variety than to force you to make the best of bad situations like in other roguelikes. This keeps the focus squarely on your ability to move and shoot - a lucky drop can certainly make life easier, but I never died and thought Man, I really got screwed on this run. It was always Man, I should try and suck less next time. Enter the Gungeon also employs a few quality-of-life elements that keep the action moving at a constant pace where other games slow down. After clearing a room of baddies, all the currency theyve dropped just magnetically pulls to you, even as youre running to the next room  you never need to waste time scouring for every last penny before moving on. Teleporter nodes are sprinkled liberally across the well-marked dungeon map, making it easy to quickly identify doors you havent opened or items youve left behind and return to them without having to hoof it through too many empty rooms in the process. Theres even a quick-start prompt that comes up during the opening splash screens that drops you directly into a fresh run as the last character you played with. Rarely have I gotten into the action so quickly. Pros Charming lookLots of crazy gunsEnemy varietyGreat pacing Cons A few boring guns Enter the Gungeons design is quite sophisticated for a game about shooting bullets at anthropomorphized bullets with guns; it uses elements of one genre in the context of another, enhancing its most enjoyable elements. Despite there being so many more moving parts than in a typical arcade shooter, it somehow feels more immediate and focused on getting you into the action and keeping you there. And where other similar games can run out of novelty within a few hours, Enter the Gungeon is still surprising me with new implements of destruction after 50 hours of play.", "date": "April 6, 2016,"}