{"name": "Rise of the Tomb Raider -- Cold Darkness Awakened", "name_review": "Rise of the Tomb Raider - Cold Darkness Awakened Review", "ref": "https://me.ign.com/en/rise-of-the-tomb-raider-cold-darkness-awakened/117691/review/rise-of-the-tomb-raider-cold-darkness-awakened-review", "text": "Credit where its due: Rise of the Tomb Raiders DLC continues to differentiate itself from the main game with new ideas. Although new Expedition Mode Cold Darkness Awakened isnt quite enough of a challenge to sit comfortably under a survival horror moniker , its a fun and frantic hour-long experience which eschews Tomb Raiders usual bad-guys-with-guns for a horde of far less predictable subterranean zombies. Laras new foes are certainly relentless. As you make your way through an old soviet compound, avoiding your enemies, not confronting them, is key. If Lara is spotted, theres little to do but run as a multitude of them will pursue you at once, lobbing explosives, teeth bared. Its a great respite from Laras usual run-and-gun method of despatch, and makes for tense traversal. Its a shame, then, that the compound itself isnt very interesting. Cold Darkness Awakened tasks you with shutting down the viral oubreak in three separate chemical production towers, and getting to them is relatively straightforward. Youll be asked to rescue prisoners or hunt down weapon caches, but such tasks arent particularly exciting, and theres no real reason to linger bar score-chasing for Expedition credits. Id recommend adding cards to your game - particularly health-limiting ones - to add a little more excitement and longevity to proceedings. Still, once inside, the chemical compounds are a lot of fun. Over radio, series regular Nadia will frantically issue instructions on how to deal with the various pumps, levers and fuse boxes that have to be manipulated in order to shut down the virus, all while hordes of the infected shamble around you. That Nadia gets increasingly flustered adds a great sense of that everything is quickly spiraling out of control. Cold Darkness Awakened climaxes in an explosive scenario where Lara is tasked to shoot a number of pistons while being attacked from all sides. Though shoot the red things is an overly-familiar piece of game design, the waves of enemies here are relentless enough that it never stops being enjoyable, especially if youre using Laras very effective shotgun. Pros Great new enemiesThrilling climax Cons Empty gameworld Cold Darkness Awakened is a welcome change of pace to Rise of the Tomb Raiders usual rhythms. Though its gameworld isnt particularly interesting, it does a great job at escalating tension and resolves Laras fight against an infected horde with an explosive climax.", "date": "April 3, 2016,"}