{"name": "Quantum Break", "name_review": "Quantum Break Review", "ref": "https://me.ign.com/en/quantum-break/117661/review/quantum-break-review", "text": "The main characters of Quantum Break may frequently find themselves stuck in time, yet developer Remedy Entertainment appears to have no such problem. The team behind Max Payne and Alan Wake has successfully managed to evolve its signature style of cinematic shoot-em-up for its latest release; seamlessly melding digital gunplay and TV-inspired storytelling without compromising the quality of either side of the experience. While I wish the combat stakes had been raised a little higher in its second half, Quantum Break remains a stylish and often-exhilarating third-person shooter wrapped up in a tautly paced tale of time travel. Consisting of five gameplay acts interspersed with four breakneck-paced episodes of a live-action TV-style show, Quantum Break opens - as so many great sci-fi stories do - with a catastrophic accident in a research lab, one that creates a potentially world-ending fracture in time and imbues (or perhaps, infects) both the hero and his chief antagonist with time-bending powers. Chrono Triggers In the hands of hero Jack Joyce, this satisfying suite of superpowers work in tandem with more traditional cover-based shooter mechanics to take the bullet time of Remedys original Max Payne games to... Well, the max. Joyce can blink-teleport from one side of the room to the other, slowing down time long enough to blindside an enemy with a shotgun blast. He can momentarily suspend an enemy in a time bubble, unload a full submachine gun clip into it, and allow the bubble to burst so that two dozen headshots all arrive at once. He can create an impenetrable time shield, sprint past sniper fire like the Flash, and even charge up and hurl time bombs to scatter groups of enemies like shrieking dandelion spores. The downside to such a range is that half a dozen different cooldown timers on screen are easily mixed up during the heat of a battle. While its still grounded amidst the typical shooter tropes - every warehouse area seems to have taken a fresh delivery from Acme Explosive Barrel Company, for example - Quantum Break does facilitate some truly unique playgrounds for its time-stopping action to unfold in. Frequent stutters in time create eye-popping dioramas out of the destruction around you. Dispatched enemies cartwheel back from bullet impacts and freeze in midair, the bloodspray from their exit wounds crystallizing in the air like icicles of claret. Out-of-control cars become trapped in an infinite instant replay as they crash, rewind, and crash again. Innocent bystanders are caught in a state of suspended animation, their morning coffee spilling into a frozen arc in front of their stunned faces. Its a unique and wonderfully eerie environment to inhabit - like wandering around inside a 3D screenshot - and certainly a stylish space in which to live out your every violent, Wachowski-inspired whim. Enemy henchman one minute, exotic art installation the next. The only problem is that Jack goes from unassuming everyman to heat-packing superhero in the space of the first few hours, and his relatively rapid ascent to gun-toting Time Lord is to Quantum Breaks slight detriment as a whole. Since it seems to be in such a rush to give you all these neat powers up front, it leaves nothing new in reserve for the entire second half, which means the initial freshness of these frozen-in-time firefights starts to feel somewhat stale long before you reach the conclusion after 10 hours. Some measures are taken to spice things up along the way, such as the introduction of enemies that can teleport like Joyce, and of course the obligatory tank-like troops who turn up to soak up an obnoxiously above-average amount of bullets, but for the most part your tactics remain the same right up to and including the final confrontation. While there is a superficial upgrade system that incrementally improves Joyces existing powers, I wish the introduction of the powers themselves had been spread out over Quantum Breaks duration to offer a more gradual sense of character progression. Failing that, its a shame there arent more interesting new ways to use his powers in the later levels in order to evolve the action a bit more in the second half. As it is, its a case of too much too soon, and it eventually becomes a touch repetitive. Split Decisions What kept me playing despite the waning combat novelty was the strength of Quantum Breaks story, and the method by which its told. Tales of time travel are inherently paradoxical, but Quantum Breaks spin on the idea serves up some meaty twists and turns without ever becoming convoluted. Part of that is due to the way that at the end of each gameplay act a juncture occurs, wherein youre temporarily given control of the villain, Paul Serene. Serene has the ability to foresee the consequences of his actions, and thus youre given a choice between two outcomes that will directly impact the subsequent episode of the live-action series, and have later in-game ramifications. These choices are never black and white, and adding to their complexity is the fact you have to weigh up how theyll impact both Quantum Breaks heroes, and villains. For example, after the initial accident at the university youre given the choice of creating a smear campaign to make Joyce look like a terrorist in the media, or alternatively slaughtering the students protesting the closure of the campus library and making the public fear Serenes Monarch corporation. 12", "date": "April 1, 2016,"}