{"name": "Oculus Rift", "name_review": "Oculus Rift Review", "ref": "https://me.ign.com/en/oculus-rift/117600/review/oculus-rift-review", "text": "Virtual reality technology is literally a game changer. For the first time since 3D graphics came around 20 years ago, it radically changes the way we play games and opens the door to new experiences that until now wouldve been impossible. The Oculus Rift is the first headset available, and it does a fantastic job of not just displaying high-quality VR, but making it easy to use. Its tough to relate the experiences the Rift can give you with words and two-dimensional video and images, because this is unlike anything most people have ever seen. To give you an idea of how powerful it is to fully immerse yourself in a virtual world: it can not only make you forget where you really are, but fool your brain into thinking youre moving (or falling) when youre actually sitting still, creating a real sensation you can feel in your stomach. Its hard to believe this technology exists  and that it works  but it does. It is, in a word, amazing. Its also pricy. At $600, on top of requiring a fairly powerful PC, the Rift is very much a fancy toy for enthusiast early adopters. But unlike most first-generation consumer technology, what you get here is surprisingly polished and easy to use. All you need to do is install the software from www.oculus.com/setup, plug the headset into a USB 3.0 port and an HDMI port, plug the sleek-looking camera sensor into a second USB 3.0 port and point it at where you intend to sit or stand, and then plug the included Xbox One wireless controller dongle into any USB 2.0 or 3.0 port. I was up and running in minutes, and had no issues making the software or hardware work as intended. The Rift headset itself is light, weighing just over a pound. That weight doesnt include slight addition of the single, four-meter (13.2-foot) cord the width of an Ethernet cable; that cable contains both HDMI and USB connectors, and splits near the end so you can plug them both into your PC. The weight of the headset is comfortably distributed by the straps that secure it to your head, and thanks to soft padding where it makes contact with your face (which is replaceable, but only one comes in the box) it feels like wearing some nice but slightly heavy ski goggles. Despite its light weight, its textured matte plastic housing doesnt look or feel cheap or flimsy, and it doesnt pick up fingerprints or smudges  which is nice on a device youll handle frequently. This has become known around the office as VR Face.Velcro straps on the top and sides allow you to adjust the fit easily, though as someone with a hard-to-find hat size (my head is almost 26 inches in circumference), I wouldve preferred if the maximum extended size of the side straps were just a little bigger. Like ski goggles, the Rift can leave an impression on your face if you wear it for more than a short while and have it tight enough to not wobble out of focus as you move your head. This has become known around the office as VR Face, and its something you need to be conscious of: you may not want to jump into VR before going out on the town or posing for your yearbook photo. This is not a room-scale VR system.The sleek black IR sensor camera that tracks your head movements with astonishing accuracy sits on a built-in stand that suspends it 10 inches above your desk, and you can tilt it up or down to cover whatever area you need. Its a very understated look, which I appreciate - this device shouldnt attract attention as it sits discreetly next to your monitor, or even on a shelf near your PC. Also, Ive found it to be fairly generous in the area it tracks, extending beyond what the setup software leads you to believe. It has its limits, of course  this is not a room-scale VR system, so youre expected to use it while seated or standing without walking more than a step in any direction. When you put the Rift on it forms a tight seal around your eyes, blocking out everything except a little bit of room around your nose through which you can look down. Ive found that sliver of light easy to ignore during games (I usually dont notice it until I look for it) and also useful when I want to look down to find a controller or keyboard, or take a sip from a drink without taking the headset off. When you do take it off, a handy proximity sensor on the inside detects that its been removed and turns the headset off and pauses your game (if it can be paused). Putting it back on automatically reactivates the headset, smartly managing the lifespan of the OLED screens without ever interfering with use. When it's set up correctly, the image is strikingly clear.A slider switch on the underside of the headset allows you to adjust the distance between the eyepiece lenses to match the distance between your eyes, known as interpupillary distance or IPD. When its set up right, the image is strikingly clear; with two 1080x1200 screens (one for each eye) and a combined resolution of 2160x1200, you get a high level of detail and clearly readable text. Because the screen is literally next to your face you can definitely see the pixels, especially in brightly lit environments, but the moment things start moving around they become much less noticeable. The Rifts viewing angle is stated as 110 degrees, which is substantial, but again resembles ski or snorkeling goggles in the way it limits your peripheral vision. When using hardware that meets or exceeds the recommended specs, the 90-frames-per-second refresh rate is, as promised, extremely smooth, and latency as you move your head is non-existent. (I have experienced a few games that eventually became choppy as I played, but restarting them fixed it.) The only noticeable artifacting is a light-streak effect that happens when Im in a black environment with bright-white text, as is often seen during title screens and startup sequence. I suspect this has more to do with the way the light hits the lenses than the Rifts software. The integrated headphones effectively block out external sound.The integrated 3D audio earphones sound great, and easily swivel and move to fit over your ear. They effectively block out external sound, so its handy to be able to easily lift the earpiece off one ear to hear whats going on in the real world. Theyre removable too, if you prefer your own high-end headphones, though thatd mean running another cable to your PC. Theres also an integrated microphone, which means you dont need to have a separate headset on top of the Rift to use in-game voice communication. The Rift also includes a simple remote control device, and it, too feels sturdy and well built. It doesnt do anything the Xbox One controller cant, but this is less for gaming and more of a one-handed, always-on control for watching video in a virtual theater, or other more passive experiences that dont require any precise input. Finally, the Xbox One controller that comes included with every Rift is the revised version that includes the standard headphone jack. This is currently the standard input device for all games sold in the Oculus store, but theres no reason you couldnt use an alternative controller if you prefer. The one area where the Rifts hardware is disappointing right now is the lack of hand-tracking motion controllers. Because were playing games with the Xbox One controller, the ways in which we can interact with these virtual worlds is limited to mostly the same methods we use for conventional games. That means nearly everything on the Oculus right now could be played elsewhere, from a different perspective, and that keeps VRs potential for truly unique games from really taking flight. Oculus says the Oculus Touch controllers will be out sometime later this year, but considering the competing HTC Vive launches on April 5 with its controllers included for $800 (as well as the promise of room-scale VR experiences), thats a temporary but significant disadvantage for the Rift. Software If this is to be my VR home, I'd like to feel more at home there.The first thing youll see when you put on the Rift is the Oculus Home menu screen, which oddly enough places you in a strangely decorated ultra-modern luxury apartment. Art and sculptures (and a large model robot) adorn the walls. Its a surreal combination of high and low detail  while the carpet youre sitting on and the pillows next to you are finely textured, the fire in the suspended fireplace looks like something out of Minecraft, and if you look up past the low-polygon pink trees, youll see other similar apartments floating in the sky. Also there is a shallow moat filled with water running around where youre sitting, for some reason. Deliberate steps have been taken to make this place feel lived in, such as a rumbled carpet and a blanket strewn over a couch almost as if someone had been sleeping there. Im not sure why Oculus bothered with this setting instead of something a little more universally appealing, or better yet something more customizable and interactive. If its to be my VR home, Id like to feel more at home there  as it is I feel like Im house-sitting in someone elses place. What were here for  the floating menu that hovers next to the suspended fireplace  behaves a lot like the main menu for the Xbox One. Its not revolutionary, and doesnt do anything that could only happen in VR, but its familiarity meant I was able to easily find whatever I was looking for. A column of four items on the left shows your most recently run programs; the middle shows five featured items you own, and the right shows your social feed and friend status. The central items can be scrolled to reveal more pages of content. However, unlike the Xbox Ones menu, theres currently no way to pin a favorite item to the front page. The Oculus store page, accessed from a button at the bottom of the screen, is more of the same, with the left column displaying a variety of sorting options for games, entertainment, applications, concepts, and early access content. Strangely, though theres a media tab in every entry that will show you screenshots of the game or application youre considering purchasing, there is no video player to be found in these store pages. That seems like a big oversight. The interface can be navigated either using the d-pad on the Xbox controller or the remote, or by simply looking at something and pressing a button on a controller to select. That method is faster and much more natural than a d-pad - why scroll through options when the system already knows exactly what youre looking at? To install a game, you're prompted to remove the headset.My only major gripes with Oculus Home are regarding the game installation process. You can buy a game and download it from inside VR, but to install it youre prompted to remove the headset just to click one button on the Oculus desktop client, seemingly for no reason. If I have to take off the headset in order to get something ready to play, why even have the store in a VR environment at all? You can browse the store just as well from there (better, even, since it does have preview videos) without having to go back and forth between interfaces. Also, right now you can only install games bought from the Oculus store on the C drive  Oculus says that issue should be resolved within weeks, but for now people (like myself) who use an SSD as their Windows drive will need to be careful about installing large games like Project CARS or Elite: Dangerous. And what about the games catalogue? The quality of the items in the store vary widely, from the jaw-dropping space dogfights of EVE: Valkyrie, to ports of existing games like Defense Grid 2 and Project CARS, all the way down to disappointingly simple games designed for Samsungs phone-based GearVR system, such as the bland zombie-dodging game Into the Dead. you can look up through your fighter's canopy and maintain visual contact with your targetIts the games that simulate sitting in a cockpit and manipulating controls that stand out as the most successful at immersion and offering new experiences, even though the concepts themselves arent new. EVE: Valkyrie, Elite Dangerous, and Project CARS all give you a heightened sense of situational awareness; where on conventional gaming screens youre effectively looking through a tiny window into the virtual world, in the Rift its all around you. When a fighter screams past you or pulls out of your field of view in a dogfight, its not just a blip on the radar - you can look up through your fighters canopy and maintain visual contact with your target, and that makes a huge difference. With a few exceptions, most of the other games would be unremarkable or even kinda lame if you played them on a conventional gaming system. Even the relatively high-profile Oculus exclusive Luckys Tale (which is free with every headset) seems to have few original ideas to contribute to the 3D platformer genre as it moves to this new medium - its all about double-jumping and butt-stomping through a colorful cartoon world, and the new VR perspective does little to change that. However, the novelty of experiencing a game like this in VR alone makes it vastly more interesting than it otherwise would be. Seeing a cartoon fox  or in the case of Defense Grid 2 and AirMech, aliens and robots  appear to run around in front of me like toys come to life is something Id never seen before. But having tried touch controllers in demos, all I really want to do is reach out and touch them with my hand, and I cant do that here. Also, make sure to check out my VR-focused review of the spacesuit simulator, Adr1ft. Speaking of Adr1ft, its important to note that buying the VR version of a game does not necessarily give you access to the traditional desktop version, or vice versa. Make sure to check before you buy. The other aspect of the Rift is the non-gaming side, where you can passively consume entertainment. The most notable are story-based experiences like the impressive Iron Giant-esque Lost. Theyre dynamically rendered as a game would be, but you cant move or interact with anything as the short story unfolds in front of you. We also get the ability to view full 360-degree video and photos, and the ability to watch video from Facebook, Twitch, Vevo, or your hard drive in a virtual movie theater with a big screen. This is functionality that has already existed on the GearVR for some time, but the improved resolution on the Rift makes watching video a better experience. Its still nowhere near 1080p quality, since many of the pixels on the screen are used to render the area around the movie instead of the movie itself, but totally watchable. All of this is available through the Oculus store, but the Rift isnt limited exclusively to that stores contents. The options menu contains a setting for allowing unknown apps obtained from outside the Oculus ecosystem to run on your Rift. Its off by default, however, and as of now, the Rift is not recognized by Steams VR mode. It will take some time for outside applications to update to be compatible with the final version of the Rift (as opposed to the Development Kit 2 version). Pros Fantastic VRLight and comfortableEasy setupNew experiences Cons No motion controls After spending many hours in virtual reality, I believe the launch of the Oculus Rift is the start of a new era. The first time you put it on is the closest thing to real magic youre likely to experience anytime soon. Its true that VR has a lot of maturing to do, but this amazing headset is a front-row seat to watch gaming history being made. Its current lack of motion controllers means these enticing experiences are mostly look, dont touch, but even though it cant live up to its full potential quite yet, the ability to so easily immerse ourselves in a game world or other virtual environment is worth every penny.", "date": "March 31, 2016"}