{"name": "Tom Clancy's The Division", "name_review": "Tom Clancy's The Division Review", "ref": "https://me.ign.com/en/tom-clancys-the-division/117048/review/tom-clancys-the-division-review", "text": "Its not too hard to find nice things to say about Tom Clancys The Division, especially as it unfurls in its strong opening hours: its open-world version of Manhattan is both gorgeous and authentic, its cover-based third-person combat is sound, and its RPG elements run surprisingly deep. And yet, next to every good thing The Division does, there hangs a big, ugly asterisk. That same open world is barren and unengaging, combat gets bogged down with samey waves of walking bullet sponges, and character progression is awkwardly fractured in inconvenient ways. Outside of the tension of the PvPvE Dark Zone, theres little that makes this virtual Manhattan feel alive or dangerous. Visually, The Division leans heavily but very effectively on the all-too-familiar iconography of post-biological-disaster Manhattan. Coming out of an early security checkpoint, daylight blinded me until my eyes adjusted, and then I saw it: an improvised memorial to those who had given their lives trying to take Manhattan back from the chaos that's swallowed it in the wake of an unprecedented terror attack. Ive spent time in the real New York City, and in fact my father was in Manhattan on 9/11. I've seen memorials like this, littered with the helmets of fallen firefighters and hastily scrawled children's drawings with ~thank you~ writ large across the top. It is, perhaps, a cheap way to get me emotionally invested in the conflict that drives the fragmented story forward, but it worked  at least for a time. From the quaint Christmas lights in Chelsea to the ominously unlit Times Square, The Division is full of evocative visual moments. It never follows up on them in any substantive way, but they do manage to make the city itself the most interesting character in the cast. Winter Wasteland But as full as the world is of eerily beautiful sights to see, it is equally devoid of worthwhile things to do. Imagine an open-world game with hardly any dynamic elements, or worse, a long-dead MMO where you and a handful of party members (should you invite folks along for some co-op) are the only people left on your server. Thats a solid approximation of how engaging of a play-space The Divisions Manhattan is. Enemy encounters are spread thin across the city like too little butter over too much bread, creating long stretches of eventless walking where very little happens. Ive walked for minutes at a time without more than one or two small packs of easily dispatched thugs to entertain me. That would matter a lot less if there was more going on around me, but for a city of eight million thats supposedly just been mortally wounded by a terror attack and subsequently overrun by multiple gangs of militarized fanatics, the streets are suffocatingly calm. Thats mostly owing to the fact that there are virtually no random events; just illusions of them. That detachment of peacekeeping troops getting into it with a gang of looters a block over sound like they're engaging in an impromptu skirmish, but it's all a scripted show for your benefit. Once you help them end it, they'll be on indefinite leave. Though some other IGN editors say theyve seen gangs dynamically fighting in the world, in more than 50 hours played, I never did. Whats more, these pre-set, one-and-done missions are all minor variations of one of a few simple missions types, and once youve done all of them in a zone, theres no material reason to come back to that location besides some inconsequential collectibles that I quickly gave up on grabbing, even when they were only steps out of my way. All of this comes together with Manhattans grid-like structure to make the act of exploration tedious when it should be exciting. A good open world teases you off the path from A to B with the promise of discovery and emergent shenanigans; all I really got from The Division was a breadcrumb trail to follow through a series of 90-degree turns with some conveniently placed people to shoot at the end. I Fire a Gun To its credit, shooting those unfortunate looters and mercenaries does feel pretty good, if a bit standard. The gunplay model is a few steps toward the technical realism of most Tom Clancy-branded games from the run-and-gun action of Gears of War, but not many. Things like muzzle travel and bullet spread play a big enough role that guns feel distinct from one another. The M4, for instance, is the reliable mid-range stopgap youd expect it to be, while the 7.62mm-spitting AK-47 starts bucking like a mule by the time the second or third round has left the muzzle. One is better for sustained fire; the other is best fired in short bursts to inflict maximum damage in a short span before ducking back behind cover. And cover is important, as is covering fire, since enemies can actually be properly suppressed by firing at them when theyre behind cover. Should you bring along a friend or three, this makes co-op tactics particularly rewarding, especially when one of your squadmates suppresses a deadly enemy sniper while you flank around and lace into them. However, the bullet-sponginess of the enemies, and their tendency to shrug off torrents of small arms fire without so much as flinching does rob the shooting of the tactile power that should come with unloading a street sweeper into some poor fools chest at point-blank. This exemplifies a larger set of problems that plague The Division: the clash between its grounded, realistic look and the conventions of RPG gameplay. Years of virtual experience in other shooters have taught me that a Saiga-12 will send a person tumbling to the ground in one, maybe two shots, but here, that same gun might take a full clip to get the job done. Getting a Saiga-12 with better stats will obviously make them go down faster, but the problem is that good progression systems need more powerful motivation than just bigger numbers. The long-term gear game in most great RPGs relies on, among other things, a sort of lustful visual progression that makes you eager to see how the next drop will change the look of your character. But the only difference between the level 5 SCAR I used at the start of my journey and the level 28 version I ended it with were the size of the numbers that popped out of my enemys head. Weapons, enemy types, and even the gorgeous city itself all fell prey to this fatigue over the nearly 60 hours I played. The promise of the spectacular, of things you havent yet seen - these joys are rarely found in The Divisions combat, or in any other facet for that matter. By the end, its all one blur of masked men, Kalashnikovs, and smoking urban ruin. Still, the mere fact that the action leans so heavily on sharp aim and smart tactics makes it rewarding when the last leathery-tough foe in a pack finally goes down. That goes double for the main story missions, which throw you headlong into some seriously heated firefights. Here, the action is concentrated and highly demanding. Particularly with a squad of four using complementary skill loadouts, these sections are the highlights of The Division. Hunkering down behind a teammates deployed piece of cover with bullets whizzing overhead while one of my sentry turrets suppresses and stuns groups of enemies for another squadmate to light up with an incendiary seeker mine is a thrill. The promise of these kinds of moments ends up becoming the main reason to persevere through the banalities of The Divisions open world. Thankfully, you can easily matchmake and fast travel directly to these gems - a welcome convenience that allows you to bypass parts of the open-world slog. Not for long though. Youll rarely come out of one mission with the gear, skills, and level to be successful in the next, so its back out onto those empty streets again to progress your character. The RPG elements in The Division are more interesting than I expected, but like everything else, they too have their problems. 12", "date": "March 17, 2016"}