{"name": "Supergirl: Falling", "name_review": "Supergirl: \"Falling\" Review", "ref": "https://me.ign.com/en/falling/117003/review/supergirl-falling-review", "text": "Warning: Full spoilers for the episode below. Given how tragic, unfair, and frustrating Supergirls life has been, its a wonder she has turned out to be so inspiringly kind, honest, and genuine. That all changes in this weeks Falling where we see Kara fall to the dark side thanks to some red Kryptonite. While her turning evil for an episode thanks to a gimmick might not sound that compelling, it actually made for one of the best episodes of the series so far. At first, Karas newfound wickedness is played for laughs. She forgoes her usual comfy work sweaters for a skintight number that turns heads, and she one-ups Assistant Number One Siobhan Smythe in satisfying fashion, sending her down her villains path. She even uses Cat Grants private elevator (the nerve!). As Supergirl, she takes down a burly KHund with excessive force, and after verbally berating him while crushing his neck with her boot, she decides to let him go. Melissa Benoist thrives in this change of heart, abandoning her kind warmth for an icy demeanor equipped with sharp verbal barbs. But, as youd expect, she quickly turns her aggression on her friends and family, so the laughs come to an abrupt hault. It wasnt too long ago that we saw Kara unleash her rage during Red Faced in one of the shows most emotionally powerful moments, and now shes tapping back into her anger. As cruel as her insults and tirades become, theres still a layer of truth, so its especially painful to watch Alex brought to tears as her little sister hits her where it hurts. After switching into a more militaristic costume reminiscent of something Nons crew would wear, things take a turn for the worse. In the episodes most jaw-dropping moment, Supergirl chucks Cat off a building. Its not jaw-dropping because we thought Supergirl wouldnt catch her (as Winn assumes, earning a chuckle in a tense scene), but for how damaging we knew those actions would be. The relationship between Supergirl/Cat (and Kara/Cat) has been the backbone of this show, so once this line was crossed, real consequences started to hit. It was a powerful demonstration of journalistic responsibility when Cat denounced Supergirl and labeled her a villain, despite being her premiere cheerleader. A couple episodes ago, James also had to test his resolve as a journalist, even in the face of Supergirl, so its nice that the show reinforces that these characters are reporters with a responsibility to uphold to the public. This all escalates to the DEO firing on Supergirl in an attempt to take her down. While ordinary police might not know better, shouldnt the DEO know that shooting her is just a waste of bullets? Its befuddling how they sent a task force to specifically take down Supergirl and no one thought to bring any of the Kryptonite needles, restraints, daggers or swords they always seem to have on-hand. Speaking of Kryptonite, Maxwell Lords re-incarceration and explanation of the red K was the one awkward hiccup in an otherwise superbly executed episode. It was just too much for the show to toss him back in a cell, try to explain everything, blame it on Max, come to an understanding, re-release him, and then re-focus on taking down evil Supergirl all in such a short period of time. However, this can be forgiven for the excellent drama that ensues. The showmakers get props for providing true costs for Supergirl losing control. Even though it wasnt her fault, she now has the city turned against her (along with her number one cosplaying fan) and, in an ironic twist, Jonn Jonzz is locked up in the DEO. Seeing the Martian Manhunter reveal himself to battle an evil Supergirl was a sight to behold, giving me comic book chills all over my nerd body, and it was punctuated by Jonns bold choice to surrender himself. While I was caught up in the drama of the moment, in hindsight, it doesnt quite make sense why Jonn surrendering instead of fleeing helps protect Alex and Kara -- maybe he wants to stay near them at all times, even if its in a prison? -- but despite that fuzzy logic, the consequences are clear and they set up some big changes at the DEO and in Supergirls life. Pros Dark SupergirlSense of humor and dramaBig consequences Cons Maxwell Lord's exposition prison What could have been a gimmicky one-off episode is instead one of the series best. The red Kryptonite brought out the wickedness in Supergirl and the acting chops in Melissa Benoist, allowing for a few humorous moments that gave way to some huge dramatic scenes that will have a profound impact on the show going forward. Yes, there were a couple things that didnt work that well -- Maxwell Lords exposition dump, not using green Kryptonite on Supergirl -- but they can be forgiven thanks to the excellent emotional impact caused by that red rock.", "date": "March 16, 2016"}