{"name": "Warhammer 40,000: Chaos Gate -- Daemonhunters", "name_review": "Warhammer 40K: Chaos Gate - Daemonhunters Review", "ref": "https://me.ign.com/en/warhammer-40000-chaos-gate-daemonhunters/197461/review/warhammer-40k-chaos-gate-daemonhunters-review", "text": "Proudly continuing the tradition of every Warhammer game needing to have at least three titles, Warhammer 40,000: Chaos Gate: Daemonhunters is more than just XCOM with space marines. It's an often unforgiving and deceptively deep crusade against the disgusting minions of Nurgle with an ever-evolving strategic map and intense turn-based tactical battles. There are certainly times when it crosses the line from satisfying challenge into pure frustration, with excessive use of reinforcement swarms and some pretty wicked built-in failure spirals. But you know what they say about the grim darkness of the 41st Millennium.We've seen so many 40K games in the last decade that the announcement of a new one can make me roll my eyes, even as a long-time fan of the setting. But I was pleased to discover that Daemonhunters is probably one of the best since 2009's Dawn of War II. This expansive action-horror epic is centered on the Grey Knights, a uniquely deadly chapter of Space Marines who are recruited exclusively from those with psychic abilities. And I can tell the devs did their homework, because even the basics of the combat system are built around what makes these dudes special.Every Knight has a willpower pool that can be spent on useful psychic abilities like improved weapon damage or healing their comrades. But using them comes with an extra cost because it also builds up a Warp meter, since psychics in 40K tend to attract the attention of daemons from the Immaterium. This creates weighty turn-to-turn decisions that go beyond simply rationing out your ammo and magic points, since filling the meter could spawn in additional enemy reinforcements or result in your whole team contracting a hellish plague. Sometimes it's better to rely on good ol' lead and steel rather than cut loose with Jedi mind tricks and risk the perils of the warp.Sometimes it's better to rely on good ol' lead and steel rather than cut loose with Jedi mind tricks.I was almost constantly impressed by how many different, interesting ways there were to construct a turn with my Knights' fairly simple tools. One major difference from XCOM is that there is no die roll to hit. If it's within line of sight and your weapon's range, you can bring the pain. Distance and cover simply reduce the damage from ranged attacks, and a helpful overlay in the UI shows you exactly how much damage you could do to each enemy from a given spot before you lock in your move. There is some rewarding randomness with things like critical hits, but usually your well-thought-out plan isn't going to be derailed because someone missed a 95 percent shot from point-blank range.This feeling of full tactical control is further enhanced as your Knights level up and you unlock new abilities that can be combined with deadly synergy. Most enemies also have a stun bar which, once filled, allows them to be executed with a brutal melee strike, and like in Gears Tactics, pulling that off grants your whole squad an extra action point. All of this encouraged me to think about every possible outcome of every turn and orchestrate the destruction of my enemies like I was composing lethal sonata. And it's oh-so-satisfying to turn a desperate situation into a one-sided slaughter through careful order of operations.It's oh-so-satisfying to turn a desperate situation into a one-sided slaughter.However, it can get very frustrating when Daemonhunters' favorite trick seems to be spawning 50 enemy reinforcements right on top of you in the middle of an already pitched battle. That's an exaggeration, but not by much. There were so many missions where my ability to multitask was already being tested and suddenly  by the Emperor's shriveled balls, there are MORE of them? At least in normal missions there is a finite pool of reinforcements that can spawn. But in the titular Chaos Gate missions, which were definitely my least favorite, they're actually infinite. And when I couldn't even keep pace with the number of new horrors spawning in, my consumables spent and willpower reserves long run dry, I felt like my cleverness and tenacity just didn't matter. I was simply being pushed into the mud and kicked repeatedly.Make no mistake: Daemonhunters is an absolutely brutal game. I toughed it out on Normal despite having to restart twice  one time after I was already over a third of the way through the 50-plus hour story  but I wouldn't blame anyone for wanting to drop down to Easy, at least until you have a strong mastery of the systems. There are sneaky failure spirals built in that could result in you struggling to keep the crusade going for dozens of hours before truly being confronted with the futility, particularly if you don't do well in the first several missions. The very beginning, when you have only four Knights, a badly damaged ship, and limited tools, is the most dangerous and difficult part  and that felt off to me from a balance standpoint. The curve starts off at its highest before gradually gliding down and leveling off as your roster expands, your vessel is repaired, and you gain more powerful gear that improves your survivability.There are a lot of moving parts to keep track of, but they are wisely introduced at a gradual pace.It's not just the planetbound threats that kept me on my silver-clad toes. The ever-evolving campaign map tracks your progress in dealing with the deadly plague known as The Bloom, which you must research and defeat before it gradually overruns the sector. There are a lot of moving parts to keep track of, but they are wisely introduced at a gradual pace as the story unfolds. At the beginning, you only have one strain of plague to keep track of. By the end, there are as many as five strains, warp storms that risk damage to the ship when crossed, enemy vessels that can engage you in dialogue box-based combat, and cultists trying to open chaos gates that must be shut down. If they open five before you can stop Nurgle's machinations, it's game over. All these moving parts work well in tandem and force you to make difficult decisions at every turn.The story itself is thrilling, detailed, and sprinkled with some sudden twists that hit right when I felt like I had gotten too comfortable with my routine. The main cast aboard the Baleful Edict are memorable, interesting, and play off of one another's clashing personalities to great effect. The voice acting is also great, especially Robyn Addison's Inquisitor Vakir. Many game studios have tried to capture the essence of Warhammer 40K over the years, and few have done it as well as Complex Games has here.It looks great too, from the customizable knights to the moody battle maps. At least, usually. There are still some distracting but entertaining bugs. I'm not a daemonologist, but I don't think Great Unclean Ones are supposed to have see-through torsos. Plaguebearers usually don't wiggle up into the sky, take one step, then shimmy back down through thin air to get around obstacles either. In a rare but annoying case, even some shots that the UI told me were valid would end up getting blocked by a terrain feature and doing no damage. Technically speaking, there are still some rough edges to polish out.The sound design is also mostly excellent, from the deliberately overwrought combat barks of the Grey Knights, to the satisfying zap of a psychic smite, to the glorious explosion of a fuel silo. Unfortunately, while the soundtrack is appropriately bombastic and foreboding, Daemonhunters doesn't make much use of dynamic music.This leads to some of its most dramatic moments being undercut because it's just the same backing track you've been listening to for hours looping underneath something that deserved to be punctuated by its own instrumental flair. Most of the time I spent with Warhammer 40,000: Chaos Gate: Daemonhunters, I was having a literal blast plotting how to turn the tide of a seemingly impossible battle with my trusty squad of veteran, psychic space paladins by chaining together just the right moves in just the right order. On the other hand, there were moments when it stacked the odds so high by trying to cram more enemies onto the screen that I felt absolutely exasperated, and wished it came up with more clever and less annoying ways to challenge me instead. But that complex, sometimes too-punishing campaign is supercharged by endearingly over-the-top, gothic bridge officers and a story that never runs out of new wrenches to throw into your plans. It's one of the best XCOM-likes out there. And if there were a hall of fame for 40K games that really understood the setting and did something thematically appropriate and exciting with it, Daemonhunters would certainly belong there.", "date": "May 10, 2022,"}