{"name": "Better Call Saul: Gloves Off", "name_review": "Better Call Saul: \"Gloves Off\" Review", "ref": "https://me.ign.com/en/gloves-off-better-call-saul-1/116685/review/better-call-saul-gloves-off-review", "text": "Full spoilers for Better Call Saul continue below. ~Why?~ That's the question both Nacho (Michael Mando) and the audience are left with at the end of Better Call Saul's excellent fourth episode of Season 2, ~Gloves Off.~ Why did Mike (Jonathan Banks) not just take the easy route and kill Tuco (Raymond Cruz)? Why didn't he want to pull the trigger on a known criminal? Bob Odenkirk as Jimmy McGill in Better Call Saul There are plenty of possible answers we can infer. Maybe he knew there was a more effective way to circumvent Tuco without potentially getting himself in trouble. Maybe it's the fear his daughter-in-law has of nighttime gunshots, and his not wanting to inflict that on another family. Maybe he just didn't feel like killing that day, and the next day he'll get back into it. (For more insight, check out my interview with Mando about that final scene and Nacho's role in the season.) But that ~why?~ works for more than just that final question. It also ties into Jimmy's (Bob Odenkirk) struggle; why can't he help himself when it comes to breaking, or bending, the rules? That confrontation between him and Chuck (Michael McKean) -- although cathartic for the viewer -- got back to the core of their innate conflict: Jimmy circumvents the rules, and Chuck abides by them. Why can neither McGill get past that? Why does Chuck make himself sick by going into the office, and is it really just because he wants to see his younger brother fail? Why can't Jimmy resign himself to working within a team and following their rules? The show comes back to these questions again and again, and ~Gloves Off~ underlined that it's not just Jimmy's life who is being affected by his sometimes rash decision-making. Regardless of what Chuck did or didn't say to Howard (Patrick Fabian) about how Kim (Rhea Seehorn) should be reprimanded for her part in running the Davis & Main commercial, the blame in that situation came down solely on Jimmy's shoulders. Better Call Saul fans are predisposed to like Jimmy, both because he's cast as the troubled hero of this show and because Saul is so likable on Breaking Bad. Unlike Walter White's antihero journey, we know that we like Saul when we pick up with him down the road, but that doesn't make it any easier or less challenging to deal with the bad decisions Jimmy is making. Yes, he might have been right about the commercial being effective with potential clients, but he was wrong to go outside Davis & Main's rules. He was wrong to circumvent Cliff Main (Ed Begley Jr.). He was wrong to run the ad without approval. But he can't help himself, and it's hard to watch a character you like go down a path that ultimately hurts them in the end. And now he's late to work -- that should pick up in a not great place in next week's episode. It's also interesting how Kim drew a line in the sand between her and Jimmy. She says it's over between the two of them if he goes to Howard... so he goes to Chuck, instead. Technically Jimmy didn't break her rule, but he did bend it. Is she going go be OK with him interfering? The fact that her job is so important to her and (as she said) she needs it could be the line in the sand between her and Jimmy. As for the Mike storyline, it was rewarding to have him trick Tuco into an arrest, even if it did result in his face getting beaten to a pulp. Jonathan Banks is phenomenal in this role, and he can do an incredible amount with a quiet look. We get that in him visiting the arms dealer (who will probably come back at some point with that ~repeat business~ line), and him changing his mind. We get that again with his ~that all you got?~ comment to Tuco when he knows he's got him trapped. Mike's journey this season might not be as direct and clear as Jimmy's, but watching it unfold -- especially as Nacho grows to respect Mike as a businessman -- has been fascinating. Also, is Tuco really going to go away for five to 10 years? It'll be interesting to see how this lines up with Breaking Bad's story. That could be how Tuco met Skinny Pete before Breaking Bad. Added thought: what a gut-punch to hear Mike say, ~Killing your partner -- that's a bell you don't unring.~ If only Walt had heard that piece of advice... Pros Jimmy and Chuck face-offMike's takedown of TucoWonderful performance from Jonathan BanksUse of unanswered ~Why?~ Better Call Saul is a show with high stakes, even if they are personal ones. We see that with Jimmy's mistake impacting Kim, and Mike refraining from shooting Tuco. Writer Gordon Smith does a deft job conveying the impact of these decisions, all the way down to the hanging ~Why?~ at the end of the episode.", "date": "March 9, 2016,"}