{"name": "Arslan: The Warriors of Legend", "name_review": "Arslan: The Warriors of Legend Review", "ref": "https://me.ign.com/en/arslan-the-warriors-of-legend/116667/review/arslan-the-warriors-of-legend-review", "text": "If you are a someone who knows the The Heroic Legend of Arslan novel, or someone who has played the previous game, you would be pleased. Oh and if you are someone who has no clue about the story and just in for a hack and slash, you would still love Arslan The Warriors of Legend. Arslan The Warriors of Legend is based on Yoshiki Tanakas fantasy novel, The Heroic Legend of Arslan. It revolves around Arslan the kind 14-year-old Crown Prince of the Kingdom of Pars who forced to take the reins of his kingdom when a traitor gives the neighbouring Kingdom of Lusitania some key intelligence. This in turn leads to the fall of Arslans entire army, the arrest of the Shah or the King and the takeover of Pars. As Arslan, the player is given the task of unifying as many allies as possible to go against the Kingdom of Lusitania which mainly consists of religious zealots a General simply known as Silver Mask and reclaim Pars. I am not further revealing anything about the story, as it gets better and I dont want to spoil it for you guys. Other than just a really good story, (I mean, come on, it has a novel, manga and an anime), the game really shines on its gameplay mechanics. Players are put into huge battlefields where they can fight hordes of the enemy forces, either by mounting a horse, or going on foot to attack. All while racking up massive combos in the thousands. The player is open to different characters, each with their own attributes, for example, while playing as Arslan, you have a sword and a spear, both which deal reasonable amount of damage with balanced speed, but when you switch to Daryun, you have a stronger spear and a set of bow and arrows which deal much more ranged attacks. Each character is different to play with. While playing with Daryun, you can be faster and hit harder, because Daryun is one of the best fighters in the Kingdom, whereas Arslan is not that experienced yet. Each character also come with their own signature weapons, which range from swords and spears, to ukeles and a paintbrush (Im not kidding, there is a guy who attacks with a paintbrush). During fights, the camera angle can get a bit hard getting used to, which often resulted in me missing my most powerful finisher multiple times because I was aiming at a whole different direction. You are also given the option to use different skill cards for each character for different advantages. You can also combine different skill cards to make one super powerful skill card as well. However, if you are playing the game in easy, this is one concept you can completely overlook. Every now and then, a Blue Rush Zone appears in a battlefield. These Rush Zones can be used to activate Mardn Rush, which is a massive attack that rallies all the soldiers into one unit, and can be used to take out a large number of enemies as well as destroy barricades. The Mardn Rush has three different modes, each depending on the type of soldiers your rally. For example, the Cavalry can trample enemies and barricades, while the Infantry strikes the most amount of soldiers. Rally up archers and you can make a huge number of long range kills, as well as set certain objects on fire. Although the battlefield is full on fun to play on, it does have some flaws. For example, some of the generals or captains will have larger health bars and armour, but you cannot identify these enemies as they have a small text above their heads, which is not really visible among the large number of enemy soldiers that spawn on screen. Sometimes you get lucky and end up beating up one of the generals without knowing, or sometimes they can get you mid-combo and ruin a streak. However, due to the large number of enemy soldiers being spawned on screen, there are often some bugs or glitches here and there. For example, I played an entire level with a soldier stuck on Daryuns spear for some reason, who kept trying to walk. Talking about boss fights, apart from the fact that fighting a boss is pretty much the same as fighting any other character, the boss fights are not really much of a challenge, which is quite disappointing. By using cutscenes from the anime itself, the voice acting is on point. It also creates seamless transition from cutscene to actual gameplay, but once the gameplay begins, you realise that the in-game graphics can be a bit choppy. The in-game graphics use a cell shaded pattern to match the anime, but there are some moments where it gets choppy, which when compared to the cutscene itself is pretty bad. Apart from the story mode, the game also has an online mode and a free mode. In the Free mode, players can pick one of the previous battles and replay it with alternate character perspectives including the enemy forces. With the online mode, you can link up with another play for continuing the story in co-op, or do battles in the Free mode. Pros Fun fighting mechanicsGood StorySeamless Transition from cutscenes Cons Graphics can be choppy at timesBugs and GlitchesCan get repetitive Arslan The Warriors of Legend is a lot of fun to play. Although it takes a while to get into at the start, once I got the hang of the game, I found it hard to put it down. Sure it has some flaws here and there in terms of graphics and such, but the great story and general gameplay make up for it. For those who love the series in general, or the anime and the manga, this is certainly a great experience overall.", "date": "March 8, 2016,"}