{"name": "The Legend of Zelda: Twilight Princess HD", "name_review": "The Legend of Zelda: Twilight Princess HD Review", "ref": "https://me.ign.com/en/the-legend-of-zelda-twilight-princess-hd/116389/review/the-legend-of-zelda-twilight-princess-hd-review", "text": "When Im locked in an epic battle with Fyrus, a fiery boss that looks like a Balrog ripped out of Lord of the Rings, I can barely notice that The Legend of Zelda: Twilight Princess HD is a graphical update to a 10-year-old Gamecube game. This elegantly designed encounter takes place inside the Goron Mines, and you have to make smart use of arrows and the heft of Links metal boots to trip the creature up and put him away. Its a great fight; one of many emotional high points in the adventure. Twilight Princess HD doesn't always manage to look this slick, but when it does, its a great example of how a new coat of paint can bring back the magic of a classic Zelda game. The fact that Twilight Princess holds up 10 years later is a testament to its ambitious scale, its memorable set pieces, and of course, its finely-tuned dungeon puzzles. You have to get through a slow opening hour, but once the story kicks into gear youre tossed from the quaint activities of small-town life and thrust into a struggle to save Hyrule from the encroaching minions of the Twilight realm. Along the way youll meet interesting characters like Mayor Bo, the highest authority in Ordon Village, whose secret sumo wrestling training will help you enter the Goron Mines, or Midna, a sassy sidekick who hides her motivations for helping Link. The campaign jumps skillfully between the personal plights of these characters and exploring the devilishly clever dungeons for which Twilight Princess is so rightfully remembered. Twilight Princesss labyrinthine dungeons are some of the best in the series, and each requires creative usage of Links diverse set of items in order to best them. Whether youre manipulating statues to mimic your movements inside the pristine Temple of Time with the Dominion Rod or using double clawshots to cross deadly gaps inside the windy Sky Temple, the constant variety feels great. In series tradition, Twilight Princess develops a natural language over the course of the adventure that makes deciphering its item-based puzzles intuitive. But there is a catch: that same variety undermines its item sandbox, relegating a handful of its more unique items to one-and-done trials. Its a bummer to discover that items like the Spinner, Slingshot, or Ball and Chain dont have a lot of use after the first dungeon you find them in. While the dungeons themselves are a major highlight, its a shame that the overworld, and the towns that dot it, dont get the same attention; they feel empty by comparison. Though Twilight Princess presents one of the largest incarnations of Hyrule field in the series with nice, long draw distances, packs of enemies are spread out rather thinly across it, and I didnt find a ton of reasons to explore it outside of a handful of secrets. This was a problem for me when it was originally released in 2006, and its still a problem now. The same could be said about the bustling Hyrule Castle, a large space full of citizens, but few of them offer any appealing distractions from the main campaign. The Harsh Lens of Truth The most obvious change from the original version of Twilight Princess is the substantial graphical update. The HD version uses detailed, high-definition textures in an attempt to rejuvenate Nintendo's decade-old epic for a modern audience, but the results are mixed. While looking for keys in the underground Lakebed Temple or fighting off King Bublin and his minions in an impressive battle on horseback, the graphics looked quite nice, at least at first glance. Each area benefits in some way from the added detail, with textures that add the illusion of bump-mapping to give depth to formerly simple geometry. On closer inspection, though, this higher fidelity also reveals some distracting flaws, like the way the softer lighting engine doesnt produce natural shadows, leaving places like the mountains surrounding Kakariko village looking like they're missing something. Make no mistake, this version of Twilight Princess looks far better on modern televisions than the original one ever did, but half of the time I found myself distracted by all the filed down, shadowless surfaces while wishing Nintendo had gone the extra mile to make this port stand on par with the timeless look of Wind Wakers stunning HD facelift. Thankfully, improved controls and other additions help modernize this remaster in neat ways, from streamlining inventory management via the GamePad, which makes it easier to swap items in and out, to speeding up sluggishly paced sections of the campaign. The new Hero modes stiff challenge will give seasoned Zelda experts a much tougher game to play right from the start, too. Finally, Twilight Princess HD also uses amiibo as a way to customize your experience, so you can add tweaks like double enemy damage until the end of a play session or replenish hearts once a day. If you buy the Wolf Link amiibo, youll get access to the new Cave of Shadows. Its a tough-but-fair gauntlet of Twili enemies to fight, but I wish Nintendo had done a little more to make combat as Wolf Link more enjoyable. It just isnt as fluid or diverse as using Links advanced sword techniques, like the Helm Splitter, and that makes this optional add-on much less attractive. Pros Excellent dungeonsEpic storyImproved controlsAmiibo customization Cons Lackluster graphics The Legend of Zelda: Twilight Princess HD holds plenty of memorable moments thatve stood the test of time, and Nintendos high-definition update does a lot to modernize its look and feel. This cleaner, fresher presentation is still noticeably and disappointingly flat in some ways, but just past that are some of the best puzzles and dungeons to be found anywhere in the series.", "date": "March 2, 2016,"}