{"name": "Pillar of Eternity: The White March - Part II", "name_review": "Pillars of Eternity: The White March Part 2 Review", "ref": "https://me.ign.com/en/pillar-of-eternity-the-white-march-part-2/116140/review/pillars-of-eternity-the-white-march-part-2-review", "text": "As happy as I was to meet a new party member, I admit I frowned a bit when I met Maneha. She's a barbarian, and thus a member of the only playable combat class that wasn't already represented by a named NPC companion. Her appearance thus marks a filling of the blanks; a sign that Obsidian's long saga is rushing toward its end with The White March: Part II. The snowy wastes of the White March, too, once felt like a blank slate, but now they've proven host to a memorable struggle that leaves few questions unanswered. With this seemingly final expansion, such elements come together to cement Pillars' status as one of the most memorable RPGs in recent memory. High praise, you might say, from someone who wasn't exactly fawning over the expansion's first half (and my opinion on that hasn't changed). It's just that the second half does everything so much better. Set seemingly months in the future, it kicks off by chronicling the consequences of improved fortunes at the hamlet of Stalwart in the wake of the White Forge's relighting, and ends with actions and sacrifices that feel almost as momentous as those capping the events of Pillars of Eternity proper. Though a touch formulaic, this is the stuff of great fantasy: the awakening of a forgotten evil rumbling in the bowels of the earth and the emergence of an army that threatens to kick aside civilization like a beachside sandcastle. The New Faces of Evil It doesn't hurt that the main antagonists are fun to look at, sort of like half-metallic, half-fleshy Groots with hammers and spears standing in for hands. As imposing and heavy-hitting as these giants are, though, they're not the main challenge in combat here (nor, somewhat hilariously, is the towering final boss). That honor mainly goes to the monkish followers of the goddess Ondra, who rove about their cloisters in balanced flocks with powerful casters and dodgy acolytes who demand careful planning with every pull. And all that says nothing of the varied battles with foes like tentacles and angry flowers that fill in the spaces between. In contrast to its forebear, Part II is tightly paced (almost to the point of overlinearity), and it wisely minimizes visits to familiar areas in favor of exploring new ramshackle garrisons, menacing caverns, and gloomy temples built among the bones of a dead god. The enemies are creepier, and the lore more fascinating. I particularly enjoyed Maneha's brief personal quest, which takes the Watcher's motley comitatus into a gloomy abbey where she needs to offer tokens representing memories people would like to forget. Her voice acting tragically leans more toward ~academic advisor~ than ~coastal raider,~ but I nevertheless found her dark personal quest one of the more engaging ones Pillars has offered so far. A crop of endings tailored to your choices rounds out the expansion's final moments, granting meaning to your actions over the journeys roughly 10-hour runtime and the increased level cap to 16. The enemies are creepier, and the lore more fascinating. Happily, the journey needn't be as taxing as it was in the past. The release of Part II coincides with Pillars' latest general patch for the game proper, which brings numerous tweaks as well as a fun scenario in which you have to fight for your stronghold in the face of a local lord's violent objections. But more to the point, the update also introduces ~Story Time,~ a new difficulty setting that takes its cues from the Normal setting and, to use Obsidian's language, ~biases the math heavily in the players favor.~ It still presents challenge in spots, but it comes closer to being a true ~Easy~ mode than what Pillars had before. For players who just want to enjoy Pillars' rich tale and flip through the lore without mastering spellbook juggling, it's a godsend. Pillars until now has relied almost exclusively on vicious combat encounters requiring intense micromanagement to the point of tedium, and as my five deaths to the same merry band of no-name cultists attests, that's still true of the higher settings. The price of The White March: Part II's pacing is that the whole affair feels a bit short. I spent perhaps more time than I should have plodding through the expansion's first half, but I got through Part II in less than 10 hours. It left me hungry for more. Virtually everything here neatly serves the purposes of the overall narrative, which means there's little cause for exploration or, indeed, even the opportunity. But taken as a whole, it's ultimately worth it, and if this is your first time to Pillars club, you should do the smart thing and buy the two parts together rather than separately. As with so many predicaments in high fantasy, it gets better. Pros Focused, engaging questlineMemorable new settingsVaried combat encounters Cons Somewhat linearFeels short The White March: Part II expansion for Pillars of Eternity boasts better pacing and lore than its humdrum predecessor, but at the cost of a running time that feels somewhat inadequate. A welcome new Story Time mode helps dull the force of the brutal combat though, and memorable settings and enemies make this an expansion to savor.", "date": "Feb. 24, 2016,"}