{"name": "Far Cry Primal", "name_review": "Far Cry Primal Review", "ref": "https://me.ign.com/en/far-cry-primal/116049/review/far-cry-primal-review", "text": "Its hard to imagine any other modern first-person shooter series being able to make a 12,000 year trip back in time and arrive there with its identity still intact, but Far Cry Primal has made it work. The series now familiar one-man-versus-a-savage-frontier shtick has survived the transition admirably and Primal remains packed with many of the same great gameplay loops that have come to define the franchise, just with a primitive twist. Primals prehistoric, low-tech version of the Far Cry experience feels surprisingly authentic thanks to the games completely bespoke language (the simple dialogue is conveyed entirely with subtitles), its large, convincing environment, and its great character design. Its overflowing with brutal and satisfying close-quarters combat, and the new ability to tame wild beasts also adds a welcome additional layer of tactical choice to assaults on the enemy. Its undermined, however, by a startlingly basic plot, some disappointingly uncharismatic villains, and often bland mission objectives. The result is a lengthy and competent game with plenty to discover and conquer, but one that unfortunately contains far fewer memorable moments than its forebears. Far Cry Primals 10,000 BCE Stone Age setting takes us back into human prehistory, casting us as a hunter called Takkar, who's part of a fractured tribe known as the Wenja. We also know he has a beard because, well, you can see it in his little icon on the in-game map screen. Unfortunately, thats more or less all we ever learn about Takkar and, as such, he isnt an especially engaging or interesting protagonist. Of course, one of Far Crys real fortes is its ability (particularly in more recent instalments) to make up for its ho-hum leads with some truly scene-stealing antagonists, like Far Cry 4s sadistic Pagan Min or, better still, Far Cry 3s frighteningly unpredictable Vaas. Regrettably Primal falls flat here too; neither of Primals main villains are a patch on a character like Vaas. A considerable letdown for a series thats carved out a reputation for fascinating and nuanced bad guys. When Three Tribes Go to War Takkar's goal is to help establish the Wenja as the dominant tribe in the games large world, Oros, which is a mixture of rolling plains, lush forests, and inhospitable ice. To achieve victory over two separate enemy tribes (the Udam and the Izila) Takkar must work alongside several allies to gain the abilities he needs to defeat the leader of each tribe. Unfortunately this elevator pitch is also the entire plot synopsis, because thats pretty much all there is to Primal. Ubisoft has made a move away from Far Crys traditionally more linear storytelling but at a hefty cost. Primal simply hums along sedately until culminating in a pair of standard-issue boss fights It took me around 20 hours to get through Primals main campaign and just some of the available side quests, and the story does retain Far Crys now-signature supernatural flourishes, but it lacks any real twists, intrigue, rollicking set-pieces, drama, or depth. Primal simply hums along sedately until culminating in a pair of standard-issue boss fights. Supporting characters feel largely absent beyond their handful of associated missions and have very little to do with Takkar outside of cutscenes. Its a shame we dont see much of them over the games duration because I quite like the secondary cast; from the one-eyed guy who expresses his brotherly respect via swift headbutts, to the one-armed bloke who I suspect peed on me just so he could choose my nickname. Even the clearly traumatised woman with the ear fetish grew on me. Theyll happily join your village and mooch living quarters built from your hard-earned booty, but dont expect to see them out in the wild helping you when things get dire. The detailed character design and costumes on these allies is uniformly excellent, though, and theyre covered in cracking facepaint and nasty scars and adorned with various furs, bones, and sticks. Their performances are good too in the context of Primals credible, ancient feel. Well, all except for the jarringly odd Evel Knievel caveman who appears to have strolled directly off the set of a secret sequel to Encino Man. I know hes a nod to Far Cry regular Hurk, and I appreciate the comic relief, but the thick American accent may be jumping the sabre-toothed shark. 12", "date": "Feb. 22, 2016,"}