{"name": "Project X Zone 2", "name_review": "Project X Zone 2 Review", "ref": "https://me.ign.com/en/project-x-zone-2-1/116005/review/project-x-zone-2-review", "text": "Like funnel cake or any other sweet treat, fan service can be satisfying, but if there's not much going on underneath its appeal wears off quickly. Project X Zone 2 overloads you with truckloads of good-natured celebration, piling dozens of classic characters from Namco, Sega, and Capcom all into one sprawling package of tactical gameplay. As a way of reveling in gaming history, PXZ2 is just the dose of nostalgia you'd want, though it doesnt make the strategy action surrounding it any less shallow. Just like in the original, Project X Zone 2 brings together a variety of series characters, from Street Fighter and Yakuza to lesser-known franchises like Sakura Wars and Summon Night, by way of a story that's as best described as perfunctory. The collection of excuses used to unite this army of heroes through time and space is often laughed off by the characters themselves, emphasizing that the mystery that unites the motley crew for a turn-based strategy game ultimately doesn't matter. Simply seeing, say, Street Fighter's Chun-Li talk to Yakuza's Kiryu is the reward. Sharp dialogue writing really makes the most of the unique pairings. Seeing Strider and Shinobi meet Virtua Fighter's Kage and react to their different interpretations of ninjutsu is a laugh, as is seeing Phoenix Wright get used to working for the demonically possessed Tekken champion, Kazuya Mishima. Even better are the ultra-deep references to behind-the-scenes stories from development. The Odd Couple Dozen It rewards experimentation, too: build a trio of characters from Shenmue and its spiritual successor Yakuza, and you'll find some aggressively winking asides to their shared history. Same goes for when you partner up similar characters, like the tough-as-nails Chinese fighters Chun-Li, Pai Chan, and Xiaoyu, and theyll toss off quick witted gags during a fight. Different pairings give varied cute dialogue, which inspire you to mix and match PXZ2's roster more than any gameplay incentive will. Chapter after chapter of the 30-hour tactical campaign introduces more famous faces to the mix, making each new map feel eventful from a story standpoint. I was dying to see what new surprises Project X Zone 2 had up its sleeve for its constantly expanding roster. Of course, the heavy dependence on nostalgia for these characters means that the satisfaction youll get out of PXZ2's roster will differ based on how well you know the games being referenced. Project X Zone 2 expects you to be fairly familiar with the characters involved, even if some have rarely appeared in games released outside of their native Japan. If references to Sakura Wars' dating sim elements or Shenmue's search for sailors don't ring a bell, much of PXZ2's best stuff won't do much for you. And speaking of disconnect, theres no localization of the voiceover - youll only hear Japanese language throughout. It's hardly a deal breaker, but it leads to momentary confusion from hearing Japanese voices coming out of characters you'd only heard speak English before. An Army of Mascots All of that is the layer of fun and historical references layered on top of the actual tactical game underneath, and unfortunately its not much of a foundation to build on. When compared to the best strategy games on the 3DS, such as Fire Emblem and Devil Survivor, Project X Zone 2 doesn't really make the grade. Without improving much on the original, the turn-based, top-down action is serviceable as a platform for packing as many characters as possible onto the screen, but the battles and character development themselves are repetitive, with a level of flash that eventually wears off. The different battles take you to many settings pulled straight from the source material's games, but they eventually blend together as the bottom of the inspiration barrel is scraped. Stages like Tokyo intersections and parks can get pretty bland, even more so as several areas get reused across Project X Zone 2's campaign  I saw the same church interior more times than Id have liked. And when you often have 10 or more fighters to control on the map, you can easily lose track of their placement in a boring setting. On the bright side, each location has its own theme music to set them apart, which leads to a massive soundtrack full of good-to-great remixes of the many classic tunes included. More than once I was humming along to the themes from Sakura Wars and Streets of Rage without even noticing. All Flash Fights can be occasionally exciting, thanks to some top-notch animation. Every member of the dense, 58-character roster has attacks and techniques pulled right from their games, using specific items or taunts that, again, might fly over the heads of anyone who isnt intimately familiar with their origins. Seeing such dynamic recreations of Darkstalkers' finishers or Virtua Fighter's most complex attacks are certainly eyecatching. Of course, about a dozen hours in, seeing the same attack animations doled out to another stationary enemy gets a bit rote the eightieth time you see it, no matter how elaborate they seem at first. It's a notably refreshing change for a strategy game to have every turn-based attack work more like a 2D fighting game than the usual simple tactical commands, albeit where only one fighter moves at a time. There is some definite skill involved in timing the attacks to keep juggling an opponent mid-air (thus keeping a combo going), but overkill becomes your best option nine times out of 10. Usually that means just jamming up to three attacks simultaneously, which becomes a cacophony of competing references as every character clutters the screen, shouting their attack lines on top of each other. The bigger problem is that the enemy variety isn't good enough to keep combat interesting for long. The majority of enemies can be killed with a combination of attacks you master relatively early, so most fights tend to play out via the same succession of moves, with only the timing of your attacks making a subtle difference from turn to turn. Even most bosses work like standard enemies with more hit points, which means they fail to make you change your established attack patterns and do little to make these fights memorable. Good thing the flashy moves are full of brief anime shots and dialogue, or else they'd be much more boring. Just like with the conversational scenes, Project X Zone 2's combat is at its best when it's doling out bucketloads of nostalgia. Pros Hardcore fan serviceClever scriptLavish combat animations Cons Little battle varietyLight gameplay Judged against other tactics games, there are so many better options on the 3DS that Project X Zone 2 doesnt rate. Dont come expecting deep gameplay or even inventive updates to distinguish it from the previous game. PXZ2 is much more interested in matching up a diverse set of mascots for maximum humor and references to classic Japanese game series, which it skillfully handles most of the time. Nostalgia can only take PXZ2 so far in a lengthy campaign of average strategy gameplay, but it's an engaging old-school reunion while it lasts.", "date": "Feb. 21, 2016,"}