{"name": "Fire Emblem Fates: Birthright", "name_review": "Fire Emblem Fates: Birthright Review", "ref": "https://me.ign.com/en/fire-emblem-3ds-next/115891/review/fire-emblem-fates-birthright-review", "text": "I realized how amazing Fire Emblem Fates: Birthright is during a particularly nerve-wracking moment: My samurai had been cut off from the rest of my war party and was alone, with half health, against a much stronger enemy paladin. With permadeath turned on, there was a very good chance I could lose him forever. Things looked bad, but I couldnt give up. Holding my breath, I first moved my swordsman to a square of terrain that gave him extra speed and health, equipped a duel katana that would nullify the knights more powerful spear, and sprang into action. It was a gamble, but I was betting on my samurais Vantage skill, an ability that allows him to strike the enemy first, even when attacked. My bet paid off: the paladin fell in one swift stroke, and my samurai lived to fight another day. Its these jump-for-joy, shake-with-relief moments that make Birthright such a fantastic experience, and its more welcoming difficulty (relative to its also-excellent, veteran-focused counterpart, Fire Emblem Fates: Conquest  reviewed here) makes it a great entry point for the series. Its a clever turn-based tactical RPG that constantly rewards you for smart decisions, and every move, every piece of equipment, and every relationship you foster serves a purpose. Combine that with robust customization and a gut-wrenching story, and you have something that achieves greatness. Family Ties Birthrights heart-rending, 30-hour story takes place in the peaceful nation of Hoshido, which looks like something straight out of ancient Japan thanks to its beautiful, blossom-swept pagodas and lush bamboo forests. There, the army is desperately trying to hold back the advancement of the neighboring kingdom of Nohr, whose blood-thirsty king Garon will not stop until his enemies are crushed under his boot. As a prince or princess of Nohr, youre forced to take up arms against your own family in order to win peace and stop your fathers evil ambitions. Its an emotional and engaging journey, one where I often teared up as siblings accused each other of treason and challenged one another to mortal combat. This sad tale is elevated by excellent art direction that uses sweeping angles and well-timed close-ups on characters expressive faces to convey pain, regret, or hope as the two warring factions fight for supremacy. The graphics are an improvement over Fire Emblem: Awakening, especially notable in the way characters and buildings look more detailed, and your heroes actually have proper feet instead of weird stubs. In the background, the musical score does heavy lifting with hard-hitting percussions and soaring brass instruments to capture the martial spirit of Nohr, while haunting wind instruments and delicately plucked strings echo the tranquility of Hoshido. Even when I wasnt playing, I kept my game on just so I could enjoy the music. Fight for Your (Birth)Right The story, music, and visuals are great, but the battle over Hoshido is even better. Combat in Fire Emblem can get pretty difficult so its great that Birthright is so accessible to beginners by default. A sliding difficulty setting means you can ease into the experience by turning on Phoenix Mode in Normal setting, which will revive fallen units on the battlefield at the start of each phase. Or, if you want to dive right into the fire, you can turn on permadeath in Lunatic Mode, where every decision on the battlefield counts and just one wrong move can wipe out your entire party forever. Hard Mode is a variation of both, with the choice of turning permadeath on or off, which I prefer because it lets you adjust the difficulty setting precisely to fit your comfort level. IIt's a good idea to start on a lower difficulty level, because theres a lot going on on these tactical maps For instance, theres a clever new feature called Dragon Veins that can help you get a leg up in combat: when a member of a royal house stands on one of these special map tiles, they can turn what was once a safe, benign space on the battlefield into harmful terrain, like a spikey bamboo trap that depletes enemy health. Royals can also create a wellspring of health that will cure party members standing directly under the healing tiles. Additionally, helpful villagers living in houses dotting the map will offer you useful items when you visit them. Both are locations where youll have to make smart moves in order to control before the enemy does. Birthright also reintroduces the awesome Pair Up and Dual Systems from Awakening, now under the names Attack Stance and Guard Stance. This clever mechanic lets you pair up allies on the battlefield to temporarily buff their stats, dual-attack the enemy, or parry their offense. This is extra important because, as with all Fire Emblem games, as allies fight side by side, their support rank goes up and their assists improve whenever theyre near each other. Since different classes offer different types of support, its fun to mix and match pairs to get the most effective results: I liked to keep Sakura, my lower-level healer, near Scarlet, my stronger Wyvern Lord, so the former could benefit from the latters Rally Defense skill, which generates four points of extra defense. That doesnt mean combat is a walk in the park, however. Like in previous Fire Emblems, you have to juggle a number of combat variables, including learning to defeat the type of weapons enemies use with its rock-paper-scissors style counter, observing what their stats and buffs are, making note of whether theyre paired up (a new feature that lets enemies attack and defend just as effectively as allied troops) and taking into account how close they are. Wisely, Birthright makes it easy to manage all of this with an intuitive interface on the lower screen. Take the series Weapon Triangle for example: swords and tomes beat arrows and clubs, clubs and arrows trump spears and hidden weapons, spears and hidden weapons beat swords and magic. That might seem a bit confusing to the uninitiated, but a handy color-coded schematic makes it easy to understand. Meanwhile the Combat Forecast lets you view enemy and ally stats side by side, with buffs and debuffs clearly marked blue and red respectively. (Any stats that are maxed out are shown in green.) Its a simple system that makes determining the outcome of a fight hassle-free. 12", "date": "Feb. 18, 2016,"}