{"name": "Xcom 2", "name_review": "XCOM 2 Review", "ref": "https://me.ign.com/en/xcom-2/115269/review/xcom-2-review", "text": "Theres an air of white-knuckle desperation about XCOM 2s post-apocalyptic setting, and it only enhances the tension. Taking place 20 years after humanity shockingly lost the war we played in 2012s excellent XCOM: Enemy Unknown, were now fighting to overthrow a decades-long alien ccupation of the planet. Its a very thematically appropriate scenario for a game about taking four to six-person squads into battle against initially-superior alien forces, and a great backdrop for these unpredictable, tactically deep, and addictive battles. Above: Watch some XCOM 2 gameplay. Just like before, XCOMs high-stakes turn-based tactical combat dares you to become attached to your customizable characters (I made most of IGNs staff in the character editor) knowing that on any given mission they could be permanently killed off because of mistakes or just bad luck. As with Risk, Monopoly, Warhammer, poker, and anything else involving chance, XCOM 2 is a game where you can theoretically do everything right and still lose to bad rolls of the dice, but on the whole a good player will generally come out on top. Deciding when and how to upgrade and use each soldiers abilities, then crossing your fingers and hoping theyll make their clutch shot, creates non-stop suspenseful, triumphant, and tragic moments. Think of it this way: Playing Russian Roulette with a six shooter with one bullet, your odds of survival are five out of six, or 83.3%. Those are pretty good... but youd have to be crazy to put your life on the line with a 16.6% chance of blowing your brains out, because way more often than youd like, you will. But XCOM 2 asks you to make that same gamble  or often much worse  with the lives of your soldiers on virtually every turn. You might think an 80% shot is guaranteed to hit but in the one time in five that it doesnt connect, you need to have a backup plan for what happens, or else you cant complain when youre dead. Above: See an XCOM 2 Retaliation mission. Not being dead on your first game is one thing  you almost certainly will die as a result of walking into countless unknown traps, especially if you play above the normal difficulty (as I mostly did  normal, or veteran, is a cakewalk for anyone who knows XCOM). But one of XCOM 2s biggest strengths how it resists your efforts to fall into repetitious patterns. By comparison: after the first real-world month or two of XCOM: Enemy Unknown, it became apparent that anyone who intended to play it for that length of time would have a base build order down to a science, know exactly what to research when, and memorize the best routes through the pre-built maps and have an idea of where enemies would appear on them. XCOM 2 defeats most of those assumptions by introducing randomness throughout its campaign, so that you cant count on the route that took you to victory one time to deliver you to the same results the next. Likewise, every time through the 20 to 30-hour campaign youll see a random assortment of weapon modifications, soldier stat boosts, special ammo and grenade types, psionic powers, bonuses for covering continents with your resistance network, and more. Will you get incendiary grenades, which are great for disabling enemy special abilities and inflicting damage over time? Or poison rounds, which impair accuracy while also dealing steady damage? Or trace rounds, which increase accuracy on top of their other upgrades? You cant count on anything, but you will get something, and having to adapt to make use of whats available is a constant challenge. The same goes for the high-quality procedurally generated maps, and a good variety of mission types. Without knowing ahead of time where an objective will be or the location of the enemy, youll attack and defend, extract or kill VIPs, and blow things up. Some missions have turn timers that force you to make risky moves, or to make a hasty retreat. I cant say I ever had a mission where I lost because the map wasnt fairly laid out (though I definitely had some tough-to-cross stretches thanks to my use of explosives). Above: Watch an XCOM 2 trailer. And because you start most missions in concealment, keeping your squad hidden while you set up a lethal ambush is a new and different kind of challenge with a potentially big and cinematic payoff. Concealment is an interesting concept, in that its basically XCOM 2s aliens telling us, Go ahead: take your best shot. Its a simple system at heart: when you start a mission, the enemy doesnt know youre there until you get within a certain radius, or you open fire. And usually it is simple, unless you dash ahead without looking (as Ill admit, I sometimes did). If you exercise caution, though, you can set all but one of your squad into Overwatch mode around a group of enemies, then hit your highest-priority target and watch as your squad (hopefully) dissects the enemy in a beautiful slow-motion slaughter that suffers none of the typical Overwatch penalties. Enemies seem geared to compensate for the concealment advantage, though, in that several feature powers that make them much more difficult to kill if they arent taken out on the first turn. The Advent Shieldbearer is the best example of this: if he survives and isnt disabled, hell activate a power that gives him and every ally around him an energy barrier thatll absorb some significant damage. You definitely have to be careful about who you shoot first, because it makes a big difference whos alive when they start fighting back. Above: We play two missions with Firaxis. Plus, when you take out two of the three aliens in a group, the last one is sometimes smart enough to retreat and group up with another nearby group. Thats fantastic, because not only is the AI displaying a rare will to survive, it gives you another thing to think about when engaging: leave no survivors, or the next fight might be harder. 12", "date": "Feb. 1, 2016,"}