{"name": "Bit Trip Runner 3", "name_review": "Runner 3 Review", "ref": "https://me.ign.com/en/runner3/147943/review/runner-3-review", "text": "When I was learning to play the trumpet as a kid, my dad told me I didnt really know a song until I could play it 10 times in a row without a mistake. Runner 3 takes this same basic practice-makes-perfect concept and makes a quality platforming rhythm game out of it. Everything you do, from avoiding obstacles and gaps to gathering gold bars and gems along your path, is timed to the rhythm of the toe-tapping background music. The poppy techno tunes stick with you, and even when youre not playing you might find the songs still in your head. Each level is absolutely bonkers, with anthropomorphized machines, plants, and other oddities giving it a theater of the absurd vibe. Some of backgrounds are quite alive: the hills have eyes and dopey smiles, giant furnaces scowl as they bellow heat and cinders. Even the moon stares down from the sky with a sleepy grin. The characters themselves are unsettling and their costumes even more so. Uncle Dill, the slack-jawed, dead-eyed pickle character unlocked through Hero Quest, was my preferred character just because of how ugly he is. At the same time, the jagged edges and bland textures look like theyd be more at home on a five-year old iPhone game than the Switch. Just like its predecessors, Runner 3 demands perfection in timing. It starts off simple enough: just jump over a difficult series of obstacles and gaps. But as you progress through the levels it introduces new moves so the challenge of mastering them never lets up: push down to slide under obstacles; hit Y to kick through certain walls; hold down jump to slow your descent and increase your distance; and double jump to get over and across even larger gaps and obstacles. Once youve gotten the hang of the moves you have to start linking them together in rapid succession just to travel a few feet, which requires full concentration. If your nose begins to itch in the middle of a run, you have to suffer the discomfort because theres no time to scratch. But while the difficulty curve is tough and steady, its not unfair. When you mess up the timing of a jump, your run is instantly over, but its nobodys fault but your own. Halfway through the second world, repeating the same sections over and over again became almost rage-quit levels of frustrating. Overcoming this challenge is how Runner 3 gets its hooks into you  once you get on top of its brutal difficulty, theres a good chance you wont be able to wait for the next chance to play it. When you finally really nail a level, though, it's as though your thumbs are doing a little dance.When you finally really nail a level, though, its as though your thumbs are doing a little dance. And roughly halfway through the three continents of the main campaign it started to feel doable. The wave of relief and satisfaction that comes with successfully completing a level makes all the repetition feel worth it. Even with new obstacles and paths to unravel, all the lessons and timing learned in earlier levels made these harder ones feel easier to execute in fewer tries. Some of the earlier levels were practically a walk in the park in hindsight, and thats the real beauty of Runner 3. It never gets easier. In fact, it only gets harder. It makes you get better. The secret to Runner 3 was inside of me, all along. Theres so much to do outside of running through levels just to finish them. There are side quests accessed through branching paths, letting you unlock characters and costumes. When you finally beat a level, you open up the gem path, an alternate and more difficult path. Gathering gold bars unlocks new and more of the ultra-tough impossible levels. It makes Runner 3 a pleasantly robust, if a bit ugly, game. Runner 3 is a fun, challenging experience with a weird, charming aesthetic brought down by out-of-date graphics. Playing the same level dozens of times wears thin, but its difficulty never feels unfair. It ramps up slowly, introducing new moves and forcing you to practice them over and over. Suddenly youre linking all those moves together in insane and precise ways to make your way through the levels, and the feeling of mastery when you cross the finish line makes up for its repetitiveness.", "date": "May 19, 2018,"}