{"name": "The Witness", "name_review": "The Witness Review", "ref": "https://me.ign.com/en/the-witness/115005/review/the-witness-review", "text": "The Witness is a game brimming with secrets: daunting and multilayered mysteries that sunk into my subconscious, tracing snaking paths across my brain until I was literally seeing mazes every time I closed my eyes. Thats the kind of power The Witness has. It hooked me in with its masterful puzzle design and gorgeous visuals, then compelled me forward as I began to carve out my own purpose on the island. Its a freedom granted by a world as welcomingly open to exploration as it is enjoyably challenging to solve. The Witness is a fully 3D world navigated in first person, but revolves around solving two-dimensional mazes found on in-game panels, completed by drawing the correct path from a circular start point to a rounded end point. This simple, intuitive core concept burns at the center of the 700 or so puzzles youll find on The Witnesss enigmatic island setting. Tracing lines feels as smooth as cutting butter with both a mouse and a gamepad and is accompanied by a warm, electric buzzing effect. The pure tactile joy of communicating with these interfaces and the initial sense of wonder and mystery their very presence brings were enough to motivate me in the earliest moments of The Witness. But these light-up labyrinths quickly became more sophisticated, adding new rules and constraints to the basic maze-like structure and thus allowing for the real tough, yet fulfilling challenges to emerge. Puzzles With a Purpose Puzzles in The Witness are hard, but fair. As I learned to apply each new rule, curiosity soon gave way to obsessive levels of motivation and purpose. I wasnt just solving puzzles because they were fun  slowly but surely, they were beginning to make sense in a much larger context. This manifests most tangibly in The Witnesss first obvious, overarching goal  shooting beams of light into a mountain. The mountain serves as the islands highest point, most prominent landmark, and consequently its most central mystery for reasons that are obvious once you start playing, but which I wont spoil here. Most of the major regions on the island house machinery capable of shooting light into the mountain, but can only be activated once you solve the right sequence of puzzles, bestowing my frantic line-drawing antics with an important sense of progress. It also helped me see the various regions of the island as distinct parts of a larger, cohesive whole, making the constant treks across the surprisingly large, dense land mass less daunting because of it. It let me set my own goals, trace my own path around the island, so I never had to feel lost, physically or in terms of my role on the island. A map of the island. There was also enough to do and see beyond the key objectives that my time spent simply wandering still felt compelling minute to minute. I could take a peaceful boat ride around the perimeter, explore the ruins of a wrecked ship, finally make the descent into that hidden underground passage Id discovered on a previous errand. I valued these quiet moments on the island as much as I did overcoming its most perplexing puzzles, especially during the times I felt truly stuck. A New Perspective Puzzles in The Witness are hard, but theyre always fair and solvable. In a manner more freeing than most puzzle adventures, youre allowed and even encouraged to walk away from a problem you dont feel equipped to solve. Thats a concept introduced in the opening minutes, when you encounter a locked door covered in symbols youre unfamiliar with. The answers you need are further up the path, but you have to let yourself walk away first to know that. The Witness does more than equip you with the tools needed to find the right answers  it teaches you how to ask the right questions. Expand this dynamic to the whole of the island, and you get an intelligently designed puzzle game that doesnt just give you the freedom to chip away at its riddles at your own pace, but creates a compelling adventure of the learning process itself. I always found seeking the answer just as satisfying as applying it. The masterful design of The Witnesss puzzles is matched by the beautiful and clever layout of the island itself. One early sequence of puzzles unlocks a small courtyard full of sketches and diagrams of human hearts and veins. It didnt seem of immediate significance when I found it, until I walked out to the neighboring cliffside I had passed by on my way there and noticed the way the red tree roots growing along the edges of the seaside bluff looked like bright, thick arteries coursing through the flesh of the earth. These startling and sometimes enlightening visual revelations were everywhere, adding excitement and meaning to the world even when I wasnt actively seeking it out. Sights become symbolic with the right context. Every tree, every rock, feels like it has been placed with a purpose, allowing familiar sights to take on thematic weight when viewed from different angles. Ordinary landmarks became focal points when framed with precise deliberation between a grove of trees, or perfectly centered inside a hollow window frame. Thats kind of what The Witness is about: pointing you toward new ways of seeing. Many times, finding the answer meant stepping away from the actual puzzle and asking myself what I wasnt seeing. Puzzles in The Witness are solved on these panels, but it doesn't mean everything you need to solve them exists within their physical confines. No matter what question a particular puzzle posed, I always found seeking the answer just as satisfying as applying it. Island of Enlightenment A lot of games try to be about things, but The Witness actually embodies those things. Audio logs hidden around the island contain quotes from famous philosophers and scientists, chosen with obvious care for the way each speaks to specific concepts The Witness sets out to explore. The graceful design of the island had already managed to provoke natural epiphanies about ideas some of the quotes address, so at times the logs felt unnecessary. But then other times the words spoke to me, in the same way the physical island had: an invitation to see things from a new point of view that maybe I hadnt considered. The view from the top. Some of the most mind-blowing revelations were hidden in plain sight... One particular quote at the top of the mountain comes from former astronaut Russell Schweickart. As I looked down at the island from its highest point, I felt a connection between what Schweickart was describing, when he spoke about the transformative effect of looking down at the Earth from space, and the all-encompassing view of the island the mountain afforded me. Like the Earth that Schweickart describes, spinning around the same way every day, revealing the same places with each rotation, nothing about the island ever really changes. I could walk by the same thing in The Witness ninety-nine times and never have a second thought, but then on the 100th passing, I'd notice something new about it. But not because the thing itself had changed  because I had. Like everything else in The Witness, finding more concrete answers about this abandoned island and the people who once occupied it requires patience. Theres plenty there to dissect  statues that seem like people frozen from various eras, mysterious corporate logos, hidden audio logs  and it was all enough to keep me enthralled in the mysteries it built across my 40- to 50-hour playthrough. Most of the time its more questions than answers, and I enjoyed that it left things open to interpretation. Statues around the island seem like people from all eras, frozen in time. Theres also a lot you can miss  secrets tucked away behind the islands most challenging obstacles  but some of the most mind-blowing revelations were hidden in plain sight, making every return to the island a new adventure. I estimate it would take 80 to 100 hours to fully do and see everything here, but theres a satisfying amount of thematic weight and contextual clues that I was able to reach the ending the first time without feeling like The Witness owed me a greater answer to its riddles. Story doesnt drive The Witness as much as its mystery, nor does it treat story as an arbitrary reward for your efforts; whats there only enriches an already fulfilling experience. Pros Intelligent puzzlesClever world designWealth of secretsLooks beautifulConsistently engaging The Witness has a power and pull that carried me throughout the more than 40 hours it took to complete it for the first time, and that, even now, beckons me back to confront the mysteries I left unsolved. Its graceful combination of tangible goals, obscurity, and freedom creates ample opportunity for small victories and grand revelations alike. For the most part, its themes weave themselves beautifully throughout the gorgeous world and wide variety of puzzles, but even when it breaks subtlety in favor of a more heavy-handed approach to exposition, it never detracts from the truly fulfilling moments The Witness offers in terms of solving its physical puzzles and unlocking its deepest mysteries.", "date": "Jan. 25, 2016,"}