{"name": "Pony Island", "name_review": "Pony Island Review", "ref": "https://me.ign.com/en/pony-island-1/114780/review/pony-island-review", "text": "Pony Island is not a good game. Its an awful game, in fact. You gallop from left to right, jumping over gates and blowing gusts of wind at troublesome butterflies. Clear gates for long enough and youll reach the end of the level, earn some EXP and get to do it all over again. On the other hand, Pony Island, the game that challenges you to escape from this gate-jumping hell, is superb. Its a self-aware indie gem with an anarchic sensibility, where anything can happen. The very opposite, then, of the game within this game. Jump, little pony! Much of what makes Pony Island so intriguing and cool should be left for you to discover for yourself, so I wont go into too many details. Instead, Ill give you the broad brushstrokes. Youre trapped within an old school computer system, with seemingly no choice but to play Pony Island, and surrender everything you have to it. Get out of the game, however, and you can access the machine its running on, and start exploring different user accounts and files, and encounter other characters via a messaging program. Its presented like an 80s Macintosh nightmare, on a smudged, smeared monitor, with chunky, era-specific graphics that are largely monochrome but bleed into colour to create an unsettling tone. Colour is also used to highlight interactive elements or to create a deliberate contrast to this stark world. Its clever design, as is the whole Pony Island game concept, which works precisely because its so at odds with the wider games brooding, sinister tone. Colours are used sparingly and to good effect. You actually wind up playing a lot of Pony Island in various forms over this two hour experience. Its deliberately repetitive, but also always serves a purpose, especially as the games designer is the central figure in the narrative. Pony Island is his domain, where he attempts to exert his influence, whereas the sequences in-between  where youre exploring and interacting with the computer system  are where you have the most agency. These sections are wonderful: I never knew what to expect, and Pony Island threw a number of ingenious curve balls at me. Pony Island may be chaotic and unpredictable by design, but its visual language is crystal clear where it counts. I quickly learned, for instance, to look for the portals that will take me to a puzzle and progress the game. Each of these puzzles lets you actively hack the system. As such, theyre  for the most part  presented as backend code, where you rearrange a set of symbols to manipulate a program. Theres generally only one solution, so theres no actual hacking, but the mechanics are sound, and these vignettes fit Pony Islands aesthetic really well. Its particularly cool seeing nods to story elements, or hints to solutions lurking in the code. The puzzles aren't hard, but they're excellent. The puzzles evolve neatly over the course of Pony Island, and while their complexity could certainly have been pushed a little further, theyre at about the right level to ensure youre always moving forward. They also serve as a backbone of traditional gameplay for this rather avant-garde experience.", "date": "Jan. 19, 2016,"}