{"name": "Punch Club", "name_review": "Punch Club Review", "ref": "https://me.ign.com/en/punch-club/114718/review/punch-club-review", "text": "Im out of shape, but too broke to go to the gym because I need to stock my fridge. Without food, I dont have energy to visit my girlfriend, who gets upset when I focus my attention more on my job than spending time with her. Punch Club, like any good life sim, mimics the harsh realities of reality well, but the delicate balance of great role-playing systems that makes this street-fighting simulator more badass than my usual day-to-day. Unfortunately, becoming a champion is a tedious affair. Punch Club combines my favorite part of Personas life management with a surprisingly deep set of RPG options as you bring your mundane macho man into the martial arts spotlight. Eating healthy, hitting the gym, going to work, grocery shopping, and making friends all contribute toward the ultimate goal of annihilating every other guy who enters the ring, whether its on the books, in the street, or in a shady fight club. Its a premise that can become tedious, but devising an efficient routine breeds a special sort of deserved satisfaction. Its an intensely hands-on kind of game -- that is, ironically, until you actually start fighting. I enjoy micromanaging my fighters stats and skills, accomplished by focusing on certain workout routines and upgrade paths, because my progress is clearly shown when I enter a fight. Like a fighting coach, I dictate the important stuff outside the ring  what moves he should use against this opponent, thing two, thing three  but when my guy goes in, its up to his AI to use his abilities. Sometimes thats a gamble. Punch Club isnt a sweet science, relying more on random elements and behind-the-scenes math than skill-based play. Winning, even when youve outmatched an opponent, isnt a certainty, which is sometimes frustrating. The flip side of that is that it feels great to clobber someone who outclasses you in basically every way. Part of that gratification comes between rounds. Unlockable active abilities -- like a kick that crushes enemy stamina, or a low-accuracy but powerful punch -- occupy a limited number of slots, which brings in a smart, if simple, strategic layer to Punch Club. I loved adapting to my opponent's strengths and exploiting their weaknesses. Notice their staminas low? Unleash with a more aggressive round than last time. Not enough HP to survive the next round? Maybe change out a risky attack for a block or dodge skill. Success isnt guaranteed, but Punch Club, like a good fight, earns its tension from not knowing for certain how the athletes will execute. These systems are much more complex than its appearance would have you believe. Developer Lazy Bear Games gorgeous pixel art and catchy chiptune music bring a beloved Super Nintendo retro aesthetic, which plays well with the silly but inconsistent tone. The dialogue is intentionally dumb, usually to emphasize a Ninja Turtles or 80s action movie in-joke. This is a world reliant on references, which is a shame in that it never has a personality of its own. A few of its jokes genuinely had me in stitches -- a Brad Pitt character homage to Fight Clubs Tyler Durden sent me on a quest to visit his twin brother, a knock-off Mickey from Snatch. Its cute to deliver pizza for a Casey Jones character. But ultimately, Punch Club gains very little from its pop-culture wink-winking to Pulp Fiction, Jay and Silent Bob, and Bloodsport. Any shred of cleverness goes toward someone elses joke, so theres nothing particularly interesting, memorable, or likable about this world. Over time, the routine of a training regimen and living the life of a fighter wore me down. I found myself stuck in a rut of doing the same repetitive activities until I could chip away at the long-term goal of building a home gym, or increasing my strength stat enough to survive a particularly challenging brawl. Sometimes this lasted hours. That Punch Clubs protagonist can level down over time if you dont keep doing certain activities cripples progress, forcing you toward exercise not only for improvement, but to avoid deteriorating. Expensive upgrades can prevent degradation beyond a certain point, but it feels like a waste when there are far more seductive upgrades. After hours of entertaining, hard-won success, falling into a grinding rhythm is severely demotivating. I lost interest in playing Punch Club repeatedly despite enjoying it quite a bit, purely because I struggled to free myself from the cyclical monotony Id found myself stuck in. I changed course, focusing on training and relationships instead of fights, which were easier as Id fallen in rank due to skipping matches. Eventually, and out of nowhere, Punch Club doubled down on inconvenience, forcing me to take on two opponents in one league fight. The payout was huge, but not easily earned. Punch Club became a constant, demoralizing struggle that shattered my enthusiasm. I grew intensely bored, frustrated, and eventually bitter. Enduring the grind gradually got me out of my hole, but after 20 hours -- the vast majority of which spent not fighting -- with plenty more ahead, Id have sooner started over and played differently from the beginning than finished my first playthrough. I decided to stop playing altogether. Pros Smart systemsRPG min-maxing Cons Leveling downTedious repetitionWeak humor Part Persona, part The Sims, and part Fight Club, Punch Club is deceptively deep, with a rewarding life simulation and RPG systems. Its bursting with personality, (though regrettably very little of that is its own) reliant on bygone eras and pop-culture references to establish its lighthearted and fun tone. Punch Club is tedious at times, thanks to an unfortunate level-down systems that artificially extend the road to the championship with grinding repetition, but its upgrades, stat growth, and more compensate with satisfying depth.", "date": "Jan. 17, 2016,"}