{"name": "Dirt Rally", "name_review": "Dirt Rally Review", "ref": "https://me.ign.com/en/dirt-rally/114122/review/dirt-rally-review", "text": "Dirt Rally is more than just the best Codemasters rally game to date; its arguably the best racing game Codemasters has produced in at least a decade. Perhaps ever. Its certainly the best crack at a hard-core rally game since 2004s heavily-worshiped Richard Burns Rally from Warthog Games. Its brilliant. Dirt Rally sheds the showmanship of past instalments and shifts the series back to pure, unforgiving rallying. Theres no rewind ability and no quarter given by the games opponents. Dirt Rally doesnt care if youre too slow. Its not going to give you a pat on the bum and a free ride to first place if you cant keep up. To rule Dirt Rally you need to be fast, you need to be focused, and you need to be fearless. When I began playing Dirt Rally I simply wasnt quick enough. I was overly cautious and still coming to grips with the handling. I was losing time on every sector. At best I was scraping into top four finishes. At worst I was spearing off stages and suffering huge time penalties that sent me plummeting down the timesheets. The steep learning curve may prove frustrating for some players; the deliberate lack of Codemasters signature Flashback crutch is an important way of punishing mistakes and placing realistic pressure on players but the lack of any meaningful tutorials or rally school may alienate less-experienced users. But it should begin to click. I soon began to better understand the limits of my car and just how close it could be pushed to the edge. I tried being slightly more experimental with my set-ups, seeking to eek a few more tenths from the clock. As my comprehension of the pace notes developed I became more aggressive in corners, attacking them with increasing confidence, braking later (or not at all), turning in harder, and getting back on the power quicker. Blood, Sweat, and Gears Dirt Rally is rewarding precisely because it makes you work so hard to get results. I vividly remember my first stage win in Dirt Rally because it took me plenty of practice (and a properly blistering run) to earn it. Its these moments where Dirt Rally is at its most thrilling, fractions of a second ahead of the pack at the last time check, hurtling down a narrow forest corridor, carving around gravel bends, and keenly aware that losing my nerve now will see me slip behind. Losing my lunch, however, is still a possibilty. Dirt Rallys wheel controls are very satisfying and the force feedback feels drastically better than it did when it debuted in Steam Early Access. Im playing on a Thrustmaster TX (using the optional TH8A shifter in analogue mode as a handbrake) and the constant wrestle is a huge amount of fun. That said, Codemasters hasnt ignored gamers who arent in a position to splurge on a racing wheel; I also played it using an Xbox One controller and found it more than capable of taming Dirt Rallys demanding racing. The joypad controls feel refined and responsive and can be further massaged to suit individual preferences by honing the controller sensitivity and linearity settings. In any case, the handling is fantastic and the feel of balancing a car on the very limit of adhesion (and, in many cases, well beyond it) is tremendously translated. Its a great looking game too. The vehicles themselves are far more detailed than those in Codemasters Grid Autosport (complete with authentic cabins) and the stage design is excellent (with intimate, tree-lined sections opening up into vast vistas). I love the small details too, from the way new mud is plastered over dried mud, to the occasions youll spot camera drones darting from behind shrubs to capture a great angle of you shredding up a corner. And the water splash effects? Magnificent. Case in point. Better still is the sound, which I honestly cant fault. Exhaust notes are a violent symphony of snarls, crackles, and pops. Dirt Rally really nails everything, from the whine of a turbo, or the squeal of protesting brakes. The pace notes too have an incredibly authentic beat to them, feeling unique to each stage rather than a cut and pasted barrage of commands lifted from a virtual soundboard. True Grit There are 39 cars available, ranging from the 1960s classics to todays competitors. Aside from a few obvious exceptions Dirt Rally covers most of the sports most iconic vehicles. Its quite a task getting to grips with all of them, too. An antique like the Mini Cooper S is quite forgiving (incredibly light and front wheel drive it claws its way through corners) but its no rocket and demands you keep your momentum up and maintain as much speed as possible. On the other hand, Dirt Rallys modern RallyX cars (with around twice the horsepower of a current WRC car) accelerate like Sidewinder missiles, squatting down on their rear springs as they surge to speeds that will leave your spleen in a different postcode. 0-100km/h in two seconds? Sure, why not? Theres a great deal of variety in the rally locations, ranging from the huge jumps and high speed gravel straights of Finland (easily my favourite location) to the incredibly rough gravel farm tracks of Greece, and from the lush, green countryside of Germany to the icy roads of Sweden, with its stages carved through snow drifts. Dirt Rallys treatment of snow in particular is excellent; rather than bouncing off it like a solid wall cars will plough through chunks of it as they graze the banks, sending plumes of white powder into the air. In addition to the rally locations theres also Colorados famous Pikes Peak hillclimb course, plus several dedicated RallyX tracks (which provide the game with head-to-head multiplayer). Ive had a huge amount of fun with the RallyX courses; I really enjoy the format and the strategy involved with deciding when to take the compulsory Joker Lap (the circuits all contain one slightly longer detour that all drivers must take once during the race). The racing is entertainingly aggressive and the AI tenacious. The sealed version and the mixed-surface version of Pikes Peak are both available. Its up to players what you choose to primarily focus on during Dirt Rallys career mode (or in what order you want to tackle these event types) but youll need to actually spend your own in-game winnings on the cars you want in order to do so, and this can be a slog. Personally I find Dirt Rallys career mode suffers as a result of this; Id expect the driver-for-hire model found in the likes of Grid Autosport or Project CARS would be a better fit for Dirt Rally than the grind-for-cash, collect em up approach of games like Gran Turismo. Pros Excellent handlingBrilliant effects and soundGreat garage selectionGood mix of modes, including RallyX Cons In-game economy makes career mode a grind Theres a specific corner during one of the German stages in Dirt Rally where your co-driver will supplement his flurry of warnings with a professional request: Be brave. Its a slight left kink, framed on both sides by half-buried stones. To be honest Im not certain what it is about this corner in particular that warrants the added advice  there are plenty of deceptive corners in Dirt Rally you can take faster than youd expect  but ~be brave~ potently sums up how you need to approach Dirt Rally. Dirt Rally is a brilliant looking and incredible sounding racing sim that feels absolutely outstanding, but it wont tolerate the timid.", "date": "Dec. 22, 2015,"}