{"name": "Just Cause 3", "name_review": "Just Cause 3 PC Review", "ref": "https://me.ign.com/en/just-cause-3/113610/review/just-cause-3-pc-review", "text": "Awesome explosions: Just Cause 3s got em! The story would have you believe all of this spectacular demolition is about liberating the picturesque island nation of Medici from a mustache-twirling dictator. But considering it doesnt even care how many civilians you blow up in the process, we all know what its really about: ridiculous over-the-top action, physics-based comedy, and impressive destruction in a vast sandbox world. In those areas, Just Cause 3 is at the top of its game. Watch the first full hour of Just Cause 3 above. The map is absolutely huge (reportedly its three islands span 400 square kilometers, but I didnt have a tape measure on me to confirm), and how you choose to get from its sunny beaches and forests to its snowy peaks is a big part of the joy of it. Theres fast travel if youre into the whole brevity thing, plus arcadey-feeling cars, planes, boats, and more, but learning to use Rico Rodriguez's unique combination of grappling hook, parachuting, and wingsuit to gracefully zip around is the most challenging and rewarding. Theres a real skill to it, and mastering techniques such as the no-parachute, no-wingsuit Spider-Man-style swinging takes some practice. Double-Dog Dare I was driven to experiment with those methods because Square Enixs servers are always tracking just about every move you make, popping up with alerts when youre climbing the leaderboard in stats like longest freefall or highest parachute climb, constantly pitting you against your friends list to create countless tiny challenges. It even pops up with a notification when someone beats your score, seeming to ask if youre going to let that aggression stand. Its also routinely hilarious, because all of this acrobatic movement can easily end in Rico performing a face-first slam into the ground or a building or a tree. That always makes me smile through a cringe, and especially spectacular ones made me glad I had ShadowPlay running in the background. Combat shares in that violent slapstick humor because it gives you so many absurd tools that enable creative destruction. You can, of course, simply shoot guys in run-and-gun fights, but if you put in a little extra effort you can, among many other things, grapple-kick them, string them up to the nearest tall building, tie them together and conk their heads, or tie moving vehicles to the ground to create a spectacular end-over-end flip and crash. Another favorite of mine is running up to an unsuspecting soldier, slapping a sticky explosive charge literally on their face, backing away, and hitting the detonator. Its doubly hilarious if youve unlocked the rocket-booster bombs, because the victims last few moments are spent writhing on the ground as the thruster throws them around before it explodes. Wonky physics goofs like an enemy jeep launching through the air after a minor collision are generally a great time, especially since realism isnt exactly the goal here so much as having crazy things happen. Ricos also unbelievably durable to anything other than being inside a vehicle when it explodes, so having a whole building collapse on top of you is funny rather than tragic. It was only when those things didnt work out in my favor that I was irked, such as when I had a fighter jet air-dropped to my location (you can do that once youve unlocked it, because Just Cause 3 is all about instant gratification) only to have it spontaneously explode before I could get in, as though it was damaged during shipping. Blow The Roof Off The Place Blowing things up is what Just Cause 3 does best. Though not everything in this world is destructible (typical buildings are impervious to damage, for example) enough that Just Cause 3 has some of the best and most empowering explosions this side of Red Faction: Guerrilla. Your main targets are exploding stuff like fuel tanks and power generators, which are clearly marked in red and scattered liberally around most towns and military bases, but you can also collapse flimsy-looking structures like guard towers, gas stations, and, even more spectacularly, huge bridges. Combined with a good number of extremely potent weapons, ranging from machine guns and grenade launchers to an airstrike-targeting laser and a shoulder-mounted nuke, you can rain destruction down on everything in your path even while floating on your parachute. And of course, you can hijack virtually any enemy vehicle to obtain infinite ammunition. Its a recipe for great moments. Enemies bolster the illusion of being an over-the-top action hero by being as dumb as bags of rocks. Theyre slow to react, usually terrible shots, and will often drive their vehicles into each other or over cliffs. That works out, because there are a ton of them and they spawn out of nowhere, so even with Ricos ridiculous durability and recharging health, you can still get overwhelmed if you don't recognize when it's time to retreat. Also, a shout-out to the one advanced soldier who pulls some action-hero moves of his own, spinning around to dodge you John Woo-style as he fires pistols from both hands. Just Cause 3s main problem, which arises from its absolutely massive map, is that liberating the many towns, bases, and outposts across dozens of provinces on Medicis three large islands becomes repetitive. You blow up everything with red on it, take over the police station, maybe kill a few specific enemies, knock over a statue of the dictator, then raise the Rebel flag, and youre done. Most liberated villages reveal uninteresting challenges like race courses for cars, boats, and planes, and those in turn unlock some hit-or-miss new abilities for Rico. Then you do it again, and again, and again, sometimes as forced padding between story missions. Military bases are more fun to take over, since many of them feel more custom-built and unique - they include locations like naval bases, air strips, military depots, army-controlled mines, and sometimes include heavy defenses. Plus, theyll throw a lot more heavy military hardware at you, which gives you the opportunity to hijack powerful tanks, helicopters, and jets. Theyll also usually unlock more interesting challenges, such as rounding up precious ore stones using an oversized magnet you tow around or driving a car loaded with explosives into a cluster of enemies. Down With... Whoever While I give Rico and his crew credit for occasionally tossing out a self-aware joke that got a chuckle out of me, Just Cause 3s story is a paint-by-numbers action plot where some characters know theyre in a lighthearted parody while others never figure that out. Specifically the villain, who seems like hes trying his best to be legitimately unsettling but falling short, takes himself far too seriously to fit into this wise-cracking game. Its thin, too, and even developer Avalanches writers seemed to be getting sick of justifying these missions by the end of the roughly 30-hour run. Youd think hed have learned after the last two times, Rico says as he and his cohorts plot a final assault in the exact same way they blew up the last two major targets. Watch the official launch trailer above. Performance, unfortunately, is an inconsistent issue. On one of the two PCs I played on (a Core i7-980X with a GeForce GTX 970 and 8GB RAM) I saw generally great frame rates interrupted by some major slowdowns and stuttering but the other PC (Core i7-4790K, GeForce GTX 980, and 16GB RAM) was almost flawless. On both I saw occasional crashes, and some frame rate problems arose when huge explosions went off. I also wouldnt recommend playing without an SSD, because load times can be exceptionally long when using a hard drive. Pros Great mobilityMassive open worldImpressive destruction Cons Repetitive liberationsPerformance bugs Just Cause 3 is a playground where you get to be a physics-defying force of destruction, and its loop of liberating dozens of towns across this enormous scenic world wouldve gotten old much quicker if the combat wasnt so full of options for free-form mayhem. Getting the most out of it requires some creativity and tolerance for performance bugs on your part, so come expecting to make at least some of your own fun. <br><br> <em>[Editors Note: This review was conducted on the PC version, which we obtained from Square Enix first. Our early impressions of the console versions show that its identical in content, but weve seen significant performance problems, including extremely long load times and significant frame rate issues that will require further testing to fully evaluate. Our PlayStation 4/Xbox One review will follow later this week.]</em>", "date": "Dec. 1, 2015,"}