{"name": "Bloodborne: The Old Hunters", "name_review": "Bloodborne: The Old Hunters Review", "ref": "https://me.ign.com/en/bloodborne-the-old-hunters/113426/review/bloodborne-the-old-hunters-review", "text": "The Old Hunters is as fitting a title for this self-contained Bloodborne expansion as you might imagine. Its a spiritual and mechanical return to the old, reliable, tense, and violent patchwork of terrible places that make up this atmospheric and secret-filled world. With a sizable, 15-hour hunk of the same gory experience, it maintains the brutal attitude that defines Bloodborne, set in a new nightmare, against new horrific oddities, and with new grin-inducing weapons and abilities. This Hunter's Nightmare houses three distinct, sprawling, comfortless environments, that are as visually and thematically unique and fully realized as any area in Bloodborne. The Old Hunters largely takes place in a capsule-world called the Hunters Nightmare, a facsimile of Bloodbornes world that's surprisingly even more stark and forgotten. It's a place where all hunters that succumb to the lust of the hunt eventually go  or something. The story is as vague and cryptic as ever, centered primarily on the curse that began with the first hunters, but The Old Hunters' self-contained plot delves as much into the established lore of the universe as its own story ideas, which are generally creepy and intriguingly peculiar, though not as grand in scale as Bloodborne's larger story of brushes with mind-destroying cosmic deities. This Hunter's Nightmare houses three distinct, sprawling, comfortless environments, that  with the exception of the starting area  are as visually and thematically unique and fully realized as any area in Bloodborne. This realm is fittingly lousy with fallen hunters  and unlike in Bloodborne, most of these dangerous enemies respawn, meaning constant, grueling encounters every step of the way. But in keeping with the hunter-centric themes, some of the most notorious names of the profession can be summoned for aid in both new and existing fights using the Old Hunters Bell. I beckoned Damian of Mensis to once again take down the cosmic Ebrietas, and I called upon the old Tomb Prospector to help in the deeper Chalice Dungeons. Knowing the place these names have in the lore meant lending a sense of validity to the world when seeing them in the flesh. This emphasis on hunters is paired with the new titanic, sickening, and deadly monsters The Old Hunters introduces to Bloodborne's bestiary. Whether you're facing blood-soaked sacks of decapitated heads, tentacles that whip violently when you get to close, or a towering shark-man that lunges dozens of feet to pick you up and bite down on your torso, there's new stress, fear, and elation to be had in each introduction. The Old Hunters' new beasts are a testament to developer From Softwares continued excellence in creature design. And yet mechanically, theyre inescapably familiar in form and function to what Bloodborne threw at us. Though undeniably challenging, its disappointing that these new encounters are challenging in the same way. Even the few new bosses introduced in The Old Hunters carry a strikingly similar cadence to what we've seen before. Their attacks never truly surprised me, and in at least once instance I was able to kill a boss on the first try due to its near identical look and behavior to the bosses of Bloodborne. The Old Hunters is an expansion that plays it very safe. Though undeniably challenging, it's disappointing that these new encounters are challenging in the same way. Fortunately, the lust for coveting new instruments to murder, mangle, pulverize, and pepper with bullets is alive and well in The Old Hunters. Its niche weapons and abilities are as stylish as they are slaughterous and each new discovery rekindles that fleeting, perfect moment of excitement and wonder as to what its capable of doing. Theres a dark sense of catharsis in mowing through a crowd with a buzzsaw on a pole, firing a giant explosive artillery shell, beating a hunter to death with the arm of a cosmic deity, or summoning a giant viper to engulf your foes. The Old Hunters is an exercise in finding new ways to harm the horrors that lurk in the darkened corners of the world. However it's the many secrets in The Old Hunters that are calling me back to it even now. A cryptic phrase, an overly specific item description, or an obscure request: all are potential clues in the vast network of secrets gnawing to be discovered. For example, I found a new set of equipment, read its description, and learned it once belonged to a pair of hunters from an existing area in Bloodborne. On a whim I donned the armor and followed the clues, going to the area and exploring for... something. Moments before I was about to give up, admit that this was just wishful thinking, and that there was nothing to find, I met one of the hunters. These moments of reading into vague secrets, putting hints together and taking shots in the dark for things might not exist, culminate in exhilaration for those few times you're actually onto something. That payoff of turning over every nook and cranny is what keeps bringing me back to this world. Pros Creepy atmosphereSecrets galoreNew weapons & abilitiesCreature design Cons Few new ideas The Old Hunters is another shot in the arm of the same serum that coursed through Bloodbornes veins. Though diehards may pillage its secrets quickly, my approximate 15 hours spent delving its depths and gleefully employing each new destructive tool felt satisfyingly dense. The Old Hunters is an impressive return to From Softwares oppressive and rewarding universe, and while it retreads much of the same path, its very much a path worth taking.", "date": "Nov. 24, 2015,"}