{"name": "Sword Art Online: Lost Song", "name_review": "Sword Art Online: Lost Song Review", "ref": "https://me.ign.com/en/sword-art-online-lost-song/113245/review/sword-art-online-lost-song-review", "text": "While in the midst of my 15th boss fight in Sword Art Online: Lost Song, all I could think was: is this really all there is to it? I had fought the same type of hydra creature at least half a dozen times before, and had long since memorized a strategy for defeating it. Sword skill, sword skill, dodge, dodge, dodge, magic blast, magic blast. Repeat as necessary pretty much sums up the entire dull single-player campaign for Lost Song. The multiplayer does bring some much needed energy into combat, with fast-paced player vs. player rounds and a variety of co-op missions, but even that can only last for so long. Watch 7 minutes of Sword Art Online gameplay above. Like the entertaining Sword Art Online anime, Lost Song takes place in a fictional fantasy MMO called Alfheim Online, where you can take to the skies and battle monster hordes or duel with non-playable characters. In other words, the core mechanics are all about fight and flight, both of which are done well thanks to easy and intuitive controls. It takes just a couple of quick taps on the d-pads up arrow to elevate into the sky (tap down twice to land), and the flight camera is dependable, though I sometimes got disorientated from having to quickly spin the camera around while fighting more agile winged enemies. Combat moves are as simple as holding down the R1 button and tapping on the face buttons or d-pad to quickly switch between sword skills and magic attacks. Combined with a block and dodge action, I quickly fell into an overly comfortable rhythm of slash, dash, blast, block, and dodge over the course of the 20-hour single-player adventure. For The Birds At first it was all brainless fun: I gleefully wrecked skeletons and griffons on the battlefield and in the air. I loved owning hostile NPCs in one-on-one duels. I enjoyed gliding through the clouds and smashing strange, batlike creatures. Sometimes I was just happy to take in the view from atop a floating island. The graphics arent exactly cutting edge, but looking down on monsters and NPCs from above was a refreshing perspective. After four or five hours, though, I got bored. Dungeons and enemies all look alike, and Alfheim Onlines seven locations arent big or interesting enough to explore in detail. Combat gets to be a mind-numbing affair: theres no real sport in standing in a corner and sniping a dragon with fireballs and ice arrows. Nothing special about utterly decimating a hydra with a 16-hit sword combo. By the time I turned up the difficulty to compensate, I already knew the limited enemy types attack patterns, so it didnt matter that they hit harder. And since magic and stamina are tied to meters that regenerate slowly over time, I never had to worry too much about running out of either for very long. I just had to keep dodging and weaving enemies until my meters refilled. Even flying got to be a snooze, due to an annoying altitude limit placed on my heroes for the first half of the story. It was only when I completed a later quest and the ban was finally lifted that I felt a real sense of joy gliding over sunny meadows and frozen tundras, but that wasnt enough to make the campaign worth sticking around for. A Tedious Tale Lost Song presents Sword Art Online fans with an original story not found in the series, but its not that great. It retcons the awful second story arc in the Sword Art Online anime, but instead of replacing it with something exciting and meaningful it presents us with.well, nothing really. Theres a mystery involving a group known as Shamrock and their adorable leader Seven, but since theres no real reason for Kirito and his group to get involved in their affairs, unravelling the mystery is pretty dull. On top of that, the story makes no effort to properly introduce any of the characters, so if I hadnt already been familiar with Sword Art Online, I might have been massively confused about who these people were were and how they were all connected. Your pretty teammates are much more useful in battle than they are as conversationalists, where they can use their skills and spells to help Kirito fight off baddies. Lost Song allows you to mix and match any combination of over a dozen playable characters into one three-party team, and a flexible customization feature means weapons and skills can be swapped out while in town. It temporarily injected a little life back into the combat, but with that said, I found it easier to just stick with a small handful of team members, as upgrading equipment and buying armor can be resource intensive and pretty expensive. Lost Songs saving grace is its well executed multiplayer. It allows you to team up with up to three other people in co-op or versus mode and is easily accessible via the town inn. I had no trouble connecting online and syncing up with other Sword Art Online fans, and I enjoyed coordinating attacks against rock monsters and harpies in co-op mode. Plus, I got a real kick out of testing my skills against other players in one-on-one duels  it puts the combat system to much better use, since humans arent nearly as predictable as Lost Songs repetitive enemies. Pros Fun multiplayerEasy and intuitive controls Cons Recycled enemies and dungeonsBoring storyFlight limitations Its dangerous to go alone into Sword Art Online: Lost Song. The single-player campaign is paper thin, combat and enemies are repetitive, and the fan service kept to a minimum. On the other hand, adding other players to the mix lets you find the fun in its smooth controls, coordinating attacks against hordes of enemies, and tough competitive duels.", "date": "Nov. 17, 2015,"}