{"name": "Sword Coast Legends", "name_review": "Sword Coast Legends Review", "ref": "https://me.ign.com/en/sword-coast-legends/112676/review/sword-coast-legends-review", "text": "Tacking a loaded word like ~legends~ on the title of any game is a risky prospect, but Sword Coast Legends really shot itself in the foot. After all, it's set in the renowned Forgotten Realms universe of Dungeons & Dragons, the same one that spawned near-legendary cRPGs like Baldur's Gate II and Neverwinter Nights. And that's why it's such a letdown. It clearly knows the lore and it sprinkles its roughly 30-hour campaign with a cascade of in-jokes, but squanders that legacy on unfulfilling combat and a weak dungeon master mode. I can't deny I enjoyed the overarching story, which follows a guild of adventurers as they try to find out why everyone's out to kill them. The voice acting, while serviceable, occasionally leaves an aftertaste reminiscent of a daytime soap opera with its unpolished delivery, and the repetitive kill 'n' fetch quests venture too frequently into clich, but I nevertheless admired the way Sword Coast Legends sprinkles a bit of humor into its proceedings in stark contrast to the dour musings of a game like Pillars of Eternity.Wait N Slash All of this might have been acceptable disappointment had the combat filled in some of the blanks left by the campaign. Thats where Sword Coast Legends' greatest hope for longevity was, as it features four-player drop-in, drop-out Dungeon Crawls and a Dungeon Master mode that theoretically lets you craft your own campaigns. In practice, it falls even shorter. The rules at play here technically derive from D&D's fifth edition, but Sword Coast Legends makes massive departures from that legacy by implementing enemy scaling and ditching D&D standbys like resting and skill books for mage classes, out of what appears to be an overemphasis on accessibility. In action, it plays something like a halfway point between the frantic action of Diablo III and the pause-heavy tactics of Pillars of Eternity. As it turns out, that's not a good place to be. You can pause (unless disabled in multiplayer Dungeon Crawls, as it is by default), but the strategies you find in Sword Coast Legends are so simple that it's only necessary in tight spots. Abilities are few and chosen from short skill trees (with most of the branches merely amounting to more powerful versions of previous spells), and cooldowns are many. In the field, that leads to big spurts of violence from two or three abilities, followed by sloggy waits while the hero doles out tedious autoattacks in preparation for the next cooldown to finish. Sometimes the enemy's already dead by the time that happens. It's a setup that grows boring fast, and it doesn't help that some enemies have massive health pools that get even deeper on higher difficulties. In frustration, I eventually just cranked it down to Easy mode  not because it was hard, but because it was boring and I wanted it to end sooner.The Quest for Good Quests A robust Dungeon Master mode for user-generated content possibly could have alleviated these concerns, but Sword Coast Legends fails at this, too. On the one hand, its editor is certainly a model of intuitive simplicity. I'm one of those people who was intimidated by Neverwinter Nights' popular module creator back in 2002, but I could see my younger self using Sword Coast Legends' creator to make a serviceable dungeon in a matter of minutes. I'm having trouble remembering Sword Coast Legends' dungeons a mere eight hours after playing one.The problem here is that there's not much you can do with it besides generate the same boring kill-and-fetch quests that make up the campaign. You can customize the look and actions of certain monsters, but it's always stuff you would have seen in the campaign proper. As a result, all the currently listed player-created dungeons have an unfortunate samey flavor. It's a problem that player-generated dungeons in Cryptic's D&D MMORPG Neverwinter struggle with as well, but at least there the missions have the benefit of fun combat and more customizable zones. I still remember some of Neverwinter's player dungeons fondly; I'm having trouble remembering specific details of those from Sword Coast Legends a mere eight hours after I last played one. Other annoyances include a default but changeable setting that makes characters constantly yell out things like ~Okay!~ with every movement, and occasional overlaps of on-screen interface elements that make it difficult to click on loot acceptance menus. Pros Decent storyBeautiful environments Cons Weak dungeon creatorBoring combatLinear campaign On the whole, Sword Coast Legends usually works, but thats all I can say for it. Theres an obvious love for the lore on display, but there are no Minscs or Boos here; no thrilling battles where victory springs as much from brains as endurance. The great tragedy of Sword Coast Legends is that the last couple of years have all but paved the way for it to emerge as the best of the cRPG renaissance, but its dull cooldown-based combat, linear quests, and cookie-cutter user-made content ensure that it's likely to be among the first to be forgotten.", "date": "Oct. 28, 2015,"}