{"name": "Call of Duty: WWII -- The Resistance", "name_review": "Call of Duty: WWII - The Resistance DLC Review", "ref": "https://me.ign.com/en/call-of-duty-wwii-the-resistance/143414/review/call-of-duty-wwii-the-resistance-dlc-review", "text": "Call of Duty: WWIIs first major DLC pack is made up of five maps; three standard multiplayer maps (one remake), one War Mode map, and a Zombies chapter. While the latter is The Resistances heftiest addition, the new standard maps add needed variety to the multiplayer suite. Meanwhile, the new War Mode map is just more of the same  which is mostly a good thing. (Read the full Call of Duty: WWII review here.) Of the new standard maps, Valkyrie is the smallest. Shotguns, a well-timed grenade, and the new Resistance Division class (included with a free update launched alongside a neat community event) excel on this map. Valkyries square layout has less defined lanes, which makes it more fun to explore while hunting down enemies. All the intersecting corridors provided great tactical options, especially for Kill Confirmed. I used one particular corridor to my advantage by leaving an unclaimed dog tag on the ground as bait, luring several enemies from different paths into a single room. That one tag turned into three, though I paid for it soon after by staying in that spot too long. Totally fair. I rarely saw firefights confined to one part of Valkyrie, though. Spawn points were able to adjust accordingly to the constant movement on this map. My favorite map of The Resistance is Anthropoid. Its a long map thats well suited for snipers, but its not open enough to feel like I didnt have options to escape players with excellent rifle skills. Instead, Anthropoids three lanes are laced with side passages, pillars, cars, and other obstructions that allow for smart flanking. Its an especially good fit for Domination, though its size makes it a little less friendly for Team Deathmatch. Anthropoid's three lanes are laced with side passages, pillars, cars, and other obstructions that allow for smart flanking. The third map, Occupation, is a remake of the Resistance map from Call of Duty: Modern Warfare 3 with a fresh coat of paint. Like Valkyrie, Occupations lack of a three-lane design makes hunting enemies more of a gamble, which is refreshing since a few of WW2s maps already cover that style. Its also a good, medium sized map that favors weapons with a little more range. And though its not part of The Resistance DLC itself, its worth commending developer Sledgehammer for running its free community event alongside the DLCs launch to celebrate the new maps with bonus XP, the new Resistance Division, and new uniforms and other gear included in a special supply drop. The new War Mode map, Operation Intercept, is the least interesting part of the DLC, though thats not to say its bad. Its more of what I expected from War Mode, which is good, but it feels recycled because two of its three objectives for the Allied team already exist in the original three War operations. I was hoping to see something that would build on this incredible new mode, but Intercept wasnt that. The map is congested, but there are some clever design choices that allow smart players to chuck grenades into many of Intercepts narrow objective points to effectively clear out the area. Still, I generally felt like I had more space to work with playing on the Allied team, and it felt too easy to win on that side as a result. Only after finding a headless corpse strapped to an even bigger door did I finally have a clear objective. The Nazi Zombie story continues on an island filled with tunnels, secret rooms, and plenty of undead. Darkest Shore offers more obscure puzzles than the first, and while the challenge is welcome, the Easter egg campaign requires either a human or online guide unless you have a ton of time and endless patience to solve its mysteries. After mowing down zombies on the disgusting beach my team landed on, I opened a door. And then another. And another. Only after finding a headless corpse strapped to an even bigger door did I finally have a clear objective, though finding the solution to that puzzle was far from obvious. I wound up spending my first few runs providing cover fire while learning from more experienced zombie players, which I still enjoyed. The Darkest Shore has a new Saw gun that was especially fun to use once it reached its full potential. I was partial to using the Saw against Darkest Shores new spider zombie, which tried to escape its second death by crawling along the walls and ceiling. The new map also features waves of fog that made seeing more than a few feet in front of my character nearly impossible, though it wasnt much of a hindrance as soon as I ran into one of the islands many tunnels. Both the fog and tunnel system made communication with teammates without mics a little more frustrating, though. I lost teammates more than once and frantically searched for their characters outline somewhere on the screen. It didnt always show up, and sometimes I couldnt even figure out what level they were on, though I got better with that as I learned the map. The Resistance DLC adds needed map variety to multiplayer and introduces another fun Nazi Zombies map. The tighter, dense map Valkyrie gives the new Resistance Division a chance to shine with plenty of close combat opportunities, while Anthropoid offers snipers space to work their magic. Even though Operation Intercept is a new map for the wonderful War Mode, it feels like a known quantity with its repeated objectives from previous operations. On the other hand, the new Zombies map Darkest Shore has plenty of challenging (if sometimes convoluted) puzzles to uncover.", "date": "Feb. 8, 2018,"}