{"name": "Tales of Zestiria", "name_review": "Tales of Zestiria Review", "ref": "https://me.ign.com/en/tales-of-zestiria/112284/review/tales-of-zestiria-review", "text": "I think of the Tales series as RPG comfort food. It reliably delivers cheerful characters, a story anchored in friendship, and a unique brawler-tinged spin on RPG combat. Tales of Zestiria is no exception, but the big shift to an open world and some flashy new combat moves makes it pleasantly different from its predecessors. The first and most welcome change is its open world. Zestiria removes the pen that once confined us to narrow corridors of trees and bushes and lets you freely journey through a nice variety of locations that include green pastures, sand-swept deserts, and gloomy swamps. This gives Zestirias world a sense of immersion that some of its more linear predecessors lack. Treasure chests and stat-boosting herbs found throughout a typical Tales world are still there, but I like that Zestiria also includes Normin: cute little critters tucked away in hidden corners that grant special skills to equipment. There are also Lords of the Land, helpful deities that let you do things like fast-travel and replenish treasure chests if you establish a good enough rapport with them. These are all nice rewards for putting on your wide-brimmed fedora and venturing through the landscape. Downer Dungeons The one hiccup in the world design is the linear dungeons. Theyre short and contrived, with right-angled corridors and bland, monochromatic walls. Puzzles are used as cheap padding to make some dungeons appear longer or more complex than they really are. The prize for worst puzzle goes to the Water Temple, where eyes in the walls teleport you all the way back to the entrance if they see you. Though some of these puzzles include the clever use of map actions like burning spiderwebs with fire magic or using wind to teleport across gaps in the floor, most just feel like a chore. Luckily, dungeons feature fantastic music, which helps alleviate some of the tedium. The Wind Temple theme is particularly impressive with its soaring strings and heavy drumbeats. Theres also a nice variety of enemies: killer starfish and aggressive elephants require different strategies to defeat, which prevents battle fatigue from setting in. A Zest for Combat Like the world map, the series traditional Linear Motion Battle System combat has had some new life breathed into it. Characters still dole out pain on an enclosed field by using physical and magical actions known as Artes (which can be chained together in brawler-type combos), but the new Armitization feature ratchets up the fun by allowing protagonist Sorey and his human companions to fuse with their seraphic friends and become powerful entities on the battlefield. The Armitized character designs are wonderfully over-the-top (think capital A anime), and its amusing to watch my heroes unleash spells like Ocean Blitz -- a pinwheel torrent of water resembling a hose turned on full blast --on enemies. This doesnt mean that going super Saiyan on enemies is always the right approach. Zestiria does a nice job balancing the scales of combat by binding Artes to a series of gauges that, when depleted, must be refilled before you can use your skills again. Artes are also tied to a clever rock-paper-scissor mechanic that encourages you to adjust your battle plan according to an enemys particular strengths and weaknesses; no mindless spamming allowed. Getting ready for combat is almost as enjoyable as combat itself. Zestirias customization is fairly deep, which makes dressing for battle fun. Each piece of equipment has four skill slots, three of which can be filled however you see fit, and items of the same type can be fused together to create powerful pieces that sport new and better skills that can be used in battle. I enjoyed mixing and matching my inventory and getting varying results, a process made easier by a skill sheet that shows you different ways to stack or arrange your skills for maximum benefit. A Forgettable Tale I wish I could be as enthusiastic about the story, but alas, I found it to be pretty weak. Despite an intriguingly cynical view on the human condition (some people are evil because of the strength of their convictions, not because theyre possessed by demons), the story never truly deviates from the typical trope of young country boy is tasked with purging the world of malevolence. The cast of characters also lacks a certain spark. Aside from the ever-earnest Alisha and the spunky, effervescent Rose, Zestirias heroes are fairly forgettable. It doesnt help that the pace of the last act is dragged down by a lot of unnecessary backtracking. Zesitias handy teleportation system is constantly disabled to force you to hoof it from one end of a giant map to the other. Its a royal pain, made worse when its all just to watch a 10-second cutscene that could have been triggered in a more efficient and enjoyable manner. Having to traverse giant maps on foot is rough, but the good news is time flies a bit faster when playing with friends. Like in previous Tales, Zestiria features a local only four-player multiplayer option, something I think more RPGs should have. I had a good time coordinating attacks with my friends, even though the zoomed-out camera sometimes made it hard to see and character movements looked choppier than when playing alone. Pros Open-world mapArmitization featureDeep customization Cons Bland story and charactersLinear dungeons Tales of Zestiria the X's second episode serves as a substantial improvement over the premiere, making up for lost ground in character development and striking the perfect balance between heavy drama and lighthearted fun. While the beautifully designed characters are a wonder to behold, the added CGI effects make for an uneven visual experience that mars an otherwise well drawn series.", "date": "Oct. 19, 2015,"}