{"name": "Sid Meier's Civilization: Beyond Earth -- Rising Tide", "name_review": "Civilization: Beyond Earth - Rising Tide Review", "ref": "https://me.ign.com/en/civilization-beyond-earth-rising-tide/112123/review/civilization-beyond-earth-rising-tide-review", "text": "Civilization: Beyond Earth (review) is a lot like if you ordered a pizza without mushrooms, and they brought it out with mushrooms. So they bring it back out with an expansion of extra cheese and better crust and throw in some bacon bits, but those mushrooms are still on there. Make no mistake: Rising Tide enhances a lot of things, like diplomacy, exploration, and affinity choice, leaving Beyond Earth a better game than its ever been. It just does very little to resolve the limited replayability that is the central cause of this being a relatively weak Civilization game. Improvements are notable. The overhauled diplomacy system, for starters, is the best its ever been in a Civ game of any stripe, and makes the largest positive impact of any new feature. Each leader now has a Respect and Fear value associated with every other leader, which serves as an excellent, two-axis barometer for how they are likely to treat you and their rival AIs. This is augmented by selectable personality traits like Imperial, Industrialist, and Cultured, which provide bonuses to your whole civ, can be swapped or leveled up at an expenditure of the new Diplomatic Capital resource, and will influence how you are seen by other leaders based on how your traits align or clash with the traits they chose. Diplomatic Capital can come from buildings and tile improvements, but also from making diplomatic agreements. These treaties between leaders give a bonus to the initiator of the agreement Youre required to have a web of incoming and outgoing agreements to stay in the green, which creates a system that meshes together tightly and opens up new avenues for gameplay while making diplomacy an essential cornerstone to almost any playstyle. Other marked improvements include the ability for your explorers to discover artifacts at dig sites or when pillaging alien nests. This works a bit like a collectible card game and can unlock some very powerful bonuses for your civ, such as +2 movement speed for all workers. It increases the incentive to explore every corner of the map and keep building explorers into the late game. Rough Seas It feels odd to criticize an expansion that does everything it set out to do really well, but the fact is that Rising Tide reinvigorated Beyond Earth for me for around four campaigns, and now that Im through with those, I dont know that Ill keep it installed much longer. I think that has something to do with the fact that, like with the vanilla version of Beyond Earth, each campaign didnt feel different enough from the last. Even with the addition of two interesting new biomes  a Hoth-esque ice world and a fiery lava-world, each of which includes its own quest chain and subtle modifications to alien behavior  I feel like Im watching the same movie with a set change rather than a new production. Thats in comparison to the high standard of Civilization 5, where each game feels like Im building a new story of a totally new world. Ironically, Beyond Earth lost some of that when transplanting the setting to alien planets, and the features Rising Tide adds do little to address are some of the main culprits. The story-based victory conditions, for instance, are still only exciting the first time you complete them. Aside from military Domination, the way you achieve them is basically the same every time. And moving so much of the visual flair, unique units, and feeling of technological progression into the Affinities makes it feel like there are only three versions of history to play through. The sense of seamlessly witnessing thousands of years of human progress remains painfully missing. Half & Half A slight balm for this is the new Hybrid affinities, which let you play Harmony/Supremacy, or Purity/Harmony, or Supremacy/Harmony, as opposed to being forced to purely specialize in one to gain access to the best military units. Theres a small grab bag of unique units that can be unlocked this way, and many of them serve interesting combat niches that didnt exist before. The Purity/Supremacy Drone Cage can serve as a mobile healer, and Harmony/Purity gets a unit that can buff friends and debuff allies. But the hybrid paths are not nearly as fleshed out as the core Affinities, and youll still be using a lot of the same units youre familiar with from the base game from one branch or the other. So rather than having an armload of civs to choose from that all feel and play distinctly as in other Civ games, Firaxis has added three options to an existing three, for a total of six. The civs themselves - even the new ones that come with Rising Tide - just arent different enough, with bonuses that are quickly washed out by affinity and leader personality choices just like their base-game predecessors. The North Sea Alliance has the most unique playstyle of the lot, getting big bonuses to using the new floating cities. Said cities are, unfortunately, one of the more underwhelming new features despite the whole expansions name being a reference to them. Being mobile, they allow a few interesting strategies such as snatching up late-game resource tiles only when they become important, and parking a string of offensive fortresses near an enemys borders. But their only methods of acquiring new tiles are sailing around or purchasing hexes individually. Waiting for culture to expand your borders, something I always enjoy watching play out because it creates a visible representation of progression while simultaneously automating a mundane micromanagement task, isnt an option. It needs a truly fun mechanic to justify the additional clicks, and theres nothing to prop it up here. Pros Diplomacy systemArtifactsHybrid Affinities Cons Annoying floating citiesLacks replayability Rising Tide is a well-crafted expansion with some great ideas: the new diplomacy system is a marvel of strategy game design, and artifacts and hybrid affinities serve to reinvigorate the late game with new bonuses and tactics. But unfortunately, the biggest issue facing Beyond Earth is its lack of variation from game to game, and that remains unaddressed. After just a few games, I already feel like Ive seen most of what it has to offer.", "date": "Oct. 8, 2015,"}