{"name": "Moss: Book 2", "name_review": "Moss: Book 2 Review", "ref": "https://me.ign.com/en/moss-book-ii/196327/review/moss-book-2-review", "text": "After the originals cliffhanger ending, finally returning to Mosss storybook world was a wonderful and long-awaited treat. Who wouldnt want to assist an adorable mouse in VR, helping them take down fearsome bosses and overcome platforming challenges in order to save the world? Moss: Book 2 wastes no time, kicking off moments after the first games ending and then building upon much of what made it so memorable, even when the aging PSVR tech its currently confined to cant quite keep up.While Id suggest playing Moss first (its only a few hours long and very good), Book 2 still manages to be a welcoming sequel for newcomers. Told like a fairy tale, it has you controlling both a mouse named Quill and the human-sized Reader flipping through her story yet again, this time as shes hunted down by a winged tyrant called Tylan. Like before, this isnt necessarily the strongest story, but its a follow-up that at least improves on other aspects like worldbuilding. Youll learn more about Cinder Night, the event where Arcane forces brought Quills kingdom to heel, and theres an interesting but underdeveloped cast who bear mental scars from that tragedy. Book 2 intrigued me with its late-game revelations and, once again, I found myself wanting more. Developer Polyarc evidently listened to previous criticism, so it at least doesnt end on a total cliffhanger this time, but theres definitely space left for a follow up too.Quills goal is to find the glass shards she needs to stop Tylan, hopping her way through a ruined castle, a garden conservatory, arctic mountains, a steel foundry, and more to do so. Of course, we all know its never that straightforward. Youll frequently get interrupted by Arcane minions blocking our path, which Quill and the Reader will have to defeat in often drawn-out fight sequences. Book 2 expands the previous roster of mechanical beetle enemies with new foes, like an armored shell variant which can only be cracked open with a special weapon. Theres also an unfortunate creature known as a ripper, who the Reader can fling like a pinball directly.Combat will be quite a familiar scene for anyone who played the original, but Polyarc has expanded Book 2 with a few new options. Previously, Quill only had a sword, but that returning weapon is joined by two new choices: a hammer and a chakram. Your hammer hits hard but is slow and unwieldy like many heavy weapons in other games. As for the chakram, it offers a quick and light approach better suited for taking out weaker enemies in large numbers. Your sword lies somewhere in between. Armored shells and certain late-game bosses aside, combat doesnt usually necessitate the use of one particular weapon or another, which provides a welcome flexibility that will suit different combat styles.New weapons provide a welcome flexibility to your combat style.Polyarc also factored weapon abilities into platforming too, giving Quill additional powers through alternative means. Holding down the attack button will charge her currently equipped weapon, and then physically moving your controller to touch it will let you activate its special ability as the Reader. For example, the sword lets Quill dash across gaps that a standard jump would never make, slicing up enemies in her path along the way. The chakram can embed into walls, and then be called back like a boomerang to hit otherwise out of reach obstacles. Finally, you can place a mirror image of the Hammer over enemies or a switch, dropping it as the Reader when necessary. I really enjoyed this fusion of platforming and combat. Not only does it elevate combat beyond simply swinging a sword, puzzles also use each ability creatively, so you cant just rush through and hope for the best.The Reader has their own abilities too, letting you interact with Quill as a separate character in this world  one shes fully aware of. Your path while controlling Quill is often blocked by puzzles, requiring the Readers direct intervention to advance. That can be simple tasks like triggering Quills special attacks like previously mentioned, or more hands-on jobs like moving blocks and dragging enemies onto switches by using the Dualshock controllers gyro sensor to point at them. The Reader also has a few fresh abilities, like creating climbable vines in certain spots or dragging others across the screen to create bridges, giving you inventive new methods to overcome these challenges.Puzzle solving is cleverly used to build up your relationship with Quill, too. Book 2 focuses more on your interactions with her, like high fiving after a job well done, seeing her pretend to surf as we move a platform shes standing on, or even just giving her a hug. Its one of Book 2s most heartwarming aspects, and I found an emotional journey here I didnt expect. Being able to grow the relationship between Quill and her Reader partially through level design on its own is a testament to its strength.Book 2 doesnt always feel fresh in those designs, though, with many of its new mechanics not arriving until youve cleared at least the first hour. This is thankfully a longer adventure than its predecessor  it took me just under six hours to complete, and thats without entirely exhausting my search for its collectible fragment scrolls, which are a compelling enough reward for thorough exploration. While the campaign is entirely linear, you can switch chapters at will and backtrack to find any collectibles you may have missed, some which are even inaccessible until youve secured those new weapons later on. Book 2 doesnt take unnecessary risks with its already successful formula, instead opting for an evolutionary approach, and that's absolutely fine. This is as pure a sequel as they come, without large changes that could ruin what I loved about the original or major innovations that could have instead elevated it far beyond. Crucially, Book 2 didnt need to reinvent the wheel to be a lot of fun, and it gave me what I wanted most from the first game: more.This sequel feels held back by the PSVR's aging tech.Unfortunately, this sequel also feels held back by the PSVRs aging tech. It mightve been a revelatory headset in 2016, but six years later with a successor on the way, its extremely dated. Having played Moss on PC with an Oculus Rift S, this felt like a step back in terms of the quality of its interactions. It requires a DualShock 4 thanks to that controllers light bar, meaning theres no option to use the PS Move controllers or the PS5s DualSense if youve opted to play through backwards compatibility. The DualShock controls feel fine when moving Quill around each level, but direct interference as the Reader is a different matter.Using the DualShock lacks the immersion provided by full motion controls that VR thrives in  admittedly, something the PS Move controllers arent comparatively very good at anymore even if they were available. The PlayStation cameras field of view also proved limiting as grabbing objects that were further out didnt always track accurately, an infrequent but frustrating issue when it occurred. Dont get me wrong, its still functional, but I just couldnt escape the feeling that Book 2 occasionally had to compromise its design around these limitations. Heres hoping the PSVR exclusivity comes to an end before too long, like it eventually did for the first Moss.Book 2 at least still feels polished and Polyarc clearly put significant detail into this world despite the constraints, telling its story through a mix of in-game moments and storybook cutscenes you can flip through at your own pace. Like before, Mosss audiobook-esque approach to voice acting is a delight, with the narrator putting on different voices for other characters while still being recognisably them. Its a charming approach that kept me interested, capturing the mood of Book 2s more emotional segments well.This sequel also boasts a greater level of variety, both thematically and in design. Every world I explored was well detailed and wonderfully colorful, making full use of the third person gameplay to explore levels with a 360-degree view. This isnt something that could be easily replicated in a non-VR game, and Polyarc encourages you to get up off the couch to hunt around using your VR headset and search each level for hidden secrets. More often than not, the collectibles youll find are well worth standing up for. Moss: Book 2 is an exemplary sequel that provides more of what I loved about its predecessor. Building upon the original with new weapons, clever puzzles, and a vibrant storybook setting, the premise remains entertaining four years later even if none of those additions truly try to innovate on it. Its exclusive availability on the PSVRs now noticeably outdated tech holds it back more than anything else, so Im hoping itll make the jump to PC or Meta Quest in the coming months like the first Moss eventually did. But even with a Dualshock 4 in-hand, I still had a wonderful time revisiting this world and I cant wait to see what Polyarc does next.", "date": "April 7, 2022,"}