{"name": "Tony Hawk's Pro Skater 5", "name_review": "Tony Hawk’s Pro Skater 5 Review", "ref": "https://me.ign.com/en/tony-hawks-pro-skater-5/111935/review/tony-hawks-pro-skater-5-review", "text": "Tony Hawk's Pro Skater 5 occasionally flirts with the joy of movement and attitude that made the original four games classics, but the wheels quickly come off. There are a disappointing number of design and technical problems that range from frustrating to flat-out broken, making this attempt at returning the series to glory a non-starter. Developer Robomodo started with a good idea: paring Tony Hawks Pro Skater back down to the basics of the series. You won't be hopping off your board, exploring open worlds, or standing on a weird piece of plastic. Instead, Pro Skater 5 leaves you to test your ability to chain together tricks, manuals, and grinds, much like classic Hawk. It almost works. At times, I found myself getting back into that familiar rhythm that made me fall in love with the original games. I had moments of zen that balanced the combination of learning the maps, memorizing your move set, and the risk-reward of when to pull out of a chain. Grinding To a Halt But any of that nostalgia was quickly erased by Pro Skater 5's frustrating interface, bland levels, and jagged edges. For example, the one major addition to your arsenal is a physically impossible slam move that sends your skater rocketing down to the ground at the press of a button. The problem here is that slam is mapped to the same button as grind, and it cant be changed. I cant count the number of times I intended on continuing a combo with a grind, only to accidentally slam down to the ground and end the chain. Frustrating moments pulled me out of my groove far too often. But the most glaring thing that consistently thwarted my attempts to enjoy Pro Skater 5 were the rampant performance issues. Its appallingly rife with glitches, hiccups, and collision disasters, which are particularly noticeable in a game thats primarily about how the human body interacts with the world when traveling at high speeds. Far too often, I witnessed my character pass through geometry instead of slamming into it, fly straight up into the air as though hed stepped on a spring trap, or fall on the ground for no apparent reason. Half-Baked Pipe Also, though Tony Hawk 5 is ostensibly an online game, I don't recommend playing it that way (or at all, really). The addition of a dozen other players skating around your map slows the framerate down, adds to load times, and doesn't really introduce any interesting social elements. I found myself playing offline in order to have a smoother experience. But smoother is a relative term, because even then, menus don't convey enough information and load screens pop up far too often, killing momentum in what should be a fast-paced game. Classic Tony Hawk attitude is the other big thing I miss in Pro Skater 5. Starting at the soundtrack, a seminal part of previous games, this ones music doesnt pay homage to the west coast hip-hop and punk scene from the past four decades in the same way that the originals did. I consider myself pretty well-versed in music, and yet I was hard-pressed to find more than a handful of bands I even recognized, let alone liked. Apart from the music, the levels generally lack any sort of charm or identity. Many are a hodgepodge of elements from classic maps like The Warehouse, but none of them really stand on their own as memorable. Even worse is that many of the trick lines arent conveyed in a effective manner. There aren't enough visual cues throughout the levels to give you confidence in your next move, and I found my character obscuring my view far too often, making it impossible to see what was coming up next. Inside each stage there are a dozen or so challenges pulled from a pretty boring pool of tasks, like destroying 10 thingies or grinding for an eternity. You choose these from a list, but it's annoying that you don't know what the challenge is before you load into it, especially given the fact that there's no way to easily quit one and go back to the level if you decide you dont want to do it. You either have to wait for the timer to run down, or pop all the back out to the main menu. This makes hopping between challenges a legitimate chore. Aside from unlocking more levels, completing these challenges adds to the ways you can customize your characters. I liked the aesthetic options, especially nods to other games like Octodad and Ratchet and Clank. Unlocking a new head or costume is a great little moment -- and theres something appropriate about skating around dressed as Octodad, whose humor is based on being a clumsy character whose limbs defy the laws of physics, in a game as prone to glitchy chaos as this one. On the flip side, earning stat points and upgrading my riders abilities seemed completely pointless. I honestly couldnt tell the difference between controlling a vanilla character without any stat boosts, and a fully upgraded one. The earlier Pro Skater games had a really great sense of progression throughout the campaigns, and that sensation is completely absent in Pro Skater 5. Pros Octodad! Cons Bland levelsControl problemsBugs, bugs, bugsJanky menus Tony Hawks Pro Skater 5s rare moments of nostalgic joy are drowned out by its abundance of poorly thought out levels, control problems, bugs, and its glaring lack of attitude. It boggles the mind that a $60 game in 2015 can be riddled with so many technical issues.", "date": "Oct. 3, 2015,"}