{"name": "LEGO Dimensions", "name_review": "LEGO Dimensions Review", "ref": "https://me.ign.com/en/lego-dimensions-1/111865/review/lego-dimensions-review", "text": "There came a moment when Marty McFly, Chell from Portal, and The Wicked Witch of the West were all fighting a giant robotic Joker atop a building in Springfield when I stopped and wondered just what the heck was going on. But then again, I was having a complete blast watching it all happen. LEGO Dimensions is developer Travelers Tales first foray into the toys-to-life genre, which is a natural fit for its virtual versions of physical LEGO. While the gameplay itself is still relatively simplistic, the personality that runs through each and every world is the reason to stick around. This is the kitchen sink approach: throughout the 10-hour campaign, youll bounce from the settings of classic movies like Back to the Future and beloved comics like Batman to amazing games like Portal. Like in the charming LEGO Movie, these collisions are fun, creative, and rife with hilarious, idiosyncratic interactions. Small moments, like how Homer Simpson is so very confused at the fact that Scooby-Doo is a talking dog, are Dimensions greatest strength. With the starter pack, youll get to play through the entire campaign with Batman, Gandalf, and Wyldstyle from The LEGO Movie. While theres a satisfying amount of game there, youll need to opt in and buy the additional sets in order to unlock some of the best open-world side areas. Wandering around a fully realized Springfield complete with dozens of hilarious nods to the show, or going through Aperture Science with the original voice actors and some really great, actually Valve-esque puzzles is a treat, but not mandatory. Test Your Pop-Culture IQ The love and care given to packing those worlds with cute, clever nods -- falling off the map in Oz drops you down into a sepia-colored version of tornado-wrecked Kansas -- made exploring those spaces a joy. Its even better when Dimensions mashes two universes together, like when Sauron from Lord of the Rings goes on a tear through Supermans Metropolis, or when serious LEGO Batman meets the idiot Batman from The LEGO movie. Travelers Tales fantastic brand of Pixar-esque humor can make a kid laugh while simultaneously layering on more nuanced jokes aimed at adults, and it had me smiling throughout most of my time with Dimensions. A particularly great moment was when Batman travels to Oz and is convinced that the Scarecrow from the classic movie is the same Scarecrow that has terrorized Gotham City. The problem with Dimensions leaning so heavily on in-jokes from its breadth of inspirations is that if youre not as familiar with a specific movie, show, or game, entire sections fall flat. For example, when I spent a half hour fighting through a series of Ninjago bosses, I couldnt appreciate the humor and instead had nothing to prevent me from noticing how simplistic the combat and puzzle-solving in Dimensions really is. A solid chunk of the enjoyment directly correlates with your love of a specific movie or game and your ability to understand and appreciate deep-cut references. What youre actually doing moment-to-moment will feel incredibly familiar to anybody whos played any of the past dozen or so LEGO games  which isnt bad, but has worn a bit thin over the years. You destroy everything in sight, build a whole bunch of crazy structures, and collect millions of bolts that act as currency. Do the LEGO Shuffle The big change with Dimensions, though, is the physicality introduced through the toys and the portal that you connect to your console. Any LEGO Dimensions character or object you place on one of the portals seven positions is transported into the game world. Note: Its actually just the disc on the bottom that matters (which is a little scary because of how easy itd be for a kid to lose it). The characters are just regular LEGO dudes. Dimensions quickly begins throwing simple but tedious puzzles at you that require physically manipulating the toys on the portal. Bosses will trap your character in an energy field, forcing you to move that piece to another square on the board. Likewise, certain puzzles require you to place specific characters on specific spots in order to imbue them with elemental powers necessary to put out fires or charge batteries in the environment. While I really appreciate this idea in theory, it oftentimes didnt work for me in execution. Puzzles didnt challenge me mentally, but rather just became physical exercises in moving a toy onto a new spot of a specific color. They were never quite deep enough to deliver that aha! moment you get from thinking about a problem in a new way, and instead, just acted as a barrier between me and the next piece of much-appreciated humor or creativity. Pros Creative worldsGenuinely funnyTons of personality Cons Dull puzzlesObscure in-jokes LEGO Dimensions kitchen-sink approach to packing its worlds full of great characters and fun references consistently left me with a big dumb grin on my face. While the puzzles that required physically moving the pieces became tedious, the act of exploring dozens of locations based on things Ive adored since my childhood was genuinely entertaining. The collision of worlds is smart, the references are handled with care, and the story is genuinely smart.", "date": "Sept. 30, 2015"}