{"name": "Lovers in a Dangerous Spacetime", "name_review": "Lovers in a Dangerous Spacetime Review", "ref": "https://me.ign.com/en/lovers-in-a-dangerous-spacetime/111515/review/lovers-in-a-dangerous-spacetime-review", "text": "Lovers in a Dangerous Spacetime's bright, colorful look and eccentric title may make it seem like frivolous nonsense, but as with the best relationships, there's deeper stuff at play here than outward appearances show. It's a game that's as much about co-dependency as cooperation, and it manages to impart its lessons with a mere six hours of its unusual take on frantic space-shooter action. That may sound like it's only enough time for a one-night stand, but I found it's also plenty of time to fall in love. Since it seemed appropriate for the material, I decided to play Lovers' offline-only ~couch co-op~ mode with my wife. This was a risk: I'd heard stories about how the juggling of duties involved left some best friends throwing up their hands in disgust with one another, and here I was gambling the future of almost nine years of happy marriage by exposing us to such frustration. But our story has a happy ending, because were a good team, she and I. Within 15 minutes, we'd gotten the hang of it and we were bobbing our heads to its catchy and relentless techno soundtrack and chanting ~Space bunny! Space bunny in space!~ while saving said bunnies. Sure, at times it was difficult  even ridiculously so  but the finesse with which we handled the ensuing trials convinced me that what we have is, in fact, love. And I thank you for that, developer Asteroid Base. Lean on Me It's not a cooperative game in the vein of, say, Super Mario Bros. or Gauntlet, where part of the fun is rushing to grab items before your partners; instead, it puts you and your only partner (or pet, if you must play solo) in charge of running a ship that's designed to be controlled by seven people. Looking at a 2D cross-section of the initially spherical ship, the novel layer of challenge comes from dashing between stations to use the function you need at that moment: gun ports at each of the four cardinal directions, a map room for locating kidnapped space bunnies, a machine that rotates a small shield around the ship to block incoming fire, and a powerful ~Yamato cannon~ that uncontrollably spins around the vessel (and thus requires perfectly timed blasts for effectiveness). And then, of course, someone needs to drive the thing by rotating the engine around the sphere and activating the thrust, taking care to avoid Lovers' many obstacles. That sounds like a lot of work, because it is. Successfully navigating through Lovers' four chapters (over around four to six hours) demands that you work well with your partner and decide whose skills are best suited to which tasks, and in the case of me and my wife that meant that I generally drove the ship and manned the upper and left cannons while she handled everything to the right and bottom. (We played on PC, with me on the keyboard with modified keybinds while she used my Xbox 360 controller. It worked well.) The workstations are far enough apart  and separated by Donkey Kong-style ladders  to make reaching them feel intense, but smartly placed enough that I never felt as though something was in my way. Our orders to each other in the tiny space around my PC mirrored the frantic action unfolding in the little ship onscreen, and I always found comfort in knowing that she'd perform her tasks with skill. Herding Space Cats In what must be a cheeky commentary on single life, if you lack a local co-op partner (theres no online option, sadly) you can also bring along an AI dog (Doppler) or cat (Kepler) to fly solo. They're surprisingly intelligent and capable most of the time, considering the hell Lovers throws at the ship, and ordering them to different workstations is easily accomplished by bringing up a scrollwheel map of the ship (which slows the action) and sending them on their way. Most of the time, they'll play fetch well. Need a button blasted to open a door or need the Yamato cannon switched on? They'll generally do it right. And yet I found a real person on board was always better. Aside from lacking the real-world goofiness that comes from sharing a game with a friend or loved one, the pets cant simulate the mix of competency and fallibility of a person. Theyre either too efficient at some tasks, or inept at others. To cite but one example, I once needed my cat to shield the ship from lasers as I passed through them, but the dumb cat failed to rotate the shield to protect the rear of the ship, causing me to take way more damage than I shouldve. My wife wouldn't have let that happen, and it felt like a bug. Meanwhile, theyre terrifyingly effective killers when manning a directional laser. Still, it's never boring. Lovers in a Dangerous Spacetime has wonderfully varied levels, for one, which send you off to do everything from fighting bosses based on constellations to protecting your hyperdrive as interdimensional creatures try to nibble at it. Adding to the fun are a wealth of upgrades, which include everything from speed boosts to augments that replace your guns with wrecking balls that shoot chargeable lasers. You lose all of these goodies in the transition from chapter to chapter, but that's not a problem since finding the upgrades again constitutes much of the fun. Pros Varied level designMany ship upgradesSmart AI companionsClever co-op concept Cons Several difficulty spikes A few difficulty spikes threaten to spoil the colorful, effervescent fun in Lovers in a Dangerous Spacetimes frantic cooperative 2D-shooter action, but its novel core emphasis on relying on coordination with another player or an AI partner to overcome such challenges is usually strong enough to overcome the occasional frustration. As a bonus, diverse level design and multiple fun powerups help maintain variety.", "date": "Sept. 16, 2015"}