{"name": "No Escape", "name_review": "No Escape Review", "ref": "https://me.ign.com/en/no-escape/110772/review/no-escape-review", "text": "As a taut family thriller, No Escape bears a passing resemblance to 2012's The Impossible, about a tourist family caught in the destruction of a tsunami. But in the latest film from director/co-writer John Erick Dowdle (Quarantine, Devil), the destruction is purely man-made, as an American family find themselves in the middle of a violent political uprising and must seek asylum in a city where foreigners are being executed on sight. While both films are intense, emotional and harrowing, neither are quite able to capture the true impact of complete cultural ruination. However, unlike The Impossible, No Escape cleverly sidesteps any mention of exact events or locations, which gives it a little more creative freedom -- although the implication here is that it takes place somewhere in Cambodia. (The film itself was shot in Thailand.) Anyway, the geography is not important. What is important is the story, which follows engineer Jack Dwyer (Owen Wilson), his wife Annie (Lake Bell) and their little girls Lucy (Sterling Jerins) and Beeze (Claire Geare). Originally from Austin, Texas, Jack has been sent by his company to Southeast Asia to work on a project that will bring clean drinking water to the country. But the morning after the Dwyers arrive, Jack literally gets caught in the crossfire of a bloody insurrection and has to protect his family long enough to find safety. As Jack, Owen Wilson plays against type in a rare dramatic role, but he pulls off the seriousness and urgency his lead part demands. At the same time, he's able to bring levity to the quieter scenes, where Jack is meant to comfort his daughters with dad humor. Meanwhile, Lake Bell is also known for her comedic roles (In a World..., Children's Hospital), but she really does a great job playing the devoted mother and distressed wife. Unfortunately, her character doesn't get as much to as Wilson's, but she does have a few moments towards the end that make up for that. Weirdly, the marketing for No Escape makes it look like an action-thriller, something along the lines of a Taken or even this summer's San Andreas. In actuality, there are probably more scenes of the family hunkering down in hideouts than running from enemy fire. As a result, most of the ~action hero~ moments go to co-star Pierce Brosnan, who shows up as a brash and bearded Good Samaritan -- like James Bond, but with an Aloha shirt instead of a tux. Not surprisingly, the former 007 steals every scene he's in, though his screen time is ultimately short. Really, the focus here is on the family overcoming impossible odds, not Wilson's character rising up to become the next badass Liam Neeson (or Brosnan, if you like). But because the film does aim to be more of a pseduo-prestige drama (again, not unlike The Impossible), the expectations are higher. Unfortunately, No Escape doesn't quite reach that level of quality, mainly because it has no interest in giving a voice to the Asian characters or exploring their completely valid outrage -- most of which, by the way, stems from the Western colonialism Jack's company hopes to rectify. Regardless, the film delivers constant tension, emotional highs and plenty of good, white-knuckle moments. Pros Thoroughly intenseWilson and Bell's performancesBrosnan's grizzled altruist Cons Narrow perspective While lacking in cultural scope, No Escape succeeds in nailing the vicious atmosphere and believable family dynamic. These are aided by stars Wilson, Bell and Brosnan, who all turn in strong performances. If you can look past its hands-off approach to a very real issue, Dowdle's thriller offers a tight, exhilarating and brutal look at one American family's escape from a savage coup d'tat.", "date": "Aug. 26, 2015,"}