{"name": "Tembo the Badass Elephant", "name_review": "Tembo the Badass Elephant Review", "ref": "https://me.ign.com/en/tembo-the-badass-elephant/109703/review/tembo-the-badass-elephant-review", "text": "With its charmingly kooky story, and art direction that bursts with personality, Tembo the Badass Elephant makes a great first impression. The first couple of simple, breezy levels hint at a formula that could build to something memorable and masterful by the end. Though, as you might expect from a lumbering war elephant, Tembo stumbles a bit along the way with finicky controls. This platformer retains its joyful sense of levity throughout, but its level designs never really ramp up to much more than a good time. Right from the jump, Tembo exudes an airy, Saturday-morning-cartoon vibe. Our heroic paramilitary pachyderm drops down into each new level with a satisfying thud and a triumphant trumpeting of his trunk, signaling the start of some wanton environmental destruction. The first couple of levels have you tromping freely through walls, husks of old cars, and enemy tanks alike as if they were made of LEGOs; all this destruction is conveyed very well, with a comic book style bada-bada-bada wafting into the air with each step of Tembos charge, and destructible parts flying everywhere. The opening levels feel very cleanly designed around the controls, too. Theres a clearly identifiable rhythm, which allowed me to achieve a speed run-esque fluidity; the kind of meter Sonic games reach for, but seldom achieve. This is an elephant who knows how to make an entrance. But past these early levels, that rhythm breaks down in a variety of ways. It would be harsh to say the early momentum is squandered, but Tembo doesnt exactly build on it as the six-hour campaign lumbers on. Awkwardly spaced jumps, random hits from off-screen attacks, and enemies that force you to play a more measured game of pattern recognition bog down the pacing with increasing regularity through the second and third acts. There are moments when that early rhythmic zen returns, but its usually unceremoniously stamped out shortly after. Granted, Tembo is by no means bad when it slows down; its just considerably less fun than careening through levels with reckless abandon, which happened less and less frequently as I went. Note that some of those six hours were spent replaying levels since, somewhat annoyingly, some levels are locked until youve killed a certain number of enemies in each stage. The controls play into the stop-and-go pacing too. Everything feels responsive and enjoyable when youre dashing in a straight line, butt-stomping through buildings and goring anything that gets in your way. Once the levels start calling for more careful platforming and the application of slide kicks, uppercuts, and water shooting, however, Tembo can feel as clumsy as an elephant on a conveyor belt. Jumps alternate between feeling slow-moving and overly floaty, or too shallow and too long depending on whether youre dashing when you leave the ground. Partially due to that inconsistency, stringing together all the different possible actions into anything cohesive rarely works the way it seems like it should. Almost everything has a wind up or some recovery time after, so it never feels like a slick, continuous flow of action. Still, this staccato feel doesnt prevent Tembo from being enjoyable; its just hard not to envision how much better it could have been with a few tweaks to maximize the high points and minimize the lows. One second youre barreling through everything in sight and having a blast, and the next youre stopping and backtracking to kill every last enemy so you can unlock the next level. The two dont exactly complement each other, and one is clearly more enjoyable than the other. Pros Charming personalityBreaking stuffSome great levels Cons Stop-and-go pacingFinicky controls Tembo the Badass Elephant wants you to smile, and often, I did. Its charismatic protagonist, and the joy of stomping around and wrecking shop with him never got old, though the controls and level design would sometimes do as much to dampen the fun as facilitate it. Though it doesnt always allow you to play it the way it seems to beg to be played, it still manages to be enjoyable overall until the credits roll.", "date": "Aug. 2, 2015,"}