{"name": "Tiny Tina's Wonderlands", "name_review": "Tiny Tina's Wonderlands Review", "ref": "https://me.ign.com/en/tiny-tinas-wonderlands/195844/review/tiny-tinas-wonderlands-review", "text": "Shoot thousands of goblins in the face with a flaming crossbow, throw gigantic meteors at gross anthropomorphic mushrooms, and hang out with a queen horse thats literally made out of diamonds. Thats Tiny Tinas Wonderlands in a nutshell, and if that all sounds like a reskinned Borderlands 3, its because it is. But that doesnt end up being such a bad thing! The excellent writing and stellar voice acting performances combine beautifully with the twisted and insane FPS mayhem to create something extremely memorable. This fantasy twist on the Borderlands formula delivers the adventure I dreamt of playing ever since playing the Borderlands 2 DLC that inspired it, and although it very much plays it safe in a lot of ways, its been an absolute blast so far.Tiny Tinas Wonderlands is an outrageous, fantasy-infused spinoff of the OG looter shooter and a direct follow-up to the Borderlands 2: Tiny Tinas Assault on Dragon Keep DLC from 2013. As a game within a game, Wonderlands has you playing through a simulated tabletop roleplaying campaign called Bunkers and Badasses, a sort of alternate-reality Dungeons and Dragons that replaces generic fantasy tropes with absurdity, gratuitous violence, and tons of guns regardless of whether theyre setting-appropriate or not. But thats the magic of this larger-than-life looter-shooter RPG, which throws caution to the wind and embraces chaos and nonsense in favor of ludicrous and memorable moments.The best thing about a Borderlands game is I know Im going to laugh as I loot, and Wonderlands is no exception. The excellent, laugh-out-loud writing is elevated by one of the strongest comedy casts of any game, with Ashly Burch returning as the loveably obnoxious Tiny Tina, Will Arnett as the main bad guy, Andy Samberg as the over-eager dumb party member, and Wanda Sykes as the rules-obsessed player. Across the board the voice acting and comedy writing are better than theyve ever been in this series, and even without all the action-packed looting and shooting the adventure would be worthwhile just for the memorable characters and hilarious moments.The excellent laugh-out-loud writing is elevated by one of the strongest comedy casts of any game.Theres a mission where you try to figure out how to remove a characters impenetrable plot armor, another where the characters get way too suspicious about a background character in a blue hat, and another where you straight-up kill a bunch of Smurfs. The shenanigans never cease, and fans of tabletop roleplaying (like myself) will find plenty of references and inside jokes that are catnip for veteran dice-rollers.That said, even while the tomfoolery is ever-amusing, the main story ends up being one of the weaker parts of the package. The pattern in Borderlands games to date has been that the dumb dialogue and silly sidequests obscure an over-arching story thats actually quite good, with characters we care about and moments of genuine emotion and shocking twists. I kept expecting Wonderlands to follow the same format, but instead it turns into a pretty predictable race towards a big bad guy you need to defeat before the credits roll. The fact that the whole adventure takes place within a game being played by Borderlands characters which has little to no impact on anything leaves the proceedings feeling pretty frivolous rather than innovative or subversive and not quite up to the standards the Borderlands series has set. But man, its still so dang funny.What We Said About Borderlands 3If Borderlands 3 is what happens when a modern looter shooter doesnt concern itself with the longevity of its item economy and daily quests then you can sign me up for Borderlands 4 right now. Being untethered from persistent servers and able to trade loot at will is a refreshing change of pace, but thats hardly the only reason why this such an amazing co-op FPS. The sheer magnitude and diversity of its arsenal of fun and surprising weaponry is unmatched, and the striking amount of loving detail and variety packed into its energetic and replayable 30-hour campaign is what makes Borderlands 3 a high-point for the series  and the genre as a whole. - James Duggan, September 9, 2019Score: 9Read the full Borderlands 3 reviewOf course, most people come to Borderlands expecting a whole heck of a lot of guns to play with, and Wonderlands does not disappoint in that regard. Per usual, youll find thousands of variations of randomly generated weapons with silly and insane perks, like an automatic crossbow that feels like ye olde machine gun or a shotgun that turns into a fireball you throw at an enemy when it runs out of ammo. The transition from over-the-top science fiction to over-the-top high fantasy has surprisingly changed very little about the way Borderlands feels to play, though there are some notable exceptions such as grenades being replaced with much more interesting spells and ultimate abilities shifting to a more magical flair, like summoning giant tornadoes of ice. Other than that the differences are largely cosmetic changes to combat, so Borderlands fans should feel right at home in the Wonderlands.The similarity to Borderlands 3 is good news in that combat in Wonderlands is generally fantastic, with crazy-looking enemies, challenging boss fights, and so much insanity happening on-screen that oftentimes your screen looks like a rainbow puked into a tornado that exploded into a hundred smaller tornadoes. The sliding, shooting, and casting in Wonderlands is a seriously good time. The downside of all that chaos is that its sometimes difficult to know whats even happening; more than once I died and found myself thinking Mkay, not sure what killed me there. But at least it looked cool!It changes so little from Borderlands 3 that I felt like I'd played it all before.The only other real gripe I have is that it changes so little from Borderlands 3 that even with the setting being completely different I felt like Id played it all before in the decade of time Ive been enjoying the series already. For example, the Goliath enemies that have been around since Borderlands 2 have the very specific behavior of entering a rampage if you shoot their heads too much. Once enraged, they run around attacking everything and every time they score a kill they evolve into a more powerful monster. In Wonderlands theres an enemy called the Cyclops that behaves almost identically. Thats not to say that there arent any surprises, but the amount of reskinned or reused enemies and ideas definitely made me raise an eyebrow on more than one occasion.One major thing Wonderlands does change is swapping out static and distinct character classes for a system thats much more fluid, for better and for worse. Rather than choosing one class represented by a single character with a specific roster of abilities, youll instead make your own and pick from a list of six stripped-down character classes that you can mix and match down the road as you unlock your second skill tree. Now you might find you have some abilities in common with someone who picked a different class, which is in stark contrast to past games where each class has a unique role in the combat meta. Thats a good thing because it means you can make your character class your own, but a not-so-good thing because it makes classes feel samey when youre playing with a full squad of four. Wonderlands also adds a charming overworld where instead of running and gunning in first-person, you walk around a map as a cartoonish avatar exploring the world and finding new activities and side quests to complete. Its easy to navigate, and discovering new areas and unlocking new pathways in this silly board game landscape is a great and inspired way to break up the fast-paced combat and explosions with dumb gags, like one part where youve got to get past a cheese puff thats been dropped onto the board by Bunker Master herself. Unfortunately, it also enables one of my least favorite parts of the Wonderlands package: combat encounters.This silly board game landscape is a great and inspired way to break up the fast-paced combat and explosions with dumb gags.These are a completely underwhelming new feature that sticks you in a claustrophobically small arena and throws some randomly generated monsters at you until you fill up a murder meter, earn some loot, and move on. Youll run into these bland little battles while exploring the overworld, as filler during part of a side quest, or even in the endgame, which uses it in a horde mode. The main issue I have with combat encounters is that unlike most of the Wonderlands campaign, where youre exploring a large hub world and looking for hidden loot and secrets to discover, these things stick you in a box and essentially put you on a timeout until youve killed enough things. Its unimaginative filler that only succeeds in throwing a wet blanket onto a formula that didnt need slowing down.Worse yet, combat encounters oftentimes spawn enemies so slowly that you end up waiting for more baddies to appear so you can fill up the kill meter, especially if youre dealing a lot of damage and/or playing with friends. It doesnt help that these scraps feature the same enemies you encounter over the course of the campaign and so offer no surprises  just more of the same bad guys youve already killed a hundred times before.And then, when you finish the story after around 20 hours and unlock Wonderlands primary endgame activity, The Chaos Chamber, youll discover its basically just a variation on combat encounters. Thats a bit of a disappointment, but thankfully it works a bit better as an endgame activity, owing to its high degree of difficulty and roguelike mechanics thrown in to make things more interesting  not to mention its definitely the most rewarding activity from a loot and XP perspective. Speaking of endgame content, Wonderlands has quite a grind available for those looking for more to do. Not only is there a nigh-limitless pool of loot to chase, but Myth Ranks, which allow you to over-level your character and unlock unique buffs, give you quite a mountain to hike up if you arent finished smacking people in the face with an enchanted frying pan. I dont think that The Chaos Chamber endgame mode will be enough to keep me grinding for long after the campaign, but with at least four pieces of DLC announced by Gearbox already, its good to know that my leveling and min-maxing wont go to waste if I decide to stick with it. Tiny Tinas Wonderlands is a fantastic fantasy take on Borderlands tried-and-true looter shooter formula. As spin-offs go, it sticks dangerously close to its past successes which at times felt a bit unoriginal and some of the new stuff it tries, like procedurally generated combat encounters, didnt pan out terribly well. Luckily, the excellent writing, hilarious performances from an all-star cast, and ridiculous combat continue to shine brightly and make this tabletop-inspired explosion-fest absolutely worth your time.", "date": "March 23, 2022"}