{"name": "Game of Thrones: Episode 5", "name_review": "Game of Thrones: Episode 5 - A Nest of Vipers Review", "ref": "https://me.ign.com/en/game-of-thrones-episode-5/109262/review/game-of-thrones-episode-5-a-nest-of-vipers-review", "text": "In one very significant way, Game of Thrones Episode 5: A Nest of Vipers is exactly what Ive been waiting for in Telltales series. Because theres only one episode left after this, the gloves have come off. We get to make big life-or-death decisions that will have major impact on the outcome of the story, instead of the usual decisions where all choices end up taking us back to a common point. Here in the home stretch, every decision I made felt much more powerful. That couldve made this an outstanding episode... if not for repeated fumbles, including several scenes that feel like padding, some starkly out-of-character behavior, and one part that forgets Rodricks supposed to be crippled. A Nest of Vipers story picks up right where the last episode left off, with Ramsay Snow revisiting Ironrath to dish out more of his trademark brutality. As much fun as it is to hate such a sadistic villain, all of Rodricks vows of revenge against him feel ineffectual and impotent  because of his Ramsays role in the main Game of Thrones story, any confrontation between him and the Forresters could only end one way. It makes me wish he werent so directly involved. This episode also reveals the identity of the traitor within House Forrester  and their motivations  as determined by your choices as Rodrick. That sounds great, but the way it worked out for me didnt make a lot of sense based on that characters prior actions. Telltale didnt do a good enough job of sowing seeds of doubt about the loyalty of Rodricks advisors to make it feel plausible, and as a result it felt randomly determined and arbitrary. Miras part in this episode is small, but its made interesting by strong interactions with both Cersei and Tyrion Lannister as shes once again forced to play a part in the battle between the siblings. As always, its fun to try to figure out how to please Cerseis twisted morality, and Peter Dinklage sounds more comfortable with the delivery of his voice acting than before. Meanwhile, north of The Wall, Gareds story makes little or no actual progress toward his goal of finding the North Grove. His segments fill that void with a pretty good action scene and a sympathetic backstory for Cotter and his sister. Some weird bow-and-arrow controls messed up a hunting scene for me, though  by the time I figured them out, my prey had already escaped. In Meereen, Ashers story takes a turn for the cliche after an uncharacteristically dishonest move by Daenerys. (Telltales writers just dont seem to understand her; shes portrayed as honorable to a fault in the novels and the show.) That thrusts him into more combat, but it does introduce some colorful new characters as he meets some potential new allies. What really saves A Nest of Vipers in the end is how dramatically it sets up the sixth and final episode with a major choice that absolutely will have a huge, game-changing effect on the finale - the kind that makes me want to replay again just to make sure I have a saved game with the alternate path. That alone makes A Nest of Vipers a worthwhile episode. Pros Powerful choicesCersei and TyrionGame-changing ending Cons Out-of-character behaviorUntouchable villain The potential of powerful, story-altering choices is largely blown on an episode full of out-of-character portrayals and padding scenes that dont move us any closer to the finish line. Miras interaction with Cersei is a highlight, and the ending is a huge choice that makes the whole episode feel replayable, but the penultimate episode of Telltales season isnt the climactic high point were used to from HBOs series.", "date": "July 22, 2015,"}