{"name": "Rory McIlroy PGA Tour", "name_review": "Rory McIlroy PGA Tour Review", "ref": "https://me.ign.com/en/rory-mcilroy-pga-tour-xbox-one/109016/review/rory-mcilroy-pga-tour-review", "text": "After taking 2014 as a gap year, EA Sports PGA Tour series has returned with a new cover athlete, a rebuilt game engine, and a more flexible approach to its control system. Unfortunately far too many concessions appear to have been made in order to accommodate these changes, and with its flimsy career mode, malnourished roster of licensed players and courses, and a glaring absence of fundamental game types, Rory McIlroy PGA Tour is a disappointing release that just barely manages to make the cut. Its a shame too because Rory McIlroy PGA Tour gets off to a great start. The Prologue that opens the game does an excellent job of introducing the three new control systems. Youre given the option of choosing between a classic three-click swing timer, and two variants on the more contemporary analogue thumbstick-based setup  one a simplified system augmented with arcade-style power boosting and aftertouch spin controls, the other a more realistic method with all assists turned off and a more sensitive reception to the aim and velocity of your swing. I especially like how you can heavily customise each of the three mechanics to suit your own skills; I ended up settling on the latter more realistic setting only with the putting path aid toggled on (because my short game is terrible). This is a golf game that allows the player to effectively determine their own handicap, as opposed to 2014s The Golf Club which had a more unrelenting focus on serious simulation. The Prologue also introduces you to the new Frostbite 3 engine-powered courses, which look appreciably superior than the links of the last generation  even if some of the textures are a little flat and a lot of the course features tend to pop in around the path of the balls flight. The new open world nature of each course also eliminates the load times between holes, and means poorly placed shots can now be played from out of bounds rather than incurring an automatic stroke penalty as before, which adds to the realism. However its not long after the games opening  an exciting race to first place in the dying stages of the US Open interspersed with insightful words from McIlroy himself  that the cracks begin to show. From the very first glance at the games main menu its clear that Rory McIlroy PGA Tour is substantially light on features compared to the last gen Tiger Woods games. Stacked up against the two-year-old Tiger Woods PGA Tour 14, the new game has roughly half the number of courses to play on, about a quarter of the licensed players to choose from (with both the Legends and the female LPGA players gone entirely), and a create-a-player tool that ditches the customary eyebrow shaping and body sculpting of the older game in favour of a handful of set templates that are almost guaranteed to look absolutely nothing like you. Things get even worse when you step into the career mode. What should be the real meat of the single player experience is staggeringly undercooked. Gone is the steady rise to the PGA Tour via amateur competitions. Absent is the option of playing pre-tournament practice rounds to earn additional XP. Removed are the conditional objectives for fast-tracking your progress, such as winning a set number of tournaments in a season. Instead, you just get shunted from one tournament to another with no schedule to indicate whats on the horizon beyond your next competition, and if you manage to win a tournament your prize is a static, text-based congratulations message with no trophy room to show off your spoils nor indication of how much prize money youve actually earned. Indeed its telling that the career mode defaults to a quick round setting, reducing each tournament to a select handful of holes per round rather than the full four rounds of 18; its almost as though even the game knows youll want to get this over and done with as fast possible. Certainly if a professional career in golf was really this unrewarding and directionless, Rory McIlroy would probably have set his sights on a Masters in Accounting rather than the one in Augusta. Outside of the career mode the feature cull continues. You can play with your friends both locally and online, but you no longer have the ability to start your own Country Club in order to help foster a community. Even worse, the only game types available to you both online and off are stroke play and match play. Standard alternate modes like Skins, Best Ball, Battle Golf or Bingo Bango Bongo? Features that have been standard issue for the series since Tiger Woods was still fresh faced and free from tabloid scandal? You can forget about them, and enjoy the memory of that hole in one you just aced because theres no longer an in-game option of replaying it either. The only noteworthy addition to the PGA Tour experience is the Night Club Challenge, a power-up packed arcade mode that feels as though it was designed with a mobile gaming audience in mind, right down the the three star score objectives for each of its holes. There are some 170 challenges on offer and plenty of exaggerated Mario Golf-style add-ons such as nitrous boosts and portals to keep things interesting. Yet while steering a ball through neon-lit checkpoints like a remote-controlled car might be fun, its certainly not golf. Pros Customisable control setup makes the gameplay more approachableNight Club Challenge mini-games provide good arcade fun Cons The career mode is a featureless, uninspiring flopThe licensed course and player list is reduced dramatically from previous gamesBasic game modes are absent Rory McIlroy PGA Tour is solid enough out on the course but its just lacking too many of the series fundamentals to make it worthwhile for golf fans. Concessions are often made when sports games straddle the gap between console generations old and new, but considering the two year wait for a game that is only being released on current gen hardware (and PC), the rampant slash and burn of its feature set is particularly galling. EA Tiburon has managed to create a golf game with plenty of holes in it; just not the kind that fans will relish. Rory McIlroy PGA Tours tagline, Golf without limits, seemed enticing in the lead up to the games release. After experiencing everything this cut-down series reboot has to offer, the message just comes across as sarcastic.", "date": "July 14, 2015,"}