{"name": "Tales from the Borderlands -- Episode 3", "name_review": "Tales from the Borderlands Episode 3: Catch a Ride Review", "ref": "https://me.ign.com/en/tales-from-the-borderlands-episode-3/108233/review/tales-from-the-borderlands-episode-3-catch-a-ride-review", "text": "Tales From the Borderlands Episode 3: Catch a Ride contains some of the funniest scenes Telltale has ever written. It sets up its fantastic characters, both familiar and completely new, in a handful of tense situations, and the chess board of Rhys, Fiona, and company's long con expands to a galactic level to present tough choices, satisfying outcomes, and compelling mysteries throughout the course of this two-hour chapter. Catch a Ride takes all of the major players from the first two episodes and forces them to collide within the opening minutes. Your ragtag crew, Hyperion suits, violent crime syndicates, and even a handful of Vault Hunters all engage in a series of Mexican standoffs that had me questioning my mission, my friends, and even myself. Of course, throughout all of this, Telltales spot-on humor comes through in spades, especially when it comes to your dialogue decisions. I kept finding myself stuck between a handful of decisions both because I wanted to see where the story would go and because I knew that each option would yield varying, always hilarious results. In a rare feat for Telltale, Catch a Ride unfolds quite a bit differently depending on whether you chose Fiona or Jack at the end of Episode 2. We get completely different scenes and interactions that made me really enjoy playing through it a second time. Much of the episode separates the characters into two core groups, which allows Rhys and Fiona to grow as people in some really substantial, player-defined ways. My Rhys has always been a bit of a Han Solo-esque scoundrel  yeah, he does some less-than-admirable things, but he ultimately has a heart of gold  so watching him open up and legitimately fall for someone in a series of scenes that deal with the early stages of a crush in cute, genuine, and embarrassing ways left a big dumb grin on my face. Likewise, Fiona's slow realization that she might have what it takes to be a legendary Vault Hunter, while simultaneously dealing with the choice of whether she even wants that from her life, defined her character in ways I didnt see coming. After the credits rolled on this episode, Im even more curious to see how the pair of them make their way to the present-day framing story. A chunk of Episode 3 takes place inside a gorgeous geodesic dome filled with some really beautiful scenery. I appreciated moments where I could wander around a moonlit grove and explore the alien, luminescent plants, as well as the fantastic payoff that came from underestimating Pandoras natural flora. The setting is a sharp contrast from the barren deserts and filthy factories that have housed most of the scenes in Tales from the Borderlands so far. The unexpected highlight of Catch a Ride is Gortys, who in the span of a single episode, became possibly my favorite character in any of Telltales modern series. Her sweet, naive nature is completely juxtaposed with the harsh realities of Pandora, which makes every single one of her interactions amazing. From the strange existential interactions with her mechanical kin Loader Bot, to the hilarious ways she deals with her first brush with mortality, Gortys is exactly the kind of foil that Tales needed. The only major thing in Episode 3 that didnt impress me were the action scenes that fell at the beginning and end of the chapter. Telltales best action to date came in The Wolf Among Us, when the brutal fights were just held between two people. On the flip side, Borderlands action comes across as just too chaotic for Telltales sometimes rickety game engine. The transitions stuttered, the framing of the fight was oftentimes incomprehensible, and I found myself failing a handful of times simply because I didnt realize that the game had handed control back to me in the middle of a brief QTE. Obviously, the Borderlands universe is one punctuated with violence, but the underwhelming action scenes really feel at odds with the quality of Telltales humor and storytelling. Pros HilariousEmotional momentsGreat setupGortys! Cons Action scenes The closing moments of Tales from the Borderlands Episode 3: Catch a Ride leave the characters Ive grown to genuinely care about over the past six hours in some incredibly precarious situations. Lives are in balance, the bad guys have the upper hand, and the final reveal of where the series is headed left me eagerly awaiting where Telltale takes us in Episode 4.", "date": "June 24, 2015,"}