{"name": "Halo: The Master Chief Collection  ODST", "name_review": "Halo: The Master Chief Collection – ODST Review", "ref": "https://me.ign.com/en/halo-the-master-chief-collection-odst/107457/review/halo-the-master-chief-collection-odst-review", "text": "Its easy to forgive Master Chiefs absence from a DLC addition to Halo: The Master Chief Collection when that addition is the still-phenomenal Halo 3: ODST. The 2009 standalone side story follows the post-crash tale of The Rookie and his decidedly-not-Spartan ODST teammates in the wake of a failed drop during Halo 2s Covenant attack on New Mombasa, and it is memorable for being a tonal near opposite to Master Chiefs bombastic adventures. Where Chiefs Halo games are loud and fast, ODST is deliberately  and delightfully  quiet and slow. Where other Halo games soundtracks sometimes break out electric guitars, ODST reaches for the piano, resulting in a moody, memorable jazzy score. Half of ODST takes place at night, as the silent Rookie investigates the daytime exploits of his fleshed-out ODST friends: Buck (who, incidentally, has been upgraded to Spartan-IV status for Halo 5: Guardians), Dutch, Mickey, Romeo, and Dare  with those daytime flashback missions being playable complements to the Rookies nocturnal quests. The pendulum swings create a wonderful narrative pace and structure thats alien to the linear experiences of the other Halo shooters to date, even if the story is rushed into with an un-sexy wall of text. And because youre not a biologically and mechanically enhanced super soldier, that pace of the action is decidedly slower. The action and world benefits from a boost to 1080p and 60 frames per second, but I couldnt help but notice disappointing framerate dips during larger battles and the comically exaggerated and antiquated animations of the marine grunts. Youre free to wander New Mombasa, which affords the opportunity to discover secrets like supply caches from the mysterious Superintendent AI as well as the fascinating Sadies Story: a series of audio logs hidden around the city that follow a young woman as she navigates the city freshly in the wake of the Covenant invasion. It adds weight and relevant context to what happened in the game world. Its easy to get lost in the big open city though, even with waypoints popping up in the HUD. Almost all of ODST is spent alone, and that isolation helps create fear and tension  feelings aided by the fact that your distinct lack of superhuman skills makes your Covenant foes much scarier than they are when youre inside Master Chiefs MJOLNIR armor. The VISR  a sort of night vision mode that also helps identify key items like weapons, enemies, and waypoints  adds to ODSTs dark and moody vibe in a positive way. This simply feels different and distinct from Master Chiefs Halo gameplay. Pros Pacing and narrative structureMoody soundtrackSadie's Story Cons Easy to get lost in hub worldFramerate dips during big battles Whether or not you have to pay for it (depending on when you purchased Master Chief Collection), Halo 3: ODST is every bit worth playing for the first time in 2015 as it was in 2009. Its an example of what else Halo is capable of doing as a first-person shooter.", "date": "June 11, 2015,"}