{"name": "The Evil Within: The Executioner", "name_review": "The Evil Within: The Executioner Review", "ref": "https://me.ign.com/en/the-evil-within-the-executioner/106853/review/the-evil-within-the-executioner-review", "text": "The Evil Withins final story DLC takes the main games survival-horror genetics and throws them away in favour of a more conventionally violent, first-person action experience. Its an odd choice, considering stealthy challenge and originality were such highlights of The Evil Within, and while The Executioner is a fun and rather cathartic change of pace, its missing something special. The Executioners three-hour story places you in the shoes of The Keeper, The Evil Withins wonderfully weird box-headed bad guy. But while you may look the part, youre merely a man inhabiting a Keepers body, searching for your lost daughter inside The Evil Withins multiple-consciousness system, STEM. Theres an elegance to this storytelling. An ongoing issue Ive had with The Evil Within is its tendency to cram exposition in where its not needed, breaking up the flow of the gameplay. But your Keeper is a silent protagonist, and goes about his business with single-minded focus and little interruption from the outside world. This gives the father/daughter story real room to breathe, and its to developer Tango Gameworks credit that I got a little choked up at the end. The means by which you pursue your daughter, however, is fairly unimaginative. Though the idea of playing inside The Evil Withins world as a hammer-wielding maniac is a novel one, in practice you and your blunt hammer are overpowered against weak enemies, and the lack of challenge - without the visceral thrill of combos - grew dull in far less than three hours. Its a problem made worse by structure, as The Executioner pits you from boss battle to boss battle with a focus on very basic melee combat. Even when one strongly suggested I switch up this technique to something a little more inventive, I found that bashing its head in was a far more effective means by which to get the job done. The Executioner at least offers a multitude of unlockable weapons for all this bloodletting. I enjoyed the upgrade system here, primarily because it offered a little variation in combat, though I would have preferred to have access to some of the more interesting weapons - Im looking at you, rocket launcher - earlier. The world sets an appropriately bloody stage for carnage. The Evil Within has always reveled in viscera, but The Executioner takes things to a somewhat ridiculous level. Upgrading, for example, involves you plunging your hand into a safe full of guts, while you can teleport from one spot to another by tearing your own head off in a single bloody jerk. It feels like Tango just threw up its hands here, and it adds a sense of fun to The Executioner. But without challenge in a horror game, is fun enough? Pros Elegant storyAll-out gore Cons Repetitive gameplayLack of challenge While theres some catharsis to be found in The Executioners overabundance of violence, combat simply isnt exciting or interesting enough to single it out from any number of first person horror games. A briefly entertaining addition to The Evil Within, then, but not an essential one.", "date": "May 29, 2015,"}