{"name": "Game of Thrones: Episode 4", "name_review": "Game of Thrones: Episode 4 - Sons of Winter Review", "ref": "https://me.ign.com/en/game-of-thrones-episode-4/106741/review/game-of-thrones-episode-4-sons-of-winter-review", "text": "This action-heavy episode does a great job of breaking Telltales Game of Thrones out of its various rutts. Though Miras time in Kings Landing is shorter than usual, everyone else picks up the slack as we see Gared finally embark on his journey north, Rodrik break the cycle of abuse by the Whitehills, and Asher work to gain the favor of Daenerys Targaryen. Sons of Winter opens with Gared in custody and facing severe punishment after having killed Britt, the former Bolton soldier whod murdered his family, at the end of Episode 3. I was annoyed that theres no way to convince the Nights Watch that Gared had acted in self defense, even with an eye witness corroborating his story (I tried this a few times). Naturally this is the kind of forced outcome were all used to in Telltales games, but in this case the writers seemed to go out of their way to make it feel implausible. Those events are a means to a good end, though, as they lead to Gared setting out to find the North Grove. Running across a pack of Wildlings creates one of several good action scenes in this episode. (Slight spoiler: though theres a White Walker in the title screen image for this episode, none actually appear. Thats a bit of a tease.) Ashers scenes are also pleasingly action-heavy, beginning with his audience with a strangely hostile Daenerys Targaryen. I enjoyed having more dragon screen time, since Telltales done an excellent job of animating them, but their writers dont quite have a knack for the style that makes the Mother of Dragons come off as strong yet benevolent. The effort to earn her trust embroil Asher, Malcolm, and Beskha in the siege and capture of Mereen, which is the setting for the biggest action scene of the series so far. Using a combination of stealth and combat to help Daenerys sellswords subdue the city while the slaves revolt works well with Telltales simple action mechanics  the stealth segments feel more like a traditional stealth game, in which you must time advances while guards arent looking. What makes Ashers segments more interesting than simple stabbing, though, is that we get to learn more of Beskhas backstory, and decide whether to help her to settle unfinished business in Mereen at the cost of potentially angering Daenerys. It gives her character considerably more dimension, though given the bond between her and Asher its hard to believe he wouldnt already have known this about her. Miras relatively small part in the story takes place almost entirely at a party following King Tommen Baratheons coronation, where she tries to learn more about the Whitehills plot against the Forresters. It simulates the experience of an old-school adventure game puzzle in which you have to eavesdrop on conversations and build up some information to know how to squeeze information out of your targets, though its so superficial itd be difficult to do anything but that. The one big decision youll make here is whether to betray Saras trust in order to get what you want, which is tempting if you enjoy burning bridges as much as possible. Where things really get interesting are back at the Forrester keep of Ironrath. After two episodes of repeatedly challenging us to see how much abuse well force Rodrick to endure at the hands of Griff Whitehill and his soldiers, we finally see him able to go on a satisfying offensive. The resulting confrontation with Lord Whitehill is a tense hostage-negotiation showdown, and though its a bit over-eager to evoke the events of the Red Wedding, it comes together by rewarding some optional environmental exploration for intel on the Whitehills. Some of it is undermined by the ending, which while effectively ominous, felt a bit like a reset button for the biggest developments. Pros Hostage negotiationsLots of actionBeskha's backstory Cons Irrational Night's WatchWeirdly angry Daenerys Not everything makes sense - like the Nights Watchs irrational anger toward Gared or Daenerys uncharacteristically hostile mood - but major developments and long-awaited action push Telltales Game of Thrones: Episode 4 - Sons of Winter into position as the best episode yet.", "date": "May 27, 2015,"}