{"name": "incognita", "name_review": "Invisible Inc. Review", "ref": "https://me.ign.com/en/incognita/106208/review/invisible-inc-review", "text": "Even though every mission boils down to basically the same get in, get your objective, and get out routine, Invisible Incs randomized and repeatable sci-fi heists create one tough, risky tactical decision after another. The moment your starting pair of agents arrives in a level, the enemys alert status starts rising every turn, creating a tense race against the clock. You never actually run out of time, but the longer you go, the more enemies will arrive and security systems will activate  and youll never be able to take them all out. So youve got to get to your objective fast, but you have no idea where it is  or where the exit is  due to the randomly generated map, so you have to balance quick exploration against the need to remain undetected. At the same time, you have to carefully manage your power resource, which is used to hack surveillance cameras, locks, and drones. How you gather it and spend it can work very differently based on what combination of agents, augments, and equipment you have on this run. For example, on one run you might take Power Drip, which grants you a single power point each turn; on the next you could use Fusion, which requires you to spend five points up front to generate 12 points over the next four turns. You can also increase your power by hacking terminals, which is easier if you bring Agent Maria ~Internationale~ Valds  she can not only detect terminals through walls, but hack them remotely. Alternatively, you could take Alex ~Sharp~ McTeague, who comes with six cybernetic augmentation slots that can be equipped with power-generating enhancements. With 10 different characters eventually available, each with an alternate version with a different set of starting abilities, that makes plenty of room for several different play styles  including specializing in lethal or nonlethal takedowns (killing usually uses finite ammo, and costs you in cleanup fees). That variety also forces you to think on your feet and adapt to the gear that randomly becomes available to buy or steal. Because this is a turn-based game with easy-to-understand rules, there arent too many surprises  for example, you can spend an action point to see where a guard will move next turn. Thats led to some implausible escapes from danger when I figured out how to exploit the guards predictable AI, even without resorting to using a personal cloaking device or smoke grenade. Even after youve been detected, evading a single guards vision cone is laughably easy unless youve been caught out in the open and have to move through multiple watched squares. But at least I know that when I fail, its usually because I ran in without looking first  thats how spies get captured. Even then, you can pull your fat out of the fire with a rewind, a limited ability that lets you time-warp back to the start of your previous turn (you can disable it, if youre hardcore like that). Even with that sanctioned cheat enabled, Ive found Invisibile Inc to be a challenging game on the middle Experienced difficulty level. In the later missions, theres so much high-powered security in play that its hard to stay out of all the vision cones at once, and shielded and armored guards can be impossible to stop if you dont have the right equipment. The penalty for failure is steep - any agents who are shot and left behind (if you cant revive them or physically drag them to the exit point) are labeled as missing in action, until you spend one of your missions to rescue them from a detention cell. Even that comes with a big opportunity cost; each run of Invisible Inc has a short time limit (each mission consumes a number of hours)  and time spent recovering what youve lost is time not spent gaining more advantages for the tough final mission. You'll need all the money you can get to upgrade your agents with stat boosts, armor-piercing tazers and guns, and of course cool spy gizmos that can shut down electronics or cripple defense programs. You have some control over your fate, in that you get to pick your objectives on the mission select screen, which has you flying around the world to infiltrate facilities to steal money or technology, or liberate personnel. I love how one mission type is all about stealing a vault key to access better rewards in the next mission  it delays the short-term payoff from one mission for an even bigger one in the next. That doesn't always work out for the best, but the silver lining is that win or lose, new characters unlock as you play. That gives a sense of progression, which is rewarding even if you dont make it to the end, and makes even a failure feel like time well spent. Its all tied together by a loose story of rebellion against a corporate-dominated world, but its disappointing that the fiction is so static in a game thats meant to be repeated. That wouldnt be much of a problem, but it keeps interjecting itself after every mission, and after the first run or two, I quickly hit the little X in the corner of every dialogue box to skip it. And while I love the sleek cartoon art style and character profiles, that makes up most of Invisible Incs personality. It feels like theres a lot of untapped potential for Jagged Alliance 2-style character interactions, but none of that shows up here. But I did keep replaying, because I know every run through this great tactical stealth puzzle will throw some new combination of obstacles at me, and ask me to overcome them with a different set of tools. It's got its hooks in me. Pros Randomized levelsEasy to learnChallenging stealthDifferent play styles Cons Unchanging story Invisible Inc is a thrilling turn-based spy game. Though it fails to tap its colorful characters for story material and personality beyond their unique abilities, its randomized maps and spy equipment make sneaking past the enemy AI for maximum profit a tough and repeatable challenge.", "date": "May 13, 2015,"}