{"name": "Broken Age: Act 2", "name_review": "Broken Age: Act 2 Review", "ref": "https://me.ign.com/en/broken-age-act-2/105507/review/broken-age-act-2-review", "text": "Spoilers for Act 1 ahead. Head over here for our full Broken Age: Act 1 review. Broken Age: Act 2 is a smart, fun, challenging cap to Double Fines Kickstarted adventure. Still just as gorgeous and well-written, Act 2 is nearly twice as long as its predecessor. It ups the ante with surprising new characters, intriguing story reveals, and some really ingenious puzzles for the most part. There are a few nagging challenges along the way, but nothing that really detracts from the fantastic adventure at hand. Picking up right at Act 1s phenomenal cliffhanger, a bulk of Act 2's charm is how it flips the first parts script on its head. I really enjoyed how the theme of role reversal seeps through nearly every moment of Act 2. Exploring a decrepit Mog Chothra as Vella, and meeting the citizens of Meriloft as Shay shine new light on the events of the first half of the game. Controlling both characters as they come to terms with the realizations that theyve been lied to for a bulk of their lives constantly provides hilarious, and often-times poignant moments. It's a well-written and surprisingly-mature story of growing up, dealing with the messes life throws at you, and ultimately coming out a better person. That being said, I was a little bit disappointed that Act 2 takes place predominantly in the same locales as Act 1, albeit under very different circumstances. I loved revisiting folks and seeing how they've changed, such as Curtis giving up wood working in favor of becoming a metal smith, but I wished there had been more new characters and locations. Maybe Im just being greedy, but I loved discovering each new setting so much, and I wish Act 2 kept throwing those surprises at me. Still, those settings are again populated with some of the most interesting characters in modern adventure games, and Broken Age shines because of their incredible interactions. Vellas rocky friendship with a violent, sentient knife is hilarious, and choosing which awful tree-puns Shay uses on a morose oak brings back fond memories of the insult sword fighting in the Monkey Island series. I found myself trying out every single item on every single character in the world, not because I thought it would help solve a puzzle, but because I just wanted to hear every fantastic line of dialogue. But rest assured, the puzzles in Act 2 are mostly top-notch. It really plays with the dual-character setup by peppering puzzle solutions across both halves of the adventure. For example, spending some quality time with a snake as Shay is going to help you answer some strange questions as Vella. The puzzles in Act 2 are much larger, more complicated tasks, but most of the time that means the reward for solving them is that much sweeter. However, there are a handful of challenges with vague objectives that ultimately require oddly precise timing to accomplish. Early on in Vellas story, I found myself getting frustrated as I tried again and again to get the timing down on a puzzle where I had to swing a rope at a specific item. A handful of bad apples aside, Broken Age: Act 2 doled out satisfying puzzles at a fantastic rate, and provided dozens of wonderful aha! moments that separate great adventure games from the rest of the pack. Adding to this is the fact that most of the puzzles contain a plot or character element to them, meaning that every time you solve one, you flesh out a bit more of the world around you. Pros HilariousGreat twistsSmart puzzlesCharacters Cons Familiar settings Broken Age: Act 2 wraps up Shay and Vellas story in great fashion. The jokes are punchy, the twists are rewarding, and most of the puzzles are satisfying in a special way. While I wish that Double Fine kept taking me to new and surprising settings, Act 2 makes the absolute most of each screen of its world. Its an adventure that I loved seeing through to the end.", "date": "April 27, 2015"}