{"name": "The Evil Within: The Consequence", "name_review": "The Evil Within: The Consequence Review", "ref": "https://me.ign.com/en/the-evil-within-the-consequence/105372/review/the-evil-within-the-consequence-review", "text": "A direct continuation of The Evil Withins superb first story DLC The Assignment, The Consequence is torn between wrapping up a complicated story and delivering a stylish stealth experience. Thanks to gorgeous environmental design and great boss battles it's still a compelling experience, but it's also a disjointed one. As protagonist Juli Kidman is propelled by malevolent forces toward her fate, the team at Tango Gameworks have clearly rushed to tie up the first installment's loose ends. I continue to appreciate The Evil Withins nutty psychological horror concept for what it is, but ghostly real-time flashbacks and encounters with Julis ominous boss are too frequent here, taking on an air of insistent - and lifeless - pantomime. Their constant interruptions break up the tight stealth gameplay that was such a highlight in The Assignment. While Julis still without a weapon for most - but not all - of her journey, The Consequence struggles to maintain an air of tension while moving the story forward, and enemies, poised on precipices for a pre-determined shove or thrown carelessly beyond the obvious route, feel like an afterthought. More problematically, The Consequence struggles to know what to do with its Big Bad, Ruvik. Now something of an overexposed figure, his all-seeing presence is mostly relegated to the clunky abstract in The Consequence, and one miserable sequence saw me lighting paintings of his face on fire in order to break his demonic hold. There is a fun to be had once Tango throws up its hands and gives Juli a gun later on in proceedings. Shes only a little stronger with a weapon in her hand - unlike The Evil Withins tougher Sebastian, she is killed in two hits - so every bullet counts. A stealthy approach might have been more interesting, but its hard to deny the satisfaction of downing five enemies with five bullets in the chamber. And fortunately, originality blooms elsewhere. The Consequence has some of the creepiest environments in The Evil Within to date; the series trademark askew camera angles and ghostly filters complement body-horror walls and narrow corridors. Tango has always enjoyed messing with time and space, and here its set-pieces shift in wonderfully bizarre - and disorientating - ways. Of particular note are its boss battle arenas, which pulled the rug from under my feet so frequently I felt genuinely panicked; which is, of course, the point. It doesnt hurt that these bosses are truly unnerving creations. Tango continues to be happy tapping into horror cinema - more specifically, Adrian Lynes hugely influential Jacobs Ladder - and has riffed on the familiar to create new frights. While the terrifying lamp lady returns here with style, one boss - in the throes of Lynes judder effect - spooked me in a way no video game nasty has before or since. Pros Great boss battlesChilling environments Cons Clunky expositionAwkward use of antagonist The gorgeous environments and ridiculous boss battles in The Consequence are among the best in the series, but an overabundance of exposition interrupts its flow too frequently. This is still a good entry in The Evil Withins universe, but it falls short of its predecessor's greatness.", "date": "April 23, 2015"}