{"name": "Hyrule Warriors", "name_review": "Hyrule Warriors Definitive Edition Review", "ref": "https://me.ign.com/en/hyrule-warriors/147808/review/hyrule-warriors-definitive-edition-review", "text": "When we first reviewed Hyrule Warriors on the Wii U in 2014, we gave it a 7.0, for Good. Heres what we said about it then. Surprisingly, Hyrule Warriors does a good job of tying together the combat of Dynasty Warriors and the revered characters and lore of the Legend of Zelda series in a way that makes me feel powerful in a world I love. Character customization adds unique flavor to the simple combat, and the satisfying weapons, rewards, and story make it a fun alternative to the typically serious Zelda games. Its just a shame you cant share the action with a friend without significant slowdown. Read the original Hyrule Warriors review here. Hyrule Warriors: Definitive Edition for the Nintendo Switch offers that plus all of the little quality-of-life enhancements Hyrule Warriors Legends on the 3DS introduced and then some, but with none of the crippling performance issues. Definitive Editions features mostly spawn from the Legends version: it has owl statues you can teleport to on command, more of the challenging and replayable Adventure Mode maps wrapped in themes from other Zelda games like Majoras Mask and Wind Waker; and the delightful My Fairy function which lets you collect, raise, and dress different fairy companions. New features make playing solo significantly less frustrating, but it still doesn't compete with playing co-op with a friend. The Definitive Edition also seems to have taken a note from the recent Fire Emblem Warriors, in that you can now press up or down on the D-pad to cycle through playable characters on the field instantly, and you can command characters to move to specific spots. These additions make playing solo significantly less frustrating, but it still doesnt compete with playing co-op with a friend. Which, thanks to the Switch, you can now do in split screen even while in handheld mode. It performs admirably, but that screen is just too tiny for two people to play on comfortably. Though obviously giant leaps and bounds above the 3DS version, Hyrule Warriors: Definitive Edition doesnt do a whole lot to improve on the look of the Wii U version. It is much brighter, and the textures are significantly cleaner and sharper. I also noticed virtually none of the stuttering thats common with musou games, even when playing co-op. But I did experience weird stutters when loading into maps, and the same occasional clipping and pop-in musou games are notorious for. As someone who has played many, many hours of Hyrule Warriors on the Wii U, the story mode was honestly kind of boring to go through again, despite the variety of characters to choose from. This would have been more entertaining if I'd had someone help me blast through it in co-op, which makes most levels only 15 minutes long instead of 25, and opens up the character options to everyone you have unlocked for Player 2 (but partners are hard to come by when a game's not out yet). The Adventure Mode maps, on the other hand, were interesting enough to keep me engaged even solo. Theres just a lot more incentive to play when the challenges are more difficult and varied; and paired with better, tangible rewards like Fairy Companions, new characters, costumes, weapons, and more. Pros A fun sidestoryCustomization optionsAdventure mode Cons Bad two-player performanceDull bosses Surprisingly, Hyrule Warriors does a good job of tying together the combat of Dynasty Warriors and the revered characters and lore of the Legend of Zelda series in a way that makes me feel powerful in a world I love. Character customization adds unique flavor to the simple combat, and the satisfying weapons, rewards, and story make it a fun alternative to the typically serious Zelda games. Its just a shame you cant share the action with a friend without significant slowdown.", "date": "May 17, 2018,"}