{"name": "WWE 2K22", "name_review": "WWE 2K22 Review", "ref": "https://me.ign.com/en/wwe-2k22/195413/review/wwe-2k22-review", "text": "What a difference a year off makes.Coming off the heels of the disastrous WWE 2K20, 2K Games and developer Visual Concepts smartly decided to sit one out in order to refocus and essentially reset the series. And its a good thing, too, because the resulting WWE 2K22 is by far the most polished and freshest take on the franchise since it began way back in 2013. To be clear, that isnt to say that it is entirely free of bugs, awkward collision detection, server disconnects, and a few other longstanding problems, most of them are under control now and its evident that the team truly took many major points of feedback to heart. The action is faster, the controls are less convoluted at the ground level, the wrestlers (mostly) all look fantastic, and there are no confounding lootboxes ruining the career modes progression. On top of that, the total revamp of the strike/grapple system is the kind of shake-up WWE 2K has been in desperate need of. Its clear that one of the key focuses for WWE 2K22 was to simplify what has become, over years upon years of iterations, just an overwhelming amount of systems governing the fundamental wrestling mechanics. Theres no more stamina meter, no more multi-tiered lifebars, no more reversal stocks, no more chain wrestling minigames, no more rest hold minigames, and every character is down to just one special payback ability. That might sound like throwing the baby out with the bathwater, but really, its a trimming of fat thats paid off. WWE 2K22s wrestling feels much faster, more arcadey, and is more pick-up-and-play friendly for newcomers than ever. Theyre almost all universally great changes, and whatevers lost in the Pro Wrestling Simulation department is more than made up in the This is Fun To Play department. WWE 2K22's wrestling feels much faster and is more pick-up-and-play friendly than ever.Those spectacular moments that evoke the magic of professional wrestling are ever-present. Fans of WWE will certainly get the most out of the gameplay, especially with how closely each superstars moveset mimics their actual repertoire of maneuvers and techniques, but even those unfamiliar with pro wrestling should find a lot to like about the fast-paced, high-flying action and the sheer variety of cool moves to behold. What We Said About WWE 2K20WWE 2K19 looked like it stopped the downward trend for the series, but WWE 2K20 doubles back, breaks its ankle, and tumbles down the slope. Fundamental parts that felt totally fine in WWE 2K19 now feel clumsy, the impressive roster of 238 superstars is all but meaningless when a majority of them look like they crawled out of a PS2-era wrestling game, and while 2K20s MyCareer mode offers a better wrestling story mode than most previous WWE 2K games, thats a low bar to clear  its still saddled with bad progression and a plodding pace. This is a mess that 2K needs to clean up in a hurry. - Mitchell Saltzman, October 23, 2019Score: 4.3Read the full WWE 2K20 reviewThe combat is also enhanced thanks to much-improved camera angles that do a better job of framing the action in and outside the ring, much better character models for every wrestler, a more reactive and more varied crowd, and far more accurate commentary from Michael Cole, Corey Graves, and Byron Saxton. Best of all, theres now one gigantic backstage area for falls count anywhere matches and backstage brawls, complete with cars to smash each other into, high platforms to toss your opponent off of, and plenty of weapons and tables strewn all around. The one change that Im a little torn on is the removal of reversal stocks, which gave each wrestler a limited number of reversals that would refill over time. They were added way back in 2K16 to eliminate the problem of matches between two experienced players devolving into a contest of who misses the most crucial reversal first. It can certainly be fun to trade reversals early on in a match, but it doesnt feel like the timing window on them ever gets any tighter as the fight goes on, which makes actually ending a match against a skilled opponent exhausting because you can basically trade finisher reversals back and forth forever. At the same time I get that there are arguments for and against reversal stocks, so I wish there was at least an option to turn them on or off to let people play how they want. C-C-C-Combo BreakerThe other big change to the fundamentals of WWE 2K22s wrestling is the overhaul of the strike/grapple system, which is much more combo focused than in previous years and also borrows a few mechanics from more traditional fighting games. WWE 2K22s combo system uses three buttons for light, heavy, and grab, and have a progression that allows you to continue a string by pressing a button of equal or higher strength, with a maximum of four button presses in any combo. Pressing the highest strength button, a grab, will end the combo with whatever unique move is tied to that specific combo string.This is important to know because only the first hit of a combo is reversible. After that you must predict what button the attacker is going to press next and match them before their attack comes out to break the combo. If you guess wrong, youre locked out and are gonna eat the rest of the combo. But if you can get into your opponents head and predict their moves its fantastically rewarding  and an extremely good motivation to avoid falling into a pattern yourself. Its essentially like a mini version of Killer Instincts combo breaker system, minus, you know, the announcer yelling C-C-C-COMBO BREAKER. It's cool to see some of that fighting game philosophy find its way into a WWE game. If you can get into your opponent's head and predict their moves it's fantastically rewarding.Another fighting game influence on WWE 2K22s wrasslin action is a segmented special meter that you can use for a variety of offensive and defensive techniques. Spend one bar, and youll be able to immediately get up from the mat as though wrestling was fake or something. Spend two bars, and youll be able to use your characters equipped one-time-use Payback special move; these range from a low blow, to stealing your opponents finisher to use against them, to the ability to spit poison mist in your opponents eyes. Just make sure the ref doesnt see it. If you manage to fill up the whole thing you can execute your Signature move, which, if it hits, will instantly give you a finisher charge that you can use to attempt to land your strongest move. Paybacks and Signatures have obviously been part of the series before, but being able to spend some of that same resource that governs their use on a valuable defensive move that lets you get yourself out of a bad spot is a hugely welcome addition. MyCareer 2.0From a single-player perspective, the main attractions of WWE 2K22 are the career and showcase modes, with the career mode seeing the most dramatic changes. MyCareer, now called MyRise, ditches the linear story of prior years in favor of a much more open-ended one that lets you chart your own path through the WWE. Theres a great degree of freedom here: You could start off in Smackdown as a crowd favorite, get wrapped up in a number of storylines, suddenly decide to turn heel, get traded over to Raw, and open up a whole selection of new storylines that werent available to you before. There are also a number of smaller choices that you can make that affect what wrestlers you become friendly with, which ones you make your rivals, and what match types youd prefer to throw down in. Compared to prior WWE 2K career modes, MyRise does much more with much less. With three brands, each with their own roster and titles to pursue, unique storylines depending on whether youre a heel or face, and two completely different campaigns depending on whether youre a male or female created character, MyRise will keep you busy for a long time if your goal is to see everything and collect every title. Best of all, theres no awful progression system standing in the way of you customizing your character however you want! Its super easy to boost your stats and customize your look, entrance, and moveset without having to unlock anything that you dont already have access to outside of the mode. The actual story content lacks the WWE's bombastic flavor.That said, the actual story content lacks the WWEs bombastic flavor. Most of the dialogue is delivered via unvoiced social media posts and text messages, there are far fewer promos and cutscenes than weve seen in previous years, and while there are a few amusing storylines  like Riddle getting in trouble with Goldberg for the disparaging social media posts that he actually made in real life  theres nothing truly stands out. Theres no crazy Samoa Joe with a bionic arm or Bray Wyatt dragging you to the Wyatt compound. Just very ordinary wrestling tropes that youve probably seen a thousand times if youve been a fan of WWE in the past few decades. There are a handful of WWE Superstars that lend their voices to the story, but the majority of performances feel stilted and uninvested. Its also clear that some of the voice-over recording happened during quarantine, because the audio quality is all over the place. So while the execution doesnt meet the ambition, MyRises focus on meaningful choices and the sheer amount of content within are definite steps in the right direction. Showcase Mode is mostly unchanged from previous years, including the fact that you frustratingly still cant save checkpoints mid-match (yes, I will continue complaining about this in every WWE 2K review until the end of time). It highlights the legendary career of Rey Mysterio, which is an emotional ride that explores how closely tied he is to the late, great Eddie Guerrero. Whats really cool about Showcase, though, is how it transitions between the WWE 2Ks game engine and actual footage of the matches during the big moments, all while Mysterio provides a running commentary and offers interesting insight into each match. General Management As always, WWE 2K22 is overflowing with content, and that cant be understated. Theres the customizable sandbox that is Universe Mode; the roster of more than 160 characters; to the insane insanely in-depth creative tools that let you create wrestlers, belts, arenas, movelists, and more; and the brand-new MyFaction mode, which is a microtransaction-laden minefield, but it's at least a quarantined-off microtransaction laden minefield.Microtransaction ReactionThe new MyFaction mode is essentially WWE 2Ks take on the familiar Ultimate Team modes found in just about every EA Sports game these days. You build a team of WWE Superstars by purchasing card packs with either earnable in-game points or real money. Its a mode developed with a mobile game mindset, featuring daily log-in bonuses, equippable boosts to power up your characters, tons of challenges to complete that will earn you extra points, and weekly towers to conquer for rewards. Virtual Currency can be purchased in bundles with costs ranging from $1.99 all the way to $99.99. Essentially, its designed to be a time suck that requires you to grind in order to build up your team of wrestlers, with the ability to pay money to skip some of that grind. Its ultimately inoffensive, but not something that Id personally want to spend much of my time with, not that Ive been able to spend much time with it in the first place due to the servers being down regularly leading up to the actual release date on March 11.But the best new addition is definitely the MyGM mode, which finally makes its return to the world of wrestling video games for the first time since Smackdown vs Raw 2008. This is essentially a management simulator that puts you in the role of a General Manager responsible for either Raw, Smackdown, or NXT, and the decisions you get to make can be a lot of fun to play with. You compete against either the AI or another player over a 15-week period as you both try to beat out the other in the ratings by drafting a roster, booking shows, and managing logistics, all with a limited budget. Theres a lot to consider: You ideally want faces to go against heels, your opening and closing matches to be stronger than your mid-card matches, your biggest draws to stay healthy for big Pay-Per-Views, and thats just scratching the surface. Its a super-niche mode, and truthfully, I dont know if any of my friends would ever want to do a round with me, but even just going up against the AI has been a fun diversion. 2K Games and Visual Concepts needed a win with WWE 2K22, and while its far from a complete ground-up rebuild, its quite possibly the biggest leap forward the series has ever seen. The year off has clearly paid dividends: Virtually all of the major bugs I experienced in WWE 2K20 have been squashed; the revamped combat is faster, leaner, and full of smart tweaks that make it approachable for newcomers and rewarding for veterans; MyRise takes the MyCareer mode into a bold new direction; and MyGM offers a very niche, but nonetheless well put together management sim thats sure to be a blast if you can find a like-minded wrestling fan to play it with. All this on top of an impressive visual overhaul that makes all 160+ superstars look the best theyve ever looked in a video game. Its the rare case of a marketing slogan that actually rings true: WWE 2K22 hits different.", "date": "March 11, 2022"}