{"name": "Mortal Kombat X", "name_review": "Mortal Kombat X Review", "ref": "https://me.ign.com/en/mortal-kombat-x/104881/review/mortal-kombat-x-review", "text": "Lets just get this out of the way: Mortal Kombat X is the best Mortal Kombat, period. Its deeper, mechanically richer, and more fully featured than any of the nine games before it, hands down. On top of that, developer NetherRealm Studios has taken a bunch of risks by adding eight entirely new characters to the MK roster, while introducing fun, distinct variations to returning ones. Each of these risks pays off to varying degrees, but they also serve to highlight some of the ways in which the franchise is stuck in the past. Mortal Kombat X is an excellent fighter, and the most fun Ive ever had with a Mortal Kombat game. The first thing MKX does to make itself feel new and exciting to both old series fans and casual fighters is a major roster shakeup. Before DLC ever enters the picture, MKX sports a respectable 24 fighters, and a whopping one third of those are honest-to-goodness new characters; not palette swaps or tweaked alternate versions of existing ones. Few fighting games with such a deep vault of fan-favorite characters have cleaned house so completely, and MKX is so much the better for it. Sure, I go way back with guys like Kabal and Smoke, but fresh faces like Takeda and Kung Jin bring so much novelty to the table gameplay-wise that its hard to be sad about their absence. Takeda is the most eye-catching new design, and he exemplifies what MKX does right with its new characters. He fights like youd imagine a 21st-century ninja might, with an interesting mix of traditional weaponry and high-tech gadgetry. Hes got remote-controlled laser swords he can plant and recall at will, explosive kunai throwing knives, and arm-mounted, retractable grappling hooks that can open up into imposing blade-covered whips. He wields it all with a confident martial arts swagger that makes it all seem somehow plausible. In fact, everyone conveys their fighting style more effectively than in NetherRealms prior games thanks to the much-improved animations. Injustice was a step in the right direction of addressing the shortcomings of 2011s Mortal Kombat , but MKX gets the rest of the way there: dash and hit animations no longer look like hapless flailing, for instance. Little details like this used to distract me from the fighting all the time, and Im glad to see them finally ironed out. This helps MKX feel like the smoothest-playing Mortal Kombat ever. Walk speeds are snappier, pokes feel more useful, and with the awesome new variation system, theres more to explore, discover, and exploit than ever before. Liu Kang has a variation where he can switch on the fly between healing and damaging stances, new grappler Torr employs an assist character to double-team opponents, Kotal Khan can place totems to grant himself temporary buffs  this is the kind of stuff you see in Persona 4 or BlazBlue, and seeing NetherRealms open up so many fun new doors is really refreshing. One mild distraction from the excellent combat though, is the visual inconsistency between characters. Some fighters, like Scorpion or newcomer Dvorah, look excellent, with tons of little details in their faces and costumes. Others, like Sonya and Jacqui, look far less detailed, with comparatively plain facial textures. It stands out because of the high peaks MKX hits during its best moments. With two of the better-looking fighters duking it out against one of the many beautiful backgrounds, its one of the best-looking console games around, so it sticks out when everything isnt up to the same high quality level. The inconsistency that sticks out the most for me though, is the content of MKXs so-so story mode, and how completely at odds it is with the aesthetic Mortal Kombat has built over the years. Again, NetherRealms has created something substantial for folks who like having a single-player experience, but its far less successful than previous attempts. The spotty writing and voice acting are largely to blame, but the real issue is that its weaving a tale of family and young adults coming of age in a world about death and brutality. Without the storytelling wit to do something interesting and unpredictable, its simply a poor fit. The chapters set in a civil war-torn Outworld fit the Mortal Kombat tone the best, but there is just no reconciling the feel-good tale of a single father who loves his daughter in story mode with the image of him gleefully tearing a hole in her chest and proudly standing over her dead body in every other mode. Yes, of course, Mortal Kombat is ostensibly about Fatalities, and theyre gorier and more satisfying here than ever, but MKXs story mode also wants to be about characters with deep ties to one another: fathers and sons, estranged lovers, budding romance, and long-standing blood-feuds finally laid to rest. Adding all of that drama to a series that began as a thrown-together story of a bunch of loners fighting to their deaths for their own reasons in strange, dangerous-feeling places leaves MKX feeling a bit confused in that regard. Theres a small bit of this inner conflict in the excellent combat engine as well, but fortunately it matters far less. The bi-directional block button is back, and after being free of it in Injustice it simply feels limiting. Scream sacrilege all youd like, the block button is a poor mechanic. It completely removes the left/right mixup that cross-ups are supposed to create in 2D fighters, eliminating an entire axis of mind games and setups. Still, theres a ton of depth to mine here. Each character has a long list of attacks and combo chains that serve different purposes, from high/low mixups to safe block strings and juggle starters. X-Rays, the MK equivalent of super moves, have been retuned to be more worth the resources they cost to execute and throws can be canceled out of and linked into full combos, giving you another meaningful way to spend meter. This makes resource management decisions that much richer. Most importantly, the ability to choose between three version of every character means there will be more matchup-specific stuff to learn, since playing against Sonyas martial arts-focused Special Forces variant wont prepare you for the setups she can create with her Demolitions style. Thats what really matters in the end. Sure, the three or four-hour story mode experience feels middling and largely out of place, but story mode isnt really what a fighting game is about. Its endless nights in the lab and the joy of outsmarting your opponent in single combat. MKX provides all this with an incrementally improved version of the same great training mode from Injustice, and a solid suite of online features. The best of these is King of the Hill, which allows you to queue up and chat with a bunch of players while training, watching live matches, and paying respect for performances that impress you. Its a fun, social way to play and learn with other people. The netcode is mostly up to the task of keeping online fights reasonably smooth, but there was usually just enough input lag to throw off my combos or punish timings relative to what Im used to playing locally. Still, thats a huge improvement over Mortal Kombat 9, and while online isnt a replacement for in-person competition, its close enough to keep me learning and playing for a long time. One more thing that will keep me coming back is the returning Krypt, where you unlock MKXs humorously massive cadre of costumes, finishers, and supplemental materials. More than ever before, this interactive unlockable menu feels like a game of its own. Theres a certain thrill to spending your hard-earned koins to open up treasure chests that could have anything in them. That joy is somewhat dampened by the knowledge that you can just buy your way out of the entire thing with a separate $20 unlock key. Its not the only thing thats been monetized, sadly: new options for executing easy, two-button Fatalities or skipping story or tower fights require tokens, which are also sold on PSN and XBL. Its worth noting I never felt outright pushed to get any of this stuff, but between all that and the big push X to buy Goro message that appears when you cursor over him on the character-select screen, its a bit too much in-game marketing for me to be okay with. It didnt impact my enjoyment of the experience exactly, but even a hair more aggressive, and it would have. Its sad that were even in that territory. Pros New charactersVariation systemSmooth, swift combat Cons Story modeSome so-so models Story only matters so much in a fighting game. Combat is king, and theres a ton of depth to mine from Mortal Kombat X. A much-needed transfusion of new blood, along with the ability to choose between three variations of every character means well be learning, grinding, and discovering for a long time to come. Its universe keeps getting harder and harder to take seriously, and its microtransactions are borderline gross, but Mortal Kombat X is a great fighting game all the same.", "date": "April 14, 2015"}