{"name": "Xenoblade Chronicles", "name_review": "Xenoblade Chronicles 3D Review", "ref": "https://me.ign.com/en/xenoblade-chronicles/104493/review/xenoblade-chronicles-3d-review", "text": "When we first reviewed Xenoblade Chronicles for Wii in 2012, we called it an amazing game. Heres what we said then: Xenoblade Chronicles is the best Japanese RPG of this generation. The fact that it looks like it's from the last generation is its only drawback, but its technical limitations are offset by imaginative artistic direction, innovative and compelling combat, and thoughtful design. It's a throwback to the glory days of the genre, proof that there are always new ways to tell a story. If you've ever felt neglected by the lack of in-depth gaming epics on the Wii, you owe it to yourself to buy this. So how does the port of this epic RPG made exclusively for New Nintendo 3DS stack up? It still offers the same innovative ideas, deep combat, and an expansive world full of quests to complete for well over 60 hours of play, but its a little harder to look at. Developer Monster Games has done an admirable job compressing Xenoblades grand world into a compact form, with only the textures noticeably suffering in the transition to a smaller, low-resolution screen. The downside is that some characters and environments just dont look very good, either up close or zoomed out. Even so, the 3DS manages to capture the spirit and overall feel of Xenoblades massive world. It has the same grand vistas, whether youre free-roaming the wide-open fields of Guar Plains or the deep jungle of Makna Forest, and the technical sacrifice means this version runs at the same speedy pace as the Wii game. Control-wise, the New 3DS feels well suited to tackle Xenoblade. Bouncing between the C-stick and face buttons feels natural. The ZL and ZR buttons mean we get useful camera options to zoom in or out, and quick access to a fast-travel system. The only bummer is that it doesnt even try to use the 3DS touch screen. Thats an unfortunate omission, since the touch interface could have made navigating the menus a little easier. Likewise, Despite the 3D in the title, Xenoblade Chronicles 3Ds unremarkable use of 3D doesnt make this version feel any better. Some cutscenes benefit from added depth, but theres no sense of dimension added to gameplay. So outside of letting us experience this RPG on the go, Xenoblade Chronicles 3D adds very little. Collectible 3D models of the major characters and a music jukebox are neat, but having already played it on Wii, I certainly wouldnt buy it again just for that. Pros Deep combatLots of questsMassive scaleCustomization Cons Blurry textures Xenoblade Chronicles 3D shrinks an epic RPG into a nifty portable form. Even though the New 3DS speedier hardware cant make it look quite as good as it does on the Wii, its scope and scale still make it an impressive and deep game thats well suited for play on the go.", "date": "April 3, 2015,"}