{"name": "Ride", "name_review": "RIDE Review", "ref": "https://me.ign.com/en/ride/104429/review/ride-review", "text": "There is something liberating about racing on a motorcycle at high speed. Perhaps its the risk of every curve you are about to make or maybe its the precision of each action that is required of the driver. Its a difficult feeling to capture unless youre a part of the action. RIDE, the motorcycling equivalent of Gran Turismo (and from the creators of MotorGP), takes on the challenge of bringing the racers experience and although it might succeed in many of the technical aspects, it sometimes fails to be as fun of an experience. RIDE gives you the option to customize your bike from hundreds of real world bikes. It features a decent selection of locked licensed bike parts and gear which can be unlocked after earning credits in races. You can also customize the look of your very own racer with a fair selection of options, however, I fail to see why I would need to do that as my character only appears at the setup screen just for shows. Its a nice feature for fans of creating their own character but lacks any major impact which is fine as its all about the bike and the racing of course. And this is where things get rough for RIDE. Loading times are slow and after a couple of game play sessions, I found myself trying to avoid any menus just so I can avoid waiting to race. Its weird to see RIDE taking so long to get into a race especially when it doesnt look demanding, graphically speaking. Apart from the bikes and the drivers, the world has very little detail to it. Scenery and crowd visuals look poor and bland and we have seen some textures popping as we were in mid-race. It is safe to say that RIDE certainly is not up to par with todays standards of visuals. RIDE never loses focus of being a motorbike simulator especially when it comes to its driving mechanics. Controlling your bike is difficult and takes time to master. You will spend the majority of your time in the beginning smashing into walls and failing to perform curves smoothly but eventually it all settles in and the game gets easier. This is the games best selling point. It is able to replicate the feeling of driving an actual motorbike on these fast paced tracks and enthusiasts will be pleased. The AI drivers will disappoint at later stages in the game when youve reached mastery level as they are too dumbed down and never really offer anything challenging. In RIDE, the most challenging opponent is controlling your own bike, but when that is gone there isnt really much left to do. Thankfully, RIDE comes with an Online Mode feature that allows you to play up to 12 players to compete. Pros Solid and detailed driving mechanicsExtensive customizable optionsReal world bikes Cons Absurd loading timesDated visualsLack of real challengeToo overwhelming for non-cyclists For motorbike enthusiasts, RIDE is one of the best choices out there. With plenty of licensed customizable options for your bike and rider, a healthy list of real life tracks, and solid driving mechanics, it really is a shame that the AI is dulled down leaving no real long lasting challenge other than the Online Mode.", "date": "April 2, 2015,"}