{"name": "Borderlands: The Handsome Collection", "name_review": "Borderlands: The Handsome Collection Review", "ref": "https://me.ign.com/en/borderlands-the-handsome-collection/104063/review/borderlands-the-handsome-collection-review", "text": "Sitting down to tear into Borderlands: The Handsome Collection, I couldn't help but be impressed by the sheer volume of content it wraps up: two great action RPG-shooters, 12 well-differentiated playable characters, and hundreds of hours of story and side missions that take you from Pandora to the moon and back again. It's truly an embarrassment of riches. Aside from the 1080p resolution and beefed up textures and lighting effects, nothing has changed here for Borderlands 2 or The Pre-Sequel. They're all just as generous with loot, they still feature some of the best humor in modern gaming, and they both still wield irreverent goofiness like a deadly weapon. For a more detailed sense of why we think these two games are so darn great, check out our full reviews for Borderlands 2, and Borderlands: The Pre-Sequel. Not only do they function wonderfully as shooters, but their gear and skill progression are still some of the best you can find amongst action RPGs, with zany skill trees that still make starting a new character fun even after a few hundred hours. The Pre-Sequel is particularly strong here, with every character having at least one skill tree that requires you to commit to strange playstyles in exchange for big-time power, like constantly reloading to become a whirling dervish of explosive destruction. The issues I have with this package are matters of minor inconvenience more than anything else. For one, once you've chosen which game to boot into, there's no way to switch to the other without closing the application and booting it back up, which is a somewhat inconvenient oversight. Second is slightly inconsistent performance. Borderlands 2 is rock solid whether playing solo or with three friends split screen, but while the Pre-Sequel mostly stays at 60 frames per second in single-player aside from the occasional hitch, in four-player split screen, the frame rate is half that, and sometimes worse. What's more, the skill and inventory screens aren't scaled proportionately with your screen quadrant, so you can only see a slice of these screens at a time. None of this stuff is a deal-breaker, but it does make couch co-op just a bit less enjoyable. Pros Two great gamesUpgraded visualsTons of contentCharacter importing Cons Pre-Sequel performance Minor quibbles aside, The Handsome Collection is a great package for any console-bound Borderlands fan. The fact that it collects every piece of DLC for both games, the majority of which is of very high quality, plus the fact that you can carry your last-gen saves and characters over, makes it a good pickup for returning fans and a great pickup for new ones.", "date": "March 24, 2015"}