{"name": "Mario Party 10", "name_review": "Mario Party 10 Review", "ref": "https://me.ign.com/en/mario-party-10/103725/review/mario-party-10-review", "text": "You might remember the thrill of your first teenage party: Maybe you snuck out; perhaps there were older kids there; there was definitely beer. If Mario Party 10 is your first Mario Party, I think you're going to have a great time. If, like me, you've been Mario Partying for 17 years straight, you might feel like quietly slipping out the back. Mario Party 10 adds a bunch of new features including amiibo, and the second screen of the GamePad, but it also carries over some bad ideas from Mario Party 9 that continue to deflate the fun. Mario Party's core idea (a virtual board game with minigames to shake things up) is smart, but recent iterations have dropped the more complex rules and options that make board games interesting in the first place. Mario Party 10's game boards are linear, with little complexity. Dice rolls move all characters together in one vehicle on rails, meaning fate  not strategy or skill  decides pretty much everything but minigames. And here's the kicker: In the main Mario Party mode, a new rule change means you don't actually get to play the minigames that often. So what is the point of this, exactly? When you get to play them the minigames are great. They often take advantage of Super Mario 3D World's aesthetic and gameplay  right down to clear pipes and squirrels. It looks great in HD, and makes four-player split-screen minigames much easier to follow. The technical improvements aren't without hiccups, though: load times before and after each minigame can get pretty long. The best minigames have the partiers navigating obstacle courses of moving and/or vanishing platforms by running and jumping, using the Wii Remote like an NES controller. You know: Mario stuff. In one game, platforms disappear into lava, leaving survivors on tiny islands with just enough room for you to edge an opponent into the goop. Your old Wii Remotes get plenty of use in their various motion-based modes, too: Track a certain Goomba in a crowd and point at it with your crosshairs; waggle the Wiimote until your balloon nearly bursts, then hold it really still so an extra waggle doesn't push it past its breaking point. There are some less fun tilt-based games, like a soccer match on giant balls that will have you contorting to win. Motion controls may sound regressive in 2015, but in the thick of the Mario Party, it's all goofy fun. I wish I could tell you to just play Mario Party for the minigames, but you actually don't get to play that many of them. In Mario Party mode, you only play a minigame if you land on a minigame space  and theyre rare enough that it's entirely possible to play an entire game without hitting one. Minilame! Bowser Party Mode Bowser Party not only introduces a fifth player to the party, but also makes use of the Wii U GamePad  a fittingly large controller for the role of Bowser as master party crasher. In this mode, up to four players share a car and roll dice to flee from Bowser on one of three boards shared with Mario Party mode (two are unavailable for some reason) while Bowser rolls a handful of dice in an attempt to catch up at the end of each turn. If Bowser catches up, he takes on the four other players in a 1v4 minigame. Interestingly, these games are balanced individually to favor either Bowser or the partiers. As Bowser gets more ~angry~ throughout a match, the minigames you play will be tilted in his favor. Playing as Bowser is a blast: You blow fire at scurrying players; mess with their minds by rotating and stopping a giant wheel that throws them into flames; and officiate a game of BINGO that the partiers pretty much always lose. You do all this with your own screen and set of controls, so others can't see your scheming. I highly recommend the submarine game board, where the Bowser player gets to draw on the GamePad to try and trick players into choosing the wrong path on the big screen. You don't actually have that much psychological sway, but taunting with GamePad graffiti is totally gratifying. Whether you are Bowser or not, this five-person modification of Mario Party is 10's greatest achievement  and one of the best uses of the Wii U GamePad yet. Amiibo Party Mode Amiibo Party requires Nintendo's interactive toys (amiibo), but amiibo aren't exactly the life of the party. Each player must keep an amiibo and a Wii Remote on hand at all times, with the GamePad sitting at some place within reach of all players (which was awkward both in my living room and in the office). The integration of amiibo amounts to little more than constantly tapping the figures to a sensor in the corner of the GamePad. You tap to roll, tap to stop random spinners, tap to use items You tap the GamePad a lot. In between amiibo tapping, you play an old-school version of Mario Party: You get to move as separate characters (yay!), and there's a minigame after each round (yay!), but there's a huge catch: The game boards in this mode are small, linear, squares. You can swap out corners of the squares with different Mario themes, but they left me and my fellow partiers yawning. And tapping. Bonus Feature Lurking in Mario Party 10's bonus menu is a great standalone game called Jewel Drop, which captivated the office for a few hours one day. It's a clever color-matching game not unlike Dr. Mario, but with a spin: Physics apply. Your stacks of jewels can collapse, or you can intentionally shake them up to make a bunch of matches and slam your opponent with a deluge of Jewels. Pros Fun five-player game modeGreat minigames Cons Boring use of amiiboNo room for strategyInfrequent minigames In my experience, two types of people get the most enjoyment out of Mario Party: Small children and inebriated adults. Nintendo's intended audience in Mario Party 10, as with its predecessors, is clearly kids (they will probably love the amiibo tapping). But when you design something just for kids you can run into something I'll call Candylandization: flashy stuff that requires no thought whatsoever. Kids gleefully absorb it, but adults only suffer through it for kids sake. But it doesn't have to be that way. Nintendo, and the Mario franchise in particular, has a history of making games that are enjoyable for all ages. Mario Party 10 isnt one of them. There's always next time.", "date": "March 18, 2015"}