{"name": "Resident Evil Revelations 2: Episode 4", "name_review": "Resident Evil Revelations 2: Episode 4 Review", "ref": "https://me.ign.com/en/resident-evil-revelations-2-episode-4/103707/review/resident-evil-revelations-2-episode-4-review", "text": "Considering the sheer amount of plot threads dangling at the end of episode 3, there was a great deal of pressure on Resident Evil Revelations 2: Episode 4 - Metamorphosis to end its story in a satisfying manner. Although it takes a good stab at doing so, it loses much of its charm along the way, and some extra-creaky gameplay adds up to make the finale the the least satisfying episode of the entire series. The story this time around is told with po-faced sincerity, to its detriment. All humour is gone, replaced by unintentionally silly theatrics (I am a god! Come out from behind the glass so I can choke a god!). It reminded me of the clunkier dialogue in the original Resident Evil; funny, considering all the knowing winks and nudges toward that game in earlier episodes. Worse, in an attempt to explain the complexities of the plot at the last minute, developer Capcom has taken to heavy-handed exposition via notes and additional reading material. Not only do we find an open diary revealing our villainous masterminds innermost thoughts, theres a manifesto lying about in her lair titled Hatred of (character X) followed by reasons why she hates (character X). Resident Evil has never been subtle - which is arguably part of its charm - but this is clumsy. Fortunately, theres a breathless pace to Moira and Claires chapter that leaves little room to linger on the issue. Its a single escape sequence that requires you to battle invisible enemies and work cooperatively against the clock, and while its not the most challenging of chapters, it begins and ends with a couple of big story moments that add to a sense of high stakes. The same cant be said for Barry and Natalias chapter, which drags. While the section on a crane is a standout, most of the experience was totally forgettable, involving lots of walking back and forth, moving carts, and fighting the same clutch of enemies I killed last episode  including the same crummy boss. It doesnt help that chunks of their chapter take place in poisonous gas, so I was doing much of this while listening to the pair cough in a non-stop loop. Its a pace that carries on into the final boss battle. While Capcoms artists have clearly had a ball here  the final form of the Overseer is the most delightfully gross monster in Revelations 2  its a lengthy slog of a fight, and one with a surprising lack of any real challenge in Survival Mode. Still, the endings (a good one and a bad one) do clear up some of Revelations 2s mysteries, even if its a case of piling more on as a lead-in to a sequel. The two bonus episodes, Little Miss and The Struggle fill in further gaps, and more, theyre nice little compact stories in themselves. If youre still playing the excellent Raid mode, Resident Evil Revelations 2s shooting-gallery minigame, every gauntlet and character (including Alex) is now available to unlock. I continue to be impressed with the breadth  and addictiveness  of Raid mode, which extends Revelations 2a shelf-life well after the credits roll. Pros Claire's chapterSatisfying - if cryptic - endingFun bonus episodes Cons Barry's chapter dragsClunky expositionEnd boss is a dull slog Episode 4: Metamorphosis does a satisfactory job at tying up Resident Evil Revelations 2s mysteries, yet it also presents us with the clunkiest gameplay and dialogue weve seen in this series. While the bonus episodes and robust Raid mode extend the life of Revelations 2 beyond the credits, I wish it had gone out with a slightly bigger bang.", "date": "March 17, 2015"}