{"name": "Battlefield Hardline", "name_review": "Battlefield Hardline Review", "ref": "https://me.ign.com/en/hardline/103665/review/battlefield-hardline-review", "text": "In Battlefield Hardlines single-player campaign, I had as many chances to arrest the bad guys as shoot them  and I actually wanted to take them alive. That was only the first of many surprises. Unlike most video game bad guys, these enemies actually respect the badge of a police officer, and that gives you options. If you can get the jump on a group of three or fewer, you can order them to freeze by pulling out your badge and shouting. From there, you can arrest them... or gun them down. If you can stay out of sight, cuffing them is usually the superior option because it earns you more points, which unlocks more weapons and gadgets. If youre really good, these levels are designed intelligently enough to allow you to sneak around arresting bad guys one by one until, finally, when you look around, all you see are handcuffed, knocked-out criminals. Its not the kind of satisfaction I expected from a Battlefield game, but it requires patience and skill, and I was constantly delighted to see my enemies numbers dwindle while my magazines stayed full. Again, you can also run around shooting everyone, and that works too. Part of Battlefields legacy includes realistic weapons that feel and sound great, and thats no different here. When I forgot to disable an alarm and 10 enemies surrounded me, my rifle was a lot more effective than handcuffs. Second, Hardlines seven-hour campaign is  and I never thought Id say this  just as fun to play in stealth as it is running in guns blazing. Before entering combat, you can scan an area and tag enemies, explosives, or alarm systems so theyll appear on your radar. Its rewarding to formulate a grand plan from afar before jumping into the action. With proper preparation, enemies cones of vision appear directly on your minimap, Metal Gear Solid-style. If you can avoid detection, its entirely possible to make it through most areas without firing a single lethal round. My biggest gameplay gripe is that the unlock system doesnt appropriately award your playstyle. The best way to boost your level, which dictates the weapons and gadgets at your disposal, is to play stealthily. Strangely, mastering stealth mostly unlocks tons of big, noisy guns that made me want to shoot the place up. Likewise, if you want to shoot stuff all the time, youre not going to get your hands on new guns as quickly as the stealth player who doesnt need them. And there are very few unlocks that make stealth more interesting. The third surprise was that I cared about the characters. My disapproving partner, my stern boss, and the motley crew of ex-cops, coked-up criminals, and more than a few traitors  all of them felt like people, thanks to good writing supported by strong voice and animation work. Make no mistake, Hardlines drug-peddling plot is one youve almost certainly seen before, but it does such a fine job of making its characters funny, sympathetic, and believable that I wanted to keep playing to see what would happen to them. Hardline has a few issues with some of its enemies though  specifically, a group of one-dimensional Tea Party caricatures in possession of a safe-cracking robot. Theyre presented as over-the-top evil racists to give you an unambiguous sense of morality when gunning them down. They told my character You look Mexican, so Ill assume youre a burglar. An hour later I was facing off against their leader, who hooted and hollered as we engaged in tank-to-tank combat. Its fun, but hard to take as seriously as the subject matter suggests it should be. By comparison, the storys main villain is devious and cunning. Hes not the most interesting or memorable bad guy, but hes the kind of narcissist who keeps the secret switch to his penthouse vault inside a carved bust of himself. I can appreciate that kind of vanity, and going after him was less of a black-and-white decision thanks to a few shades of gray. The last surprise Hardlines campaign had for me was moments of comedy. Several laugh-out-loud moments make some self-aware fun out of its own crazy situations and mechanics. In one especially clever moment, after being flung into a room packed with enemies, the prompt to order enemies to put their hands up briefly flashes on the screen. In another moment, nearly $10 million worth of cocaine is ruined in an unfortunate forklift accident. Its not forced, and those nods to Battlefield fans makes the campaign that much more enjoyable. Battlefield has a history of looking and sounding excellent, and Hardline continues the tradition (though resolution is a disappointing 720p on Xbox One and 900p on PlayStation 4). Through gunfights, car crashes, and explosions, it all runs at a smooth 60 frames per second that stayed rock solid on PS4 and Xbox One. Multiplayer The tone of Hardlines multiplayer is downright bizarre. If a smack-talking gamer kid grew up to be a cop or a criminal, this game would represent them. Through in-game emotes, the characters trash talk each other, recite internet memes, and blare loud, obnoxious music as they ride to war. I didnt expect to hear my allies give their own takes on Oprahs famous You get a car line, nor did I expect to hear Woop! Woop! Thats the sound of da police, moments before a cruiser ran me over. At least in the short term, the emergent comedy is unexpected gold  and sometimes you wont see it until it literally flattens you. New gadgets, like the grappling hook and zip line, add further options by letting you reach higher vantage points and move around quickly in a way we havent seen in a Battlefield game in 10 years. Plus, your team can use them too, so they can use their gadget slots on something else. The issue is that these mobility items dont feel useful unless you grab both  a way to get up, and a way to get down  which limits your capabilities for what you can do when youre up there. I often had to sacrifice body armor, breaching chargers, or some other useful gadget. The most astonishing thing about Hardlines multiplayer is how successful it is in trying to please everyone. If you want more capital-B Battlefield, like the iconic Conquest mode and its large-scale vehicular combat, 66 players, and tons of weapons and gadgets to unlock, youll find it here. Even Commander mode is back, now dubbed as Hacker mode, and it lets you hijack cameras, release tear gas, and disrupt enemies across the map. Its a great way to be proactive without firing a weapon, if thats not your thing. If youre feeling franchise fatigue, its new modes and gadgets alleviate that. Hotwire is Hardlines fresh marquee mode, and it injects some much-needed mayhem into Battlefields 13-year-old multiplayer formula. Think of it as a special version of the traditional capture-and-hold Conquest mode, but, instead of holding structures, you have to keep control of moving vehicles; if you dont drive them fast enough, you dont get points. (Its the sort of like the concept of the movie Speed, but gamified.) When the most contested combat areas are mobile, the flow of the fight itself becomes dynamic, and its difficult to skirt around the fight. A sniper might feel safe, for example, crouched on a crane near the edge of the map. Second later two vehicles might roar by, packed with thugs firing their assault rifles. Those cars might then attract the attention of a heavily armed helicopter, belching out bullets from both its sides. Suddenly, your safety zone isnt so cozy. War can descend on you at any moment. Youre rarely comfortable, and youre never safe. That makes Hotwire a great mode that forces you to move around and adapt to new situations quickly. I had some trouble adjusting because of my old habits of patrolling one area (its not camping!), but I had a good time learning to adapt to the new reality. After a few hours of getting my butt handed to me, I was back in business. Some of Hardlines other modes take everything Battlefield is known for and do the opposite: 5v5, round-based games that can be over in seconds. In one mode, the police must rescue a bound hostage and escort him to safety. In another, a VIP must be escorted from one side of the map to the other. In both modes, you only have one life. The action is quick and brutal, and the big, unfolding combat narrative found in typical Battlefield games is absent. Its not missed, though, because, that story is replaced with awesome kills, tense standoffs, and plenty of amazing comebacks. The payload of nine maps isnt a ton, but because theyre so varied and change depending on the game mode, so I never felt like I was stuck in the same place for too long. Settings range from small, tight, urban areas to sprawling swamps, where an enemy could be prone behind any patch of grass or below any crippled dock. Pros Interesting charactersViable stealth and shootingFunny writing Cons Inappropriate unlocksSome simplistic enemies Battlefield Hardline impressively manages to please several different audiences at once. Its campaign is both a great shooter and a great stealth game, and its typical plot is spiced with interesting characters and sparse but punctual humor. The large-scale tactical multiplayer combat the series is known for is still as good as its ever been, but the speedy new Hotwire and round-based 5v5 modes provide both speed and thrills.", "date": "March 17, 2015"}