{"name": "Motorola Moto E (2nd Gen)", "name_review": "Motorola Moto E (2nd Gen) Review", "ref": "https://me.ign.com/en/motorola-moto-e-2nd-gen/103292/review/motorola-moto-e-2nd-gen-review", "text": "Motorola's recent resurgence has come on a willingness to quickly learn from its smartphone releases. Last fall's high-end Moto X was a huge improvement over the original, and it's still one of the best Android phones on the market six months later. And while the stakes are lower and the tech less cutting-edge, the new second-gen Moto E is likewise a much better phone than its predecessor. That's a relative statement, of course. While fancy flagship devices battle it out for several hundred of your unsubsidized dollars, the Moto E comes in at a very attractive $150 unlockedno contract needed. That's for a 4G phone with a quad-core processor and near-stock Android 5.0 Lollipop, which is still a rare commodity amongst budget handsets. Expectedly, the phone comes with some compromises, but at this price, nothing is a deal-breaker. Last year's debut Moto E was solid for a cheap smartphone, but still a bit underpowered. Thankfully, the new model bumps the specs in meaningful ways. The biggest is the inclusion of 4G LTE connectivity, albeit only via GSM networks for now (sorry Verizon and Sprint users). LTE is pretty essential at this point, even for a lower-end device, and it makes the Moto E significantly more worthwhile. I tested it on AT&T's network across Chicago and had expectedly great results throughout. The quad-core 1.2GHz Snapdragon 410 processor within provides enough power for most everyday needs. It's a jump up from the dual-core Snapdragon 200 in the last model, and getting around Lollipop is a mostly fluid experience. I noticed sluggish spurts here and there while flipping through the OS, but it's nothing that'll kill your flow. The Moto E is a much better gaming device than its predecessor, as well, now able to handle recent 3D gamesbut not always without small issues. Even a game like Crossy Road (not really a graphics powerhouse) had some hitches until I disabled shadows. Then it ran great. Lollipop is a wonderful addition that sets this budget phone apart from a lot of its low-end competition. Some recent flagship phones still don't have the current version of Android, yet this $150 phone carries it out of the box. Google's superb Material Design aesthetic is sleek and smooth, notifications are more intelligent, and interface elements are often easier to understand than before. It's a big overall upgrade over previous versions. And on the Moto E, it's very nearly stock Android. Motorola calls it ~pure Android,~ which means it's almost entirely the core experience with just a couple of small, useful tweaks. For example, tapping or bumping the phone lets you peek at notifications, which you can view with white text on the black backdrop (which consumes little energy). You can also flick your wrist twice anywhere to bring up the camera app, which is handy when a photo opp suddenly appears. The new Moto E packs a 4.5-inch display, although it's not a great one. In fact, it runs at the same resolution as the earlier model's 4.3-inch screen (960x540), but the larger size makes for a less crisp image. At 245ppi, it's better than some low-end devices, but text comes off jagged and images can be blurry. It's a noticeable drop compared to the 720p screen of the current Moto G (we reviewed the 3G version, shown pictured above on the right), and if you're used to higher-end devices, it may well prove the Moto E's biggest weakness. At least the contrast is on point and the colors are vivid, but I wanted more brightness. The handset itself is a bit chunky and has a rounded backbut if there's one thing that immediately stands out, it's how dense and weighty the phone feels. And that's a good thing: it almost comes off like a rugged, wilderness-ready phone. While it may not be marketed for durability, the Moto E feels like it can take a beating. It's not the most stylish phone around, but at least you can swap out the grippable colored plastic band, which snaps right on and takes just a moment to replace. You're not getting to the battery with this design, howeverbut you probably won't need to. The Moto E has a generous 2,390mAh battery within, and with such modest specs on the phone, it'll easily give you a full day to work with. Maybe two days, even, if you're not running a lot of high-performance apps or streaming media. On multiple instances, I got through a full day of moderate use with more than 50% battery life remaining, and that's with the display at maximum brightness. It's one of the surprise perks of this budget wonder. I can't say the same for the camera, which doesn't outshine the phone's low-end origins. The back shooter is a 5-megapixel camera with no flash, which means it'll take adequate Instagram or Snapchat shots, but not much worth saving. Totally still subjects produce solid, albeit washed-out shots, but add movement or remove good lighting and expect lots of blurriness. And the front camera is VGA quality, which means it's about the same as an ancient webcam. I wouldn't even bother sharing a selfie from it. Onboard storage isn't great, either, with just 8GB unformatted. That's double what was found in the original Moto E, but you're left with less than 5GB of space to work with out of the boxI downloaded a few apps and games and filled it up almost instantly. Luckily, microSD support means you can add another 32GB to the tally with ease. Pros Fantastic pricePure Android 5.0Solid performance Cons Fuzzy screenMediocre camera The new Moto E has a few serious standout perks: 4G LTE service, near-stock Android Lollipop, and generous battery life. And it's one heck of a deal at $150, although the trade-off comes with a fuzzy display and weak cameras. Given the choice, I'd spend the extra $40 and get the LTE version of last fall's Moto G, which has a much better 5-inch screen and a slimmer buildbut if your goal is to get a capable 4G Lollipop device for as little scratch as possible, the Moto E will do the trick.", "date": "March 8, 2015,"}