{"name": "Middle-earth: Shadow of Mordor: The Bright Lord", "name_review": "Middle-earth: Shadow of Mordor - The Bright Lord Review", "ref": "https://me.ign.com/en/middle-earth-shadow-of-mordor-the-bright-lord-dlc/102781/review/middle-earth-shadow-of-mordor-the-bright-lord-review", "text": "When I play an expansion like Middle-earth: Shadow of Mordors The Bright Lord, I have to wonder if developers sometimes misunderstand what made their game so successful in the first place. In this DLC, Monolith goes out of its way to make up for the lackluster final boss fight in the main game by adding a challenging face-off with Sauron himself, but takes steps backwards when it comes to the reason I really loved Mordor: its dynamic uruk enemies that created countless mini-boss battles throughout the campaign. A flashback story puts us in the still-corporeal shoes of Celebrimbor, as Sauron abducts his family. We know how this ends, and there are no twists  just Celebrimbor and Sauron smack-talking like pro wrestlers for four or five hours as you take over the Undun section of Shadow of Mordor's map (again). The good news is that Celebrimbors combat style shakes things up. Compared to Talion, hes much more about branding enemies stealthily or in bulk and building up an army, using his Shadow Brand ability to brainwash any enemy you can see, or his improved Wraith Flash to brand multiple enemies at once. You can even summon a posse of pre-mind-controlled uruks to your side at almost any time. Those are wildly powerful moves (and hordes of glowing-eyed uruks can take a toll on frame rates), but they're kept in check by the fact that Celebrimbor can't take as much punishment as Talion, so every so often you have to massacre them all to restore your life and start the cycle over. Archery takes more skill, too, because you dont get the slow-motion effect when you draw your bow anymore, so it's way harder to headshot your way through a crowd of incoming uruks. But Celebrimbor is wearing The One Ring, which he can charge up by branding enemies and activate for slow-mo and infinite, unblockable execution moves for around 30 seconds. (And that's before doing any side missions to upgrade the duration.) The effect of this power on Mordor's memorable Captain and Warchief fights is completely ruinous. Even though uruks can now reach level 25, any fight can be won by simply activating the ring and mashing the execute buttons until its all over - their resistances are completely nullified. Its the same ridiculous ~win-button~ mistake Warner made with Batman: Arkham Origins Shock Gauntlets, and here you start out with it from the beginning. Power like this defeats the purpose of combat and makes wins feel unearned, and I found myself avoiding using it except when I absolutely needed to. Also, The Bright Lord actually makes its Warchiefs and Captains feel less dynamic. You cant kill Warchiefs, only dominate them, because theyre actors in the story. Meanwhile, there are no captains jockeying for position or advancing independently of your actions in the background, so there are no dynamic duels, feasts, or executions to interrupt. It makes the world feel static and scripted, which is a shame, because the behavior of those enemies is what I like best about the main game. That final boss battle, though, is pretty good. Its built around managing a large crowd of enemies to build up your powers before taking on the big threat, which is a heck of a lot more interesting than a quick-time event. I just wish the rest of The Bright Lord were built around enhancing Mordors strengths rather than patching up its weaknesses. Pros New combat styleSauron fightHigher-level enemies Cons Win-button Ring powerLess dynamic captains When I recommend Middle-earth: Shadow of Mordor, it's because of its outstanding dynamic battles with randomized uruk Captains and Warchiefs. The Bright Lord undermines that greatness with a new power that renders those fights irrelevant, and focuses its energies on a big boss battle. [poilib element=~accentDivider~] <em>Dan Stapleton is IGN's Reviews Editor. You can follow him</em><em> </em><em><a href=~https://twitter.com/DanStapleton~ target=~_blank~ rel=~nofollow~>on Twitter</a></em><em> </em><em>to hear all about how awesome PC gaming is, plus a healthy dose of random Simpsons references.</em>", "date": "Feb. 25, 2015,"}