{"name": "Kirby and the Rainbow Curse", "name_review": "Kirby and the Rainbow Curse Review", "ref": "https://me.ign.com/en/kirby-and-the-rainbow-curse/102500/review/kirby-and-the-rainbow-curse-review", "text": "Kirby and the Rainbow Curse is a brisk, gorgeous platformer that has no qualms with taking off the training wheels. Built on the same tenants as 2005s fantastic Kirby: Canvas Curse for the original DS, this Wii U sequel places all of the power in your stylus, which makes for a refreshing experience that feels different than most 2D platformers. Its dependence on touch controls make it a slightly awkward fit for the Wii U, but this beautiful world looks and plays great on the GamePad. Like in the DS original, you don't directly control Kirby in the traditional platforming sense. Instead, you rely on the stylus to draw a track using a finite amount of rechargeable ink for the little pink puff to roll on. Its sort of a weird concept to wrap your head around at first, but once I settled into a groove, I was avoiding enemies, building momentum downhill, and completing levels without ever letting Kirby touch the ground. More complex tactics, like bocking projectiles with hand-drawn walls and collecting 100 stars to transform into a giant bullet make control of Kirby a deep, and rewarding endeavor. And youll definitely need to hit your groove, because Rainbow Curse quickly bares its adorable fangs. One-hit kill enemies, tricky bosses, and levels littered with traps make for some really tough, but ultimately rewarding challenges. That might be a little scary if you were hoping to share this cartoonish-looking game with a more novice gaming partner, but the good news here is that 1UPs are in abundance, so having to replay a particularly tricky section isnt the end of the world. Rainbow Curses 28 stages, which took me about seven hours to get through, keep you moving at a brisk pace. Levels change in style and layout all the time, and throw in some much-appreciated variety like these vehicular stages. That said, I felt that the average level by and large was a bit too long. Canvas Curse kept stages to brief, tight challenges that brought back shades of Super Mario 3's brevity, whereas this follow-up tends to deliver a few too many levels that outstay their welcome. While I loved making my way through the levels for their visual variety and beauty -- going from sunken ships to cloud kingdoms to fiery volcanoes made the adventure fly by in a breeze -- I never really felt the urge to stop and collect the wealth of doo-dads scattered across the world. Where a game like Yoshis Island encouraged 100% completion in order to unlock some of its finest stages, Kirbys in-game trophies, statues, and music samples didnt really entice me to dig into every nook and cranny. So lets talk about the elephant in the room: Kirby and the Rainbow Curse is absolutely gorgeous. The entire world and all of its inhabitants have a unique, hand-molded look to them that makes it unmistakable among its peers. It joins the ranks of Tearaway, Okami, and a handful of other fantastic experiences that truly feel like youre playing inside of a tangible world. Small touches, like fingerprint indentations on character models, separate Kirby from any other game out there. Particularly impressive are the bosses. The iconic Whispy Woods huffs and puffs like a stop-motion creature ripped straight out of a Laika movie. The tactile nature of the world doesnt just come across aesthetically, but also in the way you interact with the each level. Chip away at blocks of clay and using your rainbow powers to shield yourself from waterfalls really helped solidify the bond between my hand and the game world. That said, the stylus-focused nature of the mechanics means you have to keep your eyes on the Wii U GamePad at all times, meaning that you miss out on the full beauty on your television. To soak in all the detail, Id rather watch someone play than play again myself. Speaking of, Rainbow Curse supports up to three additional players, each of which can control their own Waddle and help maneuver Kirby around the world. It doesn't really add a whole lot to the experience, but the drop-in, drop-out nature of the multiplayer makes it a nice experiment to test out. Pros Gorgeous worldGreat challengeUnique mechanics Cons Bland collectablesOverly-long stages Like its DS predecessor, Kirby and the Rainbow Curse is a delightfully charming and unique platformer. Its world is varied, its challenge is high, and the hand-molded look and feel make for a remarkable journey. The never-ending barrage of charm more-than makes up for some of its less-than stellar elements. Theres a pot of platforming gold at the end of this rainbow.", "date": "Feb. 19, 2015,"}