{"name": "Fahrenheit: Indigo Prophecy Remastered", "name_review": "Fahrenheit: Indigo Prophecy Remastered Review", "ref": "https://me.ign.com/en/fahrenheit-indigo-prophecy-remastered/102136/review/fahrenheit-indigo-prophecy-remastered-review", "text": "When it originally released in late 2005, Indigo Prophecy was both ahead of and an unfortunate product of its time. Its concept of controlling both a crime and its investigation from different perspectives, coupled with a timer-based dialogue system, created the sort of storytelling fluctuation and intensity that Telltale made its name on in recent years. Unfortunately, some of the last decade's worst ideas are present, too, with annoyingly frequent quick-time events acting as a substitute for genuine action and awful stealth sequences that often derailed my effort to enjoy Fahrenheit: Indigo Prophecy Remastered's visual upgrades and still-gripping story. A majority of that story stays grounded by focusing in on three endearing characters. Lucas Kane struggles with being accused of a crime he doesn't remember committing and equally mysterious superpowers he's developed. Detectives Carla Valenti and Tyler Miles must uncover the deeper mystery as Carla becomes consumed and Tyler questions his dedication. The initial weirdness of tackling both sides of a case quickly subsided, as I rarely felt the need to intentionally sabotage anything on either side. If anything, seeing the twists created for the detectives due to Lucas' prior actions gives reason to be as thorough a fugitive and investigator as possible. This is due in no small part to the opening diner setting, which has so many permutations on both the criminal and investigation side that it's difficult to resist the urge to start over again a few times to see what mightve happened. Fortunately for me, the multi-platform release provided that opportunity, as I tried the scene out on both mobile and PC platforms. The ahead-of-its-time dialogue system where characters have a limited window to react (they default to the worst response if time expires) adds a much-needed sense of urgency to the adventure game-style proceedings. Long before Mass Effect and Walking Dead based major character moments on quick decisions, personal relationships and the direction of the investigation hinge on big decisions made in a small amount of time. Some of the text descriptions don't quite match what is actually said by the protagonists when theyre selected, and the system doesn't carry the gravity of modern adventures and RPGs, but it holds up far better than most decade-old gaming systems. With an oppressive snowstorm turning New York into a ghost town, the cast is quite small, but the few partners, relatives, and friends are enough to flesh out the main characters. It's only when the story moves beyond the slightly offbeat occult mystery into an overwritten reality-questioning mess that Fahrenheit: Indigo Prophecy Remastered stops being a gripping mystery adventure. Fortunately, by that point the end is so close you'll probably just want to see where the madness leads. While there's a few miscast characters (and some supposed natives fail to display any sort of New York accent) the voice acting is almost at the level of today's top adventures. When the soundtrack sticks to the orchestrated score, it's near-Hollywood level, but the licensed songs can't consistently claim the same quality. While there's some good songs that play during the detectives downtime, Lucas' actions are underscored by grating mid-2000s nu-metal that hasn't been updated for the times. The major updates in Fahrenheit: Indigo Prophecy Remastered come in the form of updated graphics and new control options, but as welcome as both are, they cause new issues on PC and mobile devices, respectively. The improvement in texture quality and high-definition optimization make some of the characters (particularly Carla and to a lesser extent, Lucas) look as though they could star in an adventure from five years ago rather than almost 10. However, many NPCs and co-star Tyler still have painted-on expressions that don't befit the Remastered moniker, and the inconsistency is more distracting than if theyd never been updated at all. More distressing than some of the cut corners are the many new bugs that have come with this reissue. From a weird quirk that keeps Steam account names with certain symbols (such as |) from even starting a game, to frequent crashes accompanied by characters falling out of the environment, the stability of a two-generation-old version sometimes becomes more attractive than any upgrade. As far as controls go, the annoyingly hyperactive button-prompt sequences remain unmanageable regardless of whether you choose to use a controller or a keyboard on PC. On mobile devices (where crashes are far less frequent), tapping the prompts is a major improvement, but general movement and environment interactivity becomes a chore. No matter which control scheme you decide on, the rare stealth sequences remain the biggest source of frustration. Even though only two of the almost 40 chapters include stealth, the lack of direction and feedback in those scenes makes those two so unfair that it almost overshadows the majority of what works within Fahrenheit: Indigo Prophecy Remastered. Pros Interesting crime conceptMostly endearing characters Cons Terrible action sequencesPlot eventually stumblesBugs & visual gaffes It's a shame that more significant improvements weren't made to Fahrenheit: Indigo Prophecy Remastered, since playing both sides of a murder conspiracy is still such an interesting concept that's not often done right. However, the frantic button prompts, still-stupid stealth, and newly-introduced glitches make this Remaster way too unrefined.", "date": "Feb. 13, 2015,"}