{"name": "Polk Striker Zx Gaming Headset", "name_review": "Polk Striker Zx Xbox One Gaming Headset Review", "ref": "https://me.ign.com/en/polk-striker-zx-gaming-headset/101803/review/polk-striker-zx-xbox-one-gaming-headset-review", "text": "Polk's brand carries a lot of weight in the audio world, but its debut Xbox One headsetthe 4Shot (launched at $160) from last springdidn't impress, with a poor-sounding mic and cheap-feeling build. With the Striker Zx, Polk dips down into the entry-level market, with a $90 stereo offering that is attractively styled and delivers solid sound, but has a couple issues of its own. What's similar is the low-grade feel of the build, although the Striker Zx features a totally different design from the 4Shot. It's a more traditional-looking gaming headset, although the large L-shaped arm that affixes each can to the headband is a distinctive edge. The grey-and-orange version we tested (it's also in black, or grey with blue accents) almost makes it a perfect complement to Microsoft's Titanfall controller, although the orange here is much sleeker and brighter. Unfortunately, that part also looks and feels like very cheap plasticlike the kind you'd find on a Happy Meal toy, or shatter by lightly stepping on it. And I had varying experiences with the arm on the two different headsets I tested: the first was very loose and rickety, making it feel like I could crack the unit apart by trying to rotate the cup just further than it allows. But the second unit felt firmer and less concerning. Is there really that much manufacturing variance between units? Luckily, the headset fits well on the head. It's lightweight, well padded on both the band and the ear cups, and offers just enough pivot with the cups to rest firmly atop an array of different head shapes. The Striker Zx attaches via a standard headphone jack (so it can be used with various devices) to the included wireless headset adapter, which plugs into the Xbox One controller and provides buttons for volume, muting, and shifting the audio mix between game and chat. The stereo sound provided by the Striker Zx is really solid for a sub-$100 headsetit's crisp, albeit a bit confined-sounding. I didn't get the intense clarity of the highest highs or the full low-end thump of the bass, but the overall soundscape is immersive when playing. The promised spatial sound certainly can't compare to what you'll find on 5.1 surround headsets, but it does an admirable job of capturing whizzing bullets and other positional audio notes found in games. And the mic issues from the 4Shot aren't repeated here. The flexible boom mic can be pulled out a couple inches from the left ear cup, and it'll pick your voice up well and allow others to hear you with clarity. Also, the chat loop feature pumps the mic audio back into your headset by default (although you can disable it), and hearing what you say helps conversations feel more natural. Just be sure to hit mute when not chatting, otherwise you'll hear your every movement and touch of your body distractingly amplified into the cups. Interference issues I tested two different headsets because my experience with the first one was spotty: I noted recurring stuttering and pops in the audio while playing various Xbox One games. In Call of Duty: Advanced Warfare, pumping out shotgun rounds often led to a momentary loss of sound in the headset, like it couldn't handle the sudden burst of brash audio. Elsewhere, I would hear little hitches here and there: nothing huge, but enough to recognize. And I even had a full audio drop while playing Forza Horizon 2. Just total silence for no clear reason. Initially, the second headset I tried worked great: no stuttering or significant pops for a lengthy play session. But as I rotated through various games and scenarios in the days thereafter, I experienced those same issues again. Gunfire in the Advanced Warfare campaign was a common cause for half-second audio drops, but even abrupt music cues in NBA 2K15 seemed to disrupt the audio feedagain, like the headset just couldn't process the sudden change quickly enough. I performed the bulk of my initial testing with the Xbox One console inside a small, wooden stand below my living room TV, which houses other consoles and a cable box, with a router sitting on top. And there was always direct line of sight between the console and the controller about nine feet away, with no physical barriers between them. Still, the audio issues persisted during most play sessions. That is, until I moved the console and tried it on top of the stand, as well as on a dresser in another room entirely. In both cases, the headset worked well, with no notable audio concerns. Polk suggested that router interference could be a cause, but removing the router from the area didn't solve the issue in the original location. Instead, it appears to be a problem with having the console inside a partially enclosed wooden standa common scenario for many gamers. But it's not an issue specific to the Polk headset. I also tried out Microsoft's Stereo Headset, which is comparable in build and sound quality and uses the same type of controller connection, and it also demonstrated similar audio hiccups during play in that same setup. Polk says these kinds of interference problems are rare, and a look around the Internet seems to bear that out. Chances seem good that many users will have no audio issues with the Striker Zx whatsoever. But it's possible with these kinds of controller-connected options, whereas pricier headsets with a wired optical plug-in seem to work perfectly fine regardless of your setup. I didn't ultimately factor the interference issues into my verdict as I was able to isolate them and find ways to avoid the problem. However, it is a potential nuisance that may require you to alter your gaming environment to resolve, so it's worth mentioning. Pros Comfortable fitSolid soundChat loop feature Cons Cheap-feeling partsPossible interferencePricier than MS headset As with most gaming accessories, the ~you get what you pay for~ mantra applies strongly to headsets. Polk's Striker Zx is lightweight and comfortable, and the mic works much better than on the company's last offering. The sound quality firmly falls into ~solid but unspectacular~ territory, howeverwhich makes sense considering the price leveland the physical build leaves something to be desired.<br><br> Also, with Microsoft's very good Stereo Headset going for $50-60 these days, the Striker Zx seems a bit pricey by comparison. (Polk's offering has the advantage of chat loop functionality, however.) Still, as long as you can dodge possible sound-muddling interference, it's a decent option on the lower end of the headset price scale.", "date": "Feb. 8, 2015,"}