{"name": "Chaos Heroes Online", "name_review": "Chaos Heroes Online Review", "ref": "https://me.ign.com/en/chaos-heroes-online/101712/review/chaos-heroes-online-review", "text": "Sexy school girls and maids are not what I think about when I read that a games style is supposed to be a homage to its Warcraft III roots. For the most part, I enjoyed playing Chaos Heroes Onlines fast-paced, defense-focused spin on the MOBA formula, but I didnt like looking at or listening to it, and some broken systems mean it has a lot of improving to do before it becomes a game worth investing time into. Chaos Heroes Onlines main map, Ancient Forest, has the familiar MOBA layout: three lanes, a base for each team of five, a river that divides the map, and a jungle filled with neutral enemies on both sides. Theres a Warcraft III feel to the art of the map (as this game, like DoTA, sprang from Blizzards RTS), but the bland, low-resolution textures are eyesores, and character animations are awkward. The interface is fine, unless it automatically reverts to the classic Warcraft III mode, in which case the frame is huge and blocks too much of the screen. Pop-ups announcing killstreaks are also guilty of obstructing the action. One thing that really sets Chaos Heroes Online apart from other MOBAs (especially League of Legends and Dota 2) is its pace. Everything moves quickly, and it feels great. Leveling your character is fast, you can buy items from anywhere on the map (so you dont have to leave the lane or jungle), and with cheap survivability items, its easy to jump in and out of team fights. With a hard 50-minute time limit, things need to move fast to push past the four layers of defense that protect the enemy teams base. Pushing down towers or the powerful sentinels is difficult alone, so theres a nice emphasis on teamwork and team composition. In addition to Ancient Forest, theres another custom-only map, Shrine of Life  a much smaller map that has a 20-minute deathmatch mode. It was nice to have some variety, but it was a big let down when I couldnt find others to play with. In fact, the player base for Chaos Heroes Online is so small that people in the general chat had to work together just to get a quick match in Ancient Forest going. My custom game didnt stand a chance of getting a full lobby, so I resorted to playing with bots. That didnt go well, because the bots in Shrine of Life are terribly broken. My bot teammates often didnt respond when I started team fights and they would sometimes stand still in a corner of the map until something happened. The same goes for the enemy bots. I had to sacrifice myself to four enemy bots in order for them do something other than just stand in the river. (I didnt experience these AI issues in the Ancient Forest, for what its worth.) Ive pretty much given up on Shrine of Life as a result. If you do join the tiny player pool, youll find the 78 heroes available for purchase or free with the weekly rotation are fun and easy to learn. Almost all, except some support heroes, heavily rely on their right-click auto attack, but this doesnt mean their skills arent useful. For example, Chans right-click can be crazy strong, but combined with Earthen Ring  a skill that traps heroes in a circle of rocks  and his damage spell Flaming Bite, hes a major powerhouse in a team fight. After a few minutes, it was easy to learn how to properly use the skills in order to put out the most damage possible. Theyre not overly complicated, and that makes playing as new heroes more inviting and enjoyable. Playing against them, on the other hand, is made less fun by the confusing and off-putting art style of their skins. By default, theyre in keeping with the Warcraft III fantasy theme, but purchasable skins look like shamelessly sexed-up anime characters or weird bobble heads, which ensures that matches look like a visual mess of clashing styles. Worse, some skins change the gender and personality of a hero, to the point where they might as well be a totally different character. That can be confusing in battle because its harder to know what a given character can do at a glance. And, save for a select few, the voice acting for both male and female heroes is just bad. Thankfully, theres an option to turn off their annoying in-game banter. Pros Cool hero skillsFun gameplay Cons Broken botsInconsistent styleAnnoying UI Chaos Heroes Online has a lot of good ideas, but most are immediately countered with major problems. I want to enjoy its fast-paced gameplay and simple, intuitive skills, but I dont like looking at its bland textures, interpreting its confusing character designs, or listening to its bad sound. On the whole, Chaos Heroes Online is too often an unfortunately annoying experience.", "date": "Feb. 5, 2015,"}