{"name": "Raven's Cry", "name_review": "Raven's Cry Review", "ref": "https://me.ign.com/en/ravens-cry/101647/review/ravens-cry-review", "text": "In medieval times, dangerous and unexplored areas of the sea were marked on maps with drawings of sea monsters and the words, Here be dragons, so as to be avoided. Well, Ravens Cry is lousy with dragons. The first time I booted it up, it crashed. The second time, another crash. On the third, I was finally able to begin my adventure as the hook-handed pirate Captain Christopher Raven, but that shaky beginning was a pretty clear sign of things to come. In fact, its a fitting analogy for Ravens Cry itself: its naval combat delivers high-seas adventure, but it never finds its land legs. Ultimately, my voyage through the main quest was sunk by a game-stopping bug, but I dont feel like I missed out by not being able to finish the story. Gameplay is divided into two separate and unequal aspects: The best part is on the open seas, where youll captain a progression of unlockable and upgradeable ships, from the lowly schooner to the mighty Man-o-War, scuttling boats and fleets in randomly generated encounters with the British, French, Spanish, and pirate factions vying for control of trade in the West Indies. Maritime battles play out fast, in real time, and somewhat tactically. Theres some skill involved in choosing the right munitions to damage a ships sails, hull, or crew, and then adjusting the elevation and aim of each salvo to compensate for the crests and bows of the seas churning waves. The ship management lends a sense of personal customization to the otherwise on-rails nature of Ravens Cry. Youll find officers scattered throughout the Caribbean that can be hired augment your ship  a good carpenter, for example, can make repairs at sea if youve got the necessary timber and sail cloth onboard, saving you a strip back to shore. And ship upgrades provide considerable power, speed and durability: The first time I annihilated an attacking pirate galleon with a single broadside of cannons, I couldnt help but laugh -- the scourge of the seas, indeed. Choosing whether to sink a vessel for a small chunk of experience and a few trinkets, or risk getting close enough to board and plunder their cargo helps make naval combat worthwhile, especially when those plundered goods can be sold for a premium at the port. My favorite moments in Ravens Cry are all about attacking a convoy of ships, disabling them before boarding, and selling their cargo of tea, coffee, silk, tobacco, and more to purchase upgrades my ship. There's a hint of something great here. But on land, Ravens Cry is a linear string of errands and side quests, made worse by sluggish movement and rigid controls and poor combat. Getting stuck on the environment and being unable to hurdle waist-high obstacles doesnt feel like the way a swashbuckling pirate should interact with the world. One of my least favorite chores is the long, uneventful walk from my ship to the merchant, the shipwright, and the trader, and then back to the docks to board my vessel. It might not seem like an issue, but with such cumbersome traversal on land, these mandatory pit stops for repairs and to offload cargo kill what little momentum Id built up out on the water. Its even worse when youre forced into land-based combat. And I say forced, because nothing about Ravens Crys combat is fun, so I avoided it whenever possible. Its a barebones system comprised of a light and heavy sword attack, a few secondary items like a flintlock pistol, and a parry and dodge mechanic that suffer from clunky, unreliable input, and a nearly useless targeting system. Though fancier moves can be unlocked, I never found anything more effective than simply mashing the quick attack. But thanks to the poor AI and general inefficiency of combat, youre able to simply run past most engagements without so much as a scratch, so its often irrelevant except to gawk at how poorly its put together. Visually, the aesthetic of the Caribbeans weathered port-town environments are well realized, and Ravens Cry can look respectable at times. Technical problems popped up constantly, though. I couldnt maintain a steady framerate on my Intel Core i5 3.4GHz processor and Nvidia GeForce GTX 760 GPU, and the textures, environments, and characters that pop in and out are ultimately too distracting to be overlooked. But audio is Ravens Crys greatest weakness. Though the ambient soundtrack is actually quite pleasant, the voice work is particularly, noticeably bad, with the majority of characters delivering their lines in shades of awkward, and even comical. Captain Raven himself is the worst offender. Barking his lines as surly threats would be fine, because, you know... pirate  but his inflection never really seems to change. Its either total ambivalence or psychotic zeal, and nothing in between. Elsewhere, its almost funny how inconsistent conversations are. Some characters dont have voice overs, so conversations are fully voiced on one side, and subtitled on the other. Sometimes theyll switch to subtitles mid-conversation; or their words cut out completely; or the camera is pointed at their feet, or a wall, or the sky, or anywhere other than their faces. There are so many glaring, broken moments any time two people try to exchange words in Ravens Cry that eventually I just wanted to start skipping the dialogue and pretend it didnt exist. Fittingly enough, with all these technical issues weighing down, my journey ended when that weight became too much to bear. At nearly a dozen hours into Captain Ravens adventure, during a main story quest called The Sleeper Awakes, my game repeatedly crashed at the same section, every single time. Despite reloading earlier saves and trying to work around the problem, this halt in progression has prevented me from wrapping up the tale of revenge. Pros Naval battles and trading Cons Sluggish movementClunky combatBroken dialogueGame-stopping crashes I genuinely do think the potential for a good pirate game is in here, somewhere, but Ravens Cry is a mess of bugs, hazards, hiccups, oversights, and progression-halting crashes. If you never set foot on land, its ship-to-ship combat might be respectable, but this adventure insists on taking you places no self-respecting pirate captain should go. Sail clear of these trouble waters  here be dragons.", "date": "Feb. 4, 2015,"}