{"name": "Game of Thrones: Episode 2", "name_review": "Game of Thrones Episode 2: The Lost Lords Review", "ref": "https://me.ign.com/en/game-of-thrones-episode-2/101550/review/game-of-thrones-episode-2-the-lost-lords-review", "text": "Game of Thrones Episode 2: Lost Lords moves quickly through its 90 minutes. We get a diverse set of color palettes and environments as we jump between existing locations Ironrath and Kings Landing and new ones, the conquered slaver city of Yunkai and The Wall. Its eventful, alright, but its all pretty straightforward, and notably devoid of the duplicitousness and back-stabbing the HBO show is known for. Asher Forrester is introduced as a cocky, swashbuckling sellsword. His scenes are almost pure banter with his sidekick, Beskha, and quick-time event action, so hes given no decisions tougher than whether or not to kill a couple of people who just tried to kill him. Hes likable enough, but hopefully theres more to him than this. Meanwhile, a surprising new playable character arrives at Ironrath to pick up the story, and we get to see the Forrester family cope with their losses in some well-written scenes of grief and anger. There was some disappointment when I saw how little my choice of who to appoint as Ethans chief advisor actually mattered, though. Gared Tuttles introduction to life in the Nights Watch closely retreads Jon Snows story. Sure, its important to establish which of his two fellow recruits will be a friend and which will be an enemy, but its an obligatory and mostly dull episode for him. Quick-time event combat training and simple archery target practice dont make this a better game. Even an appearance by Jon Snow himself does little to pick up the pace. Mira Forrester remains the highlight of this series. She doesnt match the tension of the first episodes throneroom encounter with Cersei Lannister, but the choice of whether to betray Margaerys Tyrells trust was the toughest one in Lost Lords. Its notable that unlike most decisions in Telltales games, theres no timer - I sat there and agonized over the pros and cons for a minute or two before making my decision. Its those moments where Telltale achieves some of Game of Thrones shades of moral gray. Other than that, I'm still waiting for the momentum to get going. Though theres a murder plot, theres not much of a mystery behind it. The Forresters struggle for control of the ironwood intensifies, but their quest for allies to help wrest it from the rival Lord Whitehill involves little by way of intrigue. And were no closer to learning the truth about the North Grove. Pros New locationsIronrath's griefMira's dilemma Cons Lack of intrigueNight's Watch retread While the story of these likable new characters continues after the shocking events of the premiere, the second episode makes it feel like a false start by neglecting to advance the plot in interesting ways. To live up to its name, this Game of Thrones series is going to need more than unexpected deaths - it needs those deaths to be in service of keeping tantalizing secrets.", "date": "Feb. 3, 2015,"}