{"name": "Dying Light", "name_review": "Dying Light Review", "ref": "https://me.ign.com/en/dying-light/101518/review/dying-light-review", "text": "It may be squalid and zombie-infested, but Dying Light's city of Harran isn't a depressing wasteland  it's a vibrant, ambitious, open-world playground. Here, buildings are for climbing, the undead are there to be destroyed in creative ways, and there's always something interesting to be discovered nearby. It takes a while for that to become clear, though; at first, you might even think Dying Light is really about running scared from mobs of seemingly unconquerable zombies, who can quickly drain your stamina and wear out your improvised weapons. Don't be fooled. Yes, it's a struggle to survive in Dying Light's early hours. Combat is initially clumsy, with the diverse and deadly zombies able to soak up a disturbing amount of punishment before they die for good. Jumping  which is unintuitively mapped to shoulder buttons on consoles  can take a while to get used to. Getting mobbed is usually a death sentence. So is attracting the attention of the much more dangerous things that come out when daytime dynamically gives way to night, at which point the focus shifts to tense stealth  or, if youre discovered, an adrenaline-pumping sprint for the nearest safe point. Before long, though, you'll build up a skill set that turns your rotting foes into objects of fun, letting you vault across their shoulders, quickly slice them apart with dramatic slow-motion kills, or trick them into gathering around explosives before blasting them all into the sky. Even nighttime becomes an opportunity to raise skills faster thanks to increased XP gain, rather than a period of sheer terror. It all feels great, too; once you adjust to the controls, Dying Light's first-person parkour becomes natural and fluid, and weaving high-speed paths through its decaying slums and picturesque old-world buildings is so much fun that I almost don't hate the lack of a fast-travel option. Combat, meanwhile, gets increasingly satisfying, although it never quite loses its awkwardness. Even when expertly shredding zombies with elementally charged tools of death I built myself, strikes are still heavy and clumsy. And while the guns you'll find later can pop heads from a distance, their low rate of fire and zombie-attracting noise makes them more of an occasional quick fix than a game-changing weapon. To Dying Light's credit, though, your adversaries are surprisingly capable; while the rank-and-file Biters are dumb and fun to manipulate, more powerful enemies  like the quick, agile Virals  are formidable close-quarters opponents, ducking your strikes and sidestepping out of your reach while looking for an opening to attack. Hostile bandits are even deadlier, able to dodge and block at close quarters, throw knives from a distance, and use guns and group tactics to kill you if you get overconfident. That Dying Light's world is so entertaining is important, because it's unexpectedly huge. Finishing the campaign took me more than 34 hours, with a 68 percent completion rate. The story is serviceable enough, focusing on an undercover agent who becomes a savior to infected survivors and a thorn in the side of a maniacal warlord, but the most surprising thing about it might be its lack of surprises. Similar games have primed me to expect shocks and betrayals that will yank the metaphorical rug out from beneath me, and yet apart from a few big twists early on, Dying Light plays it mostly straight, with little nuance and few hidden agendas from its interesting (but underdeveloped) characters and entertainingly clich villains. In a way it's almost refreshing, even if the end result is nothing special. A big chunk of my time, though, was spent on detours into side quests, which are where the storytelling really shines. Taking on one of the many requests from random survivors might lead to something ordinary, like a fetch quest  but more often than not, they're multi-part adventures with their own short storylines, which frequently start out as seemingly run-of-the-mill tasks and escalate into something much more lurid and creepy. A search for a missing person, for example, might turn into a hunt for progressively more unsettling clues in a seemingly abandoned apartment building, and a routine rescue mission might turn out to be a trap set by a conniving madman. These are some of Dying Light's most memorable moments, and they make exploring its world even more rewarding. While it's entirely playable as a single-player game, Dying Light is  like most things  better with friends along. Up to three co-op partners can jump in at any time to help you carve up undead hordes, watch your back while you're picking locks, or pursue campaign missions, and while the online matchmaking is still fairly hit-or-miss on PS4, online sessions are smooth and stable once they get going. It's also useful to have friends around if your game is invaded through the ~Be the Zombie~ mode, which lets a random player jump into your world as a super-powered monster with zipline tendrils and zombie-summoning spit. Playing as said monster is hugely enjoyable, especially after youve unlocked some of its grosser attacks, but it feels one-sided unless you're going up against at least two human players. PC Impressions Other than moderately better visuals, the PC version's biggest leg up on its console counterparts is its customizable keyboard-and-mouse controls. Keeping track of the assorted key functions can be a little trying when things get frantic, but using the space bar to jump still feels more immediately natural than R1 or RB on PS4 or Xbox One. (Gamepads are, of course, supported.) Early on, there were reports that Dying Light would hang before dialogue or cutscenes, but these issues appear to have been patched, and the PC version now mostly runs smoothly for us, with only rare hitching while areas load. There is, however, an occasional issue with some textures popping in at low resolution and sticking that way. The PS4 version has a similar problem, but while it quickly corrects itself, textures that show up blurry on PC tend to stay that way. Pros Exhilarating explorationRewarding carnageEngrossing side quests Cons So-so storyUnstable matchmaking Beginning as a furtive, desperate survival-horror experience, Dying Light gradually and gratifyingly evolves into a fast, hyper-violent celebration of vertical freedom and zombie destruction. Its main story is unspectacular, but the memorable side quests and sheer fun of exploring its world do a fantastic job of offsetting that, making Dying Light one of the most engrossing open-world games  zombie-infested or otherwise  I've played in a while.", "date": "Feb. 3, 2015,"}