{"name": "Citizens of Earth", "name_review": "Citizens of Earth Review", "ref": "https://me.ign.com/en/citizens-of-earth/101015/review/citizens-of-earth-review", "text": "Citizens of Earths tongue-placed-firmly-in-cheek satire on retro games and modern politics had me laughing even when I was cursing it out. The story of a clueless Vice President and his equally bumbling constituents saving the Earth from evil isnt a novel idea, but the amusing dialogue and lovable cast of characters managed to get me through the 20-hour experience even when the sluggish pacing and technical glitches threatened to kill my joy for it. Much of Citizens charm lies in the fact that its a giant spoof on Earthbound. Everything, from the world design to the battle animation to the fact that you can dumpster-dive for items, is lifted straight from the 90s cult classic. Naturally, this appealed to my sense of 8- and 16-bit nostalgia, but Citizens didnt just rely on fuzzy memory of days gone by in order to charm me. It also introduced a litany of hilarious characters who represent the best and worst of what humanity has to offer. A plethora of quirky archetypes was available to recruit into my party: the crazy conspiracy nut, the laid-back Jamaican musician, the cheerful German pastry chef, the spiritual yoga instructor, and of course the narcissistic Vice President of the World. Vote for Earth! But its the political satire and sly pop culture references sprinkled throughout the wonderfully enthusiastic dialogue that really makes Citizens pop. Almost every line is either a playful dig at self-centered politicians (My hair is what I do best, the Vice President proudly declares) or a reference to movies like Labyrinth (Voodoo. Who do?). If the pacing were as snappy as the dialogue, Id have enjoyed Citizens of Earth even more. Unfortunately, a confusing overworld map and a terrible hint system turned smooth sailing into abominable gridlock. Whenever I was instructed to go somewhere, it was in the vaguest terms possible: Go to the desert and find a way to the building. This real bit of instruction may sound like a no-brainer, but the process of getting to said building was ridiculously convoluted. I spent hours searching for an entrance, checking the map over and over (and over) again looking for hidden caves or trails. I even got up from my chair to trace paths on the map with my finger. Where was the heck was the entrance? As it turns out, I had to go to the area next to the desert, visit a casino, make my way across a river, then circle back to the desert from a different direction  none of which felt the least bit intuitive. Add to that a pack of tenacious cats made out of cacti attacking my party every three seconds (high enemy-encounter rates are another pacing issue) and it was a wonder I made it to the end of the mission. Im aware that developer Eden Industries set out to recreate the style and feel of the 16-bit era, but we moved beyond maps and frequent enemy encounters for a reason. Luckily, the sluggish tempo on the world map doesnt carry over into battles. Fights are quick and fun thanks to each of the 40 citizens quirky set of attacks, buffs, and defenses. In a clever twist, the VP himself doesnt fight  he just stands there making quips and letting everyone else do the work for him. I chuckled whenever the computer nerd attacked enemies using hexadecimal and binary code, the bodybuilder used buffs to power up his next move, or the baker healed the party with copious amounts of pastries. I also appreciated that each citizen had a secondary talent off the battlefield. I couldnt have gotten very far without the help of the spunky helicopter pilot who flew me to remote locations, or the dumb-as-bricks bodybuilder who lifted obstacles out of my way. Its this mix of abilities that made having an array of citizens in my party essential as well as fun. We promise a Moonbucks on every corner! The process of getting them on my team wasnt fun, however. Almost every single character required me to complete a sidequest or compete with them in a mini-game, and those were just as poorly designed and unintuitive as the main quests. The only reason I managed to recruit the photographer was because I accidentally stumbled onto a location she wanted to use for a photoshoot. And, alas, there are technical glitches. There were times I got stuck trying to get around obstacles while driving or walking. There is noticeable screen tearing. And although It only happened to me a couple of times on PC, the PS4 version crashed on me several times. Thank goodness for autosave! Annoying as that was it was hard to stay mad for very long, since the constant jokes, retro-style graphics pulled straight from the 50s and kooky music worked together to keep a grin on my face. And if things did get too tedious, I could always use the school mascot in my party to change the difficulty level or the floating photon I came across to speed up the gameplay. Pros Fun battle systemClever humor Cons Sluggish pacingOverload of enemiesTechnical glitches Citizens of Earth is a quirky game with its heart in the right place and its head in the clouds. It charmed me with its blend of old-school RPG and contemporary satire, but nearly lost my vote with its sluggish pacing, irritatingly high enemy encounter rate, and crashes. As it is, its pretty A-OK, but it would have a tough race winning a run-off for my time against a well-paced RPG.", "date": "Jan. 25, 2015,"}