{"name": "Paladins: Champions of the Realm", "name_review": "Paladins: Champions of the Realm Review", "ref": "https://me.ign.com/en/paladins/147798/review/paladins-champions-of-the-realm-review", "text": "Theres nothing quite as satisfying as blasting the entire enemy team off the stage with Torvalds hyper beam. Reanimating after you die as Terminus and vaporizing any opponents too slow to get away never gets old, and seeing Willos multiplying seedling attack come your way inspires horror. But the greatest achievement is that Paladins: Champions of the Realm allows you to dictate your playstyle. Whether it's adding to the knockback of weapons or increasing the duration of your shield, Paladins empowers experimentation and true customization. Amid the thrilling battles is a diverse five-on-five hero shooter that puts the power of choice front and center. Whether its the wonderfully imagined characters, the in-depth card and item customization systems, or the inoffensive free-to-play model, there are plenty of options that make Paladins a worthy competitor for Overwatch. Its a shame that Paladins doesnt put a bigger focus on the lore of this world, as almost all of its 36 champions are packed with interesting nuances. Seris is an incredibly ominous character and her charm bleeds into her soul-snatching attacks and dimension-jumping abilities. Her ultimate literally has her casting her soul core onto the battlefield to drag nearby enemies into a tear in reality and it screams of personality. The explanation for her character may be limited to a page of text on her champion screen (as not every developer can afford Blizzards expensive-looking animated shorts), but her presence on the battlefield speaks volumes. Not only are these small details present in each character's appearance, but their gameplay styles artistically offer enough variety to make switching to a new character a brand-new experience. Its a similar story with rest of the cast. Bomb King is a living bomb that can throw stackable explosives and his stun bomb thats modeled after his own character compliments his clever design. Even though Inara and Terminus both hail from the same mysterious living-stone race, their play styles couldnt be any more different. Inara is all about damage reduction and status changing effects with abilities like her Warders Field that dramatically slows down any enemy that draws near, while Terminus has a huge focus on melee combat. Not every character hits the target; Vivians generic design doesnt offer any hints of an interesting backstory and her uninspired and boring Light Machine Gun moveset is a small nitpick in a sea of wonderful characters. Paladins wide range of champions fits elegantly within the four classes. Having a front-line champion like the technology-obsessed Torvald is great for capturing the main objective, and the celestial monk Jenos can use his support status to make sure the tank never goes down. Damage champions like the dragon Drogoz can use his rockets to apply pressure, and flanking champions like Skye can stealthily cast out enemies with her poison bolts. Whats beautiful is that champions like the electrifying shaman Grohk blur the lines between support and damage while the front-line pyromaniac Fernando can still do excellent work as a flank. The true depth to Paladins lies underneath.Thats all on the surface, but the true depth to Paladins lies underneath. Unlike most hero games, here youre not completely pigeonholed into a specific role by your choice of character because you can customize them so heavily. Every player picks five out of 16 cards to create a preset loadout tailored to the champion you choose that enhances stats and moves during a match. Say you gave the eccentric Moji and her two-headed companion a card that heals her whenever she uses her Magic Barrier, but after a few matches you notice that using Bon Appetit, her ultimate attack that transforms an enemy into an easy to kill snack, is of more importance. Rather than scrapping the whole build and starting over, you can assign 15 upgrade points any way you like, letting you decide to improve either the healing power of Magic Barrier or the charge rate for the ultimate. Experimental loadouts like these are Paladins most important feature, and youll likely find yourself constantly going back to tweak and improve your card decks. Furthermore, being able to pick from multiple loadouts at the start of a match allows you to adapt to different team compositions and maps, providing a greater sense of control. Beyond that, every match begins with yet another set of options, allowing you to pick one out of four champion-specific Talents that will dramatically change the way that character plays. Cassie, for instance, is a damage champion who wields a crossbow and generally works great from a farther distance, but this can all swiftly change with the swap of a Talent. For a match where the central point looks to be hectic, it might make sense to pick her Talent that increases damage output based on distance. Does the other team have a few flanks that need to be stopped? Focusing a card deck and Talent on her Dodge Roll ability can switch her sniper archetype to one where mobility reigns supreme. Alternatively, the humanoid tree Grover is a support healer by default, but applying his Ferocity Talent greatly increases the damage of his axe throws and aligns him closer to a damage champion. Maybe their sniper Strix keeps using his stealth ability to turn invisible and escape.Cards and Talents are picked and locked in at the start of each match, but Paladins continues to let customization dominate the playing field even when the action is in full swing. Credits earned throughout a battle let you buy items to further boost stats and influence your abilities. Perhaps you underestimated the healing power of the other teams MalDamba, or maybe their sniper Strix keeps using his stealth ability to turn invisible and escape. Being able to counter that with the healing-reducing Cauterize or the invisibility-revealing Illuminate is an intelligent design choice to keep the team dynamics evolving as the match progresses. Paladins is constantly asking you to pay attention and adapt, even when you think youve mastered a champion. Siege is Paladins main mode, where teams work to capture the central point and then lead a payload to the end of the map. This mode works well because it constantly promotes teamwork, whether its using Ashs shield to help move players onto the point or having Inara deploy a rock wall to keep enemies from stepping near the payload. Saving your ultimate attacks and using them at the same time is a common strategy but its only beneficial if team members communicate. The Onslaught mode, which sees players capturing a single point the entire match, and the Team Deathmatch mode are nice detours, but neither offer anything substantial. Team Deathmatch, in particular, feels a bit thrown together as the instant spawn times dont allow you time to properly evaluate and buy items like you would between deaths in Siege and Onslaught. Each mode is able to stay fresh and interesting thanks to the 16 maps that are tactically compatible with their assigned game mode. Ascension Peak is an immaculate mountaintop temple filled with ancient trinkets and features interesting flank routes for Seige. The Magistrate's Archives is a great Onslaught map that adds a top and bottom floor for two levels of fighting, an element missing from most of the other stages. Some maps, like the ancient ruins of Jaguar Falls, are aesthetically bland, but none of them fail to provide a different approach for the mode being played. There are a few odd bugs and graphical problems.There are a few odd bugs and graphical problems that appear from time to time. Sometimes weapons like Makoas anchor or Torvalds energy beam will stretch out across the entire map or a HUD overlay that should have disappeared will stay longer than needed. At one point the menu background disappeared and left behind a mess of inverted colors, but it was more of an annoyance than anything that affected gameplay. As a free-to-play game, its always a concern that microtransactions could cause a feeling of unfairness, but Paladins keeps things on the level by not offering any competitive advantage for sale. Gold currency is earned by playing matches and completing quests, and using it to buy locked champions gives you a decent window of time to master a character as you save up for the next purchase. Of course, the entire selection of characters is available for purchase in a pack, and many cool outfits and other cosmetics can be purchased individually so youre not left waiting for the item you want to drop from a loot box  though you can buy a loot box for a cheaper price if you dont mind sifting through a handful of emotes and sprays. Thats fine, but its disappointing that some of the most impressive outfits cant be purchased outright and are locked behind a chest. The Battle Pass runs you 500 crystals ($10, more or less) and is a nice way to continue unlocking skins and chests, but its concerning that challenges are not yet available. Working on top of the strong and fairly balanced foundation of a free-to-play hero shooter, Paladins capacity for experimentation is its greatest strength. Even after over 300 hours of exhilarating battles and strategic planning, champions continue to find a way to offer new gameplay experiences. Whether its the main mode that encapsulates the teamwork aspect or the character designs that immediately flow with creativity, Paladins: Champions of the Realm clearly stands out in the midst of competition.", "date": "May 16, 2018,"}