{"name": "Resident Evil", "name_review": "Resident Evil Review", "ref": "https://me.ign.com/en/resident-evil/100696/review/resident-evil-review", "text": "As I creep though the familiar-yet-eerie corridors of Resident Evil, I can't help but feel terrified of Crimson Heads. Even 19 years after I first encountered them, it's genuinely frightening every time they spring back to life to try to tear a hole in my esophagus, but they're also a great example of why Resident Evil still holds up. Inconsistent art and persistent clipping problems give away that this is an update of a 1996 survival-horror game, the scares, puzzles, and atmosphere of the creepy corridors of Spencer Mansion are as potent as ever. Ever since the tweaks made in the 2002 GameCube remake, Resident Evil has been a tense game of resource management. The makeover to the many rooms, puzzles, and monsters give it an edge that significantly surpasses the original game. Every zombie you spend precious ammunition to kill becomes a ticking time bomb thatll turn into something much more deadly if you dont dispose of them properly with fire or headshots. That persistent danger is what makes the frequent backtracking through this labyrinth of locked doors something more interesting than typical busywork. As Resident Evil uses adventure game-style design to send you looking for keys and objects that have to be examined closely to solve puzzles, then brought back to the right location, you can feel the stakes rising as the chances of getting mauled or caught without the right resources increase. Resident Evil is a gauntlet of twisted monsters and hard decisions. Make the wrong choice or take too long on some objectives, and sometimes youll pay for it with the death of a comrade or missing out on precious resources. Its punishing at times, and managing the different inventories of two playable characters forces you to be smart and frugal with regard to what you carry with you. The constant pressure makes it a difficult game to play by design, but one that still manages to be fair. This HD remastered edition of Resident Evil looks pretty good on the new-gen consoles, thanks to 1080p resolution and some nicely touched up backgrounds and textures, with the PC version offering the highest settings and a nifty option to switch between 60 and 30 frames per second. The biggest improvement across all versions is the ability to scale the experience the way you want to play it. You could choose between 4:3 or 16:9 aspect ratios, and you can swap the original tank-style controls for a more modern setup that moves your character in the direction you push the stick. As an old fan I prefer the original controls, but the new controls help make Resident Evil accessible without sacrificing the tense nature of combat. You still have to stand your ground in order to shoot zombies and deal with the pressure of enemies getting closer. Since most face-offs happen in tight spaces, its not super easy to pull a juke move on multiple zombies, even with the new controls. Purists can have it the way the designers originally intended. Newbies can jump in and not completely break the game. Dimly lit rooms with ambient effects like lightning or floating dust particles are some of the best to look at in this update. However, some backdrops look garish under a lot of light, and there are some noticeably blurry textures and pixelated art. Im also disappointing that the major clipping problems still havent been fixed. Maybe in the next remake, Capcom? Pros Classic survival horrorGreat atmosphereModern controls Cons Blurry texturesClipping I love coming back to Resident Evil, and this version does a good job of updating the look and feel of an old game for a modern audience. Some of the older visual flaws detract from the experience and pulled me out of tense moments, but the gameplay hooked me right back in. Resident Evil relies on atmosphere, tough limitations, and danger creeping around all corners, and this port recaptures the formula of a classic, relentless survival-horror game.", "date": "Jan. 19, 2015,"}