{"name": "Dead State", "name_review": "Dead State Review", "ref": "https://me.ign.com/en/dead-state/99447/review/dead-state-review", "text": "Like most of the best zombie fiction, Dead State is an old-lkschool RPG thats no more about its zombies than a disaster movie is about the asteroid impact, tsunami, or earthquake. The event is important; theyve changed everything. But its the people that the story is about, and especially the small group that youre in charge of, all huddled in your little scrap of safety. Its your job to feed and protect them by heading out in search of supplies and other survivors, but also to keep them sane and safe and away from each others throats while back at home. The result is a clever, if undeniably clunky mix of both genres and past zombie games weve seen that is absolutely going to be some peoples favourite of the year but also one that, like a brain-hungry zombie trying to chomp down on Stephen Hawking, bites off more than it can chew. The bulk of Dead State takes place in two phases, not entirely unlike a combination of Fallout and X-COM - RPG-style journeys into a world of zombies and tooled-up survivors This part really shows Dead State at its best, due to being able to focus on plot and character and simple decisions with interesting repercussions. A big board lets you assign tasks each morning, from building structures like a watchtower or well, to crafting guns and chemicals, to cleaning up or teaching a non-English speaker enough to get by. Each of the characters is superbly written with very strong personalities, from a mother and daughter team who desperately want to keep the other out of harm, to Doug, a nerd discovering that a zombie apocalypse isnt as awesome as he always thought. The more survivors join the group, the more the political side comes into play: crisis decisions must be made, impromptu interruptions like a party member getting sick and asking for the day off, different ideas on what the group should focus on, and being the final arbiter of on things like whether, for instance, the creepy zombie-killing obsessive should be kicked out or put to use. If things get really bad, you also unlock the option to deal with troublemakers by gunning them down personally. All this is great stuff, even with a few annoying issues like characters just rehashing the same dialogue when not actively coming to you, some mornings consisting of a conga-line of people demanding decisions, and the same person occasionally returning just to go from I just wanted to tell you youre great to By the way, you suck and youll kill us all. This is just one of many glitches and rough edges that alternately amuse and irritate, with a highlight being the combat descriptors often leading to zombies with labels like Dead Man - Almost Dead. The catch is the work between these bits can be a real chores. Inventory management shouldnt be a bigger headache than filling the stock cupboard, and not just because Dead States UI practically defines ,lunky, slow and bloody awful. And its an odd survival game where the big quandary of the day soon goes from How do we eat tonight? but Who gets first dibs on the deodorant? Yet its all for nothing, basically - while its possible to lose due to poor management, it takes so long and the world is so conveniently bursting with supplies that its actually pretty difficult to do unless you literally do nothing for day after day after day. By far the biggest chore, though, tends to be what should be the most interesting: heading out into the zombie-infested world. Again, it plays much like the original Fallout, complete with random encounters, a map that slowly unfolds as your ability to explore increases, and turn-based tactical combat  but unlike Fallouts world, this is an incredibly bland one, with little personality and an oddly lacking sense of danger. Zombies just stand around the map unless triggered by sound, making the sensible way of defeating them just picking them off one or two at a time until you get to the point where theyre irrelevant. Humans are far bigger threats due to their guns, but no more mobile, and so usually just as easily avoided until youre ready. Even early on its rare to feel in trouble unless forced into a fight, though it is possible to get swamped if things get noisy. Another big distinction from Fallout is that fighting anyone, alive or dead, is a miserable experience. The turn-based combat doesnt offer even the most basic tactical features like overwatch or interesting terrain elements to position your party around, turning each encounter into a slow-paced exercise in trading blows. Indoor locations are far too cramped, outside ones typically too empty. Characters action-point allocations too are rarely generous enough to do anything with except take a couple of swings or run for it. Glitches are in full force here too  from smashing a door occasionally being treated as beating up a neutral human, to it making no distinction between neutral and hostile Looters until they open fire. In both of these cases of course, youre treated as if you beat up a puppy for fun. The result of all this is that essential scavenging soon becomes a very tedious, map-scouring chore. It is, however, regularly uplifted by occasional bursts of story in the field, with writing just as solid as that in the safehouse. Instances like the man in a restaurant who waits for you to offer shelter before springing the fact that he also has an elderly woman and a young boy who would like to take up that most generous offer create interesting dilemmas. These moments are rare enough to feel special, but common enough that entering a new location always has potential. This really is Dead States best trick; being able to combine both its halves in a way that the overall experience compensates for many of their flaws - that even dull scavenging still has an impact on the big picture, while the growth of your base means that at least youre heading out with your own tools and chosen people to get things done and unlock the story. If you can get into the rhythm it wants, it works. As soon as things slip though, just for a moment, that magic fades and youre left with lots of individual elements that are all great ideas, undercooked - a world of flat atmosphere and weak combat where survival just isnt a big or exciting enough problem to justify the amount of time it takes to ensure. Pros Good strategy/RPG mixExcellent main story writing Cons Weak combatOften a choreLack of atmosphere Make no mistake: to pull off everything that Dead State tries would be an achievement for any RPG, and its impressive how much it manages. What it lacks in polish it at least largely makes up for in personality, even with glitches and rough edges as far as the eye can see. Unfortunately, even that cant make up for the chore that much of it soon becomes, and as much as the repetition of scavenging, crafting and surviving is true to the world, the sheer number of other zombie and survival games right now make it tough to stay in the mood for this one.", "date": "Dec. 21, 2014,"}