{"name": "Razer Deathadder Chroma", "name_review": "Razer Deathadder Chroma Review", "ref": "https://me.ign.com/en/razer-deathadder-chroma/99251/review/razer-deathadder-chroma-review", "text": "The Razer DeathAdder is like the Tetris of gaming mice - everyone at least once, somewhere in one shape or form, has owned one, or has tried it. The DeathAdder has played an essential part in making gaming mice popular, and has remained, even after many years, one of most popular and preferred gaming mouse by gamers around the world. It is no wonder then that Razer has updated the mouse several times over the years, adding small improvements to it while keeping the basic ergonomics familiar. Why break it when it isnt broken, right? This years iteration brings Razers Chroma technology to the popular mouse, which adds 1.68 million color options to the table allowing gamers to customize it to their liking. Design & Specification Compared to the DeathAdder 2013 edition, not much has changed - in fact, to the naked eye they both look indistinguishable. Again, Razer has made very minor changes to the overall design - the braided cord feels smaller and more durable, the surface looks slightly rougher, the light on the logo is more even, and the side rubber grips have more hold on them. Other than that, it is the exact same mouse. Suffice to say, if you have the DeathAdder 2013 already there is absolutely no need to splurge on the Chroma. Razer has obviously retained the look and feel of the DeathAdder. Its simple and unfussy design fits comfortably under the palm, and caters to all kinds of grips (palm, claw, fingertip, etc.). What I do like about the new Deathadder is the matte treatment of the surface. Even after nearly a week of use, the surface has yet to develop any blotch marks near the two main buttons, which is nearly impossible for me as I often get sweaty palms during long gaming sessions. The two additional buttons on the left side have received similar treatment as well, so I dont expect them to wear off anytime soon unlike other mice I have used. They have been placed well too, with both of the buttons easily reachable during the heat of the battle. The rubber on both the sides gives a good overall grip, however I have found it to be no better than in other mice where it does get slippery after a couple of intense online matches. Flipping the mouse over, you will find three surprisingly small glides, with the 10,000 DPI 4G optical sensor located in the middle. Its all fairly unassuming under there. Overall, the DeathAdder Chroma feels like a yet another solidly built mouse from Razer, and quite frankly, I expected nothing less. And with the classic, no fuss design, the DeathAdder Chroma is as comfortable and easy to use as it was before. Software and Performance Since its a Razer product, you will have to deal with its cloud-based solution called Synapse. The software stores all of your settings to the cloud, and while thats convenient, it also means that you will have to install the software on every PC that you want to use the mouse with. This can get quite bothersome, especially during tournaments where receiving a stable Internet connection is always a concern. It would be great if Razer could add built-in memory to remember some of the basic settings like DPI levels and button programming. That aside, the Razer Synapse is an uncluttered, non-intrusive and robust piece of software. You can tinker with pretty much every aspect of the mouse with changes made without any delays. In the Customize tab, you can program each of the seven buttons of the mouse. Each button can be made to do a number of things, including act as a specific keyboard button, launch a program, change DPI level, or execute a macro. You can also create custom presets and save them under different profiles. The Performance tab allows you to change the sensitivity levels and stages, mouse acceleration and polling rate. I highly recommend not tinkering with the acceleration settings unless you know what you are doing as it will dramatically change how the mouse moves on the screen. I would also recommend keeping the polling rate to 500 as it gave me the best control over the mouse. In the Lighting tab, you can apply the Chroma color scheme to both the scroll wheel and the logo. This will cycle through the whole spectrum of colors although you can choose a single color if you prefer. The Calibration tab allows you to either select a Razer mouse pad from a drop down list, or calibrate your own pad. I choose to do the latter, and it calibrated to my Steelseries World of Warcraft cloth mouse pad without any problems. You can also change the lift off settings in the tab. Finally, we have the Macros and Stats tabs. You can set all kinds of macros with the Chroma which also accounts for keyboard presses. You can easily change certain aspects of it, like adding a default delay or removing delays entirely, and also removing commands if need be. The Stats tab records all sorts of interesting data per game, such as mouse clicks, distance traveled, wheel rotations, etc. It also tracks your exact movements in games exposing your aiming and moving habits. This could be especially useful for pro-players looking to refine their game and who want to know what exactly needs tuning. Performance wise, the DeathAdder Chroma is incredibly precise and thats not really surprising considering the years of refinement it has gone through. The optical sensor remains rock solid even in the most erratic and demanding movements and has yet to fail me in getting my headshots and goosers in TitanFall. It can go upto 10,000 DPI, which for all intents and purposes, is a stupidly higher number that very few people would actually use the mouse at. I clocked it a decent 1650 DPI on a 1080p/144Hz screen and had absolutely no issues whatsoever. Pros Retains the same classic designComfortableIncredibly precise and accurateThe Chroma tech looks cool despite being kind of pointless Cons Still no built-in memory The Razer DeathAdder Chroma isnt a huge change from previous iterations of the mouse, but as a standalone it is absolutely fantastic. From a performance standpoint, the Chroma scored well in both precision and accuracy in all the games that I tested. And of course, you cannot go wrong with its classic design which till day remains one of the most comfortable and ergonomic designs seen on a mouse. The beautiful array of colors on display is only a nice touch, more than anything else.<br><br> The Chromas only competition will be its price - at AED 269, it is slightly pricier than other gaming mice that offer pretty much the same package for less money. But if you are set on a Razer mouse, you truly cannot go wrong with the DeathAdder Chroma.", "date": "Dec. 16, 2014,"}