{"name": "Turtle Beach Ear Force Stealth 500P", "name_review": "Turtle Beach Ear Force Stealth 500P Reivew", "ref": "https://me.ign.com/en/turtle-beach-ear-force-stealth-500p/99167/review/turtle-beach-ear-force-stealth-500p-reivew", "text": "Turtle Beach has released the new wireless Ear Force Stealth 500P headset with DTS 7.1 surround sound. It packs a rechargeable battery claiming to deliver over 15 hours of gaming fun per charge, 50mm speakers and a comfortable new design round out the appealing traits of this headset. It promises to be shiny, but does it live up to expectations? Design The headset is made from plastic which looks a tad more durable given the finish with Turtle Beach logos adorning both ear cups. These are highlighted with a blue strip, making the headset look nicer and more complete design-wise. The headset sits comfortably atop a users head once it is adjusted to fit. The on/off switch is located on the right cup by pressing the TurtleBeach logo, and everything is controlled via buttons on the right side. There are two volume controls, one for overall volume and the other for the microphone level in game or volume level when the headset is connected to a computer. A 3.5mm jack can also be plugged on the right side if the headset is used with a PS4 or a Vita. The headset can be charged via a supplied USB cable that also connects to the right side. The only thing on the left cup is the microphone connector that houses the detachable microphone. The Stealth 500p uses a USB dongle to connect to the optical port of your PlayStation which allows it to connect wirelessly with your headset. Whilst not using the set, you can turn the cups to rest against your body, which can be handy as that cuts down on bulk of the headset and allows you a bit more freedom. Performance The 7.1 surround sound processing is fairly decent, and is impressive even in some parts. With it enabled you can easily make out where enemies are coming from when playing games that support surround sound and you almost feel like ducking when you hear something coming from behind you. There are four audio presets: Stereo, Game, Movie and Music. Each preset comes with four options: natural sound, bass boost bass and treble boost and vocal boost. Game mode in general tends to add more bass so explosions and the like are better-sounding, whilst movie mode offers a clearer dialogue, so if youre playing a game which has a lot of dialogue, it may be better to switch to Movie mode. The Music mode is decent, but can be a bit heavy on the bass especially if youre an audio purist. Although it must be admitted, the Assassins Creed: Rogue score sounded very sweet in Music mode. Whenever settings or modes are changed vocal commands tell you whats happening, however this interrupts the game/movie/music audio for a brief few seconds, which can be somewhat annoying. It should be noted when switching between Game and Stereo modes, the 7.1 difference in quality of sound is visible right off the bat. A huge minus for the headset, however, is that it suffers from mic buzz, so whenever youre playing a game which doesnt require a microphone it is best to turn the mic off. Another option is to disconnect it from the headset when not in use, although the buzz is still there unless you toggle the mic on/off button. Another annoyance is that the headset simply fails to output audio from certain games on the PlayStation 3. You need to go back to the menu and toy with the output settings in order to correctly output sound - it would be nice if you can leave all of the output settings on and have the device auto select the more appropriate sound setting for you based on the game. Otherwise when youre ready to play a game and you have to keep quitting the game just so you can fiddle with the audio settings on the headset, it can lead to you tossing the headset aside in frustration and just turning the volume up on the TV. The headset will go into auto shutdown mode if you pause the game for too long (around ten-fifteen minutes) - connection is re-established easily just by turning the headset on again. Comfort-wise, the Stealth 500p is great if youre sitting and playing a game, watching a movie or listening to music, however if you try leaning against an object or if you like using the headset in bed, it could get uncomfortable due to its build, as the plastic band can start cutting into the back of your head. If your PC or Mac has an optical port, you can plug the dongle into that similarly to the PS3 and use the headset with your computer. I tested it on a MacPro using VLC player to watch various TV shows as well as BluRay discs such as Edge of Tomorrow, Marvels The Avengers and Firefly: The Complete Series. A major annoyance with the sound here comes in the form of an increase in bass, even whilst using the natural sound preset in any mode, albeit not as evident as toggling the bass boost on. Your best choice is to use Stereo mode, or if the video supports surround sound, the movie mode with natural sound and play with the volume levels between the player and the headset. Another thing is when the headset is used on a computer, the volume is controlled via the chat volume wheel instead of the volume one. As far as listening to music is concerned, the Stealth 500P adds a certain level of bass whilst listening to uncompressed audio - with MP3s the sound is not bad, but hardly comparable to uncompressed in terms of quality. The microphone picks up sibilance quite often, and virtually every breath you release is recorded if the mic is positioned right across from your mouth. Having it far away from your mouth is an option, but you might need to speak up to be heard properly. The good thing about this mic is the mic monitoring which allows you to hear yourself whenever the mic is in use. The mic isnt specifically high quality, but quality enough to keep a conversation going in game play sessions. The Stealth 500p offers upto 30 feet of wireless range and gets a bit testy if you wander out of range. Upon your return within range, on Mac the headset begins announcing mic on/mic off in intervals until you turn the headset on and off to re-establish connection. This problem doesnt occur with the PS3 where connection is re-established smoothly. Signal drop is also a frequent issue where the headset stops functioning randomly, and requires the good ol' method of 'turning it on and off again' to make a connection again. Battery life is very decent - after hours of non-stop gaming and a couple of sessions with the BluRay player on the PS3 the headphones still work. In fact, over a weeks heavy use between both Mac and PS3, the headset only needed to be recharged once. Pros Great battery lifeDecent surround soundGood comfort Cons Annoying mic buzzing noiseBass can seem like overkill in some modesSignal drops For AED 449, the Turtle Beach EarForce Stealth 500p is a decent all-round package, with great 7.1 surround sound and ergonomics. It is not without its quirks and annoyances, however - the mic while of sufficient quality has an irritating buzzing noise, and you will have toy with the settings on the PlayStation 3 to have the headset compatible with every game. There are definitely better options out there for the money, but if you are set on getting a wireless headset, the Ear Force Stealth 500p wouldn't be too poor of a choice.", "date": "Dec. 15, 2014,"}