{"name": "The Crew", "name_review": "The Crew Review", "ref": "https://me.ign.com/en/ubisoft-the-crew/99011/review/the-crew-review", "text": "The Crew is an immense and unique online-only racing game that, above all else, boasts an ambitious open world of such preposterous proportions it ought to rank amongst some of the years most remarkable technical accomplishments. Its size, however, has taken a toll on The Crews visuals and effects, and its problems dont stop there. Sound generally lacks oomph, the economy is stingy, the multiplayer community is only loosely connected, and the missions are too often undermined by some incredibly frustrating AI that brazenly cheats in a misguided attempt to ratchet up the tension. What The Crew gets right is its stylised and scaled-down version of the entire continental USA. Cities are shrunken caricatures, but the truly vast sweeping tracts of land between them means traversing it really does capture the spirit of a cross-country, city-to-city road trip better than any driving game before it. Plenty of racing games curate a bunch of different backdrops into their track selections, from urban street races in major American metropolitan centres to icy blasts across snow-swept mountains, flat-out sprints across the baking desert, or muddy expeditions through giant Sequoia forests. The Crew admirably does all this in a single game world you can drive across in one lengthy session. This girth has come at a cost, though. Its a world that looks fine whipping by you at speed, but it favours sheer size over the kind of granular detail we now expect in modern open world racers. Cities are smattered with recognisable landmarks but dont really seem built to stand up to stationary scrutiny. Combined with low-detailed NPC cars (complete with entirely black, opaque glass), some forgettable effects (splashing water is especially dire), no weather, and the fact that the models of the 40-or-so cars are in a league below those of contemporaries like Forza Horizon 2 or Driveclub, The Crew struggles to shake the look of a game several years older than it actually is. There is, however, a charming sort of daftness to this condensed ode to the US. The Crews version of Californian race track Laguna Seca is hopelessly primitive compared to the renditions available in dedicated tracks racers like Gran Turismo 6 or Forza Motorsport 5, but being able to drive off of it in real time, leave the facility and be drifting around a space shuttle in Cape Canaveral on the other side of the country within the hour has a certain infectious appeal about it. The Crew bills itself as an MMO but it felt largely like a single-player experience my first time through the campaign. There were definitely other players on the map in my vicinity, but I only rarely saw another car close up, and only twice all week was I invited by a random stranger to join his or her co-op mission. I tried on multiple occasions to trigger co-op missions myself but these invitations time out if nobody accepts them, and time out they did. I found myself launching the missions solo rather than waiting patiently for no-one to respond. Id suggest finding some like-minded friends to play the co-op story missions with rather than relying on the game to find willing strangers from your session, as it feels like the most reliable way to experience co-op in The Crew. Its certainly the most entertaining way to play it, and it only takes one human player to nab the objective for all of you to successfully complete the mission. It also means youll have a better chance of emerging victorious against the often overpowered AI and makes the sometimes irksome takedown missions a lot less punishing, considering there will be up to four of you trying to slam a single vehicle off the road. Said overpowered AI is perhaps the most frustrating trait of The Crew; its obsessed with making sure the computer-controlled opponents you face, race, or chase in the games solo and co-op missions can always keep up with you, regardless of how completely outclassed by high-level cars they should be. Its especially exasperating towards the games end. The supposed difficulty of an event is determined by what your car performance level is compared to whats recommended. The thing is, Id attempted to complete a race with a car level a fraction below what was recommended and found it impossible to keep up with the pack. It seemed like a reasonable enough outcome until I went back to replay a previously completed race, against cars with a significantly lower car level than mine, and found I simply couldnt pull away. In fact, some of them were blitzing past me, even after theyd crashed out just a minute before. Normalising the AI to be able to match pace with the monster youre driving undermines the whole upgrade system. It also extends to the AI-driven cop and enemy cars, who have a supernatural ability to bend the games driving physics to their whims and capture you surprisingly rapidly, even if youre reversing away from them at full throttle with nobody blocking the road behind you. The Crew is an arcade racing experience through and through, and its one that actually improves as you progress and your cars stats are buoyed by earning vague performance parts via completed missions and driving challenges. These challenges, which test your speed, control, and off-road abilities, are dotted all over the map and can be triggered on the fly, and the process of picking one up is seamless until you succeed, at which point the barrage of overlays beaming numbers into your brain concludes with a short loading screen, after which youll find your car stopped dead in its tracks. Its a real momentum killer. At any rate, I like the handling more than, say, the slightly floaty and imprecise old Black Box-era Need for Speed games, but its a little less honed than the likes of a responsive arcade driving game like Driver: San Francisco. Importantly, I found the default driving settings, with a host of driving aids activated, far too muted. Id recommend experimenting with the sport and hardcore presets. Less appealing is the vapid story thats supposed to be coaxing us through The Crews 30- to 40-hour main salvo of missions. Ubisoft has shirked the slightly quirky approach that worked so well for Driver: San Francisco and opted for a far more po-faced plot plucked from the same pile of napkins EA uses to scrawl down story beats for Need for Speed. So were down-on-his-luck street racer and Gordon Freeman cosplayer Alex Taylor, framed for murdering his own brother, working with the FBI and a crew of other ne'er-do-wells to clear his name. To do so he needs to infiltrate a nationwide racing gang with the most contrived internal ranking system this side of a criminal empire conceived by Hot Wheels. Its asinine stuff, even for a video game. Theres a fairly narrow selection of main mission types dangling from this hokey narrative thread, and theyre all generally riffs on a few core concepts. Youre mostly either partaking in some standard racing (to be honest, these are generally the best events), escaping from the cops, or chasing down an enemy vehicle to shunt off the road. Later on The Crew adds off-road barrel smashing runs (that seem inspired by a similar mission type in Driver: San Francisco) and occasionally mixes things up with fun multi-class races that put you in a slower car thats nonetheless able to take shortcuts your opponents cant. The mission set gets repetitive but the locations are pleasantly ever-changing: one moment you might be negotiating the grid layout of Manhattan, and an hour or so later youll be tearing up a dirt track as you weave through a Louisiana bayou. Sticking to the campaign isnt as lucrative as Id anticipated, however, and at the end of it all I found myself at the level cap, out of story missions and without enough cash to buy any of the most-desirable cars (of which there arent as many as Id anticipated there would be; far less than even the likes of the original TDU, The Crews spiritual ancestor). Youll need to put in a good deal of work to build the funds youll need to afford the games hypercars (without stooping to investing real money in The Crews wholly unnecessary microtransaction system). Happily theres still plenty to do following the conclusion of the main thread and once you hit level 50 you unlock the ability to secure platinum car parts (as opposed to gold ones) that come with a random car stat boost. Its at this point The Crew truly settles into its RPG groove as youre encouraged to grind challenges until you score the best possible drop of car loot for your ride. Youll need these platinum parts to make any sort of meaningful dent in The Crews PvP lobbies. Theres another layer of very lengthy events outside the main story thread (at least one of which warns us it will take four hours to complete) but I found the PvP races are actually a far better source of cash. The online racing is robust and, although its biased towards whoever brings the fastest car (unlike the single-player, for better or for worse), its very generous with cash prizes. Whether youre winning or not (and I generally wasnt) I always felt incentivised to keep plugging away. The PVP racing itself, which you can compete in either individually or with teammates, was dependable during testing but at its most enjoyable with collisions turned off. I particularly like how the enormous nature of the world means discrete tracks appear to available in spades, although it could probably do with some kind of voting system for event types to make things more democratic (rather than leaving it solely to the racer in first place). Ive enjoyed the PvP but I dont know that Im engaged enough to keep coming back to it. Pros Remarkably immenseSo much racing content Cons Brazen, catch-up AIOften underwhelming looksStingy economy The Crew deserves credit for the frankly staggering size of its open world, and the fact that its absolutely filled to the brim with racing, challenges, a fat multiplayer offering, and exploration potential. This scope, however, has resulted in some noticeable visual concessions, the racing itself is too often hamstrung by AI prone to unfair bursts of speed that do nothing but frustrate, and I was surprised at how unwilling the community currently seems to join co-op missions and just how difficult the games often miserly winnings makes collecting the cars.", "date": "Dec. 11, 2014,"}