{"name": "Threes", "name_review": "Threes Review", "ref": "https://me.ign.com/en/threes/98924/review/threes-review", "text": "A puzzle game should be quick and easy to pick up and play, but deep and challenging enough that its difficult to put down - thats the cliche ideal. Threes is the embodiment of that ideal. Its elegantly simple matching gameplay and surprising layer of charm and subtle personality put it up there with the classic Tetris as one of the very best of their kind. A four-by-four grid full of numbered cards makes Threes look like a math-based game at first glance, but theres virtually no calculation involved in this mental exercise. Simply swiping up, down, right, or left causes all cards on the board to move one space in that direction (if possible), and matching cards that are pushed against an edge combine and collapse them into a single, higher-value card. For example, smooshing a 3 into another 3 makes a 6; smooshing that 6 against another 6 creates a 12, and so on. Every move you make adds pressure by bringing in a new card from the opposite side. This simple idea grows increasingly complex and tough when the board inevitably fills up with cards, and space becomes scarce. Getting a high score and topping the leaderboards  the sole goal of Threes only mode  becomes all about learning to see several moves ahead, and visualizing what the board will look like after several swipes and card combinations. You can peek by sliding a card most of the way over to see what the board will look like (on the Xbox One, this is done with the right stick). But because of the random placement of new cards in one of the four slots on the side opposite your last move, Threes isnt a solvable puzzle or a fair and level playing field, and that means its endlessly challenging. Its similar to the brinksmanship created by luck of the draw in Tetris, when you risk everything betting that a long piece will finally materialize at the last possible moment before the board fills up. Whats more, the brilliant puzzle is set to a catchy, accordion-heavy theme song that feels like something out of a Parisian cafe. Even though its just one track, its long and sufficiently varied that Im still humming along after hearing it literally hundreds of times  in fact, its often playing in my head even when Threes isnt running. Sound design is also brilliant, granting each numbered card a distinct voice and personality  something I wouldnt have thought possible upon hearing the description of its simple look. The high-pitched and childlike Hello! of the 3, the Sup? from 6, 48s dopey Oh garsh, 96s angry-sounding Grrrr, 192s snobby Hello gentlemen, and so on often trigger when numbers appear, and theyll let out exasperated sighs or prod you with Go already! when you take too long (for their taste - theres no actual time limit) to consider your move, and a nope! or nuh-uh dismisses your attempts at invalid moves. All the voices have several different takes on their lines, and they dont play at every opportunity, ensuring they dont quickly wear out their welcome. Pros Simple but deep mechanicsTense brinksmanshipExcellent personalityLeaderboard competitionCatchy music Threes is a brilliant puzzle game that can pass spare minutes, hours, or pretty much however long youve got. Its simple matching mechanics take only moments to learn, but training yourself to see several moves ahead while anticipating the possible variables is a challenge thats gripped the puzzle center of my brain as tightly as classics like Tetris ever did. An unexpected element of outstanding music and personality makes every game a pleasure, even if my scores cant top the leaderboard.", "date": "Dec. 10, 2014,"}