{"name": "A Bird Story", "name_review": "A Bird Story Review", "ref": "https://me.ign.com/en/a-bird-story/98309/review/a-bird-story-review", "text": "The most impressive part of A Bird Story is not what it does well, but what it doesnt do. Until the end credits, not a single line of dialog is written or spoken at any point, and that lack of traditional language forces it away from conventional storytelling techniques. Instead, A Bird Story is told visually, relying on subtle animations, and deliberate art design to craft an effective and evocative narrative. The main character in A Bird Story is a young boy whose imagination often leaves him at odds with the world around him, and every visual moment has been crafted to reflect this. Throughout the entire game, only his character and two others ever have completely formed sprites with recognizable faces. All other people in A Bird Story are near-transparent shadows, suggesting that the boy doesnt interact or relate to them, instead seeing through or around them in his loneliness. Hes often pulled away by his creative tendencies and need for self-expression, but his shyness prevents him from doing so around others. This very shyness is illustrated through subtle, yet effective moments. When sharing the elevator in his apartment building with another tenant, he is shown taking a tiny sidestep away from them before reaching his floor. At the start, he can step right through the other children in school, treating them like invisible beings rather than friends or even tangible peers. Theyre all small moments, but completely effective in silently providing some insight into the boys personality. After rescuing and forming a bond with an injured bird, the world around the boy begins to change in subtle, yet powerful ways. Whereas colors are initially a bit more monochromatic in their use of greys and browns, they grow more brilliant and abundant as the boy and the birds relationship develops. He begins to notice the people around him and even interacts more freely with others. Genuinely funny and heartfelt moments take place throughout, all working seamlessly together to create a commentary on the importance of friendships and the pain inherent in letting go. Music and audible cues also play a major role in the storytelling, often setting the tone and helping bolster the emotion in different scenes. Using light, airy piano riffs, varied guitar chords, and a wide array of woodwind and string instruments, the music is poignant and evocative without ever crossing into cheesy or undeserved territory. Kan Gaos music serves as a necessary co-narrator to A Bird Storys unique pixelated visuals. Much of the game is spent watching things unfold and merely guiding a character around using the directional and space buttons on the keyboard to navigate and interact with the world. Its also a short game  perhaps two hours long at the most  and it never allows for any sort of exploration or wandering. None of this is necessarily a negative, however. Its story relies heavily on timing and beats, and its tight, linear focus helps it to craft a cohesive and compelling story. Pros Great visual storytellingAttention to detailFantastic soundtrackNeat art direction Cons Extremely linear With its focus on visual narrative, A Bird Story challenges many of the ideas of basic game design, sometimes in ways that limit player freedom. But its amazing attention to visual detail, laser-focused narrative beats, and evocative soundtrack make it a neat, tightly-constructed story that says much without ever saying anything at all.", "date": "Nov. 30, 2014,"}