{"name": "Tales from the Borderlands -- Episode 1: Zer0 Sum", "name_review": "Tales from the Borderlands Episode 1: ZerO Sum Review", "ref": "https://me.ign.com/en/tales-from-the-borderlands-episode-1/98141/review/tales-from-the-borderlands-episode-1-zero-sum-review", "text": "You dont need to be a hardcore Borderlands fan to love Tales From the Borderlands. By exploring the world of the loot-driven shooter trilogy through the lens of a dialogue-heavy adventure game, Telltale has created a fantastic opening to a story rife with humor, interesting characters, powerful decisions, and effective mysteries. In the span of Episode 1: Zer0 Sums two and a half hours, Rhys and Fiona became some of the best lead characters Telltale has ever created, and Im entirely on board for their journey. Traditional Borderlands games have you interacting with the world mostly through emptying the chambers of your various guns, but Telltale pretty much strips you of power save for you wit. Talking my way out of a deal gone bad, watching the face of my adversary to see whether or not they believe me, and choosing how far to take a lie was as tense as any shootout Ive ever experienced on Pandora. The entire thing is enhanced by a fantastic score that draws from classic westerns, Cowboy Bebop-esque jazz, and some great nods to various Borderlands themes. The framing device in Zer0 Sum has Rhys and Fiona retelling the story of their initial meeting  a heist gone awry  and how the stakes quickly began to ratchet up to some pretty massive levels. Tales jumps back and forth between the pair, which results in some really great situations and moments to story reveals. Watching a deal go south from Rhys point of view and thinking you know the ins-and-outs of the scene, only to have everything turned on its head once you flesh in the details from Fionas perspective constantly gave the episode a great sense of pace and aggressive, effective storytelling. While having prior Borderlands knowledge helps add a bit of context to the relationship between Hyperion and Pandora, why Zer0 is so rad, and just who the hell Handsome Jack is and why hes so notorious, newcomers will be just fine in Tales. This is mostly thanks to how strong of characters Rhys and Fiona are, and how great it is to be able to shade them in with your own unique decisions. Does your Rhys want people to view him as a fearsome murderer, or a genius with a silver tongue? If your Fiona has a clean shot at a target, does she take it, or would she rather get out of a situation with as a low a bodycount as possible? In the quick duration of Zer0 Sum, I fell in love with my versions of these two characters, and I cant wait to see where they go from here. Tales from the Borderlands hits humorous notes through its dialogue, situations, and even elements of its menus. Characters are introduced with the series signature over-the-top title cards, and using Rhys ability to scan people and items in the environment leads to a ton of often-hilarious fun facts. Great writing and fantastic acting make each scene a joy to play through, and I found myself genuinely laughing out loud every few minutes of the first episode. While the traditional Telltale mechanics of dialogue trees and tough decisions work as well as ever in Borderlands, the new currency system feels half-baked. Fiona is able to accumulate money through our various decisions and actions, like finding hidden chests or choosing whether or not to pillage some cash from a dying man. While I like this concept in theory, its execution is a bit clunky. The amount of money I was carrying dropped between two scenes for no apparent reason, and the actual things you can spend it on seems entirely superficial. Maybe there are big plans for buying your way into or out of trouble in future episodes, but for now money is the root of most of Tales from the Borderlands evils. Like Walking Dead and Wolf Among Us, Tales is almost entirely devoid of puzzles, instead focusing on dialogue choices and character development. Im absolutely fine with this, but there are a few instances where I was forced to do a mundane action like push a cart across the screen and use it to climb up into a vent. Actions like this came across as tedious, and took me out of the story and the world for a brief moment. Speaking of action, the chase scene near the end feels like a step back from the action scenes in The Wolf Among Us. Where Telltales take on Fables allows us to make some decisions in choreographing the flow of fight scenes, Borderlands relies heavily on pass/fail quick-ime events. For example, I scratched my nose during the action, and found myself dead and forced to restart the scene. You rarely even die that quickly in Borderlands 2. Pros Great charactersConsistently funnyIntriguing mysteriesInclusive story Cons Currency system Any of Tales from the Borderlands Episode 1: Zer0 Sums minor setbacks feel like nothing when put up against the strength of the characters, the caliber of the writing, and the charm of the world. With only a brief introduction to Rhys and Fiona, they have already become a pair of my favorite Telltale characters, and the fantastic final scene of the Zer0 Sum has be anxiously awaiting my return trip to Pandora.", "date": "Nov. 26, 2014,"}