{"name": "This War Of Mine", "name_review": "This War Of Mine Review", "ref": "https://me.ign.com/en/this-war-of-mine/98107/review/this-war-of-mine-review", "text": "Games can be ridiculously reductive portrayals of complex problems. Everything is eventually solvable via learning and repetition. Once you figure out the system, you can start exploiting it. What was once difficult becomes easy. War, politics, relationships they're all ~winnable~ if you simply have the skill and insight to play the system. This War of Mine is a differentand far more honestkind of game. Even before you hit the menu screen, you've seen that same Hemingway quote so often trotted out by the Call of Duty series: ~In modern war you die like a dog for no good reason.~ Except in This War of Mine, that quote really is a guiding principle. As you try to lead a group of survivors during an unnamed conflict, by scavenging for items, jury-rigging survival aids like heaters and vegetable gardens, and bartering with other survivors for goods, you might occasionally feel like you're getting the hang of wartime survival. But then This War of Mine reminds you, in shockingly effective and heartbreaking fashion, that war doesn't follow predictable rules. Sometimes everyone just dies, with no rhyme or reason. One of my first games of This War of Mine turned out to be one my easiest, but I had no idea how well I was doing until later runs, when I struggled to regain the same ground. This time, my three survivors  Bruno, Pavle, and Marko  had almost everything they needed. I watched over them from the 2D, cutaway view of their shelter as fresh water came via a rain trap I'd built from assembled raw materials, and fresh meat came in from the homemade animal trap in the basement. They had a series of small workshops where they could build new furniture and appliances, plus an herbal workshop where they could create fresh bandages and homemade medicine. By night, Bruno usually slept in one of the homemade beds while Pavle stood watch over the apartment with a knife, protecting it from looters, and Marko went scavenging in the city. Every morning my game auto-saved, ensuring that I couldn't undo any nighttime disasters. The scavenging phase plays out as a tense, atmospheric 2D stealth game. While some abandoned locations are looters' playgrounds, the war-torn city features a lot of other unsavory types. Soldiers and militia might be willing to trade with you or simply ignore you, but they can turn on you in a heartbeat. Other survivors might shoot you on sight. Rummaging through a pile of rubble sends sound waves far into the distance, alerting people to your presence. Get spotted in a place where you shouldn't be, and you'll have a choice: run, hide, fight, or die. Once characters ~break,~ they won't do anything at all. Talking people out of their depression takes the better part of a day, and may not even work. Getting drunk is a more promising route to restore equilibrium, but it also takes a lot of time and consumes liquor, which has huge potential as a bartering tool. This is what makes this War of Mine so gripping, and so unforgettable. It remains as brutal and capricious a game as its subject matter. Your survival strategy is never much stronger than a house of cards, and small problems quickly snowball into big ones. When they do, youll probably end up restarting  and This War of Mine is so difficult you'll end up restarting quite a bit  so its good that it rarely plays the same way twice. There's something like a dozen locations you'll see reused through different playthroughs, but what you find when you explore them will change each time. One time, your game may start in the dead of winter and will have to burn fuel for warmth, while another game sees temperatures fall only after a few weeks have passed. The war itself might throw a wrench in your plans as key locations get cut off by ongoing fighting. Pros Evocative artSurvival sim gameplayComplicated & challenging morality Cons Autosaves onlyDifficulty spikes If you set This War of Mines theme aside, you'd have a tough and demanding survival and resource-management game  but it never lets you forget that it's about a serious and sad subject. It's full of thorny problems, and that just makes your small gains all the sweeter. As things begin to go wrong, the choices get harder. Do you intervene when you see a soldier assaulting a woman in a ruined supermarket, or do you keep your head down? Do you shoot a medicine you cant afford? These questions don't have right answers. But posing them, and putting the moral issues in sharp relief alongside the physical ones, is what makes This War of Mine one of the year's most thoughtful games.", "date": "Nov. 25, 2014,"}