{"name": "Samsung Gear Live Smartwatch", "name_review": "Samsung Gear Live Smartwatch Review", "ref": "https://me.ign.com/en/samsung-gear-live-smartwatch-android/98091/review/samsung-gear-live-smartwatch-review", "text": "Of the major companies making their way into the smartwatch market, Samsung has had more experience than most. While some are just now getting their first products out, Samsung launched the Galaxy Gear over a year ago, an Android-based wearable that, at the time, felt more like a prototype device than an actual retail product. Since then, both Samsung and Google have had time to refine their vision of what a smartwatch should and could be, with the former releasing a number of new wearable devices and the latter developing a version of its software platform specifically for this type of product. The result: Samung's Gear Live smartwatch powered by Android Wear, now available through Google and other retailers for about $199 USD. While we still don't know exactly what to expect from a smartwatch, there are plenty of companies ready to find out, with more on the way. Samsung and Google's latest attempt is a step in the right direction, but I wouldn't go as far to say that we have reached our destination quite yet, or that we can even see where it is on the horizon. Like the Motorola Moto 360 and LG's G Watch, the Gear Live is part of the first generation of Android Wear devices. As detailed in our review of Motorola's smartwatch, the operating system brings the developer's Google Now card system to our wrists, displaying notifications and other information that originate from a paired Android phone. These watches can do a few things on its own, like track your heart rate through included sensors and play locally-stored music, but for the most part they remain an extension of the small computer that typically resides in your pocket or bagyou can't even set up these watches to tell you the time without first syncing it with a compatible phone. Using Android Wear on the Gear Live's square screen is noticeably easier than with the round-faced Moto 360. Since Google Now cards are also rectangular, they more naturally fit the shape of Samsung's watch, and the existence of actual edges make swiping more accurate. The square face does make the device far less attractive than the new LG G Watch R or Motorola's offering, though, especially with its wide bezels and boxy, metallic housing. It is, however, more comfortable to use, thanks to its contoured casing. The watch's heft was easily felt during normal use and while jogging, but I never found it annoying. The Gear Live's rubbery straps can be swapped out if you want to add some personal style, or you can just stick around with the black or ~wine-red~ band that comes with the watch. Samsung's smartwatch uses a 1.63-inch Super AMOLED display with a 320 x 320 resolution, making it the most pixel-dense of the first three Android Wear devices at 278ppi (although far below what we see on current smartphones). Because of the OLED technology, the Gear Live does one thing far better than the Moto 360: tell the timethe most basic feature of any watch, smart or otherwise. With Motorola's LCD-equipped watch, if you want the time to always show, the screen becomes very dim when not in use, making it difficult to see at-a-glance. When the Moto 360 is set this way, battery life also becomes a major dissapointment, and I was never able to reach the end of the day with ~Ambient Screen~ activated. The Gear Live, on the other hand, completely blackens out the watch face's background, deactivating the pixels in the process, while still lighting up the text or watch graphics (much like Motorola's Moto Display feature on its smartphones). Even though the Gear Live's screen was activated and readable at all times, I was still able to reach my nightly recharging sessions with anywhere between 30 to 45 percent battery left. (We used the latest version of Android Wear, version 4.4W.2, during our review.) The screen isn't perfect, though. It was difficult to read the display in direct sunlight and on overcast days, which made tracking my activity through the Runkeeper app particularly difficult on a few occasions. Equipped with a 1.2Ghz Qualcomm Snapdragon 400 chip and 512MB of RAM, the Gear Live handled Android Wear just fineMotorola's entry-level Moto G smartphone uses the same chip. Card swipes and animations were smooth, and no performance issues were experienced while using the watch. Other features of the device and Android Wear, like voice commands and the built-in pedometer worked as intended. I was able to safely ask the watch to send texts while driving and initiate phone calls with moderate ambient noise, but I did have to turn down music to a reasonably low level to ensure that my words were properly dictated. Pros Always-on AMOLED displaySolid battery lifeQuality construction Cons Can be difficult to read in sunlightAndroid Wear doesn't have a lot to offer yet Samsung's Gear Live is a welcome upgrade from last year's Galaxy Gear. Even though the new device may not have the camera or speaker that the company's first smartwatch included, its solid battery life and OLED display still make it appealing and useful on a day-to-day basis. Android Wear has room to improve, but it's likely that more apps and functionality are on their way to the still-new platformhopefully sooner than later.", "date": "Nov. 25, 2014,"}