{"name": "LEGO Batman 3: Beyond Gotham", "name_review": "Lego Batman 3 Beyond Gotham Review", "ref": "https://me.ign.com/en/lego-batman-3-beyond-gotham/97997/review/lego-batman-3-beyond-gotham-review", "text": "Lego Batman 3: Beyond Gotham hews close to the series formula, pairing uncomplicated gameplay with a deep, charming dive into decades worth of DC Comics stories and history. But after the impressive freedom of Lego Batman 2 and Lego Marvel, Lego Batman 3 feels far more restrictive in scope, and its inconsistent tone sometimes seems to mock the great DC Comics source material it should be celebrating. Picking up from the end of Lego Batman 2, the villain Braniac drives most of the fun but scattered plot in Lego Batman 3. Without giving too much away, Batman and the rest of the Justice League have to team up with the likes of Lex Luthor, the Joker, and the rest of the Legion of Doom to bring him down, and sort out some trouble with the various Lantern Corps. Its not as strong or as focused a story as in either Lego Marvel or Lego Batman 2, but it manages to keep the interest high through most of the 10 hours or so it took to finish it. To ensure constant variety, Lego Batman 3 uses the same format as Lego Marvel, where different playable characters drop in and out of the missions at each checkpoint. You may be playing as Batman and Robin one moment, and then Green Lantern and Martian Manhunter the next. It definitely helps break up the action, which otherwise might get old quickly due to the simplistic attacks, and celebrates a larger roster of DC favorites. The best new addition to the system is that you can now load specific checkpoints of missions for Free Play; it makes finding all those little secrets so much more convenient. When the story missions are finished, theres loads more to do here, including plenty of other mission-style content. Were sort of left to figure that stuff out for ourselves, which is actually not such a bad thing; accidentally stumbling on a mission that recreates an old Adam West Batman TV show episode was fantastic. There are also options to explore the Hall of Justice and Hall of Doom, which are super fun for a DC fan like myself. I also enjoyed unlocking some of the more obscure characters from the DC canon  Im sure not many people are exactly champing at the bit to play as Etrigan or The Question, but its great that those more obscure characters get to share the stage with the likes of Superman and Wonder Woman. Its clear the game makers love the source material. From Wonder Womans idle animation where she does the Linda Carter-style twirl to Flashs frequent stints on the Cosmic Treadmill and the payoff of that final revelation between Batman and Robin, Lego Batman 3 does a great job of showcasing moments thatll resonate with fans of the comics. While its not quite as developed here as it was in Lego Marvel, I still appreciate that each character has a unique combination of abilities. Martian Manhunter and Superman both have heat vision, but the green guy can also control minds, while Supes has frost breath. This approach to character powers gives us lots of options, which are furthered by the excellent new suit system. No longer do you have to wait to find a station to swap out for the Magnet suit or the Sonar suit, because now characters like Batman, Robin, and Cyborg can change their power setups on the fly. Being able to change at will to any suit youve unlocked eliminates a lot of tedium. Even better, a quick button press instantly swaps you to the suit thats appropriate to the obstacle youve encountered. While not every game has to be open-world to be good, playing Lego Batman 3 made me long for the freedom of Lego Batman 2. Instead of roaming through the streets of Gotham at your discretion, youre mostly just running back and forth between the Batcave and the Watchtower. There are limited open-world options for the various Lantern planets, but those arent part of the main story and are generally small and pretty light on things to do. So why even have these unlockable vehicles if theres nowhere fun to drive them? My biggest disappointment with Lego Batman 3 is its inconsistent tone. The developers definitely love the source material, but there are moments where they take a substantial step away from familiar franchise turf to introduce elements that immediately start to erode the fun of being in the world of the comics. When Braniac comes to Earth, we dont get to battle him in iconic DC locations like Smallville, Gorilla City, or Paradise Island; No, Braniac just terrorizes Paris or Pisa. Shortly after that, you spend the final third of the story missions on a sort of sci-fi tour through unfamiliar Lantern worlds, which is kind of a letdown. I also have to question the decision to include these annoying cameos. Instead of DCs quintessential everyman Jimmy Olsen, this games ubiquitous hanger-on is Conan OBrien. Hes all over the place, repeating the same gags every time you see him. After a while, making jokes about how there are no Labradors in the Batcave laboratory gets kind of old. You even end up spending quite a bit of time with Daffy Duck as Green Loontern, which, again, kills the mood for me. Yes, I get it; its a game where Cyborg can fool a security camera by turning into a washing machine, but theres a difference between making a joke about the characters and just surrounding them with other stuff that also happens to be part of the Warner Bros. empire. (I didnt have as much of a problem with the inclusion of references to the Batman TV show because that, at least, seems to make some sense within Lego Batman 3s world  and unlike Daffy Duck, Adam West isnt hanging around the Watchtower talking about space the whole time.) Pros Convenient suit systemCharming charactersPlenty of content Cons Some generic localesBizarre cameos I like Lego Batman 3: Beyond Gotham, but I dont love it as much as Ive loved previous games in the series. It definitely delivers on the promise of letting me play with charmingly realized versions of many of my favorite DC heroes and villains, and it even presents a setting with lots of great surprises, challenges, and systems that promote variety. As a longtime DC fan, I do wish it had given me the chance to dig into more locations and plot elements from the comics, but the biggest hurdle for me to clear is the bizarre cameos.", "date": "Nov. 22, 2014,"}