{"name": "Escape Dead Island", "name_review": "Escape Dead Island Review", "ref": "https://me.ign.com/en/escape-dead-island/97597/review/escape-dead-island-review", "text": "Escape Dead Island has a bit of a commitment problem: every time it starts to flirt with greatness, it suddenly pulls back. The combat, the story, the exploration -- every major component surprised and engaged me at some point, but inevitably, each stopped just short of doing something truly memorable. As a result, Im left reaching for words like fine and nice instead of inventive and bold. Despite this untapped potential, however, Escape is indeed a decent game with a enough narrative twists and compelling collectibles to make for an enjoyable if somewhat underdeveloped experience. In some respects, Escape actually feels more like a tropical, zombie-infused version of 2012s Spec Ops: The Line than its namesake. In place of Dead Islands first-person perspective, sandbox map structure, four-player co-op, and multi-protagonist storyline, Escape opts for third-person single-player action as it guides us through the linear though intricately layered mental collapse of its lead character, spoiled rich-kid and chronic underachiever Cliff Calo...or does it? On the surface, the story is an eye roll-inducing checklist of routine survival-horror cliches  a shipwrecked group of kids, a zombie-virus-infected love interest, a vaguely evil corporation, etc  but to Escapes credit, theyre at least well-executed cliches. Theres enough playful banter early on to make the characters feel human, for example, and important revelations are spaced just far enough apart to keep the underlying mystery enticing. Plus, the entire ordeal is wrapped in something far more intriguing: Cliffs apparent march towards insanity. Like Spec Ops, Escape loves to toy with our perception of what were actually seeing and playing, occasionally injecting opaque dialogue and surreal moments that fundamentally challenge our notions of reality in a gaming context. Remember those shipping containers raining from the sky in the trailer? Yeah, that. Those mess-with-your-head moments (which Ill try not to ruin here) were easily the most addictive aspect of the whole experience. Unfortunately, Cliff spirals downwards a little too slowly, with only brief flashes of instability once every few hours in the early portions of the campaign. He does eventually go entirely off the rails -- and the ensuing insanity pretty much singlehandedly validates Escapes existence -- but even once the environments start to become twisted manifestations of Cliffs guilt and insecurities, hes still basically just fighting the same old zombies. So while the insanity angle as a whole is a huge plus, it doesnt have the support of interesting game mechanics behind it. Those good old zombie disposal mechanics dont go quite far enough either. At the outset of the campaign, Escape does a decent impression of a survival-horror game: Zombies can kill Cliff much faster than Cliff can kill zombies; hes armed with only two makeshift weapons; and environmental objects like FM radios can be used as distractions to avoid combat. By the end, however, Cliffs shotgunning his way through an endless army of various undead abominations. Perhaps due to a lack of commitment to either style of play, both the survival and combat elements are just, well... fine. Enemies are too dumb to be particularly threatening alone -- which essentially eliminates the stomach-churning dread you should experience when encountering an enemy in a horror game -- and the two-button, melee-centric combat is pretty no-frills: mash attack, dodge when necessary. There are no wacky weapons, and no deep, involving upgrades. Its entertaining enough to fill the gaps between plot points, but itll never be my go-to choice when I feel like slaying some zombies. That said, I actually spent nearly as much time hunting collectibles as I did hunting zombies, which helped ease the gameplay load away from the ho-hum combat. Cliff, like Dead Risings Frank West, is avid photographer, and the lush island of Narapela contains over 80 unique photo ops, as well as a host of more expected collectibles like audio logs, experiment data, and postcards. All that reading material rewards you with little pieces of backstory  and as anyone who accidentally got addicted to Pokemon Snap back in the day knows, remembering to whip out your camera for those special short-lived moments is its own reward. Be warned, though: Escape subscribes to the Metroidvania school of level design, meaning youll endure a fair amount of backtracking through its discrete, interconnected areas as you acquire new gear (yes, you can eventually enter the Lost-esque hatch you find on the first beach). I spent a solid 20 hours working my way through the campaign, but I probably could have powered through the main story in half that time. Fortunately, the consistently excellent soundtrack created a palpable tension that made all that exploration feel like it was building towards some creepy revelation even if I was just taking pictures of crates. Pros Insanity-based storyPhotography metagameExcellent soundtrack Cons Cliche survival-horrorMiddling combat Seeing an island paradise brutally corrupted is unsettling; seeing our lead characters mind fall to pieces, even more so. While Escape Dead Islands workmanlike combat and ho-hum zombies fail to fully capitalize on this unoriginal but respectably executed premise, it does manage to punctuate its enjoyable filler with some genuinely spectacular moments of madness. <em>[Note: Escape Dead Island is also available on Xbox 360 and PlayStation 3.]</em>", "date": "Nov. 18, 2014,"}