{"name": "Monark", "name_review": "Monark Review", "ref": "https://me.ign.com/en/monark/194704/review/monark-review", "text": "Its always exciting to dive into a new JRPG from one of the genre's veterans at the helm. Monark comes to us from Kazunari Suzuki, best known for his work on the Megami Tensei and Shin Megami Tensei franchises, so it had a ton of potential. To its credit, it does introduce some fresh combat mechanics to an otherwise-straightforward tactical JRPG structure. But Monark continuously trips over itself elsewhere due to a disjointed story, static puzzles, and repetitive level design that made staying interested a lot harder than it could have been. Monark sets up a high-stakes story that takes place at Shin Mikado Academy, where a mysterious barrier looms over the school grounds and makes it impossible for anyone to leave. You take control of a Pactbearer: someone who has made a deal with an otherworldly daemon called a Monark that provides a unique power known as authority. The drawback, however, is that if this is used in the real world a mist will appear that will slowly drive people mad.This setup is engaging to start, but it never develops much tension. Most of the characters are interesting thanks to distinct personalities and solid voice performances to sell them: Ryotaro, for instance, is a fellow Pactbearer who has a confident sense of self and purpose yet has a tragic and grounded backstory. The cast has some fun little banter between expeditions in the True Student Council meeting room, too. Unfortunately, by the time theres any real effort put toward fleshing out the characters youve already hit the climax of the story, making it far too little too late.Your first fiend can have a big effect on your playstyle.Things begin with your traditional silent protagonist taking a psychology test to develop your ego  effectively a personality sheet detailing attributes which are based on your relationship to the Seven Deadly Sins. Depending on which sin you match best with, you are given a corresponding fiend who serves as a party member. Each fiend has a unique skill tree that focuses on different abilities such as attacking, healing, or causing status effects like poison or bleed, and that can have a big effect on your playstyle. This also ensures youre never alone when it comes to combat, but it seems like a missed opportunity that these fiends dont have any role outside of that, whether it be in the story or even just having a personality to interact with. Theyre just tools for you to use at the end of the day. As you explore the school you will run into people who give out more psychology tests to further boost your ego. At Monarks encouragement, I based my answers on what I would personally say (as opposed to a character I wanted to roleplay as) and I found most of the results and descriptions to be a relatively accurate description of my beliefs or feelings, whether that be a good or bad thing. For instance, after saying that I would choose to sing popular songs during karaoke, I was perceived as being someone who likes to stand out as much as possible; something that I find to be true as an extroverted person.Having the psychological tests be the main factor helped make my Monark playthrough feel unique to me.While there are other ways to improve your stats, like collecting crystals placed around the school, having the psychological tests be the main factor in determining your ego and the order in which you unlock fiends helped make my Monark playthrough feel unique to me. My first was Gluttony  a fiend who focuses on lowering enemy stats while buffing themselves in return  but someone else might get Envy, which deals extra damage to enemies who are under a status effect, in which case things might get more difficult because youd need to put more of your resources into healing items to compensate. But even with those personal touches, Monarks greatest sin is repetition. Each section of the story is built around a different party member, but their objectives are always the same: find all three of a Pactbearers Ideals (giant crystals that make up their inner self) and destroy them. These Ideals are located in the Otherworld, a grim plane inhabited by daemons and where all of Monarks battles take place. All three of the Ideals for each Pactbearer are based in the same building, so your goal is usually to reach the roof, clearing out an Ideal on each floor one at a time. Most of the time this involves solving mundane puzzles to find a key to unlock the room that contains the Ideal, and that involves either a combination safe, a computer login, or hints that are too vague to be useful. These are generally solved by looking through documents or student profiles on your phone, and that kind of sleuthing never felt satisfying. The level of repetition and lack of variety in Monarks level design is what eventually made it feel more like a chore than a pleasure. The level of repetition and lack of variety level design eventually made it feel like a chore.Another idea that doesnt really work out is the Madness mechanic, at least as it relates to the real world. Wherever an Ideal is located in the Otherworld, a mist appears in the corresponding real-world place. Anyone who walks through it  including you and your party  suffers mental damage and will eventually go Mad. This is represented by a Madness bar, and if it hits 100% you will collapse and reawaken in the schools infirmary. While I got what Monark was trying to do here with trying to simulate the feeling of death looming over me, the fact is that there were never any real consequences to going Mad outside of battle so those moments feel like a waste of time. Especially since you can easily just fast-travel back to the beginning of the floor you were on when you pass out, its just a mild inconvenience. On the other hand, the turn-based battles you fight when you reach an Ideal is one of the few shining highlights of Monark, thanks to fun abilities, unique combat mechanics, and the best part: an excellent soundtrack during boss fights. Your Madness meter level transfers from the real world into battle, but here if a character hits 100% youll lose control of them and theyll attack whoever is closest with dramatically increased power. That can be bad, but it also allows you to make some clever gambles if the situation is right, like isolating the rest of your units away so that the character who goes Mad can wipe out your enemies. When the stars align, it's a good feeling.On the opposite side of the spectrum is becoming Awakened, a state where you gain the same kind of power as in Madness but maintain full control of your actions. This power is obtained by using the Resolve skill or by being damaged in battle. Getting my Awakened meter up never felt like a priority, but if there is a round where you cant hit an enemy it feels good that you can dedicate your turn to that instead of wasting it. Alternatively, each party member is able to defer their turn over to another character who has already gone, allowing them to act again  but in doing so their Madness increases more every time they are given an extra turn, which is a good way of limiting this powerful mechanic from being abused. It is a rarity, but you can also become Enlightened  when you become Mad and Awakened at the same time  allowing you to deal even greater damage without losing control. There were very few times where this happened in the more than 40 hours my playthrough took, and the big risk is that you must become Mad first to achieve it  but when the stars align, its a good feeling. All of Monarks overlapping systems frequently gave me reason to pause and think about every action I took during combat, because everything you do comes with a cost. Art skills are physical in nature and take a chunk off of your health when used, while Authorities are magical and sap your sanity, increasing your Madness meter. Spending one or the other based on the situation is a meaningful tactical choice that brought another layer of depth to every battle. That being said, while Monark does have an impressive amount of different abilities and skills, the enemies never pushed me out of my comfort zone, so I was never forced to do anything other than my proven routine. In combat, the goal is always to approach an enemy from behind to deal extra damage and avoid a potential counter-attack. Additionally, having your allies near the enemy you are attacking will allow them to do a follow-up attack to deal extra damage. Nicely enough, the battlefield will show whether or not you will get an assist from an ally before you make your commitment. Once you figure the optimal way to position your party, youd be foolish to approach a battle with any other method, and Monark never throws any curve balls to force your hand.In a move that works out to be a strength and a weakness, Monark doesnt use the traditional grid-based battlefield we see in most tactical JRPGs  instead it allows for more freedom of movement with attacks and abilities based on circular and angular range. This is a refreshing take simply because its different, but there were several times where I was frustrated when my character was just a hair out of an attacks range, making me miss the predictability of grid-based combat. After a battle has concluded you are given an amount of Spirit, which is the bread and butter of leveling your party. It costs a certain amount of Spirit to unlock or upgrade your characters abilities, and every time Spirit is spent in this way, that character levels up. (You can also use it to buy items, which is a nice way to encourage some tricky decisions about how to spend it.) It is a cool concept as it strays away from the experience bar where you often see similar games, but it becomes more of an annoyance once more members join (and often leave) the party. Each section of Monark focuses on a specific party member, but that character will leave the party once their chapter is over. Some will rejoin you later, but they wont be boosted up to the level that you are now at, forcing you at times to grind specifically to level that one character up. This became more of a hassle further into the story, including one time when a character joined my party at level one while my main character was already in the mid-30s, leaving them useless until I spent the time (and Spirit) to improve them. Those stretches could have easily been avoided by making new party members come in at a base level closer to where youre already at so playing through didnt feel as much of a slog as it already was. Monark has a lot of interesting ideas that could have come together into a great tactical JRPG, but whats here feels more like a prototype. Its Madness mechanic adds interesting choices to its fights, but is mostly irrelevant and annoying outside of combat. And while its well-voiced party members eventually grow on you, I wish I had more time to directly interact with them so I cared about their wellbeing when it came to major moments in the plot. The real drag, though, is the repetition in the mission structures, which is the same sequence of events and dull puzzles over and over again with very little variety.", "date": "Feb. 19, 2022,"}