{"name": "Assassin's Creed: Rouge", "name_review": "Assassin's Creed Rogue Review", "ref": "https://me.ign.com/en/assassins-creed-rogue/97395/review/assassins-creed-rogue-review", "text": "History has always played a pivotal role in the Assassins Creed series. It serves as both inspiration and backdrop  a resource for dramatic events, supporting characters, and villains. Rogue is slightly different, though; its more concerned with examining the history of the series itself than exploring real-life events. The result is one of the most striking and intriguing stories seen in an Assassin's Creed game, but forgettable missions. an empty world, and lack of effort to put a new spin on how this long-running series plays and controls continually undermine its dramatic intentions. Rogues greatest strength is its central character  Shay Patrick Cormac  and his journey from dutiful Assassin to vengeful Templar. Most of the trailers surrounding Rogue have portrayed Shay as a cold-blooded killer, but thats in no way accurate; his story is nuanced, and the narrative is patiently unfolded. You play the first third or so of Rogue as an Assassin, which lets you forge relationships with those you will later hunt. Theres a good chunk of the 14-hour campaign where Shay doesnt have any clear allegiances, and even then, he never really descends into brutal killer territory. Theres always a sympathetic motivation to be found; its all much more nuanced and ambiguous than I was expecting, and it makes for the most engaging story in an Assassins Creed game since the days of Ezio Auditore da Firenze. Rogue also attempts to transfer the crisis of faith Shay experiences to us, and for me it worked. Familiar faces and locations from each of the past Assassin's Creed games are thrown up and put in some sort of order, but the perspective of those events we know is either changed or challenged. Shay isnt a villain; hes an individual, who questions orders and suspects inherited truths, and for the first time in the series we are encouraged to do the same. Rogue is great because it does away with the idea of black-and-white villains at all. This adds a renewed level of intrigue to what is a very familiar Assassins Creed experience of running across rooftops, freeing hostages, sabotaging the enemy, and of course, killing important people. I was hoping some of this would feel different playing as Shay the Templar, but disappointingly there are no new abilities to distinguish. Since he was trained as an Assassin, its bloody business as usual. And when the time came to confront my former Assassin brothers and sisters, what should've been dramatic moments were revealed as forgettably staged and mechanically bland. In both good ways and bad, Rogue plays like a direct sequel to Black Flag, and carries on its strong emphasis on seafaring. The map sends us around Albany, New York, the frozen waters of the North Atlantic, as well as plenty of small towns and quaint settlements, like the pumpkin-strewn Sleepy Hollow, dotted around. Even though it can be on occasion a bit fuzzy around the edges with some dodgy shading, Rogue is a frequently pretty experience. Sailing through blizzards while your ship cuts through the ice looks great and is thrilling. But for all of its good looks and atmosphere, I cant help but find Rogues world lacking. Yes, it looks big on a map, apparently crammed with things to do  forts to conquer, animals to hunt, territory to explore  but I cant stress how extraneous all of these activities are. For example, I only lightly upgraded my ship, and managed to easily finish the campaign without ever tending to Shays equipment. Consequently, there's just no reason to spend time hunting; there's no benefit. And I feel the same about the icons and question marks dotted around its sprawling map: they're just not that interesting, and if you do explore, the pay-off rarely justifies the excursion. As a result, Rogue feels deceptive; it appears to be generous, but it's not. And because it's a world that doesn't reward curiosity, either with fun or material gain, I finished Shay's story without really getting to know the cities of Albany or New York, and used fast travel whenever possible. Over the years Assassins Creed has acquired so many systems  hunting, urban renewal, myriad collectibles  but unlike a savvy pirate, its reluctant to jettison them for the good of the mission. Sadly, for a game so focussed on reappraising the past, Rogues core combat and traversal mechanics remain unimproved, and as with every Assassin's Creed game before it, at times I found them painfully frustrating. There are several missions which involve you taking out a series of guards in wide-open environments, but I rarely did I feel like a skilled Assassin as I jumped into a campfire by accident or like a season captain of a ship as I jumped into the bay of a harbour instead of its pier. This is all frustrating  or if you're in a good mood, a touch comical  but when it ruins key moments in the story, I found it unforgivable. Pros Intriguing, fresh storyCompelling protagonistImpacts the wider series Cons Same old control problemsEmpty world Rogue has the most interesting story of any recent Assassins Creed game. Its fascinated by its own history, and introduces a level of ambiguity which changes how we look at the formerly simple conflict between Assassins and Templars. So it's all the more disappointing there's so little to do while the story is being told; the upgrade economy's pointless and most of the tasks are quite trivial. Story aside, so much of Rogue feels redundant, repetitive, and ultimately in need of reinvention.", "date": "Nov. 15, 2014,"}