{"name": "Halo: The Master Chief Collection", "name_review": "Halo: The Master Chief Collection Review", "ref": "https://me.ign.com/en/halo-the-master-chief-collection/96623/review/halo-the-master-chief-collection-review", "text": "The Halo series has the historic distinction of inspiring millions of gamers to spend hundreds of dollars on new consoles just to play it. The Master Chief Collection  which includes all four numbered entries in the series  is a great reminder that Halo succeeded not because of hype or flavor-of-the-month popularity, but because of timeless first-person shooter design. With excellent stories, sandbox battlefields, great AI, and memorable multiplayer, everything holds up against modern shooters, many of which owe a huge debt to Halos inspiration. Its all presented beautifully, with remade graphics and sound that allow old hands like me to relive the glory days through rose-tinted glasses, and new fans to appreciate the classics without having to look past decade-plus-old graphics. However, Halos memorable multiplayer modes are undermined by unacceptably unreliable and bug-ridden performance in the days after launch, to the point where I cant recommend that you buy Master Chief Collection right now for that functionality. Thats heartbreaking, but on the bright side theres still more than enough single-player and co-op content here to strongly recommend it for those alone. The fan service begins right at the main menu: a flick of the thumbstick starts playing the soundtrack of the selected game. Its a laudable touch, considering how big a part Halos musical scores have played in establishing the series memorable atmosphere. I jumped straight to the star of the Master Chief Collection: Halo 2 Anniversary. Like 2011s Halo: Combat Evolved Anniversary, Halo 2 Anniversary is actually running two graphics engines at the same time, allowing you to instantly switch from 2004 graphics to 2014s Xbox One coat of paint and back again at the touch of a button. Admittedly, the new facade is a bit rough around the edges  I saw occasional frozen enemies, some framerate dips, and a few long loading screens that jarringly interrupt the pace as the impressive new cutscenes cue up. And while the graphics are up to modern standards in many ways, theyre hardly jaw-dropping. Some parts of the campaign seem unnecessarily dark, for instance, and I dont agree with all of the choices made on the new art. But the sum of Halo 2 Anniversarys parts  most notably a classic campaign that now runs at 60 frames per second  trumps its minor annoyances. Im giving the audio a standing ovation. Halo 2s already-great soundtrack has been remastered, and sounds bigger and fuller while remaining reverential and respectful to the original. Its so good Id listen to it in my car. Meanwhile, Chiefs chunky metallic footsteps have been added, and every weapon sound has been replaced with beefier, more aggressive versions. The new Battle Rifle and sniper rifle in particular pack a satisfying wallop, but I couldve done without the more musical Covenant energy sword and overcharged plasma pistol effect. It sounds like the Jetsons car floating by. You can appreciate the contrast easily, because the audio, like the visuals, also cycles between the 2004 original versions and the 2014 remastering along with the graphics. And you know what? Halo 2 remains a damn fine game, especially now that you can jump straight into Halo 3 and minimize the whiplash of that hard-stop of an ending. Bombastic set pieces like the battle on the Scarab, the Scorpion tank trek across the bridge, and the Banshee run near the end all mix with a plot that ably weaves the parallel stories of Master Chief and the Arbiter. Phenomenal new cutscenes not only breathe new life into the plot, but make me long for a feature-length CG Halo film. The best example is the stunning Gravemind scene. What was an unintentionally hilarious conversation with a featureless brown worm is now a dramatic confrontation with the hideous amalgamation of all Flood parasites, rendered here in disgusting detail. Buy 1, Get 3 Free The other three included Halo games all run at 60fps too, but all suffer from the same noticeable, but far from crippling framerate dips. That doubled speed gives the campaigns and multiplayer modes alike a newfound smoothness and polished feel. All but Halo 2 run at 1080p, which still looks good at the slightly lower resolution of 1328 by 1080. Theres no going back from this smoother framerate: the Master Chief Collection is the definitive version of each of these games. Its great to see the lost art of local split-screen co-op multiplayer revived here, in all four games. Its now much more playable, thanks to splitting 1080 lines of resolution between players instead of just 320, and on much larger TVs than were common a decade ago. Dont expect to maintain 60 frames per second in split-screen, though  the dips are far more frequent this way. Master Chief Collections version of Combat Evolved is based off of 2011s Halo: Combat Evolved Anniversary. It cant match up to Halo 2 Anniversarys Xbox One-ified upgrade, but its a whole lot better than dusting off your 2001 Xbox to replay this still-great game. Some things, like Chiefs relatively short jump height and inability to board vehicles, feel a bit archaic now. But the original Halos excellent story and still-remarkable large-scale combat sandboxes  not to mention the goosebump-inducing chanting-monks theme  make the first Halo both enjoyable and relevant in 2014. Halo 3 is probably the relative low point in the looks department. It has neither the benefit of Halo CE or Halo 2s recent coat of Anniversary paint, nor of being fairly new like Halo 4. The resolution and framerate boosts do give it a nice, clean look, at least. And with the exception of that exacerbating Cortana mission, it remains arguably the series finest start-to-finish campaign, complete with an ending that retains all of its emotional punch. As for Halo 4, its stunning visuals are Master Chief Collections most pleasant surprise. What was already a high point for graphics on Xbox 360 legitimately looks like it was made for Xbox One when running at 1080p and 60fps. Its sound design remains the best in the series, too, aside from the Battle Rifle. I wish itd gotten the same sound thunderous effect as Halo 2 Anniversarys version, because now it sounds like a childs toy by comparison. Master Chief Collection also offers Campaign Playlists, a clever way to take advantage the fact that all four Master Chief adventures are under the same roof. Whether youre playing the last levels of each campaign back-to-back or consecutively tackling every tank mission on the disc, theyre a clever addition  particularly in local or online co-op. Multiplayer Tragically, online functionality has been extremely messy in the days following Master Chief Collections launch. Ive seen everything from extended matchmaking wait times to being dumped into a seemingly random map and gametype option that wasnt voted for. Additionally, crashes to desktop, freezes, parties being split up into separate teams, uneven team pairings, and custom-game oddities like mixing up the teams when time you come out of a match mean that, for the time being, you have to wrestle with Master Chief Collection just to play it online. Its a true shame that, for now, Halo 2 was easier to play with your friends a decade ago than it is today on exponentially more powerful hardware and a more robust Xbox Live. When it works like its supposed to, as it did at a pre-release review event and hopefully will for everyone one day soon, Master Chief Collections massive multiplayer suite makes me happy, primarily because it gives me two things something Ive waited years for: the ability to play Halo 2 on Xbox Live again (following the server shutdown in 2010) and the chance to play the original Halos groundbreaking multiplayer online (which even Halo CE Anniversary spectacularly failed to give). Its here, and on dedicated servers, no less (in matchmaking; custom games are peer-to-peer, as they always were), with the multiplayer modes of Halo 3 and 4 thrown in for good measure. After several hours rotating through the four multiplayer games and their combined 100-plus maps (every DLC map is here, save for all of Halo 4s subpar Spartan Ops, which is due to be added via a free update in December) Ive come to reaffirm in 2014 what I believed in 2004: Halo 2 is still the king. Running around Blood Gulch, Hang em High, or Sidewinder and three-shotting my friends with Halo CEs lethal default pistol is nostalgically satisfying, but Halo 2 made such a leap in terms of gameplay and features that it makes Halo CE feel its age more than the others. Perhaps Halo 2s greatest accomplishment is its incredible complement of maps, many of which remain classics. Swords-only on Lockout, 1-Flag CTF on Zanzibar, anything on Midship,  Halo 2 packs 25 maps, and 90 percent of them are gems. And long-gone but not forgotten gametypes like Fiesta are lovingly resurfaced, as are the deep customization options. For instance, I resurrected an old Coagulation map variant I created 10 years ago called Covie Gulch, which replaces the Scorpion tank with the Wraith and the Warthog with the long-absent Spectre. Its all back, with the small but annoying exceptions of no longer being able to transfer party leadership to another person in your group and the presence of open-channel voice chat instead of Halo 2s useful proximity/push-to-open-a-channel combo. Elsewhere, there are six Halo 2 Anniversary maps  a separate group of remakes on top of the complete original complement of Halo 2 battlegrounds  and they deserve special mention. These half-dozen built-for-Xbox One stages are, quite literally, modern takes on some of Halo 2s best maps. They dutifully recreate the exact, welcome feel of Halo 2 in addition to the look. In fact, while its hard to complain about content when theres so much of it, the six Anniversary maps are so beautiful and fun that I really wish there were more of them  particularly since they have their own matchmaking playlist on Xbox Live. Halo 3 and 4, meanwhile, also return exactly as you remember them. For all the benefit of having every Halo multiplayer here, the downside is that it really is jarring to jump from game to game in consecutive multiplayer matches. A universal control scheme option mitigates this somewhat, but that doesnt account for the mental and physical adjustments you have to make for the differences in jump heights, physics, weapons, etc. between each. The Battle Rifle appears in Halos 2, 3, and 4 for instance, but it is its own unique animal in each. Finally, in the context of multiplayer, the game-unifying interface is mostly successful in helping to easily parse through so many choices. I appreciate how you can press a button to go straight back to the top menu, rather than have to repeatedly B-button your way back, step by step, if you want to go do something else. One complaint, though: it oddly fails to show you a preview of your Spartan or Elite multiplayer avatar after you build it in the very same interface. The Master Chief Collection makes good on most of its promises. It packs in four full games worth of single-player and co-op action, all spruced up and running better than ever before. It saddens me that, because of its early online multiplayer problems, what shouldve been a celebration of the return of Halos old-school multiplayer greatness is currently an exercise in frustration. Right now we can only sit back and wait for Microsoft to fix its servers and party problems, and until then the greatness of revived and enhanced Halo 2 multiplayer is still an unfulfilled promise. Still, great games like this should never die. This collection delivers more than a huge Halo fan like myself could have reasonably imagined and, even with its (hopefully temporary) online issues, it packs an insane amount of first-person shooter greatness onto one disc. Heres to reliving old memories and creating new ones, because maybe in 10 years from now, this Master Chief Collection will mean to some of you what Halo 2 meant to me a decade ago.", "date": "Nov. 14, 2014,"}