{"name": "Nexus 6", "name_review": "Google Nexus 6 Review", "ref": "https://me.ign.com/en/nexus-6/97199/review/google-nexus-6-review", "text": "The Nexus 6 is ridiculous. The latest in a line of elite Android smartphones is equipped with a Quad HD resolution display, top-of-the-line internals, and a brand-new version of Google's operating systemoh, and it also has a screen that measures nearly 6 inches diagonally. Google and Motorola have managed to completely change up what we've come to expect from Nexus phones. For the last two years, these devices were practical handsets that didn't try to compete with high-end flagships, and, most importantly, they were incredibly affordablethe LG-made Nexus 4 and Nexus 5 originally sold unsubsidized for $299 USD and $349, respectively. The Nexus 6, on the other hand, is jam-packed with high-end specs, a monstrous high-resolution screen, and a great camera, all for $649. The latest Nexus has a lot to offer for diehard Android fans, but whether it's enough to justify the relatively high price tag depends on how deep your pockets are and how big you like your phones. The sheer size of the Nexus 6 is unavoidable. Measuring at 6.27~ tall, 3.27~ wide, and 0.4~ thick, the newest from Google is the biggest flagship Android phone to be released. Nokia's 6-inch flagship, the Lumia 1520, is the only major smartphone that is wider and taller than the latest NexusApple's quite large iPhone 6 Plus, for comparison, measures up at 6.22~ by 3.06~ by 0.28~. Needless to say, a vast majority of the time you'll be using the Nexus 6 with two hands. I was only able to single-handedly use the phone when casually scrolling through apps, with links and navigation buttons often out of reach. One-handed grip-shifting was particularly dangerous, as our white review unit used an unfortunately slippery rear shell. The slick, rear case's curvature didn't make the phone much easier to use when it rested on a flat surface, either, and swiping on the screen would occasionally cause the phone to rotate. Who knows why Motorola and Google chose to not include a textured back with more grip, but I definitely feel that the phone is worse off because of it. But the size of the phone isn't a complete downside. Consuming media on the Nexus 6 is an absolutely fantastic experience. The 5.96-inch AMOLED display sports a resolution of 2,560 by 1,440 (yes, Quad HD is still overkill), resulting in a pixel density of 493 ppi, and everything viewed through it was beautiful. Whether looking at hi-res photos or streaming movies, the screen performed great. Colors were bright and bold without being washed out, blacks were deep, and good viewing angles made it easy to share content with those nearby. Paired with a set of loud front-facing speakers, there probably isn't a better phone for watching videos, whether by yourself or with friends. The quality of the speakers also extended to receiving calls. Using my Verizon Wireless nano SIM card, call quality with the Nexus 6 was great for both ends of the line, even without new technologies like HD Voice Calling or VoLTE present. Oddly, the speaker phone was rather quiet and is hopefully something that can be fixed in a future software update, especially since holding the phone to my face looked and felt awkward. The rest of the outward hardware design is nearly identical to Motorola's Moto X, just much bigger. The front-facing speakers are symmetrical is size and placement, a metal band wraps around the edges, the power button and volume rocker sit on the right side of the phone, and the manufacturer's concaved badge sits directly below the center-aligned rear-facing camera and its circular flash ring. The Nexus 6's rear shooter shares the same megapixel count as the camera found on this year's Moto X, but photo quality was noticably better on the phablet. The implementation of optical image stabilization surely helped, and it's possible that Google updated some of Android's image processing software with Android 5.0 as well. The new Nexus may actually have the best camera we've seen on a Motorola phoneit certainly performs better than its smaller sibling. Photo details and colors looked great, regardless of lighting. In darker situations (where OIS really comes in handy), the phone's camera setup was smart enough to keep bright colors from washing out while avoiding the noise and graininess that can easily show up in low-light pictures. The new Android camera app isn't as robust as what you may find on a manufacturer-skinned phone, but there are few basic options available for those who would like a little more control. In addition to the choice to enable HDR+ mode, users can also capture 4K video, panorama shots, or Photo Sphere images. Like the Moto X, the Nexus 6 does not include a microSD card slot or a removable battery. Fortunately, the Nexus starts with 32GB of storage, and doubling that will only cost you an extra $50the Moto X comes with the option for 16 or 32GB of space. Underneath the rear case is a large 3,220 mAh battery, the same capacity as the one found in the Samsung Galaxy Note 4. Even with the large screen, the Nexus 6's battery does a proper job at making sure the phone stays on for extended periods of time, thanks in part to the ~Project Volta~ optimizations added to Android 5.0. I was easily able to get through an entire waking day with moderate use while connected to a smartwatch, and I wouldn't be surprised if light users can go two days or more between charges. Those who tend to stream a lot of video content or utilize the phone for heavy tethering, however, will still need the Turbo Charger before day's end. The overall battery performance is about on par with the newest Note, although not quite as long-lasting as Motorola's new Droid Turbo with its monstrous 3,900 mAh battery and smaller 5.2-inch display. To keep the latest version of Android moving smoothly, the Nexus 6 is equipped with a 2.7GHz quad-core Qualcomm Snapdragon 805 chip, Adreno 420 graphics, and 3GB of RAM. Although this is the same hardware found in Samsung's phablet, the Nexus definitely felt quicker, likely due to the lack of manufacturer tweaks and a brand new version of the base operating system. Oddly, our benchmark tests did not agree. Using Geekbench 3, AnTuTu X, and Ice Storm Unlimited, the Nexus 6 ranked far below similarly-equipped devices like the latest Galaxy Note. I imagine that this is due to the new operating system, which the testing methods may not be properly equipped to handle quite yet. Gaming proved to be a simple task for the new Nexus, though, with The Wolf Among Us and Star Wars: Galactic Defense looking and running great. Making my way around Android was completely pain-free as well, and not a single hiccup was experienced while using the device. Whether hopping in and out of apps, flipping through the redesigned recent app list, or agressively scrolling through tweets and Facebook posts, nothing slowed this phone down. With Lollipop, Google replaced the Dalvik VM with Android Runtime (ART) to speed up code compilation, and the improvements are noticeable. Fortunately, Android 5.0 isn't only quicker, but it also happens to be the best-looking version of the OS. Introduced earlier this year, Android 5.0 Lollipop contains some of the biggest changes to the operating system since Android 4.0 rolled out in 2011. First off, gone is the black and blue, Tron-like color scheme. Like many other developers, Google has decked out its software with flatter icons and brighter colors, along with Google Now card-like elements in apps and menus, all of which make up the platform's new ~Material Design~ design language. Apps have already begun to adopt the new visual cues, with Google unsurprisingly taking the lead, but others, like the BeyondPod podcast app, are already sporting the new look. That isn't to say that Android now looks like iOS 7 and 8. App icons still have their own unique shapes and the flatness of the UI is broken up by drop shadows that give the appearance of cards stacked upon one another. The operating system's standard navigation buttons have been updated as well, although the new circle, square, and triangle icons have yet to grow on me. One of my favorite updates to the operating system is the inclusion of notifications on the lock screen. These are essentially the same notifications you would see in Android's pull-down shade, but now one tap closer to the user. You can expand messages and interact with music control widgets, dismiss notifications, or double tap an item to open the app, all without unlocking the phone. Other features, like multiple users, a battery saving option, and a revised keyboard design are also included with Android 5.0, just to name a few. There are a lot of changes to Android with Lollipop, some of which can be seen by the user and others that occur behind the scenes. The new design language really brings the visual aspects of the operating system together in ways that iOS users have enjoyed for years and owners of Windows Phone devices have experienced since the platform launched. Android's new look is more attractive, effective, and unified than previous versions, and the Nexus 6 is a great way to show off what Google has done to make the operating system feel more cohesive. Nexus 7 (2012) and Nexus 6 Unfortunately, in the case of the Nexus 6, stock Android does not offer anything that takes advantage of larger displays. Unlike the big flagships from Samsung and LG that provide options like split-screen apps or ways to make single-handed use easier, the Nexus 6 is essentially just Android on a big screen. Even the iPhone 6 Plus, Apple's first phablet, provides features like its ~Reachability~ option and the ability to view the home screen in landscape orientation. Although Lollipop may look gorgeous on the 6-inch display, Google didn't make the screen size any easier to use. Pros Android 5.0Great display and fast performance.Long battery life.Well-performing camera. Cons Large size could be a turn-off for many.Much more expensive than recent Nexus phones.Lacks phablet-optimized software. For diehard Android fans, the Nexus 6 is a no-brainer. The very first phone to include Lollipop has insane specs, a long-lasting battery, and what could be Motorola's best camera yet.<br><br> But for everyone else, the latest Nexus can be a tough sell. Even those who have enjoyed Nexus phones for the last two years will need some convincing. Although the Nexus 6 has top-of-the-line hardware, it also comes with a price tag more than twice as expensive as the Nexus 4 when it launched, and $300 more than the Nexus 5.<br><br> And let's not forget about the elephant in the room. The Nexus 6 isn't just bigit's huge. It's larger than the Samsung Galaxy Note 4 and LG's G3, and compared to these other oversized flagship phones, the new Nexus offers less in terms of phablet-specific software. Android 5.0 is fantastic, but it'll eventually make its way to the Note and G3, likely sooner than later. There isn't much reason for the Nexus 6 to take up so much space, and phablet fans may actually be better off with one of the aforementioned alternatives. But if your goal is to experience Lollipop the way Google intended, you can do a lot worse than the Nexus 6.", "date": "Nov. 13, 2014,"}