{"name": "Creative Sound Blaster Evo ZxR Headset", "name_review": "Creative Sound Blaster Evo ZxR Headset Review", "ref": "https://me.ign.com/en/creative-sound-blaster-evo-zxr-headset/97192/review/creative-sound-blaster-evo-zxr-headset-review", "text": "Creative has established itself over the years as a gifted audio maker that has continually found ways to improve sound quality and subsequently make our gaming experience better. I mean, who hasnt used an Audigy or a XiFi sound card at least once as a PC gamer? But besides awesome sound cards, Creative also has a burgeoning lineup of gaming headsets that tops the high-end spectrum in terms of performance and features. The Evo ZxR is the newest addition to the lineup, though unlike the Omega and the Stigma series, the ZxR is pitched as an all-rounder despite being classified as a gaming headset. Creative has found ways to marry aspects of a Bluetooth headset with gaming features, creating what could be aptly described as a swiss army knife of headsets. The ZxR not only plays nice with the PC and next-gen consoles, but is also compatible with any Bluetooth device. This means that you can use it to attend to calls, while its built-in sound card does wonders with the source material. Design The ZxRs design lines are funky and over-the-top, something that sort of sits well with most gaming headsets these days, but I wouldnt want to be caught wearing these in public as my daily music driver. The ninja-star design on the ear cups and the splash of steel-red is borderline gaudy, more so because the material used feels cheap, like a Tiida trying to masquerade as a Ferrari because its painted red and has a ,ool spoiler on the back. I expected a more classier design aesthetic from a $199 headset, but nevertheless it still feels very durable. That said, the Evo ZxR is at least functional in its design. On the right earcup you will find all of the buttons you need to customize your listening experience, while the left earcup is left clean with a simple Sound Blaster logo on its surface. From the headset, you can turn off ANC, which cancels small environmental noises, enable TalkThrough which basically mutes the sound so you dont have to remove the headset if you are disturbed, change tracks, and turn on/off the built-in SBX sound processor. The surface of the right earcup also doubles as the NFC tapping zone, and when pressed, answers your calls if you have it paired with a smartphone. As I said before, the Evo ZxR is versatile in its connectivity. Like a jack of all trades, the headset can connect to any device, be it via USB, a 3.5mm jack, or through Bluetooth. Pairing it with a smartphone also allows you to answer calls, and offers sufficient voice quality with its built-in microphone. Impressively, the ZxRs SBX sound processor can be used through Bluetooth with the help of a small app that allows you to change profiles and sound settings much like its desktop client (we will get to that in the next section). Comfort-wise, the big pleather cushions are soft and snug around the ear, and the well-padded headband provides a nice and secure fit. I played the entire Call of Duty: Advanced Warfare single player campaign with the ZxR, including a bunch of multiplayer rounds and the headset remained extremely comfortable during those sessions. I completed the single player campaign in around five sittings of 2-3 hours each and I never felt the need to pull off the headset to take a break or found them hurting my ear in any way. The ZxR are built for mammoth gaming sessions and should provide enough comfort to get you through them. Performance The Evo ZxRs 50mm drivers pumps clean, well-rounded audio to the ear even though it does lean a bit towards the bass side of things. Still, the bass is executed in a controlled manner where the thump of the audio never clouds the details in any way. The bass is also butter-smooth, which makes for a great listening experience. As a stereo headset, the ZxR delivers in almost all aspects. It may not have a large soundstage as other headsets in the same price bracket do but its clutter-free audio, smooth bass and great spatial awareness more than makes up for it. I played a few matches of Advanced Warfares multiplayer and received sufficient situational awareness from the headset to know where the enemies were located. Its not as precise as I would have liked, where the sound sometimes is more central, but it wasnt too bothersome to deter from the overall experience. However, Creative is banking on its built-in SBX sound processor to fill in those gaps. To fully utilize SBXs features, you will need to download the Sound Blaster Control Panel app available freely for Windows and mobile phones. SBX works by stimulating a surround sound experience by widening the soundstage even further. Basically, its Creatives own virtual 7.1 surround sound solution. I usually brush aside such features and recommend against using them as they reduce the overall sound quality. However, unlike other such applications that lose clarity and introduces an empty theater effect in creating a surround experience, the SBX truly makes a huge difference to whatever you are listening. TitanFall turns into a sprawling battlefield with a click of a button, where the clambering of a Titan, the distant gunfire between warring pilots, and the swift sounds of parkour come through the speakers with great range and depth. Even when listening to mp3 files, the music is suddenly infused with energy and clarity, although some may prefer to turn it off for this purpose as it does thin the sound slightly. When using SBX, its important to choose the correct preset. The Sound Blaster Control Panel offers three: Movies, Music, and Gaming. Each of them can be customized to your liking, so if you want more bass in your gaming, you can simply enable it for the preset and adjust the slider accordingly. There is also an equalizer if you want to fine tune the sound further. Unfortunately, the control panel does not support auto-profile switching based on the application you are using, so whenever you want to play a game or a movie, you must manually switch it to the correct profile from either the desktop client or from the mobile app. Using the correct profile is key because mis-matching the source will result in a pretty poor experience (for example, using the music profile with a game - something I found out the hard way). Coming to the mic, the ZxR does away with any external hardware whatsoever, opting instead for built-in ones. While the microphone provided sufficient sound quality during calls, the same cannot be said when I tried it on the PC. Normally, I would present a recording of my voice to demonstrate the mic quality, however both Audacity and the built-in Windows sound recorder kept crashing as long as the ZxR was set as the default sound device - something that should be kept in mind if you are planning to use the headset for Skype or any other recording purpose. In terms of quality - from whatever I could salvage from Audacity - the sound lacked clarity and came out extremely bloated and distorted. The control panel does allows you to turn off background noise and boost voice quality, but nothing seemed to have helped. Pros Ergonomic and comfortable earcupsSBX sound processor is excellentRange of connectivity optionsBluetooth support allows you to pick up callsPlays nice with next-gen consoles Cons Not too gravy on the overall designPoor mic quality The $199 price tag is steep and the first impressions holding the Evo ZxR isnt that impressive due to the cheap look and feel of the device. But that belies its durability and great ergonomics which provides hours of use without hurting your ears too much. The ZxR also boasts fantastic surround sound capabilities with its built-in SBX sound processor, which widens the soundstage without adding hollowness and distortion like other surround solutions do. That coupled with its wide range of connectivity options makes the ZxR one of the most versatile headset available in the market.", "date": "Nov. 13, 2014,"}