{"name": "iPad Air 2", "name_review": "Apple iPad Air 2 Review", "ref": "https://me.ign.com/en/ipad-air-2-ipad/96167/review/apple-ipad-air-2-review", "text": "Surprisingly, its not an Android or even Windows tablet that gives the iPad Air 2 the most run for its moneyits last years iPad Air. Though theres currently no other large tablet Id recommend over the Air 2 in terms of speed, build quality, or app selection, Im equally hard-pressed to say its enough of a leap that everyone should choose it over the original Air. Thats not to say barely anything has changed. Inside and out, Apple has made a number of meaningful tweaks to its flagship tablet. The one thatll stand out right away is just how much thinner the iPad Air 2 feels than last years modelwhich was already slim to begin with. The difference between 6.1mm and 7.5mm may not sound like a lot of difference on paper, but in the hand youll definitely notice it, especially given the addition of a slightly lower weight (0.96lbs). Youll also notice just how the reduced weight and thickness make it a joy to use. Lazily pinching the Air 2 between my thumb and forefinger as I pop between Flipboard and Pocket has quickly become my favorite way to catch up on all the articles I queue up throughout the day. And with the Air 2 boasting a small boost to color reproduction, reading your favorite series on Comixology is an absolute pleasure. Dark, cool colors are deeper and richer overall, and blacks are just plain blacker. However, youll want to stick to the indoors or the shade with the this new iPad; while its less reflective than last years model, using it in direct sunlight is still pretty unpleasant. Internally, the Air 2 sports a new processor, the A8Xthe only Apple device currently doing soand its beastly. In benchmark tests, the A8X handily beats the original iPads A7 chip by wide margins. Thats not borne out yet in most current apps and games though, as the differences youll see when loading games like Knightmare Tower and Infinity Blade 3 only take a second or two less time than on the iPad Air. But thatll likely change as soon as developers start taking advantage of the hardware. Where you will see changes is in web browsing. Safari is absolutely blazing on this new iPad. Sites dont load so much as snap to attention. Third-party browsers like Chrome have gotten a boost too, but it feels like theres some optimization left to do before it takes full advantage of the A8Xs power. As for exciting new featuresTouchID is the biggest, most notable addition from the iPad Air. If youve been pining for the feature after getting accustomed to it on your iPhone 5S or iPhone 6/6 Plus, you're in luck, as you can now skip passcodes and instead use your fingerprint to unlock your tablet. iOS 8 also offers some useful options, like Handoff, which lets you start something on a different Apple product (either a computer running OSX Yosemite or a device running iOS 8) and continue it on your iPad Air 2 or visa versa. Being able to text non-iOS users from Messages is also a nice perk, though it requires being able to piggyback on an iPhones cellular service. The operating system does show quirks, though: keyboard hiccups, the occasional app crash. The Air 2 even completely locked up at one point. And Handoff isnt always consistent: sometimes my last project or browser activity was waiting for me on the lock screen, and other times it wasn't. Keep in mind that these issues arent Air 2-specific, per seyoull encounter them on iPhones and also the original Air if youve upgraded it to iOS 8but since iOS 8 is the native operating system for the Air 2, youre stuck with whatever kinks it has until an update rolls out to fix them. Given all that youll do with the iPad Air 2, its impressive that it lasts just as long as its predecessor, what with its beefier specs and slender build. I got Apples claim of 10 hours easily; the Air 2 took on a weekend of streaming movies, playing games, reading comics, and browsing the web before needing a trip to the charger. If youre just popping it open for the occasional email and social media check-in, plus some web use, you can go four or five days on a single charge. Whats not impressive is the same rough choice Apple put in front of iPhone 6 and iPhone 6 Plus owners. Like with the newest iPhones, the storage options for the iPad Air 2 are 16GB, 64GB, and 128GB. You can't buy a 32GB option. Leaving the bottom dollar option at 16GB feels like a ploy to get buyers to size up; if the base model had been a workable 32GB, thered be some serious value there. As it is right now, you really need to spend at least $600 to respectably future-proof yourself. Spending $500 for a 16GB tablet thats just too cramped to hold a decent amount of movies and games doesnt make any sense. In fact, this is exactly where the iPad Air manages to keep its relevance for folks thinking of getting their first tablet or replacing a seriously aged one. For $450, you can get a 32GB 2013 iPad Aira still-svelte tablet with a great screen and peppy processor. The iPad Air doesnt feel slow yet, even after downloading iOS 8, and if you never plan to tax it with resource-intensive apps and games, it should keep you happy for a long time. Pros Fast, especially on the webGreat battery lifeBeautiful screenSo very thin Cons 16GB model too smallSome iOS 8 features are inconsistent Of the large tablets on the market, the Apple iPad 2 beats out all others when it comes to how thin, light, and fast it is. But the only thing keeping it from completely crushing all of its competition is that its more of a step forward, rather than a leap. Many users, particularly those who dont care about TouchID, wont find its specs enough to justify its price tag, as last years iPad Air is still a good buyits $450 for a 32GB iPad Air versus $500 for the iPad Air 2s 16GB model. Still, for those willing to part with that extra $150, you are getting that amount of functionality.", "date": "Nov. 2, 2014,"}