{"name": "Corsair K70 RGB Mechanical Keyboard", "name_review": "Corsair K70 RGB Mechanical Keyboard Review", "ref": "https://me.ign.com/en/corsair/95585/review/corsair-k70-rgb-mechanical-keyboard-review", "text": "Recently, Corsair launched its Corsair Gaming line of products: a separate ship within the companys armada, complete with aggressive new logo. But while this branding change is more of a centralization of their gaming peripherals (headsets, mice, mouse pads, and keyboards) than a complete overhaul of their product offerings, Corsairs also released some new items to prove that the brands no-nonsense design ethos wasnt tossed overboard during this branding change. One of these is the K70 RGB keyboard, a variant of their wildly popular 104-key mechanical keyboard. Its roughly the same mechanical keyboard Corsair released last year, with a nice weight, superb build quality, and sleek metallic finish, and comes with the choice of blue, brown, or red Cherry MX switches. What distinguishes it from its plainer sibling, however, is its customizable LED lights. Users can control the lighting scheme of the keyboard in a highly detailed way, be it the color of individual keys or the lighting effects that sweep (or dont sweep) over the keyboard. Tailoring the K70s lighting to your taste isnt a simple matter, though. No matter how you want to trick out your K70 RGB, youve got your work cut out for you. The board itself might be plug and play, but getting your moneys worth from the lighting software takes some heavy lifting. It took me thirty minutes to get the numpad, WASD, number keys, and the rest of the board glowing in different colors. Just getting the board to slowly transition between colors took fifteen minutes. You can make groups of keys easily, thanks to the click and drag interface, but juggling these groups can be a headache. Switching between multiple schemes or programming them to launch with specific programs means working through some dense menus. Everything is divvied up between four menusprofiles, actions, lighting, and settingsand you must comb through each of them before you can really get anything done. (Thankfully, the essential features of a gaming keyboard, like disabling alt-tab or the Windows key, are simply a matter of checking a box.) However, if you can muster the patience and dedicate your time, you can get some awesome results. Lighting effects can actually function as timers, so once youve fired off an attack, you can program the key to glow again once the cooldown period has passed. Your DPI adjustment switch can glow with varying intensity, reflecting just how fast your mouse will be moving. And if youd like to use the board for more technical tasks, you can build a scheme that highlights special keys you need for programs like Photoshop or Avid. Whether or not the lighting features are for you, there are of course all the features that made me love the K70 enough to give it a place within my home. Its easy to clean, as its keys sit high above the faceplate, giving crumbs and dust nowhere to hide. You can basically tilt this thing to one side and dump any errant bits right out. And if thats still not enough, a few blasts of duster will quickly have it looking as clean as the day you brought it home. Theres also a removable wrist rest, another essential feature that makes the K70 that much nicer to use. And of course, the K70s dedicated media keys round out the experience. The tension on the volume wheel has been upped slightly to reduce overscrolling, but its essentially the same keys as on the non-RGB K70 that allow you to easily program for control over your music or video playback. Any board in this price range without dedicated controls like this is basically incomplete. The only thing missing is USB passthrough, which was available with the regular K70. Presumably, this was removed so that the K70 RGB model would get enough power for its LEDs, but if this feature is important to you, you'll continually notice its absence. Pros Well-designedAwesome aestheticsGood choice of switches Cons Unintuitive softwareNo USB passthrough While the K70 KGB is an excellent keyboard, its appeal rests predominantly in just how fancy its lighting is. If you just want a well-made mechanical keyboard, particularly one with USB passthrough, youll be paying an extra cash for features you won't use or aren't getting. If youre someone who wants to seriously trick out their desktop while still getting the most functional gaming keyboard around, however, the Corsair K70 RGB should be your go-to choice.", "date": "Oct. 26, 2014,"}