{"name": "Defense Grid 2", "name_review": "Defense Grid 2 Review", "ref": "https://me.ign.com/en/defense-grid-2/94696/review/defense-grid-2-review", "text": "Just like the 2008 original, Defense Grid 2 is the kind of game I can sit down with intending to play a quick 30 minutes, only to look up and find three hours have passed. This brand of extremely addictive min-maxing tower defense retains all the strength of the first game and adds a new layer of complexity that promises to extend replayablity - even if it cant repeat the originals unexpectedly emotional story. This isnt one of those sequels that sets out to reinvent itself, so its 20 levels are largely slight variations on the excellent Defense Grid puzzles weve done before: a stream of alien invaders run the same path to your precious power cores and attempt to abscond with them (generally along the same path they came in on) while you attempt to fry them with a selection of strategically placed upgradable gun turrets. Its a game of meticulous min-maxing optimization, and it inspires obsessive levels of tweaking tower placement and resource expenditures by making it extremely easy and consequence-free to jump back in time a few seconds to prevent an alien from escaping with an orbital laser blast, or rethink that hard-hitting laser tower in favor of a concussion tower thats better for taking out the incoming swarm of small targets. Defense Grid 2 contributes some relatively minor tweaks and increased variety. Versatile new Boost towers allow you to cheaply block off alien routes to extend the amount of time you have to beat on them, build towers on top of them to gain elevation for better firing angles, and upgrade them with power- or score-boosting effects. Since Defense Grid 2 very wisely ditches the annoying flying enemies that could only be effectively destroyed with Missile towers, the Missile towers are now redesigned to attack ground targets. That makes them feel a bit redundant to the also long-range Meteor tower, but their stats are different enough to make them useful in different scenarios. You can differentiate them further with unlockable modifiers that allow you to alter towers with traits like improved splash damage, at the cost of lower overall damage, or enhanced effectiveness against shields. You can also pick an alternate superweapon, such as a time-slowing device or an extra resource infusion. Im excited about all the extra replayability Ill get out of Defense Grid 2 because of this, but Im a little annoyed I have to lock them in before I start a match. It leads to situations where I have to play once, quit all the way out, change my settings, and start up again. The other significant new feature is that you can spend resources to change the layout of a level in pre-set ways, raising or moving chunks of track or buildable pads. The option to spend money on things other than a new tower or an upgrade opens up lots of new possibilities - having already gold-medaled 18 of 20 levels by barely touching this option, I was intrigued when I started opening up entirely new strategies on certain maps. On top of all of this, there are now eight mode modifiers you can apply to any of the 20 maps. Theres one with 100 waves of enemies (up from the usual 20 to 30), one that allows you to directly deal damage by hovering the cursor over an alien, and one that prevents the cores from traveling back to the center of the map when the alien carrying it is killed. It gives you lots of extra ways to play, and each mode has its own leaderboard  fighting for dominance on those can create some intense rivalry. I found the biggest disappointment in the story  though in the grand scheme of things, having any story at all in a tower defense game is something of a luxury. The disappointment is the result of an expectation created by the surprising emotional depth in the first games monologue from your AI sidekick, General Fletcher, who was both brilliantly written and voice-acted with heart. Fletcher returns in Defense Grid 2, but the script is almost entirely forgettable and some of the voice acting from some of the cast of new characters - particularly Commander Simon - is just eye-rollingly bad. Finally, theres multiplayer, which sadly doesnt add anything good to Defense Grid 2. I had some brief fun with the competitive mode, which transports aliens your towers kill to your opponents map at the same corresponding spot where they died, but its too chaotic and unpredictable, and lacks the ability to rewind or change the speed of time. The two co-op multiplayer modes are just annoying. First of all, you cant step back or speed up time because its multiplayer, so its both slow and crippled compared to the single-player experience. Second, youre both pulling from the same resource pool, so unless youre both totally on the same wavelength the whole time, you can have your partner spend the resources you were saving up for a big tower upgrade, and theres no way to undo except sell the tower at a loss. Its silly. Pros Addictive levelsLeaderboardsTons of modifiers Cons Disappointing storyPointless multiplayer Defense Grid 2s new variations on the originals excellent tower defense gameplay pulled me right back into the compulsively addictive quest to destroy all aliens with a minimum of expenditure. I dont recommend the multiplayer and the story doesnt even compare to the standard set by the original, but its 20 maps absolutely scratch that same itch  and provide lots of tools to keep that momentum going for a long while.", "date": "Oct. 15, 2014,"}