{"name": "The Spiderwick Chronicles", "name_review": "The Spiderwick Chronicles Review", "ref": "https://www.ign.com/articles/2008/02/13/the-spiderwick-chronicles-review-3", "text": "Gamers should always approach licensed games with caution.  More often than not, the tie-in tries to coast on the brand name rather than provide a fun gaming experience.  I'm happy to report that The Spiderwick Chronicles sidesteps this pitfall and offers a surprisingly enjoyable adventure for the younger gamer.  It immerses the player in a lighthearted, fantasy world filled with an impressive amount of mythical creatures. It's not perfect, and more experienced players will likely grow bored with it before the end, but adolescent adventurers will likely be engrossed with Arthur Spiderwick's Field Guide to the Fantastical World Around You.   The Chronicles were originally a best-selling children's book series that is now being released as a feature film this week. Of course, with children's movies come videogame tie-ins. The titular Chronicles are an encyclopedia of the fantasy world that exists all around us. Arthur Spiderwick discovered this hidden dimension many years ago and kept a journal of his discoveries. Players take control of three siblings when they discover the field guide after moving into Spiderwick's old mansion.   Your Great Uncle Spiderwick left plenty of clues to help you along your journey. The first thing you'll notice is that the game is very dark.  The game will prompt you to adjust the brightness right off the bat, but I played every version of Spiderwick on several TVs and every time I had to turn the brightness all the way up.   Gameplay is a mix of exploration, puzzle solving, and combat.  There are tons and tons of items to find, Sprites to catch, and curious areas to check. The game does a good job of engaging the player, keeping them from getting bored, and enticing them with what might be waiting around the next corner.  Puzzles start out easy, but eventually they provide a nice little challenge.  One aspect of gameplay that is a little obnoxious, though, is that you can't pick up an item until the game decides it is time.  You may examine an item, then learn how to use it, and have to backtrack to go pick it up.  The game lacks an inventory system.   Combat is mostly button-mashing, but it's pretty satisfying smashing in a goblin's skull with a metal baseball bat.  As you defeat enemies you'll pick up goblin teeth, which (for some reason or another) unlock new attacks.  Of course, these usually only grant you another press of the A button, but there are a few cool abilities to be unlocked.  Jared, the sibling you begin playing as, has a rather awesome ~launcher~ attack that lets him hit goblin home runs.   Finding Sprites will grant you magical abilities such as healing, super speed, or super strength.  Catching them with your Sprite Net will initiate a mini-game where you have to ~water color~ an image of the fairy.  This would get tedious were it not for the fact that, once you catch enough of a certain kind, you are freed from the need to paint their portrait.    Visually, The Spiderwick Chronicles is acceptable.  It looks fine when you're standing still, but developer Stormfront didn't add in any of those special touches that help to bring a game world to life.  Collision detection is poor so you can swing your bat right through most objects.  On your quest you'll encounter a menacing creature that lives in the river and there's a cool scene where it toys with a goblin and then eats it.  The whole scenario would be more effective if the goblin didn't disappear before it touches the creature's lips.  This same beast doesn't cause ripples in the water in which it resides.  There is also a cheesy loading screen that replays a thousand times with flat, poorly-animated leaves blowing by.   Soon you'll upgrade from a broom stick to a baseball bat. The game does a lot of handholding for the player, especially in the beginning chapters.  But that's fine, considering it's aimed at younger gamers.  Later on, though, it can become frustrating when the player is left without knowing where to go or what to do.  Usually the Field Guide can be consulted for tips on what to do next, but it's not always helpful.   Spiderwick's soundtrack is of very high quality, perhaps based on the music of the movie.  It consists of creepy music boxes and toy pianos, and really helps bring the player into this imaginary world.  Most of the voice acting is also very well done, except, unfortunately, the voice of Jared, the main character.  As you investigate items, he recites his commentary like a robot made out of wood.  And all around, lip synching isout of synch.   The game unfolds through scenes from the film, which is all well and good until startling differences in the game and movie are revealed.  For instance, there is a sequence where one of the siblings says goodbye to the others and leaves the mansion to go into town and is chased by a troll.  At the end of the journey the game switches to movie footage and all of a sudden the brothers and sister are all together trying to escape the monster.The Spiderwick Chronicles recreates that feeling of being a kid and suspending your disbelief in fantasy. Much of this success in setting a mood and creating an intriguing world to explore is attributable to Holly Black's original books. But I have to give credit to developer Stormfront for creating a fun game to go inside the Spiderwick license. The graphics aren't much to look at and the game can become frustrating at times. But there is a big area to delve into, the music is great, and there is a lot of gameplay variety. There's something new to find around every corner, and that's something I can't say about enough games. The Chronicles could get younger players hooked on adventure gaming.", "date": "Feb 13, 2008"}