{"name": "Commanders: Attack of the Genos", "name_review": "Commanders: Attack of the Genos Review", "ref": "https://www.ign.com/articles/2008/02/13/commanders-attack-of-the-genos-review", "text": "The Xbox Live Arcade exists to offer simple, yet addictive and fun, games that can be picked up and played at a whim by most anybody. To that end, Commanders: Attack of the Genos is a success. It follows a standard formula and does little to rock the boat. It offers something familiar and fun for those on the lookout for a simple strategy fix.   Commanders: Attack of the Genos is a turn-based strategy game similar to Advance Wars. Each side has a base where they collect resources and build units to use in battle. The individual units have their strengths and weaknesses, including firepower, speed, and which units they are most effective against. Tanks are strong against other ground vehicles and infantry but weak against aerial attacks, for example.    The bulk of the strategy comes with how you maneuver those pieces on the battlefield when it's your turn. Each round consists of moving your army around the board and, if they're in range, attacking the enemy. Then you get to sit and watch them do the same to you, so hopefully you've taken defense into account before making any rash decisions. The standard environmental effects are in, such as moving quickly over roads and taking slight cover near obstacles. To make things a bit more interesting, each side has a powerful commander unit that has special attacks and can offer stat boosts to those in the close vicinity. Each of the eight commanders is unique, so which you enter battle with will help shape how you fight.      For your 800 Microsoft Points (US$10), you get a training sequence, a 15 mission campaign (which can be played on either standard or advanced difficulties) and 10 maps for single or multiplayer battles. Those aren't big numbers, but you're actually looking at a sizable amount of gameplay just getting through the campaign. If you're looking for a little lighthearted fun, or something suited for your kid, the story in the campaign mode works. The tale is told entirely through text with 2D pictures of the people talking and it's about as basic as they come.   The simple story is sometimes at odds with the difficulty of several of the latter stages, mostly due to the surprises sometimes thrown your way as you uncover the map you're playing on. Each campaign mission has its unique catch. Some require you to guide a small faction through a gauntlet of enemies and traps. Others are made easy through the proper use of specific techniques, such as flanking through an overseas route with an air transport unit. Nothing is overly difficult, but the extra tricks tossed into several maps to shake things up a bit can present a fair challenge.   The multiplayer game can be played either online or off with up to four players, depending on the size of the map. The offline game is a bit goofy if you play with fog of war on since it rather defeats the purpose, but it's still a welcome inclusion. Online matches play better for those looking for a game with movement hidden from their opponent. In both cases, the various rule options for setting up a game are fairly extensive.   A force to be reckoned with. If you like reds and blues, let me tell you, you're going to love the visual style of Commanders. It's got both of them in spades. Outside of the color palette, you're looking at a basic, but workable, look with a style pulled from what humanity thought the future would be like in the 1950s. For a Live Arcade game, a good amount of work was put into making the animations and graphical effects both fun and easy on the eyes. The music and sound effects follow the same inspiration as the graphics, though with a tad bit less success.   When you look at Commanders from the eyes of a hardcore gamer, there are a few elements of the game worth griping about. There are occasionally issues with the camera being obscured by scenery when it pulls in close to show the action. The AI has trouble adapting to your strategies in any meaningful manner. Several units, artillery in particular, aren't balanced properly and can be exploited. If you're big into strategy games, Commanders is a game that has the potential to keep you interested but ultimately can't compete with games with bigger budgets. Perhaps most sorely missed is any kind of map editor.    Those looking for a simple turn-based strategy game could do a lot worse than Commanders: Attack of the Genos. The game is a fun distraction as a single player game and a good amount of fun when playing online. For casual gamers or those looking for some relaxed strategy gaming in between more intense affairs, Commanders is worth a look.", "date": "Feb 13, 2008"}