{"name": "Merv Griffin's Crosswords", "name_review": "Merv Griffin's Crosswords Review", "ref": "https://www.ign.com/articles/2008/02/14/merv-griffins-crosswords-review-3", "text": "Pat Sajak and Alex Trebek -- those are surely the biggest names in game shows, right? Nope. That mantle belongs squarely to Merv Griffin, the game show impresario behind the behemoths Jeopardy and Wheel of Fortune. Before his death last year, Griffin created one final game show based on his love of crosswords. Merv Griffin's Crosswords pit a pair of contestants against each other. While the two leads try to fill in word puzzles, a back-up trio of ~spoilers~ can capitalize on mistakes and take over one of the two contestant spots. It leads to a lot of musical chairs and give-and-take, something that certainly livens up the premise of just filling in blank squares.   EA Mobile's take on Merv Griffin's Crosswords is an accurate representation of the game show, which is currently in syndication. After creating your avatar, you work against computer challengers to fill in words with the help of tiny hints. These hints are easy at the beginning of a match, but by the end of a game, they tend to turn obscure. The longer the word, the more cash it is worth.   In the second round of the game, the spoilers enter the scene -- and this is when Crosswords can get maddening. If you do guess and fail, a computer opponent can sneak in and snipe the answer. You are then relegated to the back row and must hope you can repay the favor to either of the two leads. At this point, you really are just relying on whether or not an equation somewhere deep on the game decides the computer is going to flub an answer. Naturally, this seems to happen on words that are exceptionally tough to guess.   If you manage to survive the spoilers and stand tall with the most cash, you enter the final round. You see the entire set of puzzles from all rounds now in the context of one giant crossword puzzle -- like you would see in the newspaper. You have 90 seconds to fill in the remaining words. This is an incredible challenge, and if you manage to pull it off, it feels like a real-deal accomplishment.   Unless you're sniped by the computer and feeling cheated, round after round extends that feeling of achievement. These puzzles can be grueling and if you manage to fill in the word correctly in spite of an iffy clue, it's impossible not to smile. If you are a word puzzle fan or a crossword nut, you'll get the most mileage out of this game by far.   I made sure to DVR an episode of Crosswords before running this review so I could compare the mobile game to the show. The set and puzzle screen are good facsimiles, keeping up a good trend in mobile game show games. The last batch of mobile game show ports I've played -- 1 vs. 100, Millionaire, Are You Smarter Than a 5th Grader? -- has done a good job replicating the atmosphere. The presentation is clean, entering the words requires only a basic knowledge of texting, and the avatar creator does give you a nice opportunity to personalize the game.  Merv Griffin's Crosswords is a no-brainer for fan of crosswords and word puzzles. It's a good take on the game show, as well as a fresh way to present crosswords on mobile. Highly recommended.", "date": "Feb 14, 2008"}