{"name": "Dark Messiah of Might and Magic", "name_review": "Dark Messiah of Might and Magic Elements Review", "ref": "https://www.ign.com/articles/2008/02/15/dark-messiah-of-might-and-magic-elements-review", "text": "Dark Messiah of Might and Magic, a PC game developed by Arkane Studios and published by Ubisoft in 2006, was an action role-playing game set in a medieval fantasy world. For the Xbox 360 port, Ubisoft decided to drop the majority of the game's role-playing features to focus on its ultra-linear action side instead.    Like its predecessor, in Dark Messiah of Might and Magic Elements, you play as Sareth, a young apprentice of nebulous parentage who embarks on a world-saving mission. It's like every fantasy novel you've ever read, minus the engaging dialogue and character growth. There are demons, ancient relics, crystals and everything you've come to expect from many recent Western fantasy RPGs, except for the role-playing.   In the PC version of Dark Messiah, you had some control over your character's growth. Completing objectives and dispatching enemies earned you skill points, which you could then distribute as you saw fit. In Elements, the level-up process is nearly 100 percent linear, just like the gameplay. You'll level up as you progress, but the game allots the skill points you earn in a pre-set fashion, depending on which of four basic classes you've chosen to play as: warrior, archer, assassin or mage.    Don't make me kick you.   With these RPG nods removed, Elements becomes solely an action game consisting of a seemingly endless series of battles set against a thin narrative backdrop. Aside from small detours in treasure-filled nooks and crannies, Elements is an on-rails experience and there's no open-world aspect to speak of.    Along the way, you'll be guided along by a cast of kooky characters like Xana, an oversexed spirit vixen, portrayed by a voice actress who manages to sound like she's auditioning for a low-budget porno and a high school play at the same time. Not that the other voice actors are much better; they all fairly slaughter an already hackneyed, directionless script.   There is unquestionable fun to be had with the game, as it theoretically works as a fantasy-themed monster melee concept. Powered by Valve's Source engine and the Havok physics engine, Elements gives you a handful of ways to kill whatever comes at you. Depending on what class you choose, you can dispatch baddies with sword, bow, dagger, staff or magic, each of which have a secondary Power Strike function and an additional, higher-level function that can be unleashed once you build up your adrenaline bar (filled by dealing damage).   Something evil is afoot.   But the real pleasure in Elements comes from environmental kills, the opportunities for which are plentiful. In addition to attacking and defending, Sareth has the ability to kick his opponents, sending them stumbling backward a few steps. It's a simple move that allows for some creative results. Kicking an opponent into a fire results in instant death, as does kicking an enemy into a wall of spikes or over the edge of a cliff.    Sticking your foot in your victim's chest and watching him plummet to his death, screaming on the way down, is by far the most satisfying part of Elements, second only to punting enemies onto protruding spikes. In medieval times, it was apparently the custom to stack spiked boards every 50 feet in caves and castles, which makes it easy to kick enemies to their pointy reward. Do the forty-odd Black Knights I've slaughtered in this fashion regret their decision to populate the spaces they patrol with spikes, useless fires and precariously-positioned shelving full of heavy barrels? Well, it serves them right for following whatever evil thing I'm fighting that I lost interest in a long time ago.      If you're a collector at heart, there's good news: Dark Messiah of Might and Magic Elements is built on the concept of rounding out an inventory of items, weapons and armor. As you plow through the game, you'll come across ~collection items~ that you'll gather and store, and there are achievements to be had for finding them all.    Unfortunately, you can only use a tiny fraction of the items you gather and most just sit on a collection screen with no connection to your character whatsoever. What's more, you'll find the same items over and over again throughout the game. By the fifth time I found the same set of armor in a ~secret area,~ I was ready to forget about the whole collection process altogether. I fulfilled the requirement for picking up a Black Knight's sword and shield early on in the game but that didn't stop the words ~collection item~ from hovering over each and every one of their weapons each time I felled them for the rest of the game.     The feisty Black Knights are one of about 10 different enemies you'll see in Elements, an unfortunate number in a game with no role-playing, no unique story and no surprising gameplay elements to keep your mind otherwise occupied. Once you're through the first of 10 chapters in Elements, you can resign yourself to a plodding sequence of killing ghouls, knights, necromancers, orcs, zombies, spiders and the occasional weird flying octopus for the rest of the game, with a couple yawn-inducing boss battles thrown in as an afterthought.   At this point, it should require no spoiler alert to tell you there is a giant-spider fight in Dark Messiah of Might and Magic Elements. Many of the bosses in the game die in disappointing one-shot, environmental kills (pull a lever, shoot it in the eye once, etc.), but the spider battle was shaping up to be a bit hairy, I thought to myself as I hacked away at its soft underbelly. Then the spider got stuck in a wall and became un-killable, forcing me to re-load my save and start the battle over again (always a dangerous move in Elements, because the game tends to crash during save reloads).    For the entire battle, I found myself fighting not only the spider but also the game itself, trying to prevent my foe from backing into a glitch -- the opposite of a good gaming experience. What could have been the game's best boss battle turned into a frustrating illustration of one of Elements' worst traits.   Please, not the eye.   Aside from disappearing bosses, glitches are all-too common in the game, appearing at odd, inopportune moments and further hurting an already precarious experience. My favorite example is the Phantom Blacksmith's Hammer, which my character tended to whip out at inappropriate moments. I'll explain.   Throughout the game, you'll have a few opportunities to forge your own sword -- make three and you'll get an achievement for your trouble. The sword-making activity is actually fun the first time, but there's no real skill involved. Just grab a bar of steel, put it in a cauldron, heat it up by turning a crank and puffing on the bellows, cool it by pulling a lever and then pound it into shape with a nearby wooden hammer.   The hammer is just there for the sword-making mini-game and never shows up in your inventory, but that didn't stop my character from brandishing it inexplicably multiple times during the game. Then it would disappear as fast as it arrived and the bow I'd been trying to equip would miraculously appear.   You again?   If the Phantom Blacksmith's Hammer was Elements' only issue, it would be a forgivable and almost endearing glitch. Instead, I laid in on top of a growing mental pile of technical gripes.   The game's multiplayer mode, aside from being relatively boring and featureless, also seemed plagued by technical problems. I had serious issues getting into a game at all (erasing two early saves seemed to fix the problem, but I really can't be sure), and once in, I was unexpectedly dropped from matches and experienced freezing more than once. One IGN editor went to change his controller configuration only to find a series of white lines on-screen. When it was working, Elements' multiplayer worked passably well but left a lot to be desired. There are no weapon swaps (if you choose a warrior, you get a sword and that's it), and environments are less than stellar-looking.    In parts, Elements looks very nice, and the developers clearly know how to create some nice lighting effects. Textures are largely well-done, but they're often marred by pop-in and tearing. Framerate is inconsistent at best, and battles with multiple enemies frequently result in significant slowdown. One particularly stuttery boss battle felt like it was unfolding underwater.   As a going-away present, Elements completely froze when I beat it, the ~achievement unlocked~ icon stuck on my screen against a black backdrop until I powered my system on and off again. By that time, I was ready to skip the final cut-scene anyway, but journalistic duties required that I re-load my previous save and watch it anyway.    Finally, I know what happened with the stuff about the demons. Closure is good.  Dark Messiah of Might and Magic Elements tells a formulaic story atop repetitive gameplay and is troubled by frequent technical problems. There's some truly fun melee combat and treasure hunting buried deep within the game, but the joy of killing the same enemies over and over, environmentally or not, quickly wears thin. If you're looking for a smooth, snappy, fantasy action game with true RPG elements, keep looking.", "date": "Feb 15, 2008"}