{"name": "Monster Truck Madness", "name_review": "Monster Truck Madness 64", "ref": "https://www.ign.com/articles/1999/07/31/monster-truck-madness-64", "text": "Rockstar Games makes no false claims about its latest Nintendo 64 title Monster Truck Madness 64. The idea behind the game, says the publisher, is very simple: Reach out and crush someone. That's what monster trucks are all about, after all. Edge of Reality-developed Monster Truck Madness for Nintendo 64 certainly delivers enough carnage in the form of good old fashioned crashes (and crushes), and adds a bit into the mix with a more arcade-oriented weapons system and multiplayer battle modes. Ultimately though, Monster Truck Madness -- especially as a racing game (which it can be considered at times) -- may be too much monster truck for its own good.  The Facts   More than 20 of the biggest, baddest and most famous monster trucks ever. Two racing modes: circuit and exhibition. Five multiplayer battle games to choose from including everything from soccer to tag. Realistic physics models. 10 hardcore tracks. Play-by-play commentary by Army Armstrong, the voice of monster truck racing. Eight bizarre weapon-esque power-ups including homing missiles and invisibility. Different times of day offer different visibility. Different weather conditions. 3D cockpit view. Rumble Pak support.   Gameplay The premise behind Monster Truck Madness is pretty straightforward. In Exhibition and Circuit modes, players ~race~ their truck of choice through a series of checkpoints, all the while trying to take out opponents any way they can. Developer Edge of Reality (Rob Cohen, who created the original Turok engine), has included a number of weapons and pick-ups that, when used, do their best to dilute the racing experience with loads of truck-destroying carnage. Weapons and pick-ups available include homing missiles, shrink bombs, hover mode, oil slick, invisibility, nitros, super jumps and shields. Not too shabby. A well-placed missile to the tailgate of an opposing truck will send it soaring into the air, and is almost guaranteed to put a smile on any gamer's face. Another pick-up, hover mode, turns a monster truck into a hovering ship of sorts, which can then coast past opponents easily.  Truck control is sluggish and difficult to come to grips with at times, but still worth the frustration for a chance to smash into another vehicle or drive off of a mountain side. It's very easy to misjudge a corner and send a truck sliding off into the wrong direction. And while we appreciate the ability to catch big air, the game often feels too floaty, which, in turn, makes trucks that much harder to properly maneuver. The physics are realistic and a lot of fun to play around with. Smashing into opposing trucks is extremely satisfying, as the speed and the force of impact directly affect what happens to the truck on the opposite end. Bumping into another truck, for example, isn't likely to do much to it, but smashing into it full force will probably send it flying. There does seem to a glitch to this process, however, as sometimes even the most insignificant of collisions result in overblown crashes that send trucks soaring in every direction.  In addition to the standard racing circuits, Edge of Reality has also included a handful of battle modes, including soccer, hockey, summit rumble, police chase and tag. Soccer and Hockey battles work identically to the soccer mode found in Nintendo 64's Buck Bumble. Two trucks rest at opposite sides of a field (or ice). A soccer ball (or puck) drops in the middle. The idea is to use the truck to knock the ball (or puck) into the opposing player's goal. Both games are a lot of fun, but are only available in multiplayer mode. Easily the best battle experience in the game is Summit Rumble, a king of the mountain, no-holds-barred challenge for the top spot. In the center of an arena sits a platform, which is surrounded by four dirt hills that lead to it. The idea is to jump on top of the platform and stay there. Meanwhile, computer controlled Bots (or friends in multiplayer) will try and knock players off in order to take the platform for themselves. The longer a player stays on the platform, the more points they get. The Summit Rumble mode alone is easily worth the price of renting the game to see if it's your cup of tea.  Though we are very happy with many facets of Monster Truck Madness, there are few glaring oversights that must be pointed out. During particular points of gameplay, one gets the impressions that Edge of Reality wasn't quite finished with the game, but had to release it anyway in order to meet a deadline. Specific examples of this include the fact that players can drive through a number of solid objects that they shouldn't be able, a two-player mode that is practically unplayable in the snow (as it's far too confusing), and, as we mentioned above, sometimes questionable physics that send cars flying everywhere regardless of the force of impact.   Monster Trucks include:  Bear Foot Bigfoot Boogey Van Carolina Crusher Grave Digger Executioner Firestone Monster Patrol Nitemare Overkill Rampage Samson Snake Bite Black Stallion Wildfoot Police Truck The Hitman Hollywood Hogan The Outsiders Stinger   Levels include:  Grave Yard Ruins Junk Yard The Heights Voodoo Island Greenhill Pass Wastelands Aztec Valley Alpine Challenge Death Trap   Graphics Monster truck Madness 64 features a look that is not quite second-generation, but certainly better than some of the first-generation products for the console. Truck models are well-textured (reflecting their proper theme, which may be important to WCW fans looking to play as their favorite WrestleTrucks), and highly detailed. Animation is equally impressive, as tires move up and down with realistic fluidity. Environments, however, are a different story entirely. Most backdrops are poorly textured and are weighed down by the traditional blur that invaded so many first-generation N64 products. Also, environments are relatively barren, offering no change in structural variety or depth. Additionally, the game has a very foggy look about it. And finally, for a game that is centered around monster trucks, players will find themselves very hard-pressed to find any mud. Trucks do not get muddy and, believe it or not, they don't even kick up any mud. Partially because of this, players are reminded that they are driving over a 3D model and texture-map as opposed to a muddy hillside.  Also, Monster Truck Madness easily wins the award for worst menu interface ever. A shaded square box is the extent of art design for menus, which -- once again -- leaves us with the impression that we are playing an unfinished version of the game.  Sound ~Are you ready for some down and dirty racing?~ asks announcer Army Armstrong of Monster Truck fame as the game begins -- the perfect indication of events to come. A moment later the standard crop of guitar riffs and drumbeats kick in. The play-by-play continues throughout the game, mostly jumping in for a comment when players screw-up or when somebody catches some big air. The background music is neither good or bad, and the sound effects -- featuring a mix of thumps, crashes, booms and clunks -- works adequately enough to convey the atmosphere.  Monster Truck Madness is a solid game that's a lot of fun if you know which modes to play and which not to. The game hasn't been hyped as a racer -- and it isn't -- but it does feature racing elements, which, quite honestly, aren't so great due to the fact that players are trying to control huge, sluggish monster trucks. However, the battle modes and in particular Summit Rumble, more than make up for any shortcomings the game might have in other departments.Visually, Monster Truck Madness probably won't blow anybody away, but gamers won't be turned off by its look either. Think lots of detailed trucks with realistic animation routines mixed with poorly textured, sometimes barren backdrops that -- at the end of the day -- don't really matter.Bottom line, if you're looking for a fun multiplayer game and you like to crash into things or catch lots of air, you needn't look any further. Be prepared for a handful of decidedly insignificant flaws and a seemingly nonexistent race-mode though. Definitely worth a rental to see if it's your cup of tea.", "date": "Jul 31, 1999"}