{"name": "Rail Simulator", "name_review": "Rail Simulator Review", "ref": "https://www.ign.com/articles/2008/02/25/rail-simulator-review", "text": "Rail Simulator is one of those games meant for a very small subset of the gaming population. Are they even gamers? They may be. One thing is for sure, though, they must love trains. This is a hardcore sim, not even the slightest hint of an arcade-y Densha de Go feel. No cute HUD, no music, no cheerful VO. Just you and the tracks laid out in front of you.   Despite the three settings of driving complexity to make it seem like they are trying to ease you into the workings of the sim, there is no handholding. Not even an in-game tutorial. Members of the community have been making video walk-throughs, while lamenting the lack of a thick, fully printed manual. What you get in the box is a flimsy booklet that barely scratches the surface, and a couple of reference cards for keyboard controls and signals. To be fair, there are a couple pdf files on the disk, but remember the spiral bound textbook that came with Sim Earth back in the day? That is the kind of documentation that would be really helpful for software like this, and it's the kind of thing that enthusiasts enjoy poring over.    Back to the game, though. Immediately after install you'll have four routes available: Barstow to San Bernardino, Hagen to Siegen, Oxford to Paddington, and Bath to Templecombe, each with a historical blurb for your edification. Besides driving across California, Germany, and the UK, you'll experience different eras, and a handful of missions for each route from rush hour commuter traffic, to delivery     While there are several different trains, they each fall into one of the three engine categories: diesel, electric, or steam. Where the diesel and electric engines are most concerned with just throttle and braking, steam is the realm of the true expert, who can keep track of steam usage, the rate at which the coal is shoveled, and more. There are six different ways to experience a game ending error in a steam engine--for example, fatal blowback caused by an open firebox in a tunnel -- as opposed to the two (derailment and collision) of the diesel and electric.    Interestingly, you can choose to play the game as a disembodied first person in the cab, pulling levers, turning cranks, and pushing buttons with the mouse. In some cases, you could get more delicate throttle control, by pulling it manually, but other times, it would flip flop a bit and mess you up. I ended up going mostly with the keyboard, since no matter what train you're driving all the controls stay in the same place there.   The hardest part of a scenario is getting out of the yard. I eventually stumbled across a tutorial explaining how to go into the overhead map (by pressing 9) and using shift + left click to set junction switches and forge a path. Once you're out on the tracks, it's mostly just scenery, screwing with camera angles, making sure you're not speeding. Being a sim, this part of the game can last for a while, depending on the trains speed. Then it's time to park it and see how well you did.    Quite a detailed performance analysis is provided at the end of a mission, with a percentage (to three decimals!) of the time you spent driving excellently, a list of each error (Improper horn use!), and in the case of speeding, at least, a complete break down of where, when, for how long, and how severely you were breaking the limit.     Some might say that the included scenarios are just to get your feet wet, because when those get old, the real meat of the package stares you down: world editor mode, big time. This is where you can create your own routes, depots, cities -- everything. There are even extra tools for download from the official site, as well as more assets. Beware the complete lack of any user friendliness, though. Despite the hellish learning cliff, the forums are full of people sharing screens and videos of their work.    Graphically, the trains look nice and cabs feel authentic. There is stuff to see out the window. Unfortunately it's all pretty jaggy. Best part is no-clip as a rule, when foliage reaches over the tracks and instead of hitting the windshield, hits you full in the first-person face with all of its big pixel-textured glory. I also noticed a passenger stuck in a wall -- there can't be much to do besides standing on that platform, so I'm not sure what he was doing there. Sound in the game consists entirely of ambiance, which can be dull until you realize the alternative is probably some awful repetitive tune you wouldn't want to hear anyways.Rail Simulator is a piece of software that seems to accomplish what it set out to do. It doesn't do it with much panache, graphical or otherwise, but it gets it done. You drive trains, and build worlds to drive them in. It's too bad they couldn't have included more detailed information on how exactly that is accomplished, but the player community seems pretty good about helping out anyone who wants to learn. Rail Simulator will probably please hardcore rail fans, but it'll bore the socks right off anyone else.", "date": "Feb 25, 2008"}