{"name": "NCAA Football 2000", "name_review": "NCAA Football 2000", "ref": "https://www.ign.com/articles/1999/08/04/ncaa-football-2000", "text": "College sports, football especially, will always be over-shadowed by pro-league football. It's too bad, college games can be just as, if not more exciting, than an NFL game, and NCAA Football 2000 is just that -- exciting.   Gamers can start off the action by choosing one of any 140 division 1-A and 1-AA college teams, or 80 classic match-up teams. If you don't want to do that, Tiburon has added a new ~Create-A-School~ feature where gamers can create their own school and can customize everything, right down to your school's helmet color.  Gameplay For a college game, NCAA Football 2000 has some deep gameplay. For starters, NCAA Football 2000 has a playbook that features more than 1,100 plays to utilize on your opponent, but the action doesn't stop there. The passing interface is fast, fun and intuitive. Press X, and blam, you're ready to make something happen. That has always been EA's strength, making games that you can just pick up and play. Don't get me wrong, though, this game has a ton of play options including fake snaps, man in motion option and a Coach's Cam that allows players to see their player's movement before the snap. Seriously, it plays just as fast and is just as complex as EA's Madden series, only it stars college teams, as opposed to NFL teams.  Now if there was one feature that makes NCAA Football 2000 a worthy purchase is its improved Dynasty Mode. This year, it gets the player even more involved. The Dynasty Mode allows you to lead your favorite (or customized) college team to the National Championship. On the way, you can cut, recruit and trade players, track your team's post season training, and build your coaching career. It's cool. If you do well each season, your school will give you contract extensions, others schools will even give job offers. But if you suck, you get cut -- just like a red shirt. This option alone ups the reply value on the game, hands down.  Graphics The graphics in NCAA 2000 aren't that bad either. On-field players move exceptionally fast and are well animated. In fact, Tiburon has added 100 new motion capture animations (wrap tackles, alternate catch animations, touchdown victory dances, etc.) to make the game look and feel even more real.  Tiburon has also added a few subtle surprises as well. If you look close, during an afternoon game, the sun will begin to set and the player's shadows will actually move in real-time. Sound I'm a huge sound nut and NCAA 2000's sound effects are on point. The crowd cheers raise and lower when something great, or something horrid happens, announcers call the plays from the box, Alma Maters just playin' everywhere -- it's like you're at a real college game. Overall The NCAA Football franchise has always been a safe purchase for those who want a great college football experience for their PlayStation. This title has a load of features, nice graphics and it plays well, too.   At any rate, if you're a huge college buff, or you just love football games, NCAA Football 2000 will make a fine addition to your sports library.  -- Jay Boor", "date": "Aug 4, 1999"}