{"name": "Need for Speed Pro Street", "name_review": "Need for Speed ProStreet Review", "ref": "https://www.ign.com/articles/2008/02/23/need-for-speed-prostreet-review", "text": "EA's Need for Speed ProStreet, the latest title in its yearly racing franchise, hit most every platform in existence last year, sans the PlayStation Portable. The PSP game took a little longer to get off the starting line, but it's finally on the track with a fresh set of tires.   Like the PSP incarnations of the games before it, Need for Speed ProStreet on the portable has its roots tied into the console game, but its execution is necessarily different. Given that the console games were heavy on customization features that couldn't be transferred directly over to the system, like the AutoSculpt stuff, the focus of the other titles was lost a bit here. While the other versions were all about tuning your car and customizing it to no end, the PSP version of ProStreet feels generic in a number of ways, with a series of questionable design decisions.   Instead of being set in an open world, ProStreet returned to single-track racing. The PSP title doesn't have some of the better events that the other versions did, which makes much of its selections feel a little bland. As well, the track design is only passable. There's not a whole lot here that'll leave a lasting impression.   It's a long, boring road ahead. The customization options that are here are suspect. You can change the color of your car, the tint of your window and apply a number or windshield sticker, but you're unable to apply individual decals. The performance customization allows you to add on levels of enhancements, like increasing your stock engine to a Level 2 or Level 3 engine. This is rather standard stuff and works fine, but its implementation is messy.   As I said in our last hands-on of the game, the percentage gain that I received after boosting any of my car's performance was quite miniscule, even after raising its stats to many multiples of the base number. This is disheartening when you get to the second tier of races, lose with your stock car, and then take your beefed-up ride to a race and wind up losing out again and again because you're still not fast enough.   Since upgrading your car doesn't help much, buying a new one is the next likely answer, but that isn't so easy. Most of the game's cars are locked at the beginning, and are only made available after completing certain events. You don't know which events do what, and given how restrictive it is at the start, you're left with very few options.   The car models are OK, but the tracks are bland. One thing that's unique to the game is Driver Intuition. The system is essentially a leveling system, where experience that you gain from winning races goes into upping your Driver Intuition level. Each level upgrade gives you a new boost, like +10 to acceleration. When you're in a race, you can then press Circle to get a driver's line on the screen which will boost your performance according to your Driver Intuition rating while you're in it. You have a constantly-decreasing meter, so like nitrous, you have to manage its use.   This is a decent idea, though car-centric stats really should be left on the cars themselves rather than the driver. Maybe I'm just a purist, but it seems better this way. Also, when you use the driving line, it basically restricts where you have to race to get the bonuses, so you're left to play Simon Says when it's on to make full use of it.   There are some visual question marks as well. Practically the whole game is glazed over in a giant blur that's supposed to give you an increased sense of speed, but it looks kind of stupid. First off, if a car is traveling next to you at roughly the same speed, it shouldn't be blurring. It is here, and looks very strange. Also, in the faster rides, like the supercars, the blur is fairly excessive and can make upcoming turns hard to see.   Fortunately, the game drives reasonably well. Not great by any means, but it's predictable. I guess that's something.Need for Speed ProStreet does very little right on the PSP. If you're in dire need of a racing game, it'll do the job, but there are many more racing titles on the system that are much, much better.", "date": "Feb 23, 2008"}