{"name": "Paws and Claws: Pet Resort", "name_review": "Paws & Claws: Pet Resort Review", "ref": "https://www.ign.com/articles/2008/02/26/paws-claws-pet-resort-review-2", "text": "You know, it's almost impressive. Here we are in 2008, the fifth calendar year that the Nintendo DS has been on the market, and even now the system is still getting new game releases that are nothing more than ports of Game Boy Advance projects. That sort of thing was expected right when the DS launched, or even in the year that followed after that  but here, as the dual-screened hardware approaches half a decade of being a part of this industry, it's absolutely unacceptable.    Paws & Claws: Pet Resort is a lackluster Game Boy Advance game running on DS. It's also the latest installment in THQ's Paws & Claws series, which has previously included Paws & Claws: Pet Vet, and Paws & Claws: Dogs & Cats Best Friends. Those two titles struggled to do anything truly notable in their respective simulation and virtual pet genres, and only ended up offering average gameplay experiences  but even average would be better than what this latest release brings to the table.   Because Pet Resort is truly unremarkable. It's boring, for one, and it's confusing to get into. And, worst of all, it's derivative of its own predecessor  last year's Pet Vet used essentially the same concept, only this time all of the veterinarian simulation has been axed from the equation. The idea is that you're the owner/operator of a pet resort, a place where pet owners can come and drop off their dogs, cats and bunny rabbits to stay for a while and be cared for and pampered. And the goal is to make your resort as luxurious and profitable as possible, by collecting payment from happy customers and reinvesting the profit into upgrades for your facilities. That's all fine. But it's not any fun.   For a pet game, it certainly takes a while to find them.  Because it's far too slowly paced. You have little to do around your resort  which is made up of a house in the countryside and a few surrounding buildings  and you often end up just standing around and waiting for time to pass, or for more customers to arrive. You can clean the stables, pens and aquariums, but that only takes a few seconds and isn't interactive at all (you just select the ~clean~ option from a menu), or you can interact with individual animals staying on the property. But that's engaging for an even shorter amount of time, as it breaks down into yet more option-picking from other menus.    There aren't any worthwhile uses of the DS touch screen, of course, because this is a GBA project. The closest thing you get to using the stylus is brushing an animal fur with a rubbing motion, but that's an element that's clearly just tacked on  there isn't even a sound effect attached to the action. The dual screen setup is also largely ignored, as all of the ~action~ takes place on the bottom display while the top one is constantly locked on a gratuitous and unnecessary map screen.   Even getting yourself to the point of being bored with Pet Resort is a chore, as well, as the first minutes with the game are excessively confusing. A list of tasks for your character to accomplish is presented in the beginning, but then you're on your own with no further instruction  and the manual packaged in with the game case is no help either. What happens is that you begin the game with no facilities constructed to house any animals at all, so no customers will arrive at your resort. You'll have to stumble around and search aimlessly for what to do, and it turns out that you have to discover the ~expansion~ menu hidden on a computer screen in your house and select to construct the extra buildings that will serve as the hotels for the dogs, cats and horses that come your way. And even then, construction won't occur right away  you'll have to wait for nightfall and then wake up again the next morning to discover that the buildings that should have been in place already at the game's outset have instead been magically built by unknown contractors overnight.   It's not even worth mentioning any of Pet Resort's other qualities or features, because none of them are worth an investment of any time and several are recycled from other THQ-published pet games in the past. How many times have I seen this same horse-riding mini-game before? I've lost count. Paws & Claws: Pet Resort is an undeniably bad product and not worth your consideration at all. It's like someone at THQ took last year's Paws & Claws: Pet Vet, downgraded it for the Game Boy Advance, cut out the fairly capable veterinarian simulation aspects of its design and then re-ported the whole hacked-up thing back to the DS. Fans of virtual pet or simulation experiences would be well advised to spend their gaming dollars anywhere else but here, because after four, going-on-five years of the DS being Nintendo's flagship handheld, it's simply unacceptable to continue to see pitiful port projects like this.", "date": "Feb 26, 2008"}