{"name": "Triggerheart Exelica", "name_review": "Triggerheart Exelica Review", "ref": "https://www.ign.com/articles/2008/02/26/triggerheart-exelica-review", "text": "Even after the Dreamcast was officially abandoned by SEGA, games continued to be released for the platform in Japan straight into 2007. The last out of the gates were entries into the classic shoot-em-up genre and were notable for little else than their late release on a dead console. One of these titles, Triggerheart Exelica, has found new life on the Xbox Live Arcade but without any substantial improvements feels destined for the same indifferent reception.   In classic top-down shoot-em-up fashion, the game takes arcade quarter-munching mechanics to the extreme. The 800 Microsoft Point game is only five stages long and can be completed in about 20 minutes if you make use of the infinite continues the game affords you. Doing so without continuing, which is the ultimate goal, is another beast entirely. That involves navigating through the sea of oncoming enemy fire with often only a few pixels of wiggle room. For shoot-em-up perfectionists, this is Zen. For people looking to get some easy achievement points, this is hell.     There are two anime flying, humanoid weapons called Triggerhearts to choose from at the outset of the game, Exelica and Cruelheart. The primary difference between the two is that one has a spread weapon while the other shoots directly ahead. The hook to the game is, in fact, a hook. Shooting the primary weapon or using a bomb quickly takes a backseat to firing out the hook, roping in flying enemies and then flinging them back at the targets as a powerful weapon. Tanks and other ground based enemies can't be hooked, but they can be latched onto to help focus your primary fire and bigger aerial targets take longer to hook, but work better as rotating shields before letting them fly. And so the small bit of strategy Triggerheart boasts is born. Making use of it is crucial to success. One of the five stages looks nearly impossible to beat without proper use of the hook.   Further encouraging players to work towards perfection is a dynamic boss system. Each stage is capped with a traditional boss fight, but how many of its forms you face is determined by how many score icons you've picked up. Each time you continue your score resets to zero so surviving the entire way through a level is the only way to see everything. Of course, if you stink then you probably don't want to fight every form of a boss anyway.   Triggerheart handles surprisingly well with the Xbox 360 controller and toying around with the hook mechanic provides a bit of entertainment, but this is by no means a top tier shooter. It's a hardcore game made for a specific audience and that target demographic has surely seen better without even having to venture off of the Live Arcade.   Not a lot of room to maneuver. Very little was done to spice up Triggerheart en route to the XBLA. There are no multiplayer options of any sort. There are no offline leaderboards and the online ones seem a bit buggy. The story is and always has been lacking in both substance and style. The graphics look like the Dreamcast era visuals they've always been, the style won't win any awards, and the sound matches the look. That's not necessarily a good thing.    The high point in the presentation is the customizable controls and ~tate~ mode. The vertical design of top-down shooters wastes a lot of television space, but you can solve that problem here by rotating the screen 90 degrees. This allows you to either spin your television with it if you have a swivel mount or adjust the controls and play as a side-scroller. The heads-up display stays where it is, so if you rotate the controls to play horizontally, the text and numbers sit awkwardly on their side.Triggerheart doesn't have a whole lot going for it. Like most arcade shooters, the experience is brief. The challenge is there for those who would like to memorize attack patterns and master the five levels, but there isn't anything that feels exciting. If you're a big shoot-em-up fan, this will tide you over until Ikaruga comes out on the XBLA (fancy this one made it out of the gate first, isn't it?) but everyone else should just wait.", "date": "Feb 26, 2008"}