{"name": "Kirby 64", "name_review": "Kirby 64: The Crystal Shards Review", "ref": "https://www.ign.com/articles/2008/02/25/kirby-64-the-crystal-shards-review", "text": "It's hard to believe it's been almost eight years since Kirby last appeared in a console platformer. He's had plenty of handheld adventures during that time, sure, but his side-scrolling, hop-and-bop gameplay completely skipped the GameCube generation and also hasn't yet appeared on Wii. That means that this game, Kirby 64: The Crystal Shards, first released on the Nintendo 64 in the summer of 2000, is still the little pink puffball's most recent home system appearance. It's a bit of an odd realization.   And that's perfectly appropriate, as Kirby 64 is a bit odd itself in the way it realized the rotund hero's signature gameplay. Kirby's standard mechanic has always been his vacuum-suction ~inhale~ attack, which sucks enemies into Kirby's gaping maw and then lets him spit them back out as projectiles. That approach is unchanged in this adventure. The alternative to spitting out an inhaled foe, though, is to completely swallow them and thereby copy their special powers  and it's this part of the formula that's been altered in Kirby 64. Kirby can copy one ability at a time as normal, gaining the properties of Ice, Burn, Stone and more from the appropriate enemies. But in Kirby 64 he can also mix and match different powers together, creating combinations of two different abilities that result in more powerful and impressive attacks.   Kirby launches out a single round explosive if he's copied the Bomb ability, for example. But if he then combines that Bomb power with another Bomb power, the attack transforms into a much more useful Missile assault that sends out a wave of heat-seeking rockets with every press of the B Button. Alternatively, Kirby could fuse together one Bomb and one Stone ability, and that combination creates Dynamite  an even more explosive attack that can do damage in a very wide radius.   Kirby's colorful world is just as vibrant as you remember.  It's not just Bombs that get combined together, of course. Each of Kirby's seven basic abilities  Bomb, Burn, Ice, Stone, Spark, Cutter and Needle  can be combined together with any of the other seven and some combination will be created every time. Some of them are impressive and useful, like the powerful drill you'll earn by joining Stone and Needle, or the Refrigerator that spawns health-replenishing food items, created by combing Ice and Spark. Others are not as versatile, like the nonsensical melting ice cube that results from trying to mix together Burn and Ice abilities.   What's odd about this power-combining approach is that Kirby 64 is the only game in the series to use it, and it seems just a little too simplistic when compared with the franchise installments that preceded this one, like Kirby Super Star. There are lots of different combos to acquire, so variety isn't a problem. The problem is versatility  each ability is a one-trick pony and very straightforward, whereas individual powers often granted Kirby multiple different attacks in Super Star. The direction that Kirby's franchise took in every other edition, and into the Super Smash Bros. series, is totally different from the direction that Kirby 64 took. And that's because this one's for kids.   All Kirby games are for kids, of course, but Kirby 64 feels like it was designed to be as accessible to younger players as possible  from the simplified special powers to the overall pace of play. Kirby walks and attacks more slowly and enemies aren't nearly as aggressive in Kirby 64. Many mid-stage mini-bosses simply stand in one spot and block your path, for example, waiting patiently for you to attack and defeat them at your leisure. It's incredibly easy.   And incredibly easy to run through and complete to 100%, a feat achieved when Kirby tracks down all of the game's hidden Crystal Shards (there are three apiece in each standard level). Once you're at the end of the game you may have to backtrack and replay a handful of stages to grab the Shards you missed on your first runthrough, but that task won't take very long  Kirby 64 ends up being about as long as one or two afternoon's worth of game time, which led many Nintendo fans to simply rent this one rather than put down the full 60 bucks for a purchase eight years ago.So what's the final verdict on Kirby 64's encore appearance on the Virtual Console? Good, but not great. The game is still a solid and enjoyable platforming experience for fans of the pink puffball and worth a look with its asking price of 1000 Wii Points  it's just not as versatile or as representative of the Kirby franchise as a whole as other games are, like Kirby's Adventure or Kirby Super Star. Kirby 64 on the VC is a 10 dollar investment that will earn you a couple of afternoons of simple, casual and unchallenging gameplay and then will likely not get revisited too often in your Wii's Channel Array. But if you have younger gamers in your household who need an easy and accessible platformer to get into, definitely give it a look  they'll have a blast hunting down all the missing Crystal Shards.", "date": "Feb 25, 2008"}