{"name": "Skydive!", "name_review": "Skydive!", "ref": "https://www.ign.com/articles/1999/08/04/skydive", "text": "I sat around looking for an intro for this piece for sometime before I realized that it just wasn't necessary. Instead of trying to tie in this piece with video gaming as a whole (~there have been several attempts over the years to try and reproduce the thrill of skydiving on the PC...etc.~) or tie it in to current events (~for all of you who have been hanging on the edge of your seats waiting for the King of the Hill season premiere...etc.~), I am going to do my best, right for the start to separate this title (I really hate calling it a game) from PC gaming as whole. Simply put, Electronic Arts' latest release Skydive! Is one of the worst excuses for an interactive entertainment product that I've seen in years.  The first hint as to what might be going on inside the colorful package of Skydive can be found on the back of the box where the game's designers, Gonzo Games, proudly proclaim that this product has been designed entirely with Macromedia, a design package typically used to produce presentation packages and Shockwave style games. Once you've gotten the game in your machine (assuming that you were unlucky enough to waste money on this horrible title) that hint of badness is proven as Skydive unfolds a series of poorly digitized video clips along with a barrage of canned rock music to get you prepped for the excitement that lies ahead. Sadly, this is probably the most fun you'll have with the game.  Once you're ready to play, you'll be given three different options. You can go for an Accuracy dive in which you must try and hit a target on the ground below, a Sky Slalom, where you have to go through rings in the air to collect points, and a Free Fly where you'll be given the freedom to just goof around at leisure. As the game begins you're shown the back of your character standing on an airplane in a static screen that invites you to click any button to start the jump. Once in the air, you watch your character plummet and control him (not very well I might add) by moving the mouse pointer around the screen. By clicking the left button you can bring your arms in tight to go faster and by hitting the right mouse button you can spread out your arms to slow yourself down. The entire effect is absolutely mind numbing, boasting all the interactivity and excitement of a day of sorting mail at the post office. While I'd love to tell you that there's some depth to the game once you get the hang of the controls, this just isn't true. I had thoroughly exhausted all of the options and challenge of this game five minutes after I had it installed in my computer.  I'd love to stop my review right here (I really didn't get into this business to play titles like this one) but I feel it's my duty to go on to describe the graphics. Where most really bad multimedia titles like this one feature terrible gameplay combined with really beautiful video clips, Skydive doesn't even go this far. The visual quality of the different areas you dive in are simply abysmal, featuring circa 1984 huge pixel action when you get close to the ground. The movies included in the game are even more baffling as they seem to have been digitized by a kid in his first A/V class.  The one area that I thought might deserve a higher score was the sound. Although the game's default soundtrack is unbearable, Skydive does offer you the option to change the tunes you listen to while you dive. Unfortunately my optimism was quickly dispersed when I realize that every option you are given sucks just as bad as the first. The only exception is the inclusion of Ride of the Valkyries, a fact that must have Wagner turning in his grave.  There's a ton of other stuff that's wrong with this game, like the fact that there's no clipping on any of the objects in the landscape (buildings, etc.) insuring that even the most poorly skilled parachuter will make it to the ground as long he remembers to open his chute at some point, but none of it is really the point. The bottom line is that Skydive! is absolutely no fun at all to play. Not only do we recommend that you not purchase this dog of a title, but if you see it on the shelf of your local gaming store, you should complain to the management for even trying to make you shell out your hard won dollars for a title that looks like it was designed in a weekend.  -- Trent C. Ward", "date": "Aug 4, 1999"}