{"name": "Ground Control", "name_review": "Ground Control", "ref": "https://www.ign.com/articles/2000/06/13/ground-control", "text": "The transition to 3D in the real time strategy genre was a forgone conclusion once the technology was available. Now there are a bunch of 3D RTS games on the cusp of release vying for that piece of the pie that can only go to a couple of them. The game that wins this top spot will need to have quite a few things going for it besides impressive graphics. Most of the RTS games in the near future have their own style of stunningly beautiful visuals but what's really going to set the men apart from the boys is the ease of control. Good interface and camera controls are a necessity in a 3D environment. Massive Entertainment and Sierra's Ground Control has been released into the crowd shouting and beating its chest that it is indeed a man among boys.  And for the most part, I really can't argue with it. There are a whole lot of good things going for this game. I mean a whole lot. But there are also a couple of problems that are hard to forgive in such a great piece of work. But we'll get into that in just a minute. First off I really just have to spout out about some of the good points that really make this game one that should find itself on the best sellers list.  The story goes something like this ... the Crayven Corporation, a money grubbing bunch out to get a fast buck has found out that the Order of the New Dawn, a bunch of pious fellows with a penchant for righteous violence, have staked a claim to a planet with little value. Once the Crays investigate a little bit, they find that the Order is hiding something big, and being the greedy folks that the Crays are, they decide to take whatever it is for themselves. That's where the game begins. It is definitely not where the story ends though. Sierra was pretty careful not to reveal the big secret behind it all, so I won't either, but it's not something that I expected from a science fiction type RTS game.  You start the off as the Crayven Corporation on simple missions to determine what it is the Order is hiding. Once you've fought through these missions, you assume the leadership of the Order and fight from their side. Both sides have pretty similar units, which is sad, but they have just enough difference to make some strategic decisions a must when dealing with specialized units. Don't go into this thinking that it is a 3D Starcraft with its many very different unit types, because it isn't. Another thing you should  know is that there is no resource management in the game, so if your looking to be able to build units, look elsewhere. This game is in the style of Myth where you get a certain number of troops at the beginning of the mission, and that's all you're going to get. If this concerns you, try not to let it. When you start playing Ground Control, you get sucked into a game that is hard to escape from.  I know I stated above that almost all of the 3D RTS games coming out all have great visuals, but I gotta say that this game is damn pretty to look at. From the landscape, which varies from dusty desert crags to lush rolling hills, to the particle effects that show great explosions and dust trails, this game has got it all. The vehicle models are superb and you really can get a good look at them with the zoomable camera. The scout Terradynes of the Crayven Corporation even have a little driver sitting in the seat for added detail.   The weapons effects in this game almost deserve their own paragraph. And looky here, they got it. Half of the time when I was playing the game, I would just zoom in to ground level behind some of my forces and watch the tanks turrets recoil as sparks, dust clouds, and fire charged explosions erupted all around. Watching artillery fire arc over the sky down onto an enemy emplacement is graceful in a strange sort of way that just asks you to sit and watch the barrage for a while.  Speaking of graceful things, let's talk a little about the camera. Massive really did a great job making the camera so easy to operate, and yet didn't skimp on where you could go with it. It is a truly free-floating camera that begs to be taken for a sightseeing trip around the levels. The zoom magnification extremes are just right for being able to view the battle from afar when you need to make strategic decisions and to get an up close and personal look at the action. All of this is done with the page up/page down buttons, or your mouse wheel if you have one. In fact, you may want to finally go out and buy a mouse with a wheel just for this game if you don't have one, it really is nice to have.  And when you play this game, remember to thank Massive for making such an easy view control. You'll really need it when the action starts heating up. And heat up it does, especially in the multiplayer game (more on that in a sec). After you are briefed for your mission, you are given a chance to modify your troops to your needs for the mission. Unit troops are split up into four different categories including infantry, assault, ground support, and air support. There are at least a couple of choices in each of the categories, which allows you to modify your force to the job. For example you may choose between a fighter Aerodyne squadron and a bomber Aerodyne squadron. You also get the choice to send groups down as balanced, offensive, defensive, or recon. You can guess what each of those does, and you might be surprised what kind of a difference making those little adjustments actually make in the game.   The game really begins to shine when you hit the ground. The unit control is some of the easiest gameplay I've experienced in quite a while. It's as easy as selecting the units you want to move (which is also incredibly easy), right clicking where you want them to go and then dragging the mouse in the direction you want them to face when they arrive at your destination. It's a really simple idea, and sometimes, simple ideas are simply the best. You can control their behavior with buttons on the side of the screen to tell them to fire at everything, return fire, or hold fire altogether which is really necessary when scouting or using artillery.  The ease of control really makes a difference in a game where flanking maneuvers and on the fly tactical decisions are very necessary. Tanks are more vulnerable from behind (stop giggling) and if you can slip some marines in behind a heavy Terradyne, they can really do some damage. The use of line of sight in the game is also a big plus. You can actually see how the units see by using the camera to zoom in and the follow a unit. It opens up the possibilities for ambushes and such and units up on hills do get an attack and defense bonus. There's so much more I could say here, but I think it's best to let you all explore the numerous possibilities yourself.  Unfortunately with all of the positive features that make their way into the game, there is one blaring and huge mistake that is close to unforgivable. There is no mid-mission save ability. That really sucks. I really like this game, but I want to throttle whoever thought that this would be a good idea. I've even looked at it from their point of view considering that they may have thought that it would make you plan your movements more carefully and take some time to think things through. That's great and all, but when you spend a bunch of time in a level where you creep along, making sure that you do everything right only to lose it all because of one mistake, it reallllllly tends to make you mad. And what's more, what if you need to get out of the game or off of the computer and you're in the middle of a mission? Arrrrgghhh! C'mon, man. Always include a mid-game save.   Enough ranting, I said it was almost unforgivable. Why almost? Because there are even more good things about the game that I haven't even gotten to yet. The sound for instance, is good. Not the best I've ever heard, but definitely worth taking a listen to. The music isn't bad, and the voice over work is very decent but I really loved the sound effects. The ground pounding thuds of artillery hitting the ground, the rattle of infantry guns, the little ricochets of bullets on heavy armor, ahhh it reminds me of home. The little effects are really what stood out in my mind though. One sound that in particular is that of the barracks. Each building has its own sound and when close enough to the barracks you can hear some music playing that really adds a lot of feel to the game. I could just imagine soldiers rockin' out to the music inside and it put a smile on my face.  Last but not least of the plusses of this game is the interface and overall presentation of the game. The manual gives you all of the info you'll need to know along with the history of the Crayven Corporation and the Order of the New Dawn and nice profiles of the units in the game. While it isn't flashy, it still gets the job done in an organized fashion. The pre-game interface is also slick and makes switching and modifying unit types easy and fun. The mission briefing is pretty simple. The dialogue provides all of the necessary information and the map shows multiple points of interest, but is mainly useless. Still it serves its purpose and gets you on your way.  Okay, so I lied, there's still one more thing to talk about and that is the multiplayer. I played this over the LAN with Tal for a while and it was pretty darn fun with just the two of us, offering a lot of bang for the buck. After we beat on each other for a while we decided to jump on WON.net for a little multiplayer action with some other gamers to test out the feel of all out war. It's very easy to get into the game providing that you can connect and download the patches fast. We played some FFA games and lets me tell you, we had us some fun. There is obviously a lot of gameplay to be had here and you don't have to worry about not being able to save. It supports up to eight players in a game and can erupt into crazy firefights between multiple hostile forces that are a little hard to get out of in one piece.  All in all, this game is definitely worth checking out, even with that darn no save feature. Yes, I know I keep talking about it. If you are a fan of RTS games, then you will definitely enjoy getting your claws into this one. Great gameplay, great graphics, and great sound make a great game. So get your butt up and go control yourself some ground.  -- Dan Adams", "date": "Jun 13, 2000"}