{"name": "Blocks Club with Bumpy Trot", "name_review": "Blokus Portable: Steambot Championship Review", "ref": "https://www.ign.com/articles/2008/02/27/blokus-portable-steambot-championship-review", "text": "When it comes to board games, Scrabble, Monopoly or Trivial Pursuit might come to mind, but a new game has come along to challenge these classics.  Blokus, a recently introduced game in 2000, has sold millions of copies around the world with its ~easy to learn, hard to master~ gameplay. Taking the strategic elements of puzzle piece placement and melding them with characters from a little known adventure title, Irem and Majesco are releasing Blokus Portable: Steambot Championship.  However, the largest problem that you face is that there just isn't much to the overall game, whether it's the board game elements or the Steambot character interaction.   There isn't a particular premise behind Blokus Portable; you play as a new guest that checks into the Lobster Inn, some random establishment established in the middle of nowhere.  The Inn is stocked to the rafters with Blokus players, all of whom come from the Steambot Chronicle universe, because apparently in their spare time, they all play Blokus.  As the newcomer to the inn, your objective is to learn the game, challenge the other players in the inn and eventually become the Blokus Champion.  The ~story,~ if you can call it that, is non-existent  you create a basic character with a simple appearance, outfit and hairstyle, and go into the Inn to try your hand at the boards.   Behold the full Blokus board. Blokus is played on a flat grid with multiple open squares. Each player places pieces in turn on the board depending on the format of the game you're playing; if it's a four-player match, you start at the corners and working their way across the playing field.  If it's a two-player game, you start at pre-determined areas. However, there's a catch  you can't place pieces directly next to each other  you can only connect them at their corners.  This adds a certain amount of challenge to the game, especially because the other players within the game have the same restrictions.  It also cuts down on the free space as games progress, which makes it much harder to place remaining items.   While players can rotate and flip their pieces to try to arrange them in any way they can, pieces that can't currently fit on the board will slightly lose color, indicating that they're temporarily out of play.  If you manage to find an open area to place them in, you can regain access to them and put them on the board.  The game ends when all players can no longer place pieces on the board, and the player with the fewest pieces still remaining wins.  Based on your progress, players will receive Dollarinos, which can be redeemed for new outfits or hairstyles inside the store at the Inn.  What's more, as you beat opponents on the board, you'll unlock trophies, illustrations and characters as well as business cards.   The largest problem with this system is that it's extremely shallow.  Playing against most opponents will earn you their illustrations and unlock their characters.  You'll acquire so many Dollarinos after a couple of matches that you can purchase everything, rendering the unlock system virtually useless. Beating them is also one of those things that becomes incredibly easy after a few matches as well.  You get a sense of just how many different ways that you can place your pieces, and since there isn't a lot of tactics that your opponents will use to block you or disrupt your progress, you can frequently escape without getting completely stuck on the board.  After a while, it's more about how quickly you can defeat the game and move onto the next match.   Yes I will. However, that isn't going to be so fast as it seems  the game will frequently take a while to ~think~ of its next move, dragging most games on for a lot longer than they should go.  This might make sense at the start of the game when the computer is trying to figure out which way they want to go, but as more and more pieces are placed, it should get much faster.  Instead, the game takes longer until characters start skipping their turn.  This happens regardless of which Blokus room you participate in, which is somewhat disappointing.  You'd hope that as you got into the higher classes of the game, you'd find faster and better Blokus players.  Not really the case.   This isn't a graphical powerhouse, particularly because the majority of the game takes place on the board with animated faces.  The exploration of the Inn is comprised of basic sprites and textures, so you're not really experiencing anything special there.  The audio is pretty basic and forgettable as well.  Technically, however, it does have some significant support via game sharing, so you can get many friends together with one UMD and play the game rather easily.  Multiplayer does work a bit faster than the single player game, but you'll still find yourself waiting on the AI controlled players.There's not a lot of depth or substance to Blokus Portable; the Steambot characters don't really have an impact or purpose to the title, the unlockables are shallow, and the gameplay doesn't really vary at all.  If you like the board game, you might like this game, but the lack of depth will quickly wear thin on you.", "date": "Feb 27, 2008"}