{"name": "SEGA Bass Fishing", "name_review": "SEGA Bass Fishing Review", "ref": "https://www.ign.com/articles/2008/02/27/sega-bass-fishing-review", "text": "Fishing fans have had it rough thus far on Wii.  We've seen a handful of budget titles, and each one seems to be poorer in quality than the last.  The light at the end of the tunnel came a few months back, however, when SEGA announced that its Bass Fisihng series would be coming to Wii, and that it would include extra content for gamers that loved the arcade/Dreamcast experience nearly a decade ago.  We've put our time into it, caught our fair share of lunkers, and are here to weigh in on the day's catch.   We'll state straight away that Bass Fishing isn't the end all, be all fishing experience on Wii.  If you remember the arcade classic at all (or take one look at a screenshot or video of the current Bass Fishing in action) it's obvious that SEGA has gone for the fast-paced, arcade feel, and as such take certain liberties along the way.  Fishing is fast-paced and fun  better than every other fishing title on Wii  but you'll find the same lack of soul in the overall design, and that includes everything from user interface to fish animations, and everything in between.  Bass Fishing is fun to play (even if it only works in small doses), but it's certainly not a showcase game.  This one looks nearly identical to its Dreamcast/arcade roots.  Since Bass Fishing is basically a remake with added content, SEGA stuck to its roots in a lot of key areas; some of which were good decisions, and others weren't.  The game displays at only 4:3 aspect ratio and 480i display, and character models, environments, water effects, and fish animations have remained untouched since the game released on DC back in 1998.  Even the HUD icons are identical.   What this also means though is that when you pop in SEGA Bass Fishing, you're getting the core experience that made this one a hit back in the 90's, and with the improved AI and added Nature Trip Mode (a more realistic take on fishing, with much higher time constraints) the nostalgia factor may sit pretty high with some players.  Regardless of your history with the game though, the simple fact remains that SEGA Bass Fishing is still fun, but it is seriously showing its age.    Unfortunately, the main control mechanism for SEGA's headline fishing title isn't as tight as it could be, so while the game is constantly giving out info on needed rod position and reel pace, it's never absolute as to whether you're successfully pulling off the motions.  Reeling feels good, and in general when you see the line tension go red a quick halt in motion will save you from a line break, but the combination of Wii-mote tilt and reeling feels less responsive than even Wii's own Fishing Master.  There's also a seemingly never-ending list of bugs and oddities that remain in the final version, such as loading for every choice in menus, odd animation glitches in the fish, and VO that cues at extremely odd times.  The entire package  while still very fun in its core gameplay  is very, very rough.   With that being said, the actual fishing can be really entertaining, as there are new species of bass with different AI, and some impressive depth in fishing strategy.  You'll need to use the right lure for the job, taking into account water temperature, depth of the fish, color of the bait, and weather conditions.  Since every catch adds only a few seconds onto the clock based on fish size, it's a race against the clock to select the right bait, and get your line back in the water as fast as possible.  It's unfortunate that no multiplayer has been included though, so while reeling in a huge bass is really rewarding, you've got no way to share it with friends via online leaderboards or competitive multiplayer.  No matter how you look at it, SEGA Bass Fishing simply comes up short.  For seasoned Bass Fishing vets that remember the arcade classic, this will feel like a decent trip down memory lane, but one that ends abruptly due to a lack of features and modes.  For newcomers, SEGA Bass Fishing will look inexplicably basic, since the graphics havent changed in the last ten years.  The overall fishing experience is better here than on any other Wii title out there, but weve seen aspects of other games do it better, including the reeling and rod motion in Fishing Master, and the realism that the otherwise unresponsive Rapala brought to the table.  Bass Fishing isnt the killer ap. of fishing games on Wii, but its best option thus far.  Still, after enjoying the series for the last decade in arcades and on SEGAs deceased console, we couldnt help but think of what a wasted opportunity the Wii version of Bass Fishing was.  Instead of going all-out with a huge list of new modes, a graphical overhaul, and on/offline multiplayer the company went for a quick buck, and took the easy way out.  SEGA Bass Fishing is a fun game, but it could have been so much more.", "date": "Feb 27, 2008"}