{"name": "Audiosurf", "name_review": "Audiosurf Review", "ref": "https://www.ign.com/articles/2008/02/28/audiosurf-review", "text": "Imagine barreling down the fretboard from Guitar Hero in a futuristic, F-Zero style hovercar, and you'll have a good idea of how Audiosurf works. This game released a few weeks ago on Steam, and message boards have been singing its praises ever since. And with good reason.   The game's best quality is its dramatic range. It can be an easy, relaxing experience or rocket-ride forward at eye-melting speeds. It's an excellent fusion of casual and hardcore gameplay styles, and has an unlimited amount of content to keep you coming back for more.   Audiosurf works by allowing you to import any song you wish into the game. You pick a difficulty level by selecting between several futuristic racing cars, all of which have varying special abilities. The game then generates a track based on the audio file you selected and drops in colored blocks that represent different point values. Your goal is to ride along the track and snag like-colored blocks, which are then stored in columns underneath your ship. If you match three or more, the blocks disappear and grant you a point bonus.    It takes a little getting used to, but since the goal of the game is to avoid some block types in the interest of maintaining combos, you're not really focused on trying to hit blocks to play the song, a concept some may be accustomed to from Guitar Hero or Rock Band. Instead, Audiosurf turns your song into a puzzle game, requiring twitch skills to hop between the game's three lines of blocks and snag the right colors and power-ups to create combos with the highest point yield.   And even though it looks like a racing game, it's not. You have no control over how fast your ship accelerates; that's all dependent on the song you choose. If it's a high tempo song, like drill and bass or something to that effect, expect a blisteringly quick and difficult ride. Sometimes vocals boost your speed, often times you'll speed and slow along with the drums, or sometimes a quick guitar riff will blast you forward. Even though the song will continue playing independently of what blocks are hit, their positioning often corresponds to bass echoes, guitar strums, and snare hits, so you do get, in a roundabout way, a sense that you're riding the song, as the game's tagline suggests. Then there's the track itself, which if you've loaded in the right kind of song, will undulate according to the rhythm.   The game didn't really click for me until I loaded up Jay-Z: Unplugged. With The Roots providing a solid, consistent beat, I got a much better sense of flow than with something like Faunts' M4 Pt. II (end theme from Mass Effect), a song filled with so much electronic distortion that it didn't serve as a particularly thrilling session of Audiosurfing.   Personally, I had a great time testing out Boards of Canada and Hot Chip, which translated to some standout experiences. Speaking of ~testing out,~ one of this game's more meta side effects is it'll actually get you to go out and buy new albums specifically to try out in the game. I mean, why sit there at your desk browsing web pages while listening when you could actually be playing the new songs? I'm sure music purists would scoff at the notion, but it's nevertheless one of the game's draws.    And what if you happen to use programs like Fruity Loops to create your own songs? Well congratulations, with Audiosurf you're a level designer. The amount of community that could spring up around this is really exciting. It'll be interesting to see what people are able to create within a few months' time.   Once you've finished riding a song, the game outdoes itself by providing global leader boards for every single track played. It's a great way to foster community as well as keep you playing through each track, at least for users who care about scores.Audiosurf is one of those games that offers something for everyone. You can cruise through a neon-future version of your favorite songs at a leisurely pace in freeride or low difficulty puzzle modes, or play as a hardcore gamer might, repeating tracks obsessively with the aim of conquering the leaderboards. A better fusion of casual and hardcore gameplay styles would be difficult to come by, particularly one with such boundless source material. The game is yours to manipulate as it readily acquiesces to your mood, making it worth playing on nearly any occasion, for any reason, for any person.", "date": "Feb 28, 2008"}