{"name": "Kidz Sports: Ice Hockey", "name_review": "Kidz Sports Ice Hockey Review", "ref": "https://www.ign.com/articles/2008/02/27/kidz-sports-ice-hockey-review", "text": "Data Design Interactive is at it again with another shovelware title in the form of Kidz Sports Ice Hockey, this time published by Destineer Software's sub-company Bold Games.  As with everything else we've seen from the developer thus far, Ice Hockey is a quick cash-in on the Wii's current success, and offers very little to gamers looking for a properly tested, entertaining, worthwhile purchase.   If you're familiar with the other Kidz Sports offerings, Ice Hockey follows the same template.  You've got three mini-games, a basic interface for the very small package, the same exact bullet points on the back of the box, and every other presentation corner-cutting technique that allows for quick development and rushed products.  In the case of Ice Hockey, players participate in a three-on-three game of puck that unfortunately lacks any intensity whatsoever.  Shots bounce softly at motion-less goalies, players skate slowly around the ice, annoying VO from the announcer dictates goals (and little else), and the game makes use of motion controls that don't always work.    Oh snap kid, this ain't three bar!  Passing is done with the nunchuk, while shooting is handled with the Wii remote.  In fact, very little in the game (aside from super shots) uses any buttons at all, and while it's an interesting concept on paper  it's a game for kids, so a lack of buttons may be user-friendly  it just doesn't work.  To call the game glitchy is an understatement, as even the shot motions work about half the time at best.   As for the visuals, Ice Hockey is no prize.  Players skate (or walk) around the ice with the puck magnetically attached to them, characters are stiff and lack any sort of fluidity while moving, effects animations are very low quality, and there's almost no content here that couldn't be quickly ported over to DS easily.  Leave this one on the shelf.  Data Design Interactive has a template set in place for its already 20+ shovelware titles on Wii, and while gamers scoff at the strategy, only a lack of sales is going to make it stop.  This  along with the other Kidz Sports titles and the endless racing games  are thrown together in no time at all, lack any sort of quality control, and look to pack shelves full rather than putting out a solid product and earning sales legitimately.  There isnt a single redeeming quality in this package.  Dont bother.", "date": "Feb 27, 2008"}