{"name": "Lost Planet: Extreme Condition", "name_review": "Lost Planet: Extreme Condition Review", "ref": "https://www.ign.com/articles/2008/02/27/lost-planet-extreme-condition-review", "text": "Colonizing planets has to be one of the hardest tasks for anyone in the future.  Take, for example, the world in Lost Planet: Extreme Condition.  Not only would a worker have to make their way out there, they'd have to deal with the incredibly harsh climates of the world.  But that's the least of the colonists' problems. Indigenous aliens are vigorously fighting their advances, setting up a fierce struggle for survival.  Initially released on the 360 last January and followed up on the PC, Lost Planet has come to chill on the PS3.  However, if you're expecting a solid port over with new features, you'll be extremely disappointed.   Just in case you don't know the premise of Lost Planet, the game is set on E.D.N. III, a distant planet that humans have attempted to colonize. Not particularly idyllic by any stretch of the imagination, E.D.N. III is covered in ice and incredibly cold snowstorms, making the establishment of cities and outposts difficult.  However, as humans expanded their territory, they discover that E.D.N. III is infested with a strange insect like race known as the Akrid that are incredibly aggressive.  Surprisingly, however, the Akrid naturally produce some strange viscous fluid known as thermal energy (or T-Eng), which can keep humans reasonably warm.  It also can be used to power giant mechanized suits known as Vital Suits, which humans use to defend themselves and further their fight against the Akrid.    Click here to watch the video feature.   Players are cast as Wayne, a young man who is suffering from amnesia thanks to a massive Akrid attack.  The last thing that he remembers was a gigantic worm-like Akrid known as Green Eye, who killed his father in front of him and knocked him into a coma.  Discovered by a small group of snow pirates, Wayne seeks revenge against the mysterious beasts.  However, he quickly discovers a larger problem on E.D.N. III than he ever knew; huge groups of Akrid are being seen and a mysterious group known as Nevec appear to have dangerous plans for the planet.  The plot of the game is convoluted and nonsensical, but it's primarily there to give you a context for blasting your way across the title's eleven stages in the single player campaign.   What makes Lost Planet mildly tactical in its approach is the fact that players can choose to move through these stages on foot or within a VS suit.  Each has its own advantages and disadvantages that you'll need to take into account.  Using a VS gives you access to jump jets, gigantic lasers and chainguns, as well as the ability to absorb a lot of punishment. Unfortunately, players can potentially die if their VS is heavily damaged and they can't escape it before it explodes.  By contrast, moving on foot allows you to use a grappling hook to reach high platforms or cross gaps, but leaves you vulnerable to getting blasted very easily.  Take enough damage and you'll quickly expire in the middle of battles. However, if you happen to have some extra thermal energy, you can heal damage, preventing death for at least a few seconds.   Wayne's ready to bring the pain. Unlike other games, where you can store up energy to be used at your discretion, you'll find that your thermal energy is constantly dropping from the environmental conditions, always forcing you to seek out new sources of T-Eng to power yourself and your suit.  Some of this can be done by targeting the glowing spots on Akrid, quickly weakening the beasts and leaving their thermal fluid on the ground for you to pick up.  Other sources can be found by destroying storage tanks, vehicles and explosive barrels, which can provide a boost for Wayne.  Part of the problem, however, comes in the fact that players will frequently find so many environmental objects containing large sources of T-Eng that you don't always have to engage in battle.  It will make some stages a bit more challenging, particularly on higher difficulty levels where energy loss is much faster, but you can literally pick and choose your fights.  In fact, you can run away from most, if not all of the Akrid if you want, collect energy from ~safer~ objects and run off to the boss fight in a stage.  While that isn't fully exploring the levels themselves, it doesn't extend the gameplay or add to the depth of the game.     This port of Lost Planet hasn't addressed any of these issues from the previous two versions.  For example, the control is still wonky -- Wayne still can't look straight up, and while you've got buttons to swing your perspective 90 degrees to the left or the right, you'll still wind up fighting the controls to make Wayne do exactly what you want or need him to do in the middle of huge battles.  Then again, the same can be argued for VS control, which is not particularly responsive or agile.  Being juggled by enemies is still an incredibly frustrating and irritating experience within the game, especially by turrets or enemy VS units that pound rocket after rocket at your position, killing your chances of getting up.  All of these should've been fixed by now, considering that this is the third release of the game on a console.   Two other significant issues exist that point out how weak of a port this game is.  The first is the inclusion of coins or targets that are scattered across the game landscape.  For the 360, these coins related to achievement points that you could get for your gamertag.  Unfortunately, instead of translating these achievements into PS3 accomplishments, collecting these coins does absolutely nothing within the game.  It doesn't unlock additional levels, it doesn't unlock additional VSes and it doesn't provide additional features for multiplayer.  That's pretty weak, especially considering that Devil May Cry 4, the other recent Capcom title, featured accomplishments on the PS3 that were identical to that of the 360.     The other issue is the insane amount of slowdown and frame rate drop.  By now, since the game has been released on two different systems, you'd expect slowdown issues to be kept to a minimum, if it occurs at all.  Not the case -- Lost Planet seems to crawl if you get more than five enemies on screen at once, and considering that the game frequently swarms you with Akrid monsters, this doesn't work well at all. The longest one that I noticed was close to 30 seconds in the middle of a battle, as I was facing off against Akrid and Nevec soldiers at the same time.  That's pretty bad.     That brings me to another problem however, which is that the game doesn't look good, especially if you've seen it on other systems.  Compared to the 360 version and the PC, everything on the PS3 version looks like its run through a gauzy, pixilated filter.  Instead of finely detailed textures, many of the game environments have blocky, rough textures and heavily aliased edges.  Instead of fine particles for smoke or snow, the particle system is harsh and weakly defined.  Character models look somewhat out of focus or blocky, especially when you are running through battlefields. It doesn't feel as though the game takes advantage of the PS3 at all.   I am the Exterminator. This is particularly true when it comes to the multiplayer maps, many of which have been carried over to the PS3 from the downloadable expansion packs from Xbox Live.  The ground textures look extremely basic, the water demonstrates little to no physics whatsoever with bland texture work as well, and the game arenas don't look good either.  What's more, online gameplay suffers from framerate drops with as few as two players in a battle.  We were playing a game of Post Grab on our network in the office and noticed multiple hitches as we faced off against each other. While there are a few new character skins that are included for multiplayer, including Frank West from Dead Rising, Mega Man (which looks like Frank squeezed into the suit) and Luka, these aren't necessarily enough to make you feel like you're gaining anything extra or special with this game.There was an opportunity to make Lost Planet on the PS3 an incredible experience, fixing many of the bugs that plagued the 360 and PC versions and making this the version to get.  Unfortunately, it comes across more like a bare boned port of an action title, with weak controls, bland and unimpressive visuals, and significant frame rate issues in both the single and multiplayer versions of the game.  If you're looking to play this game, you might be better served on one of the other systems than the PS3 version.", "date": "Feb 27, 2008"}