{"name": "Turok", "name_review": "Turok Mobile Review", "ref": "https://www.ign.com/articles/2008/02/28/turok-mobile-review", "text": "Remember the original Turok game on the Nintendo 64 back in 1997? Remember how much fun it was? Eleven years later, the franchise is still alive on consoles and Turok finally makes an appearance on your mobile phone. Is that a good thing, or a bad thing?   Back in December, I reviewed Terminator: Revenge and commented on how rigid, stiff and repetitive the game play was. Do developers ever learn from others' mistakes? Turok also comes across as a rigid, stiff and repetitive mobile game. But at least it has dinosaurs, right? Dinosaurs are cool aren't they?   You play as Joseph Turok on a mission to capture the war criminal Roland Kane. And by capture, I mean kill. Kane was Turok's former mentor but has since gone to the dark side. Now that he's a bad guy, Kane shoots down the ship holding Turok and his team, stranding them on a planet filled with hungry hungry dinos.   Gameplay is simple. You run to the right or left and shoot anything in front of you. Controls are easy. Left is left, right is right, up is to jump and down is to lower yourself from a ledge or camouflage yourself in the background. The camouflage portion of the game is the most helpful feature in the game -- s long as you only use it at the exact right moment. It's handy when an enemy hasn't seen you yet. You press down, wait for him to walk by you, then blast him. But if an enemy is alert to your presence, pressing down will only hide you for a second while he tries to kill you. And it will be the first of many restarts for you.  Enemies can be dispatched by shooting them with one of three weapons: an SMG machine gun, a bow or a shotgun. You can upgrade each weapon three times, but I found that the upgrades seem to lack any real noticeable power. If you can sneak up behind an enemy, you can engage him in close combat. Press the center button repeatedly until you eliminate him with your knife. (You will be attacking from behind a lot in this game so get used to it.) There are a few times where you will be surrounded by dinosaurs and you must kill them all before they kill you. That means you stand there while your gun fires for you and you just point your weapon in the direction the dinos are coming in. Fun?   The forced combat feature is a huge weak point in this game, and I'm not talking about the auto fire sequences. If an enemy sees you, you must fight him. You can't run away from him, you can't jump up on a ledge to escape and plan another way to attack him. Nope, you have to sit there and pray your health outlast his, because the enemies with guns will take away at least two thirds of your health before you kill them. Luckily, your health slowly recharges if you're hurt. It's nice not to have to look for health packs, but its boring having to stand there and wait for your health to replenish just so you can feel confident enough to fight the next enemy. This tactic won't work with the scorpion enemies. You just have to hope you can kill them up close before they kill you since your weapons seem so useless.    There are a couple of boss fights but they're with T-Rex's and are very easy. The last boss took me a while to figure out how to beat. I don't know if it's because I was tired of the game by the time I got to him, or I just couldn't believe how stupid the tactic is you use in killing him. In fact, all of the enemy AI is pretty iffy. If there are more than two enemies on screen, you can press down to hide, sneak up behind one and kill them, hide again, and the other soldier won't even notice his buddy has gone missing. What the enemy is good at it, is killing you while they're off-screen which makes for lots of restarts and tons of creative uses for the 'S' word.    The graphics are nice to look at. Turok, the enemies and levels are animated in good detail, and when you slice someone from behind, the blood looks pretty cool. I wish I could have heard more of the sound effects but the phone I played this game on has the audio technology of a whoopee cushion. (Levi: George played the game on a Sony Ericsson w810i, which is actually a good gaming phone in my opinion.)   Turok Mobile also has achievements. One of them is to collect all of the dog tags in each level, which is pretty easy to do. If you you're having a hard time finding one in the first level, it's because it's to the left of you when you first start. Just a pro-tip from yer buddy George.  Just like Terminator Revenge, this is a very average action platform game plagued by some problematic mechanics. (At least Terminator gave you other things to do besides shooting dumb enemies and the cheese kills werent as plentiful as they are here.) Turok Mobile can only be recommended for die hard Turok fans that value the character above the idea of having fun -- and even then, that is a very faint endorsement.", "date": "Feb 28, 2008"}