{"name": "Atelier Iris 3", "name_review": "Atelier Iris 3: Grand Phantasm Review", "ref": "https://www.ign.com/articles/2008/02/28/atelier-iris-3-grand-phantasm-review", "text": "Developer Gust has been cooking up fun with its Atelier series for over ten years now. That's pretty impressive considering the series never wanders too far from the same basic formula in terms of both gameplay and story. After years of the same delicious dish though, our taste buds have been longing for something zestier. We were hoping to find that in Atelier Iris 3: Grand Phantasm, but after diving into this chemically-induced dish, we found it to be a little bland.    The premise of Grand Phantasm is anchored by the legend of the Escalario. The Escalario is an enchanted book that can grant the wish of the one who controls it. Years ago, the mysterious tome was split into eight pieces and scattered throughout the world. Time passed unheralded in the land, and the Escalario became nothing more than a faded memory. But one day two teens named Edge and Iris -- Raiders on an assignment for their guild -- stumble upon a piece of the legendary manuscript. The piece, floating rather nonchalantly in the middle of a forest, reacts to an alchemy book that Iris carries around with her and dives snugly between the pages.  Edge is justifiably alarmed but Iris, an alchemist familiar with ancient lore, suspects what the manuscript is and relates the myth of the Escalario to her Raider partner. Together the two begin to hunt down the seven other pieces so that they can make a wish.    Grand Phantasm's gameplay is a mix of dull-as-dirt fetch quests and the more interesting but time-consuming missions. Playing as both Edge and Iris, you'll go looking for the other pieces of the Escalario while performing various tasks for the Raider's guild (the guild is essentially a club for adventurers). By accepting either fetch or battle quests found on the Guild's message board, you'll move the story along as well as gain money and experience.    Two wild and crazy kids.  Once you choose a mission you'll head to an Alterworld, where you'll have a limited amount of time to complete an assigned task. Alterworlds are special areas outside Zey Meruze, the lakeside town that acts as the game's central hub. In Alterworlds you'll find friendly beast tribes like the Pengie and the Squawks, alchemy items for Iris, treasure chests, and of course enemies.   But unlike a lot of other RPGs where you're free to explore you're immediate surroundings for as long as you like, Grand Phantasm's Alterworlds are ringed by a mist that will unceremoniously drop-kick you out of the vicinity after a short period of time. You'll know how much time you have because an hourglass with a string of beads hanging from it appears conspicuously on the right side of the screen. As you go exploring each bead will start to disappear, and when they're all gone an alarm will sound letting you know that your time is up. You can always revisit an Alterworld if you're kicked out, but if banished while on a quest you'll fail the mission (certain quests have a limited number of times you can try and complete it, making some expeditions a bit nerve wracking).    One way to avoid getting the boot is to collect little hourglasses hidden beneath blades of grass or tucked behind trees. Another is to avoid any powerful monsters you see on the battlefield. This is easy enough to do because of the Symbol Encounter, which allows you to visually see a group of enemies(represented by a big blob) on the field before you run into them. The size and color of the symbol will tell you the difficulty level of your opponents. Blue means a cluster of enemies that have lower stats than yours, white means they have equal stats, and red means strong enemies with high stats. Due to time constraints it's usually easier to just jump over the red symbols or swipe blue ones with your sword (which will kill them without entering a fight), although it means losing the chance to level-grind. And level-grind you might want to do; the second half of the game has a sudden lurch in difficulty.   If you do find yourself in a fight, you'll have the dubious honor of using the ACCB system (Active Card Cost Battle system). This ~new~ battle system isn't an over-achievement for the developers, who pretty much tweaked the ACTB system from Atelier Iris 2 by eliminating the ~Break~ option and adding an extra gauge on the bottom part of the screen. This novel feature is called the Burst Chain Mode, where a gauge called (what else?) the Burst Gauge fills up every time you smack on enemy on the head. Once it's full to bursting your characters will go into overdrive for a short period of time, in which they can unleash powerful spells and attacks on an unsuspecting monster.   Grandpa goes into overdrive.  If you manage to kill your enemies quickly, you'll receive a ~Fast Kill~ stamp on your ending stats and no time will be lost to you as you travel around an Alterworld. Fleeing from an enemy you've accidentally run into however takes a whole knot off your total time. Therefore it's best to try and eliminate monsters by filling up the Burst Gauge as fast as humanly possible. To do this you need a party that is strong and diverse. This is where the Blades Mastery element comes into play.   We're not fooled. We know that Blades Mastery is simply another term for Job Class, but at least the developers try to give it an original name. Careers like Ninja or Healer are acquired every time you come across a magical being called a Mana (found in previous Atelier games) who will then form a pact with Iris (they will only bind with an alchemist) and allow you to learn new skills. Each job has a set number of levels. When the highest level is reached your character will become a Master Blade and they will be proficient in battle. Of course they'll be even better in a fight with the right equipment. And in order to have that, you're going to have to have Iris make them for you.   Alchemy is the central feature in the Atelier Iris series, and it continues to be so here. Unfortunately Atelier Iris 3's system is almost exactly the same as its predecessors, except that instead of collecting recipes found lying around, Iris will get ~ideas~ for recipes... by looking at things found lying around. There's virtually no difference between the alchemy feature in this game and Atelier Iris 2; even items like fabric and heal jars (made by combining a variety of mundane things like twigs and metal ore)are made in a similar fashion. Quite frankly this is just out and out lazy on the developer's part; even a little bit of a change would be appreciated. But back to Iris. As she creates more and more things her rank as an Alchemist grows and she will come up with new recipe ideas. Essentially these ideas are the only way to get extremely rare items and weapons, so it's important to stop by her atelier between missions and make sure she's up to speed on everything she needs to know. The atelier is also the only place where you can change jobs, which means careful planning is needed before taking on a difficult quest.    The game is rather low on challenges for the first ten hours or so, so once you've got the job system and alchemy system down, you'll be able to master the game fairly quickly. It may take you time to warm up to the quest aspect of it (we never really did) but at least there was some upbeat, feel-good moments and a lot of cheery music. Charm has always been part of the alchemy series, and Grand Phantasm certainly has an abundance of it. Unfortunately the developers lean too much on this trait and don't bother with much in terms of uniqueness or originality.In short, the developers continue to play it safe and add a few new ingredients to the series without really changing the basic stock of it. Sprites, items, music and graphics are all pretty similar to previous Atelier installments. So if you're a fan Gust's Atelier series and not a fan of change, you'll probably enjoy this game. If you enjoy a bit of novelty though, you might want to look somewhere else.", "date": "Feb 28, 2008"}