{"name": "Superbike World Championship", "name_review": "Superbike World Championship", "ref": "https://www.ign.com/articles/1999/08/05/superbike-world-championship", "text": "There have been a lot of PC moto-sims released this past year.  Most have tried to offer up something in-between real-life and the feel of an arcade racer, but most have ended up with a final product thats just too watered down for hardcore sim enthusiasts to sink their driving gloves into. With Superbike World Championship, Milestone and EA seem to have found the right balance between realism and just plain fun.  While it's not exactly the most hardcore superbike sim possible, it sure offers up enough true-to-life action and customization to satisfy the realism fans while allowing enough difficulty variability to satisfy arcade racers too.  Superbike racing is the kind of racing where it's just as important to know when to use the brake as it is to open up the throttle.  Tracks on the superbike circuit are twisty and treacherous, so you can't just keep your accelerator gunned at all times.  You have to read the curves and anticipate when to slow down or you may end up eating a face full of grass or, even worse, slam into a barricade of old tires.  Those steel belts really hurt when they poke into your ribs, y'know?  If there's one thing that EA constantly strives for in their sports titles it's realism, and Superbike World Championship is no exception.  You'll race around the world on the same twelve international tracks the pros race on.  All of these courses are modeled after real-life tracks ranging from Phillip Island in Australia to Sugo in Japan, Hockenheim in Germany to Laguna Seca in the States.  You'll also be competing with some of the best racers in the SBK circuit, roaring around the track at speeds over 200mph against names like Peirfrancesco Chili, Carl Fogerty, and Aaron Slight.  You can race one of five different superbikes, four rice burners (Honda RC 45, Kawasaki ZX7R, Suzuki GSXR, and Yamaha YZF) and one Italian-made (Ducati 916).  While you only get the stock version in action mode, if you opt to go for a full simulation, you can customize the transmission, suspension, tires, rake, and trail of your bike, altering these variables to fit your racing style.  In addition to bike customization, there are plenty of other play options in Superbike World Championship.  If you're the kind of person who's just into a quick race, you can jump right into a heat with little more than a click of the mouse button.  There's also a championship mode for those of you who want to compete for point totals over the course of a dozen races.  Factor in weather options, difficulty scales, 8 player multiplay over a LAN, and realism settings and Superbike World Championship is guaranteed to be a racing game that you won't soon tire of.  Of course, the real defining feature of any racing game is the way it feels, and Superbike World Championship passes this test with ease.  Superbike racing is all about smooth moves and fluidity in motion, and Milestone really did their homework researching how superbikes react.  The game plays extremely gracefully, giving you a real sense of motion, and I even caught myself swaying with the bike as I took sharp turns.  This one moves better than Jesse Owens at the 1936 Berlin Olympics.   Superbike World Championship really makes an impression on the visual side of things too.  The high-polygon bike and rider models look fantastic, covered with tiny advertisements just like their real-life counterparts.  Terrains are nicely rendered and well detailed, complete with buildings, spectators, tire blocks, and trees.   The character animations are some of the best I've seen in a motorcycle sim, moving with the bikes as they turn and flipping you off if you get a little too close for comfort. And, when you invariably lose control of your bike and slam into one of your opponents on a particularly hairy turn, nothing beats watching your racer fly through the air with his arms flailing while your bike skids underneath him throwing sparks up the entire way.  The art team really paid special attention to the little details in Superbike World Championship as bikes spit up dust clouds if they go off of the track and water trails if the course is wet.  It all looks so good you'll be tempted to lay off the accelerator and take in the surrounding beauty, but there's no need to do that since you can recap all of the on-track action with the replay mode, giving you the ability to check out your moves from a variety of different camera angles or even from the perspective of the other racers.   So it's not hard to tell that I had a lot of fun with Superbike World Championship.  Not only does this game simulate the action of superbike racing, but it captures the spirit as well.  It's got something for true simulation fans and for those of you just looking for a quick arcade dash.  It's definitely the best superbike racer out on the market today, and you won't be disappointed if you pick up this one.  -- Tal Blevins", "date": "Aug 5, 1999"}