{"name": "FIFA Street 3 DS", "name_review": "FIFA Street 3 Review", "ref": "https://www.ign.com/articles/2008/02/28/fifa-street-3-review", "text": "Before the release of FIFA Street 3, Electronic Arts already had two strikes against its attempt to turn its FIFA franchise into an arcade-style soccer title. The exception was the Nintendo DS version, where FIFA Street 2 was the series premiere on the handheld. Whether it was due to a limited development cycle, simply a flawed design, or a combination of the two, FIFA Street 2 didn't turn out all that hot on the dual-screen portable. Apparently it still had the right stuff to justify a sequel, and FIFA Street 3 for the Nintendo DS was born. This follow-up is definitely a significantly improved experience, but even with the tighter production FIFA Street 3 still ends up too limp to recommend.   FIFA Street is EA's way of taking the sport of soccer and exaggerating it for those who might not have the tastes for nil-nil scores at the end of a match. Not really, but you get the point: soccer's got a lot going for it, but it's not a bad idea to take the concept and bring it down to a point where it doesn't take itself too seriously. The result is FIFA Street where flair is king and the goals are plentiful. The concept is a sound one, but the execution doesn't meet the expectations: FIFA Street 3 for the Nintendo DS has some cool concepts, especially when it comes to stylus-exclusive control for a sports game, but it just doesn't have that addictive fun factor to keep players' interests. A handful of matches and boredom slowly starts to creep in.   Last year's game was pretty bad: awkward visual and gameplay glitches caused some serious issues in the game's enjoyment, and the core mechanics really weren't balanced all that well. Nintendo DS developer Exient's usually rocks pretty well in its handheld games like Madden, FIFA, and Tiger Woods, but FIFA Street 2 was clearly the team's darkest hour at that point. The same studio's been given a second chance at the franchise and a lot of the problems have been cleaned up: the game definitely looks better and plays tighter, and incorporates much more thought out touchscreen controls. But that pesky core mechanic is still a problem: the tightened up production can't save the fact that FIFA Street just isn't that fun to play.   The stylus control was clearly where much of the DS game got its focus. Using the D-pad (or the buttons, for the lefties), you maneuver your chosen athlete in the 3D arena. But all of the actions  passes, kicks, and tricks  are handled by taps and flicks of the stylus on the touch screen. Passing to a player is a simple tap in the relative ~zone~ of the touch screen to where the player is in relation to your character, and shooting is a upwards stroke in the direction you're aiming on the goal.    The game camera, by default, is a forward moving perspective where you're always looking at your goal, almost like playing a hockey game on a console system. Since handheld gamers have their own view of the action, this works well since the game never has to switch the camera to the other goal in order to be fair to the other player. As a result, the contextual strokes on the touch screen are fixed and never changeeven when you might decide to change the camera to match the side-on perspective of the console game. So it's not recommended to change it.   There's no doubt that it looks, sounds and plays better than last year, but FIFA Street still needs something called   Ultimately, the stylus control works. It's a little bit disjointed due to the lack of visual feedback -- there's barely anything going on down on the bottom screen when you're tapping and stroking other than displaying directional strokes for footie tricks. And the Gamebreaker mechanic of tapping on the lower screen to random times is pretty lame. It's a far better ~pass and shoot~ control system than a ~tricking~ one. It shows incredible promise if the developers decide to flesh it out for, say, a true NHL game for the Nintendo DS since it allows for direct control of shot direction, possible almost better than what Electronic Arts has established for the right analog stick on the consoles.   But the problems of FIFA Street 3 boil down to the fact that the game just doesn't grab the player. It's fun for a quick pick-up game but rapidly grows boring the longer the challenge is. And that's how the team extends the game's replay in single player: by creating challenges that are more than just ~beat the other team.~ You might have to score a certain amount of trick points, or win on a Game Breakerand these are elements that turn a simple game into a dull, complex mess.    But if you find that you enjoy the trick-based soccer game, Exient's got multiplayer covered with single and multiplayer support. FIFA Street 3, like all of EA's sports games as of 2007, supports online via the Nintendo Wi-Fi Connection, and since it's only a one-on-one affair this option is near flawless if you get a solid link to the other player. There's no option to converse with the other player, but it's a seamless experience otherwise and certainly worth hopping online once or twiceif only to thank the developer and publisher for continuing to support the online DS experience. FIFA Street 3 turned out the better game compared to last year's mess, but it's still not a ~good~ one. I'm imagining that FIFA Street 3 is simply a testbed for NHL's possible move to the Nintendo DS. The stylus controls might not make a trick-based three-on-three soccer game fun to play, but it has the potential to work for focused pass-and-shoot mechanics for ice hockey. It's an idea whose time has come and hopefully the ideas created for this weaker product will make it into a stronger sports title like NHL.", "date": "Feb 28, 2008"}