{"name": "Bully", "name_review": "Bully: Scholarship Edition Review", "ref": "https://www.ign.com/articles/2008/02/29/bully-scholarship-edition-review-3", "text": "Bullworth Academy opens its doors to a brand new class of gamers next week with the release of Bully: Scholarship Edition for Nintendo Wii.  While most hardcore gamers out there already know the score when it comes to Rockstar's GTA-like school simulator, a few things have been changed along the way for Nintendo's version of the game, and while we wouldn't normally embrace ~Wii-makes~ that end up being basic PS2 ports with very little to offer players, Bully is still, after two years, one heck of a package, and well worth your time and attention.   Nearly the entire Bully package is identical to what it was on PS2, but where changes were made, they were made right.  The core experience Bully has to offer is still the same; players take the role of Jimmy Hopkins, an outcast teen who is ditched in a strange town by his mother and new step dad, and is instantly the marked man in a school riddled with bullies.  The school runs on its own schedule though, so while you've got free reign of the campus from the beginning (and later, the town of Bullworth), you'll be sent to detention or forced to go to class if you fail to follow the game's internal clock.  When in doubt, scour the mini-map for gold stars (missions) or bells (classes) and you'll be on your way to winning over Bullworth Academy.   But we knew this already.  This is what PS2 owners got two years ago.  What's different?     Bully: Scholarship Edition is basically an expanded experience in a few key areas.  Most prominent of the changes Wii owners will find is the revamped control scheme, which actually works very well, and makes fighting (like Wii's Godfather: Blackhand Edition) extremely fun and engaging.  Rather than button mashing to fight, a quick shake of the nunchuk or Wii remote will throw left and right hand punches respectively.  Grabs are handled by holding Z and pushing forward with your left hand  at which point you can shove them with another nunchuk shove, or deliver punches with the remote  and the classic humiliation finishing moves are now all motion-activated, similar to a PG-13 Manhunt 2 scheme.   If it were just the control alone that Rockstar focused on this time around, Bully still would have been a decent, quick remake.  With the addition of four new classes though, the experience feels a bit more fleshed out, as the new classes borrow from games like Trauma Center and Brain Age.  Biology specifically (Trauma Center with dead vermin) is entertaining at face value, and as a mini-game it's pretty engaging.  Each of the minis in Bully though  be it at the carnival, in the form of new classes, or dished out during detention  all have the same rough, first-pass feel that you find in all of Rockstar's open world experiences.  Yes there's a ton to do in the city of Bullworth, but there's a constant balance of interesting concepts, and not-so-rewarding execution. It isn't that the minis aren't fun, they are, but none of them have that fine layer of polish that separates a really good experience from a great one.   Despite any polish issues or glitches in the world, there's still an overwhelming feeling that the world around you is truly alive, and that really makes Bully the experience that it is.  From the beginning of the game it seems like everyone in the school is out to get you, as a simple shove or piece of trash talk will result in you getting beat down where you stand, or school prefects tracking you down and throwing you in detention (stealing your items in the process). As you do missions and build up your rep with specific groups, however, you start to find the fine balance that Bully offers, and in that way the game feels very inspired by its GTA brethren.  Rockstar has also done a great job with the VO and presentation in Bully, and while the core visual experience is nearly identical (a few effects added here, some model detail there), Bully still offers one of the most cinematic experiences on Wii to date.  The sections of the world are opened up at a great pace, so just when you feel like Bullworth academy is too small for the likes of you, the first chunk of the city opens up, adding in part-time jobs, more ~favor~ missions for locals, the carnival riddled with mini-games, and tons of stores that allow you to buy items straight-up.  In the end, there's a lot to see and do in Bullworth; as long as you're willing to skip class and stay out late.    The final aspect of Bully that has been changed this time around is the multiplayer.  With two Wii remotes (and nunchuks), players can grab a friend and go through any of the game's classes in classic competitive fashion.  Unfortunately not all mini-games in the Bully package were included, but the core games (math, geography, biology, English, and the like) are all in tact, and fun as split-screen affairs.  It's nothing mind-blowing as far as new content goes, but with multiplayer available from the main screen at any time, it's a better alternative than calling a friend over and having him watch you play for a dozen hours on end.   The only major gripe we have about the new content at all comes in the form of its integration with the rest of the game.  Right from the beginning the new missions and classes are mixed in with the rest of the content, but while most classes have global rewards (such as the ability to talk trash better, craft new weapons, or unlock bikes), each of the new classes are simply keys to unlocking the new clothing in the game.  Granted, going back into the code of a game and trying to fully integrate all new skills would have been a pain in the butt, and players that haven't played Bully on PS2 before won't even notice this issue, but it's still worth mentioning.  The new content added is a huge step above what most publishers are doing on Wii, and it's the reason we recommend Bully as much as we do, but it's still a matter of eight new missions and a few extras thrown in for good measure.   Welcome to Bullworth, little man. If youve already taken Bully for a spin on PS2, Scholarship Edition isnt going to be worth the extra $50 youd plop down for motion control and new missions.  About 95% of the content is identical, and Rockstar is packaging this one to both Wii and 360 as a perfect product for those that are late to the party, and have yet to experience what Bully has to offer.  For those that havent made the rounds at Bullworth Academy, youre missing out, as Bully is a charming, entertaining experience, and far more lighthearted than it has been made out to be.  Mini-games and classes are actually educational and fun, the T rating ensures that its toned down in the language department, but Bully still has an overwhelming amount of entertaining content, and Scholarship Edition is another step above what we saw on PS2.  The graphical update from the PS2 isnt as much as we would have liked to see on Wii (the two versions look nearly identical), but the motion control is entertaining, the new classes are well made, and multiplayer is a nice distraction from the main game.  Wed still recommend Godfather and Scarface over Rockstars latest offering (as long as you can stomach the M rating), but in no way should that sway players from picking up Bully and enjoying the hell out of one of Wiis deepest offerings.  We gave the original Bully an 8.9 two years ago, and the game still holds up today as a great open world offering.  Wii-makes are never the most impressive outings on our side, as its obvious everyone is trying to make a quick buck off Nintendos success, but in the case of Bully, all is forgiven, as its simply a blast to play.", "date": "Feb 29, 2008"}