{"name": "MLB 08", "name_review": "MLB 08: The Show Review", "ref": "https://www.ign.com/articles/2008/02/29/mlb-08-the-show-review-2", "text": "Sometimes, disappointment can be an extremely good thing because of the response it creates.  Take, for example, MLB '07: The Show.  While it was held back a month and a half later than the PS2 and PSP, the first step of SCEA's baseball franchise on the PS3 felt more like a port than a leap forward.  The development team took much of the criticism for that title and within ten months cranked out the latest installment of the series, MLB '08: The Show.  But instead of simply patching the visuals or fixing some of the AI problems, just about every facet of the game has been improved on radically, making this the best version of The Show on any system to date.   Last year brought a lot of attention to pitchers and their skills with its focus on the Pitch Command System and Adaptive Pitching Intelligence.  These two systems have returned to MLB '08, but this time around, MLB '08 focuses more on the Pitcher/Batter duel thanks to its new pitcher/batter analysis tools. These tools provide a wealth of information on just about anyone that's prepared to step onto the mound or into the batter's box, so you can exploit their weaknesses or know an opponent's tendencies.  By hitting the select button, you're given the option to view the stats of both the pitcher and the current batter.  For instance, you'll be able to find out how a pitcher does against right and left handed batters, or the percentages that a batter hits to right, left and center field.   Click here to watch the video feature.    By hitting the L1 button, you can check out more in-depth pitching information, such as what kind of pitches a pitcher has, the number of times they've thrown that ball, their strike percentages with that throw and the opponent's batting average against it.  You'll also be able to see details on the last 25 pitches thrown and where they landed within the strike zone, such as whether they were fouled out, hit or completely missed.  What's also cool is that you can start to use this information to learn how a pitcher will probably throw in certain situations.  For instance, you can see what a pitcher is most likely to resort to during a player's first at bat or what he likes to throw during a full count.  The batter analysis is rather similar, except that you'll get a breakdown on the number of pitches they've hit, missed, or fouled on, as well as the balls taken and the strikeouts.  This is broken into a ratio, which can be analyzed by situation, as well as by hot and cold zones in the strike zone.  Use these tools wisely, and you should have no problem hanging K's on batters and knowing when to expect a nasty curve ball to just graze the outside edge of the zone.   Even with these tools that are rather balanced, it can be said that batters do get a bit more love in MLB '08 thanks to the included Progressive Batting Performance system.  Found within Road to the Show, Season and Franchise mode, this feature tracks the slumps or hot streaks that batters are prone to during a season and ranks them with five easy to understand color icons.  So if a player strikes out a lot or doesn't manage to get on base within a series or two, you'll see a mild contact penalty show up in the form of a dark blue icon with arrows pointing down.  That indicates that they're not very confident in either their contact or power swing, and need some solid at bats to pull themselves out of their funk.  On the other hand, if every ball thrown at you is hit solidly, you'll notice a red icon with arrows pointing up, representing that your player has the hot bat and is getting a contact bonus.  What's nice about this feature is that while it doesn't unbalance the gameplay with the bonuses or penalties, it feels like it accurately represents how players are performing at the plate.   Get ready to knock one out of the park. For the most part, baserunning is the same from last year, although it does appear that the mechanics have been tightened up significantly.  It's much easier to queue up players to go for an extra base or two without feeling that you're fighting the controls, which is a nice improvement, especially over last year's game.  What's more, the mechanic for sliding via Sixaxis controls feels tighter, especially when it comes to determining whether you're going to try to slide to the inside or outside of the bag.  While I still personally prefer the analog sticks to determine whether or not I'm going in head or feet first when I'm hooking to the left or right, it's nice to know that it's available to me.   Fielding has received a brand new mechanic as well, which gives outfielders a better idea of when they can deny a homer from clearing the fences or pick off a foul ball before it reaches the stands.  The Rob Home Run Indicator is a series of concentric circles that fade as a ball starts on its descent.  If you time your R1 button press, right analog stick up or Sixaxis snap up as the last ring disappears, your player will climb the wall and pull down the ball.    It's nice to see this as the first improvement with fielding, but the AI has also been tightened up as well compared to last year.  The infield AI won't make the same bush league mistakes as it did in '07, such as not turning a double play when it's easily available to them.  Now, it appears as though the AI will evaluate properly whether it can make a play before it tosses the ball, which really brings out the realism of the game.  However, there are still a few hiccups that the game will suffer from when it comes to fielding.  The first is that the pitcher won't always attempt to stop a ball that rolls past him.  I know that on blistering shots it's more practical for a pitcher to duck out of the way, but for some bouncing or rolling shots, the pitcher won't even put a hand out to attempt to stop the ball nine times out of ten.   Then again, you'll also see the ball clip through the pitcher at times, which can be pretty obvious.  This isn't simply limited to the pitcher; the lack of collision detection and clipping through players can be pretty significant, particularly when a player is sliding into a base and popping up through a baseman.  Additionally, collision detection can be somewhat off near walls, as a player's momentum can carry a fielder through the park walls and into the stands.  Sometimes, infielders will also seem to accelerate as if they're being unnaturally pulled on an invisible cord towards a base, such as a slow pitcher who gets quickly yanked across the field as he goes to cover first base when the ball is thrown to him.  It doesn't play out right.  The last point is that fielders will sometimes mis-time their grab on a ball, forcing them to return and pick the ball up again.  While I recognize that this will happen in some games, particularly if you're trying to grab the ball with momentum carrying you in a different direction, the amount of these misses, sometimes back to back by supporting fielders, can feel a bit strange.     These fielding hiccups aside, there's been a large amount of work done to the presentation of the overall game as well to make this game really stand out as a powerhouse.  First of all, players can continually access a replay vault that highlights any play within the game at any point.  That means that if you want to show off a double play that you've turned to a friend, or rub in the home run you crushed, you can do this at any point.  While the largest downside with the replay vault is that you can't save these moments to the hard drive or export them over the game's online service, the fact that you can isolate these moments to bask in by player, offensive or defensive side of the ball or other factors really makes the title stand out, and practically strengthens the game's opening, which isolates history making moments from the 2007 season.  This kind of ~Web Gem~ presentation makes your gameplay stand out even stronger, especially when you couple it with previous features.   However, making up for the lack of saved replays is the inclusion of in-game saves at any point in time.  This is a feature that every sports game should have, because forcing players to play a full game in its entirety, leave a console running or turn the game off if they need to get up and attend to something is archaic.  This save feature, coupled with the ability to fast forward action to just about any section of any inning is an excellent addition.  Stats fanatics will also be pleased to see two strong additions to the title: first, MLB '08 keeps box scores and individuals stats for every game of the season, including starting lineups for each team.  The other part is the roster foundation screen, which highlights every single acquisition and team change made by your team during a season, franchise or Road to the Show career.  The depth tracked by the game is simply incredible, and the fact that it continually tracks and auto-saves after each game is an awesome way to keep tabs on your team. To wrap most of this information up in a manner that will also appeal to players that aren't deep into the numbers and stats, MLB '08 generates a virtual sports ~front page~ that highlights significant performances in Season, Franchise and Road to the Show modes.  The lone downside, which is rather minor, is that you can't isolate the headlines to focus solely upon your team, so you may see stories on teams you don't really care about instead of your club.   Strike this guy out. Now, one of the primary features for last year was the Road to the Show mode, which was decent but had a lot of goal issues, camera problems and other things that hampered the gameplay.  MLB '08 puts most of these problems to rest with one of the deepest and most involving career modes of any sports game.  First of all, players have a lot more flexibility when it comes to creating their players, primarily when it comes to their head and facial adjustments.  With enough time, you can probably recreate yourself with the included tools, although the limitation between three body types is still disappointing.  Once you finish working on this, however, you'll notice that the goal system has been completely redone.  No longer will you constantly be told to hit home runs like you were in last year's game.  Now, you might be told to drive a run in, get on base, or respond to a suicide squeeze situation.  Perhaps the best goal that I've seen is the inclusion of third base coach signs, which will instruct a baserunner of the situation a batter faces, such as bunting or swinging away, or whether they should steal a bag.  Your first minor league team will give you the basic tutorials on these signs, but as you get closer to the Big Leagues, the game will expect you to know these signs on sight, which is a phenomenal addition to the game.   Your manager will also have different events that he'll ask for, such as trying to turn double plays when it makes sense to turn them for infielders.  He'll also tell you to move up or back depending on the batter at the plate.  Yep, this year you can actually make defensive adjustments for a bit, shifting your player to a specific area on the field so you can potentially get a jump on the ball when it's put into play. What's more, he'll give you much better advancement goals to help you get to the next level, such as improving specific stats over the course of a series or getting on base a certain number of times, establishing your character as a producer for the team.      Goals are also better evaluated this time around.  While there are still some ~Pass/Fail~ moments that you'll run into, you've now got positive results and not attempted categories that are attached, meaning that the game will accurately recognize whether or not some situations are out of your control and not penalize you for it all the time.  For instance, if you're supposed to bunt and the baserunner gets picked off by the pitcher out of your control, you won't get burned for that. Unfortunately, camera angles are still disorienting, particularly when you're on base and trying to see where a batter has hit a ball, so you'll probably find yourself holding on a base much longer than you should, particularly if a ball drops fair, which can result in some tagged outs.   Online play, which was pretty good last year, is definitely stronger thanks to SportsConnect, which has received some new features.  New to MLB '08 is the inclusion of what's known as Scout, which allows players to tailor their preferences for an opponent to play and let the game instantly search for a match.  This cuts down on continually moving through various game rooms looking for someone who's open for a game; with Scout, you can instantly leap into a match in a few seconds.  You can also search for and download opponent's player cards, with PS Eye supported avatar images and constantly tracked stats. With updated scoring and leaderboards, as well as weekly roster updates, online matches are definitely improved events, and they run without any hitches.     Visually, MLB '08 is a gigantic leap forward over that of last year.  Camera sweeps of the parks have a new television-styled presentation, making the game feel much more realistic.  The depth of field, while rendering elements in the background fuzzy, makes more sense based on the camera because it focuses in on people or game elements in the foreground while capturing action in the background, as a camera naturally would.  However, the filter isn't done in a distracting way, and so you don't feel overwhelmed by this feature.  The crowd is still excellently done, and while you can still pick upon on the various character models that are copied over in a limited amount of space to fill seats, they still react more naturally than most sports crowds.  Players will watch as beach balls are knocked about the stands, and foul balls or home runs that reach the bleachers will be fought over, which is a great touch.   Players, by contrast, have a ton of additional animations.  No longer are players stuck with crow hops for their throws; I've seen everything from barehanded grabs during a relay to tosses that take a player off their feet.  There are awesome moments that capture the feeling of being at a game, such as watching players react in disgust if they blow a play in the outfield, or angry outbursts from batters that strike out and leave players on base at the end of an inning, throwing their helmet into the dugout wall.  Do yourself a favor and just let the game run for a bit while you're pitching  after about thirty seconds or so, you'll see everything from batters and catchers determining whether they feel raindrops to fielders checking the direction of the wind with blades of grass.  The one that really settled it for me was playing a game, legging out a triple, and watching a third baseman try to tag my player with a hidden ball in his glove.  This is easily one of the best looking games out there.   We might need a replay on this one. It doesn't mean that it's perfect, however.  There are some seams and texture tears that will crop up, primarily along the walls of a park.  These are primarily highlighted by camera angles, frequently during replays.  Some aliasing issues will also pop up during these moments, particularly as the focus of the action varies from the menus that are being shown.  Some of the other problems from last year still seem off, such as the cloth physics, which, while better than last year, aren't completely addressed.  Players will also still try to give teammates fist pounds and clearly miss the target, which is just a funky animation glitch.   Soundwise, MLB '08 is still anchored by Vasgersian, Hudler and Campbell, who are one of the best commentary teams in sports games.  The crowd still performs their razzing of players, and the cheers and boos that you hear will feel like you're at the park.  The largest improvement to the game's sound is the inclusion of the My Music feature, which lets you use any songs that you have on your hard drive to add to the game's playlist.  The downside to this feature is that these tracks appear to be limited to menu screens or game transitions, so you won't actually hear your songs blaring through park speakers, but the inclusion of the feature is still a large improvement.  Coupled with radio calls from last year's season, the sound is a solid addition to this year's title.Last year, PS3 owners were let down by strange AI problems, weak visuals and game features that just didn't deliver what they promised.  That's not the case this time  MLB '08 delivers on every gameplay front.  The on-field play is excellently done, the stat tracking is immense, and Road to the Show is one of the best career modes around.  Visually striking, this is the baseball game that baseball fans have been waiting for on the PS3.", "date": "Feb 29, 2008"}