{"name": "Mystery Dungeon: Shiren the Wanderer", "name_review": "Mystery Dungeon: Shiren the Wanderer Review", "ref": "https://www.ign.com/articles/2008/03/04/mystery-dungeon-shiren-the-wanderer-review", "text": "When Pokemon Mystery Dungeon hit the Nintendo DS back in 2006, a lot of gamers got their first experience of the Mystery Dungeon series. The game sold millions (the Pokemon logo certainly helped) and will be seeing a sequel here in the US shortly. Before that happens, though, Chunsoft has reached back in time and pulled one of their first Fushigi no Dungeon titles out. Mystery Dungeon: Shiren the Wanderer makes sense as a port of a classic mysterious dungeon game, since it is the only title in the series to feature original characters. It's a look back at the early days of the dungeon crawling adventures, and reminds us that even at its prime, the Mystery Dungeon series is only as good as it randomly generates itself to be.   Mystery Dungeon is a series that's been around for well over a decade, but is still one many Americans might not be too familiar with. There are a couple major features that make the game a Mystery Dungeon: randomly generated dungeons and turn-based gameplay. In the Mystery Dungeon series, every move within a dungeon counts as a turn. Taking a step, attacking, using an item and talking to someone each count as a turn, and for each action, the enemies in the dungeon get to make one move, too. It's been described by Chunsoft as similar to chess. By that we mean that nearly every game in the series has some character in the first town that compares the game to chess. It's weird.   Unlike pretty much every other Mystery Dungeon game before and after this one, Shiren the Wanderer did not make use of another game's cast. Instead it has a completely original lineup of pretty interesting characters. Shiren himself is a mysterious traveler that does very little talking, but is accompanied by a talking weasel, Koppa. During their travels, Shiren and Koppa meet many strange people, like Pekeji, Shiren's dimwitted brother that interprets punches to the face as signs of affection. There's also Orya, a seductress that has a nasty habit of mischievously blinding every guy she meets. Everyone that can join the player's party, and many that can't, have definitive personalities. There's a lot of humor and mysticism in the game that just isn't found when we're playing as a Chocobo or a Squirtle. Nothing against Wigglytuff and his (her?) friend club, but we'll take a perverted ~blind~ masseuse that can kick major butt any day.   Can the Mystery Dungeon design still hold your interest?   As with all Mystery Dungeon titles much of the focus for Shiren the Wanderer is exploring randomly generated dungeons. It's an interesting idea and it's even more interesting to see that over the past dozen or so years the formula really hasn't changed. ChunSoft certainly has managed to get the randomization thing down, but that just makes the entire dungeon experience hit-or-miss. Random does not equal good. Far too often the dungeon's exit would appear in the same room we started (or even in the very next space), thus negating any need to explore that floor, unless we wanted some items that may or may not be there. It doesn't seem like it'd be hard to program the exit to not be in the room Shiren starts in, so that we were guaranteed to at least walk through a little bit of dungeon.   Of course, the fun of the game is dungeon exploring, so we ought to be motivated to trek through each floor, regardless of exit location. Problem is, after the first time through a dungeon, items never appear there again unless you die or return to the first town. Maybe if the battle system was exciting it would be more fun to play dungeons multiple times. However, due to the turn-based nature of the game, the entire experience feels stop-and-go. Attacking enemies is a quick, no frills affair with only the minimal amount of animations. Granted, this is a port of a Super Nintendo game, but even other SNES RPGs managed to have a little more pizzazz. When we bust out a Lightning Staff or breathe fire thanks to Dragon Herb, we certainly wouldn't mind a smidge more style. We just lit some undead soldier on fire after all, give us something to ~ooh and ah~ over! There is little motivation to level up by going into the dungeon again because it's at the expense of our items and money that we weren't even earning back by going through the floors.   And here lies another problem with the game: you have to go back through the dungeons. Despite Shiren the Wanderer's quite literally linear design, players will not be able to plow, or even trod, through the game because it is so unforgiving. Leveling up Shiren is not the best way to progress, though it certainly doesn't hurt. Instead, upgrading weapons and shields is the key to success. It's a strategy that we find intriguing and has the potential to be fun, but the way the game is set up forces players to backtrack and handicap themselves. Mystery Dungeon practically requires the player to trudge through dungeons, spend money upgrading a weapon, then turn around and trudge back to the very first town (which incidentally reduces you to level one). It is the very definition of ~slow and steady wins the race.~   If Shiren dies, he loses all his items, money, gets knocked back to level one, and goes back to the first town. Essentially the player starts the game over. Sure, there are warehouses that the player can store items in that will stay after death, but then those warehouses are 5-10 dungeon floors away, at least. This isn't to say that we necessarily dislike the roguelike player punishment in the game, but the set up quickly makes the task of finishing daunting. Other Chunsoft games, like Pokemon Mystery Dungeon, made use of a centralized town so that players could easily access stored items. It also had a bank for storing money. It seems like the developers saw the benefit of that system during the decade between these titles. And while the Pokemon version has been labeled as easier because of this system, it's really a more effective way to play the game on a handheld. Shiren the Wanderer demands a significant time investment, which was fine when it was on a home console, but not on the DS.      As a way to compensate for the soul-crushing difficulty, and as a way to add a new feature for the DS version, the developers stuck in a rescue system. If a player dies, they can choose to not start the game over, but, rather, await rescue. Rescue requests can be sent to either nearby players, or just out into the internet via the Nintendo Wi-Fi Connection. From there, a friend, or just any good Samaritan, can set out on a quest to save your sorry butt. It's not the ultimate life-saver it would seem though. The rescuer-to-be has to go back to the first town (down to level 1, sucker!) and from there, work through the dungeon floors to get to you. After they do, they're teleported back to the first town. Depending on where the player fell, this feature can mean a fun side quest for a few items, or a long, tedious journey. It's a feature that's usefulness will really depend on how many people are actively checking the rescue requests. Each player only gets three rescue requests too, so it's not an effective way to blitz the game.   The brutal punishment system has a very obvious chilling effect on the player. We quickly lost any motivation to experiment or even do much exploring in the game, for fear of death. For instance, players can actually steal from the various shops in the game, but have to battle the crazy strong shopkeeper, then escape guards and attack dogs. There are a number of cool and interesting ways to do it, but the risk of dying is enough to scare us out of attempting it more than a couple times. Plus, we found that getting killed outside of a dungeon means that we could not be rescued by another player.   It's a fun dungeon crawl, but it's nothing special.   We probably would have gotten far more frustrated with Shiren the Wanderer, had it not been for Fey's Puzzles. Located in the first town is a side dungeon that offers 50 puzzles to solve. Each puzzle is a small, couple room dungeon, with the goal of making it to the exit. Since the player is at level one, most of the puzzles are about not getting hit by an enemy at all. Player's will have to make use of the items in the room, and plan out moves carefully. It not only teaches the player about nearly every item in the game, but also manages to be an engrossing brain teaser. The puzzles feel a lot more like a game of chess than any of the dungeons do, and serve as a fun respite to psych us up to try the main quest again. Plus, players are awarded items for beating the puzzles, which can be used to gear up for the journey ahead.    The environments outside of the dungeons are pretty nice for a SNES game. Each town is completely different and there are some beautiful designs. The village built into the sides of a cliff, and the one in the middle of bamboo thickets are charming. In contrast, the dungeons are bland most of the time, with very few tile sets making them up. There are a few that manage to stand out, usually ones that aren't located underground.It's a bit odd that the very things that make the Mystery Dungeon series unique are the same things that make it less enjoyable to play than it ought to be. The random dungeons are oftentimes poorly laid out, and the turn based gameplay can lead to a slow, jerky experience. Still, Mystery Dungeon: Shiren the Wanderer is a game that will certainly give players a run for their money, if only due to the fact that it takes forever to beat. The difficulty level is enough to fend off potential newcomers that are looking for an RPG to play in small spurts. It seems Shiren has two potential audiences: the nostalgic Mystery Dungeon fans, and the people that played Pokemon Mystery Dungeon, but want something a little more hardcore. And a message to the former of these two groups: Can somebody please come rescue us?", "date": "Mar 4, 2008"}