{"name": "Beautiful Katamari", "name_review": "Beautiful Katamari AU Review", "ref": "https://www.ign.com/articles/2008/03/05/beautiful-katamari-au-review", "text": "Sometimes simple concepts make the best games. Just running, jumping, swimming, flying. These are the gameplay building blocks of some of the best games of all time. Then there's a game like Katamari, build on a foundation of weird; a game where you, as a tiny alien prince, roll things up into an ever-increasingly large ball. A ball covered with cows, spatulas and ballerinas; ocean-liners, microwave ovens, and garden ornaments. And what becomes of this ball? It gets turned into a celestial body large enough to plug a black hole created during an interstellar tennis match. Of course.   Beautiful Katamari is all about the rolling process  simply because that's just about all there is to the whole game. It's your sole task, and as such, it needs to be a lot of fun and work really well. Mostly, Beautiful Katamari succeeds on both counts. Unfortunately, it also falls victim to rush-job porting process and gimped content, thanks to the developer's decision to leave portions of the game off-limits unless you fork out for Xbox Live Marketplace DLC.   If you've never played a Katamari-universe game before, there's a short, sharp learning curve that must be mastered. That is, using two analogue sticks to control just about all your movement and orientation in the field. After completing the tutorial level, The Prince is whisked away to the technicolour overworld where the ruler of the universe, the flamboyant and camp King of All Cosmos, issues you with tasks to perform. Still with me here? In practice, it's like many other platformers  you have your hub landscape (amusingly littered with obtuse objects and buildings, as in the last PS2 version of the game, We Love Katamari).     Venturing into each themed world, The King tasks you with very specific missions  create a watery Katamari covered in boats, fish and maritime objects for a Neptune-like planet, for example. The kink in the chain is, these themed objects are scattered in an environment that is littered with thousands of other objects of varying size across every available surface. Trying to scoop up solely water-themed objects is almost impossible. So, the next big hurdle is about being picky with the objects you roll into, while also racing against the clock. Generally, this is a tight time limit of a few minutes, weighed against the size you're supposed to expand your katamari to.   Suddenly, you're ploughing through a candy store countertop, latching onto lollypops, thumb-tacks, building blocks, crayons and other small objects, as your katamari gradually increases in diameter. The larger you become, the larger the object you can stick to the side of the katamari. It's this gradual expansion that causes the most headaches and makes Beautiful Katamari into something of a puzzle game too.    This focus on themed objects is new to the series  and it doesn't quite segue as well as it should, given the heavy emphasis towards this new twist on the traditional theme. For starters, as mentioned above, increasing in size is a gradual thing; sometimes your time limit is so tight that you're really forced to roll over anything in your path just to get up to a decent diameter so you can get to the area containing the highest concentration of objects that match the King's request. This, in turn, keeps your final score at the end of the level a fair bit lower than it should be. It's just a little unfair. When it works, however, it works very nicely. For example, one stage has you trying to raise your katamari's temperature to an absurd 10,000 degrees by rolling over 'hot' items  things like food, campfires and bottles of concentrated chilli sauce. At the same time, you need to avoid piles of cold items like ice cream, fans, juice, snowmen and similar. It's tricky, but it makes a lot more sense structurally than forcing players to seek out items of a particular theme on the other side of the city under timed conditions.   Captioning a screenshot like this is an exercise in futility. Look; just look at it! There's a stack of trucks for Pete's sake!  So what new features actually make Beautiful Katamari worthwhile? There's a fresh emphasis on online multiplayer, leader boards and stat-tracking that is refreshing. One of the strangest parts of We Love Katamari was the co-operative two-player mode, where you can co-ordinate your movement across two control pads, rather than with two separate rolling katamaris. This mode is back  and you can continue to ignore it, really. It's pretty much as frustrating and ultimately pointless as it ever was. The real multiplayer draw-card is the Battle mode (also available in online, four-player flavour), where you compete for the highest total of items rolled up while also trying to bash into your opponent, knocking their collection off.   The game certainly doesn't skimp on the extras  even if the single player game is rather limited in duration. Additional Time Attack and Eternal modes are unlocked after multiple play-throughs and solid scores; the latter removes the pesky time limit entirely, allowing you to max out your Katamari at your leisure (which is really where the fun lies for us).   Let's be straight here  'beautiful' Katamari it ain't. We'd go so far as to call it 'pleasant' or even 'stylish', but this isn't a title to impress your PC gaming mate with. There's a certain pleasure in rolling down the streets or over hillsides, collecting policemen holding giant paper cranes floating in a line over a field full of sumo wrestlers and toilet plungers, however. Every model looks virtually identical in polygonal and textural quality to the PS2 version  but with the addition of 720p and widescreen, you have a slightly improved field of vision. It's definitely striking  and even hilarious to watch at times  but we also can't let things like nagging slow-down slide through. Adding a small level of depth-of-field blur shouldn't cause the game to chug; Beautiful Katamari surely isn't taxing the hardware too much if it's essentially rendering a PS2 game in high-definition.   Katamari - the latest global terrorist threat.  Even if the visuals aren't up to scratch, we think the music, sound effects and hand-drawn cut-scene interludes display a quirky sense of humour and betray the very Japanese heritage of the series. The tracks are almost all bubblegum Japanese pop songs that are so infectiously catchy that you'll find yourself humming them hours after your last session. These are almost, almost worth the price of admission alone. Almost. Every object you roll over has an amusing sound effect attached to it too  as does the movement of your main character over surfaces on the overworld. The hand-drawn cutscenes are all rainbows, glitter and choreographed dance sequences, at odds with the warbling, vinyl-scratch sounds and single-frame animations pre- and post-level.   One thing that really should've been excised from Beautiful Katamari is the King of All Cosmos' continuous babbling, which pops up in the centre of the screen during play and partially obstructs your view, requiring you to take a thumb off the right stick and start hitting A to get past his inane (if fairly amusing) ramble. Why the heck his chatter can't appear at the top or along the base is anyone's guess  it got under our skin in the PS2 version and it'll bug you just as much on the 360.   It's hard to fully get behind Beautiful Katamari. Arriving very late to the party in Australia, it is a little buggy (the game's camera perspective still clips through many objects, routinely obscuring your vision) and definitely suffering from quick-job content porting (although levels are new, the objects and environments look identical in quality to the PS2. Perhaps most unforgivably, then, is that four stages are offered as DLC from XBLM  and these downloads simply unlock the content that is mostly already present on the disc. No wonder the game's single-player seems a little short. Still, it's as addictive and amusing as it ever has been, so if you can put up with the quirks and shortcomings, take The Prince for a roll.", "date": "Mar 5, 2008"}