{"name": "SWAT Elite Troops", "name_review": "SWAT Elite Troops Review", "ref": "https://www.ign.com/articles/2008/03/05/swat-elite-troops-review", "text": "Whenever a situation is out of local law enforcement's control, the Special Weapons and Tactics unit is usually called in to handle the problem. Whether it's a hostage situation, bank robbery or school shooting, SWAT can handle pretty much anything. How do they handle it? Easy. They go in, throw a flashbang and kill the guy. The SWAT leader then tells the news, ~He shot himself,~ while his team suspiciously high fives each other in the background. SWAT Elite Troops gets you in on the action as you lead your team in negotiating... with a bullet.   SWAT is a top down point of view game giving you control of three men including yourself. Your goal is to rescue hostages and take down the terrorists in a giant office building. There are 15 levels to the game. Explore everything from the basement to the level holding computer servers to the penthouse in an attempt to save everyone and rid the world of this virtual threat.    Your team has specific level goals. You have to explore the level by opening all the doors and searching for terrorists and hostages. Game play is very simple yet you have a few options at your disposal in deciding how you want to enter each room. You can select to peek thru a keyhole allowing you to see some of the next room before you enter, you can simply open the door, you can break open the door and rush in, or you can toss in a flashbang grenade and blind everyone before charging into the room. Being a player of the game Counter-Strike, I'm a huge fan of flashbang grenades. In fact, I'm trying to incorporate flashbangs into my daily way of living. If the cat throws up, I merely toss a flashbang at her and she learns awfully quick to control them hairballs. If Bob's Big Boy doesn't cook my eggs the way I ordered them, a quick flashbang into the kitchen will get those burger flippers right in order. Imagine if Mario had flashbangs, do you think Bowser would ever mess with him?   When you encounter a terrorist you just keep firing until you kill him. Some will surrender and you can walk to them and arrest them or just kill them anyway. There is an option to use a taser but I could never figure out how to use it so I didn't bother with it. You can use shields if there are too many terrorists around you. Your team moves a lot slower, but you have the added protection. Snipers will also ask you from time to time if you want them to take a shot and help you out but you only have a limited time to respond. Hostages can be rescued by walking up to them. It's important to kill the terrorists fast if hostages are in the room or the terrorists will start to shoot the hostages, which is why flashbangs are so handy. If the terrorists are stunned by one, you can arrest or shoot them before they recover. But you only get three flashbangs per level. I wish they had given us thirty flashbangs and a pair of Oakleys.    There are some mini-games as well. Most require you be successful or you'll have to restart the level which can be extremely frustrating if you've gotten really far in a level only to screw up a mini game. Hacking computers is easy. You have to match three rows of moving numbers. Resuscitation occurs when you have a man down. Bring him back by pressing the action button right as a red heart moves across the screen. The most difficult one is disarming a bomb. You have to cut the wires from the timer to the bomb. You have to cut the right ones and the wires are all twisted so you have to follow them to make sure they're actually connected to the bomb itself. Time runs very quickly and I'm not sure if I was making out to be harder than it actually is but it was a very frustrating part of the game because I'd have to start a level all over again if I failed to disarm it.    After each level you receive points that you can use to give you or your teammates more health and accuracy. You can also apply team specific points such as speed and a more powerful battery for better resuscitation. I stuck with health and accuracy and got thru the game just fine.   Graphics are really nice and you save both male and female hostages to keep any sort of hostage sexist movement from complaining to the developers. Terrorists and their guns are all animated nicely as are explosions and fire. Your team's A.I. does a pretty good job of backing you up and not  getting stuck anywhere stupid like on the other side of a wall should you take off on them. The only bad thing is sometimes you'll die during a gun fight because you're not aware of how much health you have left, even though it's indicated by a small colored triangle above your character. Health packs are scarce, but they can be found to help you out.  I was pretty surprised by SWAT Elite Troops. It was a fun little action game that was frustrating at times, but the challenge never got to be too out of control. It's a short game, but possibly worth revisiting once you've beaten it to see if you can top your current level score. And just like a real SWAT team, you shoot first and ask questions later.", "date": "Mar 5, 2008"}