{"name": "FF Crystal Chronicles: Ring of Fates", "name_review": "Final Fantasy Crystal Chronicles: Ring of Fates", "ref": "https://www.ign.com/articles/2008/03/05/final-fantasy-crystal-chronicles-ring-of-fates", "text": "Square Enix has developed one heck of a lovable habit on Nintendo DS.  For whatever reason (maybe it's the fact that there might as well be three DS units for every human on earth at this point), the company has put tremendous stock in the success of Nintendo's handheld, and continue to pump out games every few months that are almost always raising the bar for what players have seen on the Big N's system.  Of those games, however, none come with as much anticipation or all-out hype as Final Fantasy Crystal Chronicles: Ring of Fates.  We've already seen the likes of Final Fantasy III remade, and the release of Dragon Quest IX isn't to be looked at lightly, but we've known about Crystal Chronicles DS for years, and after waiting this long for it to finally release, expectations are undoubtedly high.   Square Enix is out to make the Crystal Chronicles brand a Nintendo-exclusive series, and it doesn't look like the company is going to be dropping the name any time soon.  We've got the GameCube premiere title, a DS version now, a Wii game on the way, and even a Wii Ware sim that'll accompany the download service's launch.  The company is making a huge Nintendo push on this front, but quantity alone won't get it done; there needs to be progression.  Square Enix's 3D engine makes a triumphant return.  And that's where Crystal Chronicles ends up being a double-edged sword.  Those that have been following our coverage all the while know the Crystal Chronicles embraces the same action-RPG feel, taking inspiration from beat-em-up dungeon crawlers, and also delivering the presentation and RPG feel that comes with a more mature role playing endeavor.  What it does end up missing, however, is that full sense of community you got with the GameCube game, as the core experience with Ring of Fates is a single player only affair.   For what it's worth though, the experience is still captivating and fun.  There's no jug to haul around in the DS version  Cube veterans know what we're talking about, while everyone else should just be thankful you're not ~in the know~  the front end of the game is again delivered with simply stunning CG intro, and there's a surprising amount of VO set in place.  As fair warning though, you of course get child actors to play the lead parts, and that means some high pitched, adolescent sounding tracks.  They're far from bad, and we're glad it was included, but you may find yourself turning the audio down a few notches while around a more mature crowd.  It isn't bad, it's just very kiddy, and sounds less like an RPG, and more like an episode of Pokemon.  Co-op is essential in both puzzles and boss fights.  All the core elements that we've touched on in hands-on sessions and previews have come through beautifully though, and that's a true testament to the company's devotion on DS.  There's an incredible amount of depth in combat, with the ability to combo, air attack, grab enemies, hang from flying enemies, grab other players, use touch-integrated specials, and even smash baddies into walls to find hidden items they wouldn't normally drop.  When working with a team (it's still Crystal Chronicles, so even when you're playing this one alone you can have a squad up to four on the screen at once) you can stack magic attacks, pull AI players back to your spot instantly, and manage their gear and levels accordingly.  It's unfortunate that the actual AI for the friendly units isn't stronger though, as there were tons of times when we were fighting a group of three or four enemies, and watched as our teammates sat idle the entire time.  Leveling up the characters increases their awareness, but during the beginning of the game  when players are most vulnerable  they're a bit too dumb.    Put aside all the expectations of Crystal Chronicles though, and you realize just how in-depth the package truly is.  Yes, the majority of the game has now been crafted for a single player affair, but along the way Square Enix has developed a much more engaging story (it truly makes the GameCube game look like a children's book in comparison), develops stronger characters, and has created a world that feels infinitely larger.  The opening dungeon, for example, could take some players an hour to traverse.  Luckily there's a large amount of hand-holding in the game to counteract its impressive depth, and the game constantly winks at its own use of Moogles as tutorials.  There were definite points in the story where we didn't know where to go though, and Crystal Chronicles never gets over the feeling of moving ~trigger to trigger~ in a world, just talking to people or doing precisely what's needed to activate the next section of story. But for the most part it's a truly engaging experience, complete with a seemingly never-ending amount of scripted in-game character acting, VO, and writing.  Characters always seem a bit too lighthearted, but seeing as it's a Crystal Chronicles experience (and thus aimed younger overall), we understand why it's there.  Boss battles come in all shapes, sizes, and locales.  Ring of Fates also includes a laundry list of options and modes that we couldn't possibly detail fully (without getting a publisher and book club to fund this review), but to sum up Crystal Chronicles is packed with content, both single player and multiplayer.  The magic system alone can take hours to master, as the pile system is back again in full force, there's the ability to exchange raw materials for custom weapons (a great alternative to buying generic items), there's a whole Moogle Stamp system that's basically a game-wide side quest, the classic Blazin' Caravans racer which, while not as fun as the Cube version, is still pretty entertaining as a simple Mario Kart clone, an Animal Crossing-like Moogle Painter, which lets you draw on Moogle faces and then trade them online with friends, and of course the multiplayer aspects of the game, which are extremely robust experiences in their own right.   Those looking to pick Crystal Chronicles up for the classic multiplayer experience won't be disappointed, but you might not get exactly what you expect.  For starters, the game takes a noticeable hit with four players on screen, dropping to about 15 frames per second (or far less, in some specific instances) just to keep up with all the character and enemy animation.  It's far from perfect, but if you can get over some lag issues, it's still extremely fun.  Since the game is multi-card only, you've got access to the full Crystal Chronicles experience, so you'll create your character, choose his class and stats, and save your items and equipment as you play.  You can grab a few friends and traverse any area in Free Mode, or actually head to Rebena Te Ra and get multiplayer quests, which lead to special items and equipment.  In fact, each of these quests are actually built around having a specific group of players (and classes), making teamwork essential, and giving the experience a great Four Swords feel along the way.  It's really a shame that the frame rate couldn't be locked down, as it really makes what could have been a simply incredible experience one that's a bit less inviting.  Along those same lines, we can't help but wonder why Square Enix won't take that final step into online, as nearly every DS launch so far makes use of some online modes, but never the ones we'd kill to get.  This is again the case with Crystal Chronicles.  Scripted story sequences break up the monotony of dungeon crawling very well.  On the visual side, Crystal Chronicles does a great job of pushing the DS's 3D attributes, and it's obvious the time spent on SE's 3D engine that we've seen in Final Fantasy III, Dragon Quest Monster: Joker, and Chocobo Tales.  It does still have some issues to work out, such as the frame rate issue, the very distinct digital feel to the movement  characters move in eight-way, with no in-between animations or fluidity  and there's very little physics work to make jumps or heavy attacks feel quite right.  What Crystal Chronicles does allow for, however, is a mass of effects work on top of the 3D, which is great for magic casting and special attacks.  You'll also see real-time model changes for all the equipment in the game as well, which is definitely unexpected.  It's unfortunate that there was no way to add a dynamic camera to the action though, as things get crazy very quickly on the battlefield.  All in all though, it's an enjoyable experience to say the least.  Final Fantasy Crystal Chronicles: Ring of Fates isnt the best Square Enix product on DS, but its very impressive nonetheless.  Take the original design of the Crystal Chronicles series on Cube, streamline it for a single player experience, and then rebuild the multiplayer from the ground up, and youve basically got what Ring of Fates has to offer.  Since DS is a portable, a huge chunk of the games development went to making sure that the single player offering is up to snuff, and it paid off marvelously.  Characters have real depth to them, theres a huge mass of scripted storytelling, the CG is  as always  the highest quality out there on DS, and the sheer amount of depth within the main story mode is pretty staggering.On the multiplayer side of things, Crystal Chronicles offers much more than you get with most portable packages, but it wont live up to the originals standard.  Players can link up locally and play multiplayer-specific scenarios, but the addition of each human player also brings about a wave of frame issues and overall game lag (not in the wireless, but in slowdown from too much on-screen action).  Its still an extremely robust and entertaining endeavor, complete with the same teamwork and feeling of epic co-op play, but it wont satisfy in the way a full four player story mode did on Cube.  Were also dying to get some of these Square Enix games online (especially in this case, as it would feel like a DS MMO in a sense), but apparently it isnt the cards.  Hey, at least nobody is forced into jug duty this time around.When all is said and done though, weve been watching Crystal Chronicles DS for over three years now, and the final product was well worth the wait.", "date": "Mar 5, 2008"}