{"name": "Petz: Wild Animals -- Tigerz", "name_review": "Petz Wild Animals: Tigerz Review", "ref": "https://www.ign.com/articles/2008/03/06/petz-wild-animals-tigerz-review", "text": "Ever wanted to train a lion? An elephant? A chimpanzee? Then Petz Wild Animals: Tigerz may be right for you  because this tiger-themed title has a whole host of other different members of the animal kingdom available to perform for you in addition to those big striped cats. How well they perform, though, is all up to your skills with the stylus.   Tigerz is another installment in Ubisoft's long line of Petz products for the Nintendo DS, but it's also a member of the ~Wild Animals~ line. That sub-series launched last October with Petz Wild Animals: Dolphinz, and established itself quickly as a breath of fresh air for the too-often tedious virtual pet genre on the system. Tigerz continues the trend, as, like Dolphinz before it, this is a game that transcends its branding and package design and asserts itself as a solid and fun standalone experience that could well have been marketed successfully as a one-shot game, unconnected to any of Ubi's other products or their unnecessary letter Z's.   In fact something like ~Globetrotting Circus Animal Trainer~ would have been a more appropriate name for the game, as this design is split into two different halves  the first half is the traditional virtual pet play where you take care of baby tigers, but the second, surprisingly deep and compelling component of the experience is a storyline-infused adventure that takes you around the world to meet and train a variety of different performing animals. You'll help bears learn to balance on balls in Russia, motivate a monkey to put on a killer half-time show at a football stadium in Los Angeles, smooth out the rough edges of a tight-rope-walking cat's high-wire act in France, and more.   He might look a bit like a villain, but that guy in the circus suit is actually your good old Grandpa Antonio.  The scenarios are all wacky and engaging, and are hosted by equally ridiculous human owners for each of the ailing animals you're asked to assist  and just like in Petz Wild Animals: Dolphinz, the humans are all presented in comical, hand-drawn style and come equipped with several bits of witty dialogue.   The gameplay is unique. As you're training an animal up on the top screen, the bottom touch screen displays a ~balance wheel~ that you have to carefully spin back and forth in order to keep the current creature from taking a tumble. If you don't maintain their balance, for example, the Soviet bruin will fall off his ball or the French feline will slip from her tightrope  and you'll lose valuable time. If you successfully maintain each animal's balance, though, then the gameplay will transition into its next phase.    There, you'll have to complete a second touch screen activity like rhythmically striking numbered icons in sequence, tracing fast patterns on the screen or drawing circles as quickly as possible. If you're able to quickly and accurately complete every portion of the training task, you'll get a high score, earn the praise of your customers and be rewarded with experience points and items. Your trainer characters ~level up~ in RPG style as the game progresses, so it's important to do well early on  the experience you'll earn in early stages is vital for increasing your abilities to the point where you're equipped to tackle the lategame's more considerable challenges.   The globetrotting training gameplay is such a fun part of the package that it's actually a bit annoying when you complete a mission, because then you're taken back to your home base and asked to care for your two pet tigers. The virtual pet caretaking isn't bad here, as it also innovates beyond other pet genre products available elsewhere on the DS  but it can get repetitive, as you continually need to bathe, groom and feed your tigers through mini-game designs that don't change over time. Honestly, I found myself ignoring the tigers more often than not just so I could get back to traveling around the world and training more animals, because that's the real draw of the package.   And wrapping it all up is the on-going construction of an exotic animal nature preserve, headlined by your once-glorious grandfather Antonio Zapardo (who has since fallen from grace). It's another aspect of what it already a robust experience, and again brings to mind memories of the aquatic entertainment park that served as the setting in Petz Wild Animals: Dolphinz.Developer Magic Pockets has done it again with Petz Wild Animals: Tigerz, as style, story and compelling gameplay come together to create another fresh and engaging experience for the DS. Taking care of your virtual tigers is a little too tedious and often feels like it's breaking the flow of the game  it could have been an optional element instead of a required activity. But the larger, more focused globetrotting animal-training scenario is a joy, and lots of fun. No other DS game lets you teach a bear to balance itself on the back of a chair. That's just straight comedy.", "date": "Mar 6, 2008"}