{"name": "Milon's Secret Castle", "name_review": "DoReMi Fantasy: Milon's DokiDoki Adventure Review", "ref": "https://www.ign.com/articles/2008/03/10/doremi-fantasy-milons-dokidoki-adventure-review", "text": "After a stern hiatus of several months, North America's Virtual Console has finally received a few new entries into its Wii Shop's Import category  and leading the charge across the Pacific is this game, DoReMi Fantasy: Milon's DokiDoki Adventure. American gamers have never had the chance to own this one before, though they may be familiar with its predecessor, Milon's Secret Castle. And if they're familiar with that, then they're familiar with its nonsensical style of play.   But, luckily, Milon's DokiDoki Adventure is not nearly as abstract or inaccessible as Milon's Secret Castle was. In fact the two titles seem to have little in common beyond the hero  Milon, a young boy in blue clothes who uses bubbles to trap his foes. He's still here, and he still blows bubbles, but most everything else is different. Where Secret Castle was drab and dreary, DokiDoki is bright and cheerful. Where Secret Castle was confusing and restrictive, DokiDoki is straightforward and feels wide open. It's quite a bit of a change, and one that makes this game certainly worth a look.    The gameplay offers straight-up platforming action as you guide Milon from one side-scrolling stage to the next. You can blow bubbles to capture foes ahead of you, and then eliminate the enemies altogether by running into the bubbles. You can also jump off of enemies' heads to stun them, then bounce off for a boosted jump. Collecting floating music notes ultimately earns you extra lives, which you may need one or two of when you find yourself coming to one of the game's big boss battles.   Milon's challenge factor is low in this sequel. Extra sets of clothes (that grant extra hits) are found all over the place.  It's a simple and easy-going platformer design, and it's quite a bit of fun to play. Things get more complex as you progress through the Adventure's seven worlds, as Milon ends up gaining new abilities when he collects the game's five hidden magical instruments  but each added power feels natural. No aspect of the gameplay is confusing.   But pretty much all of the presentation is. Be ready to scratch your head in bewilderment as soon as you encounter any of DoReMi Fantasy's menu screens or dialogue windows, because absolutely everything is still in Japanese. Everything. All of the conversations with other characters in the game, all of the item descriptions, all of the gameplay explanations. This game is an import, that's for sure  and you'll never get a chance to forget that.   It's a bit confusing and unfortunate that the game would be allowed to go on sale in North America without any kind of attempt at a translation at all  one, because translations for this game already exist (as created by dedicated fan communities) and two, because it occasionally harms the player's experience while playing. There are text-only questions presented to you during some mini-games and conversation scenes, and it's just a game of random guesswork to pick an answer choice when you have no idea how to read what you're picking.    This is especially disappointing considering that Sin & Punishment, a previous ~Import~ release for the North American Virtual Console, actually was given a partial English update to make it more accessible before it went live in the Wii Shop. Where's that extra effort this time, guys?   It's not a dealbreaker, but it is disappointing  I would have liked to be able to read what's happening in the game, especially in conversation scenes that feature cameos from other Hudson mascots (like Bomberman). DoReMi Fantasy looks amazing and sounds great, too, so that also lessens the blow of the overly oppressive amount of intact Japanese text.It seems like Hudson's little boy in blue just can't seem to star in an all-around accessible adventure  Milon's Secret Castle on the NES was confusing because of its abstract gameplay, and now Milon's DokiDoki Adventure from the Super Famicom is confusing because of its completely untranslated Japanese text. But don't let yourself be totally turned off by the fact, as DoReMi Fantasy: Milon's DokiDoki Adventure is still a solid, satisfying and simply fun 16-bit platformer even if it's not in English. The gameplay's always the most important aspect of a game, and this release won't burst your bubble there.", "date": "Mar 10, 2008"}