{"name": "House of the Dead 2 & 3", "name_review": "House of the Dead 2 & 3 Return Review", "ref": "https://www.ign.com/articles/2008/03/11/house-of-the-dead-2-3-return-review", "text": "Between the arcade, Dreamcast, and Xbox versions of House of the Dead, we've personally put enough time into the series to justify a trip to the psych ward.  In short, these titles arm you with weapons and ask you to blast hordes of zombies from the first-person. The original release was nothing to write home about, but we remember blowing through the game during our first time in front of the cabinet.  That tradition carried on with House of the Dead 2, 3, and 4, and it didn't end in the arcades, as House of the Dead 2 released on Dreamcast, and House of the Dead III on Xbox, both purchased along with two light guns, and promptly destroyed over, and over, and over again.  When we first heard about Wii's ability to do IR, light gun games came to mind, and we remember praying that SEGA start releasing its classic light gun games in compilations for everyone to enjoy, whether it be an updated remake or simple port.   The House of the Dead 2 & 3 Return is a compilation of two direct ports, and not much else.  For a quick $30 players can pick up this two-game set, grab a couple Wii remotes, and blast though the 1998 House of the Dead 2, and 2002's House of the Dead III (now renamed to ~3~) respectively.  We'd suggest grabbing a friend for these two classic arcade experiences, but with the ease of the Wii remotes it's also extremely rewarding to grab one controller in each hand, and dual-wield like you always dreamed of doing in arcades.  It was never worth the extra token back then, but that's the beauty of owning these suckers.  These are great games.  They're also old, expensive, unchanged great games.  So why not include the original House of the Dead in the compilation?  It's quite simple really.  House of the Dead 2 & 3 is in all ways a quick port, and not something that SEGA spent any serious time and cash on.  House of the Dead 2 is a simple move over from DC, and it looks and runs just like it did a decade ago, while House of the Dead 3 is a port from Xbox, though it looks to have a bit of a graphical hit at times, and does slow down during streaming loads.  Our guess is that the original House of the Dead wasn't included because, quite frankly, it hasn't been ported to any other system in the past, and it wasn't worth the time.  With that being said, players aren't missing much, as the first game wasn't exactly an amazing experience, and disc space issues may have sacrificed quality on House of the Dead 2 if all three were crammed into one box.   In general, House of the Dead 2 & 3 Return is a fun little package, just as long as you don't mind dropping the still-high asking price of $30 bucks.  House of the Dead 2 includes both Arcade and Original mode (the latter of the two is a deeper, almost Umbrella Chronicles take on the original arcade mode), while House of the Dead 3 features the original arcade mode as well, this time also adding Extreme Mode to the mix, which includes quick motion slices and tougher enemies.  When all is said and done though, the House of the Dead 2 offering is stronger in our opinion, as the visuals are crisper, the framerate holds up, and the game is stronger overall.  It's a classic.   Aside from the new Extreme Mode, House of the Dead 2 & 3 Return isn't as robust as SEGA's Ghost Squad offering on Wii, and anyone expecting even that level of detail and depth into the package is going to end up disappointed.  What House of the Dead 2 & 3 Return does accomplish, however, is the offering of the strongest Wii IR we've seen in a gun game thus far, as the cursor is quick and responsive, and the IR calibration sights the Wii remotes in perfectly.  For some reason we've yet to see other companies (Nintendo included) put in an advanced calibration mode for the Wii remote in any game, and for a while we assumed it was just too complex to do in general.  House of the Dead 2 & 3 Return proves that it isn't a matter of technical limitations, but just a lack of attention to detail, as a quick shot in the corner of the screen instantly syncs the Wii remote's pointer perfectly with the intended position on the TV.  You can even do it mid-game for either player.  Return might not be an award-winning port package due to a lack of depth and a few technical issues in HotD3, but it'll go down in Wii history as the first IR game that got it right.  Kudos, SEGA, the standard has been set.     It's also important to note that, while lacking as a total package, House of the Dead 2 & 3 Return is still made up of some great content, so if you're a fan of the originals, or have seen them in arcades and want to check them out, Return isn't some joke of an offering; it just needed more.  Both games have branching paths, awesome boss design, some great enemy spawns and orchestration to give it a rollercoaster-like experience, and it's worth noting that House of the Dead 2 received a 8.7 on our Dreamcast site, and House of the Dead 3 a 8.1 from our Xbox team.  These were great games in their time, and are still both extremely fun to run through with a friend.  With that being said, there needed to be something more that this collection added, and Extreme Mode is just scratching the surface.In fact, with IR calibration working its really a shame that the rest of the package isnt as impressive.  Visuals are unchanged on House of the Dead 2, we mentioned the brief slowdown issues in House of the Dead 3, but aside from that the games still only run in 4:3 display, again evidence of a quick port.  The audio is unchanged as well (and classically crappy as it is, we would have thrown a fit of the corny voice acting was taken out), and in the end youve got the most stripped down and basic compilation out there.  In fact, its a bit of a kick in the pants when you consider that House of the Dead 3 is the more lacking of the two games this time around, and on Xbox House of the Dead III had a special unlockable version of none other than House of the Dead 2.  Not only is Return a port of two games nearly a decade old each, but a technically and visually superior version of this package already existed six years ago.  SEGA has nailed IR control though, so the door is wide open for a stellar, Wii-exclusive original light gun game at this point.  Cmon guys, lets see it.", "date": "Mar 11, 2008"}