{"name": "Street Fighter EX 2 Plus", "name_review": "Street Fighter EX 2 Plus", "ref": "https://www.ign.com/articles/2000/06/16/street-fighter-ex-2-plus", "text": "Having been subjected to the rather large amount of butt that was  Samurai Showdown: Warriors Rage , I felt rather compensated when I popped a final copy of Street Fighter EX2 Plus into my PlayStation, and watched it hungrily chomp away at the binary goodness help within the disc. Having already experienced the first efforts of Arika's 3D translation of Street Fighter, I more or less knew what to expect. Street Fighter EX Plus did a fantastic job of taking a 2D fighter and preserving almost all of it's elements in a 3D world, yet added it's own gameplay twists to the mix that completely accounted for the name shift. So it was neigh-reckless abandon that I tore into this version, and I'm happy to say it passed with flying colors.   Gameplay The sequel adds a few more gameplay bonuses to thicken up the action, but for the most part, Capcom and Arika have done something more important: the original EX wasn't broken, so they didn't try to fix it. Sure, a few of the characters have been tossed in favor of some new flavor, but for the most part, you won't be busting brain cells trying to learn new combos. Overall the game just feels more solid, both in part because of the slightly improved graphics and sound, and that intangible feeling that you get when a developer has spent some time with the hardware.   As I mentioned before, a few of the characters have been given the boot. EX Plus faves (at least in my book) Kairi and Sakura were kicked to the curb in favor of a few newcomers: Volcano Rosso, Nanase, Sharon, and Area. For those of you who insist on playing as one of the classic SF characters, fear not, cause the gang's all here. And thanks to the tried-and-true quarter- and half-circle special moves, whipping out four and five hit combos will seem like second nature.   Anyone who hasn't played any of the games in the EX series are going to need a little time to adjust. The controls and combo system take a bit of getting used to, but thanks to the training menu's trial mode, the learning curve is about as gentle a pace as you could hope for in a new fighting game. The trial mode first introduces you to the basics of the EX combo system by starting you off with the special moves, then the supers, then slowly works in chain combos. It's a fantastic system, and it's done in a slick mission-based format. Each character has 15 lessons or missions, and suffice it to say that if you can pull off all the missions for even one player, you'll know their moves like the back of your hand, not to mention the timing required to pull of chain combos with any of the characters.   And, for those of you jonesin' for some Speilberg-type antics, you can now direct your favorite fighter however you want, thanks to the director mode. Simply pick your fighter and opponent, both players' health, and length of recording (up to 25 seconds), and then begin recording. When the battle is finished, simply step through the recorded fight, placing cameras as you go along. Pick your camera angles and lens options (like focus and zoom) via a simple, easy to understand editing interface and BOOM, welcome to Hollywood! Of course, if this is all too complicated for you, you can simply let your PlayStation do all the work via the game's Auto Edit mode. Sure, the recording length isn't all that long, and the only real time you'd use this is if you were good enough to really unleash a recordable barrage, but for experienced players, this simply adds yet another feature to keep you coming back.   As for the actual action itself, nothing has really been changed, and that's a good thing. The EX series' combo system is near-perfect for accomplishing what does, and any attempt to radically change the execution would be foolhardy and completely unnecessary. There has been a small addition, however to combat: the excel mode. By using up some of your combo gauge, you can launch into a mode where all of your attacks are kicked into hyperdrive, making simple punches and kicks a now lethal barrage of combo devastation. Returning is the guard block, which can be used to stun your opponent, opening them up to a combo flurry (at the price of a chunk off your combo gauge, of course). While not insanely useful due to the fact that it sucks off a section of your combo meter, it can be used to stun your opponent and leaving them unprotected against a flashy combo finish.   Graphics Out of all the 2D-turned-3D fighters out there, EX2 is easily the prettiest. The first game, while nice looking, Had models that resembled what looked like Max Headroom's body; all blocky and sharp-edged. In contrast, the sequel offers smooth edges and textures that while not amazing, fit perfectly, yet again proving that less can mean more. The floors use an interesting technique on most levels, often fading into black at the edges, so the end of the 2D plane will segue seamlessly into the background.   Likewise, the backgrounds, while still dithered and rather boring, are markedly improved. They're now animated in some scenes, and display for more detail that the last game. For instance, in a jungle level (levels aren't really character specific, but I would equate it to something out of Blanka's Brazillian level) vines are seen growing all over everything, while a detailed pagoda lies nestled between two huge masses of vine. It's not amazing to look at, but time was taken to ensure that should you decide to look behind the fighters you won't be disappointed. About the only time I was seriously disappointed was when I took a glace at the background during a high flying combo, and noticed that it simply repeated horizontally.    Animation freaks will notice that many of the animations from the 2D games have been carried over into 3D, whether it's a simple dust-off of Ryu's pants, or the frame-for-frame perfection of Blanka's fierce kick flip. In fact, that fact that the characters are in 3D means they can do things that weren't possible in 2D without many extra frames of animation, such as hits that rock the opponent so hard that they are spent flying, spinning as they fall. While not as beautiful or fluid as some of the animations in the 2D Street Fighters, they are done well.   Simply put, the graphics in EX2 are exactly what they should be over their predecessor: improved. From animation to texture work, everything shows a noticeable upswing in quality.    Sound You can only hear ~Ha-do-ken!~ so many times before it just gets old. But, if we must nit-pick, the sound effects are good. They don't benefit from the enhanced aural techniques that are used in the 2D games like Q-Sound, but they're still good nonetheless, with clean, clear smacks and distinctive speech for each of the characters.   The EX series' music has always sounded a little nutty, a lot like what you'd hear if a elevator music muzak composer were on speed and decided to compose. The songs are plucky and fit their levels, but are usually rather complex in areas that don't need them. EX2's music is thicker and more well-rounded than the first game, but it's not necessarily better. If you can stomach the rather simplistic instruments and repetitive beats, it's definitely tolerable for extended play.  Recently, certain now-defunct US branches of big Japanese companies have tried to take their games into 3D, and have failed miserably. Heck, even Capcom hit a critical roadblock with Mega Man Legends. Street Fighter EX2, however, is a perfect example of how to do it: preserve the nuances of gameplay and graphics that have made the 2D title great, but add a little innovation to the mix to make it a worthwhile purchase. In all these areas, this game shines. Head on down to your local video store and snag a copy. If it floats your boat, don't wait any longer, nab the game for extended play at home.", "date": "Jun 16, 2000"}