{"name": "Beach Head 2000", "name_review": "Beachhead 2000", "ref": "https://www.ign.com/articles/2000/06/21/beachhead-2000", "text": "In the olden days of gaming, when gas was a nickel a gallon and computer games still came on floppy disks, there was a game called Beachhead. It was basically a Missile Command type of game where enemies attack you in waves and you need shoot them all to advance to the next level. Beachhead took the point of view of a turret on a beach while troops flooded onto the beach to take you out. Well if you liked that game, then you'll probably like to take a trip back into the past with Beachhead 2000.  Once again, you somehow get stuck as the lone gunman stance on a beach that is under assault. Probably something to do with getting caught ~talking~ to the general's daughter. Sadly, you will need to defend the one strip of beach that vehicles can land on with just your 30mm gun, your anti tank (AT) gun, some missiles, and if you run out of all of your ammo, a handgun. Thankfully some nice officer with a soft spot in his heart for the lone man against overwhelming odds has seen fit to send a cargo ship to you to drop off medical supplies and more ammo. That really is it though. There really isn't all that much to this game.  Various types of enemies will storm the beach including companies of soldiers, tanks, APCs filled with soldiers, attack helicopters, fighter planes, bombers, and troop carrying helicopters. The amount of troops that need destroyed and the pattern of attack changes and gets more difficult as you increase in level.  The actual control took a little bit of time to get used to, but it got to feel pretty smooth after I had played the game for a while. Toggling between weapons is quick and easy as it should be as there are only three selectable guns and your missiles are fired with the m key while in any of the gun modes. The biggest problem that I had with the game had to do with targeting flying objects. Did I say targeting? I shouldn't have. You basically point yourself towards the plane you want to shoot down and the missiles seek it out. I found after playing for a while that some of the time, the missiles seem to have a mind of their own and fly by the target you wanted to hit something far off in the distance. There doesn't really seem to be any rhyme or reason for that to happen which got to be very annoying.  The game has a price tag of $20, which isn't terrible, but you really do get what you pay for. The graphics in this game are not the best you'll ever see. But for some reason, it didn't really bother me too much. They are simple and a little ugly, but get the basic job done. The sounds were also very basic and unimpressive. And if you have certain sound cards, you have to turn off your 3D sound acceleration for the game to work. They don't give a list of what the cards are in the manual, but I can tell you that the Vortex AU8830 on my machine didn't work properly so I had to play on another computer to really get the sounds.  And in the case of this game, I'm really glad that the graphics and sounds weren't more lifelike than they are. If the animations and effects had been more realistic, I think I would have been a bit disgusted by this game. It really is just about mowing down as many people as possible in a given amount of time. It is a bit like the first scene in Saving Private Ryan, and if it wasn't for the unbelieveability when it comes to the sheer amount of troops that you can wax by yourself, it might get the thumbs down for just being a tacky idea for a game.  This is when I start being hypocritical and tell you that even with that in mind, this game is strangely addicting just like Missile Command used to be. There is just some kind of call when you play a game that makes you think you can go just one level more. That your reflexes and hand-eye coordination is good enough to get you past the next flood of enemies. The good thing about this game is that the levels are very short and last only for a couple of minutes. This means that you can just play a quick game for a break without having to worry about needing to save or anything because you can just jump in again later. So if you're looking for a cheap game that doesn't require much thinking, and you can get past the striking similarities to the opening scene of Saving Private Ryan, this may be a winner for you.  -- Dan Adams", "date": "Jun 21, 2000"}