{"name": "Trick Boarder", "name_review": "Trick Boarder", "ref": "https://www.ign.com/articles/2000/06/22/trick-boarder", "text": "A few months ago we Game Boy Color gamers were subjected to a portable rendition of Tony Hawk's Pro Skater from Activision. Putting in Trick Boarder from Natsume gave us a definite feeling of dj vu. Know why? Tony Hawk was developed by Natsume, as was Trick Boarder, and it seems Natsume used the same engine for the skateboarding game as it did for this snowboarding game  or vice versa. Whatever the case, the engine works better for Trick Boarder than it did for Tony Hawk, which makes for a slightly more enjoyable experience. But only slightly. Features Eight different boarders Nine tracks Link cable support for two players Only for Game Boy Color  Like Tony Hawk, Trick Boarder has eight unique boarders to choose from, each with their own style of play  their attributes have been divided into three classes: Acceleration, Spin and Jump. To succeed in the races means to pick the proper boarder that's well suited to your play control.  And that's really all that Trick Boarder is  a race. The game is a fixed top-down race where snowboarders shush down (or rather up) the slopes avoiding obstacles that'll knock over or slow down your boarder and add unwanted ticks on the race clock. Tapping up on the control pad will offer a boost of speed, but only if they're in reserve  these boosts can be acquired by simply skiing over them. Unfortunately, the collision detection on picking up powerups is not sensitive enough  the snowboarder literally has to drive his mid-section over the icon to collect it. This makes skiing the challenging tracks a lot more difficult, especially since there are other boarders on the same track to add more screw-up elements into the mix. Riding on the rails gives the boarder an extra boost of speed, as does maneuvering through slalom gates. The game doesn't penalize you for not pulling off these moves, but it's really the only way to play the game  simply racing from point A to B isn't going to cut it in this game. You have to actually pull off a few risky maneuvers.  There are three modes in the game, but only one real way to play the game. The Grand Prix mode is a challenge over all nine tracks. The time trial mode is the option to test your skills on any of the game's slopes. And Multirace is the option if you want to race against a single opponent, whether he's computer controlled or a human player via link cable. And the link cable mode is very tight  the only annoyance is the same one that plagued Tony Hawk on Game Boy Color: pull off a specific trick, and the game will pause both systems to show a still slide of that move in action. Funny thing in Trick Boarder, Natsume actually drew up animation frames to portray a few moves off of jumps, like a full 360  but the game still insists on showing stupid still slides for some of the more sexy acrobatics. That's a real bummer.  This game is better suited for snowboarding for one simple reason: believability. I slammed Tony Hawk on the Game Boy because while the consoles got a full 3D environment, the portable version was a point-A-to-B race. This style of gameplay works more for Trick Boarder because, well, snowboarding isn't a ~ski anywhere~ sport  you can't turn around and ski back up the hill, now can you? The game is still a bit drab and loses its flair quickly because there isn't a whole lot of variety, but it's been balanced a lot better than the skating was in Tony Hawk. I just wish the cool halfpipe of Tony Hawk GB was also added to Trick Boarder in some fashion.   Probably the best element of Trick Boarder is its price  it's $20 bucks retail, ten bucks cheaper than the usual Game Boy Color fair. That's definitely a plus in my book, and makes Trick Boarder a somewhat better purchase. The game isn't a fabulous game, and it does get a little mundane due to the lack of variety in gameplay. But it is fun for a bit, and the two-player link cable mode is worth a look.", "date": "Jun 22, 2000"}