{"name": "ISS Pro Evolution", "name_review": "ISS Pro Evolution", "ref": "https://www.ign.com/articles/2000/06/23/iss-pro-evolution", "text": "The Playstation has seen its fair share of soccer titles. The question on most gamers' minds (especially in light of FIFA 2000) is invariably ~Do we really need another?~ Konami hopes we do.  ISS Pro Evolution is their latest football offering, but not the last. Konami is bringing out yet another soccer title for the states in about a month with the Major League Soccer license.   So what is this title doing on the market? Good question. It is a shadow of former ISS releases, it carries no license of its own, and is at best a mediocre effort on all fronts.   Perhaps if this was the first soccer we have seen for the system, it would be passable. But there is a storied history of great soccer games on the PSX, and this one doesn't measure up well. When compared to truly superior soccer titles like the ISS offerings for the N64, Pro Evolution falls well short.   Gameplay Since Pro Evolution does not have a license, you have the chance to guide a bunch of made-up players through a single match, league or cup. There is no World Cup here. Nay, not even an MLS Cup. Here we have the International Cup, Konami Cup, European Cup, African Cup, American Cup and Asian Cup, none of which officially exist in the world. Of course, these things could be overlooked if the game was super-fun to play. But it isn't.   ISS has previously been all about gameplay, but this time out, it seems completely forgotten. The controls are unresponsive and difficult to master.    That is, when you can assume control. Pro Evolution follows a disturbing trend in soccer games: automatic player switching. When on defense, the computer selects the player you control. It always selects the player closest to the ball, eliminating the possibility of cutting the angle to the goal with a further-off player.   That is unnerving enough, but set plays are twice as bad. There is no arrow or other directional demarcation to show where a throw-in, corner kick or goal kick is going. You just have to point the front of your player at a general area and release. This takes the advantage away from such plays, which is a sin.   The one nice feature of the control is the addition of the through pass. It allows you to pass to a cutting striker who is breaking through the line. The through pass is the only feature of other ISS titles that seemed to survive, and happily so. It is a beautiful thing.   More generally, the game feels a tad slow. After playing a session of ISS on the N64, I returned to Pro Evolution and found it lacking spunk. The players feel as if they are floating above a field of grass rather than interacting with it. It is static, not kinetic. You can manipulate the speed of the game, of course, but even on the top setting it is unimpressive.   Pro Evolution allows customization of teams and players, but it does not offer team creation or trading. You can change hair color, build, height, skin color, player number and name. A few features could have made this more comprehensive (different face shapes, for instance), but the Edit Menu is just another example of this game's lackluster attitude.   Graphics I must say, the opening of this game is unbelievable. Beautiful animations of player movement are inter-cut with split-screen silhouettes against colorful backgrounds. Hands down, this is the best part of the game.   In fact, the graphics are uniformly good, definitely on par with the top soccer titles for the PSX. The character animations are fluid and realistic. Players are crisp and well-rendered. They are best viewed on the Zoom camera, although it is not the camera to play with.     My only gripe with the graphics is that characters have the same general look. There are relatively few discernable body types, and there's only so much you can do with mustaches and haircuts.   Sound There is little to say about the sound, because there isn't much in the game. Outside of the general din of the crowd, there is little to speak of. The commentary is all but absent. Once in awhile, the announcer will interject to tell you a corner kick is going to happen. Thanks, buddy.  As with speed, commentary can be turned on to little effect. You can also toggle player name calling on. But since these are a bunch of guys no one knows about, that is an exercise in futility. I was excited to play this after getting into other ISS titles. Bottom line, this game was a letdown. It doesn't even begin to measure up to FIFA. It isn't even as much fun as Infogrames Striker Pro 2000. There, I've said it. Save your money for the promising MLS title coming out in a month.", "date": "Jun 23, 2000"}