{"name": "Sim City 3000", "name_review": "SimCity 3000 Unlimited", "ref": "https://www.ign.com/articles/2000/06/27/simcity-3000-unlimited", "text": "Let me start by pointing you to the review of SimCity 3000, from way back when. SimCity 3000 Unlimited has everything 3000 does, and more, which is obviously from where it derives its name. If you're not familiar with the series, and thus have been living in the desert for the past decade, I'd suggest reading through that one. The manual is thick, the box is pretty, and the options are many, but I want to focus the review more on what they've added, since they haven't changed much from SC3K.  The first thing you'll notice upon loading the game up is that the menus now have some extra options in them. Most noticeable is the ~Play Scenario~ option of the main menu. I've always thought that there was no real goal in the SimCity series  you build the city, it grows, you throw in a few natural disasters, and keep on building. The scenarios are a nice addition to the tried and true ~Chia City~ formula. These scenarios are pre-built cities that have certain goals or parameters tied to them. You load them up, and as Mayor, it's your job to either achieve those goals or maintain the city within the given parameters. It actually gives the game a feel similar to that of Pharaoh, which is a good thing.  Another new feature is the addition of whole new graphic themes for the game. This is really a neat enhancement. Along with the buildings you're used to seeing in SC3K, you have two new sets of buildings to choose from. There's one that can only be described as European  you'd know what I'm talking about when you see them, and another that is very reminiscent of Japanese architecture. They certainly provide nice variety. You also have the option of changing the way trees appear, altering the terrain to fit your tastes, and even give yourself different backdrops  say, a desert-ish area or a winter terrain.  Within the game there are a few notable additions. The first is the new category of buildings to add, Landmarks. These were available in SC3K, but contain, you guessed it, even more famous landmarks from around the world that you can place in your city. At one point one of my cities contained the Pyramids of Egypt, the Washington monument, Westminster Abbey, and the Taj Mahal all on the same street. They've also added some new (and fun) disasters to the game, the best of which are the ~Space Junk,~ which drops satellite and other questionable debris from space on to your city (a la Armageddon), and ~Plague of Locusts,~ which, well, releases a plague of locusts on your city, in case you feel like getting biblical on your sims. Incidentally, the locusts can be stopped via crop dusting airplanes, which are summoned up the same way emergency units are dispatched.  Then there is what Maxis calls the ~SimCity Exchange,~ and this is where the replayability really kicks in. The exchange is an online repository, accessible through the start menu that is a massive database of player-created scenarios, buildings and cities that are available for download. You also have the option of uploading some of your custom buildings, or perhaps uploading a city that you're particularly proud of for everyone to see. I stopped by the site to see what they had to offer and was greeted by a simple registration script and a whole host of downloads. New landmarks, new maps, scenarios and scenario scripts, and entire user-submitted cities and buildings grace the website.  My adventures with the game went as they usually do with these games. I've never been very good at managing my city, and the word ~slums~ popped up more than once, even when I was still at zero population. So you can imagine that by the time my population had hit 1000 I had a big dumb grin on my face. The feeling of SimCity is here in the unlimited version, just as it was in SC3K, and the previous games before that. This, of course, is a good thing, since without it I would get bored very quickly  the ~civil war sim~ effect, if you will.  Fortunately, the game was ridiculously pretty for a 2D game, and the addition of the new building sets gave it some variety. The building creator was the nicest of all though, and I've already begun plans for chains of buildings that, when placed next to each other in a row, create examples of modern art. Perhaps a bunny rabbit, or a tribute to Mr. Pickle, either way, it really does make you feel like you're creating your own city. The building editor isn't too hard to learn, but it does take time to create some really nice buildings.  I do have a few minor complaints. First of all, the music in the game: I liked the tunes, don't get me wrong, I thought they were catchy and they fit the light-hearted feel of the game perfectly, but ever since I learned how to put my own MP3 files into ~the Sims~  I guess you could say I've been spoiled, that's all. I really think that would have put the customization level over-the-top.  Another problem, and I didn't notice this as much on SC3K, but there is a LOT of slowdown in unlimited on my system. I would attribute it to the fact that there are a lot more in the way of 2D graphics on the screen at one time, and I'm ~only~ running a P3/450. Still, if that is the case, I feel sorry for anyone who tries to run it on the minimum requirements, let alone the recommended ones. The bigger the city, the worse the slowdown, and it gets pretty bad at some points, with the screen going every which way at once. I ended up approximating where the cursor was going to be and hoped I clicked the mouse at the right time. Related to that, load times on saved games of large cities are horrendous. I didn't mind, since it gave me time to make a sandwich or order a pizza, but if I were just sitting in front of my monitor it would be pretty dull.  I managed to look past my gripes and I do enjoy the game. ~Unlimited~ is definitely a fitting sub-title for this game. I had gone into the game expecting to thoroughly slam Electronic Arts for releasing an ~update~ as a whole new full game. However, with all the options available to players, the added building sets, the scenarios, the create-your-own building feature, all the goodness from SimCity 3000, some tutorials thrown in for new players to even out the package, and the literally unlimited amount of cool stuff available on SimCity Exchange, it's certainly worth picking up.  -- Matt Hanyok", "date": "Jun 27, 2000"}