{"name": "Iron Soldier 3", "name_review": "Iron Soldier 3", "ref": "https://www.ign.com/articles/2000/06/28/iron-soldier-3", "text": "Giant robot sims on the PlayStation have historically been dominated by From Software's Armored Core series, which is a bit odd considering how they deviate from the genre's established conventions.  Its PC and console roots are in slower first-person games like Mechwarrior, sim-oriented sorts of games.  The reigning king of the genre, however, is probably still Game Arts' Gun Griffon, whose combination of sim control with a first-person shooter's speed made it the most slick and addictive game of its type around.  Iron Soldier 3 doesn't quite compare to that Saturn classic, but it does have some of its hybrid feel, and it's still a kick to play.  IS3 looks good, sports a nice selection of weapons, and it's playable enough that you don't get bored by all the wandering around and crushing things.  Hey, why should you demand so much from a giant robot game?  IS3's graphics are remarkably faithful to its Jaguar roots.  In case you were wondering, that's a bit of a compliment.  One of the first two Iron Soldiers' finest qualities was the destructability of the environments - if it stuck out of the ground, you could probably blow it up, and the explosion animations were jim-dandy (sorry, something about this game makes we want to say things like that).  The IS3 3D engine seems very similar to its predecessors; most notably, the buildings come apart in much the same way.  Big chunks collapse in a heap, little bits fly in all directions, cool lighting effects illuminate the surroundings, smoke and fire spew out - these are quality 32-bit explosions, which is obviously an asset in this type of game.  The modern-age update also results in a sharp increase in texture detail, as well as an improved framerate.  Outside the pyrotechnics, IS3 doesn't look especially distinguished, with its fairly uniform color palette and relatively basic polygon models, but the graphics get the job done, moving forward at a very playable clip.  Some of the enemies look pretty nice, as well - little helicopters and variable-thrust fighters flit about and blaze away with their missiles in satisfyingly mosquito-like fashion, until you swat them down with your heavy weapons.  Bullet-holes and burn marks in damaged features of the environment are another nice touch, and every so often the weather will become evident, as a light rain or snow falls.  The controls are very simple and straightforward: move, aim, swap weapons, and jump if your mech has the capability.  You can use the analog sticks to control your movement and aiming crosshairs, but I found them a little too loose.  The D-pad works a bit better, allowing you to zero on your targets more precisely.  Your mech can move in both forward and reverse gear, and the three different models have very recognizably different speed characteristics - quick ones hop around the battlefield with ease, and the heavy Iron Soldier model stomps in classically sluggish fashion (interesting graphical note: you can look straight down in first-person view and see his feet treading about, which I found to be a nice touch).  The wish list still has a few entries, though.  For example, I would have very much liked a strafe or torso twist maneuver, which would let you target enemies without facing them head-on.  Gun Griffon let you slide every which way around the battlefield, and you could circle opponents with ease in Mechwarrior.  As it is, the principal tactic against enemy mechs seems to be the good old headlong charge, and I prefer to be able to use a little more finesse, even if I am driving a big cumbersome robot.  You're often left open to enemy rocket attacks (though you can shoot some projectiles down, it doesn't work too well against sustained barrages), and it's hard to follow escort targets when you have to turn this way and that to take out enemy helicopters and tanks.  The game isn't impossibly hard that way, though.  If you learn how to accelerate and decelerate quickly, using the reverse gear to back up and turn in a small space, you can keep a pretty good handle on the action around you.  Pay attention to your radar, learn to use the fast rotate control, and you'll be every inch the super stomping destruction machine, especially when you acquire some of the more versatile weapons.  You start out with boring stuff like rifles and gauntlets, but quickly graduate to lovely engines of destruction like Gatling guns, rocket launchers, and the ever-popular chainsaw.  Don't laugh - the chainsaw dices up those enemy mechs like nobody's business, and it never runs out of ammo.  Comments:  Iron Soldier 3 came basically out of nowhere, I expected nothing of it, and it turned out to be quite a good time.  25 missions in various areas provides several varieties of urban destruction, the three different mech models are fun to try out, and there's enough cool FMV to choke a horse here, including a massive opening movie and intermission clips for every success or failure in battle.  The multiplayer mode, however, is a buit of a toss-up.  The split-screen framerate still moves just fine, but the slow pace of the game means this probably won't be your first choice with a friend (although the cooperative mode has definite potential).  IS3 isn't quite something with general appeal, but what it sets out to do - reprise a classic exercise in leveling everything in sight - it does quite well.  -- David Smith", "date": "Jun 28, 2000"}