{"name": "Heroes of Might & Magic", "name_review": "Heroes of Might & Magic", "ref": "https://www.ign.com/articles/2000/06/30/heroes-of-might-magic", "text": "I've played all the Heroes of Might & Magic games on the PC, but if you had told me that some day I would play it on a Game Boy, I would've laughed. A complicated PC strategy game like that on a handheld? Yeah right. What's next, Unreal Tournament?   But now that I have played it, I have to tip my cap to KnowWonder: this really is the first Heroes of Might & Magic game, boiled down its essence and ported over to the Gameboy. Sure, a few sacrifices were made, most noticeably the campaign mode, but the essential core of the game is there, completely intact. Features Four hero types 27 different creatures Three save game slots Tactical battle mode Only for Game Boy Color Heroes of Might & Magic (or HOMM as it's known to its fans, who are also lazy typists) has all the trappings of a fantasy roleplaying game -- monsters, spells, treasures, quests, and characters that go up in levels -- but no mistake, that's merely a disguise. This is first and foremost a pure strategy game.  And as such, it can get a little bit complicated, and I can imagine new players getting frustrated as they try to figure out what the heck is going on. At any rate, you generally start the game with one city and one hero, although the goal is to get more of each, quickly. Each turn you upgrade the buildings in your city to produce better military units while moving your hero and his army around on the campaign map.   Your hero will wander over the map capturing gold mines, lumber mills and the like to add to your resources, and will occasionally run into stacks of neutral creatures guarding magic items or additional resources; you'll have to defeat them to take their treasure. But your main opponents are the three other players who have their own cities and their own heroes and are also trying to grab all the resources and conquer all the towns, including your own.   Whenever your hero enters combat (whether with a neutral or another player's army) the game shifts to a tactical mini-game. Here's where you can cast combat spells, try to cut down the other guy with ranged attacks, and generally out-maneuver your opponent in the narrow confines of the battlefield. The tactical combat is actually a lot more sophisticated and less random than it looks.  Experience points, spells, blessings, and even luck (gained by visiting wells and the like on the overland map) all affect combat and can sometimes give you a needed edge in combat, but the more cities you control, the more army units you can build. Each hero has five slots to put creatures in his army, and having massive armies is really the only way to win.  For those of you already familiar with the game, picking up the Game Boy version should be a snap. The designers here made smart decisions when they implemented the PC controls onto the Gameboy, so navigating HOMM's at times baffling interface here is actually pretty easy.  Instead, the biggest problem with this conversion is the scaling of the graphics. Even in the PC version, the units are pretty small, so when you scale that down to a Gameboy, you're dealing with some truly microscopic icons wandering around on a vast, cluttered map. So even though the designers overhauled the scenarios and made more from scratch, expect some serious eyestrain as you try to figure out which player controls what sawmill or how far a stack of units can move. This is ultimately the most frustrating thing about the game, because in HOMM you have to be able to see the enemy's armies and gauge how far they can move, but at what price? Your eyesight? Too often it's more effort than it's worth.  The tactical mini-game fares much better, since the maps don't scroll and everything you need to know is always visible. And since HOMM's tactical combat, particularly when it involves two powerful, equally matched armies, is what this game really is all about, you should have lots of fun at this stage of the game. While the Heroes of Might & Magic series has gotten a lot more sophisticated in its third installment, at its heart it's still the same as what you get here. In that respect, this Game Boy conversion is an interesting and successful experiment in porting PC strategy games over to handhelds, and it bodes well as to what kind of games we could get on the Game Boy Advance (Civilization, anyone?). Game Boy HOMM has its problems, but if you can tolerate the miniscule graphics and fuzzy strategic overview, you'll find it has its moments. It's probably best suited for those times when you're fiending for a serious strategy game but can't get yourself to computer. A great way to kill an hour or two.", "date": "Jun 30, 2000"}