{"name": "Evolution 2: Far off Promise", "name_review": "Evolution 2: Far off Promise", "ref": "https://www.ign.com/articles/2000/06/30/evolution-2-far-off-promise", "text": "Poor Mag Launcher... always getting into trouble, and perpetually in debt.  When we last saw the CyFrame-toting hero, he was adventuring through the surrounding dungeons of Pannam Town, paying off his massive debt to the Society, a worldwide archaeological group, by collecting artifacts for them.  Meanwhile, Prince Eugene, a villainous member of the 8th Imperial Army with eyes for the legendary CyFrame Evolutia, had his sights set on Mag's constant companion, the quiet but powerful Linear Cannon (yes, all the names are meant to sound like guns).Such was the story of Evolution 1, a rather enjoyable game from late last year that featured some of the most memorable character designs out there.  I was hoping to tell everyone that they should pick up parts 1 and 2 in the series this weekend and have a blast as they get to know the characters and the story surrounding them, but... well, lies make little baby Jesus cry.  Evolution 2: Far off Promise is one of the most mundane, repetitive, and ultimately pointless gaming experiences you're likely to have all year.  Stay far away from this one.~Sequel~ is perhaps the wrong word for the game, as it's more of a next chapter in the continuing saga of Mag, Chain, Pepper, Linear, Gre, and Nina - a sorta Mag Launcher in the Legend of Evolutia-type thing, if we stick to the spirit of Indiana Jones that the game likes to suggest.  The entire cast is back, and is just as adorable as ever, although this time all key story sequences are voiced in Full Japanese (complete with English subtitles, of course).  Ubi Soft has done a much better job with the translation for part 2 - it bodes well for the company's translation of Grandia 2.  The characters also look better, as they lack the blurriness of the original, and feature more in the way of facial expressions.  The more I see these guys on screen, the more I come to understand that the listed character designer Umeku Uekusa is a master of what he does - even the new characters and NPCs are just screaming to be turned into toys.It's unfortunate that in Evolution 2, Sting has been unable to build a compelling game around these characters.  The game is actually quite similar to the original in the basic way in which it's told.  You start off in the heat of things, where you're introduced to Mag's latest exploits.  Mag arrives in Museville, a  clich entity which lacks the personality of the original town, and heads off on a series of archaeological quests that take him into the surrounding dungeons.  The game follows the same basic pattern of the original:Town ExplorationStory SequenceDungeonTown ExplorationStory SequenceDungeonTown ExplorationStory SequenceDungeonUh-oh, something big just happenedSpecial DungeonFinal BossEnding Story SequenceEnding CreditsIt's like Sting has created their own cookie cutter story, ala Disney, and just decided to fill in the blanks.  It worked well in part 1 because the story events and sequences towards the end were quite compelling, and the final area of the game was an enjoyable Grandia-esque romp.  No such luck here.  While the story starts off interesting, it becomes childish and contrived towards the end, and there's no such Grandia-esque romp to look forward to this time, alas.Maybe the game was designed with kids in mind, but then again I wouldn't suggest exposing your kids to Evolution 2's dungeons except as a means of putting them to sleep.  The randomly generated underground and overworld lairs in part 1 were already too long for my liking, but the dungeons of part 2 are just plain ridiculous.  We're talking ten plus floors, an overabundance of enemies, and in the case of the last dungeon, over three hours of gameplay with no means of saving (you can no longer save between floors, it seems).  Isn't that breaking some sort of health code?There's really nothing compelling about these dungeons.  Your point is simply to get to the top and defeat the boss, as there are no story sequences encountered along the way.  The dungeons are no longer randomly generated, and you can progress from floor to floor up or down as much as you want, but only a handful of interesting puzzles arise as a result of this.  The game drags on and on and on, with the same set of enemies repeated over and over again floor after floor after floor... it's almost as if someone said ~we need to make this game longer... add five extra floors to each dungeon.~  Well, I dozed off three times while playing this game - not even the inspiring background music could prevent that.  I think at least three of the sixteen hours for my final game time were spent with my eyes shut.  What's that?  You think I'm joking?  Okay, believe what you want...The game does do some interesting things in the area of battles, skills, and items.  The battles are fast paced, with some cleverly thought out spells, and the bosses don't feel as cheap as in part 1 - these encounters are both fun to watch and play through, especially with the triumphant music in the background (it's just the same as in part 1, but no complaints here).  The skill system is the same as in part 1, with characters earning technique points in battle that can be exchanged for new skills.  Many of the characters equip cool devices known as CyFrames, which give powerful themed attacks.  Mag, for instance, can equip a Hammer CyFrame, which gives him hammer attacks, or he can try on a Mind CyFrame, which allows him to use powerful spells.  CyFrames can be upgraded so that they can be used more often in battle, and you can collect so-called upgrade kits in dungeons, which allow you to equip multiple CyFrames at a given time.  Seeing the effects of the CyFrame and collecting all the spells and powers associated with a character is just as fun here as it is in something like Grandia or Final Fantasy, and as mentioned, Sting has created some clever attacks that are bound to make you laugh. There's also plenty more to do this time around.  In addition to collecting all a characters' skills, you can collect 100+ artifacts from the dungeons and exchange them for money - this, in addition to the occasional treasure chest in a dungeon, is the only way to collect money in the game, a cool little change of pace from the norm of having enemies give you money in battle (where were they holding all that money, darnit!?).  Artifacts can be combined into larger, more valuable items, so it's good to hold on to all the artifacts you find for as long as possible.  In passing the game, I only managed to collect around 40% of the artifacts, meaning there's plenty of room for the diligent adventurer to replay the game and collect all the items.  And, in fact, the list of appraisal items you've collected carries over onto your new quest.  The game actually features a randomly generated dungeon in the back of town, which can be accessed as many times as you want.  While you don't earn experience from going through it, you do learn new skills, and can keep whatever appraisal items you find.But I'd had enough of the game my first time through, running through the barest minimum of dungeons.  Evolution 2 relies too greatly on non-stop repetition to get it through, and ends up being less than fun as a result.  If Sting wants to keep this thing going, something I hope they do as the characters are just too good to be lost forever, they may want to take a different direction next time around.-- Anoop Gantayat, IGNDC", "date": "Jun 30, 2000"}