{"name": "Star Trek: ConQuest Online", "name_review": "Star Trek: ConQuest Online", "ref": "https://www.ign.com/articles/2000/07/06/star-trek-conquest-online", "text": "Have you ever wondered what it would be like to live life as Star Trek's Q? You don't have to answer, that's a rhetorical question. Of course you have! Who hasn't ever fancied themselves an omnipotent  and obnoxious  being, capable of creating or destroying entire worlds (or hundred dollar bills) in a single thought! Well, thanks to the folks at Activision and Genetic Anomalies, you now have that chance. Not to print a mint or add as much extra cheese as you want, mind you, but a much higher and more honourable purposes: war and conquest! Welcome to the world of Star Trek: ConQuest Online, an online only (you could've guessed that, come on) collectible card game.  It all starts out innocuously enough. The voice of John de Lancie (Q) greets the user with his usual thespian tone: ~This is Star Trek: ConQuest Online. I think you'll like it here.~ Starting the game for the first time, new users will likely find themselves quite confused. The mechanics of the game are anything but straightforward, and the layout of what's on the screen  any screen  can be difficult to navigate and maneuver. That said, ConQuest's presentation is actually extremely well done. Once you get used to it, you start to appreciate the Star Trek-like feel to everything. From game's cover, featuring Q playing a game of chess with people and ships, to the thick instruction manual detailing every minute aspect of play, nothing is left to chance.  It's only once the game is started, though, that the strength of the presentation becomes apparent. Everything feels like it's right out of Star Trek, with that futuristic flat pad layout used on actual Star Trek consoles. Gameplay is smooth, and has a futuristic feel to it. The whole thing is made to feel just so. And it works.  The game itself is another story. ConQuest Online is complicated. The movements are anything but intuitive, as is the flow of the game. In fact, even getting into an offline version of the game to practice and hone your skills can take some doing. At least the first time. There are close to eighty pages in the instruction booklet, and none of them are wasted. You'd be better off reading the whole thing before starting. But unnecessarily complex mechanics are just about the only flaw in this otherwise top-notch Star Trek sim.  The game goes like this. You're a Q. Not the Q, but some other Q. You're playing an interstellar game of wits (read: war) with another Q, and using your minions to destroy his and take over his world, all the while defending your own from him. Different affiliations, including Federation, Klingon, Romulan, and Borg are available, and each comes with their own Q. You could be ~Political Q~, ~Pervasive Q~, ~Destructive Q~, or even ~Passive Q~. Each Q has their own special abilities that benefit certain affiliations.  The actual game is simple enough, once you understand how things work. You control one planet in your region, and your opponent controls one planet within his. Between your respective regions is a neutral zone, with (depending on the game-type selected) one or many planets. On your own planet, you use 'Action Points' (earned each turn, increasing as you gain more territory and influence) to generate people and manufacture ships and equipment, as your opponent does the same. Then, you simply send your ships and people to the neutral zone to fight over space and planets. There are also special events and items that can help your cause or hurt your foe's, like extra shielding or communications interference.  That's really about all there is to it. Have your ships move to new regions to defend them, or into opponents' regions to attack. On those ships, transport personnel to planets, where they basically duplicate the ship battles, only with people. The battles themselves could not be simpler (again, barring the newbie-unfriendly gameplay), as each ship does some set or random amount of damage and has a certain amount of shielding. Shields are not repairable, so ships are just used until they're used up.  There are two more very key aspects to the game. The first is the 'Online' in ConQuest Online. This game is clearly meant to be played against other users on other computers on the internet. Two-player games are impossible on a single PC, and everything is set up assuming you'll be playing online. The computer AI is a joke, and once you learn to beat it the first time, you'll never lose again. It's meant as a tutorial device, to teach users the game before they enter the harsh world of online play. Once online, a whole slew of new options and games are available.  The other important feature to this game is the collectible card game feel to it. When playing, the ships you build, the personnel you summon, even the Q who quarterbacks  all come from a 'deck' of imaginary 'e-cards'. These decks contain a finite amount of everything, some cards better (and rarer) than others. You might open a Federation deck to find three constitution-class starships and one more powerful galaxy class ship.  This part of the game is also more complex for people unfamiliar with trading card games like Decipher's Star Trek Customizable Card Game. New users start with five 'default' decks, containing only the most common of cards. One deck for each affiliation, so you can try them out. To get the good cards, the ones you'll need to play against skilled online opponents, you have to go to the ConQuest website (easily done through the game) and 'purchase' it. Since you'll have the registration key from the game, this purchase will be free for you, but normally it would cost ten dollars. Users are encouraged to buy more and better cards.  Compared to some of the big blockbuster games being released now, graphics and sound in this game are virtually forgotten. Everything the user sees looks sort of nice, but the game mostly features small ship and person icons, none of which are impressive at all. As far as sound goes, Q's voiceovers are well done, but infrequent. And sound effects, smooth as they are, occur only when you take an action. In a game as strategic as this, that means there can be a long time between sounds.  That said, everything comes together online. There are chat rooms full of people, waiting to play games and trade their e-cards. Everything is set to complete your ConQuest Online experience, and you can have a blast playing (and chatting) with online foes. Online sim games are among the most addictive for a reason. Once you get past all the hoopla to get there, ConQuest is no different.  It sure takes a long time to get there, though.  -- Eric Benner", "date": "Jul 6, 2000"}