{"name": "Wacky Races", "name_review": "Wacky Races", "ref": "https://www.ign.com/articles/2000/07/06/wacky-races-2", "text": "I can still remember a few months back when I gave my first hands-on preview of Wacky Races.  The primary though in my head was ~Gee, if they could fix the framerate in this thing, it would be one of the most amazing kart racing titles I have ever played.~  Well, the game finally shipped yesterday, and I've been tooling around with the final for a week or so, and I'm afraid I've got some good news and some bad news.  Since I'm not really one for pulling punches, we'll start with the stuff that makes the die-hard cry.  Gang, this game is a framey mess at times.  And the sad part is, looking at it, my guess is this lapse in performance wasn't even necessary. But, like most publishers, it seems Infogrames opted to push it out the door rather than take a few weeks and clean this thing up, so the game is both a lot more choppy and a whole hell of a lot slower than we had hoped it would be.  And the good news?  Well, despite the shoddy engine, this Hanna Barbera-driven rcaer is actually a beautiful, deep, enjoyable title in many sense.  I'll admit I was really turned off by the fact that this game moved so poorly, but once I decided to give it a shot, I found out that is really does have a lot to offer.  Let's start with the visuals.  WR's boost of Jet Set Radio's technique came off with few hitches, and both the characters and the tracks look really cool. The camera options can be a bit troublesome when some of the larger cars get in the way of the action, so you will unfortunately have to skip out on a lot of the game's wonderful details until the post-race replay. The animation for the cars and their attacks are straight out of the cartoon, and give the whole game a ~rubbery~ feel that helps keep the slapstick flowing.  I can't tell you how many times I laughed when I stumbled upon the Creepy Coupe's Pumpkin Mines and they would then start hopping after me.  There are tons of little touches like this, from the hearts that surround you when you get hit by a Lippy Shot to the way Peter Perfect's car bends up front when he turns.  This game looks really sweet at times, and truly gives off a sense of being right in the middle of the Wacky Race. Another aspect that really stands out in this regard is the audio.  Take out the annoying announcer and his repetitive, baseless commentary and focus on the racers themselves and you've got a really cool package. There are a ton of samples, and though some get repetitive, they sort of became a battle cry for me as I played.  From hearing Penelope tell me she is late for a hair appointment as she wizzes past to having my driver of choice, Lazy Luke, tell Blubber Bear to quote ~drop some of that off to lighten the load~ (~some~ being a subtle reference to moonshine),  the game will leave you in stitches from start to finish. Thankfully, despite tons of possible audio distractions, the control never gets in the way of taking the checkered flag.  Granted, standard kart control isn't too hard to nail, but it still bears mention. Wacky Races offers two styles of control, and both check in with a good feel that makes focusing on the action much easier.  The ability to assign buttons to your weapons of choice was also a nice touch. I also can't say enough about the track design, which benefited from a slick combination of dynamic pathways and the ~strength in numbers~ mentality.  This game is just packed with courses, and as you progress through the game's various challenges, some will change the main route to victory, which really keeps you on your toes.  In fact, this was sort of typical of the game design as a whole.  Despite being a member of the generally simplistic Kart Racing genre, Wacky Races gives you so much to do, it is almost overwhelming.  There are a ton of courses to start, and as you collect stars through the various challenges, you unlock both more tracks and more challenges.  If you manage to get very far in the game, you'll soon discover that you can unlock completely new areas on the map, which also opens up one-on-one challenges with hidden characters, who can eventually be unlocked, and beating them also helps you get additional weapons that can be used in the normal racing challenges.  As you can see, that's a whole lot of unlocking. The game got a bit slow for me at times as a result, but for racing fans who like a really expansive game, you'll be hard-pressed to find a deeper title than Wacky Races. It hard to explain, but as much as I hated having to explore every nook and cranny of  the track to find 10 Golden Muttleys, his little snicker when I missed one made me want to beat that little bastard. It was an odd love-hate thing, but it worked. Truth be told, I'm not sure it was the star collecting that got to me, but more the game's general lack of speed.  Between the frame-rate and the game's slow pace, things really started to drag at times, and I would have really enjoyed the race a bit more if this game was a bit quicker.  Infogrames did do a good job of making up for the lack of juice by making sure that the race was always tight, and that the AI was aggressive in all the right ways, and this actually ended up balancing out enough to keep me playing.  Cars will try to wreck you as quickly as they will try to shoot you up, and attack each other just as viciously.  The game is actually designed to keep a fairly tight pack of AI vehicles, and catching up to them is always easier than breaking free of the chaos that lies within their midst, which keeps nearly every race tight and full of the audio clips that keep the personality high. Throw in multi-player and battle mode, and this game certainly has legs on it.  Granted, they may not be as technically stable as I would have liked to see from a title with this many positive things going for it, but I guess we can't expect every publisher to take kids games as seriously as we do.  *Sigh* Oh well.  When the cartoon cloud of dust and fists settles, Wacky Races is an above average racer that is cute and easy enough to appeal to younger gamers, and deep enough to give older gamers a run for their money.  If you're looking for something that fits that bill and don't mind playing a game that obviously lacks some polish, you'll definitely have fun with this one.  -- Brandon Justice, IGNDC", "date": "Jul 6, 2000"}