{"name": "Icewind Dale", "name_review": "Icewind Dale", "ref": "https://www.ign.com/articles/2000/07/07/icewind-dale", "text": "Anyone who has been playing PC games for the past couple of years is aware of both Black Isle's and BioWare's contributions to the RPG genre. Fallout, Fallout 2, Baldur's Gate, and Planescape: Torment all can be considered modern day classics. Take that talent, infuse it with BioWare's Infinity engine (from Baldur's Gate), and you get yet another amazing example of AD&D computer role-playing in the form of Icewind Dale.  The game takes place in the frozen northern part of the Forgotten Realms known as Icewind Dale. This harsh and cold area is separated from the rest of the world from a very rough mountain range called the Spine of the World. The game starts out in one of the ten towns of the Dale, and you must make your way into the Spine of the World mountain range (and under it) for a classic hack and slash dungeon crawl.  Since Icewind Dale uses the Baldur's Gate engine, a lot of things will be instantly familiar to fans of that previous game. The interface is exactly the same, with the exception of the art style, and all the familiar buttons and features are present.  But there are a few new things that make it even more polished than before.    First you will notice that the paper dolls in the inventory screen look a lot more defined, and you can now change their clothing colors on the fly, which is pretty cool when you get a new robe for your mage and it looks bad in blue. Also, they now offer many more voice samples to choose from during character creation for Fighter, Mage, and Thief types. Next up, there is a little button in the options that will automatically give your characters the maximum hit points available to them each time they level. This is extremely helpful to those of you who get annoyed when you gain a level in D&D and only roll one extra hit point.   Part of the beauty of this game is that it perfectly harnesses the basic AD&D rules, just as Baldur's Gate and Planescape: Torment did. Saving throws, combat, spells, and everything else related to the rules work exactly as they are explained in the Player's Handbook. Not only that, the spell descriptions are taken almost word for word out of the Tome of Magic. While it would have been nice if they added in some of the optional rules and character kits, this is exactly like playing an action packed dungeon crawl with your friends (the adventure even starts in a tavern, just as many AD&D modules do). The only difference is that the computer takes the place of the DM, as well as taking care of all the complicated calculations needed for die rolls (although you can have the game display die rolls for hits during combat).   Quests are given by NPCs, but depending on your characters' race/class/alignment the responses each NPC gives you will be drastically different. If your Chaotic Neutral Thief cannot get an answer out of a NPC, then maybe your Paladin would have better luck. Seeing that there are so many possible race/class/alignment combinations in the rules, it adds a lot of replay value to the quest as it will be a little different each time you play (as long as you use a different party each time). Simply put, there are many different ways in which you can tackle this game.   Speaking of your party, Icewind Dale allows you to start off the game with a full group of six characters if you wish, unlike Baldur's Gate where you began the adventure all by yourself and had to rely on NPCs to fill out your group. Of course, you don't have to take a full party of six.  You can go solo, which is just like suicide in this game, or use any number of characters up to the maximum of six.   It may be a good idea to take a strong, balanced group through this adventure because the environments are harsh and unforgiving and you will be in a lot of battles throughout the course of the game. The amount of combat in this game makes the last couple AD&D titles seem like Hello Kitty games in comparison. Nearly every area is infested with hordes of critters to kill, and they get progressively more difficult as you get deeper and deeper into the dungeons. While that may take a little while to get used to, it fits the theme of the game perfectly, and gives combat a whole other level.  Battles in the game are played out in real-time, but you are able to pause the game to issue orders to your party members so things don't get chaotic too quickly. The sheer number of monsters to slay in the game means you'll have to plan out nearly every battle, and makes combat very exciting. Sometimes you'll need to send in a Thief using stealth to scout out an area, and then use him to pull one or two monsters at a time. Other situations will require you to summon an army of skeletons using your Cleric, have them protect your mage, who will then blast the enemies into oblivion using his wide array of spells. The different tactics and amount of strategy each fight needs makes the combat in this game some of the most exciting ever seen in and AD&D PC game.    Some players may be turned off by the amount of combat in the game, as there is definitely more action than dialogue. There really isn't anything wrong with the story, but it's really just an excuse for you to go out and kill things. You leave your small starting town to investigate the evil plaguing the land, and by investigate we mean tearing through dungeon after dungeon of monsters. Once you discover the source of the evil, you do battle with an ultimate villain at the top of his tower of terror. With that in mind, you may be better off playing Planescape: Torment if you are looking for a deep and fascinating story.  But Icewind certainly delivers on the action end.  As for the graphics, they have improved over Baldur's Gate in the year the team at Black Isle has had to tweak the engine. Even though the game still runs in 640x480, the large pre-rendered backgrounds have even more detail than before, and the water looks simply amazing.  And while the game takes place in the frozen north, snow isn't the only environment you'll run into. You'll find towns hidden from the harsh weather and warmed by the earth, vast underground caves and tombs, hidden temples, ruined cities, and more. Add to those random weather effects and you have a very impressive environment with tons of little areas to explore.  The game even has an unsupported OpenGL mode, but turning this on doesn't make a huge difference, and on some cards it can make the backgrounds look worse than they do in the non-accelerated mode.   When it comes to the character and monster sprites, they haven't changed much since Baldur's. They are still small, and lack detail. However, the larger monster sprites (such as giants) are pretty well detailed and crisp looking, even at the low resolution that the game runs in.    Along with the graphics, one of the things that will strike you is the incredible sound and music. The narrator is an amazing storyteller with perfect pacing and mood for every encounter. This is the type of DM that every D&D session should have. The other sound effects are just as good -- snow crunches under your feet, wind blows all around you (using environmental audio), and character voices trail off into the distance as you get farther away from them (just like in Planescape: Torment). Also, you are able to tone down the number of times your characters speak, something that is nice as hearing their same taunts over and over can get on your nerves.  Even though the sound effects are pretty good, nothing can prepare you for the music in this game. In my opinion, Icewind Dale contains some of the best music to every grace a computer RPG, and without a doubt it is the best music ever put into an AD&D title on any platform. The soundtrack is less like a game score, but more like an epic Hollywood film score. The closest comparison would be the Conan: The Barbarian soundtrack.  That epic soundtrack perfectly captured the feel of action and high adventure, just as Icewind Dale's does.   As in Baldur's Gate, there is an extensive multiplayer mode supporting networks, Internet, and the now rarely used modem and serial cable options. Multiplayer is slightly more stable than in Baldur's, but there are still some bugs to iron out.  The Black Isle team is already working on a patch that focuses on multiplay (the beta version has been released as of this writing) so these problems should be addressed pretty quickly.  Once in a while, a game comes along that completely takes over your life. StarCraft, Baldur's Gate, and EverQuest were all like that, and now Icewind Dale arrives to flush productivity right down the toilet. Despite the somewhat cookie-cutter story, the game will have you playing long into the night the whole time saying to yourself, ~Just one more dungeon, just one more dungeon!~  It's an exciting dungeon crawl that I recommend to any true RPG fan that is looking for a meaty quest to hold them over until the epic Baldur's Gate II is released.  -- Jeremy Conrad    Comment on this story", "date": "Jul 7, 2000"}