{"name": "PES 2008", "name_review": "Pro Evolution Soccer 2008", "ref": "https://www.ign.com/articles/2008/03/31/pro-evolution-soccer-2008", "text": "For a football series that's trying to play catch-up with FIFA on the Nintendo DS, Pro Evolution Soccer is sure taking its sweet time. The original Pro Evolution Soccer on the handheld, Winning Eleven Pro Evolution Soccer 2007, released last year to lukewarm critical reception, and you'd think that be enough to light a fire under Konami's butt to get cooking on something a lot more significant for portable gamers. The second game, Pro Evolution Soccer 2008, contains slight tweaks here and there, but the core soccer's still pretty weak compared to the EA Sports offering.   The 2007 version featured a solid foundation for the 2008 team to build off of. Though the visuals were a step backwards in quality especially compared to what the console teams were doing, the actual soccer engine had potential. It was pretty rigid in spots but it at least played solidly on its own. Compared to the FIFA DS series, the game had a lot of catch-up to do, so the promise of another year in development could only be seen as a good thing for this rendition.   ~Minimal~ and ~conservative~ come to mind when looking at what sort of upgrades you get in Pro Evolution Soccer. The gameplay certainly has been given a bit of focus  it doesn't flow and move as rigidly as last year, but it still doesn't control as gracefully as it really needs to. New rosters have been added, but again, that's expected for a ~new year~ version for a sports title. The multiplayer experience is brought back for this year  to its credit, Pro Evolution Soccer beat FIFA to the Nintendo Wi-Fi Connection by a couple of months, probably the Nintendo DS version's only real claim to fame. And Pro Evolution Soccer 2008 contains a more feature-filled online experience where you can add more to the search parameters during the match-up. On the downside, the critical mass isn't there for this version, so finding a pick-up random online match won't be easy for Pro Evolution Soccer.   It's 2007 with minor tweaks.   The upgrades are so minimal in 2008 that some places didn't really get any tweaks at all. The soccer is almost as hauntingly quiet an experience as last year's game. Once again, this series leaves out the commentary, a feature that's been getting better and better with each iteration of the FIFA series. The few-and-far-between sound effects, like game stoppage whistles and crowd noises, have been enhanced with better digital samples for 2008, but the game just lacks in life without a Brit calling the shots play-by-play.   Pro Evolution Soccer 2008 does have a few weird upgrades, like the decidedly Japanese ~gacha-get~ mode. As you progress through the ranks, you earn tokens for capsule dispensers and slot machines, where players swap their money for better players and enhancements.The Nintendo DS isn't really a sports powerhouse game system, but it really deserves better than this. The original Pro Evolution Soccer wasn't anywhere near the quality product that Konami's been pushing for the current generation consoles, but we were kind and forgave the game a bit since it was a first-generation product. Version two isn't much better than the original, and though it does tweak things to make it a better playing game, the fact that it took the team a whole year to come up with these minor enhancements is incredibly disappointing.", "date": "Mar 31, 2008"}