{"name": "Men In Black 2", "name_review": "Men In Black: The Series 2", "ref": "https://www.ign.com/articles/2000/07/14/men-in-black-the-series-2-2", "text": "The world is ebbing to its own destruction. Our population has been infiltrated by extraterrestrial invaders. A devastating alien force is on its way to terminate our world. But first, Agents J and K must find their sunglasses. All of them, which have been nefariously hidden in eight calamity-laden zones of death. Hurry up and snag those specs -- the world is depending upon you and your Oakleys to save the planet!   Oh, forget it. After playing through this game, I welcome hostile Martian take-over, so long as their games are better.   Features:  Based on the mega-popular movie and cartoon series Eight stages of platforming action Find and use items from the film and show, like Sunglasses, the Noisy Cricket, and... Snowshoes? Absolutely none of Big Willie's ~Men In Black~ theme song Only for Game Boy Color   A textbook example of how to take a great concept and sharp graphic style and just plow it all under with wrong gameplay, Crave's MIB2 reminded me so much of old NES, SNES, TG-16, Genesis, and other sprite-based platformer games that we at IGN ended up spending much of the day going back through those old games looking at what could go wrong in a platforming game. I'm not going to spend much time talking about Men In Black 2 in this review -- it seems a little redundant for such a base game. Instead, consider this review a primer for your own personal foray into game design before you send in that application for DigiPen (see today's letters).  First off, setting a goal is crucial to exciting game players into the game. Even if all you can come up with for gameplay is an action game where a guy collects stuff, make the 'stuff' important to the game player. Picking up pieces of a mega-weapon that will eventually be built to save the world from impending peril is a good idea. Collecting strewn body parts for Frankenstein's monster is also a novel concept. Collecting four pairs of sunglasses on each level, such as is the driving force in Men In Black 2, isn't enough reason for me to even get out of bed. How can sunglasses save the world?  And on that same tip, let's take on the incentive program for players to get deeper into the game. Let me say this bluntly: scoring is for the backseat of a Dodge and Pac-Man. Playing a game to simply rack up a high score hasn't been fun since Reagan was shot and Jodie Foster appeared in a good movie. Some games can still get away with it. Those games are all start with the words ~Tony Hawk's...~ Running around collecting bonus points, only to open up doors leading to even bigger bonus point stockades, is lame. If you're going to make a room in your game, put something in it so that I will want to go in it.  Level design is very important to good game design. Be sure to actually design your levels, instead of just laying out whatever random lines and roadblocks come out of an unconscious mind. Perhaps something called a 'puzzle' will spruce up the gameplay. The more you challenge a gamer's intelligence, the more that gamer will surprise you by actually using it. Thematic levels are an excellent idea, but be sure to fully use all of the ideas inherent in that type of stage. Yes, sliding on ice is an interesting challenge. Good start. And yes, having wind negatively affect players movement is a novel concept. Now use those two platforming elements to create a challenge for the gamer to overcome. Simply tweaking the gravity and movement algorithms will not automatically create an obstacle for the gamer. You must plan ahead and create hurdles for the player to figure out and get past.    We now move on to enemies. For the King's sake, make enemies fun to battle. I don't care if enemies simply squash like cartoon characters or blow up in big, meaty, bloody chunks -- that kind of thing doesn't bother me. It bothers Tipper Gore, and maybe a few others. All that concerns me, the game playing public, is that it's enjoyable to take out a foe. I don't care how much pain and suffering the digital baddie characters suffer. My enjoyment is all that matters.  Emptying six rounds of a Noisy Cricket (which, based on what was seen in the movie, has the power to throw a man twenty feet back with its recoil alone, and blow up several city blocks with a well-aimed blast) just to kill an owl isn't fun. It should not take three highly volatile nuclear grenades to take out a simple gun embattlement, especially if that task is required often in gameplay and the nuclear grenades are limited in quantity. Even if Bigfoot, the mighty Yeti lord of the Sasquatch creatures, in standing front of me with teeth bared, if I am armed with a Rocket Launcher, and I fire the Rocket Launcher in Bigfoot's direction , I will expect after the rocket's impact that Bigfoot will no longer be in front of me. Stopping power and blasting power are key components in the joy of gaming.  Speaking of Bigfoot, unless Bigfoot is an alien invader from the planet Mars, I do not want to have to battle Bigfeet in a game where the goal is to defeat the alien invaders from Mars. The same goes for owls, monkeys, and falling boxes once suspended in the air. I want to fight alien invaders from the planet Mars. Evil Men in Black, robotic drones, and (of course) little green men are all passable alternatives, but the most important thing is to make sure that the majority of the enemies I smite are, in fact, hostile aliens, and not harmless woodland creatures or inanimate objects.  Finally, here's a tip on character design: if you're going to add two characters to your game, they probably shouldn't be the same two guys with a palate swap on the skin color. Perhaps one character can run faster, or jump higher, or shoot better. The other would, of course, have his own unique abilities. Then choosing between two protagonists isn't a moot point. It's a challenge.    I think Men In Black: The Series 2 has taught us all an important lesson today. Let's all thank MIB2 for it's half-hearted efforts. It's mediocrity, despite some enjoyable game control roots and excellent graphic design, is a model for us all. You know, some say that in the future, we'll all look back on the days when these types of factory-processed-cheese games were king and remember those times as the best days of our lives. To them, I say, ~Remember -- they said the same thing about the '70s.~ Let's instead make these the best times of our lives, and let's start right here, with our videogames.", "date": "Jul 14, 2000"}