{"name": "Adventure Island", "name_review": "Wonder Boy Review", "ref": "https://www.ign.com/articles/2008/03/31/wonder-boy-review", "text": "The console count is up to 8. Today marked another milestone for the Wii's Virtual Console retro gaming download service, as joining the seven previously represented classic home systems like the NES, TurboGrafx-16 and Neo Geo is an eighth old-school machine  SEGA's 8-bit Master System. The Master System was the precursor to SEGA's Genesis, and directly competed against the Nintendo Entertainment System in the mid-to-late '80s. Though it never came close to eclipsing the success of the NES, the Master System still offered its smaller audience of fans a fair variety of unique gaming experiences, like Fantasy Zone, Phantasy Star and Alex Kidd in Miracle World. But today's headlining title for the Wii Shop arrival of the SMS was none of those three titles. It was, instead, Wonder Boy.   Wonder Boy is a straightforward side-scrolling platformer in which your hero, a blonde boy named Tom-Tom, is tasked to rescue his kidnapped girlfriend. It's a hop-and-bop design that proved popular enough to ultimately give rise to a long-running series of sequels, many of which have previously appeared on the Virtual Console (like Wonder Boy in Monster World, Dragon's Curse and The Dynastic Hero). Unfortunately, though, this first Wonder Boy adventure has also already come to the VC once before  as Adventure Island.   That was Hudson's version of this same design, as it was ported to the NES and replaced the young blonde Tom-Tom with the old, rotund Master Higgins. The two games are essentially identical, with the same level layout and gameplay. Wonder Boy's graphics are a bit better than Adventure Island's, but beyond that and the different hero characters, not much else is altered. Of course, this is the original version  Adventure Island was a port of Wonder Boy, not the other way around.   Running through this forest would be more fun if we hadn't already done it before, seven months ago, in Hudson's Adventure Island.  So Wonder Boy is really the first place that gameplay mechanics like the hatchets, skateboard, and fruit gauge first originated. The hatchets are Tom-Tom's primary method of attack. Starting out, he's unarmed and unable to defeat any enemies, and dodging or jumping over them is the best he can manage. But if you collect the hatchet power-up, he gains the ability to hurl arcing axes of solid stone at his foes. The power is helpful in taking out low-ranking foes like snails and leaping octopi, and is essential for level-end boss fights.   The skateboard is a high-risk, high-reward upgrade that straps a wheeled ride to your underside and grants you a considerable increase in speed  but also forces you to constantly move forward. You can't ever stop when using the skateboard, so while it could help you clear the current stage much faster than you otherwise would on foot, you have to be pretty skillful to keep yourself from accidentally rolling into a bottomless pit.   And the fruit gauge keeps you on your toes through it all. Displayed in the top-center of the screen at all times, the gauge serves as a meter that represents Tom-Tom's vitality. It slowly drains away while you play, and you need to constantly refill it by grabbing floating pieces of fruit that are placed around each level. If you don't collect recharging fruit pieces consistently and continuously enough, the meter will drain and Tom-Tom will lose a life. But time isn't the only thing that empties it  taking minor hits like stumbling over a rock in the road will also cause bars to drop off the meter. Think of it, overall, as a combination hit point counter and countdown clock.   All of these elements were novel and innovative introductions to the platformer genre of gaming at the time of Wonder Boy's original release, and the game served to showcase some of the appeal of the Master System over what Nintendo had available at the time on the NES. But after Nintendo's system gained the same game as part of the NES library courtesy of Hudson's Adventure Island, a lot of Wonder Boy's appeal was depleted  and that remains the case today. You may find Wonder Boy to be fun and well worth an investment of five of your digital dollars, but you'd be in the minority if so  because Adventure Island's arrival seven months ago has already made a strong play to tap the potential audience for this design.It strikes me as odd that SEGA would select Wonder Boy as their flagship title heralding the arrival of the Master System on the Virtual Console, since Wii gamers have had the opportunity to download the very same game design for over half a year in the form of Hudson's NES Adventure Island. What's more, Wonder Boy has arrived at a pricepoint of 500 Wii Points, giving it no monetary value advantage over the previous release either  when Master System games were expected to be available for a standard rate of 400 Points instead. Wonder Boy is still a fair selection and will certainly appeal to gamers nostalgic for the Master System, and placed head-to-head against Adventure Island it edges out Master Higgins' quest by just a bit. But let's hope that the next Master System title to arrive in the Wii Shop is one of that console's truly unique efforts.", "date": "Mar 31, 2008"}