{"name": "F-Zero X 64DD", "name_review": "F-Zero X Expansion Kit 64DD (Import) Review", "ref": "https://www.ign.com/articles/2000/07/18/f-zero-x-expansion-kit-import", "text": "As one of the biggest F-Zero X fans in the office I was really looking forward to Nintendo's disk-based add-on pack to the 64-bit cyber racer. There is no denying that F-Zero X has fantastic control and a good lineup of tracks, but it's also limited by its bland graphics and offers little customization. With the release of the F-Zero X Expansion Kit, it's now clear that Nintendo was just holding back some of the more interesting components for the 64DD release. In case you haven't been following Nintendo's Japanese releases, F-Zero X Expansion Kit is the 64DD's very first add-on disk. Unlike the other titles like Mario Artist and Sim City 64, this one will only work in conjunction with a cartridge. So if you don't have the original (Japanese) F-Zero X plugged in, F-Zero X Expansion simply won't work.If everything is set up correctly, you will be greeted by F-Zero X's start-up screen -- with the small addition of a 64DD logo at the bottom. From the main menu, you can access all of F-Zero's regular features, plus the two new ~Edit~ functions, Car Edit and Course Edit.Car EditThe Car Editor is a bit of a disappointment, especially when compared to the amazing track editor. You can select a body style for your racer, then pick a spoiler and your cockpit shape. Next you determine your ride's color scheme and decals -- but you can't actually create them like in Top Gear Rally. This wouldn't be so bad if the car editor at least offered a wide range of decals and car shapes... But it doesn't. Before the vehicle is finished and named, players have to carefully balance their car's settings and determine grip, top speed and boost. Overall, the whole car edit feature is underdeveloped and seems more like an afterthought to the fantastic track editor. I guess too much freedom in designing your car would have complicated maintaining the game's high framerate in the race. It would have been so awesome if cars and textures designed in Mario Artist: Polygon Studio and Paint Studio could have been imported, but F-Zero X just wasn't developed with the Mario Artist titles in mind. But let's get to the good stuff:Course EditIf you're expecting a simplistic track creator like in Excitebike, think again! The Expansion Set track editor is virtually the same tool the designers of F-Zero X used to create the original tracks for the cartridge game. Although F-Zero already has a huge variety of tracks available (not to mention a random track creator), gamers can now design their own racing circuits just like the pros. Using a cursor, you first create a basic circuit, then add points to it to create curves and hills and determine the basic track layout. Next, you assign different properties to the track elements via a simple drop-down menu system. There are dozens of different track styles, such as basic road, road with walls, half pipe, cylinder, loop and tunnel as well as road surfaces ranging from ice to the pink ~pit~ strips that recharge your energy. Although F-Zero X sacrifices roadside detail for framerate, you can also add up to two buildings, flags or gates per track piece, as well as mines, ramps and so on. You can of course also test your track at any time and run a few practice laps to get a good feel for your creation. Up to 100 courses can be saved directly to the disk.The amount of freedom this track editor offers is what makes this Expansion Kit so great. Want three loops in a row and then a pipe that goes through the middle of all three loops? How about a track that is 90% upside down? No problem. If you can think it up, you should be able to build it. The only limitations are tied to what pieces you fit together. For example, you aren't allowed to go from a tunnel piece to a cylinder piece (you need to put a basic track piece in between) as your car would fly off the track. Also, if you make a curve too steep, the editor will notify you and prevent you from making the change. However, the editor won't prevent you from putting down pieces that intersect with others or cause pop-up during gameplay. It's your job to make everything fit together and look nice.This is definitely the most detailed and complex track editor I have ever seen in a console game. It takes a while to figure out all the menus and control options, but once you have familiarized yourself with the functions you will be able to zoom in and out, rotate the track, select course elements, adjust height, banking and track width and so on. There are also more than a dozen course texture and color schemes that you can assign to your creation. I just wish the game was compatible with Mario Artist and let you design your own textures.In addition to the ability to create your own custom Cup, the expansion also includes two new Championship Cups as well as the ability to save up to three ghost racers on each course. The new Cups are definitely aimed at experts who have already beaten F-Zero X and are a welcome addition to an already impressive package.It seems as if Nintendo held back some of the original F-Zero X's glory so that it would have some software for the 64DD. Apart from the ability to save a ton of tracks directly to disk, there really isn't much here that couldn't have been done on cartridge. I refuse to believe that Nintendo couldn't have outfitted F-Zero X with a bigger S-RAM chip to let players save their tracks directly to the cartridge. It boils down to this: F-Zero X Expansion Kit adds a whole new world of possibilities to the cyber racer. But by choosing to deliver it on the 64DD, Nintendo is preventing most of its audience access to this great creativity tool. The price of the actual Expansion Kit disk is relatively low, but once you add the cost of the 64DD drive, the Japanese F-Zero X cart and the Randnet subscription plan you've got one big reason not to buy this import title. It would be wonderful if Nintendo could release a special edition F-Zero X cartridge with the track editor or even a lock-on cartridge with the additional editor functions in the US as a special treat for F-Zero fans. I doubt this will ever happen, so here's hoping Nintendo is at least planning the next F-Zero as one complete package without the need to purchase an outdated and overpriced add-on.", "date": "Jul 18, 2000"}