{"name": "Carmageddon 64", "name_review": "Carmageddon 64", "ref": "https://www.ign.com/articles/2000/07/29/carmageddon-64", "text": "Wow. Wow! It's amazing how ridiculously poor software can be when it's farted out as a quick, sloppy port by a development house. Carmageddon, originally a guilty pleasure of a 3D racer for PC centered around mindless road carnage and the hit-and-mutilate destruction of computer controller civilians wandering city streets, all brought together by a San Francisco Rush-like physics engine, has now arrived for Nintendo 64 courtesy of developer Software Creations. Unfortunately, what was an enjoyable PC title is ruined as a N64 game thanks to shoddy execution, resulting in a truly disgusting framerate, Vaseline-drowned textures, crazy control and zombies that spew green pixels and disappear in a flash after being run over. Basically, everything that made the title fun for PC players has been sacrificed in the transition to Nintendo 64, including the appealing demented theme of the franchise. It's sad really.   The publisher behind this garbage port is Titus Software, which also dumped out Superman 64 onto unsuspecting Nintendo 64 owners last year, and had the unfortunate luck of inheriting Carmageddon 64 from original distributor Interplay when it bought the company. You almost feel sorry for Titus. It didn't make this game, nor did it originally intend to release it. But then you remember that, after all is said is done, Carmageddon is now on US store shelves and some poor, uneducated gamers may actually purchase it, and all that pity goes right down the drain. Perhaps it's fate -- a title has finally arrived that clearly beats out Superman 64 in undiluted stink, and ironically it's also from Titus Software.  The Facts  30+ levels, including new mission tracks exclusive to N64 Three different two-player modes including Driven to Destruction, Checkout Stampede, and Eliminator Lots of hidden power-ups 23 ~Slaughtermobiles~ (even an ice cream van) including three hidden vehicles Bonus pick-ups to upgrade your car's engine or armor throughout the game Training level to prepare beginners for the real havoc Horrible, horrible game   Gameplay To give you an idea of why Carmageddon 64 is so bad, we must first explain why the original was, for the most part, good.   Inspired by the cult movie Deathrace 2000, Carmageddon pitted players in futuristic muscle cars and then encouraged them to race through populated cities destroying each other and any human civilians who happened to get in their way. The title was brought to life with pretty visuals and an exaggerated, but humorous physics engine that worked to deliver big jumps and gruesome impacts with innocent street people. Depending on the speed and angle of impact, civilian bodies would explode in a wide variety of different ways, and limbs would slide and bounce all over the streets ahead. Sure, it was a little grotesque, and all too often the subject of Senator Joseph Lieberman's tirades against videogame violence, but there was a certain satisfaction to splattering these stupid human opponents all the same. Perhaps Carmageddon for PC didn't have a whole lot else to offer. The level designs were mediocre and the racing aspect was almost pointless. Chances are, you booted up the game and ran over humans for an hour or two all the while racking up points for style. But you did have fun while it lasted.  The Nintendo 64 version of the game is based on the PC one before it, but it offers no gameplay satisfaction or visual finesse. Titus has bafflingly opted to remove the human opponents from the game and replace them with zombies that bleed blobs of green and quickly disappear after being run over. The funny little impacts of the PC version that sent limbs in every direction are no longer, and gone with them is the satisfaction of slamming into the characters in the first place. So, in short, the whole point of Carmageddon is already ruined with this amazingly important subtraction. More puzzling though, the game has still received an M (Mature) rating, so one wonders why Titus just didn't include all of the gore and goodness from the PC version? At least it would have been a selling point. We'll chock it up to stupidity and move on.  A downward spiral of crap control, unacceptable fluidity and a general pointlessness of play ensues. Press the analog stick to the left or right and the vehicle stutters for a moment, and then zig-zags in the desired direction after the framerate clicks back on. The fun physics of the PC title are transformed into slow-motion air-glides, the desire to run over humans (zombies) is gone, the racing aspect is moot, and the two-player mode is so offensive that we won't dignify it with details. A few minutes into Carmageddon 64 and you're going to want to take a shovel to your head, and truth be told, it'd be a proper alternative to bothering with this game.  Graphics Well, at least the game's consistently poor. The visuals that make up Carmageddon 64 are laughable by first-generation standards. Miserable framerate and textures so bad your eyes will hurt for hours after playing. Perhaps the only feature that could've redeemed the title in terms of eye-candy at all -- the amusing animated car impacts with civilians -- has been completely ruined with the transition from PC to Nintendo 64. The animation, in fact, is now in hiding, and all we get are poor pixel splurts before bodies fade away into nothingness. Bah -- we can't be bothered to continue on so we'll just offer you this image of a typical Carmageddon 64 texture.       Sound Screeches. Engine noises. Thumps. Does anybody really care? This game sucks. Oh God, please let this review end. We promise never to speak of Carmageddon 64 again, just let it end. I never thought it would happen, but there is now actually a game on the market that's impressively worse than Superman 64 -- and it's from Titus Software. Well done old pals! Carmageddon for PC -- a fun little racer -- hits N64 as a ruined, broken, sloppy, worthless port that really only serves one purpose: to remind players just how important time and effort are when porting a franchise to home console.There is no point to this rubbish. Absolutely, positively, whatever you do, do not buy this game!", "date": "Jul 29, 2000"}