{"name": "NCAA Football 2001", "name_review": "NCAA Football 2001", "ref": "https://www.ign.com/articles/2000/08/02/ncaa-football-2001", "text": "So I am out here, on the beaches of Destin, Florida, and I have recently received my review copy of NCAA Football 2001, from EA sports.  As I gaze across the white sand beaches, with their powder as to alluring me as Evan Picone blush is to a cross-dresser -- I pensively contemplate what I am going to do this day.  Hit the beach...or play NCAA Football 2001  -- just one more time -- before officially starting my vacation?  I succumb to logic and [of course] hit the gridiron.  What else would a true gamer do?  EA's formula for success, with its football franchises, has been as constant as mom's cooking theories.  Season, tweak, season, tweak, and voila! Perfection. Usually. No matter the method, no matter the fuss, as long as the result is palatable, who cares, right?  Well, American football gamers have a voracious appetite for highly exciting and playable football titles, and EA Sports has scored the inevitable six with this latest offering.  Taking into consideration the fact that EA really aced the college category with NCAA Football 2000, there was not much left on the drafting board to significantly enhance this time out.  But we're gonna' break this puppy down by the numbers.  Presentation What else can be said about the company that pioneered the 'ESPN-styled' hyper-pumped music video introductions-replete with rapidly edited clips of the greatest moments in the sport, along with slammin' tunage from every conceivable genre?  Any gamer, who has ever played an EA or 989 Studio football title, can tell you that part of the initial hype, centered around getting one's hands on the newest itereation, is settling back to enjoy the opening barrage of media blitz.  Well, NCAA Football 2001 lives up to the expectations of its predecessors, and the game just keeps on churnin' out the goods from there on.  After the dynamic postproduction video footage subsides, NCAA Football 2001  jumps into the main interface; which is standard EA fair.  From there, you have a ton of play options that include Practice Mode, Exhibition Mode, Season Mode, Dynasty Mode and Situation Mode; which is particularly enticing, because you can line-up on the brink of total failure (or success) in any one of many game breaking situations.  This is particularly nice when you have no one to play with and just want to get in a quick football fix.   The game also employs the use of the official BCS rating system, contains the all-time top 25 teams, allows you to play in Bowl games and is home to the (exclusive) Nokia Sugar Bowl and, of course, the FedEx Orange Bowl.  Look folks, you ask for the goods and they really do try to come through.  Honest!  Oh!  One more thing about BCS the rating system.  It is rather true to life. So if you expect to hit the bigtime, you better be prepared to pile on the points and finish at the top of the class.  However, all of the games needn't be fully played out.  You can, as the manual states, simulate games as always.  Then you can finish out the season by playing through the last few, to see if you can (manually) make the moves and decisions needed to arrive at the Championship.  If the BCS method is not to your liking, however, you can opt to play via the Bowl Game Playoff mode.  This mode has several ways to walk up the ladder, including a single elimination.   Other, adjustable, components of NCAA Football 2001 include a, full scale, team creation mode called Creating a School.  This mode allows you to create fictitious colleges or those not included within the 140 Division 1-A and 1-AA teams.  The engine that drives this 'creation interface' is quite intricate, right down to the size of the enrollment, the city and state name, nickname and mascot.  You even choose the uniform colors.  I found it fun to play with and very simple to use and navigate.  But the buck doesn't stop there.  Football fans have come to judge the merits of a football game by many factors-one of which is whether or not the game has a Dynasty Mode.  Well folks...you've got it once again. Better yet, it is up to snuff!  Set the Dynasty Mode up for coaching, and the fate of your career, as the Spurrier of the Millennium, will be up to your successes and stats as a true coach-just like the big boys.  You'll handle recruiting, review prospect reports, examine recruits and make all the major decisions.  All the power is yours...just hope that your knowledge and skills as a tactician are up to snuff.  Bad choices will result in termination.  It simply doesn't get any better than this.  Gameplay So, you've got an intuitive, well laid interface with all the options one could ask for, and you are now ready to hit the turf and navigate your team to history.  The Referee conducts the coin toss and the sides choose their respective end-zones.  You receive the kick, return the ball for 12 yards and proceed to enter the play calling screens.  Now you are truly ready to dig into the nitty-gritty of NCAA Football 2001.  As your team approaches the line of scrimmage you are given the requisite data on-screen, such as: quarter and remaining time, score, down and yards to go, a play clock and the neat-oh momentum meter. As you execute your plays, and dependant upon the home venue, the momentum meter will gradually fill (from right to left) and the roar of the crowd will increase.  This is a far cry form the days when there was one static sound that looped over and over, endlessly, as crowd noise.  Fortunately, there has been a paradigm shift, and it is not just 'crowd noise' anymore.  It is now, properly, referred to as crowd ambiance.  I prefer the [ah-m-bee-ah-nce] pronunciation myself. It is just so bourgeoisie.  Play well, down to down, on someone else's home turf and you will hush their crowd to manageable levels.  Play well at home and your fair-weather-fans will do their best to keep you pumped!  Play poorly, however, and you will find that the crowd 'ambiance' will gradually ebb and flow to you determent.  In blowouts of other teams, while at home, you will often find that your crowd is in the game with you, but not to the level of enthusiasm you find in more tenuous situations.  It is very lifelike in many aspects.  Actually, it quite amazing, to pay close attention to, just how much this stuff really impacts the way you will play.  Right down to your play calling acuity.  All of these in-game necessities are well placed and truly aid in making the management of the game's flow much more user-friendlier.  Play calling is a snap as well.  Well, not quite a snap, more like a scroll and a click, but who's keeping score? The standard EA graphic interface screens are chock full of exciting college football plays. College play schemes can be truly exciting and EA has captured that essence here. There is even a rather decent play editor that allows for creation of plays. You can also set up custom play-books with specified sets and formations, including plays you've created.  This is a feature I love to exploit.  You can't forget to configure your audibles well too, because against the CPU AI, you will find many instances where a line shift or an unexercised option just won't cut it at all.  EA has been refining the routines in their football games for some time now, and the results are dynamic. Play offense, put a man in motion, and watch the linebackers cover, or the line shift to compensate for a perceived weakness.  Pay close attention as you see the AI make on-the-fly adjustments to the ball on option plays and broken coverages. On defense, you will feel the pains of bad play calling as the offense will seek to exploit every weakness.  For instance, the AI loves to exploit the use of a punishing running attack, that will surely open up big gains passing-just as you start to tighten up against the run.  There is certainly none of the early '90s random play selection with no thought going on here.  You better think, 'cause the engine is tight.  Well...most of the time.  While EA purports that the game incorporates new pursuit angles, I cannot profess to have found this completely evident.  I am not saying it is inaccurate.  I am saying that I saw nothing, during my many games, to prove it was clearly observable AI behavior. (Get the hint?) What I did notice was that the running game seemed improved, and in some cases, almost to a fault.  Just almost.  The improvement manifests itself in the form of being able to read the lines reaction to a defensive surge at the snap, allowing for more accurate hole picking.  Which leads me to another aspect that is always under scrutiny.  There is no substitute for playing this type of game against a human opponent.  The quest for a football game devoid of money plays is still farcical at best.  These plays usually are rushes up the middle and passing attacks to Backs.  The same holds true for NCAA Football 2001.  However, you're gonna hafta' find'em yourself, 'cause I ain't tellin!  Nevertheless, the money plays are in there and can, in certain circumstances, skew the statistics of the game once exploited.  Accepting this as status quo, it is not nearly as bad as it has been in past football iterations. Not accepting this (provisional) flaw at all, and I would say that if there were a way to disable those plays, I would when I played against the CPU and I would not when I played against a human opponent.  So I am honest!  Really though, they are more decisive when playing with or against teams that are marginal at best from the onset, if the AI is the only opponent.  Nothing can really counteract money plays, other than good read and recognition, dexterity of the digits and good use of bluff play calling (when playing a real person).  Remember, money plays work both ways.   If a human opponent knows how to exploit a certain formation or play, bluff him into thinking you've called one thing and show up at the line with another.  This keeps you from harping on your audible plays too frequently.  Which is a certainly another way a player can begin to decimate your offense or defense.  (That was just for you folks that ain't figured that one out yet.)  EA has also implemented something called APC, or Advanced Player Control.  The skinny on this feature is that the game boasts all new moves like Power Blocks and Hold  Blocks for the Linemen.  Even the backs can be made to block when needed.  And your receivers will even call for the ball.   You can now also hurry to the line of scrimmage, a la NFL Gameday.  This scheme certainly adds a nice element to the game and is not just 'back of the box' marketing hyperbole.  Then there is the ability to view the routes and positions of your players via the coaches cam-which is a feature I truly dig to the nines.  Football games have always required an element that allowed for pulling the camera back, to see the lay of the land, before the snap.  In NCAA Football 2001 you can do it a bit more intimately, by actually seeing things from over the shoulder of your receivers-if need be.  This is accomplished by moving the analog stick around the field while holding the shoulder button.  But neat camera options are not all there is to like.  The pump fake does a nice job of freezing the backs for a step, and if you fire the pass in (just right) it can make for some spectacular replays.  Speaking of replays...let's examine how the game looks.  Graphics You can't honestly expect there to have been any milestone, benchmark, genre defining enhancements in the graphical presentation of a football game-found on a six year old platform with only 2 MB RAM?  Well, there weren't.  Leaps and bounds of graphical tweaks and enhancements went the way of the Dodo Bird about 18 months ago, for the aging PSX.  But that doesn't mean the game does not look nice, so long as you aren't trying to unfairly benchmark it against Dreamcast and available PS2 images.  As it stands, as a 32-bit game, NCAA 2001 looks just fine.  It is a bit hard on the ole' eyes after playing DC titles like Virtua Tennis and NFL2k, but in applying the aforementioned logic, you can easily understand why making the comparison, more than once, is just a foolish endeavor.  All other silliness aside, it is probably not as clean, in the texture department as the 989 PS stuff, but certainly animated well enough to be quite playable.  Quite frankly, the 989 titles have better player textures, in my opinion, and fall short on the field textures -- where I think EA has a better look.  There are other visual treats that enhance the overall experience as well.  Momentum based tackling is employed, and while not as evident as in the 128 bit world, the results of hitting a small Back with hulking Lineman are pretty clearly animated and projected.  Speed variances between player types are also readily discernable and can certainly be used to impact the results of match-ups, and EA has done a fine job a making the visual differences apparent from position to position.  This is not new to NCAA Football 2001, but an observation nevertheless.  Stadiums in the game are rendered nicely, as EA got those down many moons ago, and the 3D engine maintains a solid frame rate-something that EA has suffered criticism with in the earlier incarnations.  There are also some new tackle animations, which is an area that always seems to get some slight enhancement.  Well, to tell the truth, some of the animations are truly new and others are just represented a helluva whole lot better.  One thing I always enjoy in EA's games is the way they handle the juke and other running enhancements.  Usually, it is the simplicity of the execution that makes their titles shine, in comparison to others, and at this point I give EA a big nod for keeping things fluid, detailed but yet simple.  Sound Nothing to harp on, here in the sound department, except to reiterate that the momentum meter and the dynamic impact of the crowd effects is very impressive.  I have never been one that was too enamored with EA's football sound effects, but they have gotten better over the years and the ones employed here get the job done.  There is also no dedicated play-by-play announcing in the game.  So what you do get is just some PA type stuff throughout.  I kinda' dig it for college football, because the crowds can be manic enough.  Then, of course, there are the marching bands!  While LSU's fight song is not in the game, and I must admit I was sorely disappointed by that fact, other schools are faithfully represented, and the quality of the band work is nice.  Other than these critical college football aspects, the game gets a thumbs up for doing a good job of not being aurally annoying.  Remember NFL Gameday numero uno? Ack!Pound for pound, NCAA Football 2001 is a good college football experience.  With all of the included plays, variable formation strings and gameplay options, there is just loads of configurability and variety that one can extrapolate from this title. Considering its modest price point, that speaks volumes for the sheer value. Sure the game needs a revolutionary face-lift, and it is certain to make that transition when the PS2 versions show their muddied face masks as 128-bit offerings. But until that time, if you are looking for a fun college football game with many of the your favorite schools, and a presence that just feels like college ball, you need look no further than NCAA Football 2001.", "date": "Aug 2, 2000"}