{"name": "Virtua Athlete 2K", "name_review": "Virtua Athlete 2K (Import)", "ref": "https://www.ign.com/articles/2000/08/03/virtua-athlete-2k-import", "text": "If you consider yourself an old-school Saturn gamer, chances are pretty good that you've got a copy of Sega's fabulous Decathlete sitting around somewhere. The game featured ten track and field events, each injected with tight, hyper-spastic control. Adding to the fun was a cast of certifiably insane characters, and high-resolution, 60fps gameplay matched only by Virtua Fighter 2. In theory, a new Dreamcast Decathlete from the same team (Sega's newly-independent ~Hitmaker~) should equal button-mashing ecstasy, right? Virtua Athlete 2K falls into the same mold as old-school titles like Konami's Track & Field: you've got a bunch of mini-games, all of which reward you for mashing keys like a hyperactive four-year-old. Once you've mashed to a certain point, you typically hold a button down, which charges up your shot-put throw / long jump / javelin toss. Oh, come on, you know all this stuff already.  Since the gameplay is kept simple, a big part of any Track game's impact is usually in terms of presentation  (also known as 'fluff'): the variety of events, the graphics, and the multiplayer tournaments usually take center stage. This is where Virtua Athlete 2K starts to falter. There's a reason this game isn't called Decathlete 2 -- that's because there are only seven events available. Here's the lineup: 100 Meter Dash 1500 Meter Dash Javelin Long Jump High Jump Hurdles Shot put  As is the case with every track and field game, some of the events are more enjoyable than others. The Javelin, Long Jump, and Shot put are the most playable events in the bunch, and are quickly mastered. The High Jump is more challenging, requiring you to hold the Dreamcast controller in ways that can't possibly be ergonomic (I've found that the optimal pad position for the high jump is at an upside-down, 45-degree angle).  On the other hand, the 100-meter dash is a bit too mindless to lend itself toward replayability, and the 1500-meter dash is even worse. In this event, you have to run four laps around the track, while maintaining four stamina bars. Pacing yourself is the only viable technique... unless you take advantage of the freaked-out physics bugs. You see, whenever you collide with one of the other runners on the track, the game goes ~bloop!~ and you bounce off the other dude like a ping-pong ball. The AI isn't too bright, so you can pull in front of the pack, and let everyone else plow into you for a super turbo-boost. You can also get behind a guy and catch a free ride, via a bizarre ~slipstreaming~ bug that was evidently misplaced from American 18-Wheeler.  In terms of graphical punch, Virtua Athlete 2K is 90% there. The stadiums are gigantic and packed with detail, and the crowds don't look too bad. The game also maintains 60fps at all times, except for some instances of dramatic slowdown (chill out - it's there on purpose). The animation oozes motion-captured fluidity, and is definitely on par with the original Decathlete. Unfortunately, the characters don't use soft-skinned models like the ones in Soul Calibur or Ultimate Fighting Championship, and have the ~weird intersecting floating body parts~ look most frequently harped on in Virtua Fighter 3.  Sadly, Decathlete's characters have not made their way to the Dreamcast. In my humble op, Decathlete's lineup of athletes was just as thoughtfully crafted as the brawlers in Virtua Fighter 2: who could forget the German runner with his 80s-style mullet, the crazy Russian dude who went into spastic fits after setting a world's record, or the little Chinese chick who bounced around like a schoolgirl on meth? All of your favorite characters have been replaced, in favor of generic-looking shmoes in track suits. Sure, there's an edit mode, but it restricts you to making more generic-looking shmoes in different-colored track suits. You also can't create female players. Bummer.  But the worst is yet to come: in the style of most Sega arcade ports, you can clear the exhibition and arcade modes in under eight minutes. While the multiplayer mode is all well and good with three human opponents, the single-player game has not made a step of progress since Decathlete back in 1996. In short, it's crap. But here's what's baffling about the whole thing: Virtua Athlete 2K was designed as a consumer product, and not an arcade game. But why are there only seven events? Why isn't there some type of career mode? And why did I feel completely ripped off when the credits rolled eight minutes after my first try?  At least Eidos' Sydney 2000 attempts to include a substantial single-player experience. You can only replay Exhibition mode so many times before you've had enough.  And don't even get me started about the unlockable bonuses, which are nothing short of insulting. After completing the game, you collect ~favorite sports~ icons that you can assign to characters in Edit Mode. This means that the guy you just created can like Boxing and Swimming. Oh, whee. It's kinda like if you beat Soul Calibur, and your only reward was a text screen that read ~OH, AND BY THE WAY, XIANGHUA LIKES TO EAT STRAWBERRY PARFAITS.~  What a disappointment. I am not amused, and I imagine anyone else who blows $60 on the import will be similarly disillusioned. The bottom line? Virtua Athlete 2K looks pretty, plays well, but is crippled by zero longevity and fantastically shallow single-player modes. Worst of all, the game is nowhere near as fun as its four-year-old predecessor. ~Hitmaker,~ eh? Not with this one. -- Colin ~Cranky~ Williamson, IGNDC", "date": "Aug 3, 2000"}