{"name": "Action Bass", "name_review": "Action Bass", "ref": "https://www.ign.com/articles/2000/08/05/action-bass", "text": "Fishing -- it's the epic struggle between man and beast. For centuries, it served as the primary method by which man would feed himself and his family. And just as the old proverb says, ~Give a man a fish, he'll eat for a day...Teach a man to fish, and he'll eat for a life time.~ Life has been dependant on fishing, so there's no wonder that the need to fish has been imbedded into our genetic makeup as male members of the human species. However, with food no longer being something that each man must catch for himself, fishing is no longer a prerequisite to survive -- yet, it remains in our souls.   This probably explains why fishing games are so popular around the world and why there has been more fishing games released on PlayStation over the past few years than any other particular genre. Either that, or they're just really easy to make crank out like welfare babies.   Regardless of reason, Take 2 Interactive's budget-priced Action Bass is one of the most recent releases in this forever-popular videogame genre. Priced to sell at $9.99, it has all the prerequisites needed in a successful fishing game -- a baited hook fastened to a line and fish.   Gameplay T.F. Salter had said that in order to perfect the art of fishing, one would have to acquaint oneself with the proper baits and tackle. Well, this really proves to be true in this very arcade-paced fishing game. The most important thing that one needs to know in Action Bass to be successful is what lure to use and how to use it. Catching fish in this title revolves completely around casting the lure where the fish are bunched up and using the lure effectively.   At the onset, players only have five different lures at their disposal, with more opened up as they pass each new area -- of which, there are four open at the beginning of the game. Unlike other fishing games that are more simulation oriented, Action Bass is, just as the name suggests, all about Action. The game's main gameplay mode, called the Challenge mode, has players compete in a tournament where they must place in the top three in order to move on and there's a minimum fish size that they must catch for it to be included in their score.   There's also a free mode where it's just all about honing your fishing skills with no competition and no time limit. This is a great way to try and figure out where the bass like to swim, one of the keys of the game. Playing more like an arcade game than fishing simulation, the game places less weight on fishing skill, but instead focuses on having the player figure out where the fish are bunched up at and which lure will work best in the area. It's quite entertaining and definitely has an appeal that will attract gamers that aren't necessarily fishing fans. However, those looking for a more complete fishing experience might be turned off by the lack of control (limited to one area on the pond -- there's no driving your boat around a lake looking for the best spot), and arcade-style action.   Working with both the digital and analog control pads, the game is most fun when using one of the various fishing controllers for PlayStation. While it doesn't seem to have all the functions (casting is done by pressing the X button instead of performing a cast-like motion), it does provide excellence force feedback support and it's just a whole lot more fun to actually reel in a fish instead of just holding down a button.   Graphics Since the game lacks the full roaming 3D environments that have been included in most of the recently released fishing titles, the backgrounds above water in Action Bass seem to be a bit more detailed than its brethren. There are lots of cool reflective surfaces and nicely detailed background elements in each of the game's various areas. Underwater is a different story, though, as the scenery is pretty bland, there's a lot of clipping and pop-up and the bass aren't to highly detailed. Still, not bad for a fishing game.   Sound There are quite a bit of nifty background effects and ambient noises that really bring the player into the fishing environment. Nothing earth shattering or special to write home about, but it gets the job done and that's what really counts in the end.  If you're looking for a quick fishing fix that offers a lot of action-oriented fun, you can't really go wrong with Take 2's Action Bass. It's only $9.99 and it's definitely worth that price. Just don't expect an extremely deep fishing experience and you'll be fine with this title.", "date": "Aug 5, 2000"}