{"name": "Zusar Vasar", "name_review": "Zusar Vasar (Import)", "ref": "https://www.ign.com/articles/2000/08/09/zusar-vasar-import", "text": "Publishers and developers, listen up: I have had more than enough of this ~futuristic racing~ brouhaha. Lucasarts' three-day port of Episode One Racer left a bad taste in our mouths, Crave's MagForce Racing reminded that Wipeout is still king, and the only sign of redemption on the horizon comes from Midway's San Francisco Rush 2049. In the meantime, we've got to put up drudging through imports like Zusar Vasar from Realvision, and be force-fed even more futu-riffic, mecha-powered, no-holds-barred eXtreme racing. Oh, rapture. How I longed to play outside in the bright sun, as opposed to being forced to write a review of this one.It is the year 2800, and mankind finds itself fascinated with futuristic racing, in the same way that the Japanese are fanatical about game shows involving human torture. While a small minority of the world's population stand up and oppose such a completely  clich plotline, the others partake of Zusar Vasar, the Indian-sounding racing / battle tournament where giant animal-like robots tow steel sledges through sea, air, and land. It's very exciting. Really, it is.After loading data onto your VMU and happily proclaiming ~LET'S ENJOY!~, Zusar Vasar lets you start racing in three different areas  the Waterway, the Valley, or the Jungle. The style of racing varies depending on your environment, and your selection of robotic steeds differ as well  while two cybernetic dolphins may tow you along in the water, you may find yourself being yanked along by a pair of owls whilst flying through a city. With each race, you choose a pair of animals to pull you, then you choose a chariot to ride in. Both of these have unique handling properties, so selecting a decent combination of robot and sledge is crucial.And then the fun begins. Racing on the ground surface is similar to Sega Rally 2 -- that is, if the tracks were sprayed with Teflon beforehand. Your steeds slide about madly while turning, plowing into walls, and generally having a miserable time navigating through the environment. Bizarrely enough, you can toggle between ~Grip~ and ~Drift~ control styles before you start (though I can honestly say I've never seen a four-legged animal perform a powerslide in real life).Handling on the water area is roughly the same as the ground, except the drifting is even more obnoxious  sadly, this isn't Hydro Thunder. However, you do get to tag a ride off happy, tail-wagging sea lions and marlins, and that's kinda cute in and of itself. You'll occasionally come upon monster waves, which will send you airborne once or twice every race.Finally, you'll need to take to the skies for certain tracks  and this is, by far, the most enjoyable of all the gameplay modes. Instead of using L and R for acceleration and braking, the analog triggers control the amount of thrust that comes from your left and right steeds (similar to Star Wars Racer in the arcades). The resulting control isn't exactly subtle (expect to keep plowing into walls on tight turns), but it's a far enough departure from the normal controls to warrant interest.The track design wavers between good and mediocre. While the Jungle and Waterway tracks are marred by dull, repeating textures and geometry, the air-based city courses are surprisingly cool. These feature pathways cut through expansive urban skylines, and you'll weave between buildings and jet through giant stadium hallways. Not bad at all! Yet despite the fact that you're flying, you're nevertheless limited to turning left or right  there's no manuvering over or under your opponents. And this is a frequent problem in Zusar Vasar -- your steeds are extremely wide vehicles, and passing your opponents is a pain in your steel-plated ass. The slightest tap against your opponent's collision box will send you ricocheting away and plowing into a wall. Damn!Visually, Zusar Vasar isn't terribly exciting  the graphic design looks like a bad Beast Wars knockoff, with a few influences from Milton Bradley's Robotix toys. The biggest problem with the game's art is that the steelsledges have been grossly overdesigned, with far too much detail  it's like when you tried to fit every single one of your LEGO blocks onto a single castle. Needless to say, it looks like mush on a TV, and only slightly better on a VGA monitor. There are other irritating graphical niggles as well  your sledge's exhaust trails frequently collide with the camera, blinding you for a few frames, and some of the special effects (like the explosions) are pure cheese. The game is also stuck at 30fps, and judging by the lack of trackside detail, it should have been running at sixty. And one final complaint  the musical soundtrack is the most mind-numbingly bad thrash rock I have ever laid ears on. Imagine the instrument samples from Rock 'N Roll Racing on the SNES, with music composed by the very worst high school garage band. At least there's a lot of actual gameplay content in Zusar Vasar. There are a total of 21 tracks available, but only three are open from the get-go  you'll need to place first in the single races if you want to unlock them. There's also a Championship Mode that spans sea, air, and land, along with a Battle Mode (but this seems like more of an afterthought than anything else). There are also split-screen races, which get the job done in a pinch. But as soon as I zip up and send this review, my copy of Zusar Vasar is getting chucked into the Pile of Mediocre Rubbish I Will Most Likely Never Touch Again. Zusar Vasar isn't particularly a bad game  but there are plenty of better games to play out there, and after all, life is short. If you're looking for a red-hot, super-sexy import to blow your hard-earned cash on, this week's Ferrari F355 is the way to go  you may not be racing giant robotic monkeys, but at least you'll be having fun.-- Colin ~What's a Zusar Vasar?~ Williamson, IGNDC", "date": "Aug 9, 2000"}