{"name": "Seaman", "name_review": "Seaman", "ref": "https://www.ign.com/articles/2000/08/09/seaman", "text": "Seaman, Day One: I have forgotten to bring the Seaman seed disc home. It now lies on my desk at the office. This does not bode well for my parenting skills.    Seaman, Day Two:  Seaman will not allow me to view its habitat until I purchase a VMU with 64 blocks of free memory. I will try harder next time to complete this task.  I have, however, come into possession of a Seaman advertisement. That, coupled with the bizarre VMU Microphone device that is included with the Seaman seed disc, has sparked the interest of many bystanders, several not as experienced with the Dreamcast as I. Those wholly unfamiliar with this unit have been witness to evidence of this strange creature, and are inquisitive. This is a good sign.  Seaman, Day One (Official): The Birth  I am greeted with an introduction by Leonard Nimoy. He frightens me.   I have played with the Seaman for a half-hour now, and all I have to show for it is a mutated egg bobbing in water, a sunken food pellet, a seemingly broken heater, and a crick in my legs. The Seaman experience may prove a bit daunting for the uninitiated.  The controls left me completely alone with my tank and my Seaman. Fiddling with the controller [Editor's Note: Or else investing time in the game's manual, which is a fascinating read but perhaps should be skipped at least the first time through due to spoilers in the raising of the Seaman creature] has eventually led me to learn how to turn on the light, clean up the air, drop in the egg and a food pellet, and stare at a shell. This may prove too daunting for even the initiated.   But after hours spent, I'll be damned if it doesn't look like the egg is finally growing tentacles.  Seaman, Day One (Cont.): The Birth -- Eventually?  I had become fed up with waiting. Hours ago, I ended the session to hopefully get some assistance from Mr. Nimoy on what to do next. Instead, I rejoined the Seaman to find that nothing has happened. The egg was still bobbing up and down, and the tentacles that seemed to indicate progress had receded some. Why had it not hatched?  Time and distance are key elements in approaching science. If you put extended time and distance between yourself and your research, you may be able to find things not so apparent when scrutinized up-close and with immediacy. For instance, out of frustration and lack of will to work anymore for my infertile egg, I allowed the tank's temperature drop. It dropped low beyond the 30+ degrees I had set it at (a good temperature for a living thing, I had assumed). It was at the exact instance where the thermostat fell below 20 degrees that the Seaman began to throb and grow. Suddenly, I felt a little ashamed. Partially because I have just used the words ~throb~, ~grow~, and ~seaman~ all in one sentence -- I would hate to have my colleagues laugh at my scientific data simply because of juvenile tendencies, but what else can I do? But mostly I was ashamed because I gave up too hastily when, had I just trusted in the name of Sega and allowed the experience to work as it is designed, I would never have given up and lost the faith. I will learn to trust the Seamen.   When all is right in the tank, the Seaman hatch.  Seaman, Day Two: Good morning. I now have four to five days with my baby Seamen. In that time, I must discover a way to evolve the hatchlings, or Mushroomers, into adult Seamen. Already one of the eight fledglings is dead. Mr. Nimoy had explained at the beginning of the session that the Nautilus (a big sea crab now awakened in the tank) may be of help in raising the Seamen. So I brought them over to play with the Nautilus. It promptly ate one of my Mushroomers. The will not be playing with the Nautilus again any time soon.  The Mushroomers are sleeping peacefully now, suction-cupped to the side of the tank. They danced about earlier, and several have looked at me for the briefest of moments. I will not name them until the Safety Period is over, following proper medical procedure.   The Nautilus is creeping around under where the Seamen rest, and I don't like that.  Seaman, Day Two (Nighttime Entry): Mr. Nimoy has suggested that the Nautilus may play ~a key role~ in developing my Mushroomers into Seamen. Tonight's experiments will focus entirely on the learing about the Nautilus creature. Here is the extent of my observation:   10:00 PM: The Nautilus is a shellfish crab creature that eats Seamen. 10:05 PM: It can swim. 10:10 PM: I can pick up the Nautilus and look at it. It is a crab-like shellfish. It pops its body out of its shell ever now and again. 10:15 PM: I have witnessed the Nautilus both swim and walk. It performs this using its tentacle appendages. 10:30 PM: The Nautilus doesn't do much else. It swims and crawls. Picking it up neither aggravates nor excites it. It is a dull crab-like shellfish. 11:00 PM: Still a dull crab-like shellfish. 11:05 PM: Turning on the air vent, I find, sometimes aggravates the Nautilus. It spins around madly. 11:10 PM: I turn on the air again. 11:15 PM: I turn on the air again. 11:20 PM: I turn on the air again. 11:30 PM: Dull moments have passed. I turn on the air again. 11:45 PM: I turn on the air again. 12:20 PM: I turn on the air again. 12:45 PM: I turn on the air again. 1:20 PM: The Nautilus eats yet anouteh of my Mushroomers. This is the last time I ever reserve a night for studying crab-like shellfish.   Good-night, Surviving Six.  Seaman, Day Three: No, no, no, no... No! It's happening already. I am sluffing off, thinking of myself and shirking responsibility! I'm so... Just think of what might have been had I been one hour later...  The cause of my grief is this: Tonight I fooled and flittered around, goofing off. I'd like to say I spend the night enjoying myself, but the truth of it is that I spent a rather dreary evening in front of a computer screen trying to keep up with a Turkish chat room that a friend had invited me into. An utterly dreadful experience -- if I were an agent of the government rather than a scientist, my first cause would be the abolition of chat rooms!  But I digress, and digressing is what got me into this mess in the first place. So at two in the morning, I stumbled drowsily through brushing my teeth, checking the answering machine, eating dinner, brushing my teeth again because I forgot I hadn't eaten when I first brushed them, and finally falling into bed. Just as I was about to doze off, my cat leapt up on the bed, waking me anew. Stupid pet. Pet...  The Seamen!   All night I had forgotten about them. Would they still be alive after nearly 24 hours of neglect? I pop in the VMU, slap the power button. The Dreamcast logo flutters, and I'm completely unnerved as I wait through the corporate logos and rigmarole...   ~The Mushroomers are dying from lack of oxygen.~ My Nimoy did not mention that they are also freezing in the cold tank. Or maybe he did, and I missed hearing it in my panic. His grave voice told me what I already knew, but his words still stung when he told me that my visits to the tank were becoming ~erratic.~  Everything is fine. The crisis was avoided, and the Mushroomers are now doing fine. Still, I am worried about the consequences. Not about some repercussion later in the Seaman's life. Retorts, I will take as if a part of a teenager's life. But I worry about my ability to parent the Seamen, to raise them without fail, to keep a watchful eye over the Nautilus every day, and to constantly keep in contact with them. Had I not developed such a personal attachment to the creatures, I might simply take them for granted as synthetic creatures, looking up a FAQ or cheat for the easiest way to raise my animals. But I want to be a part of their life. I want the experience. And now I have six (out of eight) Mushroomers left, and I see no signs of change. I am doing the best that I can, and I'm not sure it will be enough.  Seaman, Day Four Today, I moved a rock. After yesterday's near-disaster, I decided to work closer in bonding with my Mushroomers. Unfortunately, there is precious little in the tank to work with. When I finally found that the rocks can be moved, I was estatic! After all, there's only so much you can teach a Mushroomer by tapping on the glass.  I have brought the Mushroomers over to see how I can move the rocks. Their reaction is dull disinterest. Maybe they're still sleepy from last night's late bedtime.  Seaman, Day Four (Addendum): I am moving the rocks again. The Mushroomers again seem unfazed.  Seaman, Day Four (Addendum 2): Again, I move the rocks. I think maybe I'm just doing this for my own amusement.  Seaman, Day Four (Addendum 3): Again I move the rocks. If only there were more to do in the tank.  Seaman, Day Four (Addendum 4): I feel like a schmuck now. I have come back so many times to move the rocks that the narrator has called me a loser. ~You visit the tank an awful lot... As if you have nothing better to do.~ Sheepishly, I move around the rocks.  Seaman, Day Four (Addendum 5): I moved the rocks again. The Mushroomers have learned zilch from the the lesson. But they patiently watched with vague interest as I move the rocks, which would have please me were it not for the fact that, while so wrapped up in my experiment, I hadn't noticed the Nautilus beginning to swim about. By the time I saw it, it was upon my Mushroomer flock.  Only five survive.  Seaman, Day Five:  Two Mushroomers are dead. Without reason. There were five when I went to sleep, and yet when I check in this morning, only three are left. Two are floating belly-up in the tank, inexplicably lifeless. I should have prepared myself better. I already knew that the Mushroomers only lived for four to five days. But I suppose there is no amount of preparation possible for such an event.  The surviving three now depend on me finding a way of evolving them to the next step of their evolution...  Seaman, Day Five (Nighttime Entry): ~I regret to inform you that all of the Mushroomers have died.~ Four to five days.  Seaman, Day Six: The Next Breed Another egg in the tank. The old Mushroomers have all wilted away, and the Nautilus has returned to it's dormant state. No trace remains of the creatures who once dwelled here. Life begins anew.  Seaman, Day Six (Nighttime entry): Poof. Eight more Mushroomers. And again the Nautilus awakens. This time will be different, I promise.  Seaman, Day Seven: Mr. Nimoy has given me a suggestion on how to evolve my Mushroomers. It would be rude of me to explain what happened next, but it did. I have four Gillmen. At last.  The Gillman is exactly the creature you would think to find in a tank labeled ~Seaman~ -- part sea creature, part man. And as it turns out, intelligent man. Or so I am told. I will find out for myself firsthand.  So what do you say to a newly-discovered creature, an alien of all worlds encountering its first living compatriot of this galaxy? What do you say to inspire the first newborn generation of a unique species? ~One small step for man, one giant step for Seaman?~ Perhaps, if you want to bog your poor creature down in psuedo-philosophical elitist pandering from Day One. ~Welcom to my world. My name is...~ Possibly, but what that follows with an awkward experience where the Seaman tries to answer back, but can't because it hasn't a name. It is forever scarred because of it's inability to communicate at an early age. The counseling bills alone...  No, I suppose the best way to approach this is to eschew the scientific approach and just go with one's own personal experiences. What has shaped my own life? Television, of course. So, as my own knowledge bank owes dearly to television, I will now share with my Seaman the greatness of what TV has taught me.  ~Coolness, bud.~ It's response? ~Hey~ Hey? Hey! As in, ~Hey, I know that show!~ Quickly, I try asking it a question.  ~Whazzup?~  ~Shirpa.~  What? Suddenly, I realized that the lines of communication will take time to develop. It is, after all, just an infant.  Seaman, Day Eight: The Gillman's vocabulary consists mostly of gibberish. I have attempted to communicate with it by mimicking its own words. Perhaps by listening me, it could eventually learn to repeat back phrases, and eventually I would be able to teach it new things. For instance, if I were to show it a rock and say, ~rock~, it would learn to associate the word with the object. Eventually, it would learn what a rock is.   I will now attempt communication. Here is a rough transcript of my attempt.  ~Hello.~ ~Goh.~ ~Go?~  ~Quaffa!~ ~Quaffa!~ ~Darvenga.~ ~Darvenga.~ ~Hoy.~ ~Hoy.~ ~Floy.~ ~Floy? ~Camawoo!~ ~Camawoo...~ ~Rep.~ ~Rap music.~ ~Shirpa.~ ~Shirta?~ ~Pabra.~ ~Papa?~ ~Conquinne.~ ~Can I quinney?~ ~Hee!~ ~Wheeee!!! ~ ~Yealwhen.~ ~What?~ ~Darvenga.~ ~You said that already.~ ~Mar mar mar...~   I can see this process will take a lot longer than I expected. That's just as well that it take a long time, since there is very little in the tank to teach them about. The first lesson would be teaching them how to say ~rock~, then ~big rock~, and after that it's pretty much recess.  I am concerned about the four remaining Mushroomers, as there is no longer any way for them to evolve. Currently  they are swimming around blithely, but the little hatchlings have a very protracted lifespan, and besides that, are defenseless and quite small, making them prime candidates for a Gillman snack. However, they are content now, silently swimming left to right, occasionally spinning loops every now and again.  Seaman, Day Nine: Yes, the Mushroomers have died. Now, I know what you're thinking. ~How!~ and ~What about the four to five day lifespan~ and yada, yada, yada... But please, people -- we have much more important, more amazing matters to attend to!  Visitors had come while I was working with my Seamen. I shut down the tank while entertaining, but eventually talk veered towards my projects, and I mentioned the new pets. They curious, so I brought the Dreamcast out and showed them my Gillmen. I let my mother speak to it.  ~Hello, little Seaman.~ ~Camawoo.~ ~Hello.~ Hello.  The Gillman spoke. It spoke to my mother and not me, a rather distressing experience seeing as how I had been working with the creatures all along, but a revelation all the same! Over the course of the evening, I was able to teach the four Gillmen these words:   Hello OKHeyWhatNoYesBabySeamanGoodNight  I am exhausted. Exhausted and exuberant. I will teach the Seaman more tomorrow morning. For now, I let them rest, and myself as well. So much has happened, we have both earned a good night.  Seaman, Day Ten: Something disturbing has happened, and I am not happy at all. The illusion has been shattered. It's all happening too fast. Everything is out of control, just when it seemed that everything was finally right in the world. I am upset. And disappointed. And shocked.  I returned to my Seamen to continue our lessons. I wanted to be sure they knew how to ask for food, so that was the first thing I asked my Seamen.   ~Hungry?~ ~I'm too mad to eat!~   Excuse me? Suddenly, the Gillman have gone from babbling baby-talk to uttering fully realized sentences, in a single evening and without any instruction from myself. Now, perhaps the Seamen have learned to talk by communicating with each other while I was away, but even so, the time frame is off and they are repeating words I never taught them. And for the first time in a great while, the illusion has been shattered. These are digital creatures.  Angry digital creatures, too. I ask if one wants to play, it tells me, ~go play with yourself!~ I try to teach it things, and it complains. ~Not on an empty stomach.~ Swell. I'm mad at them for trying to treat them as real, and they're mad at me for trying to treat them as such.  I came back later that night and found two Seamen floating dead in the tank. The other two are fine, if you count being completely mad at me for no good reason as ~fine.~ The tank's conditions are perfectly normal. It seems that the dead Gillmen have been attacked by the nasty other two. And Leonard Nimoy has still given me no instruction on how to keep my Seamen happy, fed, well slept, and clean. I can't even scoop out the two dead Seamen. But it's just as well that they're dead -- if they were born to turn out like the other two, good riddance. May you soon be joined.  Seaman, Day Eleven: Giving up on  my habitat has brought me nothing, whereas working with my Seamen has brought me great joy in the past. I now return to my tank with a renewed attitude, determined to look beyond the flaws of artificial life. What has even God made that's perfect?  And I am rewarded for my care. It turns out that the two Seamen who died were destined to die -- natural selection, as it were. The fittest of the species will perpetuate, according to Darwin, for the best of its kind. I do not know if Seamen mate -- and since they are from the same egg, I would rather that not occur -- but it is good to know that the best of the genes are to be passed down, and that Seamen will become stronger as a species because of this.  Leonard Nimoy has praised me ~Good work.~ Thank you.  The Seamen are bigger now -- they grow at an alarming rate. Their voice has deepened since I last played with them, and they no longer babble like children. Yes, they still like to be picked up and played with, or petted every now and then, but they are now growing into full-fledged creatures.   Gillmen are curious creatures, and they wish to know all about me. Stupendous! Already, they have learned my age, sex, and birthday. Fantastic! And I have learned from it that it has repressed memories of its past life, possibly as a man, possibly as a fish, or possibly as a genetic by-product of Dr. Gass, the man who originally experimented with Seamen. Fascinating! I have also learned to feed the Seaman, and have come into possession of a tank of bugs to further supplement their diet. Progress!  Oh, and I have also  learned that the Seamen hate me.  The two Gillmen do not hate me equally -- one is slightly less disdainful than the other -- but they both despise me to a degree. When they learned of my birthday, they called me a Moonchild. ~You know, Ernest Hemmingway was born on that day. He drank like me, or so I'm told. Oh, what am I telling you this for? You don't get it...~ Ha ha, the Seaman made a funny. At my expense. The other one called me a Superfreak.  A bitter attitude seems to permeate the creatures' attitudes. Both are foul-tempered, and though I wish to become better friends with them, they regard me as a geeky outsider, and a dull one at that. I appreciate it's accuracy, but just once, I would like to be loved. Not a hug, but just...  Digital fish men. And yet there is a humanistic quality there that I cannot deny.  Seaman, Day Twelve:A Final Test For Newly Living Creatures The culmination of the experiment. I will continue to raise the creatures after today, but this is the true test of the creature's raising. I will bring it into the offices of IGN and allow it to communicate with people from the outside world. Hope, save us all!  My fears of what would happen to the creatures were certainly not shared by the Seamen. They were overjoyed to be out. Out with people. Different people, with different languages and different dialects. Different people who could teach them bad manners.  And that's exactly what happened. But what a time they had, out free and in the wild we call civilization! Of course, the Seamen were not able to tell that I was not the one handling the controller any longer [Ed. Note: If they had, it would have been a Herculean miracle of voice-recognition programming, a feat which Seaman is already pushing. Had the Seaman become too accustomed to a single voice, it would have become confused by other voices and would have failed to recognize words], but that did not discourage at all their quest for knowledge.  Here is what one Seaman learned over the course of the evening:   It's name is Pissdrunk. It's keeper -- myself -- works in the sex industry. My education continues still in grade school, even though I am well into my 20s. It is sad for a grown man to still be in grade school. In my spare time, I like to eat children   Add to that a bong load full of curse words (which the Seaman refused to repeat back, but nevertheless learned and is now waiting to use against me some day), and you get to realize why the thing that I learned from this experience is this: I hate IGNPSX's David Smith and Dave Zdyrko.   Before completing this journal, I checked in with my Seamen to see if perhaps they had shirked off what they had learned. Perhaps they might once again be taught class and respect for authority. Floating loosely in the tank was a huge steaming pile of poop from one of the Seamen.  Damn animals.    So what's been learned from this experience? The most important thing is that Sega and Vivarium can accomplish wonders with voice-recognition software. Seaman's vocabulary is astounding, and so is it's ability to understand. Granted, things work best when you speak slowly, clearly, and use short phrases rather than sentences, but there are plenty of occasions where the Seamen respond to whole thoughts rather than just single words. That's a feat that hasn't ever been done in gaming before, and all of that comes without any major training course or speech therapy like a handwriting-recognition device would. After just a day of communication, the creatures understood me.  Seaman is also a brilliant experiment in artificial life. Whereas most companies would be content with programming swimming fish or a Tamagotchi egg, Sega went to the limits to make something living and breathing.  We also learned that basement-level programming doesn't benefit a grand scheme like this. The instance where the Seamen knew all kinds of phrases I had never taught them happened often. And there are plenty of occasions where you can literally see and hear the code cranking and clicking away. As soon as the tank rises from 19.9 degrees to 20, the Seamen start to gripe about the heat. Like a switch had been turned on in their brains. And when the Dreamcast CD spins up when this happens to load up that voice sample, you know that it has. There is no fuzzy logic used. Once an event is triggered, it happens. Not a second before that, not a degree beyond.  And we learned that a graphically sparse game only offers so much enjoyment. The game's camera, for starters, is woefully digital rather than smooth and natural. You never believe that this is a real tank because the zoom feature looks like a sniper rifle zooming in Quake. The Seamen themselves are wonderfully detailed, with fully articulate human faces eerily grafted onto fish bodies. But that is at the expense of everything else in the tank, and even then, the framerate chops up some. More rocks or shells or -- dare I say it -- Nautilus creatures would have been a nice variation, but the game is just about the Seamen, and so that's all you get. Love it or live with it.  The most important thing that we've learned from this is that Seaman is a pet that takes quite a bit of devotion and care for sometimes little return. You can spend hours trying to talk to it, but it just won't be interested, and while often that's because it's moody, other times that's just due to the fact that event triggers are spaced out in time so that the game is continually fresh. If the illusion of it all being ~just a game~ ever hits you like it did me, you may not care as much for Seaman as I did.  And who will be able to devote the kind of emotional energy into such a game? That question still remains to be answered. People like me who love unique, wholly fleshed-out gaming experiences will be stomped on by the disobedient Seamen and the quick development cycle of the Seamen from babies to crotchety old men -- imagine only getting a single year with your precious toddler, then spending the rest of those 18 years raising rebellious teenagers who hate their parents. On the other side, fun-loving jerks (also like me) who just want a neat toy to show friends will be stuck caring for and nurturing a pet until it gets to the state where it knows curse words. It's not just something you just pull off the shelf to show your buddies -- it Seaman hasn't been played in a while, the clock needs to be rolled back or else the Seamen will be dead. And, in a remarkably wicked turn on Sega's part, the game auto-saves at any crucial moment -- if you try experimenting with the Seaman and accidentally kill one, the game will save quickly before you have a chance to shut it off.  In life, there is no reset button. And in Seaman, there are no casual users. You have to give it daily attention -- often twice daily. You can't even bring the Seamen with you and care for them in the VMU -- you will need to give your Seamen to a baby-sitter if you expect them to survive. This is all very much like real life, and that's part of the beauty of the game, as well as the fountain of its woes. Try as hard as you can with Seaman while it still fascinates you. Get all that it's worth out of every day. You don't have to take the same stringent scientific approach I did, but you should still experience it as honestly and carefully as possible. Let them live, let them die. And when you tire of them, tape a Post-It on the back with the last-played date so that you can roll the system back and pretend that you never left.   These are amazing creatures, but they are not quite human. Yet if the most is made of every moment of the Seaman's life, they may become as much alive as you and I ever will be.   --Prof. Marc Nix  What's your impression of Seaman? Has the experience blown you away, or is this just a dressed-up Tamagotchi? Check out the scores below, then drop into the Dreamcast Boards and voice your opinion. Just don't panic!", "date": "Aug 9, 2000"}