{"name": "Virtual Deep Sea Fishing", "name_review": "Virtual Deep Sea Fishing", "ref": "https://www.ign.com/articles/2000/08/09/virtual-deep-sea-fishing", "text": "Stop me if you've heard this one before.  Man likes to fish.  Man goes to store and is suckered in by a cheap, yet pretty looking fishing simulation.  Man heads for home and finds out he's purchased a piece of chum that's got about as much in common with TNN's favorite sport as Dennis Rodman does with good taste.  Man wonders who else will be foolish enough to fall for Virtual Deep Sea Fishing and hides in the closet in shame for a week.  Fishing sims, especially the arcade-ish ones, come and go like the rising and falling of high tide.  But every month without fail, a handful wash up on bargain bin shores.  Virtual Deep Sea Fishing's been out for a while now, but as it purported to be a classy action title in the same vein as Electronic Arts' incredible Championship Bass, we thought we'd put it to the test.  As for the results, heh, let's just say that public schools' scores are looking up.  Warning flags were first raised when the main menu was surveyed.  Apart from the animated shark which dances along beside it, there's not a whole heck of a lot to dive into. Single player mode gives way to only two play options, fishing trip and tournament, neither of which are going to raise virtual anglers' eyebrows these days.  Two or more players can live it up and go head to head via a modem, LAN, IPX, or Internet connection.  Photo album and world record options let you relive past glories without the trouble of bringing home a 200lb. stuffed and mounted catch, but neither adds any value to the game.  If you don't know the drill by now, a fishing trip is taken at your leisure, while a tournament imposes minimum weight rules, competitors, and time restrictions.  Whichever way you choose to play, be prepared for choppy waters.  Past the boat selection screen--which lets you choose a craft based on forward speed, reverse speed and turning attributes--and trip planner, things get nasty real quick-like.  Sailors of the high seas will find that in this title's case, at least, still waters run shallow (Get it, get?  Run shallow!  Hey, put that stick down!).  As the in-game view opens, you'll find yourself adrift in the middle of the ocean under a clear, blue sky with no distinguishable landmarks in sight.  This wouldn't be so bad, were it not for the fact that in every locale, no matter where you choose to weigh anchor, the scenery is identical. Regardless of whether one's in Phuket, Thailand or the Cape of Good Hope, the environmental never changes, although seagulls do swoop by occasionally as if to mock the player.  The constant sounds of waves lapping and birds cawing should give you plenty of motivation to ponder the hopelessness of the situation.  A 3D view of the boat is used to portray navigation, controlled by the arrow keys.  Fishing spots are located through psychic powers, I suppose, as no hints, clues or visual indicators tip you off to the areas where fish are hiding.  Upon reaching the desired destination, a big, fat cast button needs to be pressed.  After this is done, the title promptly whips up a behind the back view of a male fisherman who goes ahead and casts, with no prompting on your part whatsoever.  Gee, that's swell.  The automatic throw does away with the penalties that you'd have suffered for a bad cast, but also eliminates any skill that might have been involved as well.   To put it gently, the fishing model's even more depressing.  Once your pole's in the water, it can't be moved.  Basically, it's the player's job to sit around and look for white blips on the radar that indicate the presence of fish.  Until one of them bites, your activities will be confined to trolling (aka slow movements of the boat in random directions).  However it happens, a fish will eventually chow down on the current selection of bait, and it's then that the pace picks up a bit.    Though the usual man/fish tension meter is used to portray the struggle, the need to drive the boat towards your catch while reeling it in plays more of a role in resolving the conflict than wiggles and jerks on the rod.  The fisherman's uncanny ability to communicate coherent orders to his first mate and have them unerringly plot a course on the fly when the action's going down defies logic and reason.  Don't think they didn't save the best for last, either.  Whoever designed this monstrosity thought that it would be a good joke to switch the camera angle to an underwater view only after the fish was ready to be brought on board.  Brilliant!  There's nothing wrong with adopting an unrealistic stance towards the depiction of a sport.  There is, however, something obscene about going this route without justifying the decision.  The people who'd purchase this title are the ones interested in the real life activity, so what good does a title that has nothing in common with authentic outdoor experience do them?  Products like Trophy Bass 4 have the decency to back up their bravado with entertaining gameplay and polished graphics.  Virtual Deep Sea Fishing, on the other hand, makes no excuses for its inadequacies, and in the end it just plain bites.  -- Scott Steinberg Comment on this story", "date": "Aug 9, 2000"}