{"name": "Metal Fatigue", "name_review": "Metal Fatigue", "ref": "https://www.ign.com/articles/2000/08/10/metal-fatigue", "text": "So I thought at first that the whole Metal Fatigue title could be exploited for some sort of humor in the introduction to my review. You know, something like, ~I'm fatigued because I stayed up all night playing this game.~ But instead I find myself saying, ~I'm tired of playing this game already.~ While Metal Fatigue does bring some original concepts to the genre, the overall game is a rehash of so many standard RTS conventions. While I'm not one to fault a game for not being innovative or groundbreaking, Metal Fatigue is just one more of the group of unremarkable strategy games on the market already.  But first let's focus on the good things about Metal Fatigue. There are big robots in this game and they beat on each other with axes and shoot missiles out their chests. How could you not like that? Each robot, ahem, I mean combot, is constructed and assembled piece by piece. You'll have to select and construct a torso, a single pair of legs and two separate arm pieces to fashion a complete combot. Metal Fatigue tells the story of three brothers each of whom is competing for ownership of the coveted Hedoth alien technology. Each of these brothers has a unique set of combot parts to choose from. While each of the parts is unique, there's a similarity between them that ensures equilibrium.  The main difference between the combots is in their capacity to dish out specific types of damage. The Mil-Agro CorpoNation relies on kinetic weapons designed to pummel their opponents into the ground. The individual components of Mil-Agro combots (axes, gatling gun arms, howitzer torsos, etc.) focus on getting close to the enemy and dishing out the physical hurt. The Neuropa combots, by contrast, are more focused on speed and long-range energy attacks. The unfortunately named RimTech CorpoNation is the Baby Bear of this threesome and relies on a nice balance of weapons from both the energy and kinetic damage categories. Unfortunately, this winds up meaning very little early in the game because you'll only have access to the kinetic damage components. You'll only get more and more of your company's parts as you progress through the missions.  But even playing a single campaign, you can gain access to the other players' parts. As your combots engage in combat, parts of them will fly off, an arm here, a pair of legs there. You can send your construction/resource gathering vehicles to pick up these parts and carry them to your assembly bay for use in your own robots, ahem, combots. And if you have a research facility, you can begin to construct those parts for yourself. But while the concept of combot design is a great feature, it comes across feeling like too much of a gimmick given the lackluster concepts behind much of the rest of the game.  The only other two notable improvements that Metal Fatigue has over most of its RTS colleagues are the differentiation between energy and kinetic damage and the carry-over of unit experience and upgrades from mission to mission. The upgrades are handled on a point system. You get a certain number of points for completing each mission and you can earn bonus points for achieving certain secondary objectives. These points are used in-between missions to increase the experience level of any surviving combot crews (the combots don't persist from mission to mission, just the crews, and you have to re-recruit any old crews once the new mission begins). You can also use the points to increase the overall quality of your other vehicles and structures.  The vehicles and structures aren't anything new in the RTS scene. You've got tanks, artillery and light attack vehicles equipped with missile launchers. The infrastructure supporting all of this military might is nearly the same as it is in other games -- you've got silos, vehicle factories, walls, turrets and few other goodies that will be instantly recognizable to anyone who's played an RTS game in the past 3 years.  My two major frustrations with the game involve the resource modeling and the multi-level battlefields. The single harvestable resource of the game is lava. While it's far too late for gamers to complain about the conversion of crystals and gas and such into manufactured goods, I would be lying if I said I didn't find the concept of sucking lava out of pools and using it to build structures and units a little weird. To be fair (and I'm nothing but, by the way) the lava is converted into ~metajoules~ and it's these credits that allow you to build your forces.  But my complaint doesn't really have much to do with the improbability of turning lava into robots. It is instead that the pools of lava that you must harvest, continually regenerate themselves. Strategy gamers fall into two categories: those who wipe out their opponents with lightning-fast invasions and those who play for time, building up an elaborate set of defenses until they can wear their opponent down. This second type of play has no place in Metal Fatigue as the supply of resources available to either player is virtually unlimited. Until I discovered this design decision or ~flaw,~ if you will, my war against the computer was little more than a brutal battle of attrition. If you're this second type of player, you'll need to change gears quickly to avoid being suddenly overwhelmed in the middle of your game.  The decision to include a battlefield of multiple layers -- space, land, and underground -- is a mixed blessing. While I love the added tactical touch of being able to outflank your enemy by going over or under his army, the coordination of several different layers of fighting isn't made any easier by the interface or the friendly AI. You can switch pretty easily between the levels but if you want to keep the small inset maps for all the levels open, they take up far too much space making maintenance of your growing empire that much more difficult. Fortunately the developers have seen fit to include a truly remarkable number of hot key commands to streamline the process.  It's much easier for an enemy to escape complete destruction by fleeing from one layer to another. On one particular mission, I had wiped out the entire enemy base only to discover that he had an even stronger base established underground. And since the combots are unable to travel underground, this involved another change in thinking. While I appreciate that flexibility is the hallmark of any good strategy, Metal Fatigue forces you to reinvent your tactics and strategy over and over again in the early stages of the game. I'd love to say that this inconsistency wound up challenging my strategic sensibilities, but it just wound up being frustrating.  Metal Fatigue is, like so many other strategy games, rendered in full 3D. And like so many other games, it seems as if the move to 3D doesn't add anything to the game that would be missing in 2D. Metal Fatigue is 3D just for the sake of being 3D. 3D is entirely appropriate in cases where line-of-sight is an important factor or where you can get down to the level of the action. Neither of these issues seems to be very important in Metal Fatigue. The 3D is really only useful for getting a look at your units that have passed behind a mountain or for trying to locate a specific enemy in a giant clump of units. The camera controls are very smooth but they don't allow you to get close enough to the action.  There are a few other minor bugs with the game, like the fact that the menus are hard to read if you set the screen resolution higher than 640x480 and the tendency of units to clump together even in broad, open spaces. The game interface is inelegant as well -- you have to look at the right side of the screen to see what you're building or buying and you have to look down at the bottom left to see the unit or building's cost in resources. It's a small annoyance, but all the information should be consolidated into one display so you don't have to look from side to side to figure out what the hell is going on.  Every since I started playing this game, gawkers and hangers-on have stopped by my desk to see how things were progressing. The big joke has been ~Is the game as tiring as its name implies?~ I usually laugh for a second just to make the person comfortable and then jump out of my chair and beat them to the ground. Ultimately though, the answer to the question is ~yes;~ Metal Fatigue may do a few novel and interesting things to break with the RTS standard, but the overall quality of the game is smack in the middle of the RTS spectrum. As we've seen so often in this business, the consequence of the success of one game is a surge of imitations and bandwagon jumpers. Metal Fatigue stands out as a result of several of its concepts, but in the end it winds up being a cookie cutter version of so many other games.  -- Stephen Butts  Comment on this story", "date": "Aug 10, 2000"}