{"name": "Heavy Metal: FAKK 2", "name_review": "Heavy Metal: F.A.K.K.2", "ref": "https://www.ign.com/articles/2000/08/15/heavy-metal-fakk2", "text": "We can't prove it 100% yet, but mark my words -- Heavy Metal F.A.K.K. 2 will be one of the few games to far surpass its film counterpart. So far, reports on the upcoming film sequel have been mediocre at best, but F2 the game delivers an entertaining experience in feature film quantities -- albeit with more glitches than Showgirls, and with a size that's a little too close to the film in terms of length for your average gamer's comfort. It's a mixed bag -- a beautiful product that shows off the Quake III engine's flexing power, and an interface that may fray the nerves of Quake fans, but will have Tomb Raider (remember the original experience, not the sloppy sequels) fans more than happy, but a size and shape which ultimately leave something to be desired.  You play as Julie, defender of the future and wearer of the vinyl, and you've got a huge selection of weapons at your disposal, if you have the will to search them out. The action/adventure mixture is an interesting addition to the gaming rulebook -- you can blow through the game and win it just fine, but if you want to experience the myriad of weapons that make the game fun to play, then you'll have to keep your eyes peeled, and do some extra exploring to find all the optional weapons and gadgets hidden throughout the game. While it doesn't drastically change the linear nature of the game, it definitely gives you more options than your average action game. Julie's got a good selection of melee and gun-based weapons, from energy bows and pistols and shotguns to a good ol' giganto ax that easily chops most foes into bite-sized bits. You can combo weapons into separate hands as well, with a melee weapon in one hand and a long-ranged weapon in the other, or two long ranged weapons... and so on, to your heart's content. Add a simple combo command to the mix, and you end up with an entertaining, simple and versatile weapons setup that rarely, if ever, gets boring.  The game itself is all about pretty, interactive environments that have you crawling, jumping, wall-grabbing, and rope swinging to explore their nooks and crannies. What it ends up being is what Tomb Raider should have been all along -- fast paced, with some straightforward puzzles and some nice action. Tomb Raider may be able to capture a sense of mystery with its dense environments, but F2's got a style and a pacing that keep things flowing. There aren't a lot of environments to explore, but each one is full of personality and nice touches, such as sunken statue in the swampland, the shield machinery, or the architecture in the tutorial. To me a third-person action game is as much about wanting to jump around your environment as it is about slashing enemies, and in that sense F2 excels.  The environments themselves are incredibly stunning, with sky effects, vibrant colors, and textures so detailed that you'll hear the sound of a bar being raised in the background as you play -- they're just that good. Character design is perfect, thanks to the movie's cast of interesting characters, and the weapons all have a sheen, shimmer and shine that will make you feel guilty for sullying them in a monster's gut. The sound is just as impressive -- weapon effects and sounds are solid, the voice acting is surprisingly good, and the music, though sparse, is taken from the movie and has a nice, rich tone that make everything feel that much larger.  Unfortunately, a lot of you are going to have problems even seeing frame one of some of the game -- we had problems with two different computers trying to get the thing to even launch, or once launched, to play for more than five minutes. The third time seemed the charm, however, and from some of the letters we've received from readers, it looks like TNT users are having the bulk of the problems with this game. To release a game with this much visual flash, but such big bugs is a shame, and another example of how rushing a product never turns out well for the people really effected by the deadlines -- the gamers and the developers. Pair this with the short size of the title, and what you end up with is a game that could have been one of the best action titles of the year, but ends up falling short.  What I would have liked to have seen out of F2 would have been more -- the action game is fun and easy to grab onto, but while the game hinted at more adventure elements in the first few sections of the game, it never quite turns out that way. The lack of a multiplayer game wouldn't sadden me so much if the overall game wasn't so small in scope as well. So what's the verdict here -- is it fun? Hell yes. Is it as good as it could have been? No way. But it's very far from being bad, and in fact, I can't remember having such a good time grillin' and/or killin' in a while.  -- Vincent Lopez    Comment on this story", "date": "Aug 15, 2000"}