{"name": "WWF Royal Rumble", "name_review": "WWF Royal Rumble", "ref": "https://www.ign.com/articles/2000/08/16/wwf-royal-rumble", "text": "This game is going to sell by the boat-load. But why shouldn't it? THQ has a storied history of producing excellent quality wrestling titles, and people know it. From WWF Wrestlemania 2000 to WCW/NWO Revenge THQ has established themselves as the premiere developer of such games the world over. Eagerly awaiting a Dreamcast version of any one of their past grapplers, I was admittedly taken aback when I first learned that their initial (and only) DC offering would be the port of an arcade game. But I had faith! The company hadn't let me down when it came to wrestling in years (all right, it's safe to say that they never did), and I was hopeful that the finished product would prove itself a bastion of all that's good and virtuous. Unfortunately, the only thing it did prove was that I should go with my instincts and know trouble when I see it.  To begin with, the wrestler selection is paper thin. Not even close to the gargantuan totals of most of our recent spoils, the character count just barely tops the twenty mark and some of the personalities they've chosen are questionable. On the plus side we get all the biggies: Steve Austin, Chris Jericho, The Rock, Kane, Big Show, Triple H, The Bikertaker (pre-bandanna), and even Kurt Angle lacing up their boots and knocking heads. But the secondary character selection is baffling... we get Rikishi and Edge yes, but where's Christian or Too Cool? Why didn't they throw Mr. Ass into DX? (And don't even tell me it's because he's hurt... Steve Austin has been out of action for almost a year and he's still in there). Odd stuff.  Not that it makes that big of a difference who you choose anyway. Different moves that each wrestler may have, they still create what is essentially the same guy. Power, speed, and finishing holds are moot points as every character is basically Joe Schmoe with a different costume on. Tazz will be able to body slam the Big Show, and Kane will move just as quickly as Edge does. Pick anyone, anyone at all and you'll have no more an advantage with them as you would someone else. And once you've mastered one character... you guessed it, you've mastered them all.  Actually finding the time to become king of your ring however, may take more out of you than it's worth. Even on the easiest difficulty setting, the challenge level is ridiculously hard. Forcing you to throw finesse and wrestling maneuvers out the window and replace your strategy to running like a sissy as you defend yourself with punches and kicks. Well to be more accurate, punches OR kicks. That's right kiddies, instead of having a button for each action you are given only one. Jericho may kick the snot out of one guy, and Big Show can sit there and slap him silly, but that is all they can (and ever will) do. Mixing it up isn't in the strategy guide apparently, as the same two and three hit combinations are the make-up of every match in the disc.  Wrestling holds that did manage to make an appearance don't do any real damage either. With the exception of your characters finishing maneuver their effect is minimal. Leaving yet another reason to resort to slapping and kneeing your way to the bell. Which is probably what explains the extreme lack of holds and grapples to choose from. Body slams, suplexes, and the traditional fare are in there yes, but the rest of the arsenal seems to be lost amidst Vince McMahon's toupee. Submission holds are few and far between and successfully executing more than two of them in a row warrants a call to the Guinness Book of World Records. The ~partner~ feature is kind of neat in the beginning, but after a few matches you'll realize that King of Fighters and Marvel vs. Capcom did it better. And why isn't there an auto-face button for those awkward ~I'm facing the wrong direction!~ moments?  The options themselves are just as sparse as the move set, as the popular create-a-wrestler, pay-per-view, and tag team matches have all been nixed. Instead, we're allowed to wrestle a 10-man elimination exhibition and a tediously similar Royal Rumble bout that doesn't quite live up to it's hype. Nine men in the ring at the same time? Great! But we're still subjected to facing the same set of guys over and over again. You always know who is going to come out next because the selection is so small there are simply no surprises.  And what about those extras we have come to expect? Little details here and there to show us that the programmers were trying to impress the hard-core wrestling marks? Well, Kurt Angle has his girly-man tattoo on his shoulder, and Earl Hebner makes an appearance as the referee but the easiest way to win points in this category has been canned... as there aren't any ring walks!  Yeah, there may be a three second blip of a visual with your wrestler of choice dancing in the center of the ring while a crowd cheers him on, but those all too familiar walks to the circle we've grown accustomed to have been completely omitted. Does anybody really want to see a nano-moment of the Undertaker raising his arm before switching to the opponent instead of the full on approach to the ring? Luckily, entrance themes are played and pyrotechnics are shown after a match is over, but it's a table scrap for very hungry dogs.  Oh what could have been ye mighty Royal Rumble. If only there was a more balanced approach to the punch-grapple system, and more characters, and a better way to handle the ~partner~ feature, and let's face it... an improvement on everything else, then ~fun~ might have actually found a way to sneak itself in here. But with tastier morsels of wrestling goodness to be found out there in the forms of import monsters New Japan 4 and Giant Gram 2000, Dreamcast owners are better suited to invest in a trip to the Land of the Rising Sun... not this.  -- Jeremy Dunham, IGNDC", "date": "Aug 16, 2000"}