{"name": "NFL GameDay 2001", "name_review": "NFL GameDay 2001", "ref": "https://www.ign.com/articles/2000/08/22/nfl-gameday-2001-3", "text": "I can remember the first time I played the original NFL GameDay on PlayStation.  All I could think was my God...EA better get on the stick and fast!  Though the game was sprite based, it was the first to come out of the gate for Sonys new system (at that time) and proved to be a worthy entrant in the end.  As the years passed, and the game's developer matured, into what is now 989 Sports, the GameDay franchise has been looked upon with much favor by many a gamer.  So here we are, in the year 2000, and NFL GameDay 2001 has made its, perhaps final, appearance on PS-in the wake of the forthcoming PS2 mania.  Has 989 Sports shown they still have the goods?  Does GameDay have what it takes top unseat Madden NFL 2001?  Is it the greatest 32-bit football game of all time?  Here is the bone-crunching breakdown on the showdown.   Presentation Making use of footage from the NFL archives, laced with the ominous voice of NFL Films, the introduction to this game is Goose bump inducing goodness.  Perfectly timed slow-mo, bone jarring tackles and prose worthy of a Pulitzer make the introduction to the game very polished from the onset.  NFL Films has always exhibited an uncanny knack for choreographing game footage with music and narration and the production used here is the real goods.   Besides having all the NFL teams and stadiums, rendered in good 'ole 3D, GameDay 2001 even has in-game help, a very television-like presentation and the ability to draft players from NCAA GameBreaker 2001!  Going one step further, they have worked tirelessly to give you the most updated rosters possible in association with the NFLPA.   Other notable aspects of GameDay 2001's presentation come in the form of nicely drawn team selection screens, an intuitive interface for options, and simplistic configuration of the Create Player mode, Draft War Room, Play Editor, the in-game Telestrator and other ancillaries.  While not as eye catching as the Madden 2001 layout, GameDay 2001 does a very nice job of not being a copycat, while remaining very functional.   Gameplay Now we get into the practical details of it all.  Gameplay!  Let me start of by saying that NFL GameDay 2001 is much less a simulation than its Madden counterpart.  This is something that has endeared the franchise to tens of thousands of gamers, while also serving as the one aspect, of its development and maturation that has incensed an equal amount of others.  While one must still call plays, execute plays and learn the subtle nuances of the game, the overall feel of the game is rather coin-op-ish.  Not in all areas, but certainly in the play execution.   When I say coin-op-ish, I simply mean that this game has a very arcade-like feel--once it is in motion.  Play execution is relatively easy, as far too many aspects of the CPUs control are just a bit to darn easy to exploit.  For instance, it seems as if the Defensive Backs in GameDay 2001 are not maximized in the development of their pursuit angles on plays that have them covering zones, with receivers hauling straight out into the backfield.  When this situation occurs through the course of a game, and it can occur frequently, you can generally read the entire field quickly enough to exploit this Defensive deficiency.  As such, you will find that you can rack up insane amounts of yardage on a variety of passing plays.   Conversely, when one is playing against the CPU with man-to-man coverage in effect, there are way too many interceptions by the Defense--using the default passing scheme.  To avoid this pitfall, one must certainly invoke the services of Total Control Passing (TCP) to compensate for this imbalance.  Now I have no trouble using TCP, and actually prefer to have it active at all times, but those not so inclined should not be hampered by an inordinate amount of INTs, just because the game is miss-tuned in that area.   In one sense, the ability to read the entire field of coverage on each passing play is rather useful.  However, realistically one cannot and should not expect to have the luxury of that much time (and line of sight) to see everything before the heat is on.  So on one hand, the camera system in the game is superlative and I commend that.  However, on the other hand, the pace of the game (during play execution) and the faults in the defensive pursuit angles causes the feel of the game to suffer a bit.  Bumping up the difficulty can cinch things up some, but this is accomplished by having the CPU simply react more quickly (or less dumbly) than on the lower settings.  Remember:  Sony's GameDay franchise is the first to have introduced an option where you could actually change the speed, control and AI awareness of the game.  Too bad that is no longer the case.  Other notable changes come in the form of simplified special moves via a one-button interface.  If you don't have the desire or time to learn how to throw a stiff arm, juke, spin, hurdle or shoulder charge, pressing only one button on the control pad, repeatedly, while running the ball will cause the CPU to make the best evasive choice for you. My seven year old loves this, but I still prefer familiarizing myself with the Advanced Offensive and Defensive moves.  It is just more immersing in the end.   The same holds true on Defense, to a point.  You can play this game without ever learning the Advanced Defensive moves, but doing so can really ad value and improve your skill in the long run.  ON the D-side of the ball, advanced tactics include shifting backs into Bump-and-Run coverage, shifting the linemen, throwing forearm shivers and swim moves and even executing one-handed deflections and interceptions.  Some of these tricks may take some getting used to, as the control of the game is a bit on the nervous side.   The extreme jerkiness of the control, and the unrealistic way in which it affects the execution of plays is a bit of a problem.  I have played just about every football game ever made for a console system and I cant recall ever, except in the latter GameDay offerings, ever having seen such rapid and spot-on directional shifting while running the football.  The slightest nudge of the analog stick causes the game to react like Joe Montana Sports Talk Football for the Sega Genesis.  Some people will dig this, as the control is instant and deliberate.  But I would like to have seen something that 989 Studios offered a while back with GameDay-configurable slide and control responsiveness tweaks-in the Options mode.  Heck, they had it in the game years ago, why take it out.  Furthermore, they must have decided (back then) to incorporate that feature because of suggestions or complaints about the twitchy control.  Frankly, I know many people who used it to compensate for this very problem.  Yet again, it has been paired down and removed, likely due to the incorporation of many other newer features.   Now this does not make the game unplayable by any stretch of the imagination, but it is an issue of serious contention.  But when you factor in the, stop on the dime, control scheme and the fact that the camera is so super efficient at keeping up with the ball, and the visual experience then suffers too-but I will get more into that with the discussion of the games graphics.   Other problems I feel compelled to mention are the abundant numbers of pure-D money plays.  Every game has them, just some more than others do.  In GameDay 2001Plays that gain regular amounts of yardage come in the form of a few key running sets and a few shots across the middle that are never adequately protected.  I don't like to reveal such plays in reviews, since some of the fun that can come from their existence is finding them.  But you can bet they are in there!   Something I found quite pleasing was the way various players exhibited characteristics that one would expect to see in real life.  Notice how Curtis Martin runs the ball, using his juke maneuver at times even unaided.  Check out how Payton Manning finesses the ball into a free receivers hand, down the sideline.  You will be amazed by what you find, in terms of signature animations and executions of talent.  And rightfully so!  989 Sports made use of 13 NFL players to capture a whole new slew of football maneuvers and player nuances.   So let's finish off gameplay with some flavorful and more favorable material.  New animations included in this version of GameDay include; drag downs, upended tackles, gang tackling, wrap tackles that are high and low, and even dragging defenders.  You can also break tackles, making use of the momentum and size differences of the respective players in use.   Then there is the fact that some 50+ players were used to create the playbook in the game.  I cant attest to the fact that these plays were all conceived for this 2001 edition of GameDay but I can tell you that there are a lot of plays.  Nevertheless, I did find variations that are more useful in the passing game than in the running game.  Add to that fact that you can play as any skill player and the game does begin to deepen quite a bit.   You can play GameDay 2001as a Wide out, Quarterback, Running Back or even a Tight End.  This way you can throw blocks, call for the ball or control your run from scrimmage without having to worry about the snap count.  All of these abilities factor into your career stats, and other team statistics.  Speaking of statistics, this has always been a strong suit of the GameDay franchise and remains so with this version too.  Testing the database by simulating seasons, you will find proper balance and logic applied to the compilation of statistics for the teams and individual players.  I also feel that the various player ratings employed in the game have been put to good use.  Issues aside, your players will not regularly perform out of their expected range of ability.  For instance, if you QB with McNair, he can throw on a lateral roll or run with greater accuracy than a pocket passer.  Bigger, less agile backs benefit from more use of the speed burst and stiff-arm maneuvers, while smaller backs that are more agile can wreak havoc with the juke and spin options.   As always, you can expect there to be a horde of Easter eggs, as the series has always been rife with them.  There are also all the modes like Season, Practice, Tournament and the General Manager mode as well.  There is Pro Bowl Voting, Playoff and Injury Reports, MVP Awards and a deep Drafting engine to spice up the off season downtime.   Graphics Graphically this game is close to a wash, especially when compared to the 2K1 equivalent Madden title from EA.  Field textures are grainy and the dithering will almost send you into a convulsive fit.  Another major issue is the width and color depth of the line markers.  Because GameDay 2001 opts to keep the color temperature of the hash marks and yardage lines so high, the aliasing of those grid marks, during game play, is excessive and annoying on the eyes.  What's worse is that this anomaly causes the ball to be very hard to follow, and makes players look jumbled up in tight running plays.  This has been a perpetual problem for the franchise, and though covered as a cause of disagreement many times before, it has never been addressed.   Players are said to be scaled to actual proportions, and while there are some obvious deviations from this claim, for the most part they have achieved the desired result.  Wide outs are on the taller, thinner side, and Fullbacks do look more fireplug-ish, but some of the QB's are not in harmony with the dimensions and proportions of their real life counterparts.  No big deal, just an observation.   Stadiums in the game are nicely rendered and you really can see landmarks in the distance or within the filed view that are true to life.  If it weren't for the poor texture qualities of the game, I am sure this aspect of the visual presentation would get more recognition for its effort and implementation.   The player textures are quite good and their animation, between plays, is clean and smooth.  But once the game gets going, the frame rate--something 989 was praised for having gotten right so many times in the past--is dilatory at best.  In fact, the frame rate in this game is downright poor.  Thus, when you take grainy textures, and add unsightly dithering coupled with a poor frame rate, the game ends up with a look that is simply hard to brag on or enjoy.  Therefore, what once was the benchmark for 3D football on PS1, has now become an example of exactly what not to do.  This is unfortunate, because I have always found enjoyment in playing the series.  And while I still can play the game and have fun, I must now overlook the graphics during the experience.   Sound  The color commentary and announcing is this game is far better than that found in Madden NFL 2001.  For one, the voices used here (Phil Simms and Dick Enberg) are simply much more intoned and animated.  Additionally, they seem to have a larger repertoire of comments.  In addition, errors in post-play commentary have significantly decreased, as I heard only one miscue during my entire evaluation period.   Other aspects of the games sounds are the hits and tackles, which are handled nicely and the music, which I find more hockey-like in choice, but is still good tunage nonetheless.  My issue, and you knew I would have one, is something I fussed about last year in both the GameBreaker and GameDay reviews and that is the crowd noise.   Normally, I would refer to crowd sounds as cheering, but in this case, and ever since the first GameDay it has been dubbed noise.  This one issue really irks my nerves to no end.  They have been using the same old, tired, washed up loop of the original crowd sample forever!   That is so sad.  What does it take to go to a local game and record a damn crowd?  What does it take to renew that sound bite each year?   And did I mention the ~Thump Thump Clap~ We Will Rock you theme that has never been replaced?!  Come on people...give it a rest already.  Sure they took some of the edge of the samples, to make them less grating on the ear, but what about some new stuff here...please?  God only knows what will happen if they carry this stuff over to the PS2 version...oh the horror!  After hearing me complain about so many things, you may wonder if the game is any fun.  Truth be told, GameDay 2001 is quite a bit of fun.  Just don't benchmark this title against the other guys game, and you will be all right.  Some of the ease of play, founding this game, is what people look for in their choice of football title.  You know the ones; they cannot stand to play an entire season without being in the playoffs or the Super Bowl.  If that is your fancy, NFL GameDay 2001 may be right up your ally. Now don't get me wrong here.  There are loads of plays, lots of modes, custom plays, player creations, team management and all that.  Those features could keep any armchair Quarterback busy for a few seasons.  Nevertheless, if it is balance and challenge you are after, you will have to try playing this game on its highest difficulty setting or, if that doesn't work, opt out for Madden 2001 instead.  My take is that you should play them both and see what fits your frame of mind and skill level.  GameDay 2001 is not a complete bust; it just has too many issues with it for me to levy the kind of praise upon the franchise I did in years past. The only consolation, this time around, is that perhaps 989 Sports was just too busy to make the necessary changes needed to keep this game in the running with Madden.  Too busy, that is, making a go at a Madden-killer with the new GameDay for PS2?  One never knows...do one?  In the meantime, give this game a go, and see if it is your cup of football ~T~.", "date": "Aug 22, 2000"}