{"name": "Mario Artist: Paint Studio", "name_review": "Mario Artist: Paint Studio (Import)", "ref": "https://www.ign.com/articles/2000/08/23/mario-artist-paint-studio-import", "text": "Mario Artist Paint Studio is the first of four creativity tools designed to show off Nintendo's Japan-only 64DD add-on. Originally called Picture Maker, Paint Studio is the direct follow-up to Nintendo's popular SNES paint program, Mario Paint. Like the SNES classic, Paint Studio enables the creation of colorful pictures and simple animations via an analog input device -- but there are of course quite a few key differences. Like the original, Paint Studio ships bundled with a Nintendo Mouse Controller, a standard gray two-button mouse that's decidedly ~un-Nintendo~ in both look and functionality. This means that Paint Studio requires a stable surface for the mouse to function properly. That's certainly not a problem if you've got your N64 and 64DD on a desk, but players who are used to sitting on the ground may not find the idea of Mouse control all that comfortable. To be fair, a tray or coffee table book usually solves this problem and Paint Studio's Mouse control is far more accurate than a touch pad or the optional controller control scheme. Once you use the Mouse to draw, there is just no going back to the controller.Although it offers small mini-games like Fly Swatting (a returning favorite) and even a limited take on Pokmon Snap, Paint Studio is essentially Adobe Photoshop for Kids. Using a variety of brush sizes and textures, you can paint, draw, spray, sketch as well as augment pre-made pictures and create short animated clips. Here is the gist of what Paint Studio has to offer:2D Paint: Up to four players can paint a picture at the same time using an easy-to-use menu system. Since the canvas is obviously limited, the multiplayer painting is more of a novelty. Kids will get a kick out of it, but it doesn't really serve any serious function. Parapara Manga: This ~flipbook~ feature enables the creation of short animated clips. One clip is made up of up to 35 frames of animation. You can import pictures from the 2D Paint mode, copy film strips and even overlay images to help you compose the next picture. The playback speed can be adjusted on the fly and you can toggle motion blending on or off.3D World: Select one of three environments (Underwater, Mars and Dinosaur World) and watch its polygonal inhabitants in action. You can also change the creatures' textures to a pre-made pattern or alter the complete texture set with the help of 2D Paint's tools. That's not a whole lot of interactivity since you can't change the structure of the poly models, but it's enough to give budding texture designers a close look at how texture-mapping works. Finally, a Snap-style mini-game lets players walk or swim through the environments and take pictures of the creatures.Gallery: A slide show that cycles through all your creations, accompanied by music.Here's a quick rundown of all of Paint Studio's primary operations, which can all be reached via animated menu buttons at the left and right sides of the screen:Paint: Choose from 10 different line types at three sizes, including spray, crayon and finger painting. Line: Select a star and an end points to draw a straight line.Shapes: Instantly create a Square, Circle, Oval, Heart or Star.Fill: Fill a single-colored background or shape with a color of your choice.Magnify: Zoom in and out with the mouse keys. Eraser: Erase unwanted lines using three different eraser sizes, or delete the contents of a square or a free-hand drawn shape. You can also delete everything on screen at once.Flip to new page: Draw a picture on a fresh page.Cut and Paste: Cut out an area using a variety of shape tools and paste it somewhere else. The cut-out can be manipulated in size, orientation, etc.Filters: Lighten, darken, blur, sharpen, contrast, zigzag, ripple distort, convert to sepia tone, sketch, emboss or line art.Create Colors: Make your own color with the help of a cute picture of a chameleon. You can save the desired colors to your pallet and use them in your pictures.Coloring Book: Load one of 21 black and white drawings and manipulate them.Character Stamps: A library of Nintendo mascots, ranging from Mario to Zelda. All 151 Pokmon are represented as well. The pictures can be used as stamps and manipulated in size and orientation.Text Stamps: Select from Japanese and English letters and use them as stamps.Various Stamps: A library of photos and illustrations that can be used to alter and enhance your images.Backgrounds: A library of background images, including renders, drawings and photos.Undo: Undo the last operation.Picture Size: Make your picture square or screen-sized.Save/Load: Save or load from disk.Capture Cartridge: Capture images from video using the Capture Cartridge (included with Mario Artist: Talent Maker).Pocket Camera: Capture images using the Game Boy Camera.Settings: select the background music, adjust the cursor speed, switch off the menus, etc.As you can see, Paint Studio is quite a powerful image creation tool, at least as far as console applications go. It may not have multiple undos or layers, but it also doesn't cost hundreds of dollars. Well, okay... You do have to buy a 64DD to use it, so it's not quite as cheap as it should be -- but I can't think of a better tool to get younger players to actually sit down in front of their TVs and do something creative. The 3D World mode is more of a neat little extra than a full-fledged mode (which is probably why Nintendo chose not to release it as a separate application -- once listed on N64 release lists as ~Creator~), but the 2D Paint and Parapara modes work great. The menu system is well-conceived and self-explanatory, there is very little load time and the ability to import images (and even a short video clip) sets it apart from the select few other creativity apps that have appeared on console systems.However, there is one major problem with Paint Studio: its time of release. When Mario Paint came out, most people didn't have a PC or Mac at home. Things are different in the year 2000. There really isn't a lot here that you won't find in your PC's basic software package, which means Paint Studio's features will appear a bit underwhelming to most computer-savvy gamers. Sure, you can create colorful images, but what good is it all when your display resolution is limited to 320x240 and you can't print out your creations? The answer is that Paint Studio isn't really targeted at any of us. I say ~us~ since you're obviously reading this on your computer... Paint Studio is primarily aimed at Japanese console gamers who don't own a PC and who utilize the 64DD's simple network functions as first baby steps into the vast world of the Internet. In the end, I think Paint Studio's biggest limitation is what has become of Nintendo's once ambitious plans for the 64DD. If Paint Studio could be used to create images and characters for a variety of cartridge games, then there would at least be a legitimate reason to own it. Sadly, the only thing you can do with Paint Studio that you can't do with your PC is to insert a single two-frame animated character into Sim City 64 and upload your ~Pikachu Goes Fishing~ pictures to Nintendo's Randnet DD service. Paint Studio is a well-put-together creativity tool that's limited by the platform it's on. If this were a PC app, I'd recommend it both as a low-cost paint program and an excellent ~My First Photoshop~ edutainment title for kids. On the N64, it's a dinosaur, a throwback to the SNES days -- and an important reminder that there is a reason PCs and console systems are able to exist side-by-side. Here's hoping that Nintendo will reuse these paint tools in some upcoming games to let you customize car decals or characters.", "date": "Aug 23, 2000"}