{"name": "Giant Gram 2000: All Japan Pro Wrestling 3", "name_review": "Giant Gram 2000: All Japan Pro Wrestling 3 ~ Brave Men of Glory ~ (Import)", "ref": "https://www.ign.com/articles/2000/08/23/giant-gram-2000-all-japan-pro-wrestling-3-brave-men-of-glory-import", "text": "Beleaguered by half-assed Dreamcast wrestling ports on our side of the Pacific, it seems that the only way to find ourselves a proper grappler is to import one from our neighbors.  With last year's fantastic arcade-sim Giant Gram, Sega turned more than just a few heads and established itself as a developer that knows how to handle the ring. Taken in by it's depth and attention to detail, I couldn't wait until the next installment of Sega's All Japan series came tumbling down the pipeline. Just over a year later (and quicker than expected) the boys in tights have already made a triumphant return... and they're better than ever. Giant Gram 2000: All Japan Pro Wrestling 3 is without a doubt, one of the best products to ever claim hold to a wrestling title. Deep, innovative, and unendingly entertaining, GG2K takes all the aspects of it's predecessor and polishes them into an even brighter finish. This is one Japanese-bred ring sim that's been tweaked in all the right places, and is truly meant for the black and white wrestling aficionado. nChair shots, steel cages, and buxom blondes in zombie hats are all completely ignored, and replaced by the classic image of two athletes ready to do battle in the squared circle. Adhering to the honorable tradition of strength, honor, and will, Giant Gram 2000 is as close to the real thing that you'll get.  Best described as Ric Flair meets Virtua Fighter, GG 2000 is an exercise in complicated simplicity. Despite relying on your basic ~paper-rock-scissors~ three button setup, the game's laws of attack cancellation are surprisingly effective. Boasting an easy to remember counter system (Grapples beat Strikes, Throws beat Grapples, and Strikes beat Throws), the depth of such a limited control arrangement is a thunderclap to nay sayers of old school goodness. Who says that you need to press the digital pad forty-seven different directions to execute a Russian Leg Sweep? In Giant Gram it's as easy as pushing ~B~ when holding your opponent in a headlock. If only they were all that simple.  Assuredly not simple however, is the game's uncanny ability to recreate the Japanese wrestling atmosphere. Pre-rendering a collection of actual Nippon stadiums and auditoriums, every match is identical to its mail-order counterparts. Spotlights, guard rails, and a myriad of other arena-specific features have been digitized and included for a spot-on likeness of overseas grappling. If you've ever wondered what it would be like to throw down in front of thousands of Japanese fans, here's your opportunity to find out.  And with equal attention diverted into the game's visual department, you're going to be hard-pressed to find any chinks in it's presentational armor. Subtle shading and lighting effects, astoundingly realistic texture maps, and detailed (if stiff) polygon models push Giant Gram 2K far ahead of other offerings in the genre. Admittedly, the models do appear to be somewhat smaller and blockier when compared to 1999's version of AJPW, but with the added detail in textures and stadium nuance, this can easily be overlooked and forgiven (after all, it still looks extremely good). And while the crowd is still a mass of flattened two-frame sprites on par with similar titles, they somehow find a way to be the least annoying of any previous example.  Other improvements have been made too, especially in the character selection.  The 50 or so wrestlers to be had this time around is staggering, almost tripling last year's 20 count. And while the majority of our bruisers may not exactly be superstars here in America, there is the occasional face to grab our feeble gaijin attention. Names like Steve ~Dr. Death~ Williams, Stan ~The Lariat~ Hansen, and Vader are immediately recognizable and make suitable alter egos in our battles with Giant Baba and Kentaro Shiga. There's even a healthy dose of hidden characters (Bruno Sammartino anybody?)!  Additional amendments to match features and the create-a-wrestler mode are in there too, and the addictiveness of each is a bit unsettling. Returning from last year are the basic arcade, tournament, and versus modes, but the real beauty of it all lies in ~Historic Battle~. With this dandy of an extra you can relive favorite matches of the past and reenact the glory days of Japanese wrestling (including the classic battles between Mitsuharu Misawa and Jumbo Tsuruta, good stuff). What's the incentive? Well, if you can pull off the necessary pre-determined moves during the proper times in a bout, you'll unlock a hidden feature or secret character to utilize in the future! How's that for a bonus?  As mentioned above, the create-a-wrestler mode has also been improved on, and the approach it takes is a much more involved sort when compared to titles such as WWF Attitude or Hardcore Revolution. Asking you to select a body type and face, you must systematically train your titan from the ground up. Taking bruises and broken ribs as you train against the best in sparring sessions, you slowly but surely learn moves and improve your skills. A minor league approach that should be used more often in games like this, the chance to sculpt your brawler from the ground up instead of the customary ~number distribution~ system we've seen, is very cool indeed.  Of course, the most outstanding spectacle that Giant Gram 2000 has to offer comes in it's ability to push your brain as much as it does your reflexes. A constant barrage of tests that forces you to outthink and outwit your opponent, the key to victory lies in your ability to counter your foe's every move. Reversals, combinations, and the like position GG2K in the same league as many of the top fighting games on the market. Generations beyond the ~my turn, your turn~ approach that many of the western wrestling games seem to imitate, the level of realism (if that's a word you can use when talking about wrestling) in Sega's grappler is a most welcome addition.  Also cool is the ~Burning Fan Meter~ system. Playing off the chants of the maniacal crowd (and your ability to perform reversals), your flame meter will steadily increase, eventually growing into a raging inferno that allows you to enter your ~Burning Rage~ and perform some of the more devastating moves in the game. Unbeatable for a certain amount of time, the dramatic charge your character receives from his rage can mean that even in the closest of matches you can always pull out the victory with smart timing and better handling.  The only real quarrels to be found in Giant Gram 2000 come in the form of it's language barrier. Now personally, I don't think you can hold a reason like that against it (it IS a Japanese product after all), but if you're an average Joe trying to wade your way through the menus and figure out who the hell the characters are, it can be a pretty difficult task. Kanji heavy to the extreme, I would go so far as to say that you need at least an above-average understanding of the Japanese alphabet to successfully navigate through the game. Spend some time with it however, and the rewards will prove fruitful.  A couple of other little nitpicks aside (like the lack of an auto save or auto load, and the strange ~tinny~ sound that some of musical tracks exude), Giant Gram 2000 manages to take the title as king of the Dreamcast wrestlers. With more personality than most mascot platformers and game play that's deeper than Orson Welles' belly button, G-Gram 2K is great pick up for importers, wrestling marks, and fighting fans alike. Kawandearu!  -- Jeremy Dunham, IGNDC", "date": "Aug 23, 2000"}