{"name": "Bust A Groove 2", "name_review": "Bust A Groove 2", "ref": "https://www.ign.com/articles/2000/08/26/bust-a-groove-2", "text": "Bust-a-Move, I believe, was my first exposure to rhythm action, since I missed out on the Parappa phenomenon in the fall of 1997.  It was drawing crowds in the game room at Animazement '98, and so I joined in, thus making it the first step on the road towards playing Dance Dance Revolution in front of large crowds and yelling at Konami in the persona of a red mutant fish-man.  Strange world this is.  So anyway, I was a big fan of the original, even if it suffer a little damage on its way to this godless nation of ours.  The voices in Victor Ireland's head have many cousins, whispering their philistine lies in the ears of game companies everywhere, telling them that you actually can dub songs and get something that sounds as good as the original.  This is nonsense on its face, but many believe it wholeheartedly, and sad to say they tend to be people in positions of authority as far as game localization is concerned.  That way lies madness, however, and one of these days I will have to face facts and realize that the J-Pop Law (as well as its cousin, the German Death-Metal Law) will never gain wide acceptance.  Such is life.  So I'll try to focus on the bright side for a little while, when discussing Bust-a-Groove 2, Enix of America's belated but appreciated release of the sequel to the original Bust-a-Move/Groove (which was known as Bust-a-Move 2 Dance Tengoku Mix in Japan).  However, it's hard to escape many of Bust-a-Groove 2's problems, some descending from its basic concept and others relating to the specific execution of the sequel.  It's still a great game to look at, but looks can only carry you so far, and I think it's a toss-up as to whether fans of the first game will be as enamored of its successor.  In case you missed the first game, and you may very well have considering its disappearance from the distribution pipeline, Bust-a-Groove's gameplay is easy to grasp.  Pick a dancer, and you'll be presented with a Simon-esque series of directional arrows and buttons.  Your task is to press all the directions in one measure of the song and end the measure by pressing a face button on the beat.  Succeed and you'll score points, building a combination of moves to score even more points.  Fail and you'll make a fool of yourself before the crowd of adoring fans.  That's more or less all there is to it, reacting to the progressively more difficult sets of button presses.  The attack moves from the first game are still there, though - you have a limited number of attacks to use that KO your opponent for a measure and break their combo string, although it's possible to dodge the attacks if you're quick.  Bust-a-Groove 2 definitely improves on its predecessor in the area of character animation, which was the series' highlight to begin with.  The original was a shining example of how to really use motion capture - to hell with dunks and tackles, we want cool dance moves! - and the sequel takes that same philosophy further, with wider branching trees of moves and smoother animation overall.  Shorty was one of my favorites before, and I love her new animations, which have grown up a little along with the character, but there's not a one that fails to impress, with a wide array of very well-executed actions.  Some of the new characters are real standouts, like the rotting zombie Bi-O and rollerblading waitress Comet.  I would be remiss, furthermore, if I failed to note how fond I am of Comet's P1 costume.  Forgive me, please - I'm sick, but I swear I'm no criminal.  But then there's the music, the massive core of a rhythm game, that from which all else descends.  I hate to say it, but I'm not sure I like the music in the sequel more than the tracks in the original.  The developers licensed individual songs, rather than having Avex Trax do the entire soundtrack, and it shows in the lack of their high-impact pop touch.  A lot of the comparisons aren't even too close - I can't hear any songs that I'd prefer over the righteous J-pop of Frida's music, the heavy hip-hop bravado of Strike's music in the uncensored import, or the shining ~Aozora no Knife,~ the best of the tracks that were sadly massacred by 989 Studios.  The music tends to be just a little bit too bland, unless you listen to it very carefully, and as in any music game, you're usually focused on tapping buttons, rather than picking out aural nuances.  It doesn't help, meanwhile, that as I say many of the songs now have English lyrics, which just don't sound as good as the original Japanese.  The stage design has also changed in ways you may or may not like, depending on your taste.  The first game's levels were more or less static as far as their positioning - you had a dance floor surrounded by an encircling environment, and while the backgrounds were extremely dynamic once you got the hang of the harder moves, everything still stayed more or less in the same place.  In contrast, some of Bust-a-Groove 2's levels have sacrificed environmental detail for size and the ability for the floor to move all around the massive stage during each dance round.  Heat's level, for example, places you on a floor carried by a crane around a massive iron foundry.  It's cool to see the environment change as it carries you all around, finally settling over a massive Bessemer converter, but the overall lack of detail results in something that I still don't like so much as his gradually-collapsing stage from the first game.  In essence, Bust-a-Groove 2 is still not much different from something like a semester project for a 3D animation class.  Mind you, it's a damn fine one - any CS school in the nation would send you home with an A and a commendation if you turned this sucker in at the end of the semester, but technical accomplishment doesn't necessarily translate to a fun, replayable game, especially in the eyes of a broad audience, and die-hard fans of the original Bust-a-Groove may very well not react too favorably to the many changes it the game's character and presentation.  It's still a good party game, but next January, you'll be able to play Dance Dance Revolution, which is the party game to stomp all over every other party game ever created, demolish half of New York, climb up the Empire State Building, and get shot at by bi-planes.  Bust-a-Groove 2, meanwhile, is not a conclusive improvement on its predecessor, and as a single-player game, it becomes thoroughly mindless after far too little time to justify the expense.  More than anything, it just makes me wish that I'd bought a copy of the original Bust-a-Move import when I had a chance.  -- David SmithAt first, I just thought this game was silly. (And it is!) But it required a long second look, and so I resisted my embarrassment, and sat down to play. As soon as I played through my first character, I was hooked solid. I've beaten the game with a few characters already and now I'm going to beat the game with every single dancer and master this bitch. While it may sound repetitive I'll simply get better with the four- and five-button moves than before, and try to get Dance Fever over and over again. At one point in the game I thought I really sucked hard, and instead of turning red, I felt white all over. Right around the fourth opponent, the learning curve turns up, making things difficult. But with a little practice I blew right past Pinky and from there on in I busted. To my surprise, the final boss  Robo-Z  wasn't much more difficult to beat than any of the last tier contestants. Stating the obvious, this game is terribly unique and there is nothing like this on Nintendo 64 or on the PC. I absolutely love the game's library of musical sensibilities, and all of the songs are truly danceable tunes that I can listen to over and over again. Bust-A-Groove is like Parappa in that it's a button-beat dance game, but it's a step up from the fun-loving 2D doggy life, so if you already own Parappa, you won't feel bad about buying this, it's that much different, and that much fun.", "date": "Aug 26, 2000"}