{"name": "MLB 2K8", "name_review": "MLB 2K8 Review", "ref": "https://www.ign.com/articles/2008/03/12/mlb-2k8-review", "text": "The idea behind releasing a portable alternative to a console mainstay is to give players an experience that models what players get from the Xbox 360 or PS3 alternative as closely as possible. A PSP title doesn't have to posses all of the glitz and glamour of its bigger, more expensive, brother, but it should provide a gameplay experience that is at least comparable. This year's 2K baseball offering performed well on consoles, though it fell short of what was seen from Sony's first-party Fall Classic. It's a similar story for 2K8 on PSP as it provides several fixes to the bugs that plagued last year's version, but still comes up a bit short of what can be found in The Show.   A big part of delivering an enjoyable baseball game is in the fluidity of the on-screen movements. One of the biggest failings of this year's 2K baseball on consoles was that watching the on-field action looked nothing at all like watching an ESPN or FOX Sports telecast. The camera was jittery, the framerate sputtered around the field and the graphics overlay that is supposed to fuel the broadcast style presentation chugged its way through every game. Luckily things are a bit better in MLB 2K8, thanks largely to the fact that 2K has toned the graphical detail down from what we saw in 2K7. Player models are a bit more jagged and the overall look of the game isn't as accurate to the real thing.   Warming up. Having said all that, the gameplay moves with greater fluidity than what we saw last year. Players are easier to maneuver and animations look a bit sharper, thus closer to what we see from the real life athletes. And at the end of the day isn't that the goal of videogame sports?   While the players certainly do move with more visual acuity, batting is still a bit of an annoyance when compared to the console alternative. The PSP version is very reliant on the batter's ability to see the location of the ball and match it with the hitter's eye. Timing a button press at the right moment while still worrying about the pitch's location can be a bit daunting if you're used to the altered timing of the PS3 or Xbox 360 version.    Pitching has been retooled a bit from last year's game and now features a huge amount of break on pitches. Curves can begin above the strike zone and break downward, finishing beneath it. Sliders go from one side of the plate to other with ease. It's almost like you're playing an arcade baseball title rather than a simulation. It doesn't change the way the AI sees the ball nor does it give you a leg up on the competition, but in some cases the amount of break on a pitch does seem a bit ridiculous.   Fielding benefits a bit more from the added fluidity. Gone are the days of fidgeting your way to a pop-fly and occasionally missing it. Outfielders now track the ball easier, though the new feature (seen on consoles) of having the targeting reticule disappear when not facing towards the ball is absent. Diving is still a little too hit-or-miss, but it gets a bit easier as you get experienced.   Strike! So things are certainly moving a bit better on the field, but what about the presentation values and feature set? Sadly things haven't changed much in the way of gameplay options. You'll still find The Farm, Pennant Fever, Franchise, Season, and GM Career as the main attractors with a Home Run Derby Career mode bringing up the rear. While a few of the game modes (Derby Career, Pennant Fever and The Farm) feel like tacked on additions to the regular stable of options they're still nice distracters.     Just as with last year's MLB there is once again online play, both through ad hoc and network connectivity. The network play, though extremely vacant, seemed to perform well with little signs of lag -- keeping in mind that we tested it on IGN's massive broadband network.Overall MLB 2K8 is a good entry in the PSP library of baseball titles. If faced with the option of buying this or MLB 08: The Show, do yourself a favor and choose The Show. Not to say that 2K8 doesnt have redeeming qualities, but theres no question that the best baseball experience on Sonys portable system resides in the first-party edition. If MLB 2K8 wants to keep up with the competition itll need to bring more to the table next year than improved gameplay and a new view for pitching.", "date": "Mar 12, 2008"}