{"name": "Enemy Engaged: Comanche vs. Hokum", "name_review": "Enemy Engaged: Comanche vs. Hokum", "ref": "https://www.ign.com/articles/2000/08/29/enemy-engaged-comanche-vs-hokum", "text": "When I received my review copy of this title, I had no idea what I was getting into.  I've logged countless hours with aircraft sims such as Jane's F-15 and Microprose's Falcon series, but my helicopter experience was mainly with Gunship, which seems to have garnered less respect by sim fans over the years rather than more, with that mantle being taken over by Jane's Longbow series.  This was the case until Razorworks released Enemy Engaged Apache vs. Havoc, a realistic helicopter combat simulation in which you could fly either the US AH-64 Apache or the Russian Havoc helicopter into a battlefield.  Although this was well received by sim helicopter pilots, Comanche versus Hokum follows up with an even better experience, and still allows owners of the older title to integrate the missions and helicopters of the first game with the second game.  If you only own the second title, you can fly the Comanche and Hokum helicopters, even though there are all kinds of other vehicles in the game, including the Apache and the Havoc.  If you have the first title, you can select missions using the Apache and Havoc.  Since you can now purchase the older title quite cheaply in the bargain bin, it effectively makes a great 'add-on' to the second title if you don't already have it.  I think it's fair to just say straight out that if you're looking for an arcade shoot-'em-up helicopter game, quit reading this review right now:  this is NOT your game.  This is a serious simulation of Helicopter combat, and it requires persistence and patience.  The first impressions aren't great, either.  First, you'll notice that the game itself offers no tutorial on flying the helicopter and accomplishing each kind of task.  The manual gives basic instructions on taking off, hovering and landing, but that's about it.  The rest of the manual is organized by avionics systems for both the Comanche and Hokum, including long lists of keystrokes.  Thankfully, there is very wide fold-out keyboard reference with two sides: novice and advanced.  The beginning user may well unfold this, see two or three functions for every key, and run shrieking from the room with hardcore-sim-induced-panic.  The lack of training is mitigated by the fact that the game gives you the ability to turn off many elements of realism. You can become indestructible, go aloft and blow away both friends and enemies with impunity in a Free Flight mode.  The value of this is to satisfy that primal urge to ~blow something up~!  Seriously, you'll learn some basic functionality, but you'll also spend a great deal of time pausing the game and thumbing frantically through the manual trying to make sense of the multifunction displays (MFDs) inside the cockpit.  As if beginners aren't frightened enough, the last few chapters of the manual have been omitted, unlike the European release which has the whole manual (including such insignificant *cough* topics as Ground School!).  These missing chapters are available on Razorworks website, in Adobe Acrobat format.  The Razorworks website also offers a very good strategy guide.  Ultimately though, you will sink or swim based upon your persistence and ability to fight through the frustration of flying aimlessly, unable to target and shoot things that you can clearly see. This means cozying up with the manual and learning the philosophy behind and operation of each targeting system.   So where's the good news?  Well, it is that if you persist and take the product as seriously as it was meant to be taken, you'll find that the game is a veritable treasure trove of reality and detail.  There are so many wonderful things to say about this sim that it's hard to know where to start, but they revealed themselves to me progressively as I spent more and more time with it.  Had I quit playing earlier in order to get the review done quicker, I'm sure I would have never noticed some of the great things in this game that know about now.  Even as I write this, I hope I've found enough to do justice to what I've discovered in the game.  I guess the first thing people want to know about the graphic quality.  Here we have a very mixed bag.  On the one hand, much of the terrain is, in a word, boring.  You won't find lushly decorated landscapes.  Rather, the scenery is functional.  A good demonstration of this is a forest.  Several polygonal trees will surround a treeline, but the forest itself is just a solid textured layer you may not fly into, so if you had dreams of flying your chopper inside of a tree line, forget it.  But when there's a Surface-to-Air missile site on the other side of the tree line, you'll be thankful for the fact that you can hide on the other side of it.  The terrain can be flat and rather sparse, and indeed most of the time it is.  However, when the terrain gets hilly, the game comes into its own.  Every little hill, building or mountain is a potential mask for a helicopter behind (either friend or foe).  The terrain becomes not an eye-candy item but rather an integral part of the game.  If you don't know how to use the terrain effectively, you are just up there for skeet shooting on the part of enemy ground units.  Although flying ~nap of earth~ is difficult, the autopilot and auto-hover capabilities are of great assistance.  They give you the luxury of contemplating your mission, optimizing waypoints, setting up your MFD displays and even checking up on other action going on in the theater.  So although the terrain graphics can get boring, by the time you really feel like looking around, you're going to be too busy trying to spot bad guys to get critical about the fact that the world isn't lush eye candy.  One issue with the autopilot is that it takes a direct route from point A to point B.  This might mean diving down into valleys and climbing slowly over high mountains.  With a pair of Mark I eyeballs you might see a valley to your left or right, or perhaps a river winding its way through the mountain.  The wise thing is to turn off autopilot and fly yourself around and stay low rather than risk popping up over a mountain just to let the world know you're there.  The fact that you can pan your view around is excellent for looking around at the terrain and deciding what the best approach is.  The HUD will let you know just how close to your target you are, so you can stand-off and use FLIR visual sighting to acquire targets, or you can close in underneath their view until you're ready to pop up and unload a barrage of missiles and gunfire at them.  The objects in the game are the exact opposite of the scenery in their graphic quality.  I must say I was awed by the amount of detail provided to other objects in the game.  Perhaps if the only way you'd see the enemy was through an infrared camera, it wouldn't matter, but in this game you literally filter out objects to look at, pan around, watch in cinematic modes, etc.  So Razorworks went to the trouble of building ridiculously detailed aircraft, ground vehicles, structures etc.  In one multiplayer Internet game, the other pilot and I were both finished with our mission, and focused our cameras on the allied F-16's assaulting ground units near our area.  After admiring the detail of the aircraft and the way it flew, it was icing on the cake to see fully-detailed mavericks, air-to-air sparrows and wingtip sidewinders on board.  When he engaged, the mavericks flew off the rack realistically toward their target.  The F-16 would break off the attack, release chaff and flares to avoid the counterattack, receive damage, causing a smokestream from his engine that persisted throughout the battle as he rolled out for another attack.  The game accurately tracked the loss of the mavericks.  After he finally fired off the last one, he banked off and jetted home.  Keep in mind, this is a helicopter sim.  There was NO reason in the world to have gotten that detailed except to provide realism in the deepest way.  No shortcuts were taken.  Other actions of interest were cargo transports opening their rear ramps and dropping palettes of supplies, complete with opening parachutes.  If you want, you can focus in on an infantryman walking around with an M-16, camouflage fatigues and an American patch on his arm.  He even stops to scratch his butt in boredom.  It's hard not to be amazed when you see this level of detail, and that's just for objects that generally do NOT directly concern you.  I'd also like to point out that the game supports full 32-bit rendering and hardware T&L for GeForce users.  The frame rate stays pretty solid and smooth throughout.  However, some things can slow it down, such as having your FLIR display screen on mirroring your flight and having both in view (it means the same picture has to be rendered twice in two different ways).  This isn't a problem on faster computers, but a midrange computer might make some sacrifices.  Obviously, flying around in a Lebanese town with buildings and mosques is a good way to slow down the frame rate, but given the fact that towns like that hide infantrymen with shoulder-launched SAMs, maybe you should just stay away from them, framerate or not!  The important detail settings can be changed to optimize your frame rate.  While it's easy to get caught up in the details and realism of individual objects, perhaps the most impressive feature of the game is the dynamic battlefield.  The maps involved include Taiwan, Lebanon, and Saudi Arabia/Yemen.  The battlefield, whether it is a small fight for control (Skirmish), or a full-blown war (Campaign) is dynamic, meaning that actions cause logical enemy reactions.  You have an overall map showing enemy and allied positions, along with circular fields of fire.  Missions will be tasked for various units and you can hop in the seat and fly a mission.  You can also leave a mission at any time and the AI will take over for the helicopter you hopped out of.  You can then hop into a more interesting flight if you like.  This gets rid of the pain-in-the-butt ~you died and lost the war...game over~.  Obviously, as you win or lose more missions, the tide of the war will shift for you or against you as you gain or lose airfields and other key ground installations.  You have wingmen who are smart enough to do what you tell them, including helping you out and engaging targets.  The standard ~attack my target~ is in there, as well.  They are aggressive and smart enough, though, that you best not loaf around if you set them loose with ~weapons free~.  While you sit there hovering trying to figure out how to best attack the target, they'll just go take it out themselves, making you feel incredibly stupid.  Another feature that is great is the ability to download targeting information from a wingman.  This is particularly valuable in multiplayer. One guy can go in deep, pop-up and get a 'picture' of the enemy formations, and then you can download it onto your screen, and lock up the targets, all while masked behind a hill.  If that weren't fun enough, there's nothing like putting your hellfires into LOAL mode (where line of sight is not necessary), and unleashing one which goes up over the hill, burns its motor out, then glides into the target, all while you hover quietly and safely behind that hill (okay, so it's not exactly fair play, but then neither is real warfare).  Like life, the war goes on around you, influenced by what you do, but not held up by it.  You can pause the game as long as you're not in multiplayer mode (duh), but anyone who has your IP can hop in and join the fun anytime and leave whenever they want, taking part in as many or as few missions as they want.  They can even run a totally separate mission while you work with your AI partners on the other side of the map.  You'll hear both AI units constantly reporting events over the radio.  The war is a busy place to be!  Of course, all this happens with a bit of a price.  The learning curve is somewhat steep.  You'll have to learn either the hard way (by getting blown up a lot), or the easier way (getting advice from t he pros online) about how best to employ your targeting systems.  You'll learn how to use your stand off abilities to unmask and acquire a target before you're in their range.  You'll learn how to take full advantage of the Comanche's stealth features to sneak through enemy fortified areas and discover enemy positions.  You'll have to figure out how to do all this while manipulating the collective and cyclic so as to stay low enough to stay hidden, yet high enough to stay off the ground.  Flying into the ground is easy not because flying is hard, but because it's easy to forget about your flying while you're doing other things, and at 50 feet above a sloped surface, there's not much room for error).  All kinds of weather are modeled, including nighttime weather, rainy weather which spots up your side windshields and blinds your infrared devices, and cross winds which require constant compensation.  In this sim, you simply cannot set the collective to a single power setting and fight effectively.  You'll have to be regularly working both the cyclic and collective with anticipation and 'touch' and work through the terrain and at the same time keep your situational awareness high.  If you turn off all realism aids and go hardcore, you have to watch for things you probably don't even understand.  If you don't know what retreating blade stall, over torque, and vortex rings are, I suggest you leave them at the novice setting until you do!  It's worth noting that I had the latter set to realistic, and found out the hard way that a vortex ring is when you drop the collective too quickly while going too slowly, causing what is in effect a complicated stall and the rotors lose lift.  No amount of power will keep you from dropping like a rock, wondering what the heck just happened.  After enough of those embarrassing incidents (often online to the amusement of the other players), I've turned that feature off for good.  Note to the hardcore: okay, I'm a wuss for doing that, so be it!  If all this were not enough, you can also fly the rather different Russian double-rotored KA-52 Hokum, which has a side-by-side seating arrangement and a much more confined view, but is a very capable of maneuverable aircraft in it's own right.   In this mode, all the people around you speak with a Russian accent, making you truly feel like you are on the 'red' team.  The avionics for this helicopter are somewhat different than those of the Comanche, but they can also be learned and can be thought of as another mode of play.  To sum things up, this is a fantastic helicopter combat sim.  Yes, I have my gripes with some aspects of it, such as the bad MFD terrain maps (which don't give you a clue of what's up and what's down), and a few things I think could have been more streamlined, but the more time I invested in it, the more my confidence grew and the more fun I've had.  Make no mistake about it, this game requires a serious investment of time to become a competent combat pilot, but the rewards are there, and if you can hook up with some other pilots and use voice comms to chat with each other, you can put yourself into a virtual war theater and have an absolute blast.  Whether I recommend the game to someone is really based more upon the individual than the game.  There's no reason NOT to get the game on its own merits.  But some people just don't want to learn a bunch of keystrokes, don't want to learn the black art of manipulating the cyclic and collective controls to impose their will on a helicopter, and get lost in the fog of war the minute they cross into enemy territory.  For those without the will to overcome the learning that must happen, there are simpler helicopter shoot-em-up games out there, but if you want the best hardcore helicopter combat sim with the most advanced technology, I believe this one is the game for you.  One final note, I want to thank some of the members of the LionsPride online squadron for babysitting me through the techniques of helicopter engagement in this sim and patiently raising my proficiency and answering my questions so I could write a well-researched review.  Also, thanks for teaching me the value of Stand-off engagements and leaving me stuff to shoot at!   -- Randy Magruder      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Aug 29, 2000"}