{"name": "SEGA GT", "name_review": "Sega GT", "ref": "https://www.ign.com/articles/2000/08/29/sega-gt", "text": "I have a small circle of friends that are proud to call themselves ~Grease Monkeys~. Enormous fans of anything automobile, my driving buddies know the most minute information regarding cars you could ever imagine. From gearboxes to gearshifts and bi-axels to bi-valves, if it's in there, they've heard about it. It comes as no surprise then that their favorite collection of racing games is (you guessed it) the Gran Turismo series. Keen to those game's depth, selection, and obvious graphical power, the g-monkeys in my neighborhood would swear by it. That is until Sega GT rolled into town. Sega GT is built in a similar fashion to Sony's monolithic racer and proves to be a masterpiece of modern driving. Abundant with options, cars, and a ton of racing modes, GT is easily the most realistic game of its type on the Dreamcast.  I couldn't help but be amazed at how extensive and fun the game really is, and I'm a hard-to-please racing junkie.  Now if you're one of those types of drivers who love over the top action and games that throw physics out the window, then Sega GT is probably not your kind of experience. Adhering to the laws of the real-world, car handling and contest pacing is much more orthodox than other recent auto titles (re: Shutokou Battle 2 and Super Runabout). But despite the strict adhesion to an accurate physics model, the game isn't any less entertaining. In fact, it is without a doubt my favorite Dreamcast racer to date, and falls into my top 10 list rather easily.  Since it's probably best to get the negatives out of the way first, I'll let you know that there is a small bit of a learning curve in the beginning.  The control takes some getting used to, as the game is much more drift-happy when using the initial cars when compared to other racing games. Moderately responsive with the digital pad, but a full-on A-1 covered steak of responsiveness with the analog stick, SGT may frustrate novices in the beginning but if they stick around long enough, they may never put the controller down again.  The real beauty behind Sega GT however, doesn't lie within its visuals or car selection (not that they aren't fantastic, but more on those later), or its admirable if squishy analog handling. No, the true star of the show is the game's utter display of a depth so intrinsic that it may put in question the detail of any racing game before it. Blasting Gran Turismo directly in the ass, Sega GT does everything that the Sony racer has done with even more style and passion than I would ever expect.  Sure the car count isn't nearly as gargantuan as Gran Turismo's (The Sony racer can lay claim to almost four times as many cars, but with over 100 selectable autos, SGT is no push over), and yes the track count is slightly lower (22 in SGT, and 29 in Turismo), but the attention to detail in both categories with Sega's effort is second to none. Advertisements, chips in brick structures, changing cloud formations, and believable terrain transitions spell ~awesome racing simulation~ with a capital A.  Which of course brings me to the rest of the visual splendor, of which there is plenty. One of the cleanest looking racers I have seen in a long time, Sega GT is a marvel of modern day graphical prowess. Fog effects, lens flare, and a bevy of texture maps transcend the previously normal standards and move beyond their common ~gimmicky~ placement. The eerie fog that blankets Snowy Mountain isn't there to hide pop-up or draw-in, it's there because it looks more convincing as a background effect than without it.  The environments are certainly worth mentioning too. Eclipsing just about any outdoor adventure for any platform, your immediate surroundings in Sega GT are the stuff that graphic junkies only dream of. Beautifully rendered skylines and excellent greenery drove me to pause the game on more than one occasion. ~Look at those clouds!~ I said out loud, ~Those are fantastic!~ And they were.  The only real visual problem I could find was linked to races set in the city. Slightly less impressive than the other tracks, most metropolitan settings had a nasty habit of repeating some misplaced (and occasionally ugly) texture maps on their building fronts. It's only a small deterrent from the over all look however, as the speed at which you travel through towns and cities is often so immense, that you probably won't mind it anyway.  Another aspect you won't mind is the feature set. The game is so packed full of things to do that it'll take weeks just to explore all the options.  Not only can you buy and sell used cars at a dealership, but you can also create your own ride from scratch. Assembling the vehicle from the ground up, your kick-ass ~Makaze Special~ can be manufactured Frankenstein-style from the tires to the bucket seats. If you don't want to bother with all those little details though, you can simply win races and earn yourself some sleek new cars!  You're able to modify almost any auto in your tune-up garage, but the range of possibilities with a single car alone is astronomical.  If variety is your thing, then Sega GT has that too. Pick and choose from any number of race types and classes and then take the full tour or delve into a single solitary race. You can enjoy the qualifier or skip it entirely and go straight to the main event. You can even slam cars head to head with your buddies in an intense session of hot-seat play, upload your scores onto the Internet along with the rest of your fellow GT fanatics, or even mess with a slew of VMU mini-games to earn some extra cash. This one has it all!  Learning curve and spotty cityscapes aside, Sega GT is the best driving simulation that Dreamcast fans could hope for. With such a diverse list of things to see and do and a collection of cars and options worthy of any local pot luck, how could you go wrong? A veritable mine of gaming gold, you owe it to yourself, your friends, and your Dreamcast to purchase Sega GT today.  -- Jeremy Dunham, IGNDC", "date": "Aug 29, 2000"}