{"name": "Spider-Man", "name_review": "Spider-Man", "ref": "https://www.ign.com/articles/2000/08/31/spider-man-18", "text": "Since the advent of video games, various companies have taken a shot at the Spider-Man license, with little or no success. I can remember playing an Atari 2600 Spider-Man game back when Underoos where en vogue. It was frustrating as all get-out, but I was a serious arachnophile with a penchant for wall-clinging, and that's all there was. Even at the budding age of eight I realized that a better game would present itself eventually. Little did I know it would take eighteen years to happen.  Thankfully, the good folks at Vicarious Visions and Activision have ended the drought with Spider-Man, an aptly-titled offering for the Game Boy Color. Scheduled to coincide with Activision's Spider-Man release on PSX, the game succeeds in capturing that certain ~what it is~about comicdom's wise-cracking web warrior. Features Based on the comic book hero's adventures Wall-crawling, web-slinging...and spider senses. Familiar end bosses such as Venom and Dr. Octopus Only for Game Boy Color  A side-scrolling action adventure, Spider-Man has all of the elements: great graphics, responsive controls, and a faithfulness to everything Spidey. Add to that awesome boss fights--a who's who roll-call of Spider-Man villains (Doc Ock, The Lizard, Carnage, Hobgoblin)--and you've got yourself a keeper.  What sets this apart as one of the best games on the GBC today is the same thing that sets Spidey apart from the rabble: all the cool stuff he can do. Vicarious Visions put a lot of effort into making the feel of Spider-Man match expectations. Can he swing through the city on a rope of webbing? He sure can. Can he cling to every surface imaginable? Yup. Can he take on the likes of Carnage and emerge victorious? Depends. Can you? All of this is made possible by a simple control scheme and smoothness of movement. For two buttons, that's pretty impressive.  In fact, the only drawback to the control scheme is the button combo to shoot a web ball. It calls for you to roll your thumb from the B to A button. This move, when executed a number of times, will cause you to develop a blood blister roughly the size of Nebraska on your thumb. In addition, you may only hit one button, jumping in the air at a crucial stage in the boss battle. Not good. Luckily, the only control issue to speak of.  Almost everything else about the game is wonderful. The story revolves around a mysterious plot involving Venom, The Lizard, Doctor Octopus and eventually Carnage. I would be a cad if I gave away the plot to you, but it is classic comic book stuff. The cut scenes contain the same feel as looking through the pages of a Marvel book, complete with wise-cracks, intrigue and a twist at the end. Spidey roams freely through six different maps, including the City (both day and night), the Docks (also in two shades), an abandoned Warehouse, Subway, the city Sewers and Doctor Octopus' Secret Lab. There is a prescribed path to completing the game, but virtually every area can be expolored from the get-go, and every single one is huge. The Sewers are twice as big as anything in Metal Gear Solid. Throughout these various environments, the webhead conducts his heroic business. As he progresses, he gains power-ups that remain with him the rest of the game, including Super Web Ball, Web Shield, Health, Attack and Defense improvements.   The graphics are, as Mike Myers once said, ~Like butta.~ Spider-Man transcends his pixels to become a muscular, acrobatic little thing. It's the same for the rest of the characters in the game, especially the bosses. Doc Ock's tentacle walk is awesome, as is Venom's ferocious symbiote shred and Hobgoblin's mad glider ride. The city backdrop is simple but beautiful, the sewers grungy and foreboding. There is a lot of mood in this game, and a good deal of it is derived from the detailed backgrounds.  At times during the game, I felt as if I was playing a slicked-up version of Bionic Commando. While the swinging arm action contributed to this feeling, most of it can be attributed to the soundtrack. The thrumming, driving rhythms of Spider-Man were very similar. If you liked the score to BC, you'll be right at home with Spider-Man's aural offerings.    All in all, Spider-Man is a tight game with very few issues. If I were searching for a problem, it's that once you beat it, there's little reason to replay. You needn't worry too much about that, though, as the game is pretty difficult. If you're a Spider-fan, it's a must buy. If you're not, it is still one of the finest GBC games available today.", "date": "Aug 31, 2000"}