{"name": "XCOM: UFO Defense", "name_review": "PC Retroview -- X-COM: UFO Defense", "ref": "https://www.ign.com/articles/2000/09/01/pc-retroview-x-com-ufo-defense", "text": "There were a lot of PC games released before IGNPC was conceived through the union of IGN and PC, and some of these games were so good and influenced the design of so many other games that they deserve a little space of their own on IGNPC. That's why we stopped by our old bud Tom Chick's house, woke him from his drunken slumber, wiped the crust out of his eyes, and asked him if he'd like to evaluate some of the PC gaming classics as compared with their contemporaries. He wittily replied, ~Uh, sure,~ and thus PC Retroview was born.  It's rare that the game that begins a genre is still the best example of that genre six years later.  Think of the exponential improvements in the games that followed Civilization, Wolfenstein 3D, Dune 2, or Wing Commander, for instance.  But this is exactly what has happened with Mythos' X-COM -- although there have been two sequels and probably about a dozen or so imitators since X-COM pioneered turn-based squad-level games, X-COM remains the best of the lot.  Although it is probably the most influential game in the genre, X-COM technically wasn't the first.  The developers at Mythos had previously created a game called Laser Squad, which contained a lot of the basic gameplay of X-COM but was missing the alien motif and campaign mode, both important elements in X-COM's success. But Laser Squad is little more than a footnote in gaming history (albeit a footnote with good hot seat multiplayer support strangely left out of X-COM).  The genre really began with X-COM, which was born in England as UFO: Enemy Unknown, only to be imported and renamed by Microprose.  Although it was never a bona fide commercial success, X-COM remains a cult hit and a darling among long-time gamers.  There are four things that make X-COM great that still haven't been surpassed in other games. 1) The sense of attachment to your troops Almost better than any RPG, you care about your characters in X-COM.  Once stories start happening to your characters, they take on a special significance.  The best computer games don't necessarily tell you a story, but they let you create your own memorable stories.  You'll remember the time a new squaddie single-handedly took out a roomful of aliens with a suicide grenade.  You'll remember being ambushed before you could step off the ramp of your Skyranger.  You'll remember the time a bad ass female soldier mowed down everything in sight with an auto cannon.  You'll remember the time you just flattened an entire building because you knew an alien was hiding inside.  You'll remember the time a rookie with a med-kit dashed into harm's way to save the lieutenant.  You'll remember your early attempts to train and use psionics against the aliens.  You'll remember those tense hunts as you pair your men off and spread out into back alleys and farmhouses.  You'll remember your first raid against an alien base and your first visit to someplace further away than you thought you go.  Because the characters improve through battles and accumulate stories, it's not always about how big your gun is, something first person shooter and many RPGs can't see past.  Instead it's about where a character has been and how far he's come.  As in real war, a brutal and senseless process of natural selection winnows the lesser soldiers out, leaving behind the strong and the lucky.  X-COM was made to be played over the long haul as an ongoing story that is just as much about your characters as it is about an alien invasion.  It's a seemingly minor detail that you can name your characters, but this makes a big difference when it comes to giving them a place in your imagination.  Everyone has probably used the names from Aliens: Drake, Vasquez, Hudson, Hicks and Apone.  Maybe even Gorman and Frost.  Did you get as far as Dietrich, Spunkmeyer and Wierzbowski?  For a really weird experience, name your troops after people you know, your friends and family, your boss or your co-workers.  It's pretty demoralizing when your mother gets shot or your best friend gets mind-controlled and you have to put him down. 2) The way the gameplay unfolds in the campaign The way you play X-COM changes as your hard-working scientists climb the tech tree and give you new ways to play the game.  It starts out small with your men taking up rifles against Sectoids in small UFOs.  But X-COM keeps throwing in new twists, like motion scanners, hyperwave decoders, and battleships with full complements of well-armed Mutons and their Ethereal overlords.  Bigger guns and psionics come along as you're facing more powerful enemies, but there's always a sense that your resources are limited and you have to spend them wisely.  Time is just as precious a resource as money as you fight for the hearts and minds of the countries of the world.  Some of the fun is sucked out once you learn some of the tricks like how to manufacture laser rifles for a thriving economy or how to build a base optimized for defense.  But even then, there's a lot to do between battles.  X-COM is a long game and you'll probably fight over a hundred battles by the time it's over, but they're held together and driven by a strong and compelling strategic shell. 3) Atmosphere X-COM rode in on a wave of renewed interest in aliens and conspiracies a la X-Files.  It conveys perfectly the feeling of being on the fringe of a horrible vast plot from somewhere else.  You get a real sense that those little alien bastards are poking their noses into international affairs, that they're up to something as they flit about in their nimble ships.  The actual incursions are just moving dots against a map of the world, but it completely works from the point of view of someone sitting at the base and tracing radar contacts while sending out interceptors to shoot the offending UFOs down.  It works even better once you start to appreciate the cause and effect relationships between the different alien ships and how they influence the political and financial scene.  It's really a surprise when the little boogers come gunning for you at your own base.  During the actual missions, X-COM used darkness and limited visibility to good effect.  What you couldn't see would kill you, so every door and dark alley was an unnerving potential trap.  Nighttime missions were especially frightening.  Death could come quickly in X-COM, especially in the pre-armor phases of the game.  The sound during the missions deserves special mention: shrieking victims, slithering hissing aliens, and an eerie pulsing soundtrack.  Even the sound effects in the shell screen were great.  How many times have you heard a control panel sound effect in a movie or TV show and thought to yourself, ~Hey, that's an X-COM button!~ 4) The way you can break stuff An important element in an action sequence, particularly one with guns and other things that go boom, is how you clearly demonstrate the destructive power of a battle.  Bullets wreak havoc.  They break glass and shatter the bottles on the bar.  An explosion can knock over a wall and a molotov cocktail can burn down a house.  But in a first person shooter, all this has to be scripted and it takes up precious CPU cycles.  There's a strange irony in the fact that it takes a staid turn-based game like X-COM to really capture the mayhem of combat.  Things break in X-COM and the game captures this beautifully.  It's one thing to shoot out windows and punch holes through walls with your gun, but destroying the entire side of a building with a rocket is uniquely satisfying.  Throwing a grenade is truly an event.  My first shot with a blaster bomb was one of those rare peak gaming experiences that I'll never forget.  Because X-COM captures these four elements so well, it remains the best turn-based squad-level combat game you can play.  There are, however, some excellent games obviously inspired by X-COM. The best have been Sir Tech's Jagged Alliance titles, which are almost identical in gameplay to X-COM, but with a less interesting motif (mercenaries are so 80s) and a set of pre-made characters with cutesy sound bites; Red Storm's elegant Shadow Watch takes a skill tree approach to character development and uses board gamey rules for a more streamlined and manageable alternative to X-COM; and Tim Brooks' underrated masterpiece 101st Airborne in Normandy uses mini-campaigns to relate the story of paratroopers in World War II.  None of these games has come together as flawlessly as X-COM, but they're all worthy successors.  The biggest drawbacks to revisiting X-COM are the graphics and the interface.  The graphics are much worse than I remembered them.  Over the years, my imagination filled in the blanks with exquisitely rendered high-res art.  In my mind's eye, I have a very clear picture of the texture of a Sectoid skin or the sheen on the hull of a UFO.  But while playing X-COM again, I found myself squinting at blurry shapes on the screen.  ~That's supposed to be a Sectoid?~ I asked myself.  320x200 resolution is almost painful, not just because of the coarse graphics, but also because of the extremely limited screen real estate -- I kept wanting to zoom out during battles.  The screen to equip your soldiers is still an utter nightmare, with no way to set up default loadouts, see stats while you're equipping your troops, or arrange the order of your troops in the drop ships.  Some of these things are addressed in Scott Jones' excellent XComUtil, however. Mr. Jones has done a masterful job of not only addressing many of the interface problems, but also better balancing the game and giving you better ways to arrange information and manage your troops.   -- Tom Chick Want to share your opinions with the world?Talk about it on the IGNPC message boards,  orsend some mail to IGNPC about this story.  Presentation  The fairly primitive interface is more palatable because it's just so damn cool.   7.0  Graphics  Ouch.  I didn't remember them being this bad.    4.0  Sound  X-COM knows what atmosphere is all about and the sound does most of the work.     8.0  Gameplay  The perfect marriage of tactical battles, a strategic-level campaign, and character development that outshines most RPGs.   10.0  Lasting Appeal  The more you play, the better it gets.  Try the ~iron man~ approach  no reloading!  for the ultimate in nail-biting, ulcer-inducing tension.   10.0  Should I Go Back and Play It?  It is, after all, the best game ever.  YES  OVERALL SCORE    (not an average)   9.4 In July 1999, IGN selected X-COM as the Top Game of All Time.  At first glance that appeared an odd choice.  I was a little taken aback that something flashier or more popular wasn't chosen.  But I didn't necessarily disagree.  ~Yeah, X-COM was pretty damn good,~ I thought.  But after spending the last three weeks rediscovering the maddeningly addictive nature of X-COM, I have to shrug and nod.  Yep, I'd say this the best game ever.", "date": "Sep 1, 2000"}