{"name": "Microsoft Golf 2001 Edition", "name_review": "Microsoft Golf 2001", "ref": "https://www.ign.com/articles/2000/09/07/microsoft-golf-2001", "text": "Let's get one thing straight off the bat -- I'm no Tiger Woods.  The way this reviewer sees it, the pants pulled up to the armpits and shirt raided from grandpa's closet style has no place in this century.  Preppy ballcaps, Polo button downs, afternoons with Japanese businessmen on the green...  no way, Jose, not my cup of tea.  Yet despite the anti-yuppie handicap, I find the sport to be quite intriguing, as evidenced by an embarrassing addiction to Pete Jacobsen's Golden Tee Golf.  And before you start screaming ~hey, Mr. E-I-C, why did you pick this 'tard to do the review,~ please allow me to point out one teensy weensy thing: I fall squarely into the title's target audience.  This isn't your pappy's game of golf.  If it's serious, hardcore, authentic professional action you demand, then check out Sierra's PGA Championship Golf or the Jack Nicklaus series instead.  Microsoft Golf 2001, developed with beginners in mind, is basically, for lack of a better term, Links Light.  Here you'll find no fascinating course history videos, wild player animations, or hoity toity geezers high off winning a televised round of 18 holes.  No, no... all that's on offer in this budget priced program is a solid simulation of the executive's favorite leisure activity.  Control is a defining factor when evaluating a golf sim's value, and Microsoft's attempted to tackle this issue in more ways than one.  For the initiate, an easy swing mode is proffered, allowing novices to set an aiming post on the player view or overhead map screen, then click and hold down the mouse button to have a meter determine the power of their swing.  Intermediate players can opt for a classic two or three click method of handling, with the only difference from easy mode being the need to set the snap, which initiates straight shots, hooks, and slices.  Whichever of the two standards systems you prefer to use, the computer picks the best club for the occasion, although it's no problem to change to a wood, iron or putter on the fly.  Finally, for the pro, there's powerstroke mode, a tricky but so-called accurate simulation of an actual swing.  Prior to the start of a single or multiplayer (LAN, TCP/IP, Zone.com connections are supported) game, it's mandatory to select the participants and course for play.  Ironically, while a hefty seven courses such as Bighorn, Kapalua, and Three Canyons can be chosen, only three default computer opponents wait on the menu, keyed to specific difficulty levels.  Enterprising golfers can simply create some competition using the nifty, idiot-friendly player editor, which, in PC fashion, supports both genders.  Remember, however, before rushing blindly onward, that it may pay to check out the tutorial lessons -- you can never be over-prepared for the green.  Ominous warnings notwithstanding, Microsoft's done their best to ensure you'll have a pleasant round.  Pop-up menus make navigation a breeze, so that switching to a one wood, pulling up a course overview, or humbly requesting a mullingan's a piece of cake.  Golf with the easy swing system and you'll be coming under par on a regular basis, though the classic mode of control beefs up the level of challenge a tad.  Shot performance can be predicted to a certain degree, but not with Nostrodamus type accuracy, as wind, terrain, and fairway conditions factor into the equation.  A couple minor gripes do, unfortunately, wind their way into your happy, lobotomized state of mind.  Balls roll frightening distances after touching down, leaving you to wonder if they've been soaked in Mr. Wizard's Magical Anti-Friction Cream for a spell.  Truthfully, this is annoyance you'll learn to deal with, but it's a design quirk that defies explanation.  Of more importance are the announcer's comments, which like to arrive a few seconds too early or late depending on the situation.  When the commentary's off kilter, it alternately seems like pointless filler or ruins the pleasure of viewing a shot, since it's the element of unpredictability that makes golf such a fascinating sport.  Where's the fun in seeing what should be a dead-on long bomb sail over the bullseye, going way past the hole, after the computer already bitched and moaned about it?  Ah well, it's easy to let these minor headaches bleed away when you're loafing about a coastal town on a sunny, summer day.  By the same token, beautiful resorts like Sea Island, the lush greenery of Kapalua Plantation, and charming rock cliffs found at Entrata at Snow Canyon impose a relaxed sense of well-being on your consciousness.  While photo realistic, however, backgrounds are neither animated nor heavy on the outlandish scenery, but to a fault, they're gorgeous and run in a magnificently high resolution.  Ambient noise, such as rushing water or quacking ducks, gives the game a surreal atmosphere that's rather infectious.    Caveat emptor, or buyer beware, is a PC player's rule of thumb.  But in the case of Microsoft Golf 2001, you're getting what you paid for and then some.  Not as deep as its big brother, Links LS, this title's also a lot more user friendly and less intimidating for newly baptized proponents of the sport.  At a mere twenty bones, you're getting the bargain of the century.  Spend away guilt-free, friend, as although Microsoft's latest leaves room for improvement, it still comes in way under par (and that's a good thing, for you non-golf-lingo speakers).   -- Scott Steinberg      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Sep 7, 2000"}