{"name": "San Francisco Rush 2049", "name_review": "San Francisco Rush 2049", "ref": "https://www.ign.com/articles/2000/09/08/san-francisco-rush-2049-2", "text": "With the original San Francisco Rush, Atari produce a fast-paced, go anywhere racing game with some odd shortcuts and an exaggerated physics engine. All the tracks in the game were modeled after real-world locations in San Francisco, which made it more dear to the heart of folks living in the Bay Area (yours truly included). Most racing games out on the market were of the usual ~follow-the-track-and-go-really-fast~ fare, so when Rush hit the arcade market it offered more variety in the way people raced their video vehicles. Well, that and the kick-ass subwoofer in the seat, and force-feedback steering wheel didn't hurt, either...  But the reason why the game was so fun to play for many fans wasn't the game's original intention - what gamers discovered was that it was a hell of a lot of fun exploiting the physics and shortcuts, allowing them to create their own freestyle stunt mode. I mean, when you leap over a jump with a helicopter spin, and wall grind down the side of a building, it's a real rush to land on all four wheels without exploding - especially when you've still got some momentum to launch off another incline for a secondary trick. Whether or not the developers had this in mind with the original game, it wasn't the main focus the first time around - but it certainly evolved this way for the console rendition of San Francisco Rush 2049.  The Dreamcast version of Midway West's (formally Atari Games) arcade racer has expanded beyond the ~mere~ racing design. Naturally the team based everything the console game is around the arcade version, but you'll quickly realize there's so much more to do in the game, and so much more playability involved. This isn't a racing game anymore...it's a driving adventure. And what's more, it's a whole bunch of fun to play. Rush 2049 is split into three easy pieces - racing, stunts, and multiplayer battle --  and each of these modes is given equal focus in the game design. So if you just want to get out and race, go right ahead. If you want to put the physics engine to work, hit some of the crazy jumps in the stunt mode. And if you're a fan of vehicular combat against one, two, or three of your buddies...get your trigger finger ready.  The racing mode has six solidly laid-out racing tracks based on existing routes in the city of San Francisco - if it were the year 2049, of course. Apparently purple, blue and yellow neon, floodlights, and Slim Jims (gotta love product placement) are in ample supply in the future, and the cityscapes are filled with them. The Bay Area Rapid Transit has been replaced by a more timely monorail system, and you'll bump into these things all over San Francisco - many times as scenery, but other times as part of the track, so watch it. And yes, the Golden Gate Bridge, Lombard Street, and trolley systems are still in use in the year 2049, so if you're a fan of the City By the Bay, you'll find lots of recognizable landmarks all over the circuits. And these cityscapes are rendered with gorgeous, high-resolution texture maps that easily look more crisp and clean than the ones used in the arcade version. If anything, the Dreamcast version just looks outstanding.  But to actually dominate the races, you need to learn the tracks beyond the tracks - tucked away are some outstandingly well thought-out shortcuts that will, if pulled off correctly, knock a second or two off your time...or at the very least, give yourself a serious jolt of adrenaline while doing them. For example, one awesome shortcut takes you through a BART subway system, out over a sky bridge, through a loop-de-loop which spills you back out onto the main road. This is more than half the fun of the racing game - it's not about beating your computer opponents. It's about beating the track - can you discover and pull off the shortcuts, AND come out ahead?  The trademark of San Francisco Rush is its use of an exaggerated physics engine, and it's in full-force here. You're free to limit the physics by choosing a car with limited handling, keeping the car relatively straight and stable when it hits a bump or jump, but the real challenge is pulling out all the stops. That's what the Extreme setting is for - no limitations in car handling. Hit a bump and your car will start to wobble and jolt, and if you can't keep it in check you'll find yourself sailing into the Transamerica building tumbling end over end. To add a little bit of control, the console developers included a downright clever device - the wings. Any time you find yourself in the air, you can pull out a set of wings from the sides of your car and control the rotation of your vehicle - you can stabilize a flip, or create harsher flips just for the hell of it. The wings are handy during a race since you can avoid a harsh roof landing - but the wing is absolutely necessary in the stunt mode, which we'll talk about later. The addition of the wings is not only welcome, it's ingenious.   To encourage the use of the shortcuts and exploration of the entire track, the designers deviously placed eight gold and eight silver coins all over the tracks. The silver coins are generally placed in easily-accessible positions on the  road, but the gold coins  you really have to find the right places to jump or fall to grab these suckers. Whenever you snag one of these coins it's saved to your VMU - and you don't have to be in a race to get them. If you so choose you can simply play in practice mode and explore the tracks to your heart's content finding every one of these little trinkets. Hidden treats like extra vehicles are uncovered if you can grab all coins in a specific track. These coins give Rush 2049 an additional gameplay element found in platform games, and inflate the playablility even more. And we haven't even gotten to the stunt or battle mode yet!  But we are now - the stunt mode was an item that was tested in the Nintendo 64 original Rush 2, and is making a return in the console edition of Rush 2049. Simply put, your challenge is to perform flips, jumps, wheelies and spins, drive on two tires, grab airtime  and actually land your car without exploding.  The more different tricks you can pull off in a single stunt, the more points you get. You can pull out your wings whenever you feel you need some help, but doing so will reduce your overall bonus and drastically hurt a potential top score. The Catch-22 is, you really need to use the wings if you want to insure a safe landing - some points is better than no points, after all.  Right on boot-up, only one stunt track is available - but don't feel jipped. The stunt mode also has a series of coins you need to collect by leaping into the air - other arenas will open up if you can uncover all the coins. Stunt mode is great fun and could stand alone as its own game - which just adds to the overall value of Rush 2049.  But that's not all! Plug in two or more controllers and a third gameplay option opens up - Battle mode. If you've ever played Vigilante 8: Second Offense, you'll know what to expect - it's you versus your opponents, guns attached to the roofs of your cars, out for a little vehicular combat. The Rush rules still apply, which means jumps, flips, and airtime - but now you have to deal with your opponents' gunfire in the process. You'll have to pick up heat-seeking missiles, machine guns...even a sonic distruptor to knock out your buddies - there's so much strategy and action in this mode alone it could have been its own game. And honestly, as of this moment, the battle mode in Rush 2049 has to be the best four player combat game available on the Dreamcast. Yep, that good.  While Rush is outstanding fun, it's not a perfect adventure  the problems of Rush 2049 are small but plentiful and problematic. My biggest complaint about the design is the lack of focus in its interface - even though there are a ton of secrets and extras to uncover in the game, there's really no indication that there's any of this stuff right off the bat. The casual gamer might feel a bit ripped off when he sees only four available tracks and one stunt arena, not realizing that there are two more tracks, and at least four stunt arenas. The front-end is to blame here, since it gives almost no indication that these things exist - grayed-out menu items would have done this game wonders.   But it's also a bit obnoxious to hide so many awesome elements so deeply in the game, taunting the gamer to grab tokens that are so out of reach only the guy who did the design could accidentally hit it with his car. The game should have had at least two stunt arenas open, just to be fair to the folks not quite talented enough to hit those hard-to-reach coins.  The racing portion of Rush 2049 is probably the weakest link, yet it's the one that you have to play the most to uncover many of the hidden treats in the game. The computer AI algorithms are so simple you can see exactly what's happening - they're following one spot on the track, and if they get jolted out of the way they do whatever it takes to get back in that straight line. They're not intentionally aggressive - they don't try and nudge you into pile-ons or trolleys or other buildings. They're just doing their own thing.  Once you learn the way of the AI, it's pretty easy to exploit it and win the circuits - which will unlock the other tracks in the game.  Finally, the 3D engine. Most of the time, it's brilliant. Silky smooth, high resolution, offering a fast speed and a high framerate 99% of the time. But then, kick up tire smoke or dirt and the game drops from 60 FPS to below 30 for a split-second, especially in the race when the computer AI is employed. There's something about the dynamic transparencies in Rush 2049 that hits the graphics processor, which shows up as a drop in framerate. This doesn't hurt the playability one bit, but it is noticeable simply because the graphics are absolutely gorgeous most of the time. A fix in this department should have been in order, because everyone's going to see this performance hit.  Problems aside, the Dreamcast version is hands-down the best version available - even killing the arcade version in looks, playability, and sheer lasting play. Every mode in this game is also in four-player splitscreen mode - and not a bit of fun is lost in the reduced screen. Don't pick up Rush 2049 because it's a racer - you'd be missing the entire point. Rush 2049 is all about vehicular action, and this game has it in spades and is done extremely well.  -- Craig Harris, IGNpocket As far as top-down racing goes, San Francisco Rush 2049 on the Game Boy Color is above average  there's just not much in the way of options to shake up the variety.  You've got Circuit Mode that'll pit you against the computer AI, and Time Trial to race all nine tracks by yourself. But that's it  there isn't even a Vs. mode using the link cable. Compared to the console versions of Rush 2049, the portable version severely lacks variety -- it's good for a few spins around the year 2049, but don't expect the game to last into the future.", "date": "Sep 8, 2000"}