{"name": "Polaris SnoCross", "name_review": "Polaris SnoCross", "ref": "https://www.ign.com/articles/2000/09/12/polaris-snocross", "text": "Vicarious Visions has had a moderately successful run as a game developer.  As PC products go, its softography reads like any generic software company's game lineup would be expected to. Past titles include point and click adventures (Synnergist), action shooters (Dark Angel), and a spaceship sim (Terminus).  Concordantly, on the console side, its work has been limited to Game Boy Color conversions.    Needless to say, with no blockbusters behind them, the company's resume desperately needs the pomp only a breakthrough hit could supply.  And so, given the opportunity to fashion its first PlayStation disc, the creative minds in question are proud to present.......another frickin' average snowmobile racing game?!   Gameplay Stop me if you've heard this one before.  Players find themselves strapped onto the back of an engine-powered sled of their choosing with the intention of racing a friend or three additional AI drivers.  A single event, instant action mode, or tournament series must be chosen.  First place divisional finishes, based on points garnered through placement in the contests, enable you to unlock new classes of vehicles and tracks.  Knowing the title's theme, courses are surely slippery, convoluted and padded down with shortcuts and obstacles.  Alright, the setup isn't exactly original or deep, but we can forgive and forget if the gameplay isn't smokin', right?  Unfortunately, second chances or no, this frigid racer deserves the cold shoulder.  While the sense of speed is dead on and the secret passage laden tracks make for adequate stomping grounds, the upgrade mechanics totally dilute the challenge factor.   Hang off the side of the sled, remove your grubby paws from the handlebars, or perform any of the other multitude of ho-hum stunts and you'll earn points towards a wrench icon. Collect wrenches in this manner, or via a high ranking in the races, and you can enhance each mean machine's top speed, acceleration, handling and stability scores. It's a nice touch that these attributes can be added to or subtracted from at any point between events, so that one's new roadster of choice can be juiced up when they tire of the same ol', same ol'.  But the main problem is that regardless of how many times you fail to win a division, wrenches won't be lost. Hence, even if you suck royally, you'll still eventually be able to win due to your chosen vehicle's raw performance superiority.   Now let us take a moment to skewer the system of collision detection, or lack thereof.  To make a long story short, rhyme and reason play absolutely no part in Polaris SnoCross.  Aggressive computer controlled opponents try to ram humans into an early grave, but try to nudge their keisters towards a rock wall and see how far it gets you.  Land on top of some poor dweeb's head and he will alternately keep on truckin' or fall flat on his face, but there's no sure way to tell what the outcome will be.  This kind of unpredictability undermines the learning curve, leaving you to wonder if there's really any way to master the controls.   Nevertheless, warts and all, Polaris SnoCross feels remarkably good. Vehicles handle with shocking, arcade-style precision, and echo their strain or ease by way of controller vibrations.  Feedback like this imparts useful knowledge, such as hints on when to lean in a specific direction to ease the friction on a curve or pull back to soften the impact of landing.  Constant bumpy runs over off-road terrain almost, and I do mean almost, enable you to overlook some of the more glaring design flaws.   It's just a pain in the arse to have to keep striving for the top slot.  Generally, you lose rank due to some stupid program oddity, not human error.   And because only three tracks or less form each division, tournaments are a do-or-die proposition, so be prepared to restart often.  Newer model vehicles (2000, 2001, prototypes) and unlocked tracks are the reward for stellar performance, though they're kind of a blueball when you consider how much work goes into attaining the prizes.   Graphics Ever heard the term ~mixed bag?~  While some aspects of the presentation, such as sled and rider models, pass a cursory inspection, others fall terribly short of the mark.  Consider, if you will, the horizon, which is a pixilated still picture glued to the heavens that surely began its putrid existence as placeholder artwork.  A continuous, dainty stream of snow flurries rains down, but fails to cover up the blocky, lifeless hunks of green mush that are supposed to pass for trees.  Riders tumble painlessly from the saddle during collisions when they should've been forced to endure bone breaking, face first introductions to Mother Nature's handiwork.   Backgrounds composed of flowing waterfalls, winding caverns, quaint villages and countrysides blanketed in white powder stretch as far as the eye can see.  Hills, dales and rocky outcrops pass by as you speedily tear through the courses at a universally high frame rate.  Still, a continuous flurry of blotchy crap flying out from under your treads serves as a constant reminder of the visual inconsistencies.   Sound Techno is the genre of choice here.  Mostly, the tunes just bleed into the background, since they're 100% Grade A cheeseball fare.  In contrast, the sound effects do the trick nicely.  Packed ice crunches when slid over.  The hum of engines carries above the roar of the wind.  Walls crackle when sleds make contact. It's not bad stuff.Snowmobile racers suck on the PC, which is where they got their start.  Although consoles are better suited to handling the style of play, the genre's not so peppy to begin with.  Polaris SnoCross, unfortunately, not only cops this lackluster theme, it also introduces absolutely nothing above and beyond the norm in terms of graphics or gameplay features.  But even clones can be fun sometimes. Had Vicarious Visions cleaned up the collision model and tinkered with the game engine and gameplay aspects a little more, this title would've been a lot more fun to play.  As things stand, though, it's a generic, shallow racer that's fun in spurts and worthless in long-term value. Fifteen bucks is a mighty tempting price point, but just remember, you get what you pay for.", "date": "Sep 12, 2000"}