{"name": "Madden 2001", "name_review": "Madden NFL 2001", "ref": "https://www.ign.com/articles/2000/09/15/madden-nfl-2001-4", "text": "The football itch starts in July. After all, a man can't live on baseball alone. In August, the itch grows to a tremble. It's football withdrawal, and there is no treatment, except for a new season to begin. To fill the void, we begin to collect information, stats, player transactions. We look forward to the season like nothing else. That final electric moment when we sit down in front of the tube, united with millions in the ultimate football communion, we are sated.  In the same way, we look forward to the newest videogame football offerings. Each year, the good people at Electronic Arts bring us a little something called Madden; only the biggest football gaming franchise of all time. Each year, the game is stocked with a brand new slate of characters, (usually) some snazzy new graphics and (hopefully) improved gameplay.  New features this year:  Everything that was in Madden 2000 plus: Refined player models more accurately reflect the proportions of their real life counterparts. New play-by-play and commentary from Madden and Summerall New defensive controls allow players to adjust defensive coverage at the line of scrimmage. New game menus New player specific celebrations and taunts. Two minute drill minigame allows up to ten players to compete against each other for a high score. Collect and trade Madden Cards. Accomplishing certain tasks awards players with Madden Cards.   Gameplay This will be the last Madden 2001 game on the system. After Madden 2001, EA is moving on to the next gen systems, so this is their final brushstroke on the N64 Madden canvas. How does it stack up against previous years? It does the same things right that Madden has always done. It is fun as all get out, has great AI and tons of options and modes to keep you happy. Sadly, however, the graphics appear to have taken a small step down and the commentary is as inane as ever.   The good news is that Madden feels and plays like football. The players do not make obvious AI mistakes and scoring (at least against the computer) is never inflated to the point of implausibility. There are full play books for every coach, each of which can be used by every team. For instance, If playing as the Raiders, you can use Mike Holmgren's (of the Seahawks) plays as you lead Oakland into battle.   The gameplay is similar to Madden 2000 and the controls are almost identical. The HUD menus are easy to follow and the control scheme is intuitive. However, this year's players seem to have lost a step. Plays move a bit sluggishly, and gameplay suffers slightly as a result.   Supposedly, EA was removing a few polys from the player models to make the game flow more smoothly. The graphics suffer a bit as a result, appearing a little jaggier and definitely blockier. The players are top-heavy and boxy, somewhat resembling the ill-fated PS hero Blasto. Last year's models were smoother, more closely representing what you'd expect from the N64. You can't take a step back. What's more, the frame rate hasn't improved with the drop of polys. If anything, it suffers a little. It never gets super-chuggy, and the frame rate doesn't affect gameplay drastically, but the issue is there.  The animations, however, are very good. Players duck to take a hit, crunch and lean in a backfield collision and stretch for high passes. The passing and receiving motions are well-done, and the celebrations aren't annoying, which is saying a lot.  The controls are fairly responsive, unless trying to make a cut. Once you get your guy moving one way (especially along the sideline), it is difficult to switch direction quickly, which can easily result in a lot of out-of-bounds running. Overall, though, Madden 2001 continues the improvement in the running game that began with last year's version. Strong offensive lines open gaping holes, while lesser squads leave backs scrambling for the corners.  The passing game is as good as ever. Players run crisp routes, and you'll have to time everything correctly to complete passes. The defensive AI is great and will step up to gobble weakly-thrown balls.   The AI, as ever, is solid. Each team plays as it would in the NFL. The Broncos lean on the running of Terrell Davis, the Bucs rely on stingy defense to set up the offense. The champion Rams open up the play book with a full-on land/air assault. Individual players are fully tweaked as well. You're more apt to score a touchdown on the run with Brett Favre than Drew Bledsoe, and more likely to sack the QB with Jevon Kearse than practically anyone else.   If only the commentary could have been as strong. Sure, it's the kind of fare you expect on Sunday morning, but even a befuddled Madden can muster more than three repeating statements per game. Summerall's play by play is strong as ever, but unfortunately all of the commentary seems to have been badly compressed. The announcers sound like they're speaking through Stormtrooper comm links the entire game. The rest of the sound is fairly weak as well. The whistle is over-harsh, the impact sounds a bit uninspired (and unvaried) and the ambient noise just passable. Since no one comes to Madden for the sound, this is no surprise. Just the facts, ma'am.  Where Madden has always been the strongest has been in options and features. There are eight separate game modes, tons more than any football game out there. In addition to such staples as Exhibition and Season, there are Franchise, Custom League, Tournament, Practice, Situation, and Two Minute Drill modes. The Franchise mode is absolutely essential to replay value, allowing you to march your team through several seasons, accruing stats the entire time. This mode alone is a great reason to buy the game. For hardcore team fans, it gives you the chance to grow (and maintain) a dynasty, reigning over the NFL over a series of years.   A slick Practice mode allows you to learn the basics of the game by pitting a specific defense against the offensive scheme of your choice. If your buddy is consistently destroying you on the Sweep, you can clamp down and do your reps here. This is one of the most complete Practice modes around, complete with instant replays, access to all of the play books in the league, and the chance to substitute second string players.  The Situation mode is one of the coolest features in any football game. It allows you to set up whatever circumstances you'd like to play under. If you want to play the last play of the Superbowl, trailing by 6 with the ball on the 30 yard line, you can do it. If you want to give yourself a 50-point edge to begin a game, this is the place to do it. Situation mode allows you to reconstruct famous football moments and play them yourself. This is a serious bonus for hardcore football buffs, and will extend the replay value of the title greatly.  Another thing that will extend the replay value is the expansion of the Madden Card feature. After you've completely dominated the game, there are still plenty of Challenges to keep you busy. Can you get five touchdowns with the same player in game? Go through an entire contest without dropping a pass? Make it through the season without losing a fumble? The Challenges (introduced last year) allow you to earn points toward Madden Cards by accomplishing goals like these. There are 278 in all, and you'll have to pull off a couple superhuman feats to grab them all.  If you want to get into the huddle and Under the Helmet of real NFL football, head over to NFL.com. With live chats, real-time audio and interactive polls, you can experience NFL action like never before. Ultimately, Madden 2001 is a good game and a fitting end to the series on the N64. While the graphics suffer this time out, the game remains quite fun and won't disappoint the Madden fans out there. With great replay value and the ever-important current rosters, it is virtually irresistible forN64 football fans. Madden is football, and it proves it here again with a solid, tricked-out game for the new millennium.", "date": "Sep 15, 2000"}