{"name": "Doraemon", "name_review": "Doraemon", "ref": "https://www.ign.com/articles/1997/06/12/doraemon", "text": "Have you ever experienced the feeling of de-ja vu? If not, maybe you should give Doraemon a try. Oddly enough, this Epoch developed game plays, looks, sounds and feels exactly like Mario 64, minus the fun, replayability and graphical splendor.  The story behind the game is simple and uninspired. The spiritual stones representing earth, air and water have broken and scattered around various areas. You must recover and reassemble these stones only to fight an evil dragon and restore order to the land.  To say the game is unoriginal would be the understatement of the year. Doraemon uses the same textures as Mario 64. From the green landscapes and flower patches to its bridges and stone walls this game looks like a very early version of Miyamoto's 64-bit monster. In fact, this game so closely resembles Mario 64 that if it were possible to remove the main characters from the screen we could have contests trying to figure out which game is which.  The two games are separable, however, in terms of animation and graphic fluidity. Unlike Mario 64, Doraemon often has slow-down problems, camera glitches and pop-in. Sometimes your camera view just goes crazy and the whole game looks as if it is experiencing its very own, private earthquake. Considering that Doraemon lacks the detail of Mario 64 and that these glitches happen more often than not this is inexcusable.   The fact that the Doraemon's graphics are a blatant rip-off of Mario 64 could be overlooked were it not for its gameplay, which also borrows heavily from Nintendo 64's mascot game. The only problem is Doraemon comes nowhere near what Mario 64 accomplished in terms of control and good old fashion fun.  Your character strides through the game jumping on enemies, crouching through areas and has the option of using different weapons (once found) to reach certain goals. The interesting twist to all of this is the character selection process. You can choose from 5 different characters all with different attributes. Doraemon, Nobita, Sizuka, Suneo and Gyian all have unique characteristics. One is short and fat, another skinny and nerdy, yet another looks like a stuffed blue emotionless cat with no ears and there's even a girl (oh boy!). This is cool because some characters are better at certain tasks than others. For example, the girl can jump higher than anyone else and is a good pick for situations that require lots of jumping. Possibly the best part about these characters is that you can switch between them anytime in the game by pressing the start button. This both comes in handy and adds to the whole gaming experience -- implementing a bit of skill for choosing the correct character at certain points in the game.  Doraemon moves slowly and is plagued with glitches and minor annoyances. In the first five minutes of gameplay alone we encountered numerous level barriers -- all invisible. You cannot go into the water right away, yet there is nothing there to stop you from doing so. There is just an invisible wall between you and the water.   The characters of the game, from Doraemon himself to the bunnies on the grass, are seriously lacking in detail and textures. The bunnies in particular look as if somebody got a little creative with a milk carton, painted it completely white with two dots for eyes and sent it on its merry way. The fact that Mario 64 moves more fluently and has a graphic finesse that blows Doraemon out of the water only further demonstrates how inexperienced the developers of this title were.  And finally we come to the sound for this game. Frankly, we are still under the impression that developers simply gagged a baby repeatedly in order to capture quick spits and spats of pure gibberish for most of the games sound effects. The stuffed blue cat with no ears (one of the many exciting characters of Doraemon) walks around spouting, ~Gah!~ every time he jumps. He lands back on the ground with a sweet sound that oddly resembles a toilet plunger being plucked back into life. Ah yes, this is sound creation at its very finest.            Doraemon feels old, dated and shoddily programmed when compared to Mario 64 -- it's that simple. Doraemon is what you get when you try and capitalize on a groundbreaking title, but you lack the knowledge, expertise and creativity to do anything except chase its shadow. Stay away from this one.", "date": "Jun 12, 1997"}