{"name": "Frogger 2", "name_review": "Frogger 2", "ref": "https://www.ign.com/articles/2000/09/26/frogger-2-2", "text": "It's no secret how I feel about 99% of Majesco's Game Boy Color products -- other than the company's rendition of the classic Frogger, the company hasn't put out any quality portable gaming. It's almost as if the company was just in it for the cash and not much else. Keeping this in mind, it's amazing how a company can change its ways -- something must have snapped inside that company, because Frogger 2 is one of the best titles the third-party company has produced for the portable system. Sure, it's still Frogger, but it's everything that made Frogger fun, plus one important added ingredient: variety. Features Five worlds 32 levels Battery back-up, recording three players' progress and records Only for Game Boy Color  Frogger was an original concept released in arcades by Konami in the early '80s -- it was frog against the natural and human elements. The challenge was to get five frogs from the bottom of the screen to one of five slots at the top, avoiding traffic on the bottom half of the screen, and getting across flowing logs and turtle backs on the top half's river. It was simple but extremely addicting, and while there wasn't much else to the game, it was maniacal when you got into the later levels. A great, albeit graphically-updated rendition was made for the Game Boy Color in the first few months of the system's life, and the company responsible for that game has gone back to the pond to breathe new life into the toad.  The update is essentially the same game idea, but with a whole bunch of new elements thrown into the design. Maps are now absolutely huge, forcing the screen to scroll in all four directions while giving you plenty of viewable area. And the sheer size of each of the levels means you only need to get one frog to safety to complete the round. Hazards aren't restricted to the street and river anymore -- some levels cut across treadmills, gutters with rolling barrels, icy fields...there's even a few clever levels where you have to follow an invisible bridge over a chasm, with only a quick blip to tell you the proper path to follow. But that doesn't mean the classic elements aren't there -- you'll still have to cut across traffic and over a flowing river...but these things have been designed with a lot of challenge in mind, and some of them get tough. Thank god you can find a checkpoint flag in the middle of levels when you die, as well as get multiple frogs to get through each level.   And even though the challenge of each of these levels is enough to keep playing, the designers threw in a few more gameplay elements to increase the gameplay. Within each level is a certain number of gems that can be collected -- collecting all the gems will reward you with a full timer (running out of time causes DEATH) or extra lives. What's more, the game will remember when you've scooped up all the gems of a certain level and record it to the battery-backed memory. Every time you finish a round, the game records your time, if you've collected all the gems, and if you've collected all the gems without losing a life. If you beat a level, you can access it through the game's menu system. A frog icon means you've completed the level, a gem icon means you've collected all the gems in a level, a gold gem icon means you've completed all the gems in a level without losing a life, and a trophy icon is awarded when you've beaten the level's record time. And if you've broken the record and scored a perfect round, you get the coveted gold trophy. What happens when you get all the trophies? That's up to you to find out. This record element may seem simplistic, but it actually encourages gamers to go back and beat a set time, or scoop up all the gems. The replay value skyrockets when bragging rights are on the line.  Graphically, the game is another step up from the original -- the frog character is large, but so is everything else. Frogger is set in a top-down perspective, but the ~camera~ is tipped a bit to give the perception of depth. And in the audio department, the developer added the exact same frog-hopping sound effect that was in the arcade version nearly two decades ago. Ahhh, nostalgia.  There's not much to Frogger 2, but that's its charm -- it's an easy game to pick up and play, it's a ton of fun, and you'll be hooked when you want to go back and get a better score for each of the levels. Frogger is a true arcade classic, and Frogger 2 doesn't mess with the classic design -- it just adds to it with great success.", "date": "Sep 26, 2000"}