{"name": "Austin Powers: Oh Behave", "name_review": "Austin Powers: Oh Behave!", "ref": "https://www.ign.com/articles/2000/09/29/austin-powers-oh-behave", "text": "When faced with the latest slew of games from Rockstar, nearly identical games based on the Austin Powers license, I am forced to ask, ~Who are these games for?~ The first two released in the series of four, Oh, Behave! and Welcome to My Underground Lair, are both rated T by the ESRB. However, about fourteen seconds after turning the GBC on, any teen will realize that the game has one of the lamest interfaces ever. Anyone older (or younger, for that matter) will likely run screaming.  Features Minigames and activities Extensive database of sound clips Battery back-up to save settings Printer support to print notes Link cable support for two players in certain games Infrared support to trade data and items Compatible with Austin Powers: Welcome to My Underground Lair Only for Game Boy Color    Sure, there's a platform game somewhere in Oh Behave!, but where is it? When you want to actually play a game, you'll have to wait as the GBC simulates a Windows boot-up. It's annoying enough when you have to wait for a computer to boot, but a simulated boot is enough to make you pull your hair out. After you sit through a load time that rivals an old DOS game, you are taken to a sort of desktop screen. This is your base of operations for the rest of your Oh Behave! experience. From the desktop screen you can manage your mock computer. Choose the type of wallpaper your GBC will sport, set your sound effect options and color screen and determine your screensaver. Everything here is '60s mod flavored, in case you were wondering. (Insert lame Austin Powers quote here.) Are you feeling the full force of the Austin Powers computer experience? Me neither, and I think it's because I bought a game and I'm eager to play it.  But it's not so easy. I spent a good five minutes actually looking for the platform game. Turns out it can only be accessed via a menu that pops up when you click the male symbol button in the lower left corner of the screen. When you actually do get to play the game, coyly entitled ~International Man in a Platform Game,~ you'll likely be underwhelmed. It's standard platformer fare based loosely on the Austin Powers aesthetic. Austin must avoid bouncing cop hats and soccer balls en route to what? More levels. It's not unplayable, but it isn't original, either. If you got it for free from a friend and have nothing better to do on a car ride across the US, you might want to pull out this game to kill some time.  In addition to the platform game, Oh Behave sports a few more features. On the virtual GBC desktop, you can also choose between Programs and Games (why the platformer isn't found there, I will never understand). Programs have such accessory-style applications as the Shagulator (a calculator), Austin's Pad (a rudimentary word processor) and a lame Internet ~program.~ The Internet application is nothing more than a fake browser with nothing but information about the Austin Powers series of movies.  Austin's Pad is interesting, allowing users to write and send messages to each other (using the GBC's infrared), but you have to be too close for it to even be fun. In addition, the Pad allows you to print out messages with the Game Boy Printer. That is, if you can get it to work. When I attempted to print a message, it printed out gobbledyguck nowhere near what I had typed.  The Games were actually quite fun. Choose between Rock/Paper/Scissors, Domination and Mojo Maze. Rock/Paper/Scissors pits you against an AP baddie (from Frau Farbissina to Fat Bastard) in the classic game. I didn't think I'd live long enough to see this game converted into video format, but here it is. Trust me, it is no fun. Domination is basically Othello, so if you are a fan of the classic board game, you'll enjoy this. It does add value to a cart that might otherwise be plain awful.  Mojo Maze is probably the best thing on the cartridge. A shameless rip-off of Pac-Man, the same rules apply. Run around a maze collecting icons while the ghosties chase you. Pick up the power icon and turn the tables on them. Of course, everything here is Austin-themed. The icons are male symbols and the ghosties range from snakes to female underwear. It's uninspired, sure, but it beats the rest of the stuff.  There is a lot to do on the Oh Behave! cart and little of it is good. Like it's WTMUL cousin, the computer interface here really gets in the way of enjoyment. When you do find what you're meant to be doing, you'll find it bland and derivative. Save your money for something that isn't such blantant license drivel.", "date": "Sep 29, 2000"}