{"name": "Wizards & Warriors", "name_review": "Wizards & Warriors", "ref": "https://www.ign.com/articles/2000/09/30/wizards-warriors", "text": "When D.W. Bradley and company set out to make Wizards & Warriors over four years ago, Heuristic Park's goal was to ~put live role-playing in a box.~  And, as Bradley readily admits, ~This one comes closer than anything I've ever worked on.~  That's a mighty substantial claim considering Bradley has been intimately involved with both tabletop and computer RPGs for nearly two decades now, and was one of the creative forces behind Wizardry V, VI, and VII.  We have to agree with Bradley, though.  Wizards & Warriors comes about as close to tabletop RPGing as any computer RPG we've ever played, and it certainly captures the spirit of classic RPGs such as The Bard's Tale, the early Might & Magic series, and Dungeon Master.  Like most games nowadays, Wizards & Warriors opens up with a nicely rendered movie that gives you a bit of background on the game's story.  The narrative is a bit hokey, and I'm not going to go into the whole thing now, but needless to say, it's the stuff that all good fantasy RPGs are made of: legendary swords, holy priests, and the ultimate embodiment of evil.  If you want to read more about the background, check out our preview of the game.  So now that you know why you're trying to save the world, you're ready create some characters. Wizards & Warriors features a refreshing cast of races to pick from to form your party.  The standard Elves, Gnomes, and Dwarves are all here, but you'll also find a variety of other not-so-overused races like the diminutive Pixie and a slew of animal-inspired species like the tiger-like Whiska and the elephant-inspired Omphaaz.  The diversity of races is a nice touch in the now all-to-predictable fantasy RPG world.   While the inclusion of only four basic professions--Warrior, Wizard, Priest, or Rogue--when you start the game may seem limiting, Wizards & Warriors uses an ingenious and quite fulfilling class acquirement system that lets you pretty much change your role at will, as long as you have the attributes to satisfy the minimum stat requirements. These new roles offer your characters the ability to learn new skills and traits, as well as new realms of magic, and usually require a guild quest to achieve, but are well worth it for the extra talents they give you to work with.  Speaking of quests, there are plenty of them in Wizards & Warriors to keep you busy for a long, long time.  Wizards & Warriors is one of the biggest RPGs we've come across in a long time, offering well over a hundred hours of gameplay if you complete all of the side quests, but less than the 200 hours reported if you're an experienced RPGer.  You can find many of the quests at your respective guild, and you'll also run into various NPCs scattered around the gameworld that will give you special quests.  Most of the gameplay revolves around completing these quests, which will take you to a variety of different overland, indoor, and underground environments.  These environments are absolutely massive.  It will take you hours upon hours upon hours to get through even the starter dungeon, and some of the higher-level dungeons will keep you up way past your bedtime as you fight unconsciousness to explore ~just the next few rooms~...then the sun rises and you call in sick.   The cookie-cutter outdoor settings do get repetitive, but the amount of space represented both inside and outside without having to load from the hard drive is very impressive.  This keeps the action flowing as you explore the expansive surroundings, and you only have to take a break from the action when you enter a new dungeon or town.  Unlike the other areas, towns are represented in multi-layer 2D, and you simply scroll the screen until you come across the building you're looking for.  Since towns in RPGs are usually places you go to sell a few items, get healed, stop by your guild for the latest news, and then head back out for more adventuring, I appreciated the simple city layout.  It really gets you back to the task at hand rather than torturing you as you spend hours searching for the elusive blacksmith, or the hidden Rogue's guild.    The only part that makes the game drag sometimes is that it's an incredibly long process to earn money and, therefore, items in the shops.  While your characters will advance in their levels at a good clip, giving you access to higher rank stats, skills, and spells, it will take you a while to earn enough gold to buy that shiny suit of plate mail or that +2 robe you've had your eyes on since level three, but this also really makes you feel like you're working for it.  Also don't expect super, ~we can kick anyone's ass~ characters in Wizards & Warriors, even at higher levels.  While your skills, spells, and stats increase with each level, you usually only get one or two hit points per level, so you better be careful when a powerful wizard starts throwing big damage area spells your way.  The adaptive timing combat is in either real time or turn based, making it easily tailored to your favored gameplay technique.  However, the combat system does suffer from the same problem every single classically styled first person RPG has been plagued with--there's not much strategy in the battles.  You pretty much feel like you're controlling one big multi-headed adventurer who can sling mana, cast healing spells, and swing a mighty axe.  You can't stack your characters in a defensive position with the fighter-types in front and the magic users in back, so everyone in the party is constantly open to attack.  But like I said, this is pretty much how it's done in all first person RPGs, so it didn't come as much of a surprise that Wizards & Warriors used the same model.  RPGs are renowned for unbearable and cheesy voice acting, which is occasionally done by the programmers and the office secretary at the last minute, but Wizards & Warriors is an exception.  Most of the voice work is actually really good, and the acting certainly isn't bad, especially for a game.  I particularly liked the narrator's voice, which was deep, clear, and booming, just like a good narrator should be.  The voice system is comprised of several separate sentences and phrases, similar to Joe Montana's Sports Talk Football, strung together to make one full conversation.  It works really well for a game like this where there are thousands of lines of dialogue.  Conversing with NPC comes in the form of a list of keywords.  You pick what you want to ask about and they tell you what they know.  You have to be patient in the conversations because you might miss something important if you leave too early.  The dramatic music in Wizards & Warriors fits the ~save the world~ mood perfectly, and is put in the background from the beginning, just where it should be.  There's also good use of 3D positional sound in the game, especially in dungeons.  As you pass by torches you can hear them crackle and sputter in the appropriate speaker.    Wizards & Warriors won't let you down graphically either.  The fully 3D characters and environments, although repetitive like I mentioned earlier, are nicely drawn, and each of the NPCs has a personality onto their own.  The lighting and spell effects in the game are quite nice, too.  Unfortunately, the D3D renderer seems to have a lot of problems.  It doesn't even support Voodoo2 cards, so if you've got a Voodoo2 in your system, you're SOL if you want D3D.  Also, when you run the game in D3D, the icons and text gets blurry and jagged.  However, the software renderer is quite powerful, and looks good to boot.  And since you have to read a lot while playing Wizards & Warriors, I preferred the clean fonts of the software renderer. Although you can't play the game in the software renderer in higher than 640x480, there didn't seem to be any major speed differences between the D3D and software versions.  The game ran smoothly on all of the systems we played it on, ranging from a PII300Mhz to a PIII600Mhz, although we did have to adjust the detail levels down a bit for the 300Mhz machine.    As much as I liked the game, there are some things that could be improved.  The most obvious are some quirky control problems.  The game is rendered in full 3D, so like most first person games, it can be a real bitch to climb ladders or make precise jumps.  Personally I thought there were too many jumping puzzles for an RPG, especially considering how sluggish and unpredictable the jump command can be at times. Because of the 3D world, you can also exploit the combat system in the game by backing up constantly and firing off arrows or spells at your opponents until they fall.  Of course, I guess you could do this in any 3D game as well as in real life, but you can run backwards at the same speed as the monsters, so you can really take advantage of this and take out creatures much more powerful than your party.  You also can't invert the Y-axis on your mouse, so you're locked in pushing up on the mouse making your characters look up, and pushing down making them look down.  This can take a while to get used to if you play other first person games with an inverted mouse, but you get used to it quickly enough.  Overall though, these criticisms are minor in comparison to the good points in the game, and I'm willing to deal with a few tribulations in a game that's this deep and fulfilling.  If you like old-school RPGs, you'll fall in love with Wizards & Warriors.  It has its share of problems, but they're only minor blemishes on an otherwise brilliant gem of a game. The folks at Heuristic Park have done an excellent job rekindling that classic RPG feeling, and I for one have been missing lots of sleep for this one.  -- Tal Blevins      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Sep 30, 2000"}