{"name": "Insecticide", "name_review": "Insecticide Review", "ref": "https://www.ign.com/articles/2008/03/12/insecticide-review", "text": "Have you ever wished your graphic adventure games had a little more action?  Or that your platformers required a bit more puzzle solving?  Well, Insecticide is here, kind of a Reese's Peanut Butter Cup of point-and-click and action games.  Unfortunately, only one of these elements turned out well.  While the investigative segments of the game are a blast from the past, the platforming and combat are clunky and frustrating.   Developer Crackpot has created an engaging world for Insecticide. The game is set in an alternate future where insects have evolved past humans and become humanoids.  People are still around, but they have devolved into hominids and are barely surviving in the sewers.  Many crime story clichs have been written into the script, but videogames can usually get away with reusing material movies ran into the ground years ago.  You've got your grumpy police chief, your stakeout mission, your conspiracy that goes all the way to the upper echelons of power  All of the dialogue is peppered with insect puns that may have you rolling your eyes at first, but they end up being endearing.  The game is often funny, and there are lots of geeky references to 60s sci-fi movies and other areas of pop culture.     The player controls Detective Chrys Liszt as she investigates a possible homicide at a powerful corporation.  To catch the bad guys, she alternates investigating crime scenes and chasing suspects.  The crime scenes feature tried-and-true point-and-click gameplay and it's done very well.  These portions of the game are fun, funny, and will provide a decent challenge to adventure gamers -- in fact, the game was created by LucasArts veterans who clearly know the genre.   When the action kicks in, though, the fun checks out.  Chrys can only fire one shot every few seconds, so forget about intense shootouts.  And while she has a decent inventory of weapons, there's no way to switch them quickly.  Either the Y button can cycle through them one at a time, or you can remove your hand from the fire button and select the gun you want with the stylus.  She also turns at snail speed, so trying to dodge enemy fire is fruitless.   The investigation sequences are really fun.  The platforming...not so much. The graphics during the action sequences are pretty drab, and it can be hard to tell where you need to go next.  Even if you do know, the camera might not let you get a good look.  The game is also very dark, so playing on an old-school original DS phat might give you problems.   There are unforgiving tightrope-walking segments that you'll be playing many times over.  Most of the time the game respawns you near the place of your demise, but there are a few sections that send you too far back and force you to repeat frustrating areas over and over again.   For the most part the audio is a quality affair.  The voice acting is great, and the music is fully orchestrated.  The soundtrack is a mix of seedy jazz and more intense, action-packed stuff.  But the music doesn't loop smoothly, so it stutters briefly as it restarts, like a DVD menu.  Sound effects are often missing at key moments.  At one point Chrys defeats a giant, mechanical spider boss, but the beast disappears from the screen without any noise, any explosion, nothing.This one is a real heartbreaker.  I really wanted to score it higher, but the action sequences get in the way of what could have been an extremely enjoyable adventure game.  Crackpot has created an engrossing world with Insecticide, so maybe a sequel will focus more on pointing and clicking than frustrating and agitating.  There are a lot of places this franchise could go, with plenty of interesting characters to develop.  Sometimes a game should just do one thing, and do it well.", "date": "Mar 12, 2008"}