{"name": "NASCAR Heat", "name_review": "NASCAR Heat", "ref": "https://www.ign.com/articles/2000/10/11/nascar-heat-5", "text": "Papyrus has long owned the simulation market, particular in the NASCAR category.  EA tried to knock them off their perch with their NASCAR Revolution and its sequels, but although those titles had a lot of graphical sizzle, the simulation fan just wasn't buying the physics model that EA produced, nor was the gameplay as compelling as it should be.  Add online play to the category and Papyrus still stood tall and proud.  However, under the radar, some ex-Papyrus guys formed a little company called Monster Gaming, Inc, (or just MGI).  MGI's first game was Viper Racing, made for Sierra Studios (who also owns Papyrus).  Viper married simplified and realistic gameplay with a great physics engine and close racing.  It was a title praised by the critics, even if its appeal was limited in scope.  I guess we shouldn't be surprised to learn that MGI began working on a NASCAR simulation, in direct competition with their old friends at Papyrus.  With the financial resources of Hasbro Games backing the deal, the fight was on.  My first question was WHY?  Why do we need two Papyrus-like companies to build basically the same game?  What good does it do to flood the market with NASCAR titles? (especially when the CART series could use a good sim).  The answer, as I discovered talking to MGI, was that they were going to make the game that EA failed to make, the game that would appeal to the casual gamer as well as the diehard simulation fan, a game that would allow a gamer of any level of experience to immediately experience pack racing at nearly 200 mph and build their abilities to the point where they could 'flip the switch' into hardcore simulation mode and be true hardcore sim racer.  Papyrus has never been particularly good at that.  They pretty much forced you to learn the hard way.  So here's the feature set that MGI set out to make in order to compete:  First, a range of physics modes, from Normal to Expert to the worst kept secret about the game, the ~Hardcore~  switch (which is enabled in a game configuration file).  Second, a Gran Turismo-like challenge game called ~Beat the Heat~ designed to take a beginner and challenge them with progressively more difficult challenges, accompanied by video footage of the real drivers introducing the challenges.  Then there's ~Race the Pro~, where you get to race against a ghost of another car which is actually a replay of a REAL NASCAR driver's best lap when they sat down and played the game!  Finally, there's single races, seasons and multiplayer.  Their special features and the desire to build a game which was playable out of the box was a noble goal, one we don't expect to see from the hardcore fanatics at Papyrus.  MGI needed to make the ~Normal~ mode challenging but not too difficult, and at the same time, make the ~Hardcore~ competitive with the best physics models that Papyrus had to offer. The short answer to whether they succeeded is YES.  I'll get into the good and bad of these features, but if you're debating the 'safe choice' of Sierra/Papyrus' current NASCAR title or NASCAR Heat, the decision clearly swings Heat's favor, except in the case of the larger fields of multiplayer racing.  The Normal mode helps your car stick to the road better, keeps you from spinning most of the time, and generally lets you focus on RACING instead of just driving.  Sure you can drive too deep into the turn and bang into the wall, but you can usually continue and be competitive.  But the biggest reason the ~Normal~ mode will appeal to people is that the AI has been designed to race WITH you.  You can choose the ~pack size~ (generally based upon your computer's specifications), and the AI will basically match speeds with you and let you try to work yourself through a 2-4 car wide traffic jam to the front of the field.  If you start to slow down, they'll adapt to you and you can catch up.  If you start to get ahead, they'll start racing you a little harder.  The idea is to keep you in the middle of a NASCAR sandwich at all times, and this they do well.    The downside of this is that you can learn some bad habits that will hurt you if you try to carry them into Expert or Hardcore mode.  An example is trying to pass a car on the apron in the middle of a turn at Atlanta.  Going halfway on the banking there will send you backwards towards the wall in Hardcore, but in Normal mode you get away with it.  You can also push cars around you without fearing loss of control.  So a great way to pass in Normal mode is to get under someone below the line and push them high.  In Expert mode you'll have to figure out how to get by WITHOUT putting yourself into a dangerous position in the process, and that takes more patience, and definitely takes longer.  Nonetheless, I've never felt as much of a part of a real Winston Cup race as I have in NASCAR Heat in this mode because the cars are everywhere, the spotter won't shut up, and the crowd is roaring.  Unlike Papyrus' current titles, the cars will pass you low or high, and will leave you hanging in the middle of two trains of cars, or move in front of you to give you a draft.  It's all quite fun.  The only problem is that your ability to make contact with other cars with near-impunity means that the adrenalin doesn't flow as fast as it would if you were in Expert or Hardcore mode.  And this brings us to ~Beat the Heat~.  The Beat the Heat ladder is done in NORMAL mode only.  While its job is to teach you how to race competitively and learn how to get around the track the fastest, it teaches you the bad habits I mentioned above.  Some of this results from the challenges being too short.  You might have just a few laps left to go from one position to another, such as 16th to 8th, or 4th to 1st.  The challenges are often set up so that if you don't make your move fast, you lose any chance you had to make up the difference before the end of the race.  After trying the 'proper' techniques of drafting and passing and realizing they took too long, I realized that I had to dip under the line, force cars up, dive into cracks between cars and force them apart, and so on. These things will get you out of a race in real life, but they are NECESSARY to beat these challenges.  For this reason, I think that the Beat the Heat mode is a double-edged sword.  On the good side, they are fun, they teach you how to get around the different courses, they are short, and to some degree they teach you the right lessons.  On the bad side, they allow you to exploit the forgiving nature of the Normal mode by driving improperly in order to beat a challenge.  Someone flipping from Beat the Heat directly into Expert mode racing is in for a rude surprise when they try those tactics!  It would have been good to have an Expert mode for Beat the Heat where the challenges lasted a little longer so that more realistic racing could be done.  I also want to make sure you know that not ALL challenges are in this category, but a majority of them are.  Ultimately, Beat the Heat makes for a great game, as long as you realize you can't take some of your bad habits with you into the races in Expert or Hardcore modes.  Race the Pro is quite simply racing against the ghost lap of a real NASCAR driver who played the game.  Even Dale Earnhardt, Sr. was playing the game and contributed a lap at Daytona, for instance!  I'd have loved to seen video of Dale Earnhardt (who made fun of Jeff Gordon for liking video games) sitting down trying to put down hot laps at Daytona for us to beat!  Then there is the meat and potatoes part of the racing in the game.  You can race a single season or a single race, and you can set parameters such as distance, wear rate (so that even short races require pit stops), pack size, and difficulty (four set levels plus a custom percentage level).  If you are playing at Normal difficulty, the good news is you can forget about car setup.  There isn't any.  No garage to make your life difficult or make you feel like you're not winning because of a setup problem.  Switch the game into Expert or Hardcore and you're now in the hotseat.  You'll be able to save and load car setups by name and the game will remember the last used setup, just as Papyrus' titles have done.  And you can set up anything you need to, including grille tape!    The flags and damage models are adjustable, so you can make the game as realistic as you want to.  And the damage model can definitely be serious.  Even a slight jam of the fender into a wall at Talladega can destroy your day by ruining the nice streamlined shape your car needs to be in to keep up with the other traffic.  The damage is visible from outside the car, but even if you're inside the car, a popup screen can be activated by function key to show you which of the elements of your car (such as suspension, front spoiler, or wheels) is damaged and by how much.  Tire wear, temperatures, race statistics, and lap statistics are all available by these function keys.  Animated pit crews will dash around your car to change your tires and add fuel after you pull into your stall.    The game graphics are quite good when compared to what is standard out there today.  I have  a P750 and a GeForce 1.  The game runs smoothly with full mirror detail on and 1024x768 resolution from inside the car in all but a few tracks, such as Martinsville (which Papyrus hasn't figured out, either!).  I can run with 43 cars with no problem.  There are a bunch of graphics options to let you turn these things down for frame rate, and a frame rate sampler which runs a bit of the game with a car in the middle of a 43 car pit lane smoking tires and spinning out.  You can thus set your graphics options without having to actually play the game.   Everything I've experienced on the machine tells me that just about anyone with a P400 or better should be getting a very nice looking game, and even someone with less could get something tolerable.  Of course, you might ultimately have to reduce the pack size, but by adjusting mirror detail, car model detail levels, and so on, most people will find a nice balance.  The tracks and cars are near perfect.  They are perhaps a little less so than the screenshots of the expected NASCAR 4 release from Papyrus, but they are great nonetheless.   The tracks in particular feel very accurate and show what you expect them to show in terms of banking, width, and trackside objects.  And every track is here in its full glory.  Winston Cup points leader Bobby LaBonte was the technical consultant for the project and tested each track and gave a great deal of feedback to the people at MGI to help them make every track feel right, and just judging from the time I've spent with the game (in hardcore mode, of course), the tracks feel like I believe they should.  So many games come out with a celebrity endorsement which does nothing but embarrass the celebrity, but I believe Bobby can be proud of his input into the process here.  The addition of a memory-based replay system is quite nice, and with a recent patch you can decide how big your replays can get.  You can go back quite away in a race to watch the laps unfold from any camera perspective, including in-car and TV camera perspectives, but MGI didn't stop there.  They added a small windowed replay where the focused car's 'telemetry' is shown, not by an indecipherable graph, but with bars showing how much acceleration and braking is on, how fast the car is going and how many RPM's the car is pulling.  When learning a track, racing against a better player online, or against AI cars, you can answer such questions as ~should I brake or just lift?  And if I brake how hard, and where?  And if I lift how long should I stay off?~.  I've spent much effort trying to improve my lap times by asking friends who were faster how fast they went through corners or when and how much they braked.  Now I don't have to ask (and they don't have to know I'm studying them!).  The audio mix is likewise excellent.  The cars sound as they do on TV, both from inside and outside the car.  Collisions and skidding sounds are just fine.  The spotter is quite talkative, letting you know when cars are above or below you.  However, he's often late or even missing in action.  You can trust him to a point, but you cannot ignore your mirrors or take a lot of chances unless you're SURE the path is clear, at least not in Expert or Hardcore mode.  The spotter is one area where improvement is definitely needed.  While caution flags are implemented and cars obey them by slowing down, the AI needs some serious work, even with the patch that has been put out.  All too often AI cars slam into one another while slowing down under caution, and pit accidents are still too frequent.  MGI needs to seriously study this issue because AI caution behavior is perhaps the weakest part of the entire game, and one that might scare some hardcore racers into running back to Papyrus.  However, my biggest problem during races was not seeing ENOUGH cautions.  Accidents between cars were few and far between.  I seemed to be the only one capable of making mistakes!  Of course, that's not entirely true.  Other cars did make mistakes and yellows occasionally did come out for something I wasn't involved in, but it was rare enough for me to be concerned.  This is something that should definitely be addressed, because the game would be more interesting if pit strategy played more of a role.  I should also point out that whether or not auto-drive under caution and auto-drive in the pitlane is up to you.  It's an option you can turn on or off.  I prefer auto-pitting because it allows me to set up for my stop and change my pit requests while I'm motoring down the pit lane.  But regardless of the setting, if you barrel in above the pit lane speed limit, you're likely going to get a black flag.  The physics model in Hardcore is where the game becomes the Papyrus killer, at least until NASCAR 4 comes out.  The game features a full physics model derived from the Viper physics model, and the car's tires can lock up, cars can lose rear grip and spin around into the wall, and going below the white line in the middle of a high banking turn can be a race ending collision up into the wall.  The RS H-Pattern Shifter is supported, and the effects of shifting up or down on the car are very noticeable, as I learned the hard way when downshifting too soon in the middle of the corner at Martinsville.  My car bucked sideways and nearly spun because I'd not let the revs drop enough to shift and I just threw the car out of whack with my sudden shift.  Another demonstration can be trying to take a car high around turn 4 of a track like Daytona.  As the banking goes away, if your car is loose at all and you're still finishing your turn, there's a good chance the rear will go wide, the front will nose in, and your car will volunteer to deface the nice painted logo on the big stretch of grass between the pit lane and the track!  I've had enough wild rides there that with many an advanced setup I've learned to keep the car low and have a nice straight wheel exiting that corner!  Drafting is another area of strength.  Think of the draft as the wake of a ship passing through water.  Get into that vacuum behind a car and you start to go faster.  The closer you get behind another car, the faster you go.   But as the air closes back in behind the car, the draft gets fainter and fainter.  You really have to 'sniff' it out and watch your race data to see whether you're gaining a bit or losing a bit.  Once you start gaining, if you can hold your position behind the other car, you can slowly move up and either pass them or bump-draft them down the straight.  But you don't want to make a mistake and lose a pack of cars at Talladega or Daytona, because you may fall too far back and be unable to pick up a whiff of that draft, and they'll leave you behind for good (again, this is where yellows come in handy, as they bunch up the pack, and the game just doesn't generate enough of them!)  Control configuration is excellent.  Dual axis controls are supported for separate throttle and brake.  Null zones are configurable as is 'overshoot', which allows you to decrease the amount of control movement needed to go from minimum to maximum.  Some special features help make up for jittery potentiometers to 'smooth' the input into the game as well.  Force feedback is tunable as well.  This is an area where MGI did something smart:  they added a configurable force feedback dead band in the middle of wheel travel.  The reason for this is that latency between the wheel and the game causes oscillations on the exits of corners just when you need it least, with a car a few inches away on either side while you're trying to straighten the wheel smoothly.  The dead band around the middle helps kill these oscillations without taking away your ability to have force feedback the rest of the time.  Excellent job here.  Multiplayer is supported with the number of players depending upon bandwidth, though I've yet to see more than 14 allowed, even with a T1.  Interestingly, you can add AI cars to the mix and they actually don't hurt the connection as much as you'd think.  Obviously the more human players you have, the disruptive the presence of AI cars will be, but it means you can have, say, an 8 person race, where maybe 5 or 6 of them are AI cars set at whatever level of difficulty you specify.  Finding races is the harder part, but there is already a utility called Internet Race Finder out there which helps you find Heat racing servers where you can join in and play, and there's generally a bunch of games there, and I hope to see more in the future.  Warping seems to be low, and you can draft closely behind other players online, something that has been a problem in the past.  When looked at as a complete package, NASCAR Heat is hard to top.  Its physics model may well be outdone early next year by NASCAR 4, but the model in Heat is no slouch, and the gameplay is fairly well balanced here.  The design goal of teaching beginners how to race and raising their level of proficiency seems to be met, for the most part.  There are definite improvements which need to be made, and I hope will be made as part of another patch, but MGI has surprised many people out of the gate with a high quality first shot into the NASCAR world, perhaps a reflection of the Papyrus heritage of the company.  They knew exactly how to go about doing what they did, and Hasbro gave them the resources to do it.    I look at the PC NASCAR market now as consisting of two heavy weights.  MGI has come in as the challenger and delivered a stunning first blow to the reigning champ.  Now it's up to Papyrus to show that the champ will not go down to the challenger.  In the meantime, we consumers win as the level of play from both companies has risen dramatically as a result.   -- Randy Magruder      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.  If you're a diehard fans of both NASCAR and simulations, then you'll find NASCAR Heat to give you a great racing experience, with the ability to tweak your car, customize your race, or play a full competitive mode at your leisure. The Beat the Heat and Race the Pro modes give you a little extra, and multiplayer can fill in some idle time with some friends. Overall however, the game doesn't deliver enough of a broad experience to give less than sim racers the road experience they're probably looking for.", "date": "Oct 11, 2000"}