{"name": "Championship Motocross 2001 Featuring Ricky Carmichael", "name_review": "Championship Motocross 2001 Featuring Ricky Carmichael", "ref": "https://www.ign.com/articles/2000/10/12/championship-motocross-2001-featuring-ricky-carmichael", "text": "began its life as an extremely impressive PlayStation-exclusive game. It was good and popular enough that THQ deemed it viable to move to other consoles -- and that's why we get Championship Motocross 2001 Featuring Ricky Carmichael on the Game Boy Color. The game has serious potential as a handheld motocross title, but technical and balance issues hurt the design so much that it's strictly an average racing Game Boy Color cartridge. Features 30 licensed riders More than 20 tracks 16 bikes Only for Game Boy Color   Let's first talk about the good things about the game developed by Tiertex. This isn't your average behind the vehicle racing title on the Game Boy Color -- the engine used here is pretty darn unique for the handheld. The tracks are built from full motion video (FMV) pieces that play at different speeds depending on the speed of your bike. Using this technique, the developer was able to make tracks with cool 3D jumps, bumps, and turns, as well as roadside objects to give the layout a bit more glitz to it. Because of the Game Boy Color's limited color capabilities, the bike sprites overlay on top of the prerendered roadways nearly seamlessly and interact with them just as perfectly. The only thing that's really noticable is the fact that the road doesn't change perspective when you move to the far right or left of the track. This engine has been done before on early CDROM PC games like Megarace 2000, but here on the Game Boy Color it's more believable simply because of the system's limitations.  Because this is Motocross, the developers did put in a freestyle mode, and this is the only place you'll be able to pull off some serious tricks. I'm not sure why the developer limited the tricks to only the freestyle mode instead of putting this option in the race as well, just for fun. But the freestyle mode is a definite plus, even if it's hard as heck to score points as high as the record holders that are documented on the cartridge. One cool feature made the transition from the PlayStation to Game Boy Color -- longest and highest jump per track. Shame there's no battery save to keep the records intact.  And control-wise, the game feels pretty nice -- there's a slight learning curve up front where you'll figure out right from the start not to accelerate at the starting gate before the green light, as well as not to touch the sides of the track when taking turns sharply. But once figured out, the game actually plays smoothly.   Unfortunately, the way the game has been made is also Championship Motocross's ultimate problem. There are multiple tracks in the game, but they're all pieced together with the same FMV segments -- if you watch the track animations you can see when one segment starts and ends, and when it jumps to another prerendered segment. Because of this limitation, all tracks look identical, even though they're all constructed differently. Worse yet, it takes as much as three minutes to complete a lap around these rendered courses, and when each race lasts five laps, the game tends to get a little long.  And then there's the computer AI -- I honestly don't think the developers programmed in any crash routines when the bikes get so far ahead of you they disappear off the horizon. Try as I might, I've never been able to catch up to an opponent who's two turns ahead of me, no matter how flawless a lap I pull. If they're on camera, they'll spill and fall just as naturally as you would in those circumstances, but if they get downfield, forget about catching up.   Just as a final personal commentary, this is one game where you definitely want battery save -- when will developers learn that no one wants to jot down 60 uppercase and lowercase characters for a password?  Championship Motocross 2001 has serious potential as a racing game, but there are so many problems keeping it from breaking out of the ~mediocre~ watermark. Races that go on too long, tracks that go on forever, passwords that could overwhelm a safecracker, and downright difficult computer AI. It all adds up. Maybe next year, guys...and maybe Game Boy Advance next time.", "date": "Oct 12, 2000"}