{"name": "Team Buddies", "name_review": "Team Buddies", "ref": "https://www.ign.com/articles/2000/10/13/team-buddies", "text": "Go on, admit it; everyone loves a title that they can pick up and play.   Nothing beats the euphoria that gamers feel when they shred open a product's  packaging and immediately dive into the thick of things without ever having  given one stinking thought to cracking open the manual. Previously, though,  this gleefully immature rite of passage was denied to strategy buffs, whose  bread and butter rests on a foundation built around encyclopedic sets of  rules and minutiae.  Still, traditions were meant to be broken, and it's  with fond adieu that the general publics bids that horrid maxim goodbye, for  Team Buddies has arrived.   Gameplay Psygnosis knows how to squat the fine line between reflexive action and  tactical planning, as the Lemmings series proved.  With the dawning of a new  decade, they've leveraged this expertise, honed by years of catering to an  audience of solo players, into an exquisite team based, category-defying  genre hybrid.  As can quickly be gleaned from the tutorial or trial and  error, the first order of business during play is to expand available forces  from a lone, goofy lookin' Buddy to a squad of up to four grunts.  Under  your grimy, dictatorial thumb, these basic front line troops will scour a 3D  landscape in real-time for crates, the building block from which all digital  life springs.   Provided one's base structure is intact, weapons, reinforcements and  vehicles of myriad types can be created by stacking crates in specific  configurations.  Although only a single friendly unit of any type is under  your supervised control (and units can be switched to on the fly), a system  of hotkey build orders - which are amazingly effective, we might add - can  be issued to your teammates.  Commands let characters know whether to  produce weapons, engineer tanks, clone new buddies, or do whatever they feel  is best to feed the war effort.   While it seems like play would be an unstructured jumble (and at many times  it is), underlying objectives dictate the boundaries of each assigned  mission.  To the title's credit, how the player decides to eliminate all  opponents, aright tipped over rubbish cans within a set time limit, reunite  a farmer with his lost tractor, or surmount any other goal is entirely up to  them.  Mercifully, the AI routines that power friendlies and hostiles are  clever enough to keep up with the frantic action which ensues, so all you've  got to worry about is who to kill, with what, and when to do the dirty deed.   Battles erupt at a furious pace, with combatants vying for control of a  controlled supply of resources.  You've no idea how frustrating it can be to  see valuable crates or supercrates (which make constructs ultra-powerful if  employed in their design) blown to smithereens or kicked open, thereby  ruined in exchange for the health and ammo boosters they contain.  But  that's what makes the title so frantically fascinating, since controlling  prime territory's effectively impossible.  Team advantages change with the  passing of seconds, as someone exploits an elevation, weapon or  terrain-specific (water slows buddies down, for instance) ace in the hole to  good effect. Ayup, this is one of those that's tricky to master, though  kamikaze runs with your single directly-influenced soldier boy can easily  tip the odds in favor of the good guys.   Disappointingly, the game's attraction wanes with the passage of time, as  there's only so much frenetic fun one adventure can provide.  Having had the  foresight to pick up on this fact, the producers intelligently penciled in  heavy multiplayer support.  Deathmatches with chums make for great party  filler, but it's the unlockable modes and maps (e.g. Domination, Capture the  animals, etc.) earned through single player campaign activities that  ultimately save Team Buddies from growing old and gray on the shelf.   Graphics  So the visual presentation's not something out of Total Recall, sue 'em.   Midway's British partners in crime opted to go with a childish style that  has the audacious wherewithal to resemble the misbegotten love child of  Legoland and Earthbound.  Round-headed Buddies don't need to look tough; the  lead or colorfully lit explosive force which sprays out of their gatling  guns, time bombs, shotguns, and grenades does the talking for these Fox Kids  rejects.   Backgrounds, of the same caliber as character models, would never be called  lavish. Stylish, maybe, easy on the eyes, most definitely, but  mega-stupendous, uh uh.  Yet the in-game environs and movies don't need to  rival Final Fantasy's hi-res cinematics or backdrops, since they've got an  appealing sense of fashion that's trendy, if G-rated to the max.   Sound The title's greatest weakness is its amateurish bank of audio effects.   Blubbering voices, both British and American, clumsily deliver inane bits of  dialogue when units croak and during the introductory sequence.  Come the  time combat's switched into high gear, however, you'll be thankful that  semi-satisfying weapon effects drown out the majority of the musical tones  and unappreciated script. Team Buddies is a thinking man's shooter.  No, no wait.. it's a great party game. Er, ahem, that is to say the title's also a Sesame Street-esque action/strategy extravaganza, ya know?  Eek.. uh...hmmm, that won't do.  Oh screw it, buy the damn thing and you'll be too entertained to care about what we're trying to get at.", "date": "Oct 13, 2000"}