{"name": "Jedi Knight: Dark Forces II", "name_review": "PC Retroview: Jedi Knight", "ref": "https://www.ign.com/articles/2000/10/16/pc-retroview-jedi-knight", "text": "There were a lot of PC games released before IGNPC was conceived through the union of IGN and PC, and some of these games were so good and influenced the design of so many other games that they deserve a little space of their own on IGNPC. That's why we stopped by our old bud Tom Chick's house, woke him from his drunken slumber, wiped the crust out of his eyes, and asked him if he'd like to evaluate some of the PC gaming classics as compared with their contemporaries. He wittily replied, ~Uh, sure,~ and thus PC Retroview was born.    I'm reluctant to play Jedi Knight again.  With Half-Life, the guys at Valve have really made it hard for me to enjoy other first person shooters.  Furthermore, this is also a genre that has not aged well.  Go play something with the Build engine and then come back and tell me graphics don't matter.  With Unreal Tournament and Quake III, Epic and id have made a lot of older games look really bad.  So it's with some trepidation that I reinstall Jedi Knight.  Will this be another example of a game better left to my fond memories?  Will I be desecrating one of my all-time favorites by digging it up again?    My fears are quickly allayed.  I'm remembering these levels as I play through them.  Ah, yes, the space port at Nar Shaddaa.  The irrigation canals and water tanks behind the family homestead.  The marketplace at Baron's Hed.  The banquet room in the palace where you duel Yun and the rooftops with the strafing TIE Bomber.  The crashing freighter that is like a ride down in the Hindenburg.  The cat and mouse in the wreckage with Sariss, the chick Jedi.  The excavation at the Valley of the Jedi.  These are places that made such an impression on me three years ago that there's a warm familiar feeling to them now, a sort of pleasant deja vu.  The level design is one of Jedi Knight's enduring strengths and it more than makes up for the engine's shortcomings.  The character models can be pretty rough, but we know very well what they're supposed to be, so our imaginations can take over when the polygons don't do the trick.  So what if everyone looks and moves like a marionette.  We know Stormtroopers, Imperial Officers, and all of Rick Baker's aliens from the cantina scene.  Give us a strong enough indicator and we can suspend our disbelief, even if the Tusken Raiders do look like German footmen from World War I.  Some of the engine's incidentals are painfully retro.  The particle effects, for instance, are big fat square pixels.  They're bad enough as smoke trails when you fire the Rail Detonator, but the spray from the Carbonite Gun in the Mysteries of the Sith expansion is like a big neon sign that reads ~Remember when graphics were this bad?~  Many of the levels are relatively featureless, giving them an austere look that requires a bit of imagination to fill in the blanks, much like the character models.  It helps a little that there are often innocent bystanders and droids to busy the places up a bit.  The levels can be awfully linear, throwing you up against some frustrating brick walls where you don't know where to go or what you're supposed to do next.  There are some bald key hunts and unfortunately, the game ends with its weakest levels.  The final chapters look and play more like Tomb Raider than anything from the Star Wars movies.  Although the bosses are great in theory, they don't work very well in practice -- lightsaber combat with the Dark Jedi is a frustrating exercise in just clicking the hell out of your mouse and hoping your health holds out.  Sword fighting has always been hard to get right in action games and Jedi Knight is pretty primitive in this regard.  The storyline, which is told mostly through some ill-conceived live action footage blended with digitized background, is pretty dopey.  You're the mercenary who becomes a Jedi while trying to foil the plans of a Dark Jedi named Jerec.  Jerec has kitty whiskers painted on the side of his face and an entourage that includes a Keanu Reeves look-alike and some bad actors in bad latex masks.  The player character is a square-jawed guy with blow-dried hair and not a whit of acting ability.    But none of this matters as you're romping through settings inspired by the Star Wars movies.  This is a large part of why the level design still feels so immediate and resonant.  Also, no other first person shooter has come close to Jedi Knight's dizzying sense of scale and its vast levels.  Unlike dungeon-based engines like Quake and Unreal, Jedi Knight goes on and on in all different directions.  Even better, there is a thrilling rush of vertigo when you look down the side of a building or into a chasm.  Even though you can always reload if you fall, you'll feel a strangely tangible sense of dread when you're working your way across a precarious set of beams or a narrow ledge on a cliff.  I think Jedi Knight put something in my drink, because I don't get this way playing other first person shooters.  Jedi Knight was unique in its time for the ~spells~ you could cast with Force powers, a conceit that built on and streamlined the concept of implants introduced in System Shock.  The Force powers slowly fold new gameplay mechanics into Jedi Knight -- almost too slowly, since some of the more powerful and fun Force powers don't make an appearance until very late.  But the game pulls a real no-no about two thirds through -- it forces you onto the Dark or Light side and takes away any powers you developed from the other side.  This sort of Indian giving is almost like that awful convention where the player gets taken prisoner and has to find his weapons all over again.  The Force powers can drastically alter to nature the game.  Perhaps too drastically.  Persuasion, for instance, almost makes the last few levels too easy by rendering you invisible to enemies.  Later titles like System Shock 2 and Deus Ex, in which your character learns new powers that change the gameplay, owe a lot to Jedi Knight.  But these tend to be action RPGs with extensive inventory management and skill systems, whereas Jedi Knight is very much a combat-oriented first person shooter.  I would say the only game to really duplicate Jedi Knight's concept of streamlined, game-altering Force powers is 3DO's underrated Requiem.  The lightsaber in Jedi Knight should be given its due as one of the most inventive weapons ever to grace a game.  It provides light, blocks most weapons fire, serves as a very effective close quarters weapon, and looks and sounds awesome.  The rest of the weapons use familiar sounds to great effect and are well balanced for multiplayer games.  The Force powers, however, are another matter.  Mysteries of the Sith evens things out a bit and makes Jedi Knight a far better multiplayer game.  Jedi Knight was designed by Justin Chin and programmed by Ray Gresko, both of whom left LucasArts to found new companies.  Chin is with Infinite Machine where's he's working on New Legends, a third person action game set in futuristic China.  Although it's still in its early stages, it looks very much like the spiritual heir to Jedi Knight.  Gresko is with Nihilistic, the folks who gave us Vampire: the Masquerade.   As for LucasArts' follow-up to Jedi Knight, they're working on Obi-Wan, which is based on the Phantom Menace movie and isn't likely to see the shelves for at least another year.  This is okay with me, because I just can't get excited about the prospect of chopping up those robots that looked like hair dryers.  In the meantime, I'm happy fighting these rough Stormtrooper models and mixing and matching Force powers in multiplayer games.    -- Tom Chick Want to share your opinions with the world?Talk about it on the IGNPC message boards,  orsend some mail to IGNPC about this story.  Presentation  A goofy storyline almost as embarrassing as the Phantom Menace movie.   3.0  Graphics  Austere, but effective.    6.0  Sound  Superb sound all around--sound effects, sound bites, and soundtrack.   9.0  Gameplay  Excellent weapon variety and Force powers, but occasionally frustrating level design.   8.0  Lasting Appeal  Multiplayer really excels with the Mysteries of the Sith expansion pack.   8.0  Should I Go Back and Play It?  This is still the best planet-side Star Wars game there is.  YES  OVERALL SCORE    (not an average)   8.0 I can't deny that a lot of the lasting appeal of Jedi Knight has more to do with its licensing and less to do with its technical acumen.  If it has been a generic fantasy or sci-fi game, it wouldn't hold up so well.  Jedi Knight is no Unreal Tournament.  But then again, Unreal Tournament is no Star Wars game.  It's a trade-off, to be sure, but one still worth making.", "date": "Oct 16, 2000"}