{"name": "Pokemon Gold", "name_review": "Pokemon Gold Review", "ref": "https://www.ign.com/articles/2000/10/17/pokemon-gold", "text": "are going to be the top-selling games on the Game Boy Color system, regardless of what this review says. Pokmon is not a fad, it's here to stay, and this new Game Boy Color series is only going to fuel the blaze of popularity further.The reason why you're here reading this review is because A) you already bought the game and want to see another's opinion, B) will buy the game as soon as you're able and want to see another's opinion, or C) you have it in your head that Pokmon is evil and stupid, and want to find out what the big deal's about. Whatever the case, you know what Pokmon is. And now, I'm going to utilize this entire space to tell you that, yes, Pokmon Gold and Silver will sell a bazillion copies in the next few months...but no one's going to be shafted on their purchase. After spending more than two weeks with the game, I have to say that this title is one of the deepest and most well-designed Game Boy Color game created yet  simplistic as it seems on the surface, there's so much strategy and thought required, and there's plenty to do. The best games of any system are generally the ones that keep you occupied for the most time  if you thought Pokmon Red/Blue/Yellow stole away your gaming schedule, wait until you play around with Gold and Silver. My friend, you're going to be busy a long, long time.Features More than 100 new Pokemon unique to the series New items including the Pokegear Real-time RPG using internal clock Game Boy Printer, Link Cable, infrared port, and Pokmon Pikachu 2 support For Game Boy and Game Boy ColorPokmon Gold and Silver utilize the general design blueprint supplied in Red/Blue/Yellow  Boy wanders the land to become the greatest Pokmon trainer in the world, with an archrival out to take your glory every step of the way. Both versions are identical in every way, except for the character images during battles, and the characters that can be caught in the wild  keeping with the ~trading is necessary~ design. The game has the familiar Japanese-style RPG engine, meaning top-down scrolling provides the perspective, and big-headed people inhabit the world.The hook in Pokmon is the fact that you yourself don't do your own fighting  instead, creatures you capture in the wild supply the brute force of your battle skills. The creatures are Pokmon, or Pocket Monsters, and in Pokmon Gold and Silver there are exactly 251different species of these animals hiding in the game, waiting to be caught and trained. Through the use of items called Pokballs, you can trap wild Pokmon and bring them to your side  each species of Pokmon has its own strengths, weaknesses, as well as defensive and offensive attacks, and the more they fight for you, the stronger they get in battles. Some creatures are rarer than others, only showing up in different locations and at different times of the day, and some are more difficult to catch than others. It's up to your skill and logic to figure out how to catch 'em all. Strategy plays a huge part in this game, which means that it's not just tailored for the kiddies.The game is laid out nearly exactly like the original Red/Blue/Yellow versions of Pokmon. The overall quest is separated into ~chapters~ in the form of Gym battles  the only way you can proceed on to the next town and series of puzzles and tasks is to defeat the town's Gym Leader. When defeated, the gym leader will supply you with what you need to access the next portions of the adventure. If you've played the original Pokmon series, you'll be right at home with the Gold and Silver renditions.As awesome as the original Pokmon edition was, Pokmon Gold and Silver blow it away in gameplay elements, features, and goodies. There are so many little additions to the design it's impossible to list them all, but we'll go right for the biggies.The addition of an internal clock is an outstanding feature  at the beginning of the game you'll have to enter in the appropriate time and day of the week, and this is stored in the cartridge from minute one with the game. The cartridge actually houses a working clock that keeps real time whether the system's on or off. When you play at night, it's night in the game. Playing in the morning? It's morning in the Pokmon world. The clock serves many functions, most important is the fact that specific Pokmon only show up at certain times during the day  some creatures are nocturnal and will only attack at night, so to catch 'em all you have to play in the morning, afternoon, and night. Plus, there are events that happen on certain days and times, like a bug hunt contest or a lottery drawing. This element adds so much to the gameplay, especially when you have to play in the morning and night to acquire specific creatures.The cellphone is another excellent addition. Some defeated opponents will call you at certain times of the week to give you hints on where to find the rare and cool Pokmon creatures to capture. The Pokmon Professors will call you to offer their help whenever they can. Your mom (the game's characters mom, I mean) will call you to tell you that she's bought items for you with the money you've sent home. And defeated opponents will call you for a rematch. The cellphone is an integral part of your pack now, and it's used to its fullest.Breeding  the Pokmon can now procreate, which means that every Pokmon (with the exception of Ditto) has a gender, whether it's male or female. Breeding is important and useful, for not only does it give you more Pokmon to train or trade, it's also necessary if you want to find all the Pokmon in the game  a few Pokmon can only be obtained through Pokmon breeding.The graphics have been upgraded in its colors  the quest portions of the game look nearly identical to the previous edition of Pokmon, but on the Game Boy Color the engine is a lot more colorful and vibrant. It doesn't look washed out anymore. In battles, the creatures have more detailed animations and special effects during special moves, but all in all the game engine in Pokmon Gold and Silver is just an upgrade from the Red/Blue/Yellow versions. That's not a bad thing  but don't expect to be floored by the looks of the game.Items can now be attached to the Select Button (like a bicycle for faster movement), special Pokmon HM moves (like Flash, Headbutt, or Cut) can be performed automatically without a menu selection, fun stuff can be transmitted between systems through the infrared port...and there are just so much more little things to discover. Yes, there's a disease that the Pokmon can catch and spread to other Pokmon, and other systems through the link cable. There are different colored Pokmon. There are little gambling minigames. There's even two new Pokmon types in Gold and Silver. The cartridge is just stuffed with all sorts of good items.What's more, a lot of thought went into integrating the original version with Gold and Silver  you can trade creatures you've earned from Red/Blue/Yellow into this game, but not right away. The designers made sure that gamers don't cheat by dropping a powerful, low-level Pokmon from Red/Blue/Yellow into Gold/Silver, so Gold/Silver has a lock on that trading feature until the player reaches a certain point in the game. Naturally, only the original 151 Pokmon can be traded from Gold/Silver to Red/Blue/Yellow  but at least the designers don't dismiss the stuff you've already accomplished in the original package. And just wait  everything you capture and train in this game can and most likely will be implemented in some fashion with other console Pokemon games. Pokemon Stadium 2, anyone?After playing the game dozens of hours, I really can't think of a bad point to make about Pokmon Gold and Silver. Nintendo and Game Freak have tweaked the original and built a sequel that's long, challenging and tremendous fun to play. There's a reason why Pokmon is so popular, and Pokmon Gold and Silver is going to help the series move further into the 21st century.", "date": "Oct 17, 2000"}