{"name": "Silent Scope", "name_review": "Silent Scope (Import)", "ref": "https://www.ign.com/articles/2000/10/20/silent-scope-import", "text": "Guns don't kill people. People don't kill people, either. Everyone knows the real truth nowadays -- games are what make people kill people. Remember the dozens of countless Goombas you stomped in Super Mario back in first grade? Ever think about what happened to all those goons you whipped to death in Double Dragon? That desensitization is what's turning old NES game players into bloodthirsty killing machines, and sick, sick games like Silent Scope are merely paving the way for a new generation of soulless killing machines.  Or that's what some people think, anyway. Konami set the arcade scene on end with the release of Silent Scope, a light-gun game with a major twist. Instead of blasting imaginary caps into the screen with a plastic handgun, Silent Scope gave you a big honkin' sniper rifle bolted to the arcade cabinet, complete with a color LCD scope to peer into. (Office ladies seemed to gravitate towards the game, giving them plenty of opportunity to practice their sniping skills for the day when Boss Yoritomo's ~playful~ sexual harassment goes one step too far.)  As far as the home port was concerned, we game goobers were kinda curious as to whether or not Konami would release some uber-gun peripheral for the home market. Oddly enough, Silent Scope has shipped without any type of lightgun or peripheral support, eliciting a response of ~what the hell?~ from the general audience. Can the final game stand up sans sniper rifle, or had we might as well leave the whole spiel in the arcade?  First things first: as the box reads, ~You are a Professional Sniper!~, and your mission is to quash a terrorist kidnapping of the President, the First Lady, and the President's daughter (~Find her, and bring her to meeee~). The game kicks off in the midst of a rooftop battle, where cops are duking it out with terrorist baddies from afar. Your goal is simply to zoom in and snipe the bad guys before they even notice you're there, because dammit, that's what snipers do.  The process of targeting and shooting is handled with the D-pad, and bizarrely enough, it seems to work rather well. There are a few different control schemes available, but I managed to get the best results using the default setup. Your sniper scope is on by default, and is overlaid on top of the game's background, displaying a super-zoomed-in image. Both D-pads control the movement of the cursor (try using the digital pad for the most precise adjustments), and squeezing the left trigger button removes the scope from the screen, allowing you to quickly shift your targeting reticule to a new area.  Eliminating the terrorist threat quickly and efficiently is a must, since the game handicaps you via both limited health, and a time limit. Time bonuses are rewarded after kills, and the game gives you significant extra points for head shots. Tsk tsk  I doubt my mother would approve.  There's also a nice variety as far as gameplay is concerned, and the game changes pace for each level. You're also given minor control over the storyline, as the ~Choose your Next Move!~ screen allows you to branch out into two or three different gameplay paths.  The night-vision stage is especially dramatic, and looks like something right out of Metal Gear Solid 2 -- you can see your enemies holding flashlights in the distance, and you'll watch in terror as their laser sites slowly center on your forehead. There's also a lengthy sequence where you have to scan dozens of hotel windows for gun-wielding baddies, and this manages to really jack up the tension.  What's that? You want cool bosses? You got 'em! In the style of every decent evil terrorist group, the leaders have been given odd code names like ~Scorpion the Butcher,~ ~Cobra the Ironman,~ and ~Tom and Jerry, The Killer Machine.~ Some of the resulting fights are ridiculously enjoyable, such as the battle against Scorpion: he runs down a football field with the First Lady slung over his back, as the entire crew of the Green Bay Packers gives chase and gets in your line of fire. The coolest part of the boss fights is that one headshot kills. Cap your opponent in the noggin, and dammit, it's over! This is a refreshing feature, since videogame bosses have traditionally had steel-plated foreheads that negate cranial fire.  True to the voyeuristic aspects of the sniper lifestyle, Silent Scope includes some sexy bonuses: girls in bikinis and mini-skirts are hidden in each level, and moving your targeting cursor over them results in a sultry music clip, a voice sample of your sniper saying ~Wow!~, and an extra life.  (No, don't shoot them, doofus.) Anyone who's offended by such peeping-tom behavior is more than welcome to turn down the amount of sexual content in the options screen, which puts more clothes on the girls. Then again, if you're playing a game where the main goal is to shoot people in the head, you're probably not going to be much of a prude.  The arcade version never ran on particularly beefy hardware, and the Dreamcast's visuals are only slightly improved over the original version. The quality of the visuals varies greatly through the course of the game, and Silent Scope probably could have been done on the original Playstation without much difficulty. The overall package isn't up to Metal Gear level, and the character modeling and texturing are pretty bad in some instances (the bosses look a bit lame-o). Whatever you do, be sure to turn up the contrast on your monitor -- this makes the night-infiltration stages infinitely easier, and you'll be able to pick off baddies in the dark before any detection.  And as much fun as the arcade mode is, it's over a wee bit too quickly... like, ten to twenty minutes. I beat the game on my third try, and after two more plays, I managed to take all the different routes through the game. Damn. Foreseeing such longevity issues, Konami had the decency to slap on a new training mode (in addition to the shooting range in Arcade Mode), and a ranking mode that gives you letter grades. The only other bitch I have regarding the game is that the sub-boss is cheap as hell, and if you miss one shot on the final boss, you die and the game is over. I hate that.  Is Silent Scope worth an import, just to your mitts on the game ahead of time? Nah. You'll probably just wanna rent this one upon its domestic release. After all, while Silent Scope provides a few days' worth of soundless sniping, your fifty simoleans would be better spent on the actual arcade version, followed by a few rounds of target shooting at Big Al's World 'O Guns. God bless America. -- Colin ~Thomas Beckett~ Williamson, IGN", "date": "Oct 20, 2000"}