{"name": "Cool Boarders 2001", "name_review": "Cool Boarders 2001", "ref": "https://www.ign.com/articles/2000/10/21/cool-boarders-2001", "text": "Everybody wants their waaaaaay extreme sports titles (dude) to turn out  like Tony Hawk's Pro Skater. And why not? This smash hit sold millions,  made believers out of the critics, and put an entire genre back on the map.   Regardless, it's still freaky to see Cool Boarders, the PlayStation's number  one name in snowboarding, cold chillin' on the rip-off tip.  While there's  nothing fundamentally wrong with beefing up a game to bring it more in line  with what's trendy, something about these products just irks the average  consumer's sensibilities.  Perhaps it's like Highlander's script said: ~There  can be only one.~   Gameplay Well, looky heeeyah, it's a Grade A cowpie. This sucker starts out weak and  never picks up steam. A scant two-player section round out the main menu, offering up a quick race with pre-packaged characters or a customizable career mode alternative. Those who look to insta-races for thrills will actually be the most rewarded for their time. Because opting for a quick hit enables you to skip the challenge based BS and select from pre-packaged names such as  Jeremy Jones, Tara Dakides, and Todd Richards, it's by far the most  attractive proposition out of the pair.   The fault for this paradox lies on the shoulders of a beastly physics  model.   Although the gameplay's strictly arcade-ish, the title overdoes the  zaniness to an unhealthy extreme.  Because of this, it's easy to get  flipped around and stuck behind a pole or embankment.  You'd also have to be  psychic to predict the results of crashes, which randomly send riders  spinning or leave them all but unscathed.  Turning is like pulling teeth as  well, no more so than when a rider's crouched for jumps.  Working up the  speed necessary for wicked hangtime doesn't feel like a natural, let alone  fluid, process.  And on the gripes go.   By themselves, the handling flaws stand out.  When it's mandatory to pass  through a certain number of gates in a Downhill competition, make it through  a gauntlet of checkpoints within a short period of time, or play a modern  interpretation of Simon Says in Trickmaster contests, they're practically  outlined in green and purple neon.  Precious hours must be invested if one's  determined to come to grips with these problems in such a way that they'll  stand a fighting chance against the AI opponents.  But look on the bright  side.  Move up in the standings and you can unlock more boards, tracks and  riders so the torture can begin anew. Gag.   Honestly, though, the worst part is the way Cool Boarders 2001 tries to cop  a little something from both Tony Hawk's Pro Skater and Road Rash. If anyone determines what real value has been added to the title by  the addition of left and right punch buttons, they deserve to be a  contestant on Jeopardy.  Or, how about them rail slides?  Hasn't the public seen this gimmick somewhere before?  Funny thing is, those tricks used to be  cool. Now they're just a cheap way to make the player PO'd when he or she  misses them on approach, thereby missing out on the only chance to make it  through a gate.   But wait, the hits roll on!  Get the urge to splurge and you'll find some  toooootally gnarly (note slight sarcasm) tricks to fall back on.  Frontflip,  indy, shifty, stalefish, 360 spin, melancholy.. it's like Frosty the  Snowman's wet dream up in here. Alone or chained into combos, special  techniques net the player points when performed correctly.  That's so  freakin' revolutionary, it'll turn the industry on its rear.   Graphics Holy underage hottie, Batman, this title's more frigid than Britney Spears.  Seriously, the icy visuals aren't escapees from a Chernobyl quarantine camp, but they're nothing worth writing home about either.  Rocky,  mountainous landscapes covered in white powder dominate the landscape. To a  fault, however, both they and the snowboarder models fall squarely in the  middle of the quality spectrum.  And while one can't cut up a game overly  much for its homely looks, pot shots become mandatory in light of a  shamefully gimpy frame rate.   Furthermore, the choppy animation kills what little respect you might have  for the presentation.  Try purposefully botching a trick if you want to see  a ghetto-fied version of a potentially career ending injury.  Even if the  character editor -- which can be used to modify a racer's height, looks, and  attire -- is fairly powerful, the cosmetic changes mean jack if character  representations wind up acting like automatons instead of the smoke and  booze addled youths they're meant to portray.   Sound  In a bizzare twist of fate, the soundtrack outclasses the title it's  wrapped around.  Skillfully produced house jams rock the airwaves and churn  out manic beats like a hyperactive DJ.  Nothing stands out as being up to  major label standards, but this stuff would fatten up just about any mix tape.   If a spaztic bassline and phrase repetition don't qualify as music in your  book, switch off the background noise and let the sounds of crunching snow  or blowing wind carry you off.  Or rather, do so until the pained grunts of  mauled competitors, who sound like old men passing kidney stones, ruin the  party with their racket, that is.~Vell, ladies unt gentlemen, zis appears to be a textbook case of vat ve call schitzophrenia in ze medical profession. Ze patient appears to exhibit signs of acute Tony Hawkenshlitis mixed vith bouts of post Road Rash anxiety.  Und vichever vay ve perform ze analsys, ze results reveal that ze situation clinically zuckz.  But by far ze worst part of ze diagnosis is that Cool Boarders 2001 hast no discnerable identity of itsh own.  Vich gives it roughly a snowball's chance unt hell of surviving zist holiday season. Zus ze subject must accordingly be pronounched dead ont arrival.~", "date": "Oct 21, 2000"}