{"name": "Micro Maniacs Racing", "name_review": "FoxKids.com Micro Maniacs Racing", "ref": "https://www.ign.com/articles/2000/10/21/foxkidscom-micro-maniacs-racing", "text": "It begins with possibly the most deranged opening in videogame history -- tormented misfit children undergo physical and genetic manipulation in the course of a crackpot scientist's dubious experimentation that somehow might lead to Earth's salvation from a questionable doomed fate. Well Bobby, the quickest way out of the orphanage these days is through bio-mechanical implant operations. Poor Suzi has stifling adolescent trauma? Maybe if we shrink her down to 1 / 360th her normal size, her problems will be much smaller. Better zip the baby gimp's mouth up -- we wouldn't want any second thoughts to leak out.Maniacal indeed, the Micro Maniacs race upwards to the vanguard where the pressure is too high for the chance of salvation and deliverance. Sickest of sick is that somehow all of this depravity is still spun in a positive manner -- these damaged youths want to go through with this mad science, believing it's for their own good.And perhaps it is. This grim nightmare fantasy is the stuff boy's and girl's fairy tales used to be made of, long before Pokmon and ABC's TGIF sanitized (and yet somehow redefined) levels of fear for children. In so many ways, Micro Maniacs is a such a throwback to bygone days, it's less a new game to be played than a relic to be treasured. It's top-down 2D-like visual style might seem as outlandish as grease paint to a PhotoShop artist. It's gameplay is -- gasp -- gameplay, and nothing but gameplay? No adventure mode, no RPG manna pick up, no vehicle upgrades to mod your rod. With well over a baker's dozen's buttons on the PlayStation DualShock, Codemasters has chosen to ignore half of them, and when you play multiplayer, they cut that down to less than a third of the buttons used, since players can share a single controller for up to eight gamers all playing in a single screen. ~Wait, what's this multplayer? But the PlayStation doesn't have a LAN... Egah!~Fragile newbies will be frizzle fried by the archaic gaming that Codemaster's Micro Machines series has stuck to. Even I caught some whiplash getting into this outdated bundle of code, and this is the stuff I grew up on. Micro Maniacs is a departure in a sense from the car racing miniature games that built the company, but the difference is about as slight as night and midnight. It's still a party game, rock solid in execution and yet dated in its approach. It's still a plain-jane looker so obsessed with the details and fine embroidering that it ignores the fact that the dress is a gingham frock. And it's still a hoot and a half, so long as you still feel like giving a hoot.GameplayFlighty feet are all you need to win this maniac race, although for the more heavy-footed oafs, your rocket-powered skull missile cannon grafted into your arms may help even the odds. That's the variation Codemasters has chosen for this Micro Machines side project. Rather than the old dorky kids with their toy cars, this game has its racers sans wheels, burning instead rubber off the soles of their shoes. Each freakish sprinter is also genetically endowed with violent physical forces that can be used to plow opponents off the course.Outside of that, this is the same classic Micro Machines game we first saw over a decade ago. Runners may be foot-loose, but they still steer like cars, skidding through turns and oversteering and correcting off the bank into a straight-away. This is still a Micro game, pegged onto its mini characters. According to the backstory, the kook scientist Dr. Minimizer is investigating the possibilities of shrinking humans to combat overpopulation. How that eventually leads to ghastly freak-babies enlisting for deadly races to become monstrous super soldiers is beyond anybody's guess, but the bottom line is that it's back on the breakfast table, up around in the living room stereo cabinets, through mouse holes and out vent shafts, over treacherously active shop equipment, out dodging through the vegetables in the garden, down the storm drain and up the bathroom's toilet tank, and back on the kitchen floor to slalom some cereal the normal-sized baby spilled on the linoleum. How can that not be fun? A sheer impossibility, and even all these years later, the Micro gameplay is still great fun in Micro Maniacs. Quaint fun, but fun nonetheless. And there's still some amazing stuff in this game that, despite the old style of gameplay, still astounds. The physics engine for the racing (which is mostly footraces, but also includes events where you're riding giant bugs and cruising on midget toy boats) is still second to none in many respects. The way the boats fishtail out and then dig back in for turns puts to shame water physics in a good 90% of the water-bound racers out there, and the skateboarding minigame is the single most fun skating game outside of Tony Hawk (sorry THQ, but it's true). Maybe this isn't so much a testament to Codemasters as it is a wake-up call to the rest of the industry that their advanced patented 3D Pr-Physics are about as real as Burger Time. Actually, the physics are so good in Micro Maniacs that it still is a testament to Codemasters. OK, let's agree that it's both.That's about the only agreement that will come to be over this game, because once the race is started, it's malicious, unruly, harrowing, crazy gameplay with every tap of the controller. Micro Maniacs is just as much a party game as ever -- perhaps more, since the addition of weaponry for each character leads even more to vengeful gaming obsession. Now when you're about to get screened-off for a loss, you can launch one of the character's harmful attack powers to gain lost ground. Each racer has different attacks themed to his or her character -- Twister spins a tornado around himself, Vortex drops her Black Holes in the track to hurl players off somewhere into the void, and Beatbox... well, it's not that interesting an attack, but the guy's got a heavy groove. Extra battle elements have been added as well -- in challenge modes, you can outrace your foe, or you can out-muscle them by hammering them six feet under their own tracks with a mini-sledge hammer. In all, the attacks are less innovative than expected -- most boil down to a missile or defensive attack -- but they do make races that much more thrilling when eight players are on-screen at one time launching a world of hurt at each other.GraphicsIt's the eye candy that starts letting the steam out of the Micro Maniacs' pressure-cooked heads. Visually, Codemasters has gone exactly nowhere from Micro Machines V3. It's still a charming-looking top-down racer, and only so much can be done within the confines of the style. Everything's smooth and cute in a kiddie fantasy ants-eye-view of the world. Cheerios become obstacles. Toy triangle blocks become ramps. Outdoor fountains become host of speedboat duels, with bloated dead bugs standing in as buoys.Still, the sense of perspective is better for the imagination than utility, as it's tough to get your bearings on the top-down tracks. The camera catches up well, but it's difficult to judge heights in the 2D world view. And though this has always been built in as part of the challenge and joy of Micro Machines, the way that you beat opponents by racing them off the screen is impossible to get used to, particularly now that the battle modes of the game stress this type of game much more than before. When two racers are at the edge of the screen, the camera just stays its course instead of pulling back some, so the leading racer has no idea of what's ahead of them on the track. Worse, it's artificial and off-putting. Back in the day, it made sense why pushing an opponent off the screen made them lose -- because that was fun. Now, however, when the camera has the power to just reframe the scene and give players a chance and yet chooses not to, it feels like a gaming concept cheat. Why couldn't it be that when a racer gets more than 100 yards away from a competitor (or, in this mini-case, 100cm -- maybe they break a thread tying the two together or something), they scored a win. Instead, Codemasters has fallen back on fakie old-school ways, and that just leads to players trying to cheat their way to victory by jumping and dodging to the corners to anticipate the camera just to beat their opponent. It just feels wrong, and with a confusing camera as it is, it's sometimes not much fun even when you're the winner.Maniacal as it is, you'd think that Micro Maniacs might have some more pizzazz, some outlandish whimsy underneath its substance. Surprisingly though, the game is somewhat plain. The character design is outrageously grotesque (particularly the troubled orphan girl who lives with an exposed brain pan), but the actual character models are simple and inanimate. Even the attack spells, which have the power to light up the screen and wreak catastrophic havoc in the hair-raising races, are dully drawn and unimpressive. Launch a skull at an opponent, and all you get is a flying skull. The one concession to this is an overabundance of horrific and gristly events. Running around amongst the active tools and instruments in the metal shop, kids run headlong into saw blades and rotating drills. It's positively disturbing to see these twisted freak children have their skulls sheared off and their brains smacked after falling off a cliff, all with green alien blood splatters on impact.SoundIn the midst of the overloaded excitement in an eight-player game, the audio might as well not even be there with all of the screaming and shouting going on over the game. That's the thinking behind the minimalist soundscape in Micro Maniacs. Again taking the least intrusive approach to audio, the soundtrack hardly makes an effort. Sometimes, that's actually for the better -- how many times in an action game must you hear the protagonist shout ~yippie!~ every time he jumps -- but it's still slight for this game. Character voices are limited to low res shrieks and chirps, and they all get annoying in their time. Weapons have a 'ping' and little else to sell their impact. Only Boombox comes across as a character with signature audio personality, and that's still a maybe considering that he's designed around that concept.However, the game's music tracks are stand-outs. With rickety techno themes that always have hints of gothic horror and rinky-dink organ tracks, it's a minor grace for the sound that works so well because it's always meant to be in Minor.Though it's a new game, all this still boils down to whether you're a glutton for more Micro maniacal party gameplay. Lonely single man races just aren't dazzling, immersive joy rides, and even though the challenge level is sky-high for those who want to go deep, and the gameplay is backed by a killer physics engine that's never afraid to mix it up on you, few will ever be happy playing without a friend.Those that play multiplayer games like these are far beyond being a dying breed. They've already been buried alive. And the crutch on Micro Maniacs is that for all of its insanity and grotesque morbidity, it may be tough convincing seven bro's to play a game that only looks okay. Advancements in the gameplay still slip back on the choke chain of the visuals and limiting view.All of that said, there is still no better reason to own a multitap than Codemaster's Micro series, and with weapons, more elaborate and twisted stages, and loopy gameplay around every corner, Micro Maniacs is the best pure jolt of party gaming yet. You don't have to love these perverted human freak-show spaz kids -- with a face like theirs, it would be very tough to -- but humor the geeks for your own sake. They just came out to play.", "date": "Oct 21, 2000"}