{"name": "V-Rally", "name_review": "Test Drive V-Rally", "ref": "https://www.ign.com/articles/2000/10/23/test-drive-v-rally", "text": "Did you buy Test Drive 6? Did you hate it? Good. Me too. Luckily, Test Drive V-Rally has virtually nothing to do with the recent crop of Test Drive titles Infogrames has unleashed on both Dreamcast and PlayStation. Test Drive V-Rally is basically a beefed up version of Eden Studios' V-Rally 2 Presented by Need for Speed with a few elements borrowed from Colin McRae Rally. But while the two share the same tracks and car lineup, comparing the Dreamcast V-Rally to the PSX version is like putting a McLaren F1 next to a VW Beetle. Hey, nothing against Beetles, but the F1 is just so much smoother, faster -- and more exciting.   Like its predecessors, V-Rally is a mixture between a rally simulation and an arcade racer. You get all the goods you'd expect from a good rally sim, including point-to-point races against the clock, car customization, real-time damage and repairs, and a slew of real-life rally cars by Nissan, Mitsubishi, Toyota, Subaru, Renault, Seat, Skoda, Hyundai, Ford, Fiat, Peugeot, Citroen, Vauxhall, Lancia and Audi. But don't worry if you've tried your hand at Sega Rally 2 and you couldn't really get into it -- V-Rally is a much more accessible game. One of V-Rally's biggest attractions is its better sense of speed. Heightened by a super-smooth framerate and often insanely narrow tracks, rushing down unpaved backroads in a 300 HP WRC car should put a smile on any Dreamcast owner's face.   But speed is only half the fun. Unlike Sega Rally's rather tame tracks, V-Rally's almost limitless course selection (more than 80 tracks in 12 countries) is pretty wild. Despite some strange ~rubber physics,~ the cars often skid and bump around the track so realistically, switching to one of the three first-person modes will almost make your seasick. Apart from the traditional bumper-cam, V-Rally also features an excellent hood-view mode and a cockpit camera angle complete with steering wheel, window reflections and gear shift animation. Although many games have tried to simulate what it's like to view the action from inside a car, V-Rally finally gets it right. The only other game we've seen that simulates driver view as well is Sega's upcoming 18-Wheeler. The trick is that the camera perfectly fakes the driver's head and eye movement when going into curves. Turn right, and the camera angle will shift accordingly to let you see exactly what lies ahead. You may not always want to play with a restricted viewing field, but it's a great addition nonetheless.   V-Rally's also doesn't disappoint in the features department. In addition to its large number of licensed cars (eight WRCs, three 1.6 liter kit-cars, five 2 liter kit-cars and 10 bonus cars), up to four players can compete in four different game modes. The breakdown is as follows:   Time Trial: Select the track of your choice (if you have unlocked it) and race with up to four players simultaneously. You won't see the other players on the track as it's all about getting the fastest time, but you can load a previously saved ghost car if you're playing alone or with two players. Arcade Mode: Compete against up to three AI drivers and beat a pre-set time for each stage. Unlike in real rally racing, the four cars start simultaneously.  V-Rally Trophy: Try to win three different trophies as you race against up to three competitors, just like in Arcade Mode. However, there are no checkpoints here. The Trophy Mode features both point-to-point races and circuits. Best of all, up to four players can compete for the cup. Rally Championships: This is the heart of the game -- and the one mode that will most appeal to sim fanatics. You go up against seven competitors, but you start one after the other like in a real-life rally. Setting up your car and fitting it with the appropriate tires, gear ratios, suspension, brakes and steering is essential. Unlike in the other modes, car damage now also affects your vehicle's handling and acceleration. You can repair your car after each stage, but you're only allowed repairs that take up to 30 minutes (of simulated pit time). You can even play this mode with four players, but you will of course have to take turns driving as the starting is sequential.   Add to that six different weather conditions, 12 countries and a decent track editor and you've got one of the best rally racing packages on any system.  Visually, Test Drive V-Rally literally leaves the competition in the dust. It's tough to go back to Sega Rally 2's decidedly bland look after witnessing V-Rally's vibrant colors, smooth 60fps framerate and exciting track layouts. You will drive through jungle landscapes, small villages, the rainy British countryside, snow covered forests and more. The car models are detailed down to the optional lights for night races, and depending on the road surface, accumulate dirt, dust and snow. Infogrames even managed to convince the game's licensors to allow for body and equipment damage. You can completely mess up your car's hood, dent the sides, shatter your brake lights and even crack the windows. Aside from some distant pop-up on some tracks and a less than convincing car shadow, the visuals are top-notch. Be sure to plop the game into first-person mode when some of your PS2 friends are over...   Sadly, some ~classic~ V-Rally annoyances resurface yet again, such as invisible walls around the tracks and some wonky car behavior. While the physics engine manages to create a realistic rally racing experience, the cars still feel too light -- a fact that becomes very apparent when you steer off course or take a jump too fast. Instead of causing a spin or slamming into an obstacle, V-Rally cars tend to roll or flip a tad too readily. To make things worse, the crashes are way too quiet, making it seem like your car's roof is made from rubber. Finally, V-Rally's biggest problem, clipping, once again rears its ugly head. On the upside, Eden Studios made some major improvements to the overall sound design. Even if the SIN soundtrack isn't your cup of tea, there is now denying that V-Rally sounds awesome. Eden should be commended for realizing that there is more to racing sound than just your car's engine. Crank up your speakers and listen to the flawless gear shift clunking and how the different types of terrain affect the road noise. If it wasn't for those silent rolls, V-Rally's sound would have scored even higher.  In the end, V-Rally is the best thing that could happen to the tarnished Test Drive series. Along with the upcoming Test Drive Le-Mans, V-Rally will no doubt help restore the famous franchise name back to its former glory. While Test Drive V-Rally is still not quite as good as Colin McRae Rally, it's pretty darn close. Whether you're a rally fan, or not, this game is a must-have racer for any Dreamcast owner.", "date": "Oct 23, 2000"}