{"name": "Unreal Tournament", "name_review": "Unreal Tournament", "ref": "https://www.ign.com/articles/2000/10/23/unreal-tournament-2", "text": "~Got gats?~  That's from an album released close to eight years ago, so don't give me any lip about dead fads.  And while we're at it, spare me from the evidently all-too-common belief that first-person shooters are the province of PC fans.  To quash that one, I direct you to the console game software sales figures for 1997 and 1998.  I don't think I need to remind you what sat at the top of both of those.  We all like to shoot things.  We've been shooting things since Space Invaders (or was it Asteroids?), and you could tell most of the story of advancement in game technology just by running down all the new developments in the art of virtually shooting things.  But as of late, console gamers have rather gotten the shaft in this area, as the very best shooters have become the exclusive province of stupid-powerful personal computers.  PlayStation gamers were getting Quake II at about the same time as Quake III hit the PC, and Perfect Dark, acclaimed by many as the best console FPS around, was a sub-20fps crawler with textures so blurry it seemed as if Joanna was perpetually under the influence.  So until just recently, it's been the PC or nothing at all if we've really wanted to shoot things, which is why we so welcomed the arrival on consoles of games like Quake III and Unreal Tournament, the absolute pinnacle to date in pure shooting games.  Unreal in particular, since it was one of the earliest PC migrants to PlayStation 2.  But of course, at the same time, we wondered how much of what we liked about the original games would make the transition home - since we'd played so much of these games on the PC, could we really enjoy a console version?  I'll digress for a moment to make something clear - yes, I've played a lot of UT on the PC, and in point of fact, I can probably wipe the floor with anyone in IGN editorial (yeah, that's right, Boulding, I'm always ready to go).  And since it's in the nature of FPS fans to violently slag any games they might not like, I've said some unkind things about Unreal Tournament in the past.  I'll admit, furthermore, that if I had my druthers I'd still play Quake III, if only because I haven't got enough friends around here to organize a decent team game.  That out of the way, my honest opinion: PC UT is a great single-player and team game, with an amazing suite of stock levels to fight in, the best team gameplay modes around (Assault and Domination are still a kick), smart bot AI, and a flat-out gorgeous graphics engine.  It's a hell of a game.  The question to be answered as far as the PlayStation 2 port, then, is whether it keeps enough of what made the PC game good - and, if not, whether it adds features and content that let the PS2 version shine on its own.   Graphics  Hopefully, this won't wind up sounding like a litany of ~this is gone, that's gone, that's not so good either.~  The fact of the matter, though, is that PS2 UT doesn't look as good or move as fast as the PC version.    Now that we've got the hard truth out of the way, does it still look good and move fast?  Well, that's always a matter of perspective.  Unreal runs at 30fps in high-res mode on PlayStation 2, which, if we're going to compare it to a PC equivalent (a pretty inaccurate comparison, but fun anyway), puts it somewhere between the Voodoo2 and Voodoo3 generations of hardware 3D acceleration.  A Voodoo3 or TNT2 stomps all over it - both of those could push 60fps without much trouble at 640 x 480 resolution, if memory serves.  There, that's done it, I sense that all the PC snobs have just closed their browser windows in disgust.  Now we can get down to business.  In truth, for something that was ported so remarkably quickly, and to such a radically different piece of hardware, Unreal doesn't look half bad on PS2.  The game has lost a fair bit in terms of texture detail, and the cast of most levels seems a little darker and blurrier, but since UT didn't rely on textures for nearly as much of its visual quality as something like Q3 does (God knows what that game's going to look like once EA finally crowbars it out the door), the levels still look good enough.  I highly recommend playing it with an S-video connection (or component if you've got it) - the visual quality improves IMMENSELY, and that translates into more precise aiming.  Some of the graphical effects have suffered a little in transition, though.  The shield belt effect, for example, doesn't look as good as it did on the PC - I suspect the animating textures took up too much memory.  Bits of lighting and explosions here and there aren't what I wish they could be, and the same goes for some of the water effects.  The character animation, on the other hand, has been re-worked, and may even be better than the PC version's (it's hard to tell, since I'm always blowing the other guys apart before I can get a good look at them).  And since I know you little vampires love that sort of thing, I can say for sure that the great blood effects and gib animation are intact.  Sound  The cool pulsing techno of the PC version is in full effect, as are the meaty sound samples.  Unreal might not have Q3's variety of cute character voices, but I still love the chunk-chunk-chunk of the flak cannon, the shock rifle's ~zhwocko!~ (yes, that's what it sounds like), and best of all, the loud ~SPLAT!~ when you squish someone with the impact hammer, followed by the splip-splip-splip of bouncing giblets.  If nothing else as come to the PlayStation 2 with perfect fidelity, at least the soundtrack is stilll together, including the character voices - finally, a game that didn't need to be dubbed.  Gameplay  Epic, I think, should have spent a little less time harping on the presence of USB mouse and keyboard support in their game, because they really didn't need to push that feature all that hard.  Once you learn how to play it with a pad, Unreal works remarkably well with a console control interface, and it's a good thing, too, since forcing console gamers to play with a mouse and keyboard is one of the most bogus game design ideas I've ever encountered (*ahem* DCQ3 *cough* *cough*).  As in Timesplitters and Gun Griffon Blaze, the Dual Shock analog sticks prove to be a great combination for first-person control - you can shuffle movement and aiming between various movements on either until you come up with a configuration you like, and Epic was kind enough to provide several different default settings to choose from.  My personal pick was B, which is identical to the Timesplitters controls (move/strafe left, mouselook right), but I've also met players who preferred E above all, so spend some time getting the hang of each one and see what works best.  One other setting change you'll probably need to make is adjusting the horizontal sensitivity on whichever stick handles mouselook.  The default sensitivity results in a ridiculously slow turning radius - if somebody comes up behind you, you'll take five or six Enforcer rounds through the head while you're trying to get him in your sights, and if he's packing the flak cannon, don't let the door whack you on the way out.  But a little tweaking in the options menu fixes that, and if you're really good, you'll learn how to use the automatic 180 motion, which is mapped to one of the analog stick buttons.  Then it's off to war, up UT's deathmatch ladders into every level the PC version had, plus some new and unfamiliar maps.  There's a ton of replay value in the single-player game thanks to all the maps (about 50 altogether) and game modes (solo DM, and team Assault, Domination, and CTF).  The game worlds might not look quite so good as their PC counterparts, but their great design comes through, especially in the team gameplay modes.  Assault is a riot, like it always has been, and any of the team modes can include enough bots to make a game of it regardless of how many humans you have to play with - four-player support is in, but two-on-two is still pretty lean for a good CTF game.    How smart the bots are is a difficult question, since AI is always a very subjective judgment, and the degrees of difficulty have been streamlined as part of the game's general interface overhaul (it now has a simple, sports/fighting-style menu system to pick character models, set up levels, and so forth).  However, if you kick the difficulty level up high, you'll definitely notice the difference - the bots are faster, harder to hit, and they have much better aim.  They can hang in a team game, too, doing a pretty good job of supporting the offensive, although as usual, you'll probably be the one on point.  UT's weapon balancing, though, is something that I'll always have issues with.  This isn't necessarily the place to air the question out fully, but I will note that the auto-aim feature added to the pad controls exacerbates some of the problems with especially powerful weapons.  The flak cannon is now an even more efficient hallway-clearer (as if you needed to aim the thing any less), and the same goes for the pulse gun's alternate fire (the lightning-gun mode).  Death will never come as cheaply in this game as it does in Timesplitters, but maps like Turbine and some of the more corridor-oriented CTF levels are eventually going to see experienced players charging headlong for the flak cannon and nothing else, and that kind of excessive reliance on a single weapon isn't fun. There will always be that nagging voice in the back of my head talking about how lovely UT looks on our GeForce 2-powered PC demo system.  Or at least there will be until I throttle the loud-mouthed little sucker.  'Scuse me for a moment.~AAAAAAAAGH!~ *cough* *rattle*There, that's done with.  I'll deal with the comparisons to Timesplitters later, since that deserves an entire feature piece, but for now, viewing PS2 Unreal on its own, this is a pretty good game.  It certainly looks and runs a sight better than any first-person shooter from the previous console generation, and console gamers new to Unreal likely won't be disappointed by how it looks or plays.  If Epic moves their next major project to PS2, though, I think that's when we'll see what they can really do with the system.  This game has obviously felt the bite of the PS2's more difficult system architecture and memory management - given more time, I firmly believe we could have seen a much faster, better-looking game.The saddest words of tongue and pen, yadda yadda yadda.  I'm reviewing what we've got, not what we could have gotten, and what we've got is worth the money if you've got a PS2 and that nasty itch in your trigger finger.  This is for console gamers only, though - if you have a PC geared up to play UT, you probably stopped reading this review a long time ago.  But if you didn't, hey, drop me a line, and maybe you'll be able to tell your friends you slaughtered the Reverend...", "date": "Oct 23, 2000"}