{"name": "Spawn: In the Demon's Hand", "name_review": "Spawn: In the Demon's Hand", "ref": "https://www.ign.com/articles/2000/10/24/spawn-in-the-demons-hand", "text": "Todd McFarlane has been known to have the touch of gold in nearly everything; from comic books, action figures, and movies, it was only a matter of time before he took the Spawn franchise into the video game world.  Unfortunately, the first Spawn video game on the PlayStation title was so awful, video gaming dads would use it to scare their kids (~Break daddy's controller, and I'll make you play THIS~).  Yours truly could go into the gory details why the PS version of Spawn made little kids cry, but why open that old can o' maggots when we should concentrate on the newest incarnation on the Dreamcast, Spawn: In the Demon's Hand?  And with those Capcom wizards at the developing helm, there's no way Spawn:ITDH could go wrong ... or so we thought.  Even with rock solid visuals, remarkable level design, and the awesome character depictions from the Spawn universe, Spawn:ITDH falls short of being a Dreamcast must buy due to terrible camera control problems, shaky enemy AI, and limited replay value.   Having played it first in the arcade, the SEGA powered NAOMI hardware instantly gave the game graphics to die for.  Filled to the rim with awesome textures, kinetic lighting effects, and fluid character animation, the Dreamcast translation looks equally as superb.  I'm most impressed with the level design, where rock-like textures of caverns combined with the clever layouts of each level (especially the Glacier and Unknown levels) makes it easy for players to get lost in the chaotic beauty of each map.  And the visual splendor doesn't end there; each character from the universe of Spawn is displayed with intricate detail, whether it's the dancing flames igniting from Brimstone's body to the those ~ lovely curves~ of Tiffany and Grace.  Mix in a high frame rate and all you have to worry about is how this lovely game plays.   Unfortunately that's where things aren't as pretty.  The premise is simple: select from a number of characters from the Spawn universe and blast each other, kingdom-come style.  Obviously, each character has their own proficiency in speed, strength, and armament, the latter truly a big factor in many levels.  Tiffany, for example, excels in close-quarter meat mincing, while Cogliostro is more adept at delivering fireballs and lightning bolts from afar.  And yes, there are items to pick up, most importantly the power orbs that boost you speed, strength, and health.  In essence, Spawn:ITDH is an over the shoulder bloodfest... that's fine and dandy (if you're not Senator Lieberman, that is).  The problem arrives with this over the shoulder view - camera problems become immediately apparent when turning corners, especially in small rooms.  With opponents coming from every direction, it's very hard to keep track of where enemies and their attacks are coming from, let along trying to target your foes.  The lock-on feature is a real pain in the arse in the game; basically, face an opponent and your attacks are directed at them (similar to Power Stone.  This mechanic causes problems, especially when there are nearby objects that come in your way while attacking.  While you have a camera button that lines you back to the middle of the screen, the fact that you'll be pressing this button often makes it very disorienting... I can't even imagine how confused casual gamers will be.  Then there's the enemy AI.  Granted, Spawn:ITDH is more fun with multiple players, but on those rainy nights where it's just you versus the CPU, you'll find one word to describe the AI in the game - dumb.  Whether your playing Battle Royal Mode, Death Match, or Boss Mode, computer-controlled opponents do the dumbest things.  Case in point, while playing in Boss Mode, I was busy clearing off some cronies in one room, when the ~BOSS APPEARS~ signal flashes on-screen.  As I skewer the last of the minions, the game switches to a view of the boss, dying in a pit of lava.  Yes, the boss some how ~jumped~ into the lava thereby ending that level.    One thing that I'm a disappointed at Capcom with is the lack over Internet play.  When playing the arcade version, despite all the same camera control difficulties that plague the Dreamcast version, it was great fun playing multi-player, especially in Team Battle Mode.  While there is a four-player split screen option, having online play would have given Spawn: ITDH tremendous replay value, especially since there's little of replayability beyond getting ~secret characters and weapons~ and those neat pieces of art by beating the game repeatedly.  Spawn: In the Demon's Hands will no doubt provide a fun night of enjoyable moments as a rental, where blasting and trash talking buddies will make you forget the camera problems and poor AI.  Playing it any longer and you might wonder ifSpawn on the PlayStation was any better. -- Anthony Chau, IGNDC", "date": "Oct 24, 2000"}