{"name": "C&C: Red Alert 2", "name_review": "Command & Conquer: Red Alert 2", "ref": "https://www.ign.com/articles/2000/10/24/command-conquer-red-alert-2", "text": "Go buy this game. Alright now, let's back that up with some facts. Red Alert 2 is one of the most polished, best-conceived, and downright enjoyable real-time strategy games in recent memory. There's an amazing depth to the tactics of the game, a good range of missions in the single player campaign and a kind of slightly ridiculous aspect to the story that lets you now that the game is supposed to be fun. Having said that I should caution you that Red Alert 2 does not offer the same kind of revolution in basic game design that so many of us expected of Westwood's last sequel, Tiberian Sun. This is not the 'next big thing' in strategy games and it certainly won't have the impact on the genre that early Westwood titles did. But what Red Alert 2 is, is one of the finest explorations of what can be done without taking the genre beyond its present limitations.  The game is still about harvesting resources to build structures to buy units, but what seems tired and worn-out in other games is inspired in this game. Granted, it's a formula but it's a formula because it works and only Starcraft and Age of Empires have done it as well. A large part of the success of Red Alert 2 comes from its smooth control system, comfortable menus and intuitive balancing. While it does add a few impressive gimmicks (garrisoning units in buildings and tech structures to name two), Red Alert 2 stands out because it's completely familiar to us while still being fresh.  One of the most rewarding and hardest to quantify factors of RA2 is unit balance. And when you've got three separate theaters in which to operate, unit balance becomes that much more difficult. The units in RA2 are an amazing mix of land, sea and air forces. And better than not having any of the units be totally worthless, the folks at Westwood have gone out of their way to make sure that each of the units has a particular role to play in your overall strategy. Let's just take the sea units for example. The Allies can produce Carriers that are very slow but can launch repeated attacks against distant enemy installations. Destroyers must accompany the Carriers to defend them from Sub attacks. Aegis Cruisers provide a convenient air defense while the undetectable Dolphins protect against Soviet Squids.  The game also comes with numerous special weapons of a suitably fantastic nature. The Allies have access to a Weather Control Device that rains (literally) thunderous destruction on your enemies. Simply pick a target, sit back and watch the clouds roll in. The Chronosphere is a little more sophisticated than the Weather Controller is. It permits you to shift units (yours or your enemies) from one area of the battlefield to another instantaneously. The Soviets have a Nuclear Missile that can erase large sections of your base in an instant as well as an Iron Curtain device that can render vehicles and structures invulnerable for a short time. In the interests of balance, all players are automatically alerted when one of these structures is built and are given a countdown to let them know when the device will come online. Additionally, the shroud is removed from around the superweapons so all players can have a chance to take them out. I was surprised that the superweapons were so well balanced. They can certainly win a game for you, but it's also possible to rally after a superweapon attack and take the fight to your enemy.  And while we're on the subject, the game is miles ahead of Tiberian Sun in terms of graphics. The units and structures are much better* designed this time around and are easier to pick apart at a distance. The only trouble is that units tend to bunch together thereby making it difficult to grab the units you need out of a group. This is especially true of the Allied vehicles, but there are plenty of grouping commands to ease the burden on you. The units animations are great. The way that the dead infantry units instantly decompose and leave behind a little skeleton is an amazing touch. I'm only sorry that the dead units don't persist on the battlefield. Imagine how disheartening it would be for your enemy to see his guys all piled up in heaps outside your walls.  I guess lots of dead guys would tend to detract from the beauty of the maps. During the course of the campaign, you'll travel to several familiar locations in the United States, from the Alamo to the White House to Pearl Harbor. None of the maps are really very accurate in terms of layout, but the chance to send infantry units into the Alamo or lift a siege around the White House is just irresistible. You'll also find the need to travel to locations like Korea, Paris and Einstein's Secret Laboratory in Northern Europe. There are a fair number of multiplayer maps (but not nearly enough urban maps unfortunately) as well as a map generator.  There are two twelve-mission campaigns for each side. I found a pretty good range of missions from your basic 'build a base and kill all enemy units' to the 'take a few units and see if you can't infiltrate the enemy base.' And there are lots of ways to get around particular problems in the missions. We found in one mission for instance that you can gain control of a cow by rescuing it from its farm. Once you've got control of the cow, you can use it to wander around the entire map without fear of being discovered. After all, the enemy's not going to worry that a cow is walking around his base (although now that I've spilled the secret, maybe he will). The main point is that while the campaign structure is totally linear, the missions can play out a few different ways.  While I love the campaign, there's one major complaint I've got to make. Westwood used to give you this ridiculous Efficiency and Leadership rating at the end of each mission. No one could ever figure out how the hell they were calculated. You could eliminate an entire enemy army without losing a single unit and still only get a 37% Leadership score. They've now replaced these seemingly arbitrary scores with the equally arbitrary Par Times. Each mission has a specific time in which it's meant to be completed (although you'll come in well under time for most of the missions -- I finished one in fifteen minutes that was supposed to take two hours). What I miss is the statistical breakdown. How many units did I build? How many did I lose? Structures? What about the enemy? Oh well.  As you might expect from a Westwood game, Red Alert 2 has some amazing cutscenes tying the missions together. Tanya and Premier Romanov are played much too broadly to be taken seriously (it makes you wonder if they actually knew this was a joke or not) but Ray Wise (President Dugan) and Barry Corbin (General Carville) put in some fantastic performances bringing a self-aware satire to the game. Ultimately, these two guys steal the show, but there are plenty of commendable performances all around. Even better the story holds together and fosters a sense of both urgency and loyalty in the player.  Without spoiling anything, I'll just say that the scene after you reclaim Gen. Carville's office is one of those rare moments where you realize a game can touch you on a very sophisticated and intimate level.  While the campaign shouldn't take an experienced player more than twenty hours or so, the single player missions are really just a training ground for going online against real human opponents. There are a number of options here and, believe me, we've tried them all. Most put some sort of limitation on the players (can only build infantry and tanks, can only build naval units, etc.) but they're all pretty solid. Luckily the plain skirmish mode is fun enough for you and up to seven other players to waste a lot of time on.  For those of you who just can't win or lose graciously, Westwood has given you option to play a cooperative campaign with just one other human player. The two of you will square off against two AI opponents in any one of five separate five-mission scenarios. These are tons of fun and a great way to ease less experienced players into the game. And if you've got no friends, don't worry; you can play skirmish games against the computer. It's not as satisfying and there aren't nearly enough options for some reason, but the computer player on its hardest setting will clean your clock. Consider it a challenge to get better at the game.  So this one release (and the possibilities of Emperor: Battle for Dune) just may reestablish Westwood as the king of RTS. There's still healthy competition from Blizzard and Microsoft's AoE series, but it's gratifying to see Westwood returning to the fight with such a remarkably developed game. We'll still have to wait for another title to redefine what RTS games are going to become, but Red Alert 2 is an excellent example of everything that RTS games currently are.  -- Stephen Butts  * As a side note, MS Word suggests replacing ~much better~ with ~many betters.~  Silly computers.     Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Oct 24, 2000"}