{"name": "NHL 2001", "name_review": "NHL 2001", "ref": "https://www.ign.com/articles/2000/10/25/nhl-2001", "text": "Historically, the odd years in EA Sports' ice hockey series have proven to be major letdowns. In particular, the Genesis version released in 1995 and the PlayStation editions of the game released in 1997 and 1999 all proved to be inferior products to the games that were released the year prior to them. And of those, NHL '99 was probably the most disappointing because it had the worst framerate of any game released by the company for Sony's celebrated 32-bit system.   Well, it appears that despite what we thought of the preview build of the game that EA Sports has not been able to shake the jinx. Even though the product seemed well on its way to becoming one of the best that the series has ever seen, something must've happened towards the completion of the game's development that turned things around -- in the wrong direction. Maybe it's just like the curse of the Bambino that Boston Red Sox don't seem to be able to break and there's really nothing that can be done about it. Regardless of the reason, it appears that the odd-year jinx has struck again.   Gameplay  If you're wondering wherein lies the problems with NHL 2001 on PlayStation 2? You shan't look further than the game's playability, which is significantly hampered by an excessive amount of slowdown that can negatively affect the gameplay and flat out hurts the general pacing of the game. This slowdown, believe it or not, was actually not present to this extent in earlier builds of the game. So, in adding stuff to the game somewhere down the line, the game's developers appear to have tried to make the game do too much, with the cost being a very inconsistent framerate.   While the game's occasional choppiness can almost be forgiven because it doesn't happen non-stop throughout the contests, NHL 2001's other noteworthy problem, its AI, simply cannot be overlooked. The Beginner and Rookie difficulty levels are pretty much laughable for veterans to the series and will likely even be a walk in the park for people that will be playing hockey on a videogame console for the very first time. And to make things worse, when the difficulty is set to either Pro and All Star, the computer still won't offer much more of a fight with the only really noticeable different with the settings being that it appears that your goalie gets worse and worse as you increase the difficulty levels. This isn't a good way to increase the challenge of the game and the fact that the game offers an insignificant amount of challenge even on its most difficult settings really takes away a great deal of its single player appeal.   This is really a sad thing because there are plenty of good things about the game that make it a worthwhile hockey videogame. The game is packed to the gills with all of the features, play modes, statistical tracking and customizable options that any hockey fan could hope for. The player management is fairly robust and complete stats are tracked and saved for every NHL player for both a full season and the playoffs. The only thing that's really missing is a franchise mode that has become of staple of EA Sports' John Madden football series.   Also on the positive side, we have the game's tight and responsive control that is as good as we've ever witnessed in a hockey videogame. The players respond quickly and fluidly to your movements, while using either the digital pad or the analog stick, and all of the basic and more advanced moves that you'd want to be performed by a hockey player can be done here with a simple press of the button. Furthermore, the game is actually quite a bit of fun to play and it has a very addictive arcade-style appeal to it. It's just that there's too much slowdown and the AI just isn't good enough for me to warrant giving the game a high score in the gameplay department or overall.   Graphics  Without taking into consideration the game's shortcomings in the framerate department, NHL 2001 would probably be considered one of the most visually stunning games available for PlayStation 2. The player models in the game are even more detailed and realistically modeled than what we got in EA Sports' gorgeous football game. The players are so detailed that you can see facial hair, realistic mouth movements, much less scary eyes, and a level of texture detail in the uniforms that will just blow you away.   The sensational level of detail just doesn't end with the players, either, as the ice, the logos, the 3D arena and just about every other single 3D object that you'll encounter in the game has the appearance that it's completely real and not something that's part of a videogame. The ice rink for instance has a convincing reflection that allows you to see the players skating over them, as well as the lights that are shining down on the ice. The problem with all of it is that it appears that all of this detail has come at the cost of a smooth and consistent framerate. And given the importance of a game's framerate, especially one based on the fast-paced sport of hockey, the developers appeared to have put their eggs in the wrong basket.   Sound  Ever since the near perfect NHL '98, EA Sport has had the audio down in its hockey series on PlayStation. The sound effects are all of the utmost quality, the music played in the background is exactly what you'd hear in a hockey game, and the announcing is mostly right on with what's happening during the game. The only complaint that there is to be made with this year's version is that the color commentary gets repetitious fairly early on in a season and this isn't a good thing for those who typically play multiple seasons over the course of a single month.  It might seem that I'm ripping on NHL 2001 a bit and don't like the game at all, but that's the farthest thing from the truth. The reality of the situation is that I think that the game is a very solid hockey videogame and it is without a doubt a game that I'll put more time into playing this year than everything else on PS2 with the exception of possibly Madden NFL 2001 and SSX. However, I would be lying to myself, and thus lying to you, if I were to overlook the fact that this game has some serious flaws that might make it completely unplayable for some players. The AI just isn't up to snuff in terms of the challenge it puts forth and there's simply too much slowdown in the game too be totally ignored. In spite of all of this, NHL 2001 would be one of the top five launch games that I would buy for PlayStation 2 and the fact remains that for now, it's the only hockey game in town.", "date": "Oct 25, 2000"}