{"name": "Monster Rancher Explorer", "name_review": "Monster Rancher Explorer", "ref": "https://www.ign.com/articles/2000/10/28/monster-rancher-explorer", "text": "Tecmo used to be a large force in the videogame market back in the NES days with series such as Ninja Gaiden and Super Tecmo Bowl. Slowly but surely the company shows that it's still kicking around by releasing a trickle of product for the Game Boy Color and PlayStation market. Monster Rancher Explorer is a revisit to the classic Tecmo platform puzzle game Solomon which hit the NES and Game Boy a decade ago. New to the game is the inclusion of the company's Monster Rancher license, but at its core the game is the same challenging design that made the rounds ten years ago. Features Sixty levels Level creator Battery back-up (one slot) Link cable support for trading levels Only for Game Boy Color  Each of the game's 60 levels has the same basic task  to grab the key and head out through the exit. But it's how you have to accomplish these tasks is what makes Monster Rancher Explorer a ton of fun. Your character (oddly called Cox) has a basic jump to leap from block to block, as well as an ability to cause wooden crates to disappear, and appear in any adjacent open spot on the playfield. You'll need to use these skills to work your way through the tomb to score treasure for points, powerups for time, and artifacts to catch the hidden Monster Rancher characters. But the task isn't going to be easy, because you're not alone in the dungeons...  Some levels are confined to the Game Boy Color screen, and others are much larger that forces the screen to scroll in order to follow the action. When you hop from platform to crate, you'll have to keep your eye out for evil monsters that'll halt your progress faster than you can say ouch. Your character is pretty indestructible, handling 50 foot drops like a pro  but if he gets hit once by an enemy, it's back to the beginning of the level. Each of the game's monsters have a different attack pattern  some will just wander back and forth, some will home in on you. Some will turn into a pumpkin if they see you, and some will walk mindlessly across up, down, and across all platforms it touches. Most importantly, only a few of these critters can actually be stopped with your ability to add or remove blocks, but most of these critters can be wiped out by throwing fireballs at them. Unfortunately for you, these fireballs have to be collected in the tombs before you can use them.  While the task seems very cut and dry in its design, the game is very complex  each level has its own little strategy you need to learn to get from start to finish. Each level ranges from the simple to the downright devious in layout, and it's this variety that makes the game amazingly addictive and a blast to play.   The Monster Rancher characters make small appearances in the Title and Game Over screen, but they don't show up until at least level 15 when you rescue the priest that will open up the Monster Shrine.  You can certainly just go from key to exit to advance to the next level, but you'd never discover the hidden Monster Rancher characters without exploring or building and destroying crates in remote locations of the tomb. Hidden in most levels are fragments of a monster disk  collect four of these and you'll be able to free a Good Monster and use him during the game as a super-helpful power-up. For example, capture Golem and you'll have access to his power five times  hit select and he'll pop up on the screen in a super detailed animation, wiping out every single block in the level. Other creatures from the 'toon can be caught: Suezo, Hare, Tiger, and Mocchi. They each have their own special technique that can be used in the game.  I'd also love to talk about the level creation mode in Monster Rancher Explorer, but to be honest I never unlocked the feature. Even after 40 straight levels of playing, the feature to access the level creation mode never opened up  which means there's a lot of hidden stuff yet to uncover in the game. Three save slots are ready to take your creations, but you need to find the gold access keys to open the ~doors.~ Once you create your own devious little level, you can send it over to a buddy's copy of the game through the use of the link cable. Why the infrared port on the Game Boy Color wasn't used for this feature confuses me, since all you're doing is sending one batch of data from one system to the next. But it's a cool feature at any rate, and I'll be continuing on the tower ascension to unlock the level creator for my own personal enjoyment. 60 levels is a lot to go through, but having the added ability to build my own is just too great an incentive to pass up.  Whoever handles the English localizations for Tecmo really needs to spend a little more time on his/her/their job  not only is the storyline poorly translated with broken English, the interface for Monster Rancher Explorer is very sloppy. In some cases, this interface can be hazardous to the save game file that records your game progress -- I've accidentally overwritten my battery save twice because of the poor menu system. Now that I know what to look for, it'll never happen again, but I warn you guys ahead of time  makes sure your save game is in memory before you head into the link cable temple.   It's obvious that the Monster Rancher property wasn't included in the original game's design, since the creatures only show up as power-ups during the game. Still, it's a namesake that sells most Game Boy Color games nowadays, and at least Tecmo is making a great attempt to bring a fun, original, old-school game to market...regardless of whose name is attached to it. Monster Rancher Explorer is a long-lasting, addictive game with loads of variety in its level designs, and the inclusion of a ~hidden~ level creator only enhances the replay value further. The game needs a bit more focus in the menu system department, because it's just a bit too confusing. Now we just need to convince the company to revive Ninja Gaiden. Just don't bring it out as Monster Rancher Ninja Gaiden and we'll be fine...", "date": "Oct 28, 2000"}