{"name": "El Dorado Gate: Vol. 1", "name_review": "El Dorado Gate: Volume 1 (Import)", "ref": "https://www.ign.com/articles/2000/10/31/el-dorado-gate-volume-1-import", "text": "The first part of Capcom's great experiment in RPG design has arrived to Japan after a shakey life that's taken it from one ill-fated system to a system that's unfortunately starting death right in the eye.  Volume 1 of El Dorado Gate brings together three different, albeit connected, stories in one package, and asks that you come back two months down the road for more.  It's console gaming's first serial RPG, and although initial impressions can be a bit sketchy, in the end the game works surprisingly well.  Japan is used to the whole serial thing - it's a part of the culture.  In America, you occasionally see a mini-series spanning a couple of two-hour long episodes on television, but most of the time, producers try to make a show last as long as possible, and weave out the story along the way.  Something like Star Wars is a rarity, where that many people can become involved-enough in a fixed-length story to wait two decades for a new installment.  But in Japan, turn on the television, and you may find yourself viewing a so-called ~Drama,~ a ten to twelve episode television show that, throughout its year-long course, tells a story from beginning to end.  These are immensely popular, and a close parallel to what Capcom seems to be trying to do with El Dorado Gate.  The three chapters in this first volume tell the tale of three individual heroes, but take place over the same map and in the same towns.  Throughout the volume, you'll encounter various town residents and different areas of the world, all the while becoming familiar with the gameplay system and story that will serve as the shell throughout all future El Dorado Gate releases.  In the end, the game manages to leave one with the understanding of how subsequent chapters will likely play out at a high level.  One would expect the story to be the primary means of drawing a player in for a serial anything, and in some cases that's the case with El Dorado Gate.  The background story, involving a quest to bring 12 heroes together in a so-called promised land has a few intriguing elements to it, things you'll notice once you've played through each adventure and observed a recurring theme involving evil (I'm still hoping for Capcom to release this game over here, so I won't be giving away anything...).  The individual stories for each chapter aren't as good, unfortunately.  They seem rushed, and have a hard-to-follow logic, as if, as mentioned in our preview, Capcom wanted to tell a complete story for each chapter but limited themselves to only two or three hours of gameplay and storytelling to get their point across.  There are some notable moments, but on the whole I'm hoping that future installments are given more time.   Thankfully, El Dorado Gate has a strong gameplay system to back it.  The dungeons start off slow but eventually begin to feature such familiar elements as warp points and height-based gameplay where you need to fall down from one floor of a dungeon to another floor in order to obtain secret items.  One sequence in which the character Gomez has to collect gems in a mine in order to pay another character back is an example of the game masking a dungeon, complete with random battles, in a story-based guise (the mine).  Hopefully there will be more of this in later volumes.  Like the dungeons, the turn-based battle system starts off slow but builds up with each chapter.  El Dorado Gate makes use of a gem system, where, in addition to unleashing attacks and defending themselves, characters can cast magic using six elements: fire, ice, leave, light and life (I know... it's not an element... so sue me).  Each element has multiple forms, including versions that strike all enemies, and up to three can be composed into a more powerful spell.  The weapons and armor that you find in the game are also equipped with elementals, with the same weapon being available under different forms.  For a price, you can compose two weapons into a (sometimes) more powerful one that features a few different properties and raises your stats, from HP to defense and attack power.  The reason this elemental system works so well is because you're forced, and encouraged to use it.  You won't get through a single dungeon past the first chapter of the game without using the magic to fight your enemies, and latter battles seem impossible for mere weapons alone.  The battle system allows you to equip a different piece of armor or compose magic all without penalty of losing a turn, meaning you'll likely be playing around with this system non-stop.  Furthermore, the elementals are in abundant supply.  While you regrettably don't gain experience in battle (there's no notion of leveling up in the game), the rewards presented by the game are good enough: every battle results in an enemy leaving an elemental or two behind for your taking.  I'm definitely hoping to see more of this elemental system, along with the battle and dungeon systems in future installments.  I'm also excited about the game's artwork, which constantly amazes throughout the course of chapter one.  I can't think of another 2D game that matches the resolution and brilliant use of color found in El Dorado Gate, aside from Arc System's upcoming Guilty Gear X (I have my TGS demo - do you?).  Every inch of the game seems to be drawn out by hand, rather than tiled as part of some memory-saving algorithm, and boy is there a whole lot of artwork to be found throughout the game's ten-hour course.  The end credits list a relatively large number of ~object designers~ - I would guess these guys were responsible for assembling the game's numerous visible items, from treasure chests to doors, to houses drawn in varying ways, to little armored knight statues, to books... the list is endless.  I'm not sure of it's as a result of character designer Yoshitaka Amano or not, as the cartoony in-game characters don't fully resemble his beautiful hand drawn work, but stylistically, I can't recall having ever been this fascinated by a 2D game before.  Although the artwork is a sight to behold and is enough of a draw to warrant future releases alone (I can't stress enough how excited I was to go to a different land - just to see the artwork for the backgrounds), on the whole, the game is unimpressive technically.  The animation for the characters is pre-16-bit at best - they don't even animate diagonally.  The backgrounds have the barest minimal movement, not to mention the still frame battles and only moderately impressive spell effects.  The audio, as mentioned in our preview, is rarely orchestral (with one exception being the theme used in the church), and when combined with the lack of voices and the frequent old-school sound effects, will make you think you're playing a game from another generation.  But maybe it's all for the good.  The game moves by at a speedy pace, perhaps because there's no load time before battle or between scenes.  Getting through the game from start to finish isn't a chore in the least bit, and once you've passed it all, going back and collecting all the in-game items is a speedy process, with each story taking only an hour or so to replay.  In fact, Capcom seems to have designed the game for replayability, by placing various items, ranging from red ~Ogre Stone~ gems to various pieces of equipment all around the world.  Once you've finished up the game, you'll find yourself exploring a special area called The Promised Land, where you can store items for future adventures - doing the extra work now will result in a much more fulfilling adventure down the road.   Finish up Volume 1, and you'll be given a slight preview of what to expect as far as characters and story are concerned for Volume 2, which will feature three new chapters that, presumably, will tell the tale of how three more heroes arrived at the gathering place.  There's certainly much left to explore as the series continues.  The magic system is still largely untapped, and some of the latter dungeons, as mentioned above, hint at the possibility of more complex puzzles to come.  Plus, the game's main map is largely unexplored, and there's no guarantee that the next chapter will even take place on the same map.  Who knows....  Capcom's goal with volume 1 of El Dorado Gate was pretty clear: make everyone who bought it come back two months later and pick up the second volume.  It seems that they've succeeded.  I'll definitely be in line to pick up volume 2 on 12/12 - not because I have to in order to review it, but because I'm genuinely interested in seeing what happens next.  -- Anoop Gantayat, Contributor", "date": "Oct 31, 2000"}