{"name": "Q-Ball: Billiards Master", "name_review": "Q-Ball Billiards Master", "ref": "https://www.ign.com/articles/2000/10/31/q-ball-billiards-master", "text": "Pool games, unfortunately, like Take Two's Q-Ball Billiards Master, always cause me to wonder why they exist in the first place.  They're like chess games in that sense, or video poker.  See, simulating soccer or football or rugby I can understand.  You generally don't have the twenty-odd friends you need for a proper game of football, or a field, or a ball, and then there's the pain, fatigue, and inconvenience of actually playing the game to deal with.  Pool is different, because it requires no real physical effort to play (being a game of finesse instead), and it isn't actually that hard to gain access to a pool table - even if you don't want to hang around seedy dives shooting 8-ball with large tattooed gentlemen named ~Duke,~ you can usually find a game for about a dollar an hour at the student union of any university you happen to live near.  There just isn't necessarily any discernable advantage I can see to playing simulated pool instead of real pool.  To pull out another example, you're liable to be as bad at the one as you are at the other, which in your humble narrator's case is pretty bad.  If the central appeal of a sports videogame is thus removed - after all, why play Madden or FIFA, if not to win at a game you could never conquer in reality? - where is the pool simulation left?  Gameplay  The answer, I think, is ~not anywhere in particular.~  Q-Ball makes a go of it in the control department, at least.  It has features for all the elements of cue and ball control you'd like - precise angle and shot control, settings for cue positioning and english, and special controls for things like jumping, stop shots, and the like.  The analog control is used well, so you can make drastic changes or fine tweaks in your positioning by applying varying degrees of pressure to the stick.  It's when it comes time to take advantage of those features that the game runs into a little trouble.  The tutorial mode is set up with a nice series of lessons on various techniques, but to learn the theory behind those techniques, you have to sit through a series of dreadfully slow dialogue screens (the manual contains none of that information).  These turn out to be of dubious aid in practice, too - see how long you'll spend in the ~stop shot~ lesson before you understand what on earth the game expects of you and how to execute it.  Outside the tutorials you can have a bit more fun, with modes that offer straight competition, a ~frozen play~ mode set up like a series of chess puzzles (as well as a number of other challenges and games), and what turns out to be the most rewarding of the lot in my view, the simple free play mode, where you're simply given a table and left to your own devices.  I had far more fun just taking shots as they came than in the restricting competitive modes.  Graphics  Regardless of how you play it, though, this is one sharp-looking pool game.  The balls aren't quite photorealistic, with a little roughness around the edges left to be conquered, but the textures and lighting are superb.  When you pull the camera in close, the reflections and highlights on the balls look almost perfect, and the textures for the felt and wooden rails are very sharp.  Their shadows are excellent too, cast at the proper angle and diffusing around the edges.  The backgrounds vary a little, looking better or worse depending on their particular theme and how the textures react to a shifting camera angle, but they're still all of them very pretty.  The camera control is the source of a few bothers, although there are enough view modes that you can find one you like.  The standard camera makes stomach-turningly quick cuts to close-up views of a pocket when a ball draws near - they aren't a problem on slow plays, but on breaks or fast-moving combinations, they're close to bringing the epilepsy.  I'd recommend one of the other camera modes, like ~Manual~ or ~Old Days.~  Sound  The background music is the sort of inoffensive loungey-type technoid stuff that's almost impossible to criticize either way.  It's just...there.  Most of us agree that there's more appropriate pool accompaniment out there - some smoky blues, for example.  The sound of clacking balls is well-done, though, varying in tone and volume depending on the camera's proximity to collisions.  Presentation  In its very Japanese way (this is an imported game, originally by Ask), Q-Ball builds a very pleasing visual framework around its games.  The menus are straightforward and quite cleverly designed, particularly the main section (why it looks like a bunch of RCA cables, I don't know, but it is an interesting concept).  If you can survive the ridiculously slow pacing, there are some useful lessons to be learned from the tutorial modes, with handy animations to go along with them. Lurking behind anything I could say about Q-Ball is the fact that, well, it's a pool game.  It's as realistic a pool game as you need, with all sorts of modes beyond simple 8-ball and 9-ball, and it looks as good as you could hope any pool game would.  But it's still a pool game.  If you're so far from a pool table that you can't even contemplate playing a game, or if you're that allergic to actually standing up while you play, I suppose this would have a place in your game library, but other than that, I don't honestly see the point.  I'd much rather just drop by the Berkeley student union and play for a couple of hours, if I felt the need.  Or hassle Peer for a pool table in the office.  Hey, there's an idea...", "date": "Oct 31, 2000"}