{"name": "Rising Sun: Imperial Strike", "name_review": "Rising Sun: Imperial Strike", "ref": "https://www.ign.com/articles/2000/11/03/rising-sun-imperial-strike", "text": "Last year TalonSoft broke the rule that said all Second World War wargames had to take place in Europe. That departure, called Rising Sun, inspired somewhat mixed emotions in me. While it had a remarkably deep yet friendly rule system and extensive unit lists, the graceless interface kind of put me off. Still, in the field of Pacific land war games, there's very little competition. Since the game shipped with a full feature scenario editor, the game soon got a boost from budding designers. Now TalonSoft offers the ~official~ expansion pack to Rising Sun, Imperial Strike.  The title might better be titled a mission pack as it adds nothing to the rules or units of the original game. While that's not necessarily a huge drawback given the depth of the original game, my expectations of an expansion pack is that it will add at least some new feature or toy for me to play with. I suppose we could quibble over the difference between calling it an expansion pack or a mission pack, but since expansion's what's on the box, that's how it gets evaluated.  On the mission addition level, Imperial Strike will leave you wanting more. The first game shipped with 7 different campaigns and over 40 scenarios. The add-on is only a quarter that size. Weighing it at only 7MB, there are only ten new scenarios and two new linked campaigns. On the plus side, all of this material is incorporated right into the Rising Sun executable and menus.  The ten new historical campaigns offer you the chance to travel to various battles in the Theatre. Gamers can refight the war in locations ranging from Burma to the Phillipines. The Galloping Horse scenario lets you fight the last battle for Guadalcanal while the Just a Few Marines scenario has you repelling the Japanese invasion of Wake Island. As far as length and complexity are concerned, the new missions are middle of the road -- at least compared to the missions in the original game. Most last about 25 or so turns and offer a moderate level of intensity.  The range of the previous missions is definitely lacking here. While there are a few amphibious assault missions, far too many of them involve the American troops walking into a Japanese ambush and then fighting their way through line after line of bunkers. This may be historically accurate, but it tends to get repetitive after a bit. Too many of the missions are geared for the Allied player as well. That's to say that the scenarios are designed so that it's much more fun to play on the attacking side and, historically, that's the role played by the Americans. Like I said before, it's historical, but that doesn't make it fun.  The Japanese invasion of Wake Island is the only one of the ten scenarios where it's recommended that you take the Japanese side. Most rewarding are the race scenarios where neither player is on the defense. The Race to Monywa has both players racing to secure a port. The best of all the scenarios (and one of the shortest) is the night-race to secure a roadway in the Battling Bastards scenario.  The one real selling point of the add-on are the two ~what if~ Japanese invasion of America campaigns. The first campaign, Invasion America, postulates a forceful and rapid amphibious assault on Washington state in the wake of the Pearl Harbor attack. As the Japanese commander you'll push through American defenses on the way to Seattle. The American campaign, Reaping the Whirlwind, portrays the other side of this conflict. You're asked to halt the Japanese advance in a series of battles I'd prefer to call Breakthrough to Olympia. I think that's got a little more personality than Reaping the Whirlwind but since they didn't ask me...  Anyway, the campaigns offer about 20 or so missions each (depending on how well you do) and are much more interesting than the stand-alone scenarios. It's very exciting to play through these alternate history campaigns (call them counter-factual campaigns in front of your history professor -- you'll score big points). I would've loved to have seen some more ideas like this. And that's ultimately the big limitation of this expansion pack -- it's just not expansive enough.  As you can tell, Imperial Strike definitely left me wanting more. There are enough missions here to keep you occupied for a little while, but given the fact that you'll be playing exactly the same game you played last year, there should've been more missions. The prospect of playing the American invasion campaigns will intrigue most fans of the game, but the ten extra scenarios are of only moderate size. Still the $20 price tag is pretty moderate as well. I recommend Imperial Strike to anyone who liked the first game and doesn't have too many expectations about the size of the add-on.  -- Stephen Butts      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Nov 3, 2000"}