{"name": "Petz: Bunnyz", "name_review": "Petz Bunnyz Review", "ref": "https://www.ign.com/articles/2008/04/08/petz-bunnyz-review", "text": "Easter may have come and gone, but the bunnies are still around. They're the latest animals to be added to Ubisoft's lineup of virtual Petz, which has previously featured everything from Dogz and Catz to Dolphinz and Tigerz. Petz Bunnyz takes its cues not from any of those, though, but from another past Ubi game  last year's Hamsterz Life. This game is, essentially, a direct copy of that product, with rascally rabbits swapped in to take the place of the happy hamsters.   It wouldn't be so obvious a swap, you'd think, except for the fact that Hamsterz Life was incredibly wacky and truly unique. Its hamsters were purposefully unrealistic, to the point that they wore human clothes and actually spoke to you, their owner, in English. What's more, occasionally the game would completely shift away from its core 3D virtual pet gameplay and adopt a 2D anime style for brief mini-game interactions. It was odd.   So Petz Bunnyz is now also odd, as it's inherited each and every one of those off-the-wall qualities. Your virtual rabbits speak to you in English, there's an anime-styled human girl named Bonnie who hosts 2D mini-games, and it's all just a little nonsensical  and fun. For the same reasons that the random mash-up of out-of-place elements worked for Hamsterz Life, they work here too. It's still a fun design.   That poor little girl's eaten one too many Cadbury Creme Eggs.  You begin a game of Petz Bunnyz by naming yourself, choosing a bunny, and naming the bunny. Then it's off to the cage, where you're greeted with an array of standard virtual pet genre options  you can feed, brush and pet your rabbit, you can clean its cage, you can take it out and let it run around your bedroom. All very simple. And it all works pretty well, as the foundation to this package.   Where things start getting more colorful is when your rabbit starts to talk to you. He'll ask you questions, in English, seeking knowledge about proper responses to things that happen in his life. You'll get to teach him the right words to say in a mini-game design that tests your speed with successive strikes of the stylus  for example, if you're trying to teach him to say ~Hello~ then the letters H, E, L, L and O will appear on the touch screen in sequence and you'll have to tap them in the right order. Succeed enough times and your rabbit will pick up what you're trying to say, and repeat it back to you.   Even more random than owning a talking rabbit, though, is the more infrequent ~Play!~ breaks that the bunny will summon forth at its whim. You'll just be going about your business refilling the cage's water bottle or brushing your bunny's fur when, all of a sudden, it's game time! The virtual pet gameplay will stop and you'll be sent to a Mario Party-esque mini-game that tasks you to score a goal with a soccer ball against a bunny goalie, find a hidden Easter egg by cutting away patches of grass or win a fast five rounds of air hockey. One of the mini-games even attempts to recreate the battle system of traditional turn-based RPGs. That one's interesting to see.   But for all the playfulness and accessibility that Petz Bunnyz offers through all of these elements, this package still falls a bit short for one good reason  it doesn't do anything new. It really is a clone of Hamsterz Life, with the exact same structure, the same teach-your-pet-to-speak-English interactions, the same random breaks for 2D mini-games. The mini-games are different from Hamsterz Life's at least, but still  it's been over a year since that game came out. Couldn't the developers have added at least one truly new piece to the package beyond just changing the hamsters into rabbits?So, as Petz Bunnyz is essentially the same game as Hamsterz Life, it deserves the same overall score that Hamsterz Life earned. It's not so insulting to be getting the same product again as we saw last year, as Hamsterz Life was truly unique, odd and compelling when compared to more mundane, realistic virtual pet designs. But let's not see this carbon-copying strategy used again, Ubisoft. If ~Petz Gerbilz~ shows up in early 2009 with this same design again, we're going to have problems.", "date": "Apr 8, 2008"}