{"name": "NASCAR 2001", "name_review": "NASCAR 2001", "ref": "https://www.ign.com/articles/2000/11/08/nascar-2001", "text": "One of the unenviable positions the reviewer occasionally finds himself in is writing about a game whose target audience he is obviously not a part of.  Like, say, NASCAR.  I have the utmost respect for stock-car racing, unlike some residents of this office (especially the Formula One fans), but there's no power on earth that could make me watch the entire Daytona 500 from beginning to end - I'd probably wind up gnawing my own leg off before the whole thing is over.  It's just not my speed.  What makes it doubly hard to judge a game like NASCAR 2001 is that the qualities which make NASCAR an acquired taste as a spectator sport affect the games in the same way.  Is it fun to drive around an oval track for 500 miles?  That will always remain a matter of personal judgment, I think.  A better question to ask (albeit a more complicated one) would be ~Does this particular NASCAR game have enough options to offer a decent breadth of racing?~  The answer there is probably ~somewhat.~  This will always be a fan's series, never competing with something like Gran Turismo in terms of broad appeal, but those fans will likely be very happy with it, and someone like me can pick it up and have a pretty interesting time.  Gameplay  The PlayStation NASCAR games may have been of a very arcade-style bent, but NASCAR 2001 on PS2 is unquestionably a simulation, in terms of control, physics, features, and AI.  It has some pretty spectacular crashes, but that's not the point of the game - success on the racetrack will come from careful, measured progress and paying plenty of attention to how you set up your car for a given circuit.  Wedge, tire pressure, gearing, and everything else affect the balance between handling and top speed, and where you set the fulcrum between the two noticeably determines whether you win races.  A long, banked, sweeping circuit like Talladega or Daytona demands that you set things up for the highest possible speed, whereas cramped courses like Richmond or Bristol emphasize grip, and Sears Point and Watkins Glen will send you scrambling to maximize your car's agility.  Speaking of cramped, make no mistake, these tracks get crowded at times.  NASCAR 2001 renders a 20-car field, which puts it well ahead of most competition (its PlayStation counterpart manages 18, and NASCAR Heat just behind that at 16).  As a result, you have to race conservatively, with a soft touch on the pedals and steering.  Weaving your way up through the pack is a vital skill to learn, especially if you've shortened the race, and qualifying for each race is a must to get a decent starting position.  The game is kind enough to minimize the load times involved with setup, qualifying, and racing, though - to go through all three you'll only need to sit back twice.  This goes a long way towards creating a more realistic simulation of NASCAR, especially in the longer races.  The glacial progression of a proper race helps the tendencies of the AI to show themselves a little more often, while setting things on the short side results in a somewhat more generic race.  The AI does have its individual quirks, racers showing some tendencies and occasionally showing off a dose of humanity (swooping outside or inside for turns, or occasionally pulling in close to exert a little pressure on you), but it takes a fairly long race and a higher AI setting to see the behavior of other drivers have a meaningful effect on the outcome.  You also definitely need to set those higher if you want a significant challenge from your opponents - the defaults mainly demand that you just avoid crashes, while drafting and careful passes are what come into play on the higher difficulty levels.  Graphics  What obviously occupied the most of the 3D artists' time were the cars: all 20 racers on the track never fail to look extremely good.  The textures are photorealistic up close, definitely doing justice to some of the goofier-looking specimens of the current NASCAR circuit.  Yes, I get a kick out of racing in John Andretti's Cheerios/Pop Secret/Betty Crocker car (number two being the rocking M&Ms car) - is this a problem?  The reflections and highlights add another layer of realism, even though you can see the developers cheating a little, since your bumper will reflect the same thing no matter where you're sitting on the track.  The in-car view is very well-done, simulating the effect of an offset driving position and bouncing your viewpoint around when your car gets bumped, and the dashboard and rollcage look reasonably good, although they're hurt by a touch of interlace flicker around some edges.  The car damage model has its ups and downs, but it's frequently very good, with realistic alternate textures and model segments for crushed body panels and flying bits and pieces like fenders and bumpers (although you have to drive pretty recklessly to see those in action).  The smoke effects are impressive as well, from both screeching tires and destroyed engines (you can send up smoke and fire alike, although it usually only happens when you pick the manual transmission and accidentally redline your engine).  In terms of animation and the effect of damage, though, I was more impressed by the damage system in Codemasters' Jarrett and Labonte Racing (WTC for folks outside the US).  The PlayStation didn't let it have the kind of texture detail you see in NASCAR, but it had some excellent animations showing damage in action.  NASCAR's transitions are a little less smooth, new textures and such just seeming to swap in and out.  Some particle effects need improvement, too - sparks fly when you scrape the wall or another car, and their animation is handled well, but the sparks themselves don't look right at all, as if they were far too low a resolution.  The trackside detail varies from course to course.  Basically, it's a question of size - the bigger a track is, the weaker the infield looks.  Talladega has its cracked and tar-patched surface, but there's not much to look at in the broad central expanse, and the grass textures aren't much to look at.  Sears Point and Watkins Glen have similarly unimpressive backgrounds.  Bristol, on the other hand, has plenty to see, with an infield packed full of RVs and trucks.  Every so often you come upon a nice touch on a particular course, too.  At Richmond, where you usually race at dusk, you see multiple shadows around your car and reflections of the sunset in the windows of surrounding buildings.  NASCAR retains some weird graphical glitches that needed to be ironed out, though.  The way it handles a performance drop is unusual - rather than dropping to a lower framerate (the game maintains 60fps at all times), every so often it falls down to medium res from its default 640 x 480 resolution.  It happens only on occasion, like when you're at the back of the pack and seeing 19 cars in front of you, or when you turn on the rear-view mirror (that one always does it), but it can occasionally foul you up a little when you're trying to maneuver up through the pack at the beginning of a race.  There also seem to be some kinks in the mip-mapping routines, especially involving the textures that represent damaged body panels.  Sometimes you'll see the textures for different levels of detail spontaneously swapping in and out in inexplicable disregard for how near or far they sit from you.  Sound  Musically, NASCAR isn't much, with just a few light country and rock tracks to accompany things, but the effects and voices are a great addition to both atmosphere and gameplay.  Engine noises and the screech of tires on the pavement are replicated with fidelity, and they serve to warn you as to how you're progressing through a turn, which is especially important in the in-car view (which is probably the best viewpoint from which to play the game).  The voices are a help as well.  The commentary is sparing, but it points out important events during the race, with the occasional emphasis from the color end, and you get helpful advice every so often from your pit crew, which again is most important when you're racing from the in-car view.  They'll tell you when a car is moving up behind you, or sitting above or below you, which is helpful for planning your strategy into a turn.  They also give you a hard time if you're spinning out or driving backwards, but it's likely that you won't need the reminder in those situations. It still, naturally, comes down to whether or not you want a NASCAR simulation.  If you do, this is a very well-made one for the time.  It has all the famous tracks and drivers of the real-life circuit, strong presentation interspersed with FMV at various points during the season, and a wealth of other details (my favorite were the unique first-place trophies for each race).  The control and physics model are very solid in their particular simulation groove, and there's nothing that comes close to NASCAR 2001 in the console arena as far as visuals are concerned - the next best competitor is the PlayStation version, which looks much weaker and has its framerate problems to contend with.  Other than that, there's only NASCAR on the PC with an expensive 3D accelerator, or Sega's NASCAR Arcade game, which I wish I could sit next to NASCAR 2001 (all I have for comparison is my remembered impressions from the JAMMA show).This is not one of EA's best technical efforts on the debuting PlayStation 2, though, showing definite room for improvement in its graphics and elsewhere.  The cars are dialed, and the framerate is excellent, but when NASCAR comes back next year, I'd like to see more detailed damage animations and better-looking tracks.  Call this a strong finish in the points, then, if not a commanding first place.", "date": "Nov 8, 2000"}