{"name": "Kawasaki Quad Bikes", "name_review": "Kawasaki Quad Bikes Review", "ref": "https://www.ign.com/articles/2008/04/08/kawasaki-quad-bikes-review", "text": "Aside from the fact that your racer is riding a four-wheeler instead of a watercraft, Kawasaki Quad Bikes is virtually indistinguishable from Kawasaki Jet Ski.  It boasts the same interface, the same annoying announcer, and the same terrible tilt controls.  In honor of this copy-and-paste effort, I considered copying and pasting my Jet Ski review and replacing the applicable words with Quad Bikes.  Of course, you, our valued reader, deserve better.  But the gist of this review will be: Kawasaki Quad Bikes is every bit as terrible as Kawasaki Jet Ski.   Here we have an ugly, bare bones racing game with poorly-implemented tilt controls.  There are four different vehicles, with two available from the beginning.  Tracks are unlocked linearly as you win races.  There is a decent variety of locations like indoor arenas, seaside runs, and snowy mountains.  But maneuvering around them is a chore no one should have to endure.     Steering is done by tilting the Wii Remote left and right.  This control method is advertised as easy for anyone to ~pick up and play~ but it's actually a cumbersome affair that mostly assures you a spot in last place.  Like all of publisher Destineer's other racing games the AI is entirely unforgivable, meaning if you make one single mistake like hit a wall you have lost the race.  There is no recovering, no rejoining the pack of perfectly-driven computer racers.  The game rubs it in your face, too, forcing you to keep going even if everyone else has finished and you are clearly the loser.  Plus, the computer racers keep going (and keep getting in your way) after they've finished.  Shouldn't these guys be popping open the champagne?   For some reason, your four-wheeler has the ability to magically jump straight off the ground without any sort of lifting from your driver.  As long as your power meter is full, you can hop over obstacles in your way.  The trick is a necessity in order to make it through the race, but still completely ridiculous.   Kawasaki Quad Bikes has a face only its developer could love.  It has the worst looking crowds ever seen.  The arena stands look like they've been filled with tons and tons of garbage and it's just festering there while you struggle to get your bike around the track.  Trees in the background are flat images.  Your racer is a wooden mannequin seated on the vehicle, never moving.  If you happen to fall into water, there will be no splash.   You can bring a friend into all this nonsense for moral support, but you won't be able to set any sort of options for your race.  You'll be engaging in a single event or the excruciatingly long, never-ending tournament.  That's it.  The computer drivers are there whether you want them to be or not.Do not be fooled by the bargain price tag or the Kawasaki endorsement.  Any amount you might pay for this crap is too much.  The developers should be paying you to play.  The controls will infuriate you, the graphics will sting your eyes, you'll turn the music off, and the unforgiving gameplay will have you reaching for the Wii power button.  If you manage to win a few races and unlock a couple new tracks, that just means there is more punishment in store for you.  Your mom warned you four-wheelers were dangerous, and she was right.", "date": "Apr 8, 2008"}