{"name": "Contender 2", "name_review": "Contender 2", "ref": "https://www.ign.com/articles/2000/11/09/contender-2", "text": "The original Contender, which was developed by Victor Interactive and published by Sony Computer Entertainment America, received plenty of attention because it was the second boxing game released on the system and it got a decent enough push by Sony. However, the majority of the attention was quite negative as the game was critically panned across the board and it didn't really receive that much fan fare.   Given that it faired poorly on both the critical and retail fronts, it surprised everyone at IGNPSX when we found out that Victor Interactive had released a sequel to the game in the form of Contender 2. Although, this time the publishing duties of the game were handled by the mysterious folks at Bam! instead of SCEA.    Gameplay  With the game seemingly coming out of nowhere combined with the knowledge that the first game was by all means completely worthless, the expectations we had for Contender 2 were minimal to say the least. Surprisingly, the game actually isn't too bad and is a substantial improvement over its predecessor in so many different ways, even though it doesn't appear that way at the onset.   The game's basic setup is almost exactly the same, but the sequel is actually missing many of the things that were in the original. Contender 2 only features two main gameplay modes, Main Event and Exhibition, and is limited to only three different camera angles, compared to the three gameplay modes and seven different camera angles. Moreover, the Main Event mode in the first Contender was actually a bit more robust because it contains features not present in Contender 2 like the ability to increase the statistical rankings of the boxer and increased control over who you'll challenge next in your career.   Despite all the stuff that's missing that was in the original, Contender 2 proves to be a much better overall game because the gameplay improvements that have been implemented has produced a much more enjoyable game. Whereas the control in Contender seemed relatively slow and unresponsive and the fighting relied almost completely on button mashing, Contender 2 is very responsive and actually requires the player to box more intelligently and know when it's a good time to attack versus defend (keep in mind that this isn't the case on the Easy difficulty and only comes into play in the harder settings).   The main difference is that while the first game relied on just two buttons for all the basic punches, this one has seperate buttons for left and right high punches and left and right low punches. This small little change has managed to increase the game's overall fun value almost exponentially. Even so, the game is still far from good and is still very limited in some very key areas. First and foremost, the boxers are limited to a single combination and four special punches, which seems fine enough for your first few matches, but gets a bit old and repetitive by the time you've played through the championship and begin to open up the secret characters. It's this lack of depth in the game's play mechanics combined with the fact that all the fighters pretty much feel the same despite their differences in style and design that keeps this game from begin anything other than just average.   Graphics  Just as the gameplay in Contender 2 is stuck in the realm of mediocrity, the same can be said for its visuals. The 3D polygonal models aren't necessarily bad and they are a substantial improvement over what we were given in the original, but they're still a bit too blocky and aren't detailed enough. And while the characters are passable, the same can't be said about the backgrounds that are filled with a crowd that doesn't animate and almost no other details whatsoever.   Sound  The game also seems fairly low budget in the area of sound as the music is completely unmemorable and the voice of the game's announcer gets really irritating after just a few rounds. What makes things worse is that there's very little variety to what's being said, so by the time you make it to the championship fight, you'll wish that you had the chance to beat the crap out of the announcer instead of the current belt holder.  Even with the game's numerous problems in its sound, graphics, and depth, I found enjoyment in playing through Contender 2. It's not a deep boxing game and isn't something that I would recommend buying, but it managed to give me a few hours of pleasure, which was a big surprise given that I was expecting this game to be a complete waste of my time. Contender 2 is a pleasant surprise that is a substantial improvement over the original in every category that really matters.", "date": "Nov 9, 2000"}