{"name": "Army Men: Air Attack 2", "name_review": "Army Men: Air Attack 2", "ref": "https://www.ign.com/articles/2000/11/09/army-men-air-attack-2", "text": "The 3DO Company is often criticized for being one of the worst companies in the industry when it comes to taking advantage of the general consumer. The company continuously makes money on releasing big named licenses that sell well despite the fact that there's very little to no game to back it up. And of all the various 3DO licenses the one that gets the most heat is without a doubt the company's popular Army Men series. This series already has seen no less than six different incarnations on PlayStation, with one of the most recent being the sequel to Army Men Air Attack.   The odd thing about the first Air Attack was that it was actually a good game and wasn't the steaming pile of crap that we had come to expect from games with the Army Men name on it. Because of this, we weren't dreading the release of Air Attack 2 like we were with Sarge's Heroes 2 and World War Land, Sea, and Air.   Gameplay  Just as we had expected, Air Attack 2 has proven to be a very good game that has made some key improvements to the original, which was already a very solid helicopter-based action game. Once again, the game has a very solid single-player mission-based scenario to go with an insanely fun, addictive and competitive two-player mode.   The missions are quite advanced and they're challenging enough that you won't be able to just fly through them and shoot mindlessly at your enemies. Players will be required to effectively use their arsenal of weapons to be successful and can't just go wildly into each mission and expect to come out victorious. One of the coolest enhancements that has been made to the game is the new ability to use the winch as a weapon. Players can now pick up objects with the winch and throw them at enemy troops, buildings or crafts. The added dynamic that this adds to the game is intense and learning to master the throwing of objects is integral in being successful in the game.   And for those of you who complain that there's not enough co-operative multiplayer games on today's consoles, you should find some satisfaction that every single one of the single player missions in Air Attack can be played in co-op mode with a friend. The mission objectives don't really change, but the added dimension of taking on the enemy forces with your friend just adds a great deal of excitement to the game. There's just nothing better than wiping out an entire enemy force together with a close friend.   One of the game's other excellent features is its insanely fun two-player head-to-head playability. Players are given the chance to play against a friend in five different head-to-head play modes that includes Bug Hunt, Food Fight, Tug Of War, Flag Nab-It, and Aerial Assault. All the different modes are quite fun and are very easy to pick up and play.   Graphics  Judging the visuals in an Army Men game is somewhat more difficult than your average game because it's somewhat limited by the universe. Since the game is based on toys that are either green or tan, there's generally not that much variety in the look of the different characters, aircraft, vehicles and background objects. However, unlike the various Sarge's Heroes and World War games, Air Attack 2 manages to not be crippled by the general blandness of the Army Men universe as it has a lot of things in it that are missing from the other games.   The most significant thing that you'll notice about Air Attack 2 that can't be said about most other Army Men games is that it runs at a silky smooth framerate with an almost complete lack of slowdown. Even in the game's two-player split screen mode, the game moves fast and there's never a time that you'll find yourself bothered by its framerate.   Furthermore, Air Attack 2 makes use of a plethora of very cool and glitzy special effects that help brighten up the world and makes things much more pleasant to the eye. The explosions are very impressive and the various lighting effects that come forth with things like the explosions and the various weapon fire from both enemies and comrades just add a great deal of visual appeal to the game.   Sound  The one aspect of the game that was awfully bad in the first Air Attack was its audio. The music was pretty horrific and the voices were just run-of-the-mill and completely derivative. The game's development team, led by Kudo Tsunoda, has apparently taken note of our complaints and those put forth by others, as the audio in Air Attack 2 seems substantially improved in almost every aspect.   The music is much easier to listen to and generally does a wonderful job with setting the mood and upbeat feel of the missions in the game. The sound effects are standard fare with basic sounds for weapon fire and explosions, but they get the job done and that's what really matters. The voices, which were panned in our review of the first game, aren't really that bad, either. While they aren't as varied as they could be and do seem to be a bit derived, there were a few that really entertained me and none of them could be constituted as bad voice acting.Even though it gets me some strange looks and reactions, I'm not afraid to admit openly that I'm a fan of 3DO's Army Men Air Attack series. Both games that have been released in the series to date have proven to be awfully entertaining and have given me countless hours of enjoyment. And with Air Attack 2 specifically, the game's development team has managed to take everything that was good about the first game and bring it over to the sequel without messing it up, while adding some new gameplay elements and improving the game's overall audio and presentation value. It's pretty clear that Air Attack is the crown jewel in the top selling and much maligned Army Men series.", "date": "Nov 9, 2000"}