{"name": "Arthur's Absolutely Fun Day", "name_review": "Arthur's Absolutely Fun Day", "ref": "https://www.ign.com/articles/2000/11/11/arthurs-absolutely-fun-day", "text": "When you've got a system that's skewed towards the younger folk, you have to expect the occasional game that's tailored for the very young. We've had our fair share of them, from Elmo to Winnie the Pooh, and there are a few more coming our way, like The Berenstain Bears. These games aren't for the die-hard Game Boy Color gamer, they're for the little brother who can't keep fidgetting in the backseat of the car in a five hour trip to grandmas. Perfect Dark may be a little too mature, and Pokmon has a bit too much reading involved -- so parents have other stand-bys to grab. Arthur's Absolutely Fun Day is more a brief romp of little things to do to keep young players quiet -- it's not going to win any awards in originality, but it's got enough variety to occupy the kid's until the next rest stop.FeaturesFifteen minigamesPassword saveOnly for Game Boy ColorI haven't regularly watched PBS since the local network affiliate stopped playing Monty Python and Red Dwarf, so I'm going to shock the world and say that I've never, ever seen the Arthur cartoon aired. That, plus the fact that it's usually airing when we're all in here playing games, but that's beside the point. The Game Boy Color game is based on the characters from the show, but there's no plot or need to know the names of any of these folk -- so it's simple to pick up and play for kids who haven't been exposed to the series yet.And simplistic is the name of the game -- it's  a bunch of minigames that take place in Arthur's neighborhood. The goal is to obtain the coveted Free Pass to Wonder World, an amusement park tucked conveniently in the corner of the neighborhood. To obtain this pass, you just have to successfully win at 16 challenges. Some of the challenges are really odd -- like flipping flapjacks to get 10 successfully cooked. Others are a bit more simplistic, such as the basketball shooting game where it's all about timing a single button push. Others seem more like chores, like the booksorting game in the library. But there are a few that are actually quite good -- the air-hockey table, for example, is an excellently-designed challenge that should be built upon in a future, older-audience title.Once in the park, that's the payoff. Now that all the games are open, you can play until your heart's content. Play a round of skee-ball or shoot the watergun at the clown against the other Arthur characters. The game features an extremely basic password system in the form of character faces so kids can shut the system off, come back to it, and regain access to all the games both in and out of the neighborhood.The odd thing about this design is the fact that it doesn't encourage the player to float around the neighborhood to play other games -- if you favor one game, you can go into it 16 times, win the stars, and enter the Wonder World park for the extra minigames.It's for the young kids. It's the kind of game you shove in your little brother's hands when he pesters you after dying in level 1-2 in Super Mario Bros. Deluxe for the 17,000th time. If you're old enough to read, the game's really not for you -- but it is a nice Christmas gift for those five year olds itching to develop their gaming thumbs.", "date": "Nov 11, 2000"}