{"name": "Mickey's Speedway USA", "name_review": "Mickey's Speedway USA", "ref": "https://www.ign.com/articles/2000/11/11/mickeys-speedway-usa", "text": "Cart racing has become an essential element of videogame consoles. Since the inception of Super Mario Kart (SNES) many have tried to imitate its success. Most times, though, these clones lack enough polish or general aura to hold up. Even Nintendo's own Mario Kart 64 had trouble bringing the classic 2D cart racing into the 3D arena. Of course, Mario Kart 64 stood on the forefront of software development by being the first cart racer brought into true 3D. After taking some notes Nintendo's own second-party developer, Rare, took a shot at improving upon what Nintendo had already set forth. From those efforts came the well-rounded Diddy Kong Racing (DKR). It was an instant hit for the 1997 holiday season. Now, three years later Rare is, again, trying to bring the same fast-paced cart action to the N64 courtesy of a Disney license. It's called Mickey's Speedway USA. Is it simply a DKR clone? In actuality an even better question is, does it manage to improve on DKR? In truth Mickey's Speedway USA leaves much to be desired. A good game from a great company to be sure, but it seems Rare has fallen victim to industry standards by producing a mediocre game based on a big license. The good news is that Mickey's Speedway does have its finer points.   Features   Disney license featuring Mickey and friends Classic style cart racing Return of the famous powerslide Collect tokens to increase your top speed Finish the race fourth (not third) or better to keep advancing Unlock extra modes by being a pro Four-player battle and versus mode Rumble pak support   Gameplay The title, Mickey's Speedway USA, says it all. Mickey and company travel across the country in race cars to save Pluto (Mickey's Dog) from some nasty dognappers. As the story goes, The Weasels have stolen Pluto and the diamond collar he was wearing. At that point Mickey and the rest head down to Ludwig Von Drake's workshop to pick up their new rides. Ludwig ends up tagging along with the promise of power-ups when they need them. This is where the adventure begins.  There are six playable characters, which include Mickey, Minnie, Goofy, Pete, Daisy, and Donald. As well as six game modes: Traffic Troubles, Motor Way Mania, Freewayphobia, Time Trial, Practice, and Contest. Essentially, though, Traffic Troubles, Motor Way Mania, and Freewayphobia are the same. While each of the three sets feature three levels of difficulty -- amateur, intermediate, and professional -- they are inherently difficult as well, through design. What we mean is that Traffic Troubles tends to be the easiest of the three with Motor Way Mania and Freewayphobia following respectively.   Each level of difficulty influences the way your cart controls. When set on amateur your car moves slowly and the powerslides are less dramatic. As you go from intermediate to professional, the cars become faster and the powerslides become larger. The only problem is that the faster cars are harder to control; thus, the levels of difficulty take meaning. The differences are very noticeable and depending on your skill level you should be able to find your setting. Even as an adult you're going to have to fine-tune your skills to beat something like Freewayphobia on professional mode.  You can win a bronze, silver, or gold trophy on each setting and if you get the gold trophy in professional mode you'll open something called ~Victory Vehicles.~ As well, if you retrieve the four car parts that have been stolen and hidden by The Weasels you can unlock a fifth mode, ~Frantic Finale.~ If one thing's certain, you can't just jump into the game and be done with it in a matter of hours. It will take some time and practice accustoming yourself to the controls.   Time Trial and Practice mode are pretty self-explanatory. Practice mode is simply one level designed to let you free roam around the track to adjust to the control scheme. Time Trial, on the other hand, gives you access to all twelve of the tracks where you can truly brush up on your skills to ensure you will blaze by the competition when the time comes. There's even a ghost setting that will let you race your own ghost or a staff ghost. A ghost being a ~ghosted~ image of a player which you can race against. This way you can race against your best times by actually racing your ghosted self. The staff ghost is insanely good and once you beat that you have nothing to prove.    When it comes to actually controlling your characters Rare has done a fine job of making things feel pretty smooth. You accelerate with the A-button, brake with B, and honk with the Z-trigger if you so wish. The Z-trigger is also used to use your special item that you pick up on the roads. Placed all over the roads are cans, which hold random items such as baseballs for throwing or fizzy soda pop for an extra boost of speed. These items are a must to pass the levels. If you want to win, you have to play dirty. Although, the cutesy Disney characters will be apologizing and turning your greed into fun. The last control option that must be mentioned is the classic powerslide that can make or break you on difficult levels. All you do is hold down the R-trigger to slide your way around sharp turns. It's a must have for all cart racers.   When it comes down to it, though, this title is supposed to be the follow-up to Diddy Kong Racing. It's done by the same team and is likely to be running on a tweaked DKR engine. The comparisons are both inevitable and necessary. Unfortunately, when you go back to play Diddy Kong Racing one thing is very obvious -- it is more fun. Diddy Kong Racing not only offered fantastical creative levels, but it also offered diverse driving conditions. You could race a friend and he might be flying a plane while you race your hovercraft on the ground. Having access to a car, hovercraft, and plane was what made the Diddy Kong [cart] Racing more intriguing than Mario Kart 64. Not only that, but the level design was really cool too. Sadly, there just isn't as much of that in Mickey's Speedway. There are several short cuts that get you ~off-road~, but they're very minor. In the end, the gameplay of Mickey's Speedway just doesn't stack up to its parent title, Diddy Kong Racing. IGN64 thinks that this title is really geared more towards Disney fans and especially children. It's not too complicated in design and you get to play as your favorite Disney persona. Unfortunately, coming three years after the release of the much-beheld DKR, it's just not what we were expecting.  Multiplayer One area where Mickey's Speedway does improve over DKR is the four-player battle mode (called Contest). Well, that only being the case because Mickey's Speedway has a true battle arena based around popping the balloons attached to your cart. It's exactly like Mario Kart 64 but the level design is far blander and the execution fell short of accurately mocking the highly regarded battles of Mario Kart. The available items include baseballs, fizzy soda speed boosts, ~heat-seeking tricycles~, slippery paint splotches, invincibility bubbles, and stormy weather (slows down all characters ahead of you). You can also have an all-out four-player versus mode in any of the racing levels. Here, too, you can use your special items to battle your way to the finish line. All in all, the versus mode is usually what gives cart racers more appeal. In Mickey's Speedway the case is borderline. There's fun to be had, but it will get old quick.  Graphics Visually the game is fairly impressive. There are plenty of subtle color themes for each level and they do a great job of giving the levels a certain atmosphere. There are also a lot of artistic ~extra~ on the borders of the levels. The character's faces are often featured in place of landmarks such as the Statue of Liberty or Mt. Rushmore. Of course there are plenty of real landmarks such as the Seattle Space Needle and Golden Gate Bridge. Overall the art stands out uniquely as it puts images from the real world into this supposed cartoon universe. The fluid animation of your character certainly helps bring out the cartoon feel of it as well.   However, when compared to Diddy Kong Racing there are issues. Rare opted to put the Disney characters in a real world, and we're not quite sure why. The great thing about the Disney license is that you should have the ability to create a really fantastical experience. Whereas DKR presented the user with a heavily cartoon influenced world with pirate ships and pre-historic levels, Mickey's Speedway opts for this slightly tweaked real world. IGN64 would have preferred to see magical warp zones or unrealistic level designs. Aside from that, though, Mickey's Speedway does have an improved framerate over its predecessor, Diddy Kong Racing. For this we are happy.   Sound Put on a happy face, because there's no other way to listen to anything in this Disney-themed cart racer. The soundtrack features jazzy and upbeat tunes that bear a bit of a cartoon-edge. There seems to be a song for each level and they're not just looping MIDIs (well, not by N64 standards). The melody changes in both tone and reoccurrence as you progress through the level. Unfortunately much of the composure is too similar to the next. There are only a few songs that actually catch your ear. Further, ice levels don't really sound icy or very different from the dry desert. There was some deep bass on the Chicago level and some twang in Dakota but it just lacks enough pizzazz to make it very noticeable or unique. In a game with so many different cities and themes it would be great if your cross-country trip was reflected through sound as well.   The sound effects are ultra-sweet being based around Disney standards. The pool of liquid your brain floats in is quickly saturated by the sugary comments from all the characters. As Minnie Mouse you may wallop Mickey with a baseball and cheer, ~But we're still friends!~ And Mickey replies, ~That's okay Minnie.~ The general tone is very happy-go-lucky and you'll be experiencing plenty of ~Yea's~ and ~Weee's~ in the voices of your favorite Disney characters. I found myself constantly dreaming of the diversity and fantastical worlds found in Diddy Kong Racing. It's a shame that Mickey's Speedway had to come out after DKR or else it may have been able to stack up a little better. Even so, the races are just less fun in Mickey's Speedway. The one thing this title excels in is the control. The carts are very easy to maneuver and it actually feels better than Diddy Kong Racing in that regard. The problem comes back to the level and vehicle design. I thoroughly enjoyed taking to the air and water now and then in DKR, and I also liked the adventure mode. Mickey's Speedway lacks that and it ends up being another game where the license does all the talking while the gameplay does very little walking. Rare is an ultra-talented company, and perhaps we expect to much of them sometimes. Is Mickey's Speedway better than Penny Racers or South Park Rally? You bet. But I feel it's not even up to par with Diddy Kong Racing, which was made three years ago by the same company. Such is the reason I'm not as thrilled with this piece of software as I wanted to be. I eagerly await a sequel to Diddy Kong Racing, or at least one done in its style. Rare: I hope to see you then.", "date": "Nov 11, 2000"}