{"name": "4x4 EVO", "name_review": "4x4 Evolution", "ref": "https://www.ign.com/articles/2000/11/14/4x4-evolution", "text": "Ahhh, there's nothing quite like the outdoors. The clean air. The beautiful foliage. The wild animals frolicking in the wilderness. The 4x4 off-roaders squishing the frolicking animals, crushing all of the beautiful foliage, and polluting the air. There's just nothing like that sweet smell of destruction that gets you revved up and ready to race and G.O.D. was counting on that oh so human need to sell their new off-road racer, 4x4 Evolution. But does that translate into a satisfying racing game that will keep you coming back for more? Read on McDuff and find out.  First off, I have to say, that my opinion of this game really changed quite a bit over the time I was playing it. I hated it, and I loved it. I kinda liked it and I thought it was a bit stupid. But as I clocked more hours onto the game and my vehicles got faster and better, I realized that I was having a pretty good time playing the game. 4x4 Evo certainly has its share of problems mind you and I'll say right off the bat, that if you are looking for a realistic racer, this is not a game you'll be happy with.  So my golden star of funfun goes to the beautiful graphics. They really did a beautiful job with vehicle models, the terrain, the extra objects, etc... From the time you load the game up, you're eyes will be drooling for more. And the framerate really kept up nicely giving a smooth ride through lush landscapes filled with birds, flying planes, trains, construction vehicles, and traffic. All you have to do is check out the screenshots to get an idea of what to expect from the game.  The other main reason I ended up enjoying my experience with the game was the great career mode. When you start a new career, you are given $30,000 to buy a stock vehicle, which there's a ton of but I'll get back into that in a sec, and whatever upgrades you can make with the money you have. After you've set up your machine, you can go race. You can choose to race in either Special Event or Series racing while in Career mode. Special Event is a single race that goes for a smaller amount of money and the Series is a bunch of races each with a greater purse total. There are tons of different Series races ranging from stupidly easy to quite a bit more difficult. The series each have themes such as the Arizona Series uses the desert tracks included in the game while the Winter Series takes place in some pretty rotten conditions taxing your car and your driving skills. Series races also are divided into vehicle categories. So, if like me, you pick a Toyota Tacoma, then some special races such as the Tacoma Series and the Truck Series while others such as the Blazer Series and the SUV Series will be closed until you can buy another vehicle.  You may notice that the first few races in the game are a bit slow. But once you make the first few adjustments to your engine and transmission, you'll start to notice the game moves quite a bit faster. And this in turn gets you hopelessly addicted to winning more money so that you can upgrade your vehicles more to make them go even faster and turn better and look cooler and and and... You can see how it goes. I found myself thinking, ~well if I play for another ten minutes, I can get that carbon fiber body for the car which will reduce the weight and make me accelerate a little better,~ and if you play games very much, you know the downward spiral from there. There's always just another ten minutes.  Besides the career mode, there is also a quick race mode, which you can use to try out different vehicles and tracks to get used to them. There are three classes of vehicle to choose from in the quick race that show the overall performance of the vehicles. Time of day and weather conditions can also be set so that you can practice each of the tracks and see how they need to be raced in varied conditions.   And the conditions really vary. There is a definite difference in the way your cars handle in the rain as opposed to the dry midday conditions. But this brings us to the parts of the game that I wasn't entirely happy with. There really isn't much realism in the game. First off, you'll notice that there are no crash models, but this is entirely understandable as car companies much of the time are unwilling to give licenses to game companies unless their cars are unbreakable. I guess these people think that if we don't actually think that the cars will dent if we run head on into a tree at 60mph. I don't know, but I'm not going to fault the developers for something they really had no control over.   The thing I really have a bit of a problem with is the moon physics that have been implemented into the game. I feel I have to clarify something first off. The physics of the individual wheels is actually pretty cool. They react independently and look very realistic. The problem lies in that the Earth's gravity seems to have been turned down a bit in the game. Vehicles tend to float through the air and bounce along like the lunar rover. These trucks and SUVs are also incredibly hard to tip. I screamed around some corners with the over steering turned on and never got any of the vehicles to roll. I mean, c'mon now, do you really expect us to believe that these lifted trucks will never roll unless half of the car is over thin air. I actually had to drive half off a bridge to get vehicles to roll. And even then, I was wondering if it wouldn't miraculously right itself on the float down to the ground.   You really do need to be able to suspend realism completely, these cars are able to climb incredible steep hills and drive underwater after all, in order to enjoy the game. I guess I was just expecting a little realism from a game that uses actual vehicles. It seems as though the car companies had no problem with misrepresenting their vehicles in completely unbelievable ways as long as it made them look good. But believable nicks and dents... forget it. Okay, enough ranting.  Besides the floaty moon gravity, the game actually controls fairly smoothly. Make sure that you have some kind of analog controller when you play this game though. The keyboard and digital gamepads just do not work. It is almost impossibly hard to play that way. If you've got a steering wheel or a joystick, those are the way to go. It may take a little while to get used to the way things steer, but it's very consistent after you've gotten used to it.   Each of the cars controls differently as well, so you'll have to get used to the little differences. And there are a lot of different cars. There are trucks, Xtra cabs, different SUVs from Pathfinders to Suburbans, and budget to luxury models. Add all of the beautifully designed tracks in there and you've got plenty of reason to keep coming back for more. Tracks range from off-roading through lush forests to rolling through an oil-mining field and from an arctic wasteland to the scorching desert of Arizona. There's a lot to do and learn here, as there are tons of shortcuts to learn that can shave seconds off of your times.  Unfortunately the collision detection can be sad at times so taking those shortcuts can be a risky business. I've been stopped by posts that were easily a few feet away from my car and gone right through rocks on the ground. Does all that stuff take away from the overall experience? It certainly can if it's a tight race.  Once you've learned the tracks enough and have a pretty kickass truck, you will probably want to head online for some multiplayer action. 4x4 Evolution is one of the first games to be multiplayer compatible over the PC, Mac, and Dreamcast systems. The lobbies will even tell you what platform gamers are on so you can get a good idea of how the different platform gamers compare skill-wise. Unfortunately, I had a huge problem with the Internet multiplayer function. I could only see a couple of the other cars actually racing. Three or four of the cars in the race would just be sitting at the starting line on my screen, and I would be in last place. I could usually see only one other racer actually moving in the race while it was obvious by the rankings that everyone was racing along at a good click. It certainly dampened my fun not being able to see how others raced.  But overall, I really did have a good time playing the single player game, and I can only imagine that if the Internet racing had worked for me, it would have been quite a bit of fun as well. The game does have it's share of problems that can be frustrating at times, but if you're a fan of racing games, and are willing to seriously suspend disbelief while you're playing this game, then 4x4 Evolution is probably something you'll want to check into.  -- Dan Adams Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Nov 14, 2000"}