{"name": "Rocky Interactive Horror Show", "name_review": "Rocky Interactive Horror Show", "ref": "https://www.ign.com/articles/2000/11/15/rocky-interactive-horror-show", "text": "Some adventure games are born weird.  Others consciously try to position themselves as plain old coo-coo or a tad bit eccentric.  While most prove harmless (anyone remember Sir-Tech's Dementia?  Didn't think so...), there are a few that possess the power to corrupt an entire generation's thought processes.  Consider Leather Goddesses of Phobos, or any of the ancient, hilarious Legend titles like Eric the Unready.  As for the Rocky Interactive Horror Show, newly imported from Britain into retail outlets stateside, this title's in a category all its own: off it's damn rocker.  Sticking to the movie's script, players assume the role of either Brad or Janet, two helpless bystanders that wind up hopelessly enmeshed in a freakish baddy's nefarious schemes.  Depending on which member of the pair is chosen, the goal is to rescue the other character, who's been turned into stone by the Medusa machine.  Survival's important, but not so much so as rescuing the victim from their stony prison within half an hour, lest all parties involved receive a free one way ticket to Transsexual Transylvania courtesy of a house that morphs into a spaceship when the clock runs out.  Don't try to understand the plot, however.  Just assume the title's a whole lot like Maniac Manson and you'll save your frontal lobe a whole mess o' trouble.    Further comparisons to LucasArts' zany classic are inevitable.  Although it's the year 2000, this title plays like an aged point and click adventure, parading observers through a series of puzzle laden rooms.  Minutes vanish from the counter as you wander the corridors, seeking out the various objects that solve each mindbender.  Meanwhile, a host of goons from the cult flick - including Riff Raff, Frank, and Columbia - stalk the mansion, though a run in with these rejects means nothing but trouble.  While the publisher should be ashamed to have released such an anachronistic piece of software, the experience nonetheless seems rather compelling from an oldschool gamer's perspective.  So too do the puzzles feel out of place in this day and age.  Directional movement keys, an action trigger, and an inventory menu are the extent of the interface.  Gameplay therefore translates into a series of search and retrieval missions, as Brad or Janet combs the house for important, single use items.  Thus the 80 built in conundrums aren't especially taxing or deep by design.  And while it's mildly amusing to dress a skeleton in a mask, leather suit, and panties so that it triggers a set reaction or have to place KY jelly on a dead man's hands so he'll release a tightly gripped key, players must employ a singular type of logic to surmount the challenges.  Be thankful that a walkthrough's packaged with the CD to counteract puzzlement over the title's obscure quirkiness.  Yet oddities permeate the Rocky Interactive Horror Show from top to bottom.  A grainy, outdated aesthetic style gives it a campy (read: cheaply made) feel.  Cheesy video clips interrupt the flow at set points, allowing actor Christopher Lee to narrate and offer helpful tips or show creator Richard O'Brien to interject bad advice and show off his fruity guitar moves.  MIDI, we repeat MIDI (!), music renditions of famous tunes like the Time Warp play whilst bloody kitchens, rooms of paintings that make funny faces, and boudoirs decorated with portraits of musclebound men in Speedos appear on the monitor.  Lackluster and goofy as the visual presentation is, the audio effects are just as off kilter.  Seldom will one hear ambient noises, though phones ring, thunder booms, and doors creak when opened.  All characters are strangely silent, but On-line's attempted to cover their tushies in this regard by bribing fans of the film with three new dance tracks, including the ever popular Time Warp and a catchy number called Science Fiction - Double Feature.  Still, if there's one thing worth complaining about above all else, it's that the hero(ine) makes a stupid ~DUH?~ noise whenever you attempt to do something that's currently not possible, i.e. open a locked door or use an object improperly.  Rated on kitsch value, this product would be a clear cut winner.  But as a game, well, it ain't the tiger in 3D shades' meow.  Singularly non-interactive puzzles, a dated engine, and a plodding pace put Rocky Interactive Horror Show on a level below that of its esteemed peers, even the now geriatric Curse of Monkey Island.  Movie buffs will appreciate the title's eclectic humor, bizarre fashion sense, and devotion to the dark side, though everyone else with cash to burn will find that Dr. Frank N Furter's funhouse is anything but kosher.  -- Scott Steinberg      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Nov 15, 2000"}