{"name": "Sky Odyssey", "name_review": "Sky Odyssey", "ref": "https://www.ign.com/articles/2000/11/17/sky-odyssey", "text": "Developed by Cross for Sony Computer Entertainment Inc. in Japan and published by Activision for release here in the States, Sky Odyssey has pretty much come out of nowhere to be what is just about one of the most original and highly enjoyable titles available for the system. And if it weren't for EA Sports' amazing snowboarding game, Sky Odyssey would take these categories hands down.   The game's biggest drawback is that it doesn't have the outward appearance of something that would appeal to a broad audience that generally look for more violence and destruction in their games. While it is true that there's nothing to be shot or destroyed here and many comparisons have been made to Nintendo's Pilotwings 64, which had a very strong but limited appeal, to miss out on this game because you don't think it's intense enough would be a complete travesty.   Gameplay  A lot of people have been comparing this game to Pilotwings 64 and there's a good reason for this -- The game uses a very realistic flight model that is very challenging, generally slow-paced, and quite difficult to master. The game also has some gameplay modes, such as its Target and Sky Canvas modes that have you flying through targets, doing tricks and other crazy stuff that's very reminiscent of Nintendo's title. But to call it a Pilotwings rip-off or to say it's the same exact kind of game just wouldn't be telling the whole story.   While Pilotwings centered on having the player accomplishing a wide variety of difficult tasks while piloting different types of craft, the Adventure mode in Sky Odyssey has much more specific mission goals and variety in its environments. Instead of just trying to fly through targets and do things just to score points, Sky Odyssey has that same premise but complements it with more specific and realistic mission goals. Yes, scoring points by doing tricks, making it through mission under the specified time and flying through all of the checkpoints will reward the player by giving them better grades for the missions, which will in turn open up the hidden air crafts and upgrades, but it doesn't stop there.   Many of the missions have more of a real-life purpose to them that really adds a lot to their overall appeal. And for the missions that are more or less just point A to point B flights, most of these are spiced up with varied weather effects and terrain that really add a tremendous amount of variety and challenge to them. Some missions will have you battling through gusty winds during a snowstorm to drop off supplies to different camps, while others will require you do navigate your way through the slipstreams of a thunderstorm and land in the cool and calm center. You will also find yourself trying to catch up with a moving train to refuel your plane, soaring through forests and small caves to find ancient ruins, and many other challenging quests.   It's this degree of variety in both mission and level design that really makes this game as good as it is. What's more, everything in the game really seems to matter. When it's windy, you can really feel it in the way the plane controls and the same can be said when the rain or snow is coming down hard. You can really feel the differences between the handling, weight, speed and control of the game's 10 or so different aircraft and the adjustments that you make to the wings, propellers and the like can also be felt. Moreover, the way you tackle each of the missions will change at times depending on the strengths and weaknesses of your craft and choosing the right plane can make some tasks much easier than it would have been with one of the other planes.   Graphics  Whereas the gameplay is something to rave about, the same can't really be said about the game's visuals. Pretty much all of the things that people, whether journalists, developers or game players, have been complaining about with regard to the system's processing capabilities can be seen here. Sky Odyssey suffers from quite a bit of aliasing problems in both its plane models and in many of the 3D objects in the backgrounds, and all of it is even more apparent in the areas where there's drop in framerate when objects are dropping around you.   And going beyond the aliasing and slowdown, there's also a serious deficiency in the quality of textures that you'll see in the game's massive environments. While the areas are brilliantly designed and have some amazing structures and are immensely creative, the ground and object textures are pretty low budget. In fact, some of the textures that you'll encounter close to the screen don't look too much better than the blurry crap that you'll find in all Nintendo 64 games.   Not all is bad here, though. On the plus side, Sky Odyssey makes use of some of the best weather and particle effects that you'll come across in a videogame. The rain, snow and clouds all look life-like and the rain will even bounce off of your aircraft in a very realistic manner. The general effects are quite amazing and really enhance the game's aura and realistic atmosphere. What's more, the game does have some very large and expansive environments, which is probably the reason that we see some of the shortcomings in the other areas.    Sound  On the topic of atmosphere, there aren't many games out there that handle setting the mood of the experience better than Sky Odyssey. The game's background music is some of the most upbeat and inspiring that you'll ever hear and it really does wonders in increasing the intensity and drama of the game. This is really important because the general pace of the game seems slow, but because of the music and what's happening on screen, players will likely be on the edge of their seats throughout their quests. Where or where did this game come from? While we have been giving this game some good coverage, as have other online and print publications, it still hasn't really been given its rightful due. Sky Odyssey is a brilliant game that really belongs in the software library of every PlayStation 2 owner that loves great games. While some may be turned off by the game's lack of violence, as there's nothing to blow up or destroy, the intensity and adrenaline levels that players will reach while playing this game really surpass what you'll ever likely get in a straight action game. Just wait until you have to fly your airplane through some dark and winding caves at high speeds, or up and over a steep waterfall, or down some roaring rapids after your engine has been destroyed, or into a snowstorm with gusty winds to drop off supplies, and you'll understand exactly what I mean. This game is pretty intense and players will likely be on edge throughout each of the various missions that can last well over 10 minutes and come to an end at any moment with one sloppy move. Sky Odyssey is an amazing game and if you're one of the lucky people that have been able to get a hold of a PlayStation 2, you really ought to treat yourself to one of this year's most impressive software titles by buying this epic flight adventure. You won't be disappointed.", "date": "Nov 17, 2000"}