{"name": "Animorphs", "name_review": "Animorphs", "ref": "https://www.ign.com/articles/2000/11/18/animorphs", "text": "Kids games almost inevitably go way, way wrong. The market is typically the entrance level for game designers, and the lowest priority of publishers. Both are very bad for the gamer. Either the designers underestimate their crowd and deliver woefully dull and pointless games, or they bring the bar sky high simply because they haven't the experience of balancing the gameplay. Animorphs is both. It's pat and boring, but also silly in difficulty at times since there's little guiding your path and no real clue to the strategy. If you were a dog, how would you beat a rhinoceros in a fight? I couldn't tell you either, but that's part of the challenge of this game. Features:Change into monkeys, elephants, rhinos, lions, and moreFour levels of RPG adventurePassword SavesOnly for Game Boy ColorAnimorphs is a game that's desperately trying to cash in on the Pokmon and Monster Ranching phenomenon before some new fad comes along. Based on the kiddie books and Canook Nickelodeon show (...Yet another bad Nick game -- didn't I go through this pain yesterday?) of kids with animal powers, the job of the Animorph team is to find and kill (supposedly you just defeat them -- yeah, right) some of the woodland creatures running wild in the neighborhood in order to stop an alien invasion from destroying the world. Ohh, and all of this is a secret too, so don't tell anybody that you're going to change into an animal or save the world -- they might call the cops on you.As ridiculous as the story is, there is interesting gameplay opportunities here. With the ability to change into animals, you might be able to do lots of different things in your world. Scratch that thought -- the gameplay is instead a sickly-looking overhead RPG with turn-based battles. Occasionally, some of the animals' skills are used well -- snake morphs can crawl up walls, fish morphs swim, and bird morphs can fly over the land. However, most of the skills are not used well at all. The little mouse still gets caught in corners and cannot run through most crevices, and it's useless in battle as well. In general, only a few animals are worth keeping in your Poke Ba... er, Ani-Manager screen at all.Battles are witless RPG affairs. Pitting a monkey against a kangaroo or elephant is silly enough, but then you have to contend with the ridiculous attacks. The developers for Scholastic limited themselves to 16 moves per animal, so you'll be seeing stupid things like 'Punch' in the elephant's attack menu. Deciding what attacks should work best is pure trial and error, and is still prone to fail. Is a raccoon's scream enough to pierce the scaly armor of the Hork-Bajir alien creature, or should you try biting the hostile 7-foot tall monster with bladed claws?The balance of the gameplay and design of the interface is unkind, to say the least. Try to escape from an impossible challenge -- say, a rat against a lion -- and the game will more than likely deny your escape. When you die, the game forces the player to re-enter the overly-complicated password, and if you didn't write it down before you lost, you're out of luck. Even searching the town is a terrible chore -- sometimes townspeople need to be trapped in corners before they speak to you, simply because the collision detection is so broken. And most of the doors in the game are locked, but there's no way to know it. There's no sound or message when a door will not open, but with the bad gameplay, sometimes the game doesn't register that you're at the door. Every time, the player has to make multiple attempts to get in, and if that doesn't work, they're up to themselves to assume the door is locked. Ten minutes later, you'll accomplish a tack that unlocks that door, but you'll never know it until you try every other door on the way. One extra nice little detail -- if you accidentally morph when somebody else is on your screen, they'll see you, and it's game over. Thanks, and double-thanks for not letting me write down my password first.RPG gaming isn't what little kids want. It's what bigger kids want, but they can't get it. Instead, dozens of these childish RPGs come out, and they all miss their target audience. In the case of Animorphs, that's just half the problem. It's also no fun to play, with a corny premises and shapeless, ridiculous graphics (A rat and a elephant the exact same size? Makes sense, right?). There's not even a Link mode to test your collected animals against another player. There are a couple side-scrolling mini- adventure levels that give you an opportunity to live as one of the creatures you've captured, but they're short-lived and limited. Then, it's back to pretending, back to dungeon crawling, and back to the rip-off.", "date": "Nov 18, 2000"}