{"name": "Donkey Kong Country", "name_review": "Donkey Kong Country", "ref": "https://www.ign.com/articles/2000/11/23/donkey-kong-country-8", "text": "original release on the Super NES revitalized the system in a time when the game system transition was heading from 16-to-32 bit. It was a technical marvel for its time because it was using graphics at the time never before seen in a videogame. The game utilized computer rendered images (coined by Rare as Advanced Computer Modeling) for 100% of its sprites and backgrounds -- they weren't 3D graphics in the videogame sense, but the effect was amazing. Rare produced an extremely deep, detailed platformer with a ton of variety -- not only did the game look good, it was a whole lot of fun to play.  The Donkey Kong Country series isn't particularly new to the Game Boy platform, as Rare produced three spin-offs for the black-and-white handheld as Donkey Kong Land. But this is the first time an entire Super NES title has been converted from the 16 bit hardware to the 8-bit Game Boy Color system, and what a challenge it was making the SNES original look somewhat decent on the 11 year-old system. Rare's Game Boy Color team succeeded in this task, even with the heavy system restrictions -- despite some visibility and collision issues, this game is near-identical in play to the outstanding platform game that hit the market six years ago. And what's more, the gameplay still holds up as a fantastic action title.   Features Rendered 3D graphics Direct port of SNES version All new bonus levels Game Boy Printer support Link cable support for two players Only for Game Boy Color  In the game, Donkey Kong and Diddy Kong are out to rescue their stolen banana hoard from the evil gator K.Rool -- and you will control either primate to get through all the levels in the game. Donkey Kong is a stronger heavier character which makes him a key player in taking out the muscular crocs, and Diddy Kong is a light but spry monkey that can move a tad faster and jump a little higher. In the SNES version, both characters are on-screen regardless of which one you're controlling, but in the Game Boy version, the other character sits in a reserve. When a character takes a hit, the other primate leaps out of the reserve and takes his place, but you can also switch between the two by hitting the Select button. If both characters get knocked out, a life is lost and it's back to the beginning of the level.  The world spans over many different parts of Donkey Kong's jungle, from the trees to hidden mineshafts, even underwater. And it's not all just running and bouncing on heads, either -- the game has a ton of variety in its level layout. In some rounds you'll ride a runaway minecart, and in others you'll have to trigger Stop/Go switches to keep indestructible rock creatures from coming to life (the latter offering an impressive lighting effect from red to green and back again). Each level in the game is a straightforward conversion from the SNES game, so if you've played through the 16-bit edition there's not going to be much change in the quest on the Game Boy Color.,  And in structure, there isn't much missing from the translation other than a more vibrant color palette and a rich musical score. The graphics and sound do take a serious hit, but let's be realistic -- the Game Boy hardware was released way before the Super NES. Sprites have been reduced to four colors, and the backgrounds only have, at most 32 colors in each level. But this just proves that Donkey Kong Country wasn't just about the presentation, it was also about the gameplay that made it such a special design. Regardless, the Game Boy Color development team worked with what they had, and managed to keep the CG look in the restrictive graphic capabilities, and the overall music score in the dinky 8-bit sound chip.  But of course, it wouldn't be right for Rare to offer a ~simple~ conversion, so the team threw in specific trinkets that would appeal to the Game Boy Color owner. Two minigames have been included to the design. One's ~whack-a-mole~ style sniping game where you continuously shoot bad guys with a coconut gun -- it's easy to begin with, but later levels have you playing a ~Game and Watch~ game where DKC characters are walking across the screen, and you'll have to plug holes with coconuts. The second game is even simpler in design but actually pretty fun -- a fishing game where you'll have to yank up as many fish in a group as possible and dump 'em in your boat. In two-player mode (with a link cable), it's all about grabbing combos of fish to screw the other player's time. It's not exactly Tetris, but it's got some appeal.  There are some issues with the conversion -- most importantly the scale of the characters versus the viewing area -- the developers wanted to keep as much detail to the characters as possible, so the area of the screen is much less than what was on the Super NES game. This causes problems with some levels since, in the GBC game, you can't see what's above or below you, where in the SNES game you could see a little further down the road. Another issue is in the collision detection -- I've had problems where bouncing on a tire actually killed me because there was a snake too close to the bounce...even though he wasn't in ~touching~ distance.  But the problems are very minor compared to all the good stuff you get in this game. It's not as ~perfect~ as Super Mario Bros. Deluxe, but Rare's latest performance on the Game Boy Color is an outstanding one.   I'll admit that I miss the outstanding music of the SNES game, and the graphics aren't as fantastically impressive as they were on the 16-bit system, but the Game Boy Color version of Donkey Kong Country is just fabulous -- sure it was about the look and sound, but it was also about the gameplay, and this is where the portable DKC shines. Tons of bonus games, tons of levels, a handful of minigames, link cable modes, printable pictures, and three save file locations -- Rare went all out on this title. It's definitely a must-have, and it also shows that Rare's gone a long way to show that it's serious about the Game Boy market now. GBA, here we come.", "date": "Nov 23, 2000"}