{"name": "NFL GameDay 98", "name_review": "NFL GameDay 98", "ref": "https://www.ign.com/articles/1997/08/27/nfl-gameday-98", "text": "The NFL GameDay series has always been a strong sports series. But NFL GameDay '98 has done something that no other football title for the PlayStion has ever done before. It's made the technological leap from sprites to polygons. And we have to be honest, we thought this would make the game slower. We were wrong - this game turned out awesome.  GameDay '98 is equipped with all the necessary bells and whistles. Accompanied by all the licensed logos and stadiums, NFL GameDay '98 comes complete with updated stats and rosters.   Now when it comes to graphics, Sony has spared no expense. On-field polygonal players look and move true to the field. It's so real that the players are almost identical to their NFL counterparts. For example, Brette Farve has a cannon of an arm, Barry Sanders can juke and cut better than anyone, and Jerome Bettis is, well, big. Each player possesses different strengths and sizes which gives gamers a proper NFL gaming experience. It's hard to believe that this is just a game.  But besides the crispy clean polygons and the awesome tackling sounds, NFL GameDay '98 has some of the best gameplay we've ever experienced. As well as having the total control passing from last year's version, Sony has now improved on its tackling features. By tapping one of the buttons rapidly, you can actually battle a defensive player in a tackling competition. So if you are running towards the end-zone, and Junior Seau comes out of nowhere to take you down, you can break his tackle and successfully score a touch down. However, if you're not fast enough, well, Seau is gonna make you cleat-meat.  All in all, this game has a user-friendly interface that would appeal to any football gamer on all levels. We highly recommend it to first time buyers and to those who are avid football lovers who want a good sports title. NFL GameDay '98 is the game to get.", "date": "Aug 27, 1997"}