{"name": "Napple Tale", "name_review": "Napple Tale - Alisia in Daydream (Import)", "ref": "https://www.ign.com/articles/2000/11/23/napple-tale-alisia-in-daydream-import", "text": "Let me tell you the tale of Alisia, and how she got herself into a giant pickle of a dilly one summer night.  Alisia, or Poach as she's known to those around her, was an inquisitive girl, full of cheer who loved to eat her mother's stew.  It was the night of the great Summer festival, and Alisia was running late as she dilly-dallied by her plate.  Her friends would wait no more outside her home, and headed off for the festival, leaving her alone.  Poor Alisia had to run after them - and that's where things began to go horribly wrong.Straynup, a beginner assistant or ~Tamaguide,~ was also running late that night.  ~I'm late!  I'm late!~ he cried out as he flew towards the Summer festival grounds.  Straynup was under assignment, or so he believed, to receive someone called Poach from the festival.  From there, he'd take Poach to his homeland, Napple World.  This world apart from reality is an entry point to the Deep Dream World.  It's a passing point as people make the journey from the living world to the world of the dead (presumably the happy world of the dead, as opposed to the scary one).And so, through a misunderstanding and an odd string of events, fifteen-year-old Alisia found herself brought to this Napple World at the hands of Strainup.  Of course this was a mistake, as the two discovered upon speaking with the pastor at the Napple Town church.  Alisa learned that in order to return home, she would have to find the six petals of her existence which had been scattered about the land and were being guarded by powerful bosses.  A whole lot more than she had been counting on when going to the festival that night.While the story for Napple Tale may result in the most  clich of videogame concepts, the same cannot be said for the game itself and its surrounding world.  Part RPG, part platformer, Sega, developer Terafan and producer Chime have brought us an unfortunate gem - a game with a classic  gameplay concept that will appease the hardcore gamer, a fail-proof premise that will charm all, and a definite quirkiness that will ensure a tough trip over from Japan to America.Gamers screaming for traditional gameplay will love what they see here.  Napple Tale's fourteen stages of play are primarily of the 2.5D variety, which means 3D graphics adding spice to single direction scrolling.  Think of it like Crystal Dynamic's Pandemonium, only Alisia has limited freedom of movement into an out of the screen as well.  The developers explore the gamut of gameplay concepts that we've seen before, from moving platforms, to well-timed jumps over moving objects and wide chasms.  Additionally, you'll find a few clever switch-based and word-based puzzles. It may sound like standard stuff, and much of it is.  However, the levels are arranged to perfection and feel like the result of much planning.  They also feature a few non 2.5D sections.  Boss encounters take place in large free-roaming arenas, and are as imaginatively constructed as the NiGHTS bosses.  You'll also find a few mini games here and there, and some fun diversions, like mine cart rides and an awesome multi-path roller coaster sequence.  Also worth mentioning is the progression of level complexity.  Although the game never becomes overly difficult (I presume it was designed at the perfect difficulty for the little kiddies), the levels grow more complex and lengthy as you progress - by the end, even experienced gamers may find themselves slowing down so as to not die.Control over Alisia throughout the levels is flawless.  The game is never cheap in taking advantage of perception problems in order to make you fall to your death.  Alisia's jumping carries her far enough most of the time, and it's clear when you can and cannot make a leap.  Alisia encounters enemies throughout the levels, who can be struck via her magic wand (I think that's what it is).  If you aim correctly, it's possible to create a chain of enemy kills - this isn't used in the game all that much, but it always makes one feel like a platforming king.The smooth platforming levels aside, what elevates Napple Tale above a mere nostalgia lesson is its wondrous fantasy setting.  Napple World and its surroundings constitute one of the most well thought out worlds ever seen in a game.  Take Napple Town and its populace, which consists of a combination frog-car (he's the mayor), an old lady who seems to be a witch, a man-cow who works at a bar and serves milk and more.  From the moment Alisia steps into this world, one gets the feeling that she's entered a dream - although, according to the story, this is just the passage point to the Deep Dream World (probably the moment right before REM sleep).The Napple Tale world is divided into four separate seasons as part of the story, and the levels of play contained in each section reflect this.  In Spring, winds pick Alisia up and carry her to higher ground.  Fall levels feature acorns tumbling down slopes at Alisia - these are replaced by snowballs in the winter levels.  Although the game is a bit underwhelming in the graphics department, with some unsightly pop-up and texture problems, when it comes to graphics design, Sega again shows its talents.Each section of the world, and just about every surprise, it seems, carries with it its own theme music.  Sega drafted award-winning Japanese musician Youko Kanno to head up the charge of creating the game's 70 music tracks, and the resulting range of sounds, from peaceful, relaxed classical pieces to more bouncy stuff become an integral part of the game, something that Smilebit recently achieved with the Jet Set Radio soundtrack.  All the themes fit their area of use flawlessly.  If you import this game, be sure and take note of a conversation between Straynup and Alisia where Alisia reveals that she can hear some of the background music for herself; the music is a part of the game's world. Best of all, this world isn't just whimsical background fluff stringing together the platforming action.  Napple Tale is referred to by Sega as an RPG, because it's heavily quest-based.  In order to progress, Alisia must explore Napple Town in full 3D and interact with the wacky townsfolk.  Usually, this will start her off on a quest which will lead to the recovery of a petal, but in many cases, the quests are optional (this whole chatty chatty part, by the way, is one reason why this game shouldn't be imported unless you understand Japanese, or unless you've found a good walkthrough).  You end up going through the 2.5D levels multiple times, occasionally finding a new path.  Thanks to their elegant design, going through these levels multiple times is more delight than tedium.  Plus, you can pick up coins along the way which can be traded in for goodies such as artwork and music cards.A few of the quests are based on one of the game's more peculiar gameplay systems - its helper, or paffet (or puppet, as some have suggested) system.  Alisia obtains various items in the levels of play which can be split up into elements.  By collecting so-called recipes, Alisia learns how to combine the elements into ~Paffet~ creatures, of which there are two kinds - the kind that serve as decoration for the Napple Tale world, and the kind which can be made to follow Alisia around throughout the levels.  The latter kind can be used as assistants in zapping enemies, reaching hard to reach platforms and a variety of other effects.  Some quests will ask that Alisia assemble a recipe for a given character - it seems that everyone in Napple Town wants a Paffet decoration in their home! The game is slowed down by some of these RPG elements, unfortunately.  Characters seem to go on and on explaining background story - I sometimes found myself wishing the game would progress a bit faster.  The helper system also amounts to a lot of waiting, usually for useless items.  This system is a bit too overdone in the game proper, and even if you obtain most or all of the extras, of which there are many, you probably won't make use of your helpers that much.But even with these tiny flaws, you can't help but feel that you've entered a magic world when playing through Napple Tale.  The amazing world, oddball creatures and numerous moments of humor and surprise seem to take root in Alice in Wonderland.  The 2.5D platforming levels are designed with just as much attention to detail - their elegant design is the equivalent of the elegant storytelling which can be found in the Lewis Carrol classic.  Seeing as how Alice's adventures in wonderland have been translated throughout the world and read by children everywhere, shouldn't the same be said of Alisia's?-- Anoop Gantayat wishes he had a death god following him around and keeping him out of trouble.  He'd also like to point out that this game was designed by women (as mentioned at the game's official web page), meaning that Sega has no less than three awesome female game producers working on Dreamcast games.", "date": "Nov 23, 2000"}