{"name": "Ready 2 Rumble 2", "name_review": "Ready 2 Rumble Boxing: Round 2", "ref": "https://www.ign.com/articles/2000/11/23/ready-2-rumble-boxing-round-2-2", "text": "As a first generation Dreamcast title, Ready 2 Rumble Boxing was typical of many Midway games; great visuals, lots of style, but low on gameplay depth.  That's not to say that R2RB didn't play well; it had good controls and a decent amount of boxing attacks.  But the simple ~walk back and forth~ gameplay mechanics, low difficulty and shortlived nature made it a tedious videogame experience after a couple of hours.  And now we have Ready 2 Rumble Boxing: Round 2 and from every angle, the game seems to be improved.  You have more boxers, better-looking visuals, new gameplay mechanics, and even more humorous gags.  But like an old hoopty you try to modify with new tires, exhaust, spoiler, and other neat gadgets, it's still the same old hoopty at the core of it.  And that's the bottom line with Ready 2 Rumble Boxing: Round 2; it's a lot of fun and a whole lot of laughs, but it'll get old as quick as the first one.  Select from over 20 boxers (12 to start, the rest you have to unlock), and pummel each and every opponent.  Like in the original, you have four basic punches - low left, low right, high left, high right  and block both high and low.  And like in the old version, you can do special attacks and combos by combining button and D-pad commands together.  There is a very simple combination pattern that really doesn't allow for much freedom in creativity.  And from time to time, if you connect with a powerful blow you'll get a letters that will eventually spell ~RUMBLE.~  Once you spell the complete word, you can activate Rumble Mode allowing you to pummel your opponent with faster and more powerful punches.  Rumble Mode has been slightly altered in Round 2 where you can actually ~charge~ Rumble Mode by spelling the ~RUMBLE~ three times consecutively.  A level one Rumble Mode gives you a faster punch rate, while level two increases your rate and adds more power to your blows. Finally, level three Rumble Mode is so powerful, one punch will knock your opponent out of the ring!  Though a level three Rumble Mode sounds unfair, it's pretty hard to execute on the improved AI, let along a human opponent.  Add to that a parry technique that allows you to knock punches aside (with the right timing) and it seems like Round 2 is ready to rock.  In the graphics department, the game is certainly solid.  Though there are some suspect collision problems, especially with ~large and in charge~ characters, the game looks very good.  Round 2's real visual strength is the style and humor.  Whether it's the ridiculous size of Mama Tua, the comedic expressions of Afro Thunder, or the way Michael Jackson's face becomes more akin to a bruised plum after severe punishment, this game is entertaining to watch.  Animations are pretty well done, but I'm surprised that Shaquille O'Neal probably has the least animation out of all available characters.  Maybe he's just too tall or something, but he doesn't seem to animate quite as well as the rest of the cast.  The few and far between special effects, mostly consisting of motion blurs, flashing gloves during Rumble Mode, and those kinetic lines of energy seem over-the-top at times, but then again, this game is all about being over the top in style.  Ready 2 Rumble Boxing: Round 2 definitely has enough style to go around and packs enough visual punch to impress.  So if Round 2 comes with improved visuals and better gameplay, what's wrong with the game?  I love the humor and the style but despite the added gameplay elements that do improve the game, it's really the same game as Ready 2 Rumble Boxing.  Even though the AI is improved, it's still all a matter of walking back and forth and sneaking a blow here and there.  There should be more freedom in combinations, because doing preset combos over and over again gets tedious very quickly.  Everything just feels like the same game I played a year ago, though the Championship Mode, which has been improved from last year's version, contains some fun mini-games. Finally, playing against another human player certainly extends the life of a game.  But in the end, Ready 2 Rumble Boxing: Round 2, though improved from the first, will provide only a few hours of thrilling boxing matches.  --Anthony ~Faster Than Lightning~ Chau, IGNDC If no other systems or choices were present, the N64 version of Ready to Rumble: Round 2 would make a great addition to any gamer's library. The game takes the already tried and true formula of fast and carefree arcade boxing and adds new characters, new animations, new voices, and new multiplayer modes. If you already own the first title and have since lost interest, then this sequel is definitely not enough to entice you for another purchase. If you are a true fan of the series, then perhaps give it a good weekend rent before you remember why you ended up putting the game down in the first place.But for those who are new to the franchise, lacking any other next-generation systems, and interested in a fun dose of wacky personality-packed boxing, then consider this sequel to be even better than the original and worth checking out. If anything, you'll enjoy beating the tar out of your friends repeatedly and watching your character shuck, jive, dance, and taunt his way across the screen over and over again.", "date": "Nov 23, 2000"}