{"name": "Pirates of the Caribbean: Aegir's Fire", "name_review": "Pirates of the Caribbean: Aegir's Fire Review", "ref": "https://www.ign.com/articles/2008/04/10/pirates-of-the-caribbean-aegirs-fire-review", "text": "Disney's Pirates of the Caribbean: Aegir's Fire sends you on an adventure across pirate-filled seas, running errands for landlubbers and sending rival ships to meet Davy Jones. It's a breezy action game designed for the casual crowd, and that's not meant as a knock. There is something charming about a game that knows its audience and pursues them with an attractive, playable experience. So while a more hardcore gamer might go tired of Aegir's Fire within a hour, a casual gamer -- or a Pirates of the Caribbean fan -- might be pleased as all get-out just to sail the oceans with Jack Sparrow.   Aegir's Fire immediately reminded me of the sailing scenes in Sid Meier's Pirates!, a game that will likely remain in my personal top 20 until the day that days are no more. Using the click wheel, you steer your ship through the water, avoiding storms, whirlpool, and sandbars. Plus, you must always avoid the deadly Kraken, which rockets through the waters. When you come within range of another ship, you can either use the wind to hastily escape confrontation or sail right in and start lobbing cannonballs. Sinking ships results in more doubloons, the currency of the pirate realm. Controlling the ship is easy -- the click-wheel is a good fit for Aegir's Fire, so there is no interference here.   Aegir's Fire unfolds as a series of errand-based missions. Somebody in a port will offer a job that usually requires either fetching an object or sinking a ship; and, quite often, sometimes both. In port, you can select different crewmembers -- all cast members from the movies like Will Turner or Captain Barbados. Each crewmember has an individual talent, such as increasing the speed of your ship, improving resistance to attacks, or hastening your rate of fire. You can slot three crewmembers on your vessel. I'm not entirely sold on how useful this feature is, as I had a difficult time really seeing a difference in my turning ability or speed depending on my crew additions.   Customization does not end with your crew choice. With your acquired doubloons, you can buy better ships, including the Black Pearl. Splurging on ships, however, siphons money that can be used on an array of cannonballs. You have an endless supply of the most basic cannonballs, but must purchase upgrades, such as gold or copper cannonballs. The upgrades wade into fantasy territory, too. Ghost cannonballs rip through armor. The freeze cannonball encases a rival ship in ice, stopping them cold. The atomic cannonball (yeah, I know -- atomic?) is a megaton attack that can sink an entire ship with just one shot. The more powerful the cannonball, the costlier it is. While on the seas, you can quickly switch ammo by pressing up on wheel and then spinning it to select ammo from your stocks. It's an easy system to use and, like all other menus in the game, its quite attractive.   As you run more missions, you unlock more territory. The game starts in the Caribbean, but soon stretches to Africa, Europe, and Hawaii. There's a considerable amount of real estate to explore in Aegir's Fire, but the variety is not exactly stunning. The hardcore gamer in me started drifting after a couple hours, especially as the mission variety was revealed to be very limited. However, the casual half saw how this could be an enjoyable game to check in every once in while, especially during a dull plane trip.   Aegir's Fire employs considerable production values. The game looks fantastic, thanks to bright, colorful graphics and good sprite work. The game also uses a lot of assets fromt he movies, such as actor portraits. You'll be sailing with the likes of Johnny Depp and Geoffrey Rush. The music is also quite good. More iPod games are coming with soundtracks that deserve preference over your own music library.  Admittedly, Pirates of the Caribbean: Aegir's Fire does get repetitive after a couple hours -- and that's a serious problem. However, the game's breezy nature and solid controls makes it an ideal time-killer in short bursts. A casual gamer will get a lot more out of Aegir's Fire. And for that audience, the game is recommended.", "date": "Apr 10, 2008"}