{"name": "Final Fantasy IX", "name_review": "Final Fantasy IX Review", "ref": "https://www.ign.com/articles/2000/11/23/final-fantasy-ix", "text": "Final Fantasy IX is here, and all that is old is new again. Square's developers have once again outdone themselves as far as technical execution and visual artistry, building a fantasy world that I could be content to simply stare at, remembering years past when all these things struck an internal chord for the first time and wondering how a game console could hold images this beautiful.This installment of the series has perhaps been the most anticipated among die-hard fans of the series, signalling as it does a brief return to some of the visual designs, gameplay elements and overall spirit of the FFs we grew up on, and they won't be disappointed in the slightest. In that regard, this game combines the finest of the past and present, the fantastic themes of the classic games brought to life by the technology of the PlayStation. In terms of its gameplay and structure, Final Fantasy may be showing its age, or perhaps more precisely a lack of evolution to suit that age, but the series' trademark formula has hooked fans on three generations of consoles now, and it looks prepped and ready to conquer a fourth in short order.Is there RPG life beyond this, though? Perhaps it's a consequence of how quickly it's followed on the heels of Final Fantasy VIII (just over a year passed between installments), but while the nostalgic appeal of Final Fantasy IX is undeniable, it's mirrored by a less pleasant sort of deja vu. How much of this is truly new, and how much of it is merely time-tested, as it were? A question to while away the hours with, I suppose. New or old, there's still only a small selection of RPGs, past and present, that can compare.GraphicsTo begin with, credit must be given where credit is due, even if I can't imagine how to properly describe the look of Final Fantasy IX. The graphics in this game defy hyperbole. Remember when you were trudging through the third disc of Final Fantasy VIII, things were going a little slow, and then all of a sudden you were in Esthar? If you were me, your jaw hit the floor. The visuals suddenly took a flying leap into an entirely new level of creativity.In Final Fantasy IX, that same thing happens every time you come to a new area. Every single time, you're presented with something entirely new and beautifully rendered, to the point where you almost develop a tolerance to it. ~Oh, dear, not another extraordinarily well-realized fantasy realm. That's the fifth one this disc...~ Each time you think you've seen it all, though, Square tops themselves once more. The cusps of plot that accompany each change in disc present cinematic sequences that will leave you either picking your jaw up off the floor or trying to remember where it was your soul disappeared to, and eventually, by the end of the third disc, you'll probably just quit bothering to pick your jaw up, regardless of whether or not it'll leave a stain on the rug.Square has done about as much as they can with the PlayStation here. The realtime battle scenes are remarkably faithful 3D recreations of the corresponding pre-rendered areas, and as far as smoothness and refinement are concerned, the spell effects are as awesome as we've come to expect, and the character animation in and out of battle easily compares to the current crop of Dreamcast RPGs. Your super-deformed party has its own wide array of charming motions, and every monster, from the tiniest Cactrot to hulking Behemoths and Iron Men, is superbly designed and animated.The pre-rendered backgrounds, meanwhile, are so exquisitely drawn as to push the limits of the system's resolution, forests and cities and otherworldly realms filled to the corners with beautiful artwork, interactive elements, little bits of animation and huge swaths of movement laid over the backgrounds, and on and on. Most of the areas have to be seen to be believed - there is not much more detail that can be stuffed into a TV screen at this rate. But put those rendered scenes in motion and there seems to be no upper limit to what their 3D artists can do with the nearly-unlimited resources of their workstation systems (aided by some very fine compression algorithms, which result in superb video quality). The cutscenes in FFIX have a marvelously exciting immediate impact, and they're another massive step forward in the quality of facial animation and character behavior, conveying emotion even more effectively than VIII's already expressive CG.In part, though, that's thanks to the character designs, which physically express a broader range of emotion to begin with. Yoshitaka Amano, as you no doubt know, provided the fundamental visual designs for FFIX, bringing his refined, ornate sense of the fantastic, and that in turn was deliberately strained through the super-deformed style that the earlier Final Fantasies embraced as a matter of both choice and necessity. The ramshackle Brothers-Grimm quality of some of the town sequences perhaps result from this change in style, but the characters are where you'll notice the real change, a motley crew of designs that range from the fanciful to the utterly bizarre.CharacterPerhaps the best thing going for Final Fantasy IX as far as character is concerned is the presence of a proper villain, especially in the later movements of the story. Kefka, from my point of view, was the last FF bad guy to really sink his teeth into the role. Sephiroth was certainly a good-looking fellow, but his motivations were about as clear as mud, and Final Fantasy VIII hardly had a villain at all. There was that sorceress everyone was going on about, but she spent the balance of the game merely being talked about behind her back. Kuja, on the other hand, who represents the forces of evil in FFIX, does his thing quite impeccably, blending a little of Kefka's cackling villainy (always a reliable shtick) and plenty of the bishonenosity that made Sephiroth such a hit with the ladies. There are some interesting reasons behind why he's such a miserable bastard, and in his peculiar way he's one of my favorite visual designs of the series - the realtime model may look a little funny, but check him out in the pre-rendered cutscenes, particularly in his second appearance.All the rest of the characters are a treat - visually, if nothing else. Their basic traits and arcs of development aren't necessarily anything you wouldn't encounter in earlier FFs (or any kind of literature in general, for that matter), but they're engaging and sympathetic nonetheless. The charming thief Zidane Tribal breaks the streak of reluctant Final Fantasy heroes, injecting a touch of redder blood back into the series. Princess Garnet, the female lead, teeters on the edge of falling into chick-who-gets-saved hell, but she manages to crawl back from the brink with a few strong moments, and she looks great with short hair. Her guardian knight Steiner does ~lovable dumb lug~ to a tee, and watching him clank when he walks always inspires a smile. Quina Quen deserves a mention simply for being the most original RPG character...ever? Well, what else do you say about a towering clone of Puyo Puyo's Parara, with a gigantic tongue and a puffy chef's hat? Speaking of which, the returning Moogles deserve a mention as well, serving as your save points and a source of welcome comic relief. Vivi, meanwhile, is Vivi. The Black Mage design is classic, and discovering a charming personality underneath the big floppy hat is a welcome change after all those years of inscrutability. His evolution may be a bit predictable, but I still love the little guy. Just in my nature to root for the underdog.That I can develop that kind of a feeling for the characters is a testament to how good Squaresoft's localization staff has become. This is arguably as good as an English script has gotten in an RPG, just in terms of flow, readability, and coherent voice - yes, I realize we've said the same thing about Chrono Cross, Legend of Mana, and Vagrant Story already, but it is done that well. To finally see such consistently professional, polished translations puts to rest one of the nagging problems RPG fans grew accustomed to over the years. Finally, we don't have to settle for second-rate text in our games.GameplayAh, yes, this is a game, isn't it? One can forget that at times, after a long while working one's way through Plot, but you'll be called upon to test your brain and your reflexes through Final Fantasy IX's dungeons and battle sequences. The past revival that characterizes the visual style of the game carries over somewhat into its combat and development systems - if you've played anything earlier than Final Fantasy VII, you'll probably be able to place a few gameplay elements from back in the day.The party size, for example, is up to four, just like the first game (if memory serves, Final Fantasy IV was the first installment with a five-character party), and the five equipment slots signify a return to the more complex equipment system in the earlier games as well. The handling of Summon monsters, here called Eidolons, bears a strong resemblance to the Espers from Final Fantasy VI, and the loose class-based structure is a little like Final Fantasy IV - the characters are people first and foremost, but you can still pick out archetypes like the Summoner, the Black Mage, the Dragon Knight/Lancer, the Knight, and so forth, although Quina fairly defies categorization.The system of ability development follows the same line of descent from FFVI as the other PlayStation FFs. In this case, you acquire abilities from the items you equip, attaching those abilities to your character by way of a set of Blue Crystal slots, which you gain as you increase in level, and eventually getting to keep those abilities independently of the associated equipment, once you've acquired the requisite amount of Ability Points. Abilities run the gamut from spells to special attacks to passive defenses and immunities, and different abilities can be learned by different characters from the same item of equipment, so one of the more interesting aspects of development is shuffling around your characters' equipment not just according to its immediate effect on your statistics, but also what skills the characters can learn. It's a good system, especially taking into account the more traditional item acquisition that the series has returned to. Once again, the treasure chests have cool stuff like Genji Gloves and Ultima Swords and Aegis Armor, instead of just Bolts and Fur. In a simplified holdover from FFVIII, though, you can make new items from old at synthesis shops located in several towns.This is, then, another Final Fantasy, with some fun new evolutions added to the traditional gameplay model for a little variety. Actually, let's look back at all the different ways Final Fantasy has evolved over the years, changing this and that between each new game. Please keep in mind, of course, that most of this is coming off the top of my head, so do cut me a little slack if I miss things by an installment or two. The point will carry through anyway. So let's see. The series moved from turn-based to Active Time battles in Final Fantasy IV, I believe. Summon monsters were added in III. The AP-based skill evolution system was added in VI, and mutated into the various skill systems in its three successors - before that, there was the brief flirtation with the complex Job system in V. The battle system fiddled around with various twitchy elements in VI and VIII. The series developed serious plot and character (as opposed to ~nameless heroes go kill Garland~) around III or so. Of course, there was the evolutionary leap in graphical style from VI to VII, and the addition of the pre-rendered cutscenes that have become a series trademark. In IX, there's another new ability development system, and the addition of the Active Time Event system is a neat way to make cinematic sequences a little more interesting.So what hasn't changed, over this illustrious history? I'll answer that with another question. What happens in a dungeon every twenty seconds or so?Random battles. Since the series' inception, Final Fantasy has never strayed from the basic, Dungeons & Dragons-inspired device of completely random monster encounters, springing enemies on you with regular frequency in areas that are deemed hazardous. This needs to change - if I hear that classic ~whoosh~ coming out of nowhere, followed by swirly colors and the traditional battle theme, on PlayStation 2, there will be a flood of curses laid down upon the demons of lazy game design. Chrono Cross, Chrono Trigger, Valkyrie Profile, Lunar, and many more games have all shown, to varying degrees, how to implement a more intelligent and less frustrating encounter system, gradually eroding the excuse of ~that's how Final Fantasy is.~ FFIX is particularly aggravating in this regard because the encounter rate occasionally spikes up to Tales of Destiny levels, which is a ridiculous obstacle to have to deal with when you're trying to clear your head and calmly work through one of its intricate puzzle-box dungeons. The slow pace of combat is aggravating as well - one of the IGN PC editors stopped by for a moment during an FFIX battle and observed ~You do a lot of waiting in this game, don't you?~ I would not necessarily mind fighting a great deal, since I have in fact played RPGs with enjoyable combat systems (Chrono Cross and Valkyrie Profile spring to mind), if only it were a little better-handled. As it is, fighting so many lengthy battles against the same enemies over and over hampers the enjoyment of many dungeon sequences.It strikes me that, as the divider between the ~Gameplay~ and ~Cinematic~ sections of Final Fantasy becomes ever more sharp, some serious effort ought to be made to make the former more than just the barrier that stands between you and more of the latter. The combat sequences are beautiful to look at, but so many areas possess so little variation in terms of opposition that the novelty wears off well before you run out of encounters to fight through, and so what's left is essentially just a chore to be completed.SoundMusically...hm. After the kind of soundtracks that Square has produced in the past three years or so, it takes something pretty special to establish a new high-water mark, and Final Fantasy IX, while at times inspiring, relies on one or two melodies for its best notes, and it features a few tracks in key moments that I flat-out did not like. The final battle music is the prime offender in that regard, but I didn't find the world theme or the flight theme particularly suitable either, and the new battle theme goes off in more uncertain directions after a very strong beginning. The general character of the music is unpleasantly light and bodiless - for an epic adventure, the soundtrack takes an awfully ambient tack much of the time. ~Melodies of Life~ is a suitable one for plucking on the heartstrings, though, and it supplies the base for many of the better BGM tracks (you can pick out its melody in at least three different ones). I'd also be remiss if I didn't mention the presence of the famous Crystal theme, both the original version and a beautifully dark minor-key adaptation, which I could listen to for hours.What's a little unnerving about FFIX is that, after several Final Fantasies in succession, you can start picking out the Tinkertoys.  What I mean is, you can see the plot and character elements being recycled from previous games.  This is obviously something I can't talk about in detail, but there are elements obviously drawn from VI, VII, and VIII all through the plot of IX, and if it hadn't been eight years since I played IV, I could probably pick out a few common threads there as well.  No, wait, I take that back, nailed at least one lift from IV. It's not on the scale of something like the anime references in Xenogears, where you could fill a book-length concordance with all the familiar moments, but it's enough to make me wonder whether Square couldn't be better served siphoning off a little of the CG budget and beefing up the scenario design staff.  FFIX is uncomfortably familiar in terms of narrative structure as well as narrative content.  Like the previous PlayStation FFs, and to a lesser extent the series in general, events progress in a particular way - up until the wide-open rose-smelling sections on the third disc, you move predictably from chapter to chapter of the tale and don't deviate particularly far from your path.  Lengthy sections of the game up through that point are thoroughly noninteractive, too, as you tap the X button through scenes of dialogue or wander about towns looking for the particular characters and items that will push the plot forward.  On a larger scale, you battle your way through part of the plot, get the ship, sail to the other continent, explore more of the plot, get the airship, encounter the pre-climactic bits, get the run of the world to build up your levels and equipment in preparation for the final battle, and then proceed to the endgame.  The previous sentence could describe VII, VIII, or IX with equal precision.Final Fantasy could go on forever re-creating its particular spin on the traditional heroic quest, and it would be a success every single time, but I can't help feeling as if something that features this kind of majestic visual craftsmanship ought to host a story built with equal care.  I recognize the value which these conventions hold for both Square and the series' legions of fans, but in the words of a great philosopher, overspecialization leads to death.  There's going to be a point one of these days where the formula won't necessarily work anymore.  There will come a day that beauty will finally prove to go only skin deep.  This is the last Final Fantasy on the PlayStation, and a brave new world of next-generation consoles awaits, in which the destination of Square's flagship series remains uncertain.  What is Final Fantasy X going to be - a leap ahead like Final Fantasy VII was, or more of what we've seen on the PlayStation?  What on earth will Final Fantasy XI be - if it follows its current trend, it may very well be the most amazing game that no power in the world will be able to make me play.Eh, probably just me getting old again.  The fact of the matter is that there has never been a Final Fantasy that delivered less than your money's worth of adventure - not now, and probably not ever - and I can't see any Final Fantasy fan experiencing any disappointment at the end of their experience with Final Fantasy IX.  Its conclusion may not be the most original you could conceive of, but it's no less satisfying for that.  Perhaps I just need to sit back, relax, and remember how I used to feel when I played these games.  It was a long time ago, and I was a rather different person then, but reliving the good old days is more than half the point of FFIX.", "date": "Nov 23, 2000"}