{"name": "Championship Surfer", "name_review": "Championship Surfer", "ref": "https://www.ign.com/articles/2000/11/28/championship-surfer-2", "text": "Finally, somebody with a clue about surfing has made a surfing game. Australian developer Krome Studios and Mattel have hooked up to bring gamers what seemed like a technical impossibility one year ago, a surfing game. That's right, real waves, fast, twitch-action, slash-and-snapback goodness, and the kind of spontaneity that real surfing brings. I'll admit, I'm kind of a hodad thee days, because I used to surf and simply wanted to lead another lifestyle so I quit, but that doesn't mean I still don't love watching it and remembering getting barreled in 10 foot Zuma waves (and getting crushed inside them).   Championship Surfing is a great little arcade game that brings players a relatively easy to pick-up-and-play concept, along with changing weather, waves, locations, surfers and boards for a glimpse into the sport of surfing. It covers all of the surfing bases better than any other surfing game by a long shot and provides real surfers (Team O'Neill) to select as well as a range of waves and ideal locations. But without a real variety or long-term depth, Championship Surfing is only a good game, not a great one.   Gameplay Championship Surfing is by far the best surfing game on any system, period. For those who are in the know, unfortunately, that's not a terribly brave statement to make. But it is something to be proud of. Krome has done its homework and had knowledgeable folks assist in the making of this game, and one person in particular adds a lot of credibility if nothing else, and that's legendary world champion Mark Richards. When I was a kid, surfing trash beach break at Will Rogers State Beach in Santa Monica, I looked through Surfer Magazine every chance I could and saw Mark Richards in what seemed like 50% of the magazine. I still idolize the bastard, who, in many ways, changed the face of surfing, as a master of huge carves, cutbacks, and mastering the twin fin on big waves before the invention of the tri-fin.   With Krome's game now finally out, we get a look at the kinds of surfing moves that gamers and riders actually perform in this day and age. Championship Surfer brings gamers killer moves that can be mastered without lifting an eyebrow. Back then, aerials weren't even heard of, and 360s? Hah! In Championship Surfer, the basic game enables you to perform all of the basic moves within minutes and then without too much hassle, brings in the bigger moves. Players who get the gist of it, will instantly start carving every wave from top to bottom, slashing and cutting back and began pulling air moves.   There are more than 50 moves and combinations of moves, from the standard carve or off the lip, to variations and modifications of the moves, such as carves to grab rail carves, and trickier moves along the lines of 360s, and carving 360s, or grab rail 360s. Each time a move is performed, players earn points for them. When the move is repeated more than once, players earn points, but not as many as the first time, and less the third time around. The biggest move? Strangely enough, it's simply trying to get in the tube. These waves are fast and they take all prisoners, and getting barreled here is a product of timing and pure skill.   Championship Surfer is a trick-heavy game, to be sure, and you certainly get the chance to surf in competitions against the AI, against real humans, for points, opening up new breaks, or to master burley tricks. Game modes include Championship (tournament-based, single elimination rounds), Arcade (point-based surfing with obstacles and weird missions), Rumble (two-player games), Trick Attack (gain points from individual moves), and Free Surf.   The two most significant modes are Championship, with three difficulty settings, and Rumble, the two- player mode. Championship is deep with repetition. It's quite simple to win in the easy mode, but mastering the Amateur and the Pro levels is tough. Perfecting moves and combos is the kind of depth people want, and Tony Hawk, SSX, and 1080 are the perfect examples of this addiction. But here, believe it or not, the 50 moves don't amount to much. Strange as it may sound, you have the slash, cutback, and rail buttons, and you can link the moves together, but the lack of variety equals a lack of depth in the combo system, which hurts Championship Surfing. Furthermore, depending on how you look at the arcade and two-player modes, if you like avoiding obstacles on your waves, which I personally am not fond of, you may not like these modes. There certainly is a level of challenge in them, but they're also annoying and unrealistic as hell. I mean when was the last time you had to avoiding hitting giant sharks, as many as 15 on one wave, before, hmmm? Sounds kinda kooky, and it's fun in a sense, but it's also annoying as all get out.   So, Championship Surfer is simple. It's an arcade game, and yet it's got one of the best wave generating systems ever seen on a game console. Plus, the ways in which the surfers and their boards react to the waves is amazingly accurate. Perhaps a little exaggerated at times, but still damn accurate. This game is leaps and bounds better than Ubi Soft's PS offering, Surf Riders, and it's 10 times better than PS2's offering, Surfing H30.   Graphics Three things are immediately noticeable in Championship Surfing. First, the surfers are really small. Almost miniscule, which in my mind isn't good. The detail is minute, there are no character faces, and one surfer looks just like the next, with the exception of hair color and a slight change in height. Second, I instantly noticed how smoothly the waves moved. From an isometric perspective (one that can be altered with the R2 button), the camera shows the surfer lying on his or her board, readying to catch a wave, then catching a wave, and then surfing it. The waves are fast moving, and generate from a flat ocean starting point. But you get to see the ocean behind and in front of it. They aren't just giant walls of water. They're real waves being affected by weather conditions, and they don't all ride the same. That's cool. Third, The surfers move amazingly well on their boards. The animation is smooth and realistic. There is nothing quite as sweet as seeing a floating lipper, or a 360 on a wave, or a mid-air 720 with a smooth re-entry. Krome nailed the animation perfectly.   Having, said that, the graphics won't blow you away. (And that's understating it.) Certainly the intro movie is typical, preparing you for some of the best tricks ever competed. And the in-game cut-scenes are, well, horrible; they're grainy, unflattering scenes that may have simply best been cut out. Most of the menus are totally flat screens, with little fanfare or embellishment, but they work. And in the end, honestly, most of the focus was put on the surfing aspects of the graphics, which for a game like this is a good priority to have. So, don't expect a sudden graphic rush. But then again, this puppy is Cindy Crawford compared to Surf Riders' Tracy Ulman affect.   Last and strangely enough, Championship Surfing's waves look better on the PS version looks than on the PC version. In the PC version, the waves are triangular, blocky, and er, lame looking. The PS version has some clipping problems but they look pretty much like the kind of solid, evenly peeling lefts and rights I'd want to surf. Like I said, strange.   Sound There isn't much to report on in the sound department, I'm afraid. The surfers don't say much and so there isn't much in the sound effects department, unless you like the sound of rubber duckies. But the music is cool. While the typical surf trash Hawaii Five-O music is clearly in place here, there is some cool modern music, including techno and other variations that are cool to listen to that don't break your ears.This game, at the time of this writing, is only the third surfing game on any system, and it's by far the best of the three. It's smooth moving and easy to get into the feel of surfing without too much work and it rewards you for improving. But there is a long way to go before surfing games fully mature, or if they ever reach the depth and gameplay levels of games such as SSX and Tony Hawk, and this one isn't a gem of that kind. Championship Surfing is, without a doubt, the first major step in the evolution of surfing games, and hopefully Krome will take this game concept and mature it into an ever greater, more fully conceived game on next generation systems.  But Championship Surfing is still a fun, authentic surfing game that leans toward arcade play and radical moves. The game is fun, but not for too long, like a good two or three days, and while it has a solid two-player mode, it's not going to last you more than a week or two, tops. It's short on depth and variety, and the killer, addictive kind of gameplay prevalent in the best radical sports of this nature isn't rooted deep in its nature. But, if you want something different and radical in the extreme sports arena, you may very well like this. If you just love surfing, this is your meal ticket.", "date": "Nov 28, 2000"}