{"name": "Blade", "name_review": "Blade", "ref": "https://www.ign.com/articles/2000/11/29/blade-2", "text": "Ah, good intentions.  Somebody probably thought a Blade game was an extremely good idea at one point.  The movie had been a reasonable success, as summer action stuff went, and there was a little interest in the character as a result, so Activision probably thought they could hand the property to Hammerhead, fresh off their well-regarded port of Quake II, and get a popular game back.  Or maybe I'm being too charitable here, and the real story is actually more sordid - maybe Marvel forced Activision to produce a Blade product as part of their X-Men licensing deal, they tossed it to one of their second-line development houses, and the resultant lack of any willingness to produce something decent on the part of anybody involved is what resulted in an ugly, late-as-hell game with a lousy framerate and confusticated control.  I dunno.  Whys and wherefores shouldn't be my department.  Just don't buy this.  Graphics  Once you're done laughing at the opening title graphic, a reproduction of the Blade movie poster succinctly Photoshopped to avoid a call from Wesley Snipes' lawyers, your spirits might actually rise a little bit after you start your first game of Blade.  There's a nice little realtime cinematic interlude that introduces the first area, and a well-acted exchange of expository dialogue between Blade and his backup Whistler.  Then you're actually put in control of this world, the game is forced to render the background according to your direction, and you can just feel the framerate going EEEEEEEEAAAAAAAAOOOOOOOOOOO...KERASH!  Overtaxed by the demands of rendering a world full of right angles, dark low-res textures, and a few badly-animated characters, Blade's 3D engine drops somewhere into the teens, if my eye does not deceive me.  What further hinders the progress of our intrepid vampire hunter is, well, darkness.  Yes, I know that this is supposed to be an adventure against creatures of the night and all that.  Atmosphere is one thing.  Inky shadow obscuring your progress to the point where you don't know which way to go is another.  The camera control doesn't help either, frequently whipping in odd directions as you round corners, pulling in too close when you're near a wall, and sticking in inconvenient angles in some areas for purported cinematic effect.  At times, the game's intent to create a movie-like atmosphere works - the cinemas are actually pretty well-directed as such things go - but the parts you have to actually play outweigh their quality by some distance.  Gameplay  Here's an interesting chestnut for you.  Hammerhead developed Blade.  They also did the PlayStation port of Quake II, just before Blade.  Now, what is one of the most important controls in Quake?  Strafing, moving to the left and right while facing in the same direction.  Heck, it's what makes Quake playable.  So why didn't they put that into Blade?  Seriously, there's no strafing in Blade.  The analog stick or D-pad just lets you pivot and run, and the rest of the controls are given up to attacks and item management.  This is mainly a problem in ordinary maneuvering, rather than combat.  Making your way around corners on tight ledges and other enclosed spots frequently turns into a close analog of parallel parking, although speaking of analog, the pressure-sensitive analog stick control makes things a little bit easier.  Combat, though, is almost too easy.  You have ranged and hand-to-hand attacks, both of which you aim with the R2 button.  Hold down R2 and you'll focus on the nearest enemy, be it a policeman, werewolf, vampire, hulking ugly-thing, et cetera.  All your attacks will then unerringly strike them.  A good idea in theory, but it leads to some significant problems in practice.  For one, though your array of weapons is large (lots of guns, swords, fisticuffs, silver shotgun shells, other fun stuff) there tend to be two sorts of enemy encounters.  In one, you see an enemy from afar and kill him with two shots before you pull within his range of detection.  This is fun in a geek-show sort of way, but it's not very challenging, and occasionally it leads me to ponder the unsettling moral dilemma surrounding why Blade, a purported hero, should be popping police officers in the back of the head.  Then there are the encounters where the game tries to make up for how easy it is to kill the bad/good/other guys at times, and just springs opponents with automatic rifles on you right when you round a corner.  *Brrrrrt*, there goes two-thirds of your life bar.  That's where hand-to-hand comes in handy, and watching Blade cut loose with his sword is pretty cool - he has some very well-animated attack moves - but that's also one of the situations when the framerate really takes a nosedive.  Furthermore, the whichever guys have a tendency to clip right through you at close range.   Sound  The voice acting, as I said, is surprisingly well-done, although its kinship to the movie's actors is fairly tenuous.  Blade and Whistler have a funny sort of chemistry at times, and the other characters don't have too many groaner lines.  The rest of the soundtrack is much weaker, though.  The background music seems to consist mainly of MERC Standard Issue techno (as opposed to inspired Ridge Racer/Tekken/Beatmania techno), and the grunt-oof-whack effects don't deviate from the average in the slightest. Brown 3D adventure at its most generic and slipshod.  There might have been the potential for a good game here at some point, but it disappeared some while ago.  The technical problems are considerable, the artistic execution is unimpressive, the gameplay is devoid of original or playable ideas.  Rent Metal Gear one more time, or play through one of the Syphon Filters a second time, or do anything other than paying money for Blade.", "date": "Nov 29, 2000"}