{"name": "MechWarrior 4 Compilation", "name_review": "MechWarrior 4: Vengeance", "ref": "https://www.ign.com/articles/2000/11/30/mechwarrior-4-vengeance", "text": "Let's get one thing straight: when big robots come a callin', IGN is ready. I played the heck out of MechWarrior 2 and MechWarrior 3, so I could hardly wait for the release of this latest version, Vengeance. In many ways, the game is a big improvement over the previous titles. The animations are convincing and the graphics are spectacular. The game also has a remarkably fun multiplayer element. On the negative side, the environments aren't quite as believable and the missions aren't terribly exciting.  But the improvements in the graphics are worth the price of admission alone. Never have the 'Mechs looked this good. I should say rather that there's a kind of rough and dirty 'Mech look that I don't really find attractive, but it's certainly done well regardless of what you think of the style. The 'Mechs are also pretty easy to identify from a distance (although the targeting computer will tell you what you're targeting anyway).  But the look of the 'Mechs is only made better by the animations. The joints are all well articulated and the ball and socket joints at the hips give them a very sexy and very convincing sashay. And the individual limbs and parts can be destroyed independently so you can see 'Mechs walking around with arms and missile mounts blown off. And when your legs get damaged, expect to see a really compelling limp. There's also a tremendous sense of weight behind these 70-ton robots as well. Too many games get the sense of mass all wrong when it's done at this scale. I'm glad to see MW4 get it right.  The rest of the graphic feast is less filling. While the weapon effects are super keen and the environmental textures are solid, the design of the environments is less believable than in MechWarrior 3. While there are still plenty of tents and roads and people to stomp on (although you can't really step on them), the sense that you're fighting in a real place is kind of missing. This is only made more apparent by the big red box that appears on your radar that shows you where you're not supposed to go. Still, the variety of environments is impressive. You can fight in swamps, city streets, hills, tundra, desert and a host of other locations. I thought that much could be made of increasing the sense of verticality in the levels, something which a game like Cyberstrike 2 did very well. While there are tremendous differences in elevation, it still feels like you're fighting on a flat 2D surface.  Moving from the eyes to the ears, MechWarrior 4 offers another mixed bag. On the plus side, the thump, thump, thump of the 'Mech's walk is spectacular. You can't ask for a more credible sound effect. And the fact that it changes to reflect the weight and speed of each particular 'Mech is equally impressive. I also dug the sounds of the various weapons, both when they fire and when they make contact with their targets. On the negative side, the voice acting isn't up to the usual standard here and there are some minor balancing problems. Significant information is often relayed to you during a heated battle and there's no way to hear the message as a result. Sure, it's realistic, but if you're missing important comms because your guns are too loud, then maybe you should turn down your guns.  Moving on to the actual game itself, MechWarrior is way ahead of its predecessor. For one thing, there are a lot of new 'Mechs to choose from here. From 30-ton scouts to 100-ton behemoths, there's bound to be something here for you. I would've liked to have seen more light and medium sized 'Mechs (they only make up 8 of the 21 total 'Mechs). It becomes important later in the campaign to start focussing on the heavy 'Mechs but it would be nice to have a wider selection of mid-range models. Still, the 'Mechs that are included are pretty well balanced. The MadCat still stands out above the rest, but we've managed to do some pretty remarkable things in customizing the other 'Mechs.  And it's the customization feature that really stands out in this game. Not only is it extremely well thought out, it's also got a great interface. When you visit the 'Mech lab in the game, you'll see a screen with some basic information about your 'Mech (tonnage, speed, twist rate, etc.). Here you can add anti-missile systems, heat sinks, jump jets and some other generic types of hardware. A separate screen lets you allocate armor to each of the points on your 'Mech.  But the real genius of the system is the armaments screen. Each 'Mech has a fixed number of mounts for weapons. But unlike previous titles, these mounts are dedicated to a particular weapons group and limited to a maximum size. For instance, you'll not be able to place ballistic weapons on a Catapult and you won't be able to fit a PPC on a Bushwacker no matter how much free tonnage you have. This really forces you to think about 'Mech design a little more than in previous games. And designing 'Mechs is really easy with the drag and drop menu system. It would be nice if you could save profiles so you could experiment a little more, but what can you do?  This seems like a good place to mention the salvage system. After each mission, you'll receive a number of new 'Mechs and weapons based on whatever happened to be found on the battlefield after you left. This puts the burden on you to try not to destroy absolutely everything. This makes head shots and no-leg kills very desirable because you'll be able to save as much of the enemy 'Mech to use in the next campaign. One big downfall of this system is that you wind up with a whole bunch of stuff that you'll never use. 37 Machine Guns? Come on.  But all this is prelude to actually jumping in the cockpit and taking your 'Mech out for some exercise. The arcade approach works very well here. I expect that the real BattleMechs are as complicated as Falcon 4, but thankfully the developers have decided to tone things down a bit for the game. You can play the game as well with a nice joystick as you can with the mouse and keyboard. I prefer the joystick personally, but a lot of MechWarrior vets around the office found 4 just very easy to play with the mouse. As far as the basic operation goes, very little has changed. You can still twist the torso independently of the legs, you can still jump around with your jets and you can still groups weapons (although hooking them up for chain fire is still eluding me).  But sadly, the excitement isn't all there on the single player side. While the missions are plenty difficult in the later stages of the game, the story just doesn't grab me. It's a great story when condensed into one paragraph pitch form, but spun out into several missions it just doesn't hold your interest. And the missions seem very scripted as well. The enemy AI will make things very difficult for you however. The developers have added several new tricks to the arsenal. Enemy 'Mechs are much more aware of their heat status than before and will avoid automatic shutdowns as much possible. They also use their jump jets more intelligently. Not only will they hide behind a mountain popping up now and then to shoot missiles at you, they'll also jump over your head and begin shooting at you from behind.  But as average as the single player game is, the multiplayer is fantastic. We've had a ton of fun blasting our way through the various multiplayer modes. And, brother, you don't know what fun is until you and a dozen of your friends have battled it out in a dense urban setting.   This game gets the highest honor I can ever give a game: I'm going to keep playing it even though the review is done. While there's a ton of stuff I need to be playing instead (what with the holidays coming up and all), MechWarrior 4 is just too much fun to throw in the closet with all the other ~average~ games that we're forced to review. Sure, I'd have loved a little something different from the storyline and I think that the 'Mech models could be filled out a bit more. But these only detract a little from my overall enjoyment of the game. I also realize that all you 'Mech heads are going to buy the game regardless of what I say about it. But with a slightly more action oriented approach MechWarrior 4 may just bring a few more gamers into the BattleTech fold.  -- Stephen Butts      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Nov 30, 2000"}