{"name": "Xtreme Sports", "name_review": "Xtreme Sports", "ref": "https://www.ign.com/articles/2000/12/01/xtreme-sports", "text": "In the world of Xtreme Sports there are two kinds of people. Two separate collections of individual whose philosophies are as different as their coinciding wardrobe; One of these sets of people may take a look at the giant mountain before them and gaze wondrously in astonishment. Praising nature's glory in all her regalia and majesty as a celebration of beauty and intimidation. While yet another in the opposite herd of people can take a look at that same mountain and think to themselves with quiet repose; ~That bitch is mine!~.  While some of you may scoff at that type of boisterous bravado, such is the way brought forth by Joint Strike Fighter programming brains, Innerloop. Flexing an obvious talent for impressive polygon pushing, the young group of developers has entered the Dreamcast realm for the first time with mixed results. And while I could toss the explanation away with a simple ~graphics-over-gameplay~ tirade that seems to be a common mistake in today's world of flash over substance, I won't (Well actually, I will. I'm just going to do so over a couple of adjective-filled paragraphs instead of one little sentence. Go word count, go!).  Not to give off the impression that Xtreme Sports is a bad game. It isn't. It just happens to be one of the middle of the road kind of offerings that leave many of us with a half-hearted poker face. You know the kind of game I'm talking about; ~Great this, okay that, all right this, ugly that~, It's one of those rare kinds of games that leaves you satisfied on multiple levels while creating disappointment in others. Basically, it's a seventh grade relationship in digital form.  Now the concept is pretty damn cool, and I wish it were used more often in games of this nature. As instead of competing in hardcore sporting events every now and then and twice on Tuesdays, your alter ego is forced to join a multi-thon of punk-induced athleticism. Like whoopee, you've made it down the snowboarding hill... big friggin' deal, it's time to pay the piper and dash your sloth-like butt on over to the hang-gliders before your opponents can. And if that's still not enough for you, how about that quick trip to your all-terrain vehicle before finally calling it a day? Yeah I thought so wimpy, I thought so.  Unfortunately not all of the events are as fun to play, as they are to imagine. Yes, the snowboarding and bicycle segments are awesome, but those half-assed ATV races have got to go. And why in world are those quad competitions the only event that doesn't live in a world of physics? When was the last time you rode upside down on top of a 500-pound dirt machine anyhow?  Luckily, the alternating ~good/bad~ factor seems to cancel itself out enough to keep you from really worrying too much, and the good ones are entertaining enough to keep you coming back for more. To be honest the only real beef that I had when it came to playing through my less favored events (-cough- hang-gliding and ATV Riding -cough, cough-) was the sore lack of realism. Grab a couple of blue balloons and they'll make you go faster while floating in the air? Oh okay buddy, whatever.  The game's true saving grace however can be found with its visuals. Seemingly ripped right out of a travel brochure, the environments are breathtaking. Snow-capped rock formations, steaming natural geysers, and Wave Race-like water effects are only a sample of the kinds of levels you can traverse. Other experience enhancing factors include powder trails, killer lens flare techniques, and even a couple of clever camera angles in the bungee jumping competition. Who cares if the characters themselves look like Ash clones from Pokemon? The nifty terrain and surrunding objects make up for any other graphical shortcomings the game has to offer (including those goofy goggles everyone is wearing!).  If it's meat you're looking for, then look no further than the options screen... it's huge! With so many features to choose from you are bound to find something you like. From Championship Mode to Time Trail, all the way to the ability to download added courses from the Internet, Xtreme Sports tries pretty hard to win you over. And despite its short list of problems it almost does (Die ATV, DIE)!  Certainly not the greatest game to ever slide down the pipe, Xtreme Sports is still not without some charm. Yes it could have been better had a couple of the events been tightened up in the gameplay department, and yeah it would have made a lot more sense had the characters been more diverse from one another (Is it me, or is EVERYONE five foot nine?), but I guess that's what sequels are for. A party game best set for rental, Innerloop and Infogrames gives it the old university try!  -- Jeremy Dunham, IGNDC", "date": "Dec 1, 2000"}