{"name": "Star Trek: DS9: The Fallen", "name_review": "Star Trek Deep Space Nine: The Fallen", "ref": "https://www.ign.com/articles/2000/12/02/star-trek-deep-space-nine-the-fallen", "text": "From the halls of Minnesota to the shores of Tampa Bay, you can hear the mad rush of Star Trek fanatics each time a new Trek title beams onto store shelves nationwide. They fought for Voyager: Elite Force, they clamored for Klingon Academy, they even on-lined up for ConQuest Online. And now Trekkers everywhere are stampeding once again-this time for Star Trek Deep Space Nine: The Fallen. After the phenomenal success of Elite Force, fan adrenaline has reached critical mass. Can a single-player action game sired by a retired TV show compete with the multiplayer-capable masterpieces of more recent origin? The answer to that depends on your sense of Star Trek loyalty.  Set toward the end of Deep Space Nine's sixth season and based on Simon and Schuster's Millenium series (written by Judith and Garfield Reeves-Stevens), The Fallen follows the story of the ancient Pah-wraiths, a mystical alien super-species. In an apocalyptic war long ago, the Bajoran Prophets defeated the Pah-wraiths, who had sought to replace the Prophets as the prime Bajoran deities, and banished them to the Star Trek equivalent of the Phantom Zone (see Superman: The Movie). Lost with them were their three mysterious red Orbs -- purportedly possessing the power to open wormholes in space (which means they held the potential for an astronomical amount of death and destruction). The Orbs were thought to be permanently consigned to oblivion...until recently.  Within a period of ten years, the Federation and the Cardassians discovered two of the Orbs, but neither group was able to unlock their power before the Orbs were again displaced during rival attacks. Now, Obanak Keelen, a Bajoran monk and beloved friend of Deep Space Nine's Major Kira Nerys, has enlisted the Federation's aid in pushing through his request to explore an ancient temple on Bajor's fifth moon, Jeraddo. Unbeknownst to Kira and the Federation, he intends to collect all three of the Orbs and summon back the Pah-wraiths (the ~True Prophets,~ according to his religion) for the sake of instating what he believes will be eternal peace for Bajor. Contending with Keelen's quest is that of the Cardassians, who are desperate for a superweapon that will give them the upper hand in their conflict against the Dominion. Soon enough, the Federation will be drawn into the race for the Orbs as well.  The Fallen features characters and settings taken straight from the TV show. You can play as Captain Sisko, Major Nerys, or Lt. Commander Worf. At different times throughout the game, you'll find yourself on Deep Space Nine (including some never-before-seen parts of the space station), aboard the U.S.S. Defiant, on Bajor and Jeraddo, in a secret Cardassian military base, and in a Dominion prison camp. Weapons include a couple of phaser pistols and a few different rifles of varying potency, a Bat'leth bladed weapon (if you play as Worf), a grenade launcher and gravitic mines, and something called a shock blade, which is a combination beam/blade weapon that lets you attack effectively from a short distance and from no distance at all. Along with the standard shield-belt and medkit power-ups, the developers scattered hyposprays throughout the game-they're found in the ubiquitous destructible wooden crates.  Unique (and pleasantly so) are the combadge (communicator) and tricorder. With the combadge, you can call up some of the many NPCs, including Dax, Odo, Garek, Chief O'Brien, and Doctor Bashir. These characters usually provide clues (sometimes obvious, sometimes repetitive) on how to proceed from any given point. The tricorder is especially cool; it lets you scan your immediate area for items, life forms, and objective locations. You can also use it to locate clear spots for receiving beamed-down weapons, ammo, and supplies.  The game's HUD shows some refinement -- a wide-open and well-organized screen with health and weapon meters clearly displayed -- but the control interface, or PADD (Personal Access Display Device), is a bit cluttered and annoying to sift through. Contained in the PADD is a ton of useful information that is, unfortunately, most often revealed to you there instead of by means of one of the game's complementary characters or well-narrated cutscenes. Together with the useful Mission Objectives, Tactical Data, and Communications Log sections (all self-explanatory), the developers included a Retrieved Files section that seems to never get used.  Powered by the Unreal Tournament engine, The Fallen looks fantastic. Maps are expansive and widely varied, from broken-down starships to vast planetscapes to various breathtaking underwater environments (complete with good and evil fish). The textures are well detailed also. Some surfaces, such as mirrors and shiny no-wax temple floors, are glossy and reflective, while others appear mottled and appropriately rough around the edges, as with the locations on the Defiant where the Grigari, a drone-like biomechanical adversary, have broken through and injected their shock troopers. Also notable are the pleasant gas and fog effects (I mean that the effect is pleasant, not that the gas is pleasant) and dynamic lighting. Using the rechargeable wrist beacon, you can brighten and scan the many dark corridors.  The character models are fluid as well. Animations for the Tomb Raider-like action (crouching, sneaking, running, jumping, shimmying, and fighting) all match the characters' builds, and the cutscenes are rendered with the in-game engine, so the movement from mission to mission is continuous and believable. Characters match their real-life counterparts in appearance, too (really, to an incredible degree, although when Sisko is wearing his EVA suit he sometimes looks like Ice Cube).  Combine all of the above with the moody, Star Trek-like music and sound effects, and with voice-acting from the TV show's actual stars (excepting the voices for Sisko and O'Brien, though the differences are hardly noticeable), and The Fallen would seem like a shoe-in for stealing Elite Force's crown as the best Star Trek game yet. Unfortunately, a few significant shortcomings punctuate The Fallen's fall from grace. Primarily: WHERE IS THE MULTIPLAYER? The game's level design is often quite good and the variety of characters, weapons, and settings lends itself nicely to the demands of multiplayer play. Make the jump cheat, which allows you to rocket up through atmospheric extremes, a legal element, and you've got yourself a Tribes-beater. So really, really, WHERE IS THE MULTIPLAYER? The decision not to include a multiplayer mode in The Fallen has to be one of the worst game-design decisions made this year.  Play through as Sisko, Kira, and Worf (that order is recommended)-15 hours, 20 at most-and all you're left with is the cloudy notion that instead of letting you experience the same story three different ways, the developers should have combined the three characters' 10 or so individual (though overlapping) missions into one 2025-mission story and then directed the remainder of their efforts toward incorporating the glory of multiplay. Although admirably ambitious, the problem with the ~three different perspectives~ idea is that the gaps in each character's piece of the story-which are necessary to make playing the other characters worthwhile-confuse each individual story line and create holes that you have to actively remember to fill when playing as the next character. The best example of this comes when, playing as Sisko, you find out in almost second-hand fashion that Kira is assuming a Cardassian disguise for one of her missions, though Sisko was supposedly in on making that decision (if not wholly responsible for it).  Other jolting and confusing story gaps pop up in the game, and these, along with the slightly unbalanced enemy difficulty, plain vanilla card-key puzzles, occasional crash bugs, and inherently repetitive missions (not to mention the relatively unexploited characters-Quark-and areas of the space station-Quark's bar) all detract from the overall experience. Gamers and Trekkers intending to bowl straight through each of the three characters' mission sets be forewarned: go on a strict non-Star Trek diet first; otherwise you might find yourself abandoning the Trek for good. Nevertheless, the game is worth seeing, if not owning. Play with moderation (read: take long breaks between missions) and, like a ten-pound holiday turkey, Star Trek Deep Space Nine: The Fallen might last you a good couple of weeks.  -- Gil Alexander Shif      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Dec 2, 2000"}