{"name": "Grandia 2", "name_review": "Grandia II", "ref": "https://www.ign.com/articles/2000/12/02/grandia-ii-2", "text": "You've seen the screenshots and movies for nearly a year.  Most of you have played the prequel on the PlayStation (gah) or on your import Saturn (sigh).  And when Grandia II hit the streets of Japan, many of you, including myself, were surprised that it didn't sell in droves.  We wondered and pondered: did the game dramatically change from being one of the best RPGs ever on the Saturn and Playstation, to a mediocre title on the Dreamcast?  Read on.  For those die-hard Grandia fans out there who've been waiting for the next chapter, anticipating bigger worlds, greater challenges, and a grand storyline, you might be disappointed that Grandia II doesn't take that big of an evolutionary leap on the Dreamcast. That said, what Grandia II does do is give Dreamcast owners something that they've been dying for - a gorgeous RPG containing some of the best battle system mechanics ever seen in the genre. Expectations There's little doubt that Grandia made a huge impact on the RPG scene when it debuted on the Sega Saturn.  Featuring incredible 3D backgrounds combined with charming 2D characters, it gave hope to Saturn fans, deprived of Phantasy Star and a true Shining Force III translation, that an RPG rivaling the quality of Final Fantasy could be found on the Saturn (not forgetting Panzer Saga, of course).  Alas, due to former forces that didn't believe the Saturn ~needed~ RPGs, we never saw a US version of Grandia for the Saturn, and it went to the PlayStation.  And there, it left many fans licking their lips for the next chapter, with hopes that every aspect of graphics and gameplay would be improved.  In that sense, Grandia II has achieved most of those goals, but not without a few flaws that may upset many fanatic Grandia lovers, especially those who love a little drama in their RPGs. Grandia II's story can be summed up in these four words: ~Been there, done that.~  It's not that the characters in the game are without style or personality.  In fact, the translation and voice acting during non-combat portions in the game are very well done.  Mareg, the man-beast warrior, says some of the most metaphysical and philosophical things this side of a Zen Buddhism Temple, while Ryudo, the main character, is a wise-guy, cracking rude jokes and snuffing any moments of happiness with his cynical views -- the unlife of a party.  But even a great translation and voice talent can't make a old and tired tale fresh and engrossing -- especially since you can predict what's going to happen within a few hours of play.  We all know that the story of an RPG is a vital part of the game, as it keeps our interests through those dull exploration sequences and tedious battles.  Without a strong plot, it's easy to lose interest in an RPG, and thankfully, Grandia II's storyline isn't horrible, though its far from being a bestseller.  It follows the tried-and-true ~save the world by collecting a set of items that, once combined, will open the way to the final battle~ script, and that's not necessarily bad.  Unfortunately, the game makes almost no attempt to hide this after only a couple of hours. By then, you know exactly what you have to do, exactly how to do it, and exactly what's going to happen next.  Yes, the plot is linear to the point where a colleague here at IGN called it a  ~checklist of things to do.~  There is a small surprise that caught me off guard about halfway through the game, but just when I thought the game's plot would change, it goes back to the standard.  In a nutshell, the story is told very well through excellent voice acting and an impressive translation. But it's a story we all know too well and for hardcore fan of this series, it will be a disappointment. Get Ready to Battle So, most of you reading this may be saddened that the sequel to Grandia isn't a story to be told to your future video gaming kids.  However, there are a number of memorable features in Grandia II and its battle system is the shining gem.  Unlike Skies of Arcadia, where you cross your fingers in hopes of avoiding random battles, the refined and polished battle engine from Grandia will make you look forward to a fight. There are several reasons for this, the first of which is the fact that there's no such thing as random encounters in the game; as you travel in an area, you will see monsters walking about. You have the choice of keeping clear or engaging enemies, and sometimes you can even surprise monsters by running up behind them. Once engaged in combat battles center around the IP meter. This meter keeps track of when your party and your enemies can attack. By tracking when your enemies will be executing their actions, you'll be able to plan out an efficient, strategic attack, even canceling the attacks of your enemies when properly timed.  This innovative battle system, first seen in Grandia, has been tweaked in Grandia II, in that you will now have to worry about distance as well.  When you initially input a command for a character, you have to take into consideration how far he is from certain enemies. Characters don't just ~jump right in front of the enemy~ to attack in Grandia II. They actually run up to enemies to deliver hand-to-hand attacks. So, if you command a character to run to an enemy across the battlefield, you better be sure you have enough time to ready your attack AND cover the distance, else the enemy won't be there or worse, the enemy will attack you as you're running.  This adds a remarkable real-time aspect to an already excellent battle system, making you look forward to every encounter.  And when you come to boss battles, you better get ready for some serious tactical decision making.  Improvements are not only found in the combat system, but also in level advancement.  Of course, you naturally gain experience points from every battle, but Grandia II has changed the way you gain spells and add new skill features.  While you still have to equip a mana egg to learn spells just like in Grandia, you actually accumulate magic points, called ~magic coins~ during battle.  These magic coins can be used immediately to learn new spells, improve the efficiency of a spell your character already knows, or be saved to learn bigger and more powerful spells. Not every magic spell can be learned right from the get-go, as you'll have to study the lesser spells first. You also earn skill coins from battles, which enable you to learn character-specific special attacks.  Another new addition to Grandia II are the secondary skills that every character can learn by finding Skill Books. Each skill can enhance the characters endurance, attack power, movement, and even magic casting abilities (magic skills use magic coins, respectively).  This incredible amount of customization for each character is simply amazing, and you really start to look forward to battle, not only to lay the smack down on enemies, but to see the effect of newly learned skills on your characters. Grandia on the Saturn gave Sega fans something they've never seen before  solid 3D backgrounds that moved without flaw when you shifted the camera around.  Grandia II is even more beautiful, as the towns and areas you'll explore have their own distinct style and character.  Some towns have drab, depressing colors with houses having menacing, sharp rooftops; other towns are bright and colorful, with impressive monuments and detailed building structures.  The battle visuals display fluid character animation, and a strange mix of kinetic 3D spell effects and hand-drawn 2D animation.  Strange as it is, both styles somehow work, forming a unique melting pot of 2D and 3D animation.  The game also sports some stylish FMV CG sequences, and while they're not quite at the level of Square mastery, they're still very appealing.  Character models are pretty slick, and while they're not extremely detailed, the animated very well.  Graphically, Grandia II will impress even the most die-hard Final Fantasy devotee, and may even make a few jealous. A Grand Day Out Jeff Chen, a fellow IGN colleague and RPG-aholic (and former Saturnworld editor), and I got into quite a discussion about Grandia II's qualities and problems today.  His points (see below) are all quite valid, as he contests that for all the visual splendor and ground-breaking battle mechanics, a predictable and uninspired story makes Grandia II an empty husk of its former days.  Granted, the story is as predictable as a Will Smith summer movie, and it's not the type of advancement we fans of Grandia hope it would be.  But while the story is predictable, it's bearable, especially when told with the good voice acting and first-class translation.  Combined with a fantastic battle system, great customization features, and wonderful visuals, Grandia II may have the same story all the RPG-world around, but it tells it with brilliant gameplay design and excellent style that will leave a grand impression on every Dreamcast owner.  --Anthony ~Donatello~ Chau, IGNDC The CounterAnthony and I argued for a couple hours today over the relative merits of Grandia II versus Skies of Arcadia, and I will admit that you'll probably enjoy either RPG -- they're beautiful, fast, and relatively well structured. If you're more of a dungeon crawler, you'll love Grandia II. Its combat engine is arguably the most advanced system in play today, and I love the amount of freedom it gives you. Likewise, the experience system, the magic system, and the ability to see your enemies puts GameArts on the absolute bleeding edge of RPG design.However, as good as any RPG system gets, a console RPG is all about the story and presentation. For all the 60 frames per second and lush texture-mapping, it's a sterile world. There are few, if any secret items, and no secret maps -- every dungeon is straight point A to point B, with no sightseeing necessary. Likewise, the ~parts of Valmar~ storyline reads like a checklist, with the writers plodding through ears, noses, and throats of dead gods and predictable character developments. Say what you will, but despite the technological advancements, Grandia II's scope and ambition are as diminished as its disc count when compared to the original.While it remains a good RPG, there's a good chance that Skies of Arcadia and Grandia II could be the only two ~classic~ RPGs on the Dreamcast, and I wanted at least one of them to be as close to perfect as possible. Instead, I'll have to lump the good with the bad, and hope time will fade both into fond, rose-colored memories.", "date": "Dec 2, 2000"}