{"name": "The Grinch", "name_review": "The Grinch", "ref": "https://www.ign.com/articles/2000/12/02/the-grinch-3", "text": "Naturally, any game that's based on a blockbuster holiday movie must be met with a lot of skepticism. After all, many times these games are cranked out faster than toys at Santa's Workshop, just to earn a quick buck during the lucrative gift-giving season. The Grinch is timed perfectly for this event  the movie's just come out, the hype is still out there, and a cartridge for the Game Boy Color has hit the shelves at the same time as a massive wall of cranky green Dr. Seuss figurines.  It has all the ingredients to be a gaming, cash-in flop...  ...but it's one of the most fun and unique games to come out this holiday season. Strange how that works, huh? Features More than 30 levels Play as the Grinch and Max Password save Only for Game Boy Color  The tale of ~How the Grinch Stole Christmas~ is a story that should be known to any kid who lived and breathed the holiday specials on network television. The Grinch is a mean and green critter that hates Christmas, and will do anything to stop Christmas from coming to the town of Whoville.  The game offers a totally unique situation: you're literally playing the role as the villain, and the task is to steal all the items in the given level. Of course, this villainy is off-balanced by the fact that the Whoville citizens want to hug and love you if they see you, even though you're the guy that's out to make their lives miserable. Still, being a bad guy is a unique, appealing role, even if the game ends with a syrupy message. The Grinch isn't necessarily an original creation, since it borrows heavily from other titles to represent its gameplay  but it's this old-school design that makes this Game Boy Color title so darn charming. In the most basic-but-thorough explanation, The Grinch can be described as a healthy combination of Pac-Man and Metal Gear Solid. Really  I'm not making this up. The Grinch (that's you) has to sneak around Whoville without being seen, collecting dozens of Christmas presents and treats scattered around mazes like pellets. Citizens of Whoville wander around the maze like the soldiers in MGS  and if The Grinch steps into their field of vision, they'll pursue the green guy and try to give him lots of love. When a Who captures The Grinch, he loses a life and heads back to the beginning of the round. If the green guy steals all the presents in a level, it's mission accomplished and it's off to the next location.  The Grinch doesn't come unprepared, though. The green guy can crouch, crawl, and scoop up snowballs to pelt at both pursuing and unlooking Whoville citizens. Later in the level, Max, The Grinch's loyal mutt, will get into the act  he can't throw snowballs, but he can jump over other dogs that sniff him out. Head deeper into the game and you'll drive around Whoville in a bumper car, hurling rotten eggs at anyone that gets in your way. Being The Grinch is a cruel job, but it's never been so much fun to be so bad.  And there's a ton of technique to this maze game. You'll have to crouch under tables, sneak past back-turned boys, girls, and adults...and when they see you it's a mad dash out of their way before they lose their breath. You can even cause two Whoville citizens to collide and drop items for extra points. And, in Metal Gear Solid tradition, if you manage to get through the level without being seen, it's an additional bonus to your score.  The game only has 30 levels, but even when you complete the game (not an easy task -- but the password save makes it easier to continue onto through the levels after losing all your lives) the game is still challenging and fun enough for encore plays. Much like playing Ms. Pac-Man over and over again -- The Grinch is a great pick-up-and-play title for the Game Boy Color.  Though its roots lie in a marketing gimmick, The Grinch is an absolute blast to play, being as fun as any true classic arcade game from the 80s. Konami handed this game to the right team, as the company could have cranked out a basic, formulaic platformer that so many publishers have pulled in the past. Instead, the development team devised an idea both familiar and unique, and the combination of the two is what pulls this title out of the ~cash-in~ category and thrusts it into a ~must-have~ slot. The game's as easy to pick up as Pac-Man, and as challenging as Metal Gear Solid  The Grinch is a refreshing change of pace from the normal Game Boy Color fare. Honestly, push the mentality of ~Movie Game = Bad~ out of your mind, just for the sake of Konami's Game Boy Color title. It's an unfair moniker for something this fun and this unique. Old School is new again, thanks to the mean green guy.", "date": "Dec 2, 2000"}