{"name": "Breath of Fire IV", "name_review": "Breath of Fire IV", "ref": "https://www.ign.com/articles/2000/12/05/breath-of-fire-iv", "text": "Here's my Johnny Carson impression: What a dragon spews. What grandma has after Cajun gumbo. A really cool RPG series.  Uhh...what are three things called Breath of Fire? Yeah, that was lame, so shoot me. I've been a fan of Capcom's Breath of Fire games since Square published the first one years ago on Super Nintendo.  The plot has never been out of the ordinary (although a friend of mine claims Breath of Fire 2 is better than Final Fantasy VI any day), generally revolving around a group of heroes who must destroy an evil empire, defeat a goddess, or thwart another kind of dastardly villain.   What makes these games so enjoyable is the gameplay.  Like Lunar 2, the complexity in comparison to some of today's games is at a bare minimum, so to attract fans Capcom pumps in fun galore.  This and Breath of Fire III are the only two of the series to appear on PlayStation, and they just get better and better.  The battle system is reminiscent of the prequels, with a few new additions.  If you're a long-time fan, the fourth installment will absolutely please you.  If you're a newbie, expect to become a long-time fan once you're done.   Story Nina and Cray are racing through the desert on their sandflier until a worm-like dragon attacks.  Their vehicle is unusable until Nina can find the right parts.  On her way to town, alone, she runs into a young man who appears out of nothingness, proceeded by an encounter with another mysterious dragon.  The peculiar thing is that this young man is completely naked, by himself, and unsure where he is.  The two join forces (after he's clothed, of course) and begin their adventure, which inevitably evolves into a massive journey that plots good versus bad, with twists all around.   One thing that remains consistent from one Breath of Fire to the next are the recurring main characters.  Ryu and Nina are constantly present in every single one of the four games.  The other characters range from robots to oxen to griffins and more.  I realize this follows some sort of grand scheme Capcom has in mind, but it grows tiresome to control the same heroes over and over and over again.  Despite this 'broken record' technique, the game is as fun as ever.   Gameplay You'll quickly notice that there are several differences between this game and the last few.  Whereas you were limited to gaining up to 999 hit points, you may now earn a Final Fantasy-inspired amount of 9,999.  Your blows also hit much heavier than before. After only five hours of gaming, you can smash your foes for upwards of 500 damage, where Nina's ~Myollinir~ attack in Breath of Fire III, one of the most powerful in the game, dealt around 300.   Another new twist is the combo system with magic. For instance, if Nina, Ryu, and Cray cast spells all in the same round of battle and the spells are compatible with one another they form a combo attack and deal more damage than they would have normally by themselves. As always, Ryu has the ability to transform into a dragon or dragon/human hybrid, which consumes heavy MP. In these forms, he has many new special attacks and enhanced hit points. He can gain many new dragon forms as the game moves on.   The game takes place on an overworld map that separates towns and other areas.  When walking on the map from one place to another, your character may temporarily stop and a ~?~ will appear where the name of a map location otherwise would.  If you choose to enter a place such as this before you continue moving along, you can explore a small field with monsters and secluded items.  Sometimes other important events or secrets take place in these ~?~ sections.   Every now and then, at key points, your change from your party of Ryu, Nina, and whomever to a mysterious character whose story slowly unravels.  He, like Ryu, has the ability to transform into and control dragons. These switch-offs are generally short and vague.   In each town, there are side-quests and sometimes mini-games to play.  One of the first mini-games Nina and Ryu encounter is giving a man in a bar the correct amount of food and drink without going overboard.  A short side-quest they run into is finding all of the children from an orphanage who have hidden during a game of hide-and-seek.  If you find them all, young Chino will tell you information about Nina's sister.  The game itself is very much different from most other RPGs, and enjoyably so.  It's strange and quirky, but right up my alley.  Unlike some of the past Breath of Fire games, Breath of Fire 4 has a fairly good translation of Japanese-to-English text.  Damn, I always liked quotes from games like Metal Gear, with ~The truck have started to move.~   Something I'm not very keen on is the control and the missing variety of camera angles.  It can be hard to walk around towns and dungeons because you can't see where you're going.  You can shift the camera back and forth, but sometimes it does little to shine light on objects barring you from getting past.  This, when paired up with loose movements made by using the D-pad, add up to having some difficult times.  If you're able to look past this annoyance, you're bound to be won over by everything else.   Graphics For a Breath of Fire game, it looks decent.  Like the last PlayStation offering, Breath of Fire 4 has polygonal areas with sprites for characters.  The graphics are inspired by anime and the textures are fairly detailed, although a tad grainy.  I'll say it's quite an improvement over Breath of Fire 3, which was pretty ugly in comparison.  I'd like it if Capcom made areas less compact and easier to navigate, which the poorly-chosen camera angles deter.  My favorite visuals are during battle, because the 2D enemy sprites for bosses especially are humongous and lavishly detailed. The more you play, the cooler the bosses look.    Another thing new to this particular game is FMV, which is all hand-drawn.  It's not especially gorgeous, but it's a change for the positive.  It's also few and far in between.   Sound Wow.  I am quite impressed with the music this time around.  I can't recall enjoying another Breath of Fire's music as much as I do this game's.  It is very good, and often has a multi-cultural tint to it, depending upon certain battles, towns, and characters.  Tasteful chants, singing, and instruments are pleasurable to the listening experience.  Voice acting is almost non-existent, except for special attacks and spells during fights.  The sound effects are all complementary to the game, albeit a little average for bizarre noises.Nothin' says ~I love you~ from Capcom like a really good RPG.  I realize the Breath of Fire games aren't everybody's cup of tea, but they're chalk full of what every role-playing game should have.  Adventure, cool characters, length, and lots of fun.  The fourth game in the series is something we owe to ourselves as fun-loving people to play.  If you're looking for a break from the norm, this will float your boat, baby.", "date": "Dec 5, 2000"}