{"name": "Bang! Gunship Elite", "name_review": "BANG: Gunship Elite", "ref": "https://www.ign.com/articles/2000/12/06/bang-gunship-elite", "text": "The Dreamcast's ability to port over PC games with relative ease seems like a huge advantage, giving SEGA's console an enormous amount of PC games to choose for its line-up.  Though a PC game might look great on a Dreamcast, it doesn't necessarily translate to crme de la crme gameplay all the time, especially if a PC control scheme must undergo drastic changes when transferred to the Dreamcast controller.  And of course, there's always the problem of online play, and while some of the PC translations to the Dreamcast have incorporated online play (i.e. Quake III Arena, 4x4 EVO, etc.,) many have omitted this feature.  And it's these two exclusions that hamper Bang! Gunship Elite from being a top-notch Dreamcast title.  While it dazzles visually, contains a good story, and has excellent controls, the ordinary gameplay and lack of online support hurts the longevity of this title.  The story puts you as Xaha, a young talented Arikhan space fighter pilot.  Yes, you're not a human in this game and in fact, no one is.  As part of the Alliance of 3 Races, the Alliance has always been at conflict with the miscreant Sektar.  Recently, the Sektar have entered a partnership with the Morgoths, with the intention of destroying the Alliance.  Yup, you guessed it... it's up to you, Xaha, the best of the best, to take on the Sektar and Morgoths, and more often than not, you'll be flying solo against an armada that doesn't appreciate visits by the Alliance.  Story is told through various cut-sequences with full speech narrating mission objectives.  For the most part, these cut sequences are done decently well, though I wonder why everyone in space must have some sort of accent originating from some European country?  In any case, the story, while not original, plays out well, with the proper suspenseful aspects whether it's reinforcement coming in the nick of time, or an unexpected betrayal by former allies.  The visuals in the game simply rock.  A good solid frame rate accompanies some very cool visuals.  Action all takes place from a cockpit view, with radar instrumentation (similar to the Colony War series) is located at the bottom center, weapon selection icons at the upper left hand corner, speed of your spacecraft in the upper middle of the screen, and shield and ship integrity in the bottom left hand screen.  You'll always know what weapons you're using, as they appear right in from of you like two big tubes, left and right.  Targeting is handled by a simple ~look and lock~ mechanic, though press down on the D-pad will lock onto the nearest ship.  The mechanics and overall gameplay aren't super technical, as BANG! Gunship Elite plays more like an arcade shooter than space simulator.  Of course, you'll get bigger and better weapons; my personal favorites are the electron laser, shooting glowing black orbs of destruction, or the plasma cannon shooting a liquid-like substance that disintegrates anything in its path.  The special effects are pretty keen, though the explosions of enemy ships into a thousand tiny triangles are a bit dated.  There is also some slow down, especially when making quick maneuvers with enemy warships right in front of you, but for the most part this is an excellent looking game.  Gameplay, as mentioned above, is average. You have a set of objectives you must adhere to in order to move on to the next mission.  Though you will go through all sorts of neat missions, most of them are the tedious ~kill everything~ missions... don't get me wrong, I love a good blast-a-thon but even with a decent weapon seleciton, the game gets pretty boring within a few minutes of shooting down 20 enemies.  I applaud the decent AI that'll give you quite a challenge; this is one of the few games where I had to constantly watch my shield meter cuz the Sektar are damn good shots.  Still, once you've got at least 4 or 5 weapons at your disposal, the enemy really doesn't have much of a chance.  The lack of online play REALLY hurts this game as this is a game that should definitely have Internet play.  In fact, there's no other play option than the normal story mode, and considering its competition (i.e. Starlancer), this is a fatal flaw that will make most consumers look the other way.  Though the one player game is good, and the visuals are nice, it hurts that BANG! Gunship Elite lacks extra play options, and without online play, this game is hardly worth playing over again.  The Dreamcast doesn't need average PC ports, we need GREAT PC ports and it's too bad this game falls into the first category. --Anthony ~Space Ace~ Chau, IGNDC", "date": "Dec 6, 2000"}