{"name": "LEGO Alpha Team", "name_review": "LEGO Alpha Team", "ref": "https://www.ign.com/articles/2000/12/06/lego-alpha-team", "text": "Nothing can replace a day of fun building Lego blocks in the backyard or on the kitchen table (with them all stored in that that big Tupperware crate mom got for her old spare pants and stuff that you pirated away and filled with Legos before she could stop you -- remember that?) However, taking all of those blocks in the Volvo just doesn't work, even when you're sitting in the way-back seat -- eventually your sister throws a fit when she drops her candy, and the puppy is all over the place, and eventually somebody flips the box of blocks over and everything gets scattered all over the place and the wing parts go down in the spare wheel hub and then you can never build a spaceship ever again.  Yep, childhood sure was rough before the Game Boy Color came along.   Features:  Defeat the sinister Ogel with your Lego-building know-how Carefully constructed and challenging puzzles Battery back-up for continued missions Only for Game Boy Color   Lego Media's first Game Boy Game is a sleeper puzzler (as if there were any other kind) around the Action / Alpha team trying to stop bad Mr. Ogel from turning the world into zombies. Woo, scary, but the strange gameplay of this puzzle title may make the player feel sort of like a zombie in it's divorced control mechanism. It's still a good challenge, but it's an odd game to play because it's all calculation and no action.  The characters you play as, the Lego Alpha Team, for some reason have no control of their own bodies to turn, jump, run, avoid danger, back away from walls, or do anything else a human can do. The whole idea of the game is to build blocks that turn the team members or make them jump or send them in the right direction. You set up the ramps, stairs, pogo-pads, and other zany anti-traps to avoid the monsters in the game, then set the Alpha Team member on his way.  He mindlessly walks forwards until he either reaches his goal or is stopped. Whenever he walks face-first into a brick wall, he stops and must be reset.  It's a stumper why the developers at Climax Development went with this bizarre scheme with characters that walk -- maybe it might make sense with a run-away truck or something, but the entire time I was playing, I just couldn't get over the feeling that the guy should at least have the brains to turn when he walks into a wall, not just stand nose-first staring at it wondering what to do next. Even the Lemmings had better sense than this.  But despite the inanity of the set-up, the puzzles themselves are tough and fun. To save the nitwit Alpha Team member from getting stuck in place, players must strategically scan the game map and put pieces together to redirect the buffoon. Unfortunately, you can't move objects during the sequence, so once the action goes off, you can't restructure your plan or quickly make some shifts. Everything needs to be planned ahead, and there's no big thrill to the gameplay unless the challenge is solved. It sure isn't a finger-burster, but it is a brainy puzzler in the good name of Chip's Challenge and Wetrix. It's just that you can't help but think the entire time while playing this game that it'd be better if it had control in the missions. And without that, there's just a few fairly creative puzzles surrounded by some ugly graphics (standard to puzzlers, although these grays and sickly greens are really weak). It's got a battery back-up, it's got smart challenges, it's got a creative design -- everything I look for in a game. What it doesn't have much of is fun. I'd play through this for a few challenges, but I'd rather have my blocks.", "date": "Dec 6, 2000"}