{"name": "HBO Boxing", "name_review": "HBO Boxing", "ref": "https://www.ign.com/articles/2000/12/08/hbo-boxing", "text": "Sometimes patience pays off. When you look at how Electronic Arts has slowly, methodically worked its way into the sport of videogame boxing, there is a lot of logic that makes, well, logical sense in it. For instance, the first Knockout Kings was slow and rough around the edges. But EA always gradually improves its sports games every year. Knockout Kings started with a good engine and has been given proper care over the years, and at least in 1999, Knockout Kings 2000 was quite a good, improved game. When one looks at HBO Boxing, Acclaim's first PlayStation venture in the boxing ring, one really must wonder what kind of framework is there to work around, and if there is any future at all.   HBO Boxing, an arcade-style boxing game that features the few remaining licenses left after EA cleaned up virtually all of them, Roy Jones, Jr., George Forman, Marvin Hagler, and the likes of Roberto Duran and Rocky Marciano, takes players into the world of boxing, with several modes and kinds of play. But unfortunately the game is so strewn with poor mechanics and unimaginative, forced gameplay that most folks are likely to stop playing in the first round. With no visuals to draw players in, almost no music or sound in the ring, and unresponsive, slow boxing play, HBO Boxing won't draw much of a crowd.   Gameplay The interesting thing about Acclaim's HBO Boxing is that while it doesn't look all that good right away, I thought top myself that 'hey, perhaps I'll just sit down and play it for a few hours, and it'll grow on me. Maybe I will indeed like this game, despite it's poor graphics. With a little time, HBO Boxing will shine through and I'll see that the gameplay is there, and that I simply had get past the visual prejudice that flowed over my like a wet stinky sweat rag as I looked at it in motion.' I said that this is the interesting thing. After all, the game is organized quite well, with training modes, a career mode, create a player, etc. It has a respectable license and some good boxers licensed...Well, perhaps it's not so interesting, and my whole experiment in overcoming my prejudices was, in the end, a failure. After all, people in my position do learn telltale signs after playing hundreds of games for a reason. Yeah so, I learned my lesson with HBO Boxing after several hours of play, and what I learned is that it's a rough, poorly designed game that isn't any more fun to play seven hours in than it is in the very first game. In other words, it's all wrapped up in a cocoon of horrors. It's own horrors. And it scared me real good.    I started with a quick fight, and discovered right away one of the biggest flaws in the game. In order to use both of your hands, you have to hit the L1 button, or as it's listed in the instruction manual, you have to ~toggle active hand.~ That's right, instantly you realize that in order to fight against, say, Rocky Marciano, or burly George Forman, you have to toggle between using your left and right hands...with a button. Now let's just look at boxing for a moment. It is a fast, instinctual raw sport. It requires quick hand movement, quick reaction, and more than anything, quick responses. You see an opening and you land the punch, you see the weakness, the bleeding eye, the swollen lip, the stagger in the walk, and you pounce on your opponent. You do it with force, and you do it fast. You don't toggle between your left and right hand and then hit. You don't pause to consider whether you should use your left or right hand. You just do it. Toggling between using your left and right hands is the dumbest idea a boxing game has ever seen.   HBO Boxing doesn't have a lot. Speed is of the essence of boxing, whether it's fast hitting, fast ducking, blocking, or weaving. HBO Boxing doesn't have anything fast. Not a lick. You may think that Ready to Rumble Boxing is a complete waste of time, but not only is it a fun party game, it's fast, baby, and you can punch an opponent with little to no lag time. That's one of the things that make it so damn fun. HBO Boxing is slow as a turtle with two legs and a crutch. You can see the opponent's strategy from a mile away and even then you can't do anything about it because your boxer is so damn slow. It's sluggish, awkward and slower than a snail race in slow motion.   Watching an HBO Boxing match between two players should have been enough for the executives at Acclaim to pull this project right away. There is no 'jab and weave,' there is no dancing about, there is no strategy. The players are so damn slow, and not only in their arms, but in their legs. A typical fight looks like two lead-footed marionettes slogging each other in a close-up brawl. The game lends itself to no strategy. The boxers don't even look like real boxers  they don't throw their shoulders into a single punch, there is no weight behind a punch. The stand straight up, and pull back their arms like a sling-shot and throw punches. It looks like a puppet show.   Graphics OK, let's do a little summary. The boxers look and move like marionettes, and they're slow and unbelievable, unconvincing. The framerate isn't surprisingly horrible, and the textures aren't terrible either. But, HBO Boxing is essentially a graphic misfire. Because in addition to looking like a puppet show, the unnatural, frightening look of these characters in a ring ~boxing~ with their rigid, pointed elbows and knees and their plain, generic faces is enough reason to be compelled to return the game after one minute of seeing it.   Perhaps the best thing about HBO Boxing is that it has a Create-A-Player mode that is so familiar, it's uncanny. I just can't quite figure out where this robust, deep create-a-boxer feature came from. Ah, well, best not to dwell. It is a good one though. Lots of textures, lots of hair, gloves, shorts, and the kind of details you would ask for in a create-a-player mode.   Sound What I noticed about HBO Boxing is that the sound element is really strange. Were the developers trying to eliminate the sound from the ring altogether purposely, for realism, or was it a mistake? It's these kind of things you're left to wonder about after spending time with the game. Yeah, so there is no sound in the rings, and I can't say that the music in the menus or during ~training~ ever popped back into my head after I turned the game off either.Do yourself a favor and don't buy HBO Boxing, go get Knockout Kings 2000 for a more sim-style game, or Ready to Rumble: Round 2, for pure, lightweight arcade fun. Just don't get this. Not even if you like boxing. It's a real disappointment, it's not fun, and it looks bad. It's not even a potential contender, and if Apollo Creed or Mr. T. ever got ahold of this they'd eat it for breakfast, and they aren't even real boxers. But man, that create-a wrestl...I mean, Boxer mode sure is good.", "date": "Dec 8, 2000"}