{"name": "The Grinch", "name_review": "The Grinch", "ref": "https://www.ign.com/articles/2000/12/09/the-grinch", "text": "Banking on the residual popularity of Ron Howard's blockbuster film, the PC version of The Grinch is targeted at casual gamers in search of Christmas jeers. Playing as the Mean One himself (rather than the lovable if dim Whovillians), your goal is to locate the missing Grinch-gadget blueprints while systematically sabotaging Who joviality - a decent premise for a lighthearted romp. From his hideaway atop Mt. Crumpit, the Grinch has long been plotting the corruption and ruination of those jolly citizens of Whoville. But just when he's reached his threshold of disgust, a big wind comes and whisks away all of his plans, scattering them to the four corners of the Who world. Now, accompanied by his loyal sidekick Max the Dog, the Grinch must embark on a malevolent misadventure that will take him on various recovery/mayhem missions to downtown Whoville, the frozen WhoForest, the Who Dump, and WhoLake.  The Grinch gets around through a simple system of vacuum tunnels. After a brief tutorial session, you'll take a newfound awareness of the game's shortcomings down the first tunnel, which leads to downtown Whoville, for the first part of the adventure (the vacuum tunnels to the other areas are artificially inoperative until later in the game). Primarily, the game's shortcomings comprise: 1) an enraged character without any explained motivation for that rage, 2) an infuriating free-floating camera that doesn't seem like it'd be effective even in a console game, and 3) some troubling graphical glitches. If these deficiencies weren't a part of the game's central elements, you might be able to inure yourself to the other, relatively minor deficiencies, and you might even enjoy some of the surprisingly innovative aspects. Unfortunately, the dark cloud of the game's blunders heavily overshadows any innovations.  Other problems come in the form of a contrived pseudoSeuss-like narrator (thankfully, he's not used too much beyond the tutorial), some cryptic, hieroglyphical menu screens, and a bit of misinformation regarding the operation of the Grinch's computer  a humorously animated monstrosity complete with tubes of gurgling goo and spiky rotating cogs  (it tells you to hit [ESC] to exit the screen; actually, you have to hit [A]). Also, one of the few crash loops takes place here on Mt. Crumpit when you try to use the Grinch's elevator pad to take him up to a level that otherwise can be accessed via an incline in a nearby corridor.  Downtown Whoville is a scantily populated but colorful wonderland of low-detail cartoonish houses and low-res props, such as a static Christmas tree that stands at the center. The sparse environment is of average size, compared to a typical action-game environment, although it's relatively small compared to most adventure-game environments. Other areas, including the WhoForest and Who Dump, are similarly constructed.  In keeping with the themes of the famous story, the different settings and characters in the game contribute to a sense of bleak glee: downtown the Grinch encounters sleeping guards who wake up and freeze him with snow-shooting pistols, innocent bystanders who cower and flee whenever he approaches, and not-so-innocent children who try to either hug him or pelt him with snowballs.  The Grinch himself is pretty mobile. He can shake off his ~assailants~ by wiggling violently, spewing bad breath, or using one of his gadgets on them, such as his rotten egg shooter. To assemble these gadgets, the Grinch must first locate all the blueprints for them, then load the blueprints into his computer. Once they're in the computer, the Grinch must figure out how to arrange the individual blueprint pages, which are facing the wrong direction and in the wrong places. This sort of multilevel puzzle is a typical example of the game's playful inventiveness.  Other clever features include taking control of Max the Dog for the sake of reaching places the Grinch can't; collecting rotten eggs for various purposes, such as using them for ammo or fuel; putting the Grinch's bad breath to multiple uses; jumping and landing on your arse to crush boxes or see-saw Whovillians off into the distance; and using the Grinch's ability to swing from overhead bars both to get from one place to another and to complete some of the tasks required for finishing missions.  The Grinch's missions are laid out for every main area of the game as a set of mischievous tasks that get checked off once you complete them. These tasks include such dastardly deeds as shooting rotten eggs into open windows, throwing bees' hives down chimneys, and of course, arse-crushing the requisite amount of Who presents, which happen to be scattered everywhere around the Who world. As another testament to the game's creativity, each time you achieve the correct number of crushed presents, an entertaining side-game opens up back on Mt. Crumpit.  Up to a certain point, The Grinch is tolerable and even mildly entertaining. Beyond that point, it's unplayable. The game's varying degrees of cleverness make it worthwhile for you to spend some time overcoming obstacles and solving puzzles, but somewhere around the Who Dump you'll likely throw up your hands in Grinch-like disgust. It's ultimately the free-floating camera, combined with the difficulty of some of the challenges, that will send you fleeing from your computer. For instance, in one of the sections of the Dump, you have to time your jumps from one mattress to another while avoiding being knocked into a minefield by a floating robot who fires electrocuting balls at you. That's hard enough as it is, but the challenge is artificially compounded by the fact that the camera arbitrarily rotates while you're in the air, therefore changing your landing spot (which is so crucial because if you land anywhere on the minefield you'll be blown sky-high and have to start over). This particular challenge comes after you've finished about 20% of the game, which is a lot farther along than it sounds, because completing many of the missions requires repeated concentrated effort.  Unless there's a patch released to fix the camera/control problems and tone down the seemingly accidental difficulty of some of the challenges, The Grinch isn't quite recommendable. With the aforementioned problems fixed, however, The Grinch could easily surprise you with more than a few hours of wickedly delightful holiday distractions.  -- Gil Alexander Shif      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Dec 9, 2000"}