{"name": "Dora the Explorer: Saves The Mermaids", "name_review": "Dora the Explorer: Dora Saves the Mermaids", "ref": "https://www.ign.com/articles/2008/04/14/dora-the-explorer-dora-saves-the-mermaids", "text": "Bagging on a game made for preschoolers for being simple is right up there with arguing about a cup of coffee being hot. There's a difference, however, between edutainment and a wafer-thin concept that's spread even thinner in the interest of keeping a kid entertained.    Again, it's more than a little tough to ~review~ a game like Dora Saves the Mermaids in the traditional sense because the normal rules don't really apply -- or at least expectations can be scaled back a little, but if I could recognize something like Konami's Kids Playground titles as being fairly useful, I'd hope I could do the same for Dora.   Unfortunately, there's not really a whole lot to Dora. She's out to save mermaids from an octopus dumping garbage into the ocean with the help of a magical crown and ... uh ... well, that's kind of it. Along the way (actually, 95 percent of the time), you'll run Dora around snaking paths, pick up gems and basically just get from point A to point B while occasionally encountering such wrinkles as things that bounce or catapult Dora into the air.    No! Go left! Short of a few games other than color and shape matching, that's the entire game. A game that lasts about an hour, all told, though obviously the target audience may take their time a little more. The first five minutes more or less define the entire experience, and though parents can hop in and help their youngins if they happen to get stuck, chances are if they can comprehend the basic first steps, they'll be able to do the rest.    I'm not knocking the game for being simple, but having a bit more variety probably would have helped keep the entertainment up above the level of, say, passively watching that Dora DVD for the 857 millionth time. The game also feels a little broken at times; if you happen to, say, jump on a catapult and land next to something that can normally be investigated by Dora's pal Boots, the delay in him getting there means the game will pause to allow for what would normally be the investigation animation. When Boots does arrive and turn to start investigating, the animation time will run its course and the object will not only not cough up its goodies, but it will no longer be interactive, so trying again won't work. Things like that, or an oddly unresponsive/hyper-responsive left analog stick when selecting things just makes everything feel rushed.   Pulling voice talent from the show was a wise move, though for whatever reason Dora's nasally voice and odd choice of pronunciation of things (~press the action buh-in?~) started to seriously get to me. Luckily, Boots was utterly adorable, and though the game apparently felt using a heavy-handed eco-friendly message was more important than teaching some basic Spanish, at least the audio worked well enough. The simple steel drum-led loops weren't half bad either. The same goes for the visuals, which do absolutely nothing to wow, but don't look terribly ugly either. Again, I realize a game like this isn't going to put God of War to shame or anything, but this is a $30 game.    It's harder than it looks ... I think. As an educational tool, Dora Saves the Mermaids falls flat. As a simple distraction, it falls short, and as a game that is meant to get adults in on the action to help out, it isn't really a very collaborative experience. Yes, it's a kids game, but that doesn't mean that it has to feel like a bit of a rip-off.", "date": "Apr 14, 2008"}