{"name": "Disney Magical Racing Tour", "name_review": "Walt Disney World Magical Racing Tour", "ref": "https://www.ign.com/articles/2000/12/13/walt-disney-world-magical-racing-tour", "text": "Hasn't it always been your dream to take control of a ride at Disneyland, to leave the track behind aboard Space Mountain or to turn down some dark jungle tributary on The Jungle Cruise? Sometimes you close your eyes aboard the Pirates of the Caribbean and imagine yourself hoisting the sails and cruising right down that laughing goons path. Sometimes dreams come true, and in Walt Disney World's Magical Racing Tour that fantasy of being in control of Disneyland rides becomes a reality -- wishes upon a starry Disney sky somehow come true.  Unfortunately, that's true about only the PlayStation and Dreamcast versions of this game -- the Game Boy Magical Racing Tour is just a side-scrolling racer with a few catchy tunes.   Features:  13 race tracks themed after Walt Disney World rides Music from the world-famous attractions Unlock hidden racers and tracks Kart-style weapons and wacky race vehicles Only for Game Boy Color    While the control and speed extends faithfully to the console versions of this game, the track designs on the limited Game Boy hardware just can't come close to the reverie of riding a Disney World ride -- and even at that limited scale, this version is still further scaled down than I would have hoped. What you're left with is a weak Kart racer -- as if there were ever any other kind on the Game Boy -- with generic Disney-ized characters instead of the main mouse you'd expect. Hobble that further with simplistic graphics and crummy collision where weapons pass right through characters, and Disney World suddenly needs to close for repairs.  Very few marks even note that this is a Disney game at all -- the tracks and characters are generic. The console versions had the same problem with the character design, since the only true Disney characters in the game are Chip, Dale, and Jiminy Cricket as your guide (he's also an unlockable racer). Some other character are vaguely reminiscent of Disney figures -- X.U.D. 71 looks like Gizmo Duck version 1.1 -- but all are new creations that don't exactly spark much interest. There are some Disneyland / Disney World figures that would be perfect for a Disney racer, like any bear out of the Country Bear Jamboree, the Hitchhiking Ghosts from the Haunted Mansion, or even the great Maynard, but instead they went with new Disney creations for each of the attractions presented, and it'll be tough for kids to identify with the newbies (although Bruno Biggs, the big, fat Disneyland brute -- kind of like the guys who push kids out of lines at Disneyland -- hits home with a little dweeb like me).  The new figures aren't awful, but the tracks trying to represent the rides unfortunately don't do much to fill in for the missing characters. Each attraction is virtually identical to the last, with only a few corners or tricky turns to take. The game is a side-scrolling racer -- not optimal for a driving game, but with the speed of the race and generally easy control, it's not so much an issue outside true race fans. Sadly, there just doesn't seem to be much room for variety in the tracks in this type of game, and though the designers have added plenty of trophies and other knick-knacks to collect up to distract racers, one can't ignore that every track plays the same.  And if there's no variety in the track design, at least there might have been visual differences to show how the tracks are like the ride. But the design of this game is so limited that there are few landmarks. Big Thunder doesn't have the dinosaur bones, Jungle Cruise doesn't have Bubbles or the Backside of Water, Pirates doesn't have the fire scene or even any pirates in the street -- hack, Splash Mountain is missing it's signature drop -- how is that Splash Mountain? Visually, it's a disappointment, and with the bulbous giant head figures that don't animate and hardly look like their characters (Dale doesn't have his red nose), it doesn't matter how fast this game moves. It simply can't escape its faults.  But at least one bright star shines in this game -- the music, culled from the rides themselves and designed with Factor 5's MusyX system, the music tracks are stellar recreations of the famous ride themes. From Grim Grinning Ghosts to Zip-A-Dee-Doo-Dah on to that Dick Dale Space Mountain theme, all of the rides are well represented here -- that was one of the strong spots of the console versions, so check those games out for those rare tracks, but it's an even more wonderful achievement on the Game Boy Color.          If these tracks came closer to the rides, this would be a sort of collector's item for Disney fans -- it doesn't have spectacular control, but that feeling of being in control of Disney's world famous rides would have been an unbelievable experience. Unfortunately, the tracks don't come close, and the characters don't put on much of a show. That leaves it up to the control to make the game merry, and in this case, it's not happening. While I liked the side-scrolling racing style -- it worked on the NES game T&C -- the shoddy collision makes the game frustrating and no fun.  On the Game Boy Color, Disney World Magical Racing Tour is a broke-down ride.", "date": "Dec 13, 2000"}