{"name": "Felony 11-79", "name_review": "Felony 11-79", "ref": "https://www.ign.com/articles/1997/09/11/felony-11-79", "text": "Wanton destruction is a strangely attractive idea. Everything that modern society stands for is diametrically opposed to causing immense amounts of monetary damage to private property, but that could be what makes it seem so appealing. Felony 11-79 from peripheral king Ascii has taken destruction to heart, combining it with cool vehicles and high speeds, resulting in an immediately satisfying game.  You have been hired to find three special items which will open a tomb, revealing millions of dollars worth of treasure. Being the hired one, you don't actually get to partake in the wealth, but you do get to drive around in crazy vehicles and break stuff.  The game is unbelievably fun right from the get-go. Choose your vehicle, which ranges from sports cars to Vespa scooters. You can eventually open up 22 vehicles, revealing a bus and garbage truck among others. The cars handle well, and get harder to drive the more damage you take.  You're given a short amount of time to make it through each of the levels. They're not closed tracks, but 3D sections of town with downtown areas, freeways, and sea-side streets. Each level also has items you must find to pass on, including dynamite and the keys themselves.  One of the best parts of the game - the destruction - is also one of the most annoying. You sustain damage when you crash, which is understandable, but the camera insists on changing to a side view whenever you collide. If you spin out after ramming something, you can easily get turned around, losing precious time.  The game is also much too short. Although there are multiple ways to finish the levels, there are only three of them. Once beaten, the only reason to keep playing is to unlock the extra cars.  Driving on the beach, through a mall, and in a subway are just a few of the reasons this game is so much fun. With a little more work, and a few more tracks, it could've been awesome. As it is, it's just pretty good.", "date": "Sep 11, 1997"}