{"name": "WCW Backstage Assault", "name_review": "WCW Backstage Assault", "ref": "https://www.ign.com/articles/2000/12/13/wcw-backstage-assault", "text": "The last wrestling title to ever grace the N64 has finally arrived, featuring everyone's favorite group of WCW maniac fighters. But this final taste of wrestling glory has gone completely away from the standard wrestling affair by abandoning the ring altogether and sticking strictly to the no-holds-barred action of backstage fighting. And so, EA and developer Kodiak have aptly named this title WCW Backstage Assault in honor of this untraditional setup.  The game is a sequel of sorts to EA's previously well received WCW Mayhem title from this time last year. And indeed, fans of the team's first effort will find the basics of this wrestler to be very familiar ground in a new backstage wrapping. This year's version also follows hot on the heels of the recent WWF release from powerhouse THQ, and there's no doubt that many are curious which title shall be the N64 king wrestler to own this holiday season. Keep reading for our full take on the game.  The Facts   For one or two players simultaneous Over 50 WCW wrestlers (male and female), with hidden characters to unlock All backstage environments with over 40 different objects to be used as weapons Seven environments including Semi-truck Arena, Locker Room, Exercise Room, Boiler Room, Bathrooms, and more  Over 800 motion captured animations from real WCW wrestlers Three modes of play: Exhibition (wrestle against the opponent of your choice in a singles match), Hardcore Challenge (unlock WCW superstars, backstage rooms, and more while competing for championship belts), and Hardcore Gauntlet (for experts only -- seven grueling matches with no time for recovery) Special exhibition matches including First Blood and Human Torch Improved Character models with accurate movement due to advanced skeletal structure Create-a-Superstar mode -- characters can be modified in 39 different ways to create fully customizable and unique fighters Over 8000 lines of play-by-play commentary Save game data and statistics via Controller Pak Rumble Pak support  Gameplay So what happens when you throw the ring out of wrestling? Well, fans of the continuing WCW saga already know that the ring isn't the only place where skulls can be cracked, as nearly every event erupts into some form of sideshow tomfoolery involving the unorthodox use of common household appliances. Yes, that once innocent chair, lead pipe, or bathroom sink can easily be transformed into a weapon of brutal destruction in the hands of the wrong person, and that's exactly what this game features. Of course, it also features the same over-the-top wrestling moves we've all grown to love. As with most other wrestling titles, WCW Backstage Assault features a wide variety of signature moves for each of the various fighters that fans will surely recognize. In fact, if there's one thing this game has managed to improve on the previous WCW titles, it's the sheer number of different motion-captured player attacks, ranging from standard punches to complex acrobatics and, of course, new weapon animations. All of these moves can also be viewed on the character select screen prior to entering the match -- something that can help WCW newcomers slide into the gameplay nice and slow. And of course we also find the return of the standard Create-a-Superstar mode, which you can learn more about in our earlier feature detailing the process of bringing a customized hero to life.  Controlling your character is done with the digital pad, as is commonplace for most recent N64 wrestling titles. This gives the player the distinct advantage of being able to pinpoint moves when combined with the additional buttons of the controller. Overall, control in this game is fairly tight and responsive, but not nearly as fast paced as EA's previous Mayhem title. Players move about the backstage environments a bit too slowly, unless you happen to press the run button, in which case they bolt uncontrollably fast in their current direction. Compared to other recent wrestling titles, the game is not exactly below average in terms of speedy thrills, but it doesn't exactly stand out as being overly responsive and fast-paced either.  Now as mentioned, players will find themselves battling to the finish in one of seven different backstage environments, each equipped with various usable items to pick up and bludgeon your opponent with. Otherwise, the game plays very similar to a match in the ring, including the ability to hurl your opponent across the screen and into the wall. While this is all good and fun for a while (some of the animations are downright comical), there's just not much depth to the gameplay department in this latest WCW title. The Hardcore Challenge and Hardcore Gauntlet modes attempt to offer fresh gameplay by mixing up the rules of play and unlocking secrets, but when it comes to gameplay, nothing much is different from the standard exhibition mode. Due to the obvious lack of a ring and television broadcast presentation, there are simply not nearly as many differing fight setups returning this year as in the previous Mayhem title.   Multiplayer If you're looking for multiplayer action, then the exhibition mode is again your only option, with one of three ways to play: regular, First Blood, or Human Torch. And honestly, these three modes of multiplayer action are about as exciting a good elbow to the head. You can probably guess that in First Blood, the first person to bleed looses, and the same principle is applied to lighting someone on fire in Human Torch. Whoopee. Otherwise, it's just the same punch, swing, jump, and smash tactics found in the single player mode, without so much as basic stats tracking or player records. The fun of smashing your little brother with a trashcan can only provide so many hours of entertainment by itself before a little variety is craved. In the end, this game is one of the weakest multiplayer wrestling experiences on the N64.  Graphics Overall, the bottom line is that this game is not nearly as pretty as last year's WCW Mayhem. The player models are more blocky and the textures they sport are much more simple and plain than the sweet visuals found in the previous version. The game runs off the same engine as last year, and considering the extra processing effort spent on the surrounding environments, it's only natural that the players would be adversely affected in the process. All the eye-candy has been severely toned down this year to the point of really being an eyesore in comparison. In fact, there's just no comparison -- last year's WCW title is much more visually stimulating.  One thing that has shown improvement are the character animations. Although not nearly as smooth as last year's ring-based title, the motion captures are all done very realistically and sport decent hit detection. Characters grapple each other very realistically, with hands, legs, heads, and elbows all contacting opposing players in the right spots. When you move Hollywood Hogan in for a grab, you can see his hands make appropriate contact with his victim instead of simply protruding around the back awkwardly. Again, the animations are much too choppy and jerky, but the quality motion captures help to make up for some of the shortcomings.  The gameplay environments aren't exactly much to look at either. There are a few nice effects scattered randomly such as fire, electricity, and smoke, but overall the arenas are substandard attempts to please the senses. Even from a distance, many background textures are blurred to extreme levels. Others work nice, but leave much to be desired. This game would have been much better featuring just a standard ring with focused gameplay and sharper characters instead of spreading itself so thin in the graphics arena.  Sound The highlight of this title is definitely the audio department. All the effects are standard whaps, slaps, bangs and bumps, but the announcing and commentary by Tony Schiavone and Bobby ~The Brain~ Heenan is totally wonderful and even better than the superb efforts last year in Mayhem. It's always quick and appropriate after every move is made, and the color commentary is fairly witty, amusing, and relevant. In fact, this could easily be one of the best uses of voice commentary on any ~sports~ title on the N64 to date. Each of dozens of player moves is bellowed in real-time as you do them, and it helps add that extra dose of energy to each blow. It also goes a long way to help the lacking presentation of the title, since you won't find any outrageous character introductions or anything equally enticing. Instead, you're only dose of WCW spirit is from the onscreen action and spot-on remarks by the announcing team, and it works very nicely.  Another nice use of audio is found in the ambient noises for each stage. You'll hear dogs barking, cars honking, fire crackling, etc. as you rumble around the arena. It's not much to save the game, but it does add a nice touch of icing on an otherwise bare cake. One interesting find is the inclusion of crowd noise in most of these levels. We're not exactly sure why it's there or where it's coming from -- we seem to notice a lack of any animated crowds on these stages, but nevertheless you'll hear faint chanting crowds during gameplay. Perhaps EA felt the title was a bit too boring without the standard drone of wrestling mobs, but whatever the reason you do have the option to turn it off completely if it freaks you out.If you're a hardcore WCW fan, then this isn't the game for you. It fails to impress in nearly every way, and certainly doesn't deliver a presentation worthy of the WCW license. EA and Kodiak's first use of this wrestling code was much better implemented last year with WCW Mayhem than in this latest backstage attempt. The premise of interactive environments seems fairly cool at first, but eventually the lack of options and variety really takes its toll on the gameplay thrills. The visuals have actually gone downhill, the animations are choppier, and to top it all off: the multiplayer experience really sucks. And for most people, including myself, the best part of any wrestling game is the fun of bruising up your friends. While this game certainly offers bruises, it just doesn't pack the punch wrestling fans crave.Are you a dedicated wrestling fan? Check out IGN's official wrestling network by clicking here.", "date": "Dec 13, 2000"}