{"name": "Rally Masters", "name_review": "Michelin Rally Masters Race of Champions", "ref": "https://www.ign.com/articles/2000/12/15/michelin-rally-masters-race-of-champions", "text": "The strange dichotomy at the heart of rally videogames lies somewhere between the sport's incredible excitement and the mystifying way to make it fun to play on a console. Few developers have found the secret keys to the rally genre's success, and while Infogrames has tried somewhat vigilantly to make the genre fun again, the results are hardly encouraging.  Michelin Rally Masters Race of Champions, perhaps one of the lamest titles for a game (~Hey look we have an endorsement from a tire company!~), is a decent rally game that delivers a better than average physics engine, an overly simplistic set up, some gruesome graphics, and a weird, repetitive formula for its races. For all of the better-than-average aspects of this game there is a negative one that nullifies its promise, leaving me empty and unsatisfied with it. It's not that Michelin Rally Masters is a terrible game, it's just average, and with a much better game such as Colin McRae already out, and Colin McRae 2.0 shipping this week, the decision to pick a good rally game just got twice as easy.   Gameplay Michelin Rally Masters has a couple of good things going for it. The physics engine delivers a middle range, not too easy, but not too hard, kind of driving experience. Players can get right into the game without knowing too much, and the learning curve isn't too high. The courses aren't designed with too many deadly curves or sneaky sections, and Digital Illusions has created safety lips at the edge of most roads to protect yourself from, well, your own driving. Players have access to a navigator to signal out the upcoming turns, and can use standard features such as acceleration, brakes and hand-brakes, or ebrakes, four different viewpoints, shift up, shift down, and a rearview option. Players also can choose automatic shifting, too.   The game relies on the time-trusted features of most racing games, single rally races, championships, and two-player head-to-head play modes. Unlike Colin McRae Rally (the first one), Michelin Rally Masters enables players to drive head to head against another computer-controlled car on the screen simultaneously. It doesn't seem like that much to ask for, but on other hand, most real rally games pit drivers against other drivers' times, the most significant reason being that the driving is so dangerous the two or more cars are likely to smash into each other sooner than later.   In rally racing, the courses are treacherous and the conditions are rough, which make driving in these kinds of competitions as much a fight against the opponent as earth's own elements. Thus, the physics engine in any rally game is key to the driving experience. Michelin Rally Masters' engine is not weak by any means; in fact, it's quite robust. If there were no Colin McRae or its sequel, it would probably be one of the best on PlayStation. The control is very accurate and responsive for the most part, and it's quick. Players can spin out at any point, and they're likely to flip or hurdle into air with grace and spontaneity.  Rolls are not uncommon, and neither are crashes, whether its trees, houses, logs, or the other car.   Another one of the things Rally Masters does well is to quickly switch you through the menus, and to automatically save your data. Flipping through the screens is quick, and moving to the next menu is quick too. The other thing that could have been better is the load times going into new courses. They are slow...   Perhaps the weakest part of the actual driving experience is the use of brakes, the ebrakes, and shocks. Most driving games create an experience so that players need to use either or both of these essential parts of driving to create a greater, fuller experience. Well, just to create a driving experience at all. It appears that Digital Illusions felt differently. No matter what track I played on, on snow, in the rain, in light or darkness, the brakes failed me again and again, no matter the lightness of strength of my thumb on the buttons. Part of my learning experience in Michelin Rally Masters was that I simply stopped using the brakes altogether, because after all I was trying to win. And only when I stopped using them did I started winning more often. I wiped out so many times by simply tapping the brakes with the lightest of touches before going into a hard left that it was ridiculous. And, power-slides are my bag, baby. Whatever. The big weakness in the braking system is that they are way too sensitive and unbalanced. Powerslides in this game usually end up being spinouts when you use the brakes, no matter how much you practice, and that's a bad thing.   The other aspect of the game that I didn't like was the championship system. Players enter a race, and depending on the kind of race, they race the same course over and over again, but with different cars. But not your choice of car, a seemingly randomly selected car, with totally different characteristics than the previous vehicle. The effect is that you feel unprepared each time you race because of the brand new car you're given. I can see why the developer created the game that way, which was to enable players to drive lots of cars, but this is a stupid system. Racing over the same course over and over again was also pretty lame. Also, for the real rally lovers, the overly simplistic modification system will totally disappoint you. The lack of gradation for changing tires, shocks, steering and such do indeed affect your car's performance, but they aren't enough to make a difference. If you simply choose the middle of the road settings you will perform just fine in pretty much any race.   Lastly, and this is a mixed blessing, you do in fact get to race in lots of different cars, but you never feel like you own them, or can tweak them enough, and you never get to race one for long enough to care. Digital Illusions did gamers right by putting in lots of cool cars to race, but the system by which they get them stinks.   Graphics Well, if there are holes in the gameplay system, you won't want to see this game. I know I keep saying this but in the fifth year of the PlayStation, games ought to look better than this. The laundry list of negative adjectives to describe Michelin Rally Masters is endless. The graphics are very low resolution, they're murky and crude, and everything in the game looks pixilated and unfinished.   The typical things happen in Michelin Rally Masters that could have made this look a little shinier and more realistic. The perspective correction is pitiful, too, making for shifty, oddball landscapes that move about while they should be solid. The crowds are 2D placards, and the trees are obvious sprites.   To its credit, some of the car models are quite good looking.   Sound For all of this hit-and-miss action in graphics and gameplay, Michelin Rally Masters is spot-on with sound effects. The car sounds are simply great. Players will hear each gearshift, every aspect of the engine winding up or down, and the navigator's voice and timing is also spot-on.   As for the music, it's all very middle of the road. It's the kind of music that goes in one ear and comes out the other, and you never remember a tune, a melody, or a riff. In other words it's filler and that is the perfect description for this stuff. It's filler. Despite my personal problems with the stupid braking system, I can't honestly recommend this game because it simply never reaches the same caliber of play that Colin McRae 1 or 2 do. The physics engine does a solid job of re-creating a rally environment, and the two-car racers, against the computer and another person, are engaging, but the game never really reaches any startling points of interest. To summarize, the competition system is not preferable, there are problems with the brakes, there is very little alteration, the graphics are weak, and the music is entirely forgettable. If you want a brilliant couple of rally games, buy Colin McRae 1 and 2. They are like sims, but they play brilliantly. They're the real stuff.", "date": "Dec 15, 2000"}