{"name": "Ski Resort Tycoon", "name_review": "Ski Resort Tycoon", "ref": "https://www.ign.com/articles/2000/12/16/ski-resort-tycoon", "text": "The gaming industry is becoming more like Hollywood everyday. Each creates an annual wealth of product, the majority of which is insulting, insipid or inane. Each regularly spends millions of dollars producing pet projects involving top talent, only to endure horrible, flaming and largely deserved deaths. Each is capable of taking new or unique ideas and beating them flat into the ground. It would be easy to slam the obvious culprits, but what possible purpose would it serve, aside from inflating my word count and generally making me feel like a big man? Whatever. Somebody owes me time and money for the likes of Armageddon, Last Action Hero, Independence Day and the thespian works of Shaquille O'Neill. How can the people responsible for Daikatana, Ultima Ascension, Privateer II and virtually anything related to rednecks and hunting sleep at night. You're right I do feel better.  However, both industries redeem themselves by producing small, low-budget, independent efforts that make the rubber mallet marketing practices of the other ninety percent of their fare almost bearable. Each year witnesses the debut of a Spike Jones, Kevin Smith or Paul Thomas Anderson, whose efforts, while not always satisfying, seem to breathe a little life into a crowded and stagnant medium. The gaming industry is no different. Companies such as Stormfront, VR-1 and Epic Megagames have been doing it solo for years and impressively so. The Electronic Arts and Activisions of the world regularly turn to small development houses in order to port existing titles to other platforms and to execute small concepts in order to round out their catalogs.   Cat Daddy Games of Bellevue, Washington is just such an independent. Their recent wares include forgettable takes on lumberjacking and strongman competitions; yet, they were serviceable enough for what they were. Now aligned with Activision, Cat Daddy introduces a new spin on the builder genre with Ski Resort Tycoon. Go ahead and roll your eyes. The mere mention of ~tycoon~ should be enough to make anyone's eyelids heavy. However, we found a surprising depth of gameplay to be discovered within. You've come this far, read on...   The premise is simple enough, given a mountain and a wad of money design a ski destination complete with runs, lifts and jumps to draw in the masses, surrounding them with bars, hotels and trinket shops to bleed their wallets dry. Ski Resort Tycoon borrows liberally from Bullfrog's Theme Park and Hasbro's Rollercoaster Tycoon. Every building, object and character may be selected and modified. Plop down an Espresso Shack or Waffle House and adjust prices, change the name and access its historical stats. This is the exact economic simulation as might be found in any builder, right down to the icon driven interface. Fortunately, it is simplified enough that even an idiot can earn money during this portion of the game, to the extent that it is more an exercise in aesthetic design than anything else.  The graphics are presented in full 3D; both accelerated and software rendered. Even the resort visitors are polygon-based; lesser machines will suffer at higher resolutions, especially as the resort becomes crammed full with happy, skiing fools. Especially nice is the ability to select any object in the game and switch to a chase camera view; several fogging levels are offered to improve frame rate, which is a nice touch. On a snowy day this is really something to behold: slicing down a tall run, distant mountain ridges fading into the mist while the town below comes into the fore. Yes, we know this was done in Sim Theme Park, but its still cool. Attention to small details abound: building textures change to reflect heavy snowfalls; ski patrols drag the injured about on stretcher sleds; resort visitors meander about wearing a wide variety of colorful outfits bearing both skis and snowboards; even the occasional Sasquatch will appear and drag a victim into the woods. Unfortunately, the map cannot be rotated, which is very, very frustrating when trying to build out the town proper or create the ultimate, wicked ski run.   There are open-ended modes as well as a handful of pre-defined challenges. The gameplay progresses at an easy, leisurely pace; only one scenario actually imparts a time limit. There are no competing interests, stock markets or other outside influences to contend with. Yet, rather than detract from the enjoyment factor, this kind of works for Ski Resort Tycoon. The overarching goal is to be creative, so if it takes you an hour and a half to decide which side of the mountain the chalet should be on, so be it. The interface is 100% mouse-driven and is composed of a series of buttons arranged at the top of the screen. Unfortunately, not a single hotkey exists in the game; consequently building out your resort becomes a real chore, real fast. Trees and shrubs must be cleared with a chainsaw before sidewalks can be laid down; naturally both are in separate menus that cannot be opened concurrently. Strangely, buildings and ski runs can be dropped into the middle of a small forest without issue. Things like this should have been worked out during testing, but that's the way it goes at small development houses with limited resources.  Fortunately, the real meat of the game involves getting people up and down the slopes. A less motivated company might have just plugged-in a random terrain generator and left it at that. Cat Daddy, subtly bearing their development teeth, provides a full suite of terrain manipulation tools. Choosing the ~grid~ icon displays a blue mesh, revealing the underlying tile-based engine.  Buttons allow you to easily raise or lower entire, sweeping sections of earth or just alter individual squares. Click and drag a large bounding box across a stretch of snow, then select the ~smoothing~ icon to even out jagged sections. Best of all, there is no cost associated with using these tools, as might be the case with other games. The whole point is to experiment and we found this to be a very creative and highly appealing aspect of the game. Once you have the mountain just right, call up the surveyor tool and drag a line from the top of a hill to any point above or below. A green line follows your cursor detailing distance, degree of slope and whether a run placed here would qualify as beginner, intermediate or expert. Next, choose a type of rope, lift or gondola from the construction menu to set the start and end points. Slope markers placed nearby tell the customers what to expect and they will immediately begin to flock to the gates.  For a game that has no movie tie-in, product cross licensing, and is by its very name derivative Ski Resort Tycoon has no business being as decent as it is. Activision is branding this a ~value~ product, which should just about murder it with the general gaming public. Sad, since this is an unpretentious little gem of a strategy game. Cat Daddy has created a nice, competent product that is generally more pleasing than it is frustrating, obviously built with pride and affection. If there exists a better example of independent software development please let me know. Ski Resort Tycoon is sure to be priced below twenty dollars making it a perfect stocking stuffer. Ideal for kids or adults and should actually prove equally pleasing to girls as well as boys. Now name a Christmas release, game or movie, which can honestly stake that claim.  -- David Kozlowski Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Dec 16, 2000"}