{"name": "MTV Sports: Pure Ride", "name_review": "MTV Sports: Pure Ride", "ref": "https://www.ign.com/articles/2000/12/19/mtv-sports-pure-ride", "text": "Nintendo needs to pump us up and deliver a 1080 Snowboarding game on the Game Boy Color or Game Boy Advance. Boarder fiends just aren't getting how to design a gnarly snowboarding game on a handheld, and we need the premier ride of all-time to school them all. Until then, the portable fix is going to have to come from the Boreal's of the snowboarding game universe -- games good enough to get you knee-deep in some power if you're not willing to get all the way up the hill.     Features:  Over twenty raw board tricks, including grabs, spins, and flips  Half-pipe, trickstyling, and race courses Only for Game Boy Color    MTV Sports: Pure Ride isn't exactly pure at all. In fact, the whole time I was playing, I couldn't help thinking, ~What an interesting hack.~ Essentially a snowboarding title grafted onto what looks like the code from the developer Visual Impact's motorcycle racing game, this boarding game makes the best of the situation and offers a few nice aerials, but still has trouble trying to pull off some real trick style.   Two different modes of gameplay are offered (plus a Training mode to give players a chance to ride the bunny hill before going all the way up to the top). The standard racing mode barrels down the mountain at top speed through trees, obstacles, slalom flags, and ramps. Avoid all the bad stuff and get air off the good stuff to make the people clap for you at the bottom. This mode is the game's core feature, and it moves at a quick clip with good scaling in a 3D perspective. The riders swing and slush with sharp control down the mountain.   The gripe with it, however, is that it's tough to feel like a snowboarder when the game looks like it's running down a flat hill. Occasional rolling hills distract the eyes, but there are no big drops or embankments to slice up on to give that illusion of running down a hill. Also at ill is the game's repetitive nature -- the engine can handle trees or snowmen, jump ramps, and slalom flags, and not all at the same time. That's it. All of this is set against backdrops that look the same in any country setting, painted in almost the exact same color schemes in each course. Granted, snow is white no matter where in the world you are, but some more shading and evening hues and a few landmarks would have done a ton. No matter how clever the tracks are laid out (and here, they're not that clever), a track this simplistic over the long haul with repeating elements feels like going around in laps. This feels more like extreme cross-country skiing than snowboarding.   The Half-Pipe, completely different from the downhill engine portion of the game, is a wonky game over a FMV-scrolling half-pipe. Imagine a snowboarder that tries to play like Stun Runner. Here, the animation doesn't compensate for the feeling of going up a hill or for physics -- the boarder approaches the edge of a lip without ever pointing the board uphill. Tied in with the freaky stop-and-start scroll of the FMV to simulate the motion up the sides and the never-ending perfect roll of the pipe as it goes on into eternity, the Half-Pipe just looks too fakey to be believed.  Even so, any pretty snowboarder can blow its pretty graphics out its snowblower as long as the gameplay is tight. Here, Visual Impact scores some good marks. The trick book isn't big, but the technique and timing of the moves is handled well. Players can't simply tappity-tap and hope to walk away with the trophy in this game -- the moves are very specific, and only the challenging, risky moves reward big-time. Backflips and Rodeo Flips must complete rotations before getting down, and it's up to the player to finish the move. Gamers must also know when to transition from one stunt to another, and which will award combo points.  It's a smart trick system, but the handling of the game's engine still interferes with the style. Visual Impact was smart to award points only when launching off a ramp -- you can turn out a Method or Indy until the snow melts, but it's all practice until you get airborne off an official jump. That keeps scores logical and forces players to take the right lines and take some risks. The problem is that the handling of the jumps is dreadful -- the boarder springboards off tiny bumps sky-high, and there is so little to the ramp before the bump is over that the developers had to compensate by allowing racers to bounce off a ramp after they've cleared it. Ramps feel like puppeteers pulling the strings on their snowboard marionettes -- very unintuitive. The same kind of odd feel goes for the Half-Pipe, where a boarder can go from a long slide to suddenly ollie up ten feet in the air -- clearing what they would have had if they popped off the lip cleanly.  Pure Ride is just too unreal to elevate the snowboarding sport on the Game Boy. True enough, plenty of other developers have biffed trying to re-create that feel before, but the one or two nice tricks this game pulls off on the hill can't hide that it had a clumsy run all the rest of the way. Handheld gamers are still waiting for that perfectly-groomed terrain park to shred. In this case, you might want to keep driving up the hill, because there's mostly slush at this game's base.", "date": "Dec 19, 2000"}