{"name": "NCAA GameBreaker 2001", "name_review": "NCAA GameBreaker 2001", "ref": "https://www.ign.com/articles/2000/12/20/ncaa-gamebreaker-2001", "text": "After being thoroughly spanked on the NFL front, which saw a buggy and seemingly unfinished NFL GameDay 2001 up against a very polished and stunning Madden NFL 2001, 989 Sports and Sony have a little less to worry about with NCAA GameBreaker 2001, as it is the only college football game being released on PlayStation 2 or any other next-generation system this year. Using the same engine as the company used for GameDay on PS2, GameBreaker 2001 is essentially the exact same game but with a lot more polish, less bugs, and an excellent collegiate feel.   Gameplay  As one would expect from a college football game, NCAA GameBreaker 2001 is loaded with all 115 Division 1-A teams plus more than 60 classic teams from the past. The inclusion of the classic teams makes it possible to create match-ups between all time greats that couldn't be done at the time, such as a match-up between the '91 Miami Hurricanes and '91 Washington Huskies. The two teams split a National Championship with Miami winning the AP poll and Washington coming out on top in the Coach's poll -- and now you can pit them together to see who was really the best (Miami wins 76-34, if my game means anything).   It's things like this that really give NCAA GameBreaker 2001 a lot of special appeal. Being the only college game around means that PS2 owners looking to play as their favorite team, school or Alma Marta only have one choice and this is it. Luckily, the game does have a lot of little extras even beyond just having all of the current and past teams that does make it appealing as a college football title. For instance, the game has a very robust playbook that has more than 600 plays and 26 formations, with many being specific to the college game. The most notable of these is the ability to run the option attack that's very rarely used in the NFL game.   Using the left and right shoulder buttons to pitch the ball is easily one of the most enjoyable new additions to the game. Even if you're playing as a team that doesn't run the option attack, the chances are that you'll find yourself inclined to do so because it's quite effective and can very entertaining. The only problem with the this facet of the game is that it's hampered a bit by the game's somewhat shoddy collision detection. It's not really possible to truly run the option completely realistically because as the quarterback, you must pitch the ball well before a defender goes for you or else you'll get caught up in a tackle animation and will be unable to toss the ball. Part of the fun of running the option is holding the ball until the defender makes his decision to go after you and then pitch the ball to the running back, and this is lost here.   Basically everything else about the control is the same as what one would expect in a 989 Sports GameDay or GameBreaker title. On offense, you can do special moves like spins, jukes, stiff arms, shoulder charges and speed bursts and on defense you can jump, do a swim move left or right and do a forearm shiver or bump a receiver on the line of scrimmage. The game also includes 989 Sports' vaunted Total Control Passing that lets players do things like lead, underthrow, and overthrow their receivers with a great amount of control. While this is and has always been a pretty cool feature, it's never really needed to that great of an extent in this game.   The main reason for this is that the computer's AI is a bit on the weak side and the game never really gets hard until you put it on the Senior difficulty level. Furthermore, upping the difficulty level doesn't really increase the intelligence of the computer as much as it simply increases the likelihood of the computer defensive line running over your offensive lineman and increases the speed at which defenders pursue the ball carriers or intended receivers. As a result, the same basic plays that work on the True Freshman level, such as just about any pass to a running back coming out of the backfield, quick outs and pitch outs to the wide side of the field, will also work on the Senior level. The only difference is that players will have to keep a closer eye on the pass rush and will have to time their passes a little bit better because defenders will get to the open receiver a little faster. Still, the plays are still typically open and you can expect to score an average of more than 70 points per game over the course of a season, whether on True Freshmen, Sophomore, Junior or Senior.   The computer AI on offense is handled the same it is on defense. When you increase the difficulty levels, the offense doesn't get smarter nor does it run better plays, it just will get open more on pass plays, break more tackles and catch some balls that it wouldn't have on the lower levels. The offense will occasionally do something that will seem intelligent like running a fake punt or field goal when you least expect it, but then it'll follow it up by running the ball on three straight plays while down 14 points in the fourth quarter. The computer shows no signs of understanding clock management with the exception of calling timeouts when time's running out and it doesn't seem to even think about things like kicking the ball out of bounds inside the 20 on punts.    Going past just the general difficulty and challenge, there are even more AI problems when you look at the game on a micro level. The defenders seem to all move and react with a single mind, as can be seen by the fact that the entire defense will often react to the running back all in unison. Because of this, it's entirely possible to take advantage of this AI flaw by having your ball carrier that's running up the sidelines cut into the middle of the field to get all the defenders to head in that direction and then head back to the sidelines for an easy score. It is also possible to get big gains by simply running your ball carrier backwards and towards one sideline and the looping all the way around once you get all the defenders bunched up together in a pack to once again get a relatively easy score. This particular flaw could easily be fixed simply by allowing for player fatigue during a play.   And while the big bugs and major AI problems that were apparent in GameDay 2001 have been patched up, many smaller problems and bugs remain unfixed. For instance, computer controlled defenders will often find themselves running in place, completely neglecting the fact that there's a receiver about to catch a ball just a few yards away from him. Likewise, defensive backs will periodically stick to covering a downfield receiver even when a running back is heading up field with the ball. This creates instances where you're running downfield and the defenders appear to be running away from you as they're trying to catch-up with receivers running towards the end zone.   Another annoying little bug is that players will sometimes dive right through a ball carrier when trying to make a tackle. Moreover, once one defender makes contact with the ball carrier, others can no longer make contact. This not only completely takes away the chance of having any gang tackles, but it also makes for some annoying plays where you and a computer controlled teammate go for a tackle only to have the defender bounce off the tackle of the CPU teammate while your player simply dives right through the ball carrier.   And on a related note, when diving on defense it will automatically make the defender dive right at the ball carrier or intended receiver even if the defender is running in the exact opposite direction. Because of this, it's impossible for a defender to dive for an overthrown ball to a receiver as instead of diving in the direction of the thrown ball, he'll dive backwards, hitting the receiver and getting nailed for a pass interference penalty.    Even with all of these problems (and others that haven't been touched because this review is long enough already), the game does have a lot of appeal because of its excellent college atmosphere and the underlying fact that it's still fun to play. The game isn't anywhere near as good as Madden NFL 2001 on PS2, nor is it better than NFL2K1 on Dreamcast, but it's the only game of college football that you can play on a next-generation system and for fans of the collegiate sport it's going to have to make do.   Graphics  If you've already seen GameDay 2001 on PS2, then you should have a good idea what to expect with GameBreaker 2001. The two games pretty much look identical with GameBreaker's only real differences coming in the form of a greater variety of player types and sizes. The game has the same problems with player animation, as there are times where there's a complete lack of transitional animation between movements. Players will go dive to make a tackle and the animation will jump instantly to a tackle animation that might not even be possible given the angle at which the two players were running at. As a result, there will be instances where when making a tackle from behind that the ball carrier will be taken down immediately with no forward momentum being taken into account, while at other times tackling from behind will realistically knock the ball carrier forward.   On the plus side, some of the tackles do look pretty amazing as there's more direct contact between the models of the ball carrier and tackler. Instead of just reacting to an invisible force field around the two players, you'll actually see the defender wrap his arms around the legs or body of the ball carrier when he takes him down. Still for everything that makes this game seem more realistic or life-like, there's another animation or glitch that quickly lets you know that this is still a videogame.   The game also boasts exact replicas of all 115 different college football stadiums. While this is great for adding to the game's college atmosphere, it honestly doesn't really come into play much because you're typically stuck looking at the field, which looks pretty much the same from school to school with the only exception being the logos printed on the field and the type of turf. Still, it's a nice little touch and assuming that it's completely up-to-date and accurate (which I'm not checking), should help bring the true college atmosphere home.   Sound  Continuing on the theme of bringing the atmosphere of college football home, 989 Sports has done a splendid job with the game's audio. More than 30 authentic fight songs have been recorded, so if you're a fan of one of the upper tier teams, the chances are quite good that you'll get a chance to hear the school's real fight song. Not to downplay what it does offer, it's would've been even better if the developers could have gone out and recorded the authentic fight songs for all 115 Division 1-A school, something that EA Sports has done with its college basketball series on the PlayStation.   GameBreaker 2001 also brings forth the voice of legendary college football announcer Keith Jackson, who handles all of the play-by-play and color commentary in the game. Keith Jackson is essentially the college equivalent of Madden and his work in the game while better than Madden's in EA Sports' NFL game, suffers from similar problems. Jackson will often start rambling on about really oddball or meaningless things and while this does add some character to the game's commentary, it loses it quickly as he'll often say the same meaningless things or go on the same oddball tangents numerous times within a single game.   The game's audio is also filled with some over-the-top grunts and crunches during gameplay. Every time that you hit the speed burst button, you're greeted with an unrealistic grunt that's just used way too often over the course of a game. Despite the fact that NCAA GameBreaker 2001 is a seriously flawed game, it has still proven to be a very fun and enjoyable game. And while it's not even in the same league as either Madden NFL 2001 or NFL2K1, it does offer something that neither of those two games does -- college football. And while there are far less college football games bought each year than NFL games, there's definitely a large segment of the population out there that would rather play with the college teams than the NFL teams. So, if you must have a college football game and NCAA Football 2001 on the regular PlayStation is not an option, then NCAA GameBreaker 2001 is definitely something that you should consider checking out. Just keep in mind that there are a lot of problems with the game and if you're not able to overlook them, then you won't have any fun with this at all.", "date": "Dec 20, 2000"}