{"name": "In the Line of Duty: Firefighter", "name_review": "In the Line of Duty: Firefighter", "ref": "https://www.ign.com/articles/2000/12/21/in-the-line-of-duty-firefighter", "text": "Touted as a ~3D Shooter with a Firehouse,~ In the Line of Duty: Firefighter had our interest peaked when we spied it on the shelf at our local EB.  Sure, it's an Activision Value title, but we've had a lot of fun with Fast Food Tycoon and Ski Resort Tycoon recently, so we were curious to see if the magic lived on in Firefighter.  Unfortunately we learned quickly that what starts out as an interesting concept ultimately goes up in smoke.  Things were bad from the get-go with In the Line of Duty: Firefighter.  When we opened the package, all we found inside was a paper sleeve containing the game CD and a flimsy two-page manual.  Uh, excuse me?  Why squander 160 cubic inches of cardboard when a CD case would have worked just as well? It's games like this that make me hate the wastefulness of this industry just to get more coverage on store shelves.  Once we had the game loaded up, things didn't get much better.  The graphics in Firefighter are pedestrian at best. Character models are all low-poly, and animation is as stiff as Prince Charles' upper lip.  The game environments, while rendered in 3D, are nevertheless very plain and spartan with little detail, dull textures, sparse objects, and limited color depth.  The fire effects themselves look pretty realistic, although they certainly don't ~spread like a natural fire~ as advertised on the back of the box.  On another up-note, frame rates stay consistently high, even on slow machines, but this is most likely due to the fact that the environments are so bland and so empty that there is little for the hardware to choke up on.  Gameplay is equally as disappointing, about as repetitive and boring as  Simon with one working button.  There are only two things to do in the entire game: save poor souls from burning buildings and then douse the flames.  Sure, sounds like it could be fun...but it's not.  Saving people involves running around the sparse environments, temporarily dousing fires with your handy extinguisher and collecting victims one by one.  Apparently all of the residential fires you're called to happened in the middle of a party on the poor side of town, because you invariably end up saving eight people in a two bedroom house furnished with only bed, a couch, and maybe a fridge...maybe.  To make the game as un-friendly and awkward as possible, the designers have made it so you can't look up or down while you're running through the levels, which gives you the good ol' ~firefighter in a neck brace~ feel.  Brilliant!    After you rescue everyone in a level, you move to the outside of the building and play a shooting gallery style game where you use your mouse to extinguish hotspots with your hose...and it goes on exactly like this for ten missions.  Playing this game is kind of like reading this sentence again and again.  Playing this game is kind of like reading this sentence again and again.  Playing this game is kind of like reading this sentence again and again.  Playing this game is kind of like reading this sentence again and again.  See what I mean...  Level design is incredibly simple and plain as well.  Most of the maps are small, making victim rescue easy for all but the most inexperienced of gamers, and while the school level is quite large, it's still not much of a challenge to save everyone in the allotted time.  Add to this the fact that you can get through the entire game in about two hours and you're in for a value gaming experience that burns through your wallet faster than a grease fire at Jimmy's Chicken Friend Restaurant.  Probably the best feature of In the Line of Duty is its sound effects. Like the fire graphics, the fire sound effects sound extremely realistic, and we imagine that more than one microphone was burnt to a crisp during the recording process.  Unfortunately we can't say the same for the music, which was generic and would fit better at an all-night rave than in the middle of a burning office building.  In the Line of Duty: Firefighter is a perfect example of an interesting idea gone horribly, horribly wrong.  This is what happens when games are rushed through the production cycle in hopes of making a quick buck rather than seeing a concept to its fullest.  Just think how neat a real first person firefighting game could be, and then remember the horror you saw today.  Even at $20 you should avoid this one.  And just to be safe you might not even want to get any game that happened to be on the shelf next to In the Line of Duty just in case some of the badness seeped through the plastic-coated cardboard.  When it comes down to it, the only thing that might get burned here is you.  -- Tal Blevins      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Dec 21, 2000"}