{"name": "You Don't Know Jack: 5th Dementia", "name_review": "You Don't Know Jack 5th Dementia", "ref": "https://www.ign.com/articles/2000/12/22/you-dont-know-jack-5th-dementia", "text": "Even if you don't play computer games much, or even at all really, you've probably heard of a series of games called You Don't Know Jack. Hell, you probably know that there are about 8 billion of them out there as well. Well folks, you can make that 8 billion and one now because there's a new chapter to the series out there with new questions, new games, and one very important addition that just might make it worth picking up from the store for some of you lonely people out there. This time around, you can play over the Internet with people you don't know and tell them exactly how much Jack they don't know.  This is the first time that they've had Internet playability in YDKJ. But the game is pretty much the same. Is that a bad thing? Not really. The production values are still very high. The graphics, even though they are very sparse, are also still of high quality. New character animations of funny looking people for your ~alter-ego~ are also pretty entertaining.  The voiceovers are excellent as always, if a bit long winded at times, which can be annoying since you can't skip through anything in this game including the opening screen where the announcer tells you that you're playing You Don't Know Jack: 5th Dementia for those that are confused. But for everything else, the host has a very sarcastic way about him that's impossible not to like. And the sound is really why everyone likes to play this particular series of trivia games anyway. With voice work for every question and situation in the game, it's really fun to see what the host will say next.  But as with all trivia games, this only lasts for a while. The questions have to run out eventually don't they? There are 600 new questions to keep you busy for a while, but when games knock off 15 questions at a time, there is a limit to the playability. You actually can't pick a longer or a shorter game this time around. But questions are also divided into themes so you'll know if you're playing something that you've already heard the answers to. Almost all of the questions are multiple choice, but there are a few other special types of question games that make things a little easier. Those who have played a YDKJ game before will be familiar with most of them like anagrams, fill-in-the-blank, and gibberish questions. There is a new question type to deal with as well called bug out where little bugs will run onto the screen and say a word in a high pitched, ~bug voice,~ I guess is the only way to say it. If the word doesn't go with the clue you are given, you have to buzz in to squash the little guy.  But of course, the big addition, as I mentioned before, is the inclusion of network play, which always seemed obvious to us, but had never been implemented. So now, if you're alone and bored at home, you'll get the opportunity to play a round with strangers over the Internet and chat while you do it. There are some preprogrammed trash talking that you can throw your opponent's way if you wish with the press of a button, but it's just as easy to personalize things and type whatever you like. Connecting to a game is a little different with YDKJ than with other games. When starting, you tell the computer whether you are meeting people for a game or just want to play with random people. If you are meeting people, then you need to have a room name specified before you play and if you are playing random people, you'll get connected to whatever game opens up first. This is good and bad. It's good because you don't need to spend time looking for people to play with you from the normal chat rooms that start out a game, but the bad is that you could end up playing with a real jerk that keeps typing rude things into the computer that you'll have to look at.  But all in all, there really isn't that much to say here. It's another You Don't Know Jack trivia game. If you've never played one before and you like trivia, then you should think about picking one up because it really is fun. And if you've always wanted to play via the Internet with your friends or complete strangers, than this is also good for you. The You Don't Know Jack series has a good rep for a reason; it has high quality sound, graphics (even if they are simple) and a great sense of humor. Plus you get free microwavable popcorn in the box.  -- Dan Adams Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Dec 22, 2000"}