{"name": "M&M's Mini Madness", "name_review": "M&M's Mini Madness", "ref": "https://www.ign.com/articles/2001/01/04/mms-mini-madness", "text": "Sure, M&Ms seems like a silly license. But maybe a great game can come from unlikely sources? Remember that one of the Genesis' most fondly remembered games was a little treasure from Treasure called McDonalds Treasureland Adventure -- who'd have thought that a burger joint would have cooked up a fun game? Same goes for the old Duck Tales, where Scrooge proved he's got the moves. And don't forget 7-Up's Spot. This year alone, two of my favorite Game Boy games came from lesser licenses -- Woody Woodpecker Racing and Tom & Jerry: Mouse Attacks.   Right, and what about Extreme Sports with the Berenstain Bears, Yogi Bear's Great Balloon Blast, Arthur's Absolutely Fun Day, Toonsylvania, Home Alone, Family Dog, Wayne's World, Yo Noid!, Fed Ex, New Kids on the... You know what? I take what I said back -- screwy-licensed games are pretty much impending doom in a box.  Features  Play as four different M&M characters Use individual skills to solve puzzles Four stages of candy-coated adventure  Only for Game Boy Color   And thus it continues with M&M's Minis Madness, or should I say M&M's MiNis Madness. The problem isn't that the game is an advertisement -- all games now are advertisements, for DVDs, for movies, for other games of the series, for the franchise, for a band... Mass consumerism is fun for all. No, what melts M&Ms is that this is a game about a candy. How the heck are you supposed to make a game about candy?  Apparently, the answer is to just sort of do it, and do it quickly. Pipe Dream Interactive's M&M's Mini Madness is a by-the-books platformer if there ever was one -- stuff is somewhere on the left, so run that direction and jump over stuff in your way. It's the kind of overly simplistic game you get for free with a box of cereal. Beginning programmers make these games with Shockwave before they find some kind of inspiration. Technically, it's proficient enough not to gripe about, but the gameplay is as dull as Plain M&Ms.  How plain? Take the individual skills of the characters, which each character is endowed with. The special abilities might have made for a smart revival of The Lost Vikings, where solving puzzles involves using the right candy character. Instead, the skills that any normal action hero would have are dispersed amongst four characters. One guy swims. That's a talent? It's not even a puzzle -- in the stage where there's water, use the guy who won't drown. After that, Swim Boy can take the day off -- he's completely inept out of the water.  So you have a guy who can swim, a guy who can bounce, a chick who can blow kisses (which only kill certain enemies), and a guy who can spin-attack (which kills the rest). If the game's stages and design were smart enough to maximize these skills, there might be some challenging puzzle fun in these simplistic, blocky stages. But for some odd reason, Pipe Dream didn't separate the characters -- instead of choosing one M&M at the beginning of a stage and tagging out or later tracking back through a level to find the bonuses one character couldn't reach, you simply press Select and switch the character. That's no challenge -- that's a pit stop. If you like getting your M&Ms out of a vending machine one at a time instead of by the handful out of a bag, this is your game. M&M's Mini Madness is a barely competent platformer, with no business taking up your time. It's a generic as they come -- the enemies are bouncing crates and blobs, the plot is to find stuff, and the challenge is to find switches and jump over things. What a thrill. The mechanics aren't bad -- making the M&Ms run is wonky, but otherwise it's stupid easy -- and the stages are more or less average -- although the fact that bottomless pits just look like more of the stage until they kill you is stupid, and the idiotic programming of the directional arrows never actually help you find what you're looking for made me sick of this cheapie effort even more. The game is just so bland and pointless, without any puzzles to solve or enemies to fight that are worth your time. The big animated characters are nice, but so is the ad that the game's based on. You'll have a lot more fun watching that 30-second M&M TV commercial than playing this game.", "date": "Jan 4, 2001"}