{"name": "Worms: A Space Oddity", "name_review": "Worms: A Space Oddity Review", "ref": "https://www.ign.com/articles/2008/03/13/worms-a-space-oddity-review", "text": "Worms is one of the only franchises out there that has seen more than a decade of success, and is still just as charming in its simple design as it was when the series got its start.  True, the franchise had a brief stint in the world of 3D, but it proved to be disastrous, and so Team17 has gone back to its 2D roots time and time again, and that same engaging, turn-based experience has held up extremely well over the years.  No matter what console or handheld you own, you will see Worms make an appearance.  That's just the way things work.   On Wii and DS, the Worms series has seen a serious push.  Worms: Open Warfare 2 on Nitnendo's handheld was one of the top games on the system last year, teaming online with traditional control, a level and team editor, and all the options you could hope for.  On Wii, Team17 is keeping the same core design, but bringing the worms into space, adding in gravity on top of the traditional wind conditions for outside combat, a level editor, a half dozen mini-games, and unique motion controls for the new (and returning, but modified) items in the Worms world.  Worms controls well, but lacks the depth to be truly great.  The basic concept of Worms has been virtually unchanged over the years, and the Wii version is sticking to its roots.  Players hit the battlefield with a minimum of two teams, four worms each.  The 2D world is made up of solid collisions, a mass of space to play with, and tactical drops of supplies and items.  Each turn has players controlling their next member of the squad, moving them into position and taking one action before passing the torch over to the opposition.  You've got limited time (60 seconds) to navigate the world though, so it's all about quick strategy, precise navigation, and deadly execution.  If you take one shot with a weapon and miss, that's your turn.  If you walk off a ledge and hurt yourself while trying to get in position for attack, that's your turn.  If you unleash an erratic robo sheep that wreaks havoc across the countryside, blowing both enemy and ally to pieces in a majestically violent display of precise tactical warfare, oh -- you better believe that's your turn.  Once a worm loses all 100 health, he's gone, baby, gone.  If the whole team is decimated, the other squad of worms wins.  Simple, but fun.   Where the game takes a unique turn (and one for the better, might we add) is in the control of your wide array of Worms weaponry.  Since the original game was all about aiming your character and clicking a mouse or hitting a button, that wouldn't be the most amazing Wii design out there, so Team17 spruced it up a bit.  Every item in the game, from rocket-like impact frags, UFO assist ships, guided missiles, jetpacks, and hand grenades, to more advanced and non-lethal assist items such as shovels, teleporters, and portable platforms, is entirely motion or IR controlled now.  Those who had a brief outing with the first DS Worms are probably worried right now, as that game was drastically hurt by a sloppy control method, but that is entirely not the case this time around.  In reality, this is the most innovative and entertaining Worms weapon system we've seen in years.  Amongst our favorites are the guided frags, where the Wii IR is used for pointer control -- the missile follows it with deadly precision.  There's also a plunger system for the game's more advanced explosives (set with B, detonate with a horizontal plunge motion), and the returning weapons from previous games such as the robo sheep now have added functionality as well, with both a detonation button and also jump control assigned to the Wii-mote flick.  The weapons are balanced, and extremely fun to use.     Not everything's perfect this time around though, as Worms: A Space Oddity isn't the final product that was originally promised.  In our first interview with the game's designers, online was a huge part of the mix; players could supposedly use Nintendo Wi-Fi Connection to link up with friends or random players and upload, share, and play with created levels online.  There were even specific details as to how this would work, with the ability to add random players to your friends list on the fly, WiiConnect24 support for additional content downloads via Team17 directly, and online team battle with up to four players.  Unfortunately, none of that made it into the game, and only local multiplayer remains.  This was the case with the first Open Warefare on DS as well, missing online until the second wave of releases, but the lack of online in this first effort is still a huge letdown, especially after players were told outright that it would be included.    As far as the core gameplay goes, Worms is still a fun package; it just really had a chance to be the first third-party game out there to make use of all of Wii's bells and whistles straight away, especially since the control has been effectively nailed.  What you will get with A Space Oddity is a full single-player story mode, six mini-games, an in-game achievement system that unlocks bonus content, the ability to change up your team's name, the worms' names, their victory animations, and basically all the bells and whistles that the DS game had last year.  The landscape editor is extremely simple, but it works, and levels can be taken from the editor and played in multiplayer matches easily and quickly.  The overall menu interface for the game is a bit off in our opinion though, as the icons don't really stand out, many of the buttons and arrow keys are small (it's IR supported, so bigger buttons makes for easier navigation) and the whole interface has a bit of a first-pass look to it.  Even the pointer smoothing could use a little work, as it isn't as quick or responsive as other Wii games on the market.  Still, for what it is, A Space Oddity is a nice first step towards what we hope is a longstanding series on Wii, and the comedic VO and CG work is appreciated on a system that commonly lacks both.     So with the current version of Worms hitting shelves, and a sequel most likely in the works on Wii, what steps should gamers take concerning A Space Oddity?  Well, considering Team17s track record on DS we know that the first game sets up the core functionality and aims to make any tweaks necessary, while the second installment polishes up the entire experience, adds more functionality into the game, and makes for a very impressive package.  If that same strategy is being used here on Wii (and we can only assume it is), that means were seeing a very successful control mechanic put in place, a large amount of customization both in the team setup and landscape editor, but will see even a larger step down the road.  A Space Oddity is a much stronger offering than the first Open Warfare was on DS, so if youre a rabid Worms fan and were counting on this one for some entertaining local play, itll deliver.  The weapon control is fresh and fun, theres still a huge list of options, and the CG and voice work inclusion certainly helps.  If you were hoping for a robust online experience, however, that will have to wait for A Space Oddity 2, which were sure will be coming sometime down the line.  If nothing else, give this one a rental or look for it on the cheap, as the new weapon controls make this one truly unique on Wii.", "date": "Mar 13, 2008"}