{"name": "The Mummy", "name_review": "The Mummy", "ref": "https://www.ign.com/articles/2001/01/05/the-mummy-7", "text": "The Mummy proved to be the dumbest (and therefore best) swashbuckling action titles of recent times, largely due to the fact that it followed the essential b-movie rule, that actors should say as little as possible, and that things should fall onto -- or near -- their heads at all possible times. An incredible soundtrack, some pretty faces, and some suitable B-movie special effects made the whole thing a perfect package when it was released... ten years ago? It's been so long now we can't remember. Now it's time for the long-awaited videogame translation of the movie, or as we prefer to call it, the ~oh right, I remember that movie~ game edition. Unless you've got an incredible game involved, attaching a bad game to a license only works if that license is fresh, hot, and ready to appear on the backpacks of Junior High students everywhere, or if it's Star Wars. Unfortunately, The Mummy is neither. Shallow, clumsy, and laughable, this is the game that will make you remember why you bought a PC in the first place. So you didn't have to play console game like this.  If you don't know the plot, than I suggest you rent the movie at your local Blockbuster/Hollywood video, or any one of the much-better independent video stores run by the depressed goth kids from the local high school Basically, you play as Rick O'Connell, a swashbuckler who mistakenly reads from the ancient book of the dead on an expedition in Egypt, bringing back Imhotep from his crusty slumber with the scarabs. Imhotep, of course, just happens to be a priest who betrayed the Pharaoh with his mistress, and was then cursed and sent to Imhotep, where he was buried alive. He's not a happy guy. You won't have to worry about him much in the videogame, however, because you'll be spending most of your time grabbing icons and slashing bugs with giant machetes.  It's no surprise that The Mummy is Tomb Raider rip off (both feature caves, bugs, enhanced chest muscles... you get the picture), but the amount to which the developer Rebellion has simplified the action and momentum of that title is amazing. Take the first Tomb Raider, and immediately toss out the exploration, than take out the fun combat play. Make sure to add lots of tiny treasure to collect, turn switch puzzles into the sort of entertainment made for tots on Fisher-Price interactive play mats, and you've got The Mummy. While you climb walls, find secrets, and auto-aim to your hearts content, just like Tomb Raider, you'll also have none of the wow experiences that made the original TR so fun. Instead, you'll simply run down endless corridors, killing a few mummies, humans, or scarabs here and there, and collect every gold object that you find. While it's monotonous, if you want to get farther in the game you'll have to keep a keen eye on gold. You can't save during levels, so you'll have to rely on collection to gain extra lives to keep you alive and well through the tombs. Even so, you can be guaranteed to replay a level five or six times, mostly due to the fact that health is sparse, and creatures can kill you in two or three hits. It's completely unbalanced, and turns an average level into a case of running, collecting, killing incredibly easy lone monsters, then dying instantly during specific areas when you're surrounded by attacking foes. It's easy enough once you anticipate the harder moments, but easy does not even resemble fun in The Mummy. And those switches I talked about earlier? You pull a switch, a door opens next to it. At most, you'll have to kill some creatures, get a special icon, then walk over to a nearby door and unlock it with the icon. Even the ~secrets,~ where you're supposed to light a torch and activate a wall plate before the flame burns out, are oversimplified to dizzying heights. Light the fire, turn around, and light the wall plate. It's all so ridiculous that you begin to wonder why the designers even bothered with the puzzles in the first place.  While we're talking about snoozy game design, I don't want to forget poor Rick. He might've cut a wide berth in the film, but he's a sorry state in this version, sporting a walk like Charlie Chaplin and a run funkier than Shaggy on the run from a Janitor in a shower curtain, hunched back and all. The engine is sloppy and imprecise, and getting him to recognize switches, ledges and corner can get real messy. By the time you have to navigate him in an underground log riding level (no, I'm serious), you'll be pulling out your hair trying to get him to just please please listen to your keyboard commands. Monsters animate well, but unfortunately the action consists of slashing them with a sword twice, and watching them die. Sure you've got two guns, some dynamite, and a mystical explosive device under your belt, but when a sword slice can kill anything within ten feet, there's little impetus to use anything else. The action is a matter of pressing a button and attacking, or pressing a button and watching Rick pull a switch. It's as repetitive as having to read me talk about it being repetitive again and again. But like I said, things get a bit repetitive.  There's no saving The Mummy. The gameplay refuses to deliver fun, and the graphics, which must've been bad on the PlayStation version, are dismal on the PC. Jaggy textures, flat details, and the worst draw-in depth I've seen in a long, long time (about 10 game feet) make the experience all the more painful. Characters are simple but passable -- that is, until you see them animate. The menu system suffers from console-I-tis, with little to no control over your option in-game, and a blotchy look and feel familiar to anyone who's popped a Final Fantasy title into their PC.  The voice acting ranges from s'alright to embarrassing, especially the Sylvester Stallone voice-in who seems to be filling Brendan Fraser's role for the game. The music, however, is the shining moment of the game, thanks to the incredible original Mummy soundtrack, used liberally throughout the videogame as well. Even the healthy, butt-chilling screeches of the mummies are taken from the film, making what could definitely have been brain-stem numbing action more like... well, brain-stem numbing action with some really fantastic death screams.  If you aren't going to be timely, you should at least be good, and The Mummy is neither. I haven't seen a belated game translation this bad since Blues Brother 2000 turned platformers into a pixilated version of bamboo shoots under the fingernails. Bad mummy. Bad mummy.  -- Vincent Lopez      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Jan 5, 2001"}