{"name": "X-Plane", "name_review": "X-Plane", "ref": "https://www.ign.com/articles/2001/01/06/x-plane", "text": "X-Plane has been kicking around on flight sim enthusiasts' computers for a while now. It started out as a grossly expensive, hyper realistic application for the die hard desktop pilot, but through Laminar Research's publishing deal with Xicat Interactive you can now own one of the most expansive flight sims ever written for under $40.   There's a lot about X-Plane for players to love, there's even a few things to hate, but the heart and soul of this title and the thing that will get you hooked is the way the flight model feels. If you've ever been in the front seat of a helicopter or puddle jumper, you know what it's like to look out of the cockpit and watch your environment go by. In small craft, it really does seem like you're floating. X-Plane has managed to capture that feeling perfectly, and the proof of it is when you switch to a heavy craft like a Boeing and the sensation is more akin to crawling through air, even though you're traveling at a higher speed.   X-Plane uses an engineering process called blade element analysis that is used by engineers to predict the performance of aircraft propellers and helicopter rotors. This technique is usually used just to predict the forces on the propeller or rotor, but X-Plane applies it to the whole aircraft. Every part of the plane, props, rotors, wings, and stabilizers, are broken down to determine the force on each piece and then added up to determine all the forces at work on an aircraft. The result is a difficult to control Space Shuttle or the fluid movements of a Cesna. X-Plane's flight physics also handle the differences between subsonic and supersonic air flow, so aircraft respond appropriately whether they're going 90 knots or Mach 2. The physics are so well modeled that X-Plane is able to simulate flight on Mars, but more about that later.  The saying ~Variety is the spice of life~ must be a credo for Laminar Research, because there is so much packed into X-Plane that it could easily have been a single game and several expansion packs. First, lets talk aircraft. There are over 40 that come with the game and more can be downloaded for free. We've got the Concorde for speed freaks, the F-22 Raptor for the Top Gun in you, Cessnas and other small aircraft, Boeing 747s, Huey helicopters, the SR 71, gliders and of course, the Space Shuttle. The way the game was designed, any aircraft ever built can be easily modeled and made available for flight. Of course, this also means that any aircraft you can imagine can also be built and made available for flight, assuming it stands up to the laws of physics.   If the 40 plus included aircraft and the ones you can download aren't enough, the included Plane Maker application will let you build aircraft from the ground up. Always wanted to feel what Orvil and Wilber Wright felt at Kitty Hawk? Rebuild their plane and take it for a several meter flight! The application itself is relatively easy to master, but creating aircraft that are flight worthy is another thing altogether. My first plane couldn't get off the ground.  Earthbound flight can get a bit tiresome, so why not try your hand at atmospheric re-entry in the Space Shuttle or cruising around the ultra thin atmosphere of Mars? Using data from NASA, X-Plane has recreated the controls of the Space Shuttle for your flying pleasure. Using one of X-Plane's instant action settings, you can bring the Shuttle in for a full re-entry sequence, or just try landing that brick at Edwards Airforce Base. For your information, the astronauts use a computer, but you have to do it by hand. Maybe that's why I keep crashing...  Hard core sim fan are going to love flying on Mars. Again, using data from NASA, X-Plane has recreating the Martian atmosphere, complete with lower gravity and lower air density. What this translates to is ~no banking on Mars~ because there is nothing for your wings to grip. The lack of air resistance also makes landing next to impossible. Of course, you can't use any existing aircraft to fly on Mars, so using that ever so flexible Plane Maker, there are two Martian craft for pilots to learn.  So far, we've really just tried the icing on X-Plane's cake. Lucky us, the rest of it is just as good. The controls for the bulk of the aircraft in the game are accurately re-created and you can adjust flaps, lower gear, and increase throttle by using your mouse on the appropriate controls. X-Plane also supports the standard array of flight controllers and a very easy to use menu makes mapping levers and buttons to your joy stick or yoke a snap.  X-Plane gives you full control over weather conditions to create additional challenges for seasoned pilots. You can generate anything from gale force winds to random micro bursts. If you want hyper realism, you can set the variables, make a flight path, and have the same chance of encountering adverse atmospheric conditions as a real pilot.  You can land and take off at any airport in the game, but you can also jump into predefined scenarios as well. Some of the more interesting ones include landing a chopper at an off shore oil rig, or landing on an aircraft carrier.  X-Plane makes extensive use of voice. During landing and takeoff, the tower will communicate with you verbally. There is also quite a bit of cross chatter in areas where lots of planes are flying. Expect lots of company at LAX. Beyond that, the sound effects in X-Plane are on the mundane side. Routing engine noise and the squeal of tires on tarmac.  The one area where X-Plane kind of tanks is graphics. The countryside is a vast landscape of brown and green with occasional smatterings of white or blue. Buildings are monolith like rectangles that stick up out of the ground. The aircraft themselves don't fare much better, being constructed of precious few polygons. The realism of the aircraft is entirely dependent on the level of detail that went into the models, which is a mixed bag. If the graphics really bother you though, you can just change them with the World Maker, a tool that can be used to create new textures and objects for the X-Plane world.  X-Plane is an interesting game for a lot of reasons. For purist sim fans, X-Plane is as close to a flight trainer as you can get without joining the military or spending buco dinero at flight school. For amateur pilots, there are a lot of opportunities to just jump in and fly without worrying too much about some of the finer details of aircraft controls. Another plus is that X-Plane has a lot of craft that are unique to this game. And finally, thanks to the robust do it yourself tools that are included with the game, there is a huge community of X-Planers out there building new planes and places to fly them. If you want to fly and can't afford a private Cessna, X-Plane is the next best thing.  -- Ric Sanchez      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Jan 6, 2001"}