{"name": "Bases Loaded", "name_review": "Bases Loaded Review", "ref": "https://www.ign.com/articles/2008/04/16/bases-loaded-review", "text": "America's favorite pastime is back in season again, as once again the teams of the MLB have taken the field and begun the long march to October. Sadly, Bases Loaded is hard to get too excited for. The are already far superior baseball games on the NES (in the form of Baseball Stars 2 and Baseball Simulator 1000 among others), so spending the money on an older, less attractive, feature-lite NES edition of the same sport isn't all that inviting an idea. The new season association falls short.   Bases Loaded certainly is an important game in the history of Nintendo sports titles, though. This game, developed by Jaleco, was the beginning of a long-running franchise that ultimately included four different installments on the NES, three on the Super Nintendo and one on the PlayStation. It was the most regularly revisited baseball brand of the 8-bit era, and as such, has amassed a fair following of fans that first experienced at least one of its editions in the early '90s. Too bad this is the first one, the most basic one of them all. Bases Loaded's many sequels might have progressively updated the design's features, graphics and gameplay, but this original trip out to the ballpark is about as barebones as it gets.   The convenient inset map in the upper left lets you know how Loaded the Bases are. You take the field as one of a handful of generic, unlicensed teams -- the MLB wasn't in the business of allowing videogames official use of its team names, players and logos yet when this game first arrived in the '80s -- and your opposition is similarly unspecific. You then decide on which of your pitchers to pull out of the bullpen and put on the mound, guided only by their last names and a single numerical rating gauging their strength. Those decisions made, the game begins.   Just don't expect much action. Bases Loaded is largely lifeless in its over-the-pitcher's shoulder standard gameplay view, as there's very little animation and even less gameplay to experience. As the pitcher you have little control over the ball's flight to the plate. Most other baseball games give you considerable influence over your pitches, letting you throw faster or slower, or mixing things up with curveballs and sliders. But Bases Loaded's equivalent interaction is watered down and pretty boring. You can't even intentionally bean the batter every time you want to. It's disappointing.   And batting's not much better. You can bunt the ball by bashing the B Button, then guiding your bat up and down to try to strike at the right height of its flight, or else you can swing away by hitting A. When slicing for the homer, you can choose from three swing heights -- high, low, or right in the middle. For basic 8-bit baseball, it's about what you'd expect. But what's disappointing is that your man can't move around in the batter's box. His feet are firmly planted in place, meaning there's no adjusting your position to back away from the pitcher or crowd the plate.   Fielding is fine, as recovering hit pitches in the in- and outfields is easy enough and throwing to each of the four bases is a simple matter of pressing a combination of the D-Pad and the A Button, but overall there's just really no piece of Bases Loaded's gameplay design that feels truly fun. The liveliest part of the package is its brief cinema scenes that show a cringing pitcher after a batter belts a homer. Even playing with two players doesn't make it more interesting.Bases Loaded isn't a terrible baseball game, it's just incredibly basic. It's also harmed quite a bit by the fact that that other more competent baseball games are already out there. Fans who followed Jaleco's Bases Loaded series in the late '80s and early '90s might still want to their nostalgic fix, but for everyone else, it's a passed ball.", "date": "Apr 16, 2008"}