{"name": "Odyssey", "name_review": "Odyssey: The Search for Ulysses", "ref": "https://www.ign.com/articles/2001/01/17/odyssey-the-search-for-ulysses", "text": "Ulysses wandered for ten years after the fall of Troy, finally reaching his home of Ithaca (Greece, not New York) after numerous tribulations and deviations. That's a lot like the feeling this game gives me. Ulysses' journey ended with him coming home to a faithful wife, a loving son and a dead dog. I have no idea whether or not the game promises the same level of fulfillment, because, quite frankly, I wasn't willing to waste ten years puzzling it through all the way to the end. This is adventure gaming at its most mediocre and it's barely tolerable...barely.  You play as Heriseus, an envoy from Ulysses wife, Penelope. You have been sent by her to find out why Ulysses didn't come right home after the Trojan War. Heriseus is an entirely fictional character created for the game but he'll wind up interacting (i.e. talking and killing) with many characters from the myths. You'll get a chance to fight with a Gorgon, a pair of Cyclopes and even Poseidon himself. Sounds fun, right? Brother, you couldn't be more wrong.  Perhaps the biggest complaint that can be levied against Odyssey is that the puzzles are based far too much on trial and error. If you're like most of us, you're nowhere near as patient or resourceful as the wily Ulysses and this is a big handicap in the game. For instance, once you reach the city of the Lotus Eaters, you'll have to mix up this potion by mixing water with seeds and cloth. Cloth? Okay, maybe this is some type of Greek thing, but it still seems kind of off to me. And once you've got the potion worked out, it's a real bitch trying to figure out what to do with it.  The action is also moved along through the various conversations you'll have with the characters in the game. For the most part, these are really scripted. You get a list of conversation topics with each character. Ask the first one, wait for the answer, ask the second, wait for the answer, ask the third, wait for the answer, etc. Occasionally there are some real choices to be made within the conversations, but they seem pretty constricted for the most part.  But almost as frustrating as the puzzle concept is the fact that the damn interface doesn't seem to work in certain situations. Fairly early in the game you have to collect 12 tiles and place six of them in particular spots in a gate. During this whole sequence of the game, I was totally and inexplicably unable to access the inventory screen. As soon as you pick up a new tile, the one you're holding goes into your inventory and becomes inaccessible.  After a half-hour of screaming and yelling, I wound up having to go grab a tile, run to the gate while it was still in my hand, and find it's place on the gate. Once that was done, I ran back to get another tile...and so on. Gee, think how much easier this would have been if I had just been able to throw all the tiles in my bag (which holds a lot more than tiles most of the time) and try them out all at once. And once you've got that figured out, you've got to grab several different statue pieces and place one of them on a pedestal. Then you've got to swap that piece out with another and then switch them back. While the puzzle itself is a little ridiculous, it just seems even more frustrating because you have to start worrying about the order in which you pick up things.  While I still don't love the mix of pre-rendered backgrounds and polygonal characters, Odyssey really makes it work better than any other game I've seen. It's the standard setup we've all come to expect with our adventure games, but Odyssey takes things a little farther. First off, the characters are situated in the environments with a much more realistic perspective than is usual for these games. And the perspective on the backgrounds isn't fixed either. As you move around the game world, the camera pans with you slowly changing the perspective of the game world. It's a neat effect that keeps things from seeming so monotonous. On that same topic, I should mention that the camera angles and the transitions are uniformly well chosen.  Anyone who's played an adventure game knows how to spot a usable object. It's the sharp looking thing that seems to be glowing against the smooth, flat textures of the background. Odyssey blends these objects into the environment much better than any other game I've seen. If an object can be used or picked up, it won't be sticking out of the environment like a neon Budweiser sign in a dusty attic. Now once you pick up the object, it does get that cool, vibrant quality and once you set it down again, it reverts to a duller, less conspicuous state. It's not much, but it did keep things from seeming out of place (and made them much more difficult to find).  DreamCatcher Interactive has had some hits and some misses with their adventure games. Odyssey definitely has its share of strengths but it falls short by relying on a tired puzzle model, an unstable interface and sluggish story development. I didn't mind the look of the game as much as some of the other guys around here did, but maybe that's because I was trying to find something good to latch onto in this game. By the time I had spent a few days wandering around the world of Odyssey, I was sure I never wanted to return.  -- Steve Butts      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Jan 17, 2001"}