{"name": "Warriors of Might and Magic", "name_review": "Warriors of Might and Magic", "ref": "https://www.ign.com/articles/2001/01/18/warriors-of-might-and-magic-6", "text": "For some reason, 3DO insists that people want this game. Last year, the abomination that was Crusaders of Might and Magic struck the floor with a deadly thud, and few people wanted it or bought it. And yet, we have another Might and Magic game on our hands this year. Apparently, 3DO believes the old adage, ~If at first you don't succeed, try, try again.~ And they added this little extra sick part, ~If that doesn't work, put ads on Saturday morning and pummel the kids until they buy the games.~ That has worked quite well with Army Men, so far. The console versions of Might and Magic haven't reached the stage yet, but they may soon enough.   Let's use a analogy that probably won't work, OK? Warriors of Might and Magic is kind of like a bad burger in your hometown. It is a burger, right? I mean, that in itself means there is some redeeming qualities about it. Everybody loves burgers. They are the one true American food. So are action games. And yet, it's a bad burger, so it tastes really bad, and has some kind of funk to it -- even with extra BBQ sauce, extra pickles and extra slabs of bacon. You simply can't hide the taste of this game. So, do you like it because it's a burger sold by the neighbor next door, or do you simply drive through the In-'n-Out and get the real thing? Ahhh, burger philosophy...   Gameplay Warriors of Might and Magic a good game in a few surprising areas, and to be honest it's much better than last year's Crusaders of Might and Magic. Of course, that's not saying much, since that received a generous 3.0, but it is a step up out of bad burger hell. First of all, the interface is simple and well thought out. Everything is automatic, glimmering and fast. The basics are introduced in the first five minutes of the game and then it's all pretty much hack and slash from there. But Save Points are very well done, and other game developers should take note. Players simply walk through shimmering arches and they automatically save. There are no extra steps. It's fast and easy, kind of like fast food joints. Kind of like a place that sells burgers.   OK, so the save points are great. What's also nice is the feeling of being rewarded. When you find that boss creature you knew you'd find, and you beat him, a shimmering new piece of weaponry floats down from the heavens and into your arms. It's also nice to see -- and almost feel -- the level-ups, which are a little dramatic... OK, so dramatic that they're silly. But in a silly way I liked them. For all of the good that the streamlined interface gives us, players never know how well they are doing against a boss. Why? Because there is no boss meter. It seems they simply die after enough punishment.   Much like another hack-and-slash action game, Gauntlet Legends, Warriors of Might and Magic is all about kicking monster butt and collecting the goods, and in just about every way possible, Warriors mimics, or rather, goes so far as to copy Gauntlet Legends. When you reach a treasure chest...boing! Out come the gems, orbs and keys. Oh yeah, that's another close similarities, keys. You have to collect keys to open chests...And then there are the transporters, and the creature generators, and...is that enough?   But despite the similarities to another action game, for better or for worse, Warriors is a dumb game. It's been streamlined game, which is good, but it's for people who simply don't want to think, or real dummies. It's like a burger that automatically is fed to you. You don't even have to chew, just taste. For instance, you earn better and better shields throughout the game. But can you actually use them? No. They only represent your armor. There is no blocking in this game, just like in...well, you know. Also, the fighting sequences are totally mindless. From the smallest to the biggest monsters, the only real strategy to attack is to run in and start slashing away. Even worse is that the enemies are pretty dang stupid on their own. Their patterns are as easy as Sesame Street songs. Some even back up before they attack. In one case, a gaggle of enemies were jumping and dancing around in a circle while I simply hurled fireballs at them.   With controls that are boil down to jump, attack, cast spells, walk and climb walls, players should never feel like they'll be at a loss. Hacking and slashing has never been easier. And yet, the controls could be much better. When an enemy attacks and stuns you and you can't fight back because you're stunned, how are you supposed to win a battle? It's rare, but it happens. Lastly, is the long-distance spell casting. The controls don't appear to permit full 360 turns. If they did you could pinpoint an enemy from a long distance away, and then cast a spell and hit them. But with this control scheme, you cannot do that. Ho-hum...no big deal, but it's just another reason why this burger doesn't taste that tasty.  Graphics Good thing: this game has a fast framerate. Bad thing: The animation is crap. It's the essential compromise with most PlayStation games, and Warriors is no exception. The lead character and most enemies most at a fast clip, and therefore enable you to feel like you're moving where you want to go when you want to go there. But the speed comes at a cost, because the animation sequences end up looking like a character dancing in a strobe light. These characters just move with a lot of funny, repetitive, and clunky animations.   Warriors is a decent looking game on the whole, though, and despite the obvious character designs, some of which were to see while others left you dulled, it won't hurt your eyes too much. In fact, Warriors is packed with great special effects. Shimmering surfaces, lighting effects, and transparencies make up a lot of what is good looking in Warriors, and I was quite surprised to see how much was going on. Alleron looks a little bit too much like Batman, with his mask and all, but hey? So what? If Warriors had come out about two years ago, it might have been a breakthrough game. But as it is, it was issued at the end of 2000, and nobody seems to care.   Sound ~Argh!~ Argh is the key sound that your character makes, whether he's in pain or whether he's simply jumping from platform to platform. I'm not sure what was going on here, but his simple grunt here is the real metaphor for the game itself. Feel like pounding on something? Like flattening out some hamburger meat? Or crushing a tomato? Warriors is your game, and if you want to bring the game to 11, just add the extra little ~Argh!~ and you'll be there. The little bit of voice acting in the game is also funny, but not because it was meant to be. At one point you reach a talking crow, and when you discuss how he can help you he starts spelling out words like ~c-a-n-y-o-n,~ ~b-a-t-s,~ and ~s-w-a-m-p,~ which seems real strange. He also appears as if he is from Brooklyn. Strange, but true. Also, your lead blond bulk of muscle, Alleron, says things that are all too reminiscent of Indiana Jones. ~Bats, why did it have to be bats? I hate bats.~ Snakes, bats? What's the real difference, eh?   Other special effects are drastic, bombastic, sudden, and mostly out of place. You beat some boss and then instantly the camera jolts you into full blaring horns or whatnot and you're looking at the new weapon. Also, back to Gauntlet Legends again, when you open a chest, you hear harps and chimes, and it's almost too silly to believe. The sound, as with pretty much everything else in Warriors, is so frickin' obvious that it becomes a parody of itself.Warriors of Might and Magic is a better game than Crusaders of Might and Magic, but if you really want to play Gauntlet Legends then you should really buy the Nintendo 64 version and play the real thing. It's four-player and relatively fast, and you can choose the player you like. Warriors, however, while not a genuine game, does have an amazing sense of arcade play. You smell the compelling scent of sizzling ground beef just around the corner, and you keep playing just to see what the next big prize will be. I don't know, though, I had fun playing Warriors despite all of its weaknesses and hapless mimicry. There's not too much to it, which is strangely nice. You just pick up the controller and play, no brains needed. There is a need for that in videogames, right?", "date": "Jan 18, 2001"}