{"name": "Ground Control: Dark Conspiracy", "name_review": "Ground Control: Dark Conspiracy", "ref": "https://www.ign.com/articles/2001/01/18/ground-control-dark-conspiracy", "text": "Expansion packs unfortunately get the dubious distinction of permanently falling in the shadow of their predecessor. Rarely is there an expansion that can rise out and really show itself as good or even better than the original game. One such expansion pack would be StarCraft: Brood War. Unfortunately, one game that wouldn't fall under this category is Dark Conspiracy. While it does have its moments and some neat little tricks, it suffers from some incredibly slow gameplay and the same pathing problems that Ground Control did...and we don't care if it is free to owners of the original.  Okay, we care a little bit.   But let's first talk about what they did right with this game. The story, first off, is seamlessly woven into that of the original game, which really gives you a feeling of being part of the continuing struggle to stomp all over the crazy religious fanatics of the Order of the New Dawn. The game begins with you taking control of the remnants of the combined forces of Sarah Parker's Crayven troops and Deacon Stone's Order troops. They have formed an alliance that looks to go a little farther than just convenient combination of forces.  The first problem that you need to overcome is getting off of Krig 7B, the planet where the first game took place. After that you'll find out about a deeper conspiracy in the Order of the New Dawn that played a part in the events of the first game. As you learn more about the plot, you'll be drawn deeper into the midst of trouble and some pretty hectic battles towards vengeance and the hope that you'll finally know what in the hell is going on.  When get into the game, you'll immediately realize that none of the interface has been changed, which is both a blessing and a pain in the ass at the same time. Ground Control was one of the first real 3D RTS games to be released and still has, in my humble opinion, the best system for troop movement and control that I've seen in the genre. The problems stem from the pathfinding problems that the ground vehicles undergo when moving around the map. Ground vehicles come in the form of up to four units that work in concert. So while they are actually separate units, they all take the exact same orders. The problem is that when moving troops, if your troops are in a box formation, the two tanks in the back sometimes start off faster and run into the front two units, which promptly confuses them as they start playing bumper cars laughing hysterically and falling behind the group.  There is also a certain space that each tank needs in order to feel comfortable about themselves apparently. Ground vehicles are not allowed to violate each other's personal space, which can be really annoying as there looks to be plenty of room for tanks to drive through the gaps in a formation, but they never do, they end up wandering around the entire formation trying to find their places.  But besides that, the engine is still pretty and the tactics are certainly still there. And they've added a new faction into the mess, which you will be controlling for most of the game. Seeing as Sarah Parker strayed from Crayven and Deacon Stone strayed from the Order in the first game, they weren't expecting to receive any help from either faction, so enter the Phoenix mercenary group. You'll recognize a lot of the unit types from the others including the scout, light, medium, heavy battle, artillery and anti-air hoverdynes, and the regular old marines and command vehicle, but there are some new units up their sleeves that are a whole lot of fun.  New troops include the snipers, grenadiers, and armored marines (a bit like mini-mechs). The grenadiers pack quite a whollap if you can hit something with them, their arc of fire is fairly slow allowing them to hit only slow targets. A new anti-personnel vehicle comes into play as well called the Pyrodyne. This thing rolls up to groups of marines and cooks them up Texas bar-b-que style... nice and crispy. Just don't think you'll be able to take out those pesky Torpedo Templars with them. The Templars are more maneuverable and will eat them for lunch. But the keenest of all are the new Phoenix Swarm Aerodynes. You get six to a group and while their attack level is low they unload a whole lot of rockets into whatever they fire at as well as being quick and hard to hit. They don't have a lot of armor, but when you get four groups of these guys attacking, you can lay waste to a pretty sizable army. The only problem may be that they seem a little bit unbalanced as you can take out flights of fighter aerodynes and groups of anti-air units with only a few casualties. But still a fun addition nonetheless.   But even with all of these new units and some crazy battles, the game suffers from some mediocre mission designs. Often, you'll find yourself having to memorize where attacks come from in order to prevent losing a mission. One mission in particular calls for the protection of a base while reactivating its defense system. The only reason that you'll lose the level is because you didn't know that there were going to be some huge forces that appear right in the wrong place, so while you're following orders trying to wipe out the attackers, a huge gaggle of enemies will bend you over and make you feel uncomfortable and there will be nothing that you can do about it in time except start over and plan for it to happen next time and keep all of your forces stationed in that place waiting.  Which is another thing that seems to happen a lot in the game. You have to wait. Wait for things to attack, wait for things to escape, wait for the enemy to do something, but wait nonetheless. And for minutes at a time in some cases. All that did was really make me hope that I could finish a mission the first time around so I wouldn't end up having to wait things to happen all over again. It could have been saved with some kind of save feature. One of my biggest complaints the first time around remains. There still is no save feature. I understand their reasoning that it makes the game more challenging, but at least allow players to save once during a mission just so they can start where they won't have to do all the maneuvering to get your troops in position to attack, which really can be a while with all of the tanks playing bumper cars.  But I think I'm sounding a little too harsh here because the game really is still bunch of fun when it comes down to it. Most of the levels give a bit of challenge and some diversity to the gameplay. There are quite a few different mission types during the course of the game, and while not all are totally successful, all of them provided me with a bit of entertainment. The sound and graphics are still very good and the fact that the game is free to all of us lucky enough to live in North America is a huge plus. If you own the original Ground Control, and you don't send the five bucks in to get this game, you're seriously in danger of your children falling backwards on the evolutionary ladder. I'd still recommend Dark Conspiracy to fans of Ground Control if it was the price of a regular expansion, especially with the new multiplayer modes and maps. Send in and get it if you haven't yet.  -- Dan Adams Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Jan 18, 2001"}