{"name": "Metropolis Street Racer", "name_review": "Metropolis Street Racer", "ref": "https://www.ign.com/articles/2001/01/20/metropolis-street-racer-2", "text": "In life, people have a habit of coming to depend on certain things as absolute. They get so used to seeing them that the idea of anything else residing in the Throne of Truth strikes them as nothing short of nonsense. Such as the Vikings choking in the NFC finals.  Or at least 3 fistfights on any given episode of Jerry Springer.  Or, for you video game freaks, Bizarre Creation's Metropolis Street Racer being in the eternal throes of development hell.  But then it occurs...like Keanau Reeves not annoying the hell out of you in a leading role...or the return of the lunchbox, reality drops a bomb in your lap that changes you forever.  Or in this case, Someone at Sega lets their guard down for 5 seconds and somehow, MSR manages to ship.  Now, I've been playing this game for, oh, I dunno, 4 months now, and had finally just resigned myself to having fun in spite of your inability to partake in its goodness.  I have to confess I am a bit irritated that retailers across the country were so rude as to interrupt my good time by forcing me to sit down and review this sucker, but hey, what can you do, really?  That said, let's get few things out of the way, right off the bat.  First of all, yes, this game is piss hard. And no, it isn't ~too hard,~ ~too difficult for its own good,~ or ~so hard it ceases to be fun,~ but rather is the type of game that displays an early learning curve, persistent increase in difficulty, and a continual challenge to even the most experienced driver. Heaven forbid. Metropolis Street Racer's structure is all about teaching you how to drive, and if you play your kudos right, teaching you how to thrive.  It may spank you a bit, and it will irritate you on occasion, but by the same token, this game will reward those who are looking for a good race.  It's almost kind of funny. As much as it breaks the heart of the average gamer to think that they might actually have to display some skill, the last time I checked, the concept of a race is one in which multiple contestants attempt to beat each other to the finish line. In terms of this idea, MSR excels like nobody's business. But some people will still complain.  You can't really blame them, as they been conditioned to have their hand held through almost every gaming experience in the last 5 years. But I have to admit I am a bit disgusted by all the reports I have seen about this title labeling it as a game of supreme difficulty. Reason being is that I am about as casual a racing fan as you'll come across in my business.  For the most part, I hate racing sims. And to be honest, if I can consistently remain 2-3 chapters ahead of my required race, then MSR can't be that hard.  Yah see, Metropolis actually went out of its way to do something extremely different in terms of its structure, and though it troubles some people, I just couldn't get enough. You progress through the game by amassing ~kudos,~ which are basically performance points centered around MSR's tagline: ~It's not how fast you drive.  It's about how you drive fast.~  The way the game is set up, each race has its own significance, and to fully take advantage of this set-up, you will be required to master both the courses and the vehicles you drive, and to top things off, it rewards those who can do so while maintaining a certain sense of Hollywood-style flair.  You can also up the ante by predicting your outcome, and the more ballsy you are, the more kudos you can earn.  The more kudos you get, the more races, cars, and chapters you can unlock.  It is certainly a bit more tedious than your average racer, but gives MSR a unique sense of replay value that few racers have to date.  I found myself playing each track until I was sure I couldn't top my last performance, and sometimes, this would mean taking a particular course on for hours at a time.  And the amazing thing is, this didn't bore the snot out of me.  I typically hate sim racers, and find myself on the verge of sleep in a matter of minutes with any game that dares to get off to a slow start, but every so often, there was a glimpse of hitting a turn just right.  The feeling that, yeah, I can hit that angle again.  It made me want to press on, because if I could just come out of that turn at 80 MPH instead of 57, man..my lap time would just DESTROY that record, and then I'd be able to unlock that slick new Mercedes I've been eyeing.  Metropolis manages to thrive on the idea that gaining complete control over one's vehicle is the goal. So much so that you can take that 90 turn at 70 MPH while threading the needle between two other opponents and come out of it even faster without blinking.  It is tough as hell at first, but once this becomes a habit, it really can be a rush. This is thanks largely to some incredible control, as the more you race with each car, the more you learn the ins and outs of how it works, and the easier flashy driving becomes.  But to get away with this sort of stuff, you have to answer some big questions for each car: What makes it came out of a turn faster?  How you can avoid spinning out?  How easily you can overtake someone in a tight spot?  What part of the track your car will respond to the best?  How do you counter-steer? It's a real education, and for most racing fans, it is the type of experience that will leave you feeling like a king once you figure out how to get the most out of your vehicle of choice.  In this sense, the control is so distinct and so rewarding that each new car seems like an entirely new game.  As you master the handling on the newest ride you've managed to unlock, you'll see why this game got held so long.  Bizarre wanted to hit this nail square on the head, and from a control standpoint, you really get the feeling that they have.  This game is a prefect marriage of an arcade racer like Ridge Racer and a tighter sim like Gran Turismo, and while it carries one of the steepest learning curves I've ever seen, that is exactly where the challenge lies.   And you'll need to be on top of the control, because the track isn't the only thing you have to worry about.  The AI in MSR is pretty vicious. They are a bunch of defensive-driving, lane-clogging punks, and just love to try to drive like real people.  They cut you off, use their ability to accelerate at the right time, and try to force you into walls, other cars, and other obstacles at every opportunity, and even after you have mastered a track, they will push the envelope and force you to beat them.  I did notice that, rather than randomly generate a course, the cars seem to race on a set path, and react to your presence as needed, and then set back in to the nearest available line.  It was somewhat annoying, but the cars do such a good job of reacting that it is anything but noticeable.  Also, when you factor in your own necessity of adapting to a path to finish with any proficiency, it seems less like the AI is robotic, and more that these guys just know how to move.  Overall, I'd say they did a pretty slick job with the bad guys in Metropolis.  They are annoying, persistent, obstructive, and competitive, yet not impossible. They keep you interested, and make every race seem like a monumental event, and that, in and of itself, is quite an accomplishment in my mind.  As for the tracks, well, this is kind of up and down.  I found it really cool that the courses actually reflect real locations, and having been to several myself in SF, London, and Tokyo, I can tell you, the game did a good job of virtually realizing the physical locations. But a lot of the time, the tracks are bit too angular for their own good, and I was a bit let down that you can't EVER leave the ground for any reason. A more Ridge Racer-y feel on the jumps would have been welcome with a city like San Fran, that's for sure.  For the most part, each track had something to offer, and checking out the scenery was cool, but until you unlock the major routes, some of the middle courses can get a bit ho-hum.... this game is based on actual cities, afterall.. Thankfully, the control and AI make up for an otherwise cookie cutter existence, and the shift in scenery occurs often enough to make things seem a bit more fresh than they really are.  Visually, this game isn't exactly the best looking racer on the market, but it passes muster.  The shift in time of day in accordance with the Dreamcast's internal clock is cool, but not exactly a life changing experience.  The game is terribly ~jaggified~ in some areas and occasionally too damned dark for even the best headlights without some help from our friend Mr. Brightness Level, and even at 30 FPS it suffers from some slowdown. Considering what we've seen from the likes of TDLM and Ferrari, we're quite sure this wasn't necessary, but the actual architecture of the game makes up for the title's overall lack of sharpness. With the number of cars this game pushes, it is a shame it doesn't move at a faster clip, or at least feature some mean anti-aliasing, and outside the audio, the graphics are the only major letdown in an otherwise brilliant piece of software.  It isn't that the game is ugly, necessarily...it just ain't that pretty at this stage in the DC's life cycle, and I had hoped for more.  Speaking of the audio, I feel it is my duty as a fellow gamer to mention that Metropolis Street Racer features one of the most overtly annoying soundtracks ever burnt to a GD-Rom.  I mean, Sonic R was some annoying stuff, but good god, this is just offensive. ~She had to buy some underwear and asked if I could take her there.~  Come on, Bizarre.  Is this supposed to be funny?  Being from San Francisco I can tell you that hardly anyone listens to country hear, and even outside that poor attempt at generalized humor, few people on this planet have the desire to race to slow, sappy, poorly written tunes from a bunch of Hee-Haw rejects. And the ~pop~ isn't much better...some Will Smith wanna-be who can't even rip off his stuff in an acceptable fashion.  Pretty poor considering how blatantly commercial he is.  Why not just license some unknown electronica or punk to score the scene?  I am sure you could have found dozens of bands who would have given you tracks for the exposure right here in the Bay Area. But this?  ACK.  I just had to turn down the volume and crank up my own tunes.  A far cry from the likes of GT2, where top 40 bands lined up to be on the playlist.  The saddest part is, this ruined the sure-to-be-copied ~make your own cd~ feature, as I had little desire to listen to anything this game had to offer.  The car sounds are cool enough, though I am a bit disappointed that the only time I got to experience the roar of a good engine was from the cockpit view. *sigh*  I suppose I should also mention the multi-player, but in truth, there isn't much worth mentioning, as it is pretty forgettable, due to the reduced camera killing the visibility, the frame-rate taking an even bigger hit, and of course, the inability to honk one's horn in a taunting fashion. Metropolis does include some cool modes, and if you can handle a choppy framerate and reduced field of view, you may like it, but to be honest, I had more fun trading laps for top times with my friends than I did going head to head.  I will say that the 'Net mode does give it a little life outside the typical single player experience, but not much.  Thankfully, though, what is here in the single player experience saves this game from being a lot more irritating than it could have been. When all is said and done, MSR isn't revolutionary in the areas you take for granted in a next generation console racer, but it is in all the ways you hope it to be.  What it lacks in the visual and audio departments, it more than makes up for with near-flawless control and challenging AI.  I almost see Metropolis Street Racer as the racing game for people who don't like racing games.  I say this because it seems to break too many conventions to keep the traditional fan happy, abut at the same time, it does such a good job at executing, it will convert almost anyone who really opens up to its charms. For the first time in recent memory, a title has managed to challenge the way I play titles in the genre, as well as the way I hope see them structured in the future.  This game has a great sense of progression, difficulty and refinement throughout, and while it may be too difficult for people with little patience, it is one of the most rewarding gameplay experiences in the history of the genre.  If you don't mind doing a little legwork, this game will really give you a run for your money....that much you can count on.  Give it a look.   -- Brandon Justice, IGNDC", "date": "Jan 20, 2001"}