{"name": "Steel Beasts", "name_review": "Steel Beasts", "ref": "https://www.ign.com/articles/2001/01/27/steel-beasts", "text": "No one has to tell simulation fans that the future of military gaming is bleak. Why? The larger game publishers cite a dwindling marketplace and increasingly high development costs. As a rule, creating a technically proficient modern or historical military sim every 18 to 24 months is a Herculean effort, requiring development teams comprised of dozens of programmers, artists, writers and testers. The current sawmill mindset within the PC gaming industry is simply opposed to the deliberate nature of simulation development. What a bunch of hooey. Fortunately, there are exceptions to every rule.  In direct opposition to the accepted norms is eSim Games and its programming staff of one. In conjunction with Internet-only software publisher Shrapnel Games, eSim has produced Steel Beasts, an extraordinary representation of two of today's most potent main battle tanks, the US M1A1 and German Leopard 2A4; as well as strong representations of the battlefields of Europe, Asia and the Middle East and a fully-realized, battalion level, tactical planner. Steel Beasts is not as polished or flashy as recent sims, such as Falcon 4, or even 1998's M1 Tank Platoon II. But it is every bit as deep, compelling and satisfying as anything currently riding the shelves at your local retailer.   Steel Beasts does not attempt to portray itself as anything but a straightforward simulation. There are no glossy CGI movies. There is not a campaign, dynamic or otherwise. There are no voice-over instructional lessons. Nor is there is support for 3D acceleration cards or EAX audio either. In fact, sole programmer, Al Delaney, began the entire project as a post-graduate lark back in 1996. Initially, Delaney intended to create a new terrain-rendering engine, the simulation that it has become was born out of his own personal passion for the subject matter. I convey this simply to illustrate Steel Beasts is a carefully handcrafted product, a nice contrast to the corporate-marketing envisioned products that we have become accustomed to.     The primary goal of Steel Beasts is to involve the player in battlefield tactics from a first-person perspective, not to immerse oneself in exacting knowledge of every gauge, dial and scope nor force absolute adherence to strict military procedures and doctrine. You will spend the majority of your time scanning the landscape, moving your units and firing your weapons  though be aware that this is not the simplistic, forgiving environment of Novalogic's Armored Fist series. The AI within Steel Beasts is effective and their weapons kill, usually in two hits or less. There are over 40 missions within that cover conflicts in Iraq, Korea, Germany and North America; each of which is a distinct and self-contained experience. Scenarios vary from simple tank-to-tank encounters on up to company level engagements; all emphasize combined arms tactics, wherein you have command and control over multiple platoons of tanks, Infantry Fighting Vehicles (IFVs), artillery and even squads of light infantry.     Steel Beasts presents an astounding amount of detail, more than enough to satisfy the grognard, but not so much as to overwhelm the beginner. That may seem a contradiction, but eSim has devised an interface that is remarkably clear and concise, driven by a combination of mouse, joystick and keyboard; in fact, the game may be played successfully with any combination of the three. More than 20 tutorials are available which cover every major facet of battlefield tank management; from manning the main gun and its myriad of aiming and firing modes to sitting in the commander's cupola and directing traffic on the battlefield. Though the tutorials are absent of instructional voice-overs you may switch back to the text briefings at any point during; the lessons themselves present but a single concept each and are explained in straightforward language. It should be noted that the M1 and Leopard are vastly different weapon platforms with unique characteristics, do not expect to bounce from one to the other without an investment in their system specific lessons.  Even though the tutorials describe every conceivable situation that your tank might face, they barely prepare you for the single scenarios that follow. More than a dozen individuals have contributed these battles, written in the included mission builder. However, the result is a sometimes hit and miss affair with little or no continuity. They just seem to say, hey, look at all of the cool stuff we can do. Each mission begins with a text briefing that expresses objectives and predicts likely levels of opposition. A relief map displays routes and initial unit placements. Each of your units may be given specific waypoints and standing orders, including formations and route speed. Triggers may be set, a la Rainbow Six, in order to synchronize events. Your units will, however, react intelligently to combat situations, seeking cover if possible and returning fire as needed.   Once a mission begins you are thrust into your lead tank as the commander (TC), though you may switch stations as desired. When acting as gunner the commander will spot the most immediate threat and slew the cannon to face it. Switch to the TC seat and you can identify targets and relay instructions to the gunner who will then engage. Both roles are challenging. When the action heats up it can be difficult to determine the good guys from the bad guys, especially when using thermal imaging. Expect to kill a few friendlies, but there is no real penalty for your actions. You may not physically drive the tank, per se, instead you issue steering, throttle and waypoint commands to the AI driver. You may also jump from tank to tank and take charge of each, if desired. Keyboard commands are reasonably well laid out, but there is no utility for remapping them; however, enterprising players will discover a corresponding text file buried within the installation directory that may be edited in notepad.   The biggest problem, in some of the more complex missions, is recognizing which of your units is in the most danger and who is taking the worst beating. Most of the time you will only realize this when you jump into a tank only to discover it dead. Fortunately, extended use of the mission planner will allow you to shift your forces and judge where and when bad things will occur. That and the fact that the missions themselves are scripted make it easier to know what to do the second time through, and the third and the fourth. Enemy AI is exceptional at recognizing your units and firing upon them; fortunately there are three levels of difficulty available. Overall, the scenarios are winnable, but it will take lots of trial and effort. Steel Beasts is not a game to be played lightly. Significant time investment is required, but the gameplay is rewarding. The first time that you execute a successful pincer movement and catch the enemy at their flank will have you pumping your fists in the air and cursing aloud at your monitor; just don't let your girlfriend see you.  Despite the lack of 3D acceleration, the graphics engine delivers crisp visuals that effectively convey a believable reality. Tanks rumble across the terrain, kicking up dust and smoke in their wake; explosions rock enemy vehicles, often sending turrets flying high in the air; homes, barns and lifelike trees dot the landscape, which extends far out to the horizon. The terrain conveys either green rolling hills or brown sandy deserts, but there are no snow textures  yet it is still leaps and bounds better than Novalogic's Voxel Space technology. There are some graphical miscues, such as the goofy fireworks effect of artillery striking the ground and infantry, who appear to be wearing those shiny Intel costumes from a couple years ago. External views allow for easy panning and zooming, but there is no free camera mode  which would have been an invaluable reconnaissance aid. Each of the gunnery and command stations provide multiple means to assess the battlefield  most effective is the Thermal Imaging System (TIS), which illuminates heat sources in graduated shades of green, and is pretty much the only way to target and kill opposing forces during the heat of combat where smoke is used with abandon.  Sound effects are also uniformly good. Samples of ordnance being slammed into the breach, the turret grinding around its axis and the recoil of the cannon when fired are sharp and distinct. Your loader will let you know when the next round is ready to be fired and, depending on the scenario, other units in the field will report their enemy contacts. However, it is often hard to distinguish one voice from another, but then, that is the nature of war.  The manual is 80 pages in length and contains a wealth of excellent information in clear, easy language that thankfully avoids the overuse of military jargon  having been compelled to read one TRADOC manual after another while on active duty I can assure you that this is in your best interest. While the manual does not contain much in the way of technical information on the tanks and other vehicles in the game, however there are several documents and PDF files within your install directory that do provide this data; including an actual 500-page US Army training manual (TACSOP), the preface of which reads: The mission of this company is to meet this country's enemies on the field of battle and defeat them, as violently as necessary, and as quickly as possible. Priceless. Additionally, the official Web site (https://www.shrapnelgames.com/sb/main.htm) is overflowing with ancillary info, such as FAQs, utilities and other downloadable items.  If anyone is wondering why a game of such depth and breadth is only available online one need just consider the state of the industry last year. Microprose/Spectrum Holobyte/Hasbro were in the midst of final death throes over M1 Tank Platoon III and certainly had no appetite for another tank sim. Jane's Combat Simulations began winding down operations at Electronic Arts after USAF and F/A-18 failed to achieve initial sales forecasts, despite their late holiday ship dates and slim marketing support  sad, but true. Microsoft, really the only other major sim publisher, seemed content to focus exclusively on aerial sims. Nevertheless, Shrapnel Games is making a solid name for itself with small, well-conceived strategy games by mostly no-name developers. If you have never bought a game online before, let this be the first. Steel Beasts is fun, deep and challenging, everything a good simulation should be. That it was developed, in large part, by a single person in their spare time should be a lesson to the rest of the industry. It won't, but it should be.  -- David Kozlowski Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Jan 27, 2001"}