{"name": "Carnivores: Ice Age", "name_review": "Carnivores: Ice Age", "ref": "https://www.ign.com/articles/2001/01/30/carnivores-ice-age", "text": "Hunting games are so washed up.  Round about the time people noticed the Deer Hunter series had reached its fourth incarnation, public interest tanked.  It's understandable, because so many outdoor simulations debuted over the last two years that you couldn't take a step without running smack into a coyote, turkey, pheasant, or even rodent shooter.  WizardWorks hasn't heard the news yet, though, as their dino butcherin' Carnivores series just reached trilogy status with the release of Ice Age.  Unfortunately the phrase which immediately comes to mind isn't ~third time's a charm,~ but rather ~three strikes and you're out.~  As in the last couple titles, players are on Dino Hunt Corp.'s payroll once again. They've discovered an icy planetary region teeming with intelligent life and commissioned a few human predators with the intention of bringing home several grotesque trophies.  Using a company credit line, employees can initially spend up to 100 points buying equipment, weaponry, and hunting licenses for the mission ahead.  Skilled stalkers can eventually net enough cash through steady work to afford powerful arms like shotguns or sniper rifles and the right to track Wooly Mammonths and deadly Smilodons.  Until then, it's wimpy pistols and sparse hunting grounds that you're stuck with.  Getting rich requires tons of field work.  Although each beast is worth a set point total, using certain equipment such as a radar, camouflage outfit, or masking scent knocks a percentage off your grand tally.  But that's merely a cheap way in which replay value was added, since creatures take forever to bring down.  The humongous, pretty environments that host this adventure actually work against hunters, because without a radar, finding valuable prey is a crap shoot.  When located, dinosaurs may very well spot their tormentor or sniff 'em out and run like hell for cover.  One must then necessarily have these basic items and incur designated penalties to be even remotely successful at their task.  Frankly, this assignment is rotten as a stereotypical Englishman's teeth.  Players tromp through underbrush ad infinitum, searching for a likely victim.  A glance at the radar at any point reveals the countless miles of terrain which always separate you from potential targets.  Having spotted a dino, the challenge isn't whooping its tushie, it's catching up to the bugger.  Every breed of four legged creature easily outpaces their biped rival and spooks easier than a virginal teenage girl in a slasher flick.  Don't count on catching them often -- even with the run feature turned on, as you move like a snail and the extent of your stealthy repertoire is a crouch, jump, retarded sounding dinosaur call, or quick duck behind a bush.  Despite functioning on pea-sized brains, dinos take a proverbial dump on their allegedly intellectually superior rivals.  Mess up as hunters are wont to do around a harmless pig or bronto and it's no big deal.  Piss off a wild boar or wooly rhinocerous, on the other hand, and you'll get gored, trampled, and rearranged into pancake form.  If cornered, a giant bear or ostrich-like Diatryma will run circles around an opponent before tearing them a new orifice.  In relation, all a helpless human can do is fire wildly and pray for head shots.  One hit from a carnivore kills humans, of course.  The advantage is blatantly slanted in favor of the other team, so it's a lucky stroke that opponents generally remain content with their own affairs; if dinos were in a sporting mood, you'd be a raptor's lunch before onlookers could point and laugh.  Call it fitting that a game possessed of such a chilly disposition features a complementary, frigid presentation.  Mountainous, snow-covered cliffs and hills glisten dully by pre-dawn or noontime light across the myriad lakes, tundras and island areas in which Ice Ace is set.  What looks to be detailed terrain from afar loses its crispness up close through pixelation, but dinosaurs universally look fantastic.  For all the limited special effects library could use a tune up, neat tricks like squishy blood sprites, blinding lens flares, and water transparencies hit the spot.  Nighttime hunting, handled via night vision goggles, is also a bonus.  Action Forms built this title on a polished 3D engine that could be considered luxurious by budget game standards.    Audio-wise, it's extremely deficient.  Forests are so quiet you could hear one hand clapping.  Wind rustles through the trees and footfalls or distant cries echo back now and again, though not frequently enough for your enjoyment.  Perhaps the entire budget was spent on those fruity dinosaur calls.  Hearing a programmer's buddy accept orders for restocks of ammunition only lends credence to the theory.  Carnivores: Ice Age is positively prehistoric.  Nevermind the pretty graphics, this sucker's more tiresome than a Discovery Channel marathon, and less stimulating too.  Twenty bucks buys two minutes of exciting content for every twenty minutes of play... you do the math.  Past entries in this product line might have made a good impression, but for now, it looks as if the franchise's upward momentum is frozen stiff.  -- Scott Steinberg      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Jan 30, 2001"}