{"name": "Big Metal Box", "name_review": "Oni", "ref": "https://www.ign.com/articles/2001/01/31/oni-3", "text": "There are a lot of action games out there. There are a lot of 3rd person games out there. There are also a lot of fighting games out there (well, not for the PC). What there aren't a lot of are third person fighting/shooter games. There is one however that just came out and is trying to blaze a little swath of greatness in the annals of gaming history. Its name is Oni. Its problem is that the hype surrounding the game was just too much for the game to handle. It certainly does do the major things that it promised to when it comes to creating a fast paced fighter, but doesn't really reach the godly state that everyone really hoped that it would.  Oni comes from a rich background of anime inspired science fiction such as Ghost in the Shell. This cyberpunk futuristic android filled world is the setting for a story that is at least semi interesting and manages to move the game along, even if it isn't the most gripping or fulfilling work. You play as Konoko, an agent for the TCTF, a law enforcement agency. Konoko has a pretty sketchy background and no little bit of mystery about her. You find halfway through the game that not all is as it seems with our lithe young heroine and suddenly you are drawn into a tangle around which Konoko is the focus.  You begin the game in the training level where you will learn how to use the sometimes-frustrating command interface. The game is played in a third person much like you would find in any of the 3D fighting games nowadays. A variety of moves are available for you to try out including the obligatory kicks and punches as well as throws and a couple of beginning combos to get you started out. Throughout the game, you will learn some new tricks and combos that should help your fighting along and give you great opportunity to kick some major buttocks.  The problem is, even though the fighting is frenetic and exciting a lot of the time, the controls are a bit difficult to handle and chances are you'll find yourself wrestling with them in any fight that pits you against more than one enemy. I really don't know how things could have been changed to do any better and Bungie certainly did a commendable job, but there's just something amiss there. Not only is the camera work a little dodgey at times, but some of the more complicated moves are fairly difficult to actually get to work on a regular basis.  Not that it really matters too much because enemies almost all use the same kind of attacks and don't require any special kind of strategy to take care of. In fact, one on one battles are almost a forgone conclusion in your favor and using the special attacks hardly ever comes into consideration in the middle of a fight against two or more opponents. Mainly because you will be using almost all of your attention just trying to dodge away from the attacks reigning down on your spiky little head.  Fighting against two opponents can be downright difficult much of the time, so a lot of the game is spent trying to lure single opponents somewhere you can dispatch them without alerting his friends. But when you do get into those lopsided fights, you better have your finger on the Hypo Spray button to heal yourself. There is no mercy in this game whatsoever. Enemies do not let up. They'll punch you on the ground, they'll pick you up and piledrive your face into the cement, hell, enemies with weapons will even take shots at you while you're fighting even if it means shooting their friend. It makes for some crazy fights that, if you survive, will leave you feeling you accomplished something in the game.  There are other means of retiring enemies in the game other than fisticuffs. Weapons can also play a large part, although it's a whole lot more fun to get in fights. Some interesting choices for long range damage make their way into the game. Two types of ammo split the guns up into ballistic and energy categories. Ballistics include the standard pistol and sub-machinegun type weapons as well as crazy contraptions like the Scram Cannon that shoots a cluster of homing missiles towards the target and the Mercury Bow that shoots a sliver of frozen mercury and then goes through a cooling phase before it can fire again. The energy guns consist of stun gun type shockers, plasma type guns and a Screaming Cannon that has a very slow speed but is hugely powerful.  You'll also find power-ups scattered around the playing areas and in the possession of various NPCs around the maps. These including the healing Hypo Sprays, ballistic and energy ammo packs, a force shield that serves as an extra layers of life against weapons, and a Phase Cloak that allows you to go invisible for a short amount of time. Aside from the almost useless Phase Cloak that lasts too short a time to really be useful, you'll be looking to get as many of those other things as you can.   Let me make this perfectly clear. This game is freakin' hard in some areas to the point of almost overwhelming frustration. This mainly has to do with the save feature that is instituted into the game. You don't have the option to save anywhere you like, but your progress will be saved automatically at certain points in the game. The thing is, the save points are often pretty far apart and usually come right after a huge fight where you'll get your face smashed in pretty handily. So even if you survive the fight, you'll have low health and won't have a chance to survive the rest of the level. But, after playing a whole lot of games that had no save feature at all lately, this is a welcome addition and really didn't cause enough of a problem to upset me too much.  The problem with having to play through parts over and over again is the sheer repetitiveness of it all. The pattern of the game is pretty simple. Fight some enemies and unlock a door at a control panel. Go through that door, fight some more enemies, unlock a door with another control panel. Go through that door, fight even more enemies... you get the picture. The game could have been one big level for all intents and purposes because the environments were uniformly uninteresting. Actually, I'll take that back, there were a couple of levels that were a bit interesting such as the airport level that had you running through terminals and underneath huge jumbo jets and the federal building that required you to slide under some beams so as not to get shot by security cameras. But even those levels weren't mind boggling.  But that wasn't just for the level design, but also for the incredibly dull textures and locales. Most of the levels were inside secret bases or warehouses or cargo bays or blah blah blah. You're boring us Oni. The only thing the levels really had going for them was the size. It was pretty cool to look up and see the buildings disappear into the sky and reach far down below.  The models of the various enemies and characters were really a range from slick to ugly. Some of the enemies in full body armor looked straight out of an anime flick while others, mostly civilians were just plain ugly with strange body parts that layered over the top of other parts. The animations on the other hand were uniformly well done. Watching fights and the collision detecting working with the fight animations was really something to behold. Color-coded sparks flew for all contact in fights. The colors coincided with how much health characters had left. So if you or your opponent is hit with a red spark, you'll know that the fight is almost over.  Cutscenes were exceedingly static. Models don't move and barely talk. There's no lip-synch technology here or different textures for mouth movement. The only way you can know who's talking is the focus of the camera and a little anime portrait that also is static. Once again, you're boring us Oni.  Unfortunately, the graphics were not without technical problems either. Clipping problems were apparent everywhere. If Konoko was standing close enough to a wall, you could move turn her to turn the camera which would in turn see right through the wall and let you have a look at what was outside. Fallen enemies also fell through walls on many occasions. Annoyingly, there was also some slowdown at hectic points in battles that really made things difficult.  Sound was another matter. I'm going the average route here mainly because the sounds during fights were very cool comic booky types of sounds and the music was pretty fitting to the setting. The voice work fit perfectly if you've ever watched a translated anime flick. But the lack of real 3D sound really bothered me. When you should be able to hear enemies running up from behind you so you can dodge, all you get is a swift kick in the back.   And probably my biggest point of contention... no multiplayer. I remember when I heard that the multiplayer functions in the game had been scrapped. I didn't fully realize how sad that would be. This game is begging for multiplayer modes. I can't believe that it was scrapped. The fighting system is good enough that it could have resulted in some colossal amounts of fun with some creative level ideas. Each of the character types in the game has different special moves and would have made things really interesting. As it is, with all of the levels being so similar, there isn't all that much to draw you back to play through it again and again with the exception of some codes that allow you to play as other characters.  So the answer as to whether Oni could live up to the hype would have to be no. But that's only because the hype has been around for so long with all of the delays. What we're left with is a game that is certainly a bit of fun to mess around with even with its flaws and simple graphics. It's a great effort towards what could be a new breed of action game.  -- Dan Adams Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Jan 31, 2001"}