{"name": "America", "name_review": "America", "ref": "https://www.ign.com/articles/2001/01/31/america", "text": "Kill me now; I've been playing America. This latest cookie cutter RTS starts off well enough -- it's set in the world of the late 19th century American frontier. What a fantastic idea this is. When we've all had our fill of medieval fantasy wargames, Civil War titles and futuristic strategy games, something like an Old West RTS sounds just perfect. And if the actual game part hadn't sucked so much, America might have been a bright spot in this year's strategy line-up. As it is, America takes no chances in terms of game design. Even worse, it screws up a few things that are really crucial to a decent strategy game.  I'm all for internationalism, but a game about the Old West should probably not be made by a German developer. I mean, I don't want to sound small-minded or anything, but that'd be like Americans brewing their own beer. I could forgive it if, like so many other foreign titles of late, it had taken a new tack on the RTS genre. But it didn't. America is a total clone of nearly every other strategy game on the market. You have some guys, they collect some resources so that you can construct buildings and train units to go kill some other units and destroy their buildings. That's all right as far as it goes, but America doesn't go any farther with it. Within half an hour you'll have exhausted everything this game has to offer. I'm not against the typical RTS conventions, but at this stage in the game you've got to add a little something extra to get my attention.  This extra aspect was supposed to be the setting I guess, but everything is done in kind of a half-assed way. The graphics are just sad, with lots of bland, colorless expanses that leave you wondering whether or not the game speed can be increased by switching your display to 256-color mode. Unit icons are similarly muddy and indistinct and sound effects are repetitive and dull. The voices on the other hand, border on the offensive. Now I'm not one to get my back up about racial stereotypes or anything, but the Indian and Mexican voices might actually be insulting to someone with a lower threshold than I've got.  There's a really weak story in America as well. You'll play through four campaigns in the game -- one each for Native Americans, Mexicans, Outlaws and the United States. The narrative that ties these missions together is just plain boring (this isn't helped by a voice over that's slow enough to put you to sleep). What's more, there didn't even seem to be much connection between the missions within the same campaign.   But this is all just window dressing for a poorly designed game. The units are unexceptional and the buildings and tech upgrades are totally predictable. You build farms (which can't be queued as in AoE), mines and send out loggers to obtain your three basic resources. In fact, the game is such a clone that you'll instantly be familiar with the way things work. At least the way things are supposed to work. America is hampered by an unreliable interface that sometimes works and sometimes doesn't. It's never totally dysfunctional but there's a lot of jerkiness and instability in the interface. Add to that the fact that your own units won't fire on an enemy unless you submit a written request filled out in triplicate and signed by the head of DataBecker studios and you've got a really irritating game.  And the game is even more frustrating due to the incredibly high difficulty level. I thought at first that it was just me. A quick tour of AoE, Starcraft and Red Alert 2 convinced me that my strategy skills were still as sharp as ever. The trouble is that America is too damn hard. Even on the easiest setting you'll find the enemy several steps ahead of you in terms of production and technology. I'm not saying that I want the game to roll over and let me walk on its belly, but I shouldn't have to replay the introductory mission eight times before I finally beat it. On the subject of balancing, I might also mention that the US fortifications are almost impossible to storm. This really sets you up for a rude awakening when you finally take charge of the US forces and watch as wave after wave of Native American Archers wreak havoc on your installations.  About the only thing that I can say about the game that isn't an outright criticism is that I like the time period they've chosen. It's not much, but it's something. We always appreciate it when RTS games take a chance by expanding into new territories and America really got our hopes up. If we're lucky, someone else will pick up the ball and decide that the 19th century was more than a collection of Civil War and Napoleonic battles. I'd love to play Wounded Knee or the Alamo but unless the game is a lot more fun than America, I'm staying the hell away from it. You should too.  -- Steve Butts      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Jan 31, 2001"}