{"name": "Road to El Dorado", "name_review": "Gold and Glory: The Road to El Dorado", "ref": "https://www.ign.com/articles/2001/01/31/gold-and-glory-the-road-to-el-dorado-2", "text": "Aside from the unavoidable and embarrassing connection to Cortez, Conquistadors, and the ruthless pillaging and plunder of indigenous peoples any title focused on the search for the fabled city of El Dorado will have, Gold and Glory: The Road to El Dorado has Spanish Armada-sized problems of its own. But, it also has it's own little niche, and it might be the right adventure game for a small demographic.   Here's the skinny on the plot (minus the pleasantries), which I'm guessing roughly follows that of the movie. The two Spanish protagonists, Tulio and Miguel, are small-time crooks/hoodrats living during the height of the Spanish empire. They're broke, and they're wanted by the law for petty crime, so they're mucking around town looking for cash. They do a little gambling on the side and win an old map from a hustler, which may or may not actually be the map to the fabled city of El Dorado  the ancient city in South America made entirely of gold. They find out Cortez is heading that way with his jolly band of Conquistadors on a ship, so they smuggle themselves onto the ship and hope the map is genuine. Along the way, of course, they run into some adventure and just about get killed -- all in a cute, G-rated sort of way.   The graphics in The Road to El Dorado are usually pretty ~blah.~ Other times, they are spectacular, especially in the cinematics that borrow from the Hollywood movie. I'm going to avoid using the word ~mixed-bag,~ but the visuals are definitely nothing special. Tulio and Miguel are well animated and have funny and creative mannerisms, but they suffer from a highly malignant and aggressive case of the jaggies, plus there's no way to turn up the resolution, and the definition is pathetic. The rendered backgrounds are gorgeous, and in the case of the jungle levels, even breathtaking, but this isn't going above and beyond the requirements for an adventure game. Adventure gamers expect beautiful backgrounds, particularly when they've been spoiled lately by games like The Longest Journey.  The adventure genre has never been known for bleeding edge graphics, opting usually for focus on depth of gameplay, so I suppose that can be forgiven.   What can't be forgiven is the voice acting -- it's mind crippling. The dialogue is the sort of stuff you turn up when your roommate is doing calculus homework.  The voice acting is also a strong element to my argument that this game is actually intended for children or easily amused adults - everything is spoken in the slow and patronizing tone usually saved for programs like Blue's Clues and Mr. Rogers. An improvement here would have gone miles in the quality of the game.   The gameplay is what you've come to expect from a 3D-style adventure. The control is all character-respective, and keyboard layout it easy to learn. The two characters, Tulio and Miguel, walk around the screen and interact with the items in the scene. When an item can be used/picked up/combined, it flashes when looked at by the characters. The Road to El Dorado isn't a point and click adventure, so the mouse isn't used in actual gameplay.   The heart of an adventure title always lies in its puzzles, and Gold and Glory: The Road to El Dorado has its fair share of mind bogglers. Unfortunately, it's also got an extra-large helping of mindless, idiotically simple puzzles. Worse, many of the puzzles in a particular area revolve around the same idea.  For example, the Spain and Dock areas have no less than three puzzles requiring you to do the same thing: hide and walk around in a wooden barrel. In other instances, the puzzles can be ridiculously difficult. This difficulty is not attributed to their ingenuity or intelligence, but rather their acute lack of intuitiveness or sense. For example, I must have spent over an hour and a half trying to figure out a puzzle on the Spanish galleon that turned out to be bizarrely stupid - and I can promise you that if I didn't have to complete the game for the review, that time would have been spent elsewhere.  However, not all puzzles are bad, and the puzzles later on in the game have you running from Jaguars, avoiding bubbling lava, and skirting deadly traps. And hey, you get to crossdress and try to get pulled by the dock warden, which is cool in a scary kind of way.   Like in every one of these animated movies, they meet an animal sidekick - Bibo the Armadillo. Joy! To set this title apart, designers made many of the puzzles two halved - separating Tulio and Miguel and forcing the player to solve each character's puzzles. Interestingly, in some stages the player is allowed to switch freely between control of either Tulio or Miguel, giving cooperation between the two players. The length of the game is short, especially if you're a veteran gamer, but I can't imagine anyone playing through it in a single day - they'd want to take a breather every 30 minutes.   The music itself is a lot like department store Muzak; after a while it just blurs into the background. Which is about all you can hope for with this game. There isn't a lot of variety in the music either - it's mostly just one recycled, though quietly inspiring, synth loop. El Dorado is also a very silent game, with whole areas left with only ambient sounds (birds chirping, wooden planks groaning, etc.). As far as the ambient sounds go, they're decent, but no matter how good they are they can't add to the realism of a game based on an animated cartoon feature.   Aside from the rest, there's obviously no multiplayer, and the game is rock solid when it comes to stability. I didn't experience any technical problems at all. The system requirements are quite low-impact, and still offer passable visuals. Most players will prefer to use a gamepad if they have one. When using a gamepad, the control scheme is very similar to a LucasArts title like Grim Fandango.   I don't think I'm being charitable by saying that it might be enjoyable to the right audience. Unfortunately, or perhaps intentionally, people who are seriously into games are not that audience.  So, if it's not for gamers, who is it for? Kids?  Maybe.  And I might recommend it to people new to the genre, or even PC games in general, but almost any other title shares the ease of use and adds a game that's actually fun to play (such as Monkey Island 4). It's an ideal game for kids because of the complete lack of questionable material, and its simplistic plotline and puzzles, but wouldn't they rather be playing something else? My guess is yes.   We have a saying in ~the biz~ that goes something like, ~Games based on Hollywood licenses rarely turn out to be good, and adventure games based on Hollywood animated series licenses are even worse.~ Actually, we don't have a saying like that at all, but I guess we do now. And despite the overwhelming truth of that statement, El Dorado seems to just slightly defy it - all things considered. But it still isn't any fun, and it still has lame voice acting...and even though it's a brilliant product tie-in and marketing vehicle that will probably make more money for the publisher than two games that kick ass, it doesn't mean you have to buy into it. Try Monkey Island 4 instead.  -- Erik Peterson Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story. If you're a big fan of graphical adventure games, then you might want to consider picking this up because it's one of the few new games in the genre that you'll find on PlayStation. However, don't do it expecting to get a good game, because it's just not one. The game's pacing is a bit too slow and tedious and the puzzles can be more nonsensical than challenging or difficult. While the voice acting is sensational and it does look pretty in some areas, these aren't good enough to warrant picking up this title.", "date": "Jan 31, 2001"}