{"name": "ESPN NBA 2Night", "name_review": "ESPN NBA 2 Night", "ref": "https://www.ign.com/articles/2001/01/31/espn-nba-2-night", "text": "First and foremost, I'd like to extend my sincerest apologies to the crew at Visual Concepts for anything I may have said, written, or even thought that was even the slightest bit negative about anything basketball-related they have ever produced.  I now know beyond a shadow of a doubt that things could be worse.  And how do I know? Because NBA 2Night is the sorriest excuse for a game I have ever seen on the Dreamcast, and Konami should be absolutely ashamed of unleashing such a sloppy, painful experience on the sports gaming community under the guise of a ~product.~  Nearly everything about this game wreaks of a concept that never reached completion, and I just can't understand how this game made it out the door.   This is the same company that brought us Metal Gear Solid, you'd figure they had some standards.  Unfortunately, you'd figure wrong. Everything is broken.  The animation is so screwed up that almost nothing looks realistic.  Players skate across the floor, as if animations were never incorporated to coincide with player movements.  It happens in groups, and comes together more like a horde of zombies on ice skates than a group of basketball players.  The basketball itself has even bigger problems.  It never seems to go into the basket, and ~good~ shots often look like they miss, and occasionally, the ball with go through the rim or backboard. It also has trouble interacting with the players, and often roles around on their limbs like a metal ball on a magnet.  Very odd.  Worse still, if a player has started a dunk animation, he will go through other players.  There doesn't seem to be any collision in this regard whatsoever. The game usually skips players around the court during dunks as if they have suddenly gained the ability to teleport.   For instance, we went through the lane with a big man, and he just magically ~pops~ between the free-throw line and the block to dunk.  His hands never touch the rim, and he goes through the backboard.  In fact, the rim almost seems to disappear when he is dunking. It is just sad.  Speaking of the players...how broken are these models?  They look incredibly rough, and their heads look like they've been smashed into a vice.  In fact, I'm having trouble deciding if anything has been done since Konami's last PlayStation title to upgrade these things, because from where I'm sitting, they're basically the same.  Unfortunately for them, NBA 2Night doesn't at least play as well as most PlayStation title I have hooped it up on in recent years.  Hell, I had more fun with Lakers vs. Celtics on my Genny.  I already mentioned the weird skating of defensive players, but there's much more to complain about where that came from. All it takes to beat a man on the hardest difficulty level is pump faking and holding down turbo.  It will work, every time.  We actually used this method to beat the Lakers using Keith Closs of the Clippers.  Sad but true.  The only thing worse than the defense in this game is the passing, which seems to have a mind of its own.  Spawning everything from passes directly out of bounds to balls that go around a player's back and bounce a good 70 feet into the air...a feat that is nearly impossible from a physical standpoint.  Players almost always try to do something fancy with the ball, and take way too long to release the rock.  It is almost funny how much the players seem to struggle with making a plausible reception of said passes, as well, as they chug and stutter through their poorly scripted animation with their stubby little limbs, somehow managing a catch despite their lack of discernable fingers. *shudder*  Thankfully, this never comes into play with shot blocks, as the ball never really touches the hand of the defensive player.  If you happen to swing in the path of the ball, a vicious force field of power will swoop in and deflect the ball.  These guys are regular Jedi-in-training, I tell ya.   Perhaps the only thing more offensive than the gameplay and visuals in this title is the audio.  Forget the pitiful crowd, delayed whistles, abrupt voice-overs, and virtually non-existent music...will some one please explain to me why anyone puts up with Stuart Scott, and why including his annoying attempts at capitalizing on hip-hop vernacular was a good idea.  When he said ~all that and a bag of chips,~ I laughed.  When he moved to ~cool as the other side of the pillow,~ I cried.  But when he started singing R Kelly's ~Bump and Grind~ after a wide-open lay-up, I wanted to KILL someone.  Once you hear these samples a good 20 times, it becomes even more annoying.  But, I guess he fits the game. Much like Scott's voice, NBA 2Night just causes me pain.  I won't even get into the limited options, and how poorly it stands up to even last year's Sega Sports effort, because it just isn't worth the effort. This game sucks.  Bottom line. Do not buy it.  Rent it only if you are looking for a good comedy and Duece Bigalo is out.  Even then, you should feel dirty for spending any money on this pitiful title. It is easily the worst Dreamcast game yet, and example of what not to do with a sports franchise in almost every way imaginable.  To quote Hawks fans this season, ~Booooooooo!~  -- Brandon Justice, IGNDC", "date": "Jan 31, 2001"}