{"name": "Phantasy Star Online", "name_review": "Phantasy Star Online", "ref": "https://www.ign.com/articles/2001/02/01/phantasy-star-online-2", "text": "Online gaming has been something of a xxxx for the Dreamcast.  When the Dreamcast launched, it was touted as the next step in getting gamers together.  And while it took SEGA almost a full year before we got our first true taste of online gaming with Chu Chu Rocket (sorry, playing by email with Sega Swirl didn't cut it), the Dreamcast has a pretty good line-up of online games.  Whether it was blowing your friends into smithereens with Quake III Arena, sacking the quarterback in NFL2K1, taking it to the hole in NBA2K1 or competing against online players in other Dreamcast online games, SEGA fanatics could interact with online players in almost every way... except one.  As much as we love to compete against other players, DC gamers haven't could really play together as it has been limited to two-on-two sports games and team battles in ranching mice.  Additionally, there hasn't been much of a large online gaming community to center around those online games (especially to all those guys who can't stand losing and pulled out on me when I was leading 27-0 in NFL2K1).  There hasn't been a real good reason to get online and STAY online with your Dreamcast because no DC online game has made gamers come back to play together.  That's probably explains why I haven't seen the huge number of online gamers that I thought would be on, and instead, I've seen fewer and fewer.  Well, now there's a reason to get back on and, believe it or not, keeping back on and staying.  No, it's not a Street Fighter game online, and as much as I would love to see something like that, this new Dreamcast game is bigger than that.  Nor is it Daytona Online Network Racing, and while that's pretty big, it's not coming out quite yet... and it's not as big as this game, either.  Woah... pretty big words there, huh?  Well, that's how big Phantasy Star Online is, as it becomes the first real-time, online multi-player, console game in video game history.  And having played PSO through a countless number of sleepless nights, with several different players online, and even through all the hardships I've encountered when playing PSO, I find myself STILL playing this game and I will definitely be playing PSO for many months to come.  With Sonic Team leading the way, Phantasy Star Online is one of the best Dreamcast online games I've played. Offline Is Another Story Noticed, I said Phantasy Star Online is one of the best online games I've played instead of just calling it ~one of the best games~.  There's a reason for this, dear readers, leading me to one of the biggest oversights of Phantasy Star Online.  With the huge brand name of the legendary SEGA RPG series, the story behind Phantasy Star Online is shockingly non-existent.  For the hardcore Phantasy Star maniacs, the time frame of the story seems to take place after the happenings of  Phantasy Star IV, but it's not exactly clear how many years have passed.  Your homeworld is dying and in this emergency, ~Project Pioneer~ is conceived.  Sending out probes all over the galaxy in order to find a new planet, when a potential planet was found the first colony ship, Pioneer 1, was sent out to establish a new colony on this planet.  Seven years pass and Pioneer 2, packed full with refugees, is orbiting the new planet, Ragol.  Establishing communication with Pioneer 1 on the planet's surface, before Pioneer 2 can land, a huge explosion occurs.  All communication is lost and this is where you come in.  As one of many hunters on board Pioneer 2, you're hired to go down to the planet and find out what the heck happened.  Sounds like a beginning to a great story, right?  Well, that's all you get folks.  From there, you basically take your character through numerous dungeons into the source of all the evil.  Along the way, you'll get text messages that try to enhance the story of the game, and there are side quests that also try to enhance the overall plot of the game.  But it doesn't work; the text messages are a mix of hints on how to deal with enemies, and the side quests aren't very exciting in general.  But probably the biggest disappointment when it comes to the story is the lack of good ending.  I'm not going to spoil the ending for you dear readers, but after playing through the game on hardest difficulty, and going through all the hard work to level my Ranger to level 75, it was a huge letdown not to see something really special when beating the game on very hard.  And you think that after such a downer, I'd stop playing PSO.  And that's the funny thing about this; even after a mediocre ending, and a couple of hours of venting, I picked up my DC controller, logged online, and started playing again.  Was it because I couldn't get enough of the oh-so-good visuals that decorate the world of PSO? Maybe... Perhaps it's because I enjoyed playing online with the number of editors who have also slaved through the game with me; it's always fun to play online games with cool people.  But for me, I kept going because of a very simple reason  it's fantastically addictive. Diabolically Addictive If Sonic Team had to give us a meager story for Phantasy Star  Online, you know they had to balance it out with a wealth of gameplay.  First off, is the amount of customization the game permits; with nine different character types to choose from, each with numerous edit options to make your character look unique, Sonic Team didn't stop there.  With online gaming, Sonic Team knew standing out from a crowd of online gamers is important and gave PSO the ability to customize messages and symbol.  As you may or may not know, playing PSO online will enable players around the world to get together.  Since not everyone speaks English, the symbol chat interface allows you to get basic communication across through happy faces, angry expressions, and other default symbols.  You can also edit your own symbols (up to 12) to your own liking, and I've seen some hilarious ones.  Of course, you can't always type (whether on DC pad or keyboard) while in the midst of battle, and the game allows you to shortcut phrases to specific keys on the DC pad (up to 8 shortcuts) and on the keyboard (up to 12).  Then comes the MAGs, and if you've been reading up on our previews and such, you've probably seen them but wondered the heck are they.  MAGs are the hovering little buddies behind your character and are essential in your character's progress.  While your character levels up through the normal means of killing monsters, you actually have to ~feed~ your MAG utility items (i.e. cure items, antidotes, etc.,) to increase your MAG's abilities.  You can ~feed~ your MAG every five minutes or so and by increasing its abilities, it will also increase you abilities dependent upon what items you feed it.  MAGs evolve into different shapes of sizes depending how well you take care of them, and each character will have a different looking MAG, be it Ranger, Hunter, or Force.  All this customizing and editing is pretty darn cool and I've spent many hours making my own custom symbols and ~feeding~ my MAG the proper ~foods~.    Though I spent quite a bit of time making my character unique with all this editing, I have to say the biggest reason why I came back to PSO is because the game is just too damn addicting.  In a similar way to Diablo, even at level 75, I always have this nagging feeling that there's some better item out there I don't have, some better weapon that'll really kick more arse than the one I have, or a suit of armor that's just god-like... anyone who's played Diablo know that sensation.  And when I start going on that item hunt, then comes the experience points factor.  Just when I'm going to call it a night, I look at how many experience points I have and if it's 2000 or less, I keep going... till I'm way past that.  This addictivity is doubled when you play with players online.  Teaming up with three players (four to a game maximum), more enemies come out and with more enemies, comes more items and experience points.  But whether you play it online or offline, the spectacular visuals remain the same, and I have to say that this is one of the finest looking DC games.  Whether it's the wonderful intro sequence, the exhaustive detail of the each character, or the enormous boss monsters, Phantasy Star Online doesn't disappoint at all in the visual department and you'll definitely know what I mean once you start taking a stroll in the city.  Right from the get-go, you're greeted with graphics that destroys anything you've seen on a console.  In the city, you'll be amazed at the detail of the metallic floor, the pulsating colorful lights, the gorgeous nurses...er, um, nevermind.  And once you teleport down to the forest, DEAR LORD!  The forest greets the player with stunning, vibrant colors, a grand blue sky... it's just a feast for the eyes.  And with every level you progress through, the more incredible the visuals get.  And then come the bosses... even the first level boss is about 10 times the size of your character.  And the get bigger, more intricate, and a whole lot tougher.  Thankfully, you don't have to face these nasties alone. Support Dreamcast Online Obviously, the biggest feature for PSO is the online, multi-playability.  With eight US servers, each server split up into 10 blocks, you shouldn't have a problem finding anyone to team up with.  Once you meet someone in a lobby, you can chat with them, trade Guild cards (enabling you to find and email that person whenever their online), and setup a game.  Games can be open so any player can join at any time, or you can make them password protected in case you only want specific people playing in your game.  Once in, players can stay together or go off in whatever direction they choose.  However, with the increased number of monsters, the experienced and wise stay together and work together.  This is a great gameplay feature, as players, whether they like it or not, are basically forced to work together in order to get through each room.  Of course, getting everyone to work together takes time and of course you might end up playing with some item whore that steals every item in a room without helping out.  But you won't be able to experience this until you get online.  For that matter, you won't be able to fully enjoy PSO until you've gone online with a bunch of good players and quested together for a few hours.  So, if you plan to buy Phantasy Star Online but you're not planning to go online, you're not playing the game.  Whether it's just chatting online getting to know other Dreamcast players, helping out newbies on their first grand day out, or beating the final boss on very hard difficulty (gah), Dreamcast players must play Phantasy Star Online online... and that means everyone.  --Anthony Chau, IGNDC", "date": "Feb 1, 2001"}