{"name": "Championship Motocross 2001 Featuring Ricky Carmichael", "name_review": "Championship Motocross 2001 Featuring Ricky Carmichael", "ref": "https://www.ign.com/articles/2001/02/01/championship-motocross-2001-featuring-ricky-carmichael-4", "text": "Why am I the motocross guy, all of a sudden?  I suppose it makes sense in an odd sort of way, though - send a uniquely mediocre game reviewer to write up a uniquely mediocre genre of games.  That's what motocross always has been, at least on the PlayStation.  Nothing on the system, after all, has drawn the kind of raves directed at Nintendo's Excitebike 64.  It doesn't look like that will ever change, now.  THQ's Championship Motocross 2001 Featuring Ricky Carmichael (deep breath) is in all likelihood the last motocross game for the venerable PS, unless Acclaim decides to curse us with one more Jeremy McGrath, and it has proven, like most of its competition, to be nothing particularly exciting.  Compared to its closest rival, EA's new Supercross, it's not all that bad, but Supercross stands out a little more thanks to its effective reinvention and more neatly tuned balance.  This year's Carmichael is essentially more of the same, with some aggravating quirks that make me wonder how much time it spent in QA.  Gameplay  Carmichael is definitely a motocross game in the arcade mode, although not as overtly so as Supercross was this year.  It doesn't have a goofy speed-boost button, but it does have the goofy sliding-turn button, so it's about halfway there.  The bike behavior is typically basic, with direct control over your orientation in the air (as opposed to indirectly controlling it with the throttle) and very few crashes - it's almost impossible to fall off your bike unless you really make an effort at it.  The pattern for success is thus easy to fall into: speed toward next turn, slide into turn, repeat.  With the powerslide button, choosing your line and sticking to it ceases to be a significant issue, although if you choose to play without it you can feel the difference smooth riding makes.  Managing your speed is not important, though, as it is in most smooth-surface bike-racing games.  Carmichael is meant to be played with the throttle all the way open.  This is all well and good, and would actually be enough for a solid game, given the variety of tracks and game modes.  Outdoor tracks let you ride smoothly through the open sections, while supercross tracks demand a little more precision steering.  Much of the fun of racing, however, is stolen by some painful kinks in the game's difficulty curve.  It feels very unfinished, as if the game shipped before it was properly tuned.  The speed and skill of your opponents seems to fluctuate wildly from mode to mode and race to race, throwing a thoroughly unwelcome element of luck into what I thought was supposed to be a test of skill.  In Single Race mode, for example, I can pick up the controller and easily maim the competition, riding fairly smoothly.  No problems here.  Then there's Championship mode, though, where I can dominate one race and find myself lapped in the next, with no change I can see in how smooth I'm riding.  The same goes for Career Mode - sometimes it's impossible to take first place, for no reason I can perceive.  The lack of balance is downright blatant at times, too.  Goes like so:  Pack....You.........................................................................................Single Godlike Leader Dude.  Challenging opponent: fun.  Invincible opponent: no fun.  Because of the way the points system is structured, you can actually win a championship without winning any races - score four second-place wins and you'll still walk away with the cup, since the AI riders take turns playing God - but that's a pretty hollow victory, especially considering it was all just a matter of chance.  Graphics  After seeing so many motocross games, it becomes hard to find any way to describe Ricky Carmichael other than...it looks like a motocross game.  Its structure lends it a slightly different default perspective from something like Supercross, giving you a wider view to suit the more open tracks.  To Funcom's credit, at least, the framerate is tolerable - things don't chug down into incomprehensability when there are too many riders on the track.  In part, though, that's likely thanks to the relatively weak rider models.  They don't look bad, but they don't have many distinguishing features (save oddly outsize heads in the select screen), and the body English isn't as fluid as it has been in many other motocross games.  The bikes don't have many distinguishing movements either.  When the suspensions expand and compress in the replay mode, the transition is very jarring, as the fork suddenly doubles in length once you go off a jump.  As they buzz by, the track backgrounds don't have very much to show you, but at least they're reasonably clean and varied, and the game definitely conveys differences in elevation very well.  The indoor arenas have one particular eyesore, though, a strange brown void between the 3D track and the encircling 2D background.  The lights hanging from the ceiling are nice, but down on the ground, the level designers don't seem to have shrunk the stands to fit around the polygonal tracks, resulting in an ugly, empty gap.  Sound  Sound?  I know no sound.  Or very little sound, anyway, most of it drowned out by the blare of lots of bad pop punk (as opposed to good pop punk - when will somebody license Screeching Weasel or the Blanks '77 or whatever?  I can send you guys suggestions if you need them...).  Carmichael includes no voice-over commentary and very little in the way of sound effects, just a varying crowd noise and a basic engine drone that doesn't do much to indicate the state of your revs.  The sound effects are faint enough that you have to kill the music almost completely to hear them.   The PlayStation motocross market ends with a whimper, waiting for CMX 2002 to take this franchise in a potentially interesting new direction (not that I have any real faith in Pacific Coast Power & Light, but why not be optimistic today?).  At the very least, the final Carmichael rises well above the depths to which this genre has sunk, the legendarily foul Jeremy McGrath games from Acclaim.But that doesn't mean I'm inclined to spend any more time with this particular series than absolutely necessary.  Carmichael's racing engine is smooth and playable, but very basic, and the schizophrenic difficulty level frequently kills the game right when you're in a good groove.  Losing a championship and being kicked out of the career mode thanks to a bug that should have been caught in the beta cycle doesn't inspire much love.As far as a verdict for those who require a motocross game regardless...well, that's difficult.  I enjoyed the new Supercross more than I did Carmichael, but not to such a degree that I'd call it any kind of must-buy.  Moto Racer has always been more focused on its road-racing component, and this year's World Tour is no exception.  The PC actually has the best entrants in the genre if you view the entire market, but unfortunately that's cold comfort for console gamers.  In a pinch, then, I'd recommend Supercross, if about as reservedly as I possibly could.", "date": "Feb 1, 2001"}