{"name": "Balance of Power", "name_review": "PC Retroview: Balance of Power", "ref": "https://www.ign.com/articles/2001/02/01/pc-retroview-balance-of-power", "text": "There were a lot of PC games released before IGNPC was conceived through the union of IGN and PC, and some of these games were so good and influenced the design of so many other games that they deserve a little space of their own on IGNPC. That's why we stopped by our old bud Tom Chick's house, woke him from his drunken slumber, wiped the crust out of his eyes, and asked him if he'd like to evaluate some of the PC gaming classics as compared with their contemporaries. He wittily replied, ~Uh, sure,~ and thus PC Retroview was born.   I'm sure you know what it's like when you're watching a movie that makes you think ~Man, I can't wait to get home and play [fill in game name here].~  I don't just mean Star Wars/Trek stuff.  Maybe you're watching Das Boot and your thoughts drifts towards Aces of the Deep.  Perhaps The English Patient puts you in mind of a little Red Baron 2.  The foiled bank robbery in Heat is enough to make anyone look forward to a bit of Counter-Strike after the show.  So while I was listening to Kevin Costner's Boston accent as the Cuban missile crisis played out in Thirteen Days, my mind started to wander.  I was looking forward to playing something with real-world global politics.  The most recent would have been CyberJudas or its predecessor Shadow President, both fairly detailed but clunky and bloodless.  Both were also clearly inspired by Balance of Power, a 1985 game from Chris Crawford.  Balance of Power is a Cold War simulation.  You assume the role of either the Soviet Union or the United States and use the world's smaller countries as pawns in your quest for ideological supremacy.  Each of the 62 countries modeled in the game leans one way or the other between the two superpowers.  Your job is to identify the most important countries and sway them to your side.  For example, Cameroon is hardly worth a nod, but Israel counts for big points.  But the game uses a domino effect system, so your presence in one country makes it easier to influence its neighbors; little countries like Cameroon can have a part in your master plan.  Over the course of your turn, you can choose actions in each country ranging from quiet diplomatic overtures to full blown military occupation, but your opponent will certainly take issue with some of the things you do.  For instance, you can't just send the Marines into Afghanistan and not expect the Soviets to object.  When they do object, or when you object to something they've done, you have a crisis on your hands.  A crisis is an event like the Cuban missile crisis in which the superpowers rattle their sabers and inch their trigger fingers closer to ~the Button~.  You remember ~the Button~, don't you?  It's no longer a part of public consciousness, but there was a time that the world trembled at the prospect of one of the superpowers pressing its ~Button~ -- i.e. initiating a nuclear exchange that would, according to the doctrine of mutually assured destruction, destroy us all.  In Balance of Power, when the superpowers disagree on something, they start escalating along a series of challenges that lead closer and closer to an apocalyptic showdown.  Someone has to back down or the game ends.  One of Balance of Power's most chilling contributions is the losing screen, which was simple white text against a black background: ~You have ignited a nuclear war.  And no, there is no animated display or a mushroom cloud with parts of bodies flying through the air.  We do not reward failure.~  Crawford's goal was to present international politics during the Cold War as a series of interrelated factors.  Unfortunately, his web of causes and effects is buried under an overbearing spreadsheet.  Playing Balance of Power is like being assaulted by a thousand statistics and map filters.  Once you identify the key strategic points, which tend to be the same from game to game in spite of variable starting conditions, it's easier to manage.  There are also difficultly levels that gradually introduce the game's mechanics and provide an easier opponent.  In the beginner level, there are no economic or diplomatic factors and the other superpower is a pussycat who will roll over for all but the most outrageous affronts.  In the full game, your opponent won't flinch during games of nuclear brinkmanship.  However, while playing Balance of Power, no matter what the difficulty level, there's no avoiding the powerful sense that your skating across a spreadsheet of statistics, many of which are next to useless.  The per capita caloric intake of each country?  Now Crawford's just showing off.  But some of us don't mind skating across spreadsheets.  With a vivid enough shell, which is the case here, they can be engaging.  The problem with Balance of Power is that it is ultimately won or lost during diplomatic crises, which may as well be decided by the flip of a coin.  When you challenge the computer's actions, or when it challenges your actions, each side is given a chance to back down.  If they stick to their guns, the stakes get higher and higher until someone backs down.  The guy who finally backs down loses significant points.  Eventually, all your hard work and careful planning are dwarfed by the points you gain or lose in these situations.  And of course, if neither side backs down, the game ends.  This would work if there were a better representation of the other side's psychology.  Instead, you're essentially bluffing against a faceless and unreadable computer opponent.  In the manual, Crawford alludes to ~the sense of uncertainty arising from poor communications between the superpowers~ as a way of justifying how difficult it can be to manage these crises.  But when the game is decided with the simple click of a dialogue box, all of Balance of Power's delicate mechanics are suddenly superfluous.  Five years after its 1985 release, Crawford created ~The 1990 Edition~, which adds advisors who give you an indication of how likely you are to win a confrontation.  This helps somewhat, but it doesn't change the fact that no matter how carefully you play, Balance of Power is ultimately decided by one or two decisions.  Of course, the same might be said for the real world, but the real world doesn't always make for a compelling game.  Balance of Power is chiefly interesting for its historical value.  World War II is all the rage in wargames, but the Cold War is a far more subtle and epic chapter in world history, a chapter that can't be captured with counters moving across hexes.  Crawford's attempt to model it here is an admirable relic.  I'd love to see someone try to represent the current state of the world, in which a lone superpower has to define its new role after the collapse of its enemy.  As someone said after the fall of the Soviet Union, ~We have slain a great dragon and now we face a jungle with a bewildering variety of poisonous snakes.~  Balance of Power's 1990 Edition addresses this somewhat with its 'multipolar' option, in which each country functions like a miniature superpower with its own economic impact and military forces.  This allows for things like the Iran/Iraq war and Chinese support of North Korea.  Chris Crawford is one of the pioneers of computer gaming from the same era as Sid Meier and Dani Bunten, although he's not as prolific or wide-ranging as Meier and Bunten.  Crawford's background is in wargaming, but Balance of Power is his most successful title.  He followed it up with Balance of the Planet, which explored the interaction between the environment and industry.  His last computer game was 1991's Patton Strikes Back, which was not warmly received, even among wargamers.  He refers to Erasmus as his mentor and is currently working on an interactive storytelling tool called Erasmatron [https://www.erasmatazz.com/index.html].  In an interview last year, Crawford stressed that breadth of education was the most important criteria for successful computer game design.  He's written a handful of books on programming and game design and you'll find several desultory essays on his web site, ranging from how to make computer games for women to the election in Ghana.  Breadth, indeed.  Mr. Crawford is all over the map.  In my experience, the best game designers are the ones who are all over the map in a conversation.   I'd love to see a man of his breadth return to game design, particularly to do a contemporary take on Balance of Power.  The last version he left us comes down to a frustrating exercise in bluffing against a computer.  -- Tom Chick Want to share your opinions with the world?Talk about it on the IGNPC message boards,  orsend some mail to IGNPC about this story.  Presentation  Very little is done to disguise the spreadsheet nature of the game; it's all lists and map filters and the occasional graph.   2.0  Graphics  Almost non-existent.  A black and white line drawing of the world with information presented in horribly ugly fonts.   1.0  Sound  There is none, but you can play your own MP3s in the background.  There's nothing like taking over the world while you're listening to Foreigner's Greatest Hits.   N/A  Gameplay  It all comes down to a round of bluffing against the faceless computer.   2.0  Lasting Appeal  Each new game has slightly variable starting conditions, but the basic state of the world in the 80s don't change.   4.0  Should I Go Back and Play It?  It's a historical curiosity that will only appeal to those with a stomach for spreadsheets that can end abruptly.   No  OVERALL SCORE    (not an average)   4.0 If the point of Balance of Power is that international relationships are a tricky web of tangled relationships, then Crawford's point is well taken and nicely demonstrated.  But when it comes to playing an engaging game with political elements, well, I'll stick with stuff like Imperialism and Alpha Centauri.  They may not have as much real-world value, but as games, they're a hell of a lot better.", "date": "Feb 1, 2001"}