{"name": "Big Metal Box", "name_review": "Oni", "ref": "https://www.ign.com/articles/2001/02/02/oni-2", "text": "Rockstar and Bungie have finally delivered the long-talked about anime-action title Oni, and after experiencing lots of mixed hype and a moderate delay, I'm happy to say that Oni is a better-than-decent piece if gaming action. It certainly looks better than it ever did in early or mid-production -- in fact, it's quite attractive -- and it definitely plays a lot better than it did in production, too.   Oni has achieved many of the goals its developers set it out for it, but the game also is extremely troubling in several areas. In the end, I played it with a strange sense of pleasure and pain because I was damned if I was going to let Bungie's evil control scheme have its way with me. But I was also very close to lighting the damn thing on fire and smiling happily as I watched it burn.   Gameplay Oni is a hybrid action game, one that enables players to use all sorts of high-powered weaponry in addition to kicking some serious booty in hand-to-hand combat. The lead character, Konoko, is the starring girl who you eh-hem, get to play...with... and she's fully capable of taking on the biggest brute the game dishes out. The game is all action, segmented into multi-objective levels with lots of cut-scenes in mid-levels and after each level. There is nothing terribly striking about this familiar set-up, but it works. You get your action and your story, too.   The way that Bungie has orchestrated the game is unique for Western developers. Bungie wanted to create a game that flows and plays like a Japanese anime film or TV show. The themes, characters, settings, and the core of the story all take on anime-inspired themes in many respects. I suppose most ~true~ fans of anime and manga may feel that Bungie has imitated, or ripped off, Japanese anime, and therefore Bungie's work isn't genuine. But the company, now owned by Microsoft, has done its homework and the game looks and feels pretty close to the real thing, in a Western kind of way.   As Konoko, you are part of the Technology Crimes Task Force (TCTF), and you are asked to persevere through a difficult set of missions to uncover the Syndicate's secret dealings. As you progress through the game, you'll discover more about your own identity, and how it plays an integral part in solving the story's mysteries.   Oni's biggest draw is the sheer level of action in every level. But like a double-edged sword, the action is also troubling. Konoko is capable of multiple fist and kick attacks and combos throughout, and she also learns more complicated attacks as she gets deeper into the game. Konoko also is capable of carrying only one weapon at all times, though she can carry multiple packs of ammo. She also can use any weapon in the game that an enemy can. If an enemy drops a weapon, or if she pries it away from him, she can use it against him. The combination of hand-to-hand and weapon-style action is very appealing, and once you get past the game's annoying/long control learning curve, you may very well enjoy yourself. ~May~ being the key word.   Personally, I found the control scheme bothersome. I started yelling out four-letter words, even though there was nobody around in the house. I found real quick that I wasn't terribly good at Oni (or maybe that Oni wasn't very good for me?). Some games I pick up faster than others, and with others I somehow transform into a bumbling 18-fingered idiot. With Oni, it took me quite a while to grow skilled at handling Konoko. Or should I say, it took me a long time to learn how to work around the controls' strengths and weaknesses. So, after about two to three hours of dying a lot, I got the hang of it.   The control scheme works fine in most respects. Hitting works with R1, kicking with R2, and essentially every other attack move works with a combination of these two. But what bugged me to no end was multi-fold: Konoko's animations got in the way of fights; the running move is ineffective and inconsistent (double tapping the dpad or the left analog control sucks); the targeting system is difficult to use on a consistent basis, and the moves simply weren't quick enough for my tastes.   I could think up about five better ways of running, the first just by using true analog control -- push hard and she starts to run, push harder, she runs faster. Hey! Often I would find myself in the middle of a three-on-one, me versus three others. As I was being shot, Konoko slowed down, cutting down my chances of survival. Sure, I learned to strafe and get out of the way, but although slowing down the character while being shot may be ~realistic,~ it sure isn't very good fighting design. It's a good way to die though...  In short, the controls could have been more refined, sped up, and sharper, but they weren't, and so I suffered innumerable deaths and my friends and family suffered lots of cursing and many of my bad moods. Maybe you should play this game locked up and far, far away from other people you like. Just my suggestion, of course.   Once you get used to the aggravating controls (if you do), then you will enjoy the rest of the game, and although I didn't ever become a Konoko master, I was compelled to keep going. Why? Like I said, I have too much pride to let Bungie's bombastic control scheme keep me from winning. I have also been told on occasion that I am also crazy and tend to hurt myself for no good reason. But isn't self-torture a part of being a ~true~ gamer?   All self-inflicted pain aside, Oni's set-up is quite unique. You must be savvy about weapon and ammo management because there is often very little of both, and you must use stealth and a good sense of timing and exploration to beat most levels. Essentially, Konoko beats up a crapload of bad guys and then finds a bunch of switches to hit, opens doors, and beats up more guys, hits more switches, and then beats the level. The occasionaly platform jump is required, and occasionally you do a little something different, but it's basically attack, hit switch, open door, attack, etc. With Oni, you need to pick your fights with bad guys, deciding whether to conserve ammo, or to use it, choosing to draw away an enemy from a crowd, or to take on the whole pack. The pure tension this set-up creates is actually very compelling, and is handled well.   Also, unlike other games, you won't find weapons just sitting around, because in real life, you wouldn't find weapons and ammo just sitting around randomly on the floor, right? You have to snag them from the enemy, or nothing. Health portions, or hypos, are also short in supply. While aggravating in times of need, I liked the tension of playing smart and staying on my toes, of being careful with what stuff I had. The whole concept keeps the gameplay lean and forced me to anticipate the enemy's actions and think out good strategies.   On the other hand, I felt that sometimes the necessity to play a level over and over again was incredibly frustrating, even when I had the controls working for me. I sure could have used a few more hypos and weapons here and there, and man could I have used a just few extra save points. Mostly though, you find yourself without ammo.   The game is still a little buggy here and there. I found that I could beat up guys who were hiding behind walls by just kicking and kicking until I heard them die. It was cheap, but hey, it was there. And at least one boss, the first computer boss, had some hilarious things to say, but the cut-scene literally cut him off. And there was no way I was supposed to read a long paragraph in less than three seconds.   Overall, Oni is a pretty good game that brings some good ideas to the standard action genre. It surely has no real major competitors in this genre to date (unless you count X-Squad), and it sure beats the pants off games like Eidos' Fighting Force. I didn't care too much for the story, at least in the first half of the game, mostly because it's comprised of a bunch of techno-babble. Latr on it gets quite good. Still, I knew from many obvious foreshadowing scenes what was coming. But I was compelled to keep going despite the story. I seriously just wanted to kick some ass.   One other big complaint. The weapons, however cool and numerous, disappear if you don't use them in a certain amount of time. That's not realistic at all. That's not even arcade-like. It sucks is what it is. Here's a scenario: You kick some serious bad guys to pieces, and you then take the best equipment they have -- you can't use more than one weapon at a time, so you pick the very best one. You then move onto another set of rooms and fight another pack of dregs, but you run out of ammo, so you run back to the other weapons, but lo and behold -- they are gone! Where have they gone? Into the annals of the PS2, no doubt.   Despite a great training course, the controls are the game's biggest drawback. The control scheme may be so annoying and aggravating to some folks that they simply won't want to play after a few levels. Or perhaps worse for Rockstar, the controls may keep casual gamers from buying it altogether.   Graphics Oni is not a bad looking game. At first glance, it's simple looking, but there is some subtlety behind the dark gray, black, and blue interiors, and there are choice areas when special effects are used sparingly but effectively.   As Rockstar has made very extra clear to the gaming press, all of the buildings in Oni were designed by a professional architect. The buildings therefore are designed like real buildings, with proper stairwells, front desks, and well, lots of correctly placed office rooms. This doesn't really matter too much in terms of affecting gameplay, or even really affect the look of the game, because most of it is played inside. But after a few levels you may find that the design does in fact become recognizable in terms of getting from point A to point B.... Ah hell, that's just being nice, the architecture really doesn't mean squat in this game, it's just cool to talk about it.   That said, the whole mood of the game follows a dark, insidious big brother theme, so Konoko essentially runs around dark, soulless corporate buildings, entering into and exiting out of lots of doors and office rooms. For the most part the levels are very, very, very stark, but even more importantly, they are gigantic. Huge buildings with long draw distances and no pop-in appear in each level, which is neat. It's nice to see giant rooms, but hey! If there is not much -- or in some cases -- anything to see at the other end, what's the purpose? These rooms are stark and bare, and so it makes the game feel empty and useless.   But Konoko herself is good looking. She's highly articulated and well animated (in terms of looks), and her tight-fitting action suit, while probably horrible looking on a guy, looks um, really great on her. I always love the fact that military guys always wear the most utilitarian of clothes, while military chicks always wear tight-fitting leotards or skin-tight jumpsuits, for extra erm, something... From a guy's standpoint it makes perfect sense...   Special effects in Oni are used with efficiency in mind, i.e., there are few. Bungie didn't use the PlayStation 2's power for too many extraordinary effects -- in fact, there doesn't seem to be anything new or breath-taking here special effects wise -- except for lighting effects. Many of the weapons emit cool-looking laser and pulsing plasma effects, and in some of the later levels, in fact in the dream sequence, some extremely surreal animations are very eye catching.   Sound Oni is also quite spare when it comes to music, too. The game comprises mostly background sound effects and the occasional drop of foreshadowing music. A high-powered rocking soundtrack comes in when things get really special and it's quite effective and also perfect for the action. But mostly, the music is strangely low-key for a Rockstar game.   The voices are quite good. Funnily enough, if this were a port of a Japanese anime, the voices-over part would be a big annoyance. But here, that just didn't happen, 'cause it never was a Japanese anime. Here, the voice-acting fits the part. Many characters lines are caricatures while others are hilariously comic. In fact, many of the NPCs and bad guys have some genuinely great lines. I enjoyed conversing with whomever I could in this game, and if there were any complaint it's that there wasn't enough talking. But, hey Half-Life spoiled us all, didn't it?   And for those who want to win a free trip to Japan to visit an anime festival, your time has come. Enter the big Rockstar Contest, and you may win an all-expenses paid trip for two to Japan this August. It's only three questions. What is there to lose?For a game that attracted some serious hype over a long period of time, Oni did well in my book. I managed to not swallow any of the hype myself, so I stayed mostly untainted (he says in his Rockstar hat, shirt and shoes...). But Oni is a fun beat-'em-up with controls that are a little too complex for the game's own good. It's neither a great fighting game, nor a super shooting game. Despite the pain and agony I went through in Oni, I was compelled to keep playing. Chalk it up to good action, I guess. Or self torture... While I wouldn't go so far as to say that Oni is a giant hit -- it's not -- Oni is a good game that action fans, and perhaps easy-going anime fans (or is there such a thing?), might want to pick up.", "date": "Feb 2, 2001"}