{"name": "Final Fantasy", "name_review": "Final Fantasy (Import)", "ref": "https://www.ign.com/articles/2001/02/13/final-fantasy-import", "text": "Let's face it, most handhelds are yesterday's home consoles in portable form. That may sound like a negative statement, but it really isn't. The fact that tiny handhelds like the WonderSwan can pump out visuals the quality of a much larger home console from a few years ago is an important technical feat that should not be overlooked. The Game Boy Color is pretty much an NES shrunk down to the size of your hand, the Game Boy Advance is a 16x9 Super NES -- and the WonderSwan Color falls somewhere in between. It's only fitting then that a lot of 8- and 16-bit games come back for a second curtain call. Some, like Super Mario Bros. and Ghost 'n Goblins are welcome returnees. Others, like Shamus had better stayed buried in some landfill in New Mexico. While Nintendo's and SNK's handhelds have seen a large number of retro console game conversions, WonderSwan is usually home to original titles, targeted squarely at the Japanese market. There, I said the magic word without even planning it: Square -- a name that's become a synonym for RPGs.   If you're tuning in late into the most hotly discussed soap opera in the gaming industry, Square, once an exclusive NES, SNES and Game Boy developer, left the Nintendo camp in 1996 and signed on as a Sony PlayStation developer. Since then, industry analysts and gamers alike have been puzzled at Square's and Nintendo's inability to let bygones be bygones and bring some more of Square's million-selling franchises to the most popular handheld on the market, the Game Boy. Whatever the reasons (cough, Yamauchi, cough), Square's beloved classics never appeared on another portable system until the Japanese publisher finally engaged in a partnership with Bandai to make some of its biggest titles accessible to handheld fans. Considering that WonderSwan has the best graphics and sound out of the current crop of handhelds, that's certainly not a bad thing.  That's right, Square is back with the game that started it all. Although it's often considered to be the weakest (and most difficult) in the series, the very first Final Fantasy (1987) makes a welcome return in form of a dramatically improved WonderSwan Color edition that serves as a reminder as to why the series became so popular in the first place.   If you never played the NES version, here's the gist of the game in two sentences: You choose from six character classes (knight, thief, monk, red magician, white magician and black magician) to assemble a party of four warriors. As bearers of crystal orbs, you then set out on a quest to fulfill an ancient prophecy and vanquish four dangerous elementals. That's pretty much it. Of course, that's all easier said than done as you have to brave hundreds of turn-based battles, level up (and eventually upgrade) your characters, earn money to buy new items and talk to a huge cast of non-player characters to advance the story.  Though we're dealing with a direct port of the original 8-bit game, the WonderSwan Color version of Final Fantasy is a clear improvement over its NES ancestor. The quest, turn-based battles and map haven't changed, but the visuals and sound have gotten a complete make-over. The game, now on a 32 megabit cart with 256k S-RAM looks a lot like Final Fantasy IV on Super NES. Character and enemy sprites have been re-drawn and are no longer limited to three colors. Likewise, the spell effects have undergone some serious upgrades and the backgrounds are now in full color and perfectly reflect the environments that the battles take place in.       The towns, castles and dungeons are also much better looking and the developer has even added proper interiors to the buildings. No longer do you just walk into a shop and get brought to a menu. You can now walk right up to the counter and talk to the shopkeeper before the barter screen pops up.        The WonderSwan's display may not be as nice as the GBC's, but Final Fantasy's graphics still manage to easily beat out every GBC RPG on the market. And though the WonderSwan's crappy speaker tries its best to hide it, the audio has also been improved over the NES version. Plug in some headphones (via the optional headphone adapter) and you'll be able to hear Sakaguchi's famous melodies come to life with better midi samples and four channel stereo sound.  But the improvements aren't limited to eye and ear candy. There are some subtle gameplay improvements, such as the B-button dash (you can run fast in dungeons and towns using B), auto-targeting (a character will no longer miss because a previously targeted enemy has been eliminated by another team member), the ability to bring party members back to life during battle using magic and items, and a battle help option. Purists will be happy to hear that all these features can be switched off to achieve an exact duplicate of the classic (albeit admittedly inferior) NES gameplay. And since nothing is more annoying than running out of battery power in the middle of a dungeon, there is also an ~interrupt save~ option that lets you save anytime and anywhere and continue from the same spot in your next session.  Compared to modern RPGs, Final Fantasy is naturally a bit of a dinosaur. While the game has undergone the aforementioned upgrades, there are still some general balance problems that keep the game from being as fun as its sequels. First of all, leveling-up is not part of the adventure -- it's a necessity for survival and can get quite tedious. Later Final Fantasy games integrate the leveling-up process better into the whole quest and don't require you to spend hours chasing down high-level monsters. Depending on how much time you spend on leveling up your party, things get better later on in the game, but the beginning mainly consists of the following routine: kill monsters, go to inn to heal yourself, buy sword, kill monsters, go to inn, buy spell, kill monsters, go to inn, buy shield, kill monsters... well, you get the point. Although it doesn't happen that often, some groups of enemies can also incapacitate your whole party without any chance of ever getting out of it. All you can do at that point is watch your characters get killed one after the other. You can't run, you can't retaliate, you can't heal. And it's even worse if you've got a high-level party as you can virtually set your WonderSwan aside for 15 minutes and watch your party members get decimated one by one. Other balance problems include a too high monster encounter rate (seriously, are random encounters actually fun for anyone?) and the fact that the overall hit ratio is also set too low -- causing a lot of misses both on your side and your opposition's.   Interestingly, the fact that Final Fantasy is now available in handheld form actually alleviates some of these troubles. While it can still be downright tedious, the game's portable nature makes it easy to just switch the WonderSwan on for a few minutes for some leveling-up, then use the interrupt save and switch it off. Still, RPGs should be about story telling and character advancement, not about hitting the B button over and over. It doesn't help that the WonderSwan's button configuration isn't exactly designed for a human hand... Despite some of these balance problems, Final Fantasy for WonderSwan Color remains a great roleplaying experience that has aged fairly well. The visual improvements perfectly update the game for the WonderSwan's hardware and the gameplay enhancements are subtle enough not to mess up the gameplay experience. Some may argue that Square should have gone all-out and fixed the balance problems, but that could have potentially ruined the experience for retro fans and shortened the quest by many hours. Yes, the game can get tedious -- but the charming characters, wonderful music and magical settings more than make up for some of the age-related balance issues. If you know a little bit of Japanese (the game text doesn't feature any kanji) or you've beaten Final Fantasy before, this game makes for a great import. While I wouldn't suggest buying a WonderSwan just for some old-fashioned RPG fun, Final Fantasy is a nice reminder that games don't need hours of FMV and overblown production values to tell a story.Now where's my Game Boy Advance version of Final Fantasy V?", "date": "Feb 13, 2001"}