{"name": "Undying", "name_review": "Clive Barker's Undying", "ref": "https://www.ign.com/articles/2001/02/21/clive-barkers-undying-2", "text": "While any horror fan is quite familiar with Clive Barker's novels and his work on movies such as Nightbreed and the Hellrasier series, he had as of yet left the interactive world of videogames untouched. But now that has all changed.  Clive Barker's Undying is now avaiable, and the results are every bit as scary and enthralling as any of his movies or books, and in some cases even more so because you're intimately involved with the action as it happens.  Hopefully you've all had a chance to read our preview of Undying by now, so I don't have to delve deep into the back story or Jeremiah's ~family problems.~  What I will say, though, is that I'm personally glad the folks at DreamWorks Interactive decided to heed Clive's advice and go with the period-fitting, curly-locked Patrick Galloway as the main character rather than the bald-headed, tattooed Magnus.  I don't think a burly, bald, tattoo-laden protagonist would have fit in well with a game set on an island off of Ireland at the turn of the 20th century.  With that said, it's obvious that not only did he lend his name to the title and influenced the main character, but Clive Barker was also intimately involved with the entire game design process.  While the creepy, spine-chilling storyline is obvious Barker, he also had quite a hand in the pacing and atmosphere of the game.  Unlike most first-person shooters, Undying isn't about constant action and mouse clicking.  As any horror fan will tell you, it's scarier waiting for something to happen.  This isn't Quake or Unreal -- baddies don't jump out at you constantly.  This game is all about atmosphere, and part of that atmosphere is keeping you edgy just waiting for the next beastie to jump out and claw off your face.    That's not to say there's not plenty of action in the game. While there were a few times in Jeremiah's ransacked, desolate manor where I found it tedious to traverse from one end of the mansion to the other, I was still tense and on edge because I was primed for a Howler to slip in through the window at any moment.  Speaking of waiting for creatures to leap out at you, I was genuinely impressed with the AI in Undying.  Some creatures, like the Howlers, attack in packs, with one grabbing your attention and distracting you while the others flank you and rip at your back, while other creatures, like the mindless skeletal warriors, come at you head on with little care for their well-being.  This approach to different styles of combat makes it feel like you're actually fighting a variety of different creatures rather than just the same AI wrapped in a different skin.  Creatures will also dodge, spin, and generally try to stay out of the way of your direct line of sight so as not to open themselves up to an easy shot from your pistol or a shocking blast of lightning.  While, for the most part, gameplay is similar to any other FPS, Undying mixes the action up a little by not only offering a wide variety of creative weapons -- from the requisite pistol and shotgun (but with ingenious ammo types such as silver bullets and phosphorous shells) to more esoteric armaments like the iceball-lobbing Tibetan War Cannon and the extremely powerful but close-ranged Scythe -- but you'll also find eight spells along the way that serve both defensive and offensive purposes.    While at first I thought this dual-hand approach would be awkward, it was actually quite reassuring to carry around a trusty gun in one hand while my other hand dabbled in the arcane arts.  The control system was easy to get used to, with the left mouse button relegated to my chosen weapon and the right button to casting spells, and the mouse wheel used to cycle through either your technological armaments or your magical tricks (or, in my case, both, as I had the spells cycle with mouse wheel up and the weapons with mouse wheel down). The system turned out to be really quite elegant, and my early doubts were belayed after my first few brawls in the game.  What isn't quite so graceful is the aiming system.  Unlike many other shooters, your bullets don't strike your enemies if they're ~close enough~ to your aiming reticule, and long distance shots aren't guaranteed to hit.  You will miss, sometimes even when you're sure your foes are right in your sights.  But this only makes the game feel more realistic as, for the most part, you're dealing with turn-of-the-century guns that really weren't all that accurate to begin with.  You'll rely more and more on your spells as the game progresses, although I was a bit disappointed that increasing the power of a spell with an amplifier didn't seem to make the spell all that much more powerful.  For example, a level five lightning bolt didn't seem to do all that much more damage than a level one lightning bolt, but the spells were cool nonetheless, and the variety of spell types -- from magical shields to raising the dead to fight on your side -- really offered up a lot of different ways to approach combat.  One of the most useful and interesting spells is the Scrye incantation, which you begin the game with.  Scrye allows you to see events that happened in the past and/or in other dimensions, thereby giving you almost two places to explore in each level.  This spell really did a lot to enhance the eerie atmosphere of the game, and there are a lot of places where you'll see some truly freaky stuff if you've got Scrye activated, but may completely miss if not.    Like I mentioned earlier, Undying isn't about constant action and endless mouse clicking.  There are quite a few puzzles as well, especially of the jumping variety, but none are all that hard, and some are actually quite fun, especially in the floating ethereal city of Oneiros when you often have to make a leap of faith and just hope a walkway appears below your feet.  Unfortunately, even with its deep storyline and gothic atmosphere, Undying does suffer from the ~locked door~ syndrome, and several times in the game you'll reach a door only to find you have to go searching through the house to find the appropriate key.  Since it's built on a highly modified version of the Unreal Tournament engine, Undying is pretty as well as a lot of macabre fun.  The natural environments are a bit blocky, but the indoor environments are realistic and creepy, and the striking lighting effects really add to the unnerving ambiance.  Levels are small, which makes navigation easy, but it also means there are lots of breaks in the action as you wait for a new level to load.  All in all though, the load times aren't all that bad, and there's usually plenty to do before you hit another load spot.    Another nice graphical touch that enhances the mood of the game is the realistic cloth modeling system.  Imagine the difference between walking down a flat, dark, lifeless hallway and one with wafting muslin curtains blocking your view of the other end of the hallway...yes, this game will freak you out.  Of course, this graphical power comes at a price, and if you don't have a fast system you won't be able to run Undying at high detail with a good framerate.  Even on an 800MHz machine with a 32MB GeForce2 GTS the game got choppy when there were a lot of enemies on screen or if I was in a particularly detailed area.  Creature and character models are sharp and fit the game well, and there's a wide variety of enemy types, so you won't fight the blue, red, green, and gray version of the same baddies over and over again. While the interior settings look great, objects such as chairs and tables are fixed in place, making it so you can't interact with the environment.  The only visual problem I had with Undying were texture seam problems, as I could often see the background shining through where two textures met.    Since Undying is so story-laden, you can expect a lot of the plot to be unveiled through in-game cut scenes.  These are very dramatic because the screen switches to a letterbox mode and, while your feet are locked in place, you can look around the environment since they're rendered in-game.  You'll mainly be talking to servants, Jeremiah, and his departed family members in these cut scenes, although I did find it funny that many of the servants were still hanging around the mansion after the recent hauntings and sightings of supernatural creatures that would like nothing better than to suck their brains out through their eye sockets.  I guess the local hired help isn't of the smartest stock...  While audio often gets overlooked in games, so much of the tone of the game is set by the audio that it's hard to do when speaking of Undying.  The audio engineers paid particular attention to the sound design of this title, as Undying employs great use of audio, from the well-acted voice work to creepy sound effects to the background music full of gothic chants, violin trills, and deep drum beats.  Undying takes full advantage of 3D sound setups, and you can tell where your foes are just by listening, making your ears equally as important as your eyes.  Many events, such as when to use your Scrye power, are triggered by eerie whispers or muffled voices, making the sound work in the game that much more important.  All in all I was really impressed with Undying's style and gameplay.  Although it's a rather short single-player experience with no multiplayer options (there is a multiplayer patch in the works already), I had a great time playing it through the first time and I'm already going through again to look for things I might have missed the first time.  Mechanically it's not the best shooter around, but the atmosphere and edge-of-your-seat suspense more than make up for the slightly awkward controls.  I can't think of a game that's made me feel so much suspense and freaked me out as much. If you're looking for a deep, chilling shooter with a lot of weapon and spell variety, you should be very happy with, as well as horrified by, Clive Barker's Undying.    -- Tal Blevins Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Feb 21, 2001"}