{"name": "Star Wars Starfighter", "name_review": "Star Wars: Starfighter", "ref": "https://www.ign.com/articles/2001/02/22/star-wars-starfighter-3", "text": "As LucasArts' first title for PlayStation 2, Star Wars: Starfighter marks a substantial step up from most of its previous console efforts, among which there have been many disappointments. It has easily been one of the system's most highly anticipated early releases and we're pleased to reveal that it has completely lived up to all of our personal expectations.  Starfighter is based on a storyline that's concurrent with the general happenings of Episode I: The Phantom Menace, but not completely tied to the movie's narrative. It basically gives you a perspective on some of the events from the movie through the eyes of three different characters new to the Star Wars universe, Rhys Dallows, Vana Sage, and Nym. With the shackles off, LucasArts has been able to make what has turned out to be one of the most gratifying console games that the company has ever released. GameplayOne of thing things that help make Starfighter such an enjoyable game to play is the fact the control is fairly deep without being too complex. In the beginning most players will probably find themselves slamming into walls and having problems keeping up with the enemy fighters, but this all fades away after just a few missions. Once you learn the intricacies of the control scheme and learn how everything works, like using the right analog stick to roll and re-center yourself, you'll find that the craft are highly maneuverable, even at high speeds and in tight areas. Everything is literally at your fingertips (and thumbs) and it's fairly easy to cycle through your targets with the triangle button or target something in front of you with the square button. There are three different craft that can be controlled, not including secret stuff, and they each offer slightly different maneuverability and types of primary and secondary fire. Rhys' Starfighter has your basic laser cannons and proton torpedoes and is the speediest of the craft. Vana's ship, the Guardian Mantis, is the most highly maneuverable of the bunch and has sensor guided Nano missiles and Ion-enabled sensor tags that work together. Nym has the slowest, but most powerful of the ships, as his starship, the Havoc, is equipped with dual triple-laser canons, energy bombs, and a Plasma Scourge. Getting to pilot these different crafts really helps keep the action fresh and this is helped even more by the fact that there's a nice diversity in the mission types. There are more than 14 single-player missions and they've been split up nicely between ground- and space-based levels. Also included are two 2-player missions, a canyon race/dog fight and game of capture the flag -- these have to be unlocked, and add even a little more play value to the game. The missions are somewhat lacking in the creativity department, as most of the objectives consist of either just destroying everything or protecting stuff. It would've been nice if some of the missions had you doing something that wasn't already seen in just about every other space shooter before it, but in the game's defense, the missions are very nicely designed, even if a bit  clich. The missions are also completely linear and nothing that you do in a mission will affect the subsequent levels or the rest of the game. In the Colony Wars games you had branching paths that were determined by how effect you were in each of the missions, which added a lot of variety to the game in addition to making you feel like you were completely in control of your destiny. And in Battle for Naboo on Nintendo 64, there were separate mission goals that could be completed that helped you actually upgrade your craft, once again, making it a little less linear. Starfighter does have a nice medal system that's similar to the ones used in Naboo and Rogue Squadron that give you additional stuff to do beyond the standard mission objectives, but they're only used for unlocking secrets and don't affect the rest of the game. It's worth noting is that Starfighter is one of the most impressive shooters ever made in terms of the raw size and scale of what's going on. In many of the levels, you are really given the sensation that you're a part of an epic war and not just some guy taking on the world alone. And this really helps make up for some of the shortcomings in the originality of the levels. For instance, in one of the missions you'll find yourself providing protection for a friendly base. But, instead of you being the only real threat to the enemy, you have multiple wingmen helping you out and masses of ground turrets shooting skyward at the enemy attackers. The end result is a situation where you're flying through a sky littered with both friendly and enemy laser fire and you really feel as if you're in something much bigger in scale than anything you've ever experienced before. The game's best feature is undoubtedly the zoom-in or ~sniper-mode~ because it really fixes one of the biggest problems that's generally apparent with most space combat games, which is the fact that most of your time is spent shooting at small, pixel-sized, enemy fighters because the only time you see them close-up is when they're flying past you at breakneck speeds. While completely impractical in the non-gaming sense of things, the zoom-in feature allows you to get a much closer look at the enemy without having to be too close. It's a bit difficult to use at first, but after a few missions you'll soon realize that it's something that should have been in all space shooters and should be in every single game released in the genre in the future until someone finds a better way to handle it. One other possible criticism that some will direct towards the game is that the story mode can be played completely through in a day, with the bonus missions and getting all the medals adding only up to only a week more of play time. While valid, it won't really be a factor in the eyes of most because the missions in Starfighter are just so tremendously fun to play that you'll want to play all of them over and over again. This is one of those titles that you'll still have fun playing after you've already played through everything about three or four times. GraphicsAlthough it's not without flaw, this is arguably one of the best looking games that you'll find on any console on the market right now. The game is gorgeous and what's most impressive about the visuals go well beyond the amazing texture detail in the walls of the canyon, the brilliant enemy ship design, the fantastic explosions, the beautiful water, or any of the many dazzling special effects being used. The most impressive thing about the game's graphics is the raw scale of things that you'll see in some of the game's levels -- there's just so much going on. The only drawback is that all of this goodness doesn't come free and the game definitely takes a hit in the framerate department. The space missions are generally pretty smooth, but players will experience some slowdown in areas where there's a lot of ships and/or explosions on screen. Moreover, the general framerate in most of the ground missions is a bit lower than what we'd hope with some areas getting really choppy. Then again, the game's less than perfect framerate never really gets in the way of gameplay and most players will probably stop noticing it after playing the game for any extended period of time. SoundAs with most Star Wars-based games, the sound is one of its strongest assets. It has a classic John Williams score, with lots of tunes that are either remixes of or straight rips of the music from Episode I. In any case, it has a classic Star Wars feel to it and not only fits the mood of the game perfectly, but it helps create an atmosphere that makes you believe that you're in something much more important than a videogame. The sound effects are equally impressive and all of the laser fire, the sounds of ships colliding with each other, the explosions, and other various audio effects are of the quality you'd expect from a LucasArts title. The same can be said about the quality of the voice acting, which is generally top notch, even if it can be a bit campy and derivative at times. For those that have decided to forgo reading the bulk of the review above and skip right to the comments, we'll give you the quick Cliff's Notes version of the review. Star Wars: Starfighter is one the best space shooters that has been released on PC or console and in the Star Wars universe or out of it. It has a similar feel to titles like Colony Wars, Rogue Squadron, and the X-Wing/Tie-Fighter games, but on a much larger and more polished scale. If you're a fan of Colony Wars, space shooters or flying games in general, or Star Wars, you should stop wasting your time reading this clumsily-written review and just go buy this game right now. Starfighter is right up there with the best of the best on the console and is one hell of a good reason to own Sony's sleekly designed computer entertainment system. If this is a sign of things to come, then LucasArts can kiss its bad console reputation away, as Starfighter marks one of the most substantial turnarounds in the annals of gaming. And I, for one, can't wait to see what the company has in store for us in the future.", "date": "Feb 22, 2001"}