{"name": "Crime Cities", "name_review": "Crime Cities", "ref": "https://www.ign.com/articles/2001/02/27/crime-cities", "text": "In sci-fi terms, it's been light years since the last great futuristic vehicular action shooter.  Neo-mercenaries itchin' for action these past few months have had little recourse but to dig out dusty copies of G-Police, B-Hunter, or BANG! Gunship Elite.  Arriving at an ideal moment then is Crime Cities, a little known foreign gem brought your way via Eon Interactive.  While quite old in actuality, as developer Techland has been shopping it around for ages, the game is nonetheless a cutting edge crack at a long stagnant genre.  Truthfully, if this eminently playable and atmospheric high flyer is representative of the new age of Polish craftsmanship, people should start importing more from the territory than just sausages and mail order brides.  Before getting any further though, recognize that the background story is weak.  You're an Earth cop named Garm Tiger who's been sent underground into the Pandemia system in search of a missing contact.  Since law and order are maintained by a corporation, not regional government, chaos reigns throughout local districts, forcing homeboy to go undercover as a seedy, bad-ass criminal.  And faster than you can groan ~been there, done that,~ Garm winds up pissing into the space age wind, framed and marked for dead by people he trusted.  Admittedly, a plot which boasts cheesy characters like crime boss Costello, hacker dweeb CyberDog, and spiky haired babe Natasha Tyminksy doesn't have much going for it on face value.  But as mom said, never judge a book by its cover.  Sweet gameplay hides beneath the aforementioned crap coating.  Despite coming packed with a manual thick as Roseanne Barr's buttocks, Crime Cities features a magnificently simple interface.  Provided you can stomach a semi-comatose tutorial and manage dual-handed controls (a feat that still eludes certain members of the editorial staff, who lack opposable thumbs), take off occurs in T minus fifteen minutes.  Once airborne, pilots will zoom over, under, and through a huge cityscape in search of victims, who promptly get fragged after exceedingly intense dogfights.  Directional keys and the mouse cover most functions splendidly, while a few additional buttons are used when calling up the mini-map, interactive menus, or target selection functions.  Finding objectives couldn't be easier, either; a transparent line of circles, or 'tunnel,' clearly points the way.  All things considered, Techland couldn't have crafted a more ergonomic control scheme.  A la most epic tales, time passes slowly until you really gain steam.  Early on, players wait for email messages that further the story and inform them of newly issued contracts.  These paid missions help you earn cash for weapon, defense, and accessory upgrades, which prove invaluable during later assignments.  Taking on jobs such as assassination attempts, courier runs and escort gigs ensures a steady stream of income.  It also establishes a reputation for your character, who can use the boost in props to climb his way towards higher standing in clandestine circles and trigger new plot developments.  Granted, specific activities may piss off a fanatical religious faction or underworld family, but that's the price one pays for trifling in other people's affairs.  Being a soldier of fortune, there is always the option of sitting idly by or causing trouble indiscriminately, but neither choice pays the bills.  However you proceed, things heat up fast.  Successful jobs invariably result in more work, and new projects mean bigger battles.  It's a real hoot playing privateer, because cash can be spent on Mezon explosive crystal launchers, Dragoon rockets, Abdomenizer speed boosters and all sorts of other quasi black market goods.  All roads eventually lead to a giant firefight with multiple opponents and little hope for survival.  Evasive maneuvers and intense aerial dueling rapidly become second nature as you flip upside down, weave around skyscrapers, and plant fiery kisses on foes' metallic bottoms every other minute.  Given the erratic combat style and overwhelming odds arrayed against do-gooders, beaucoup restarts are unavoidable.  And that doesn't even take into account those lovely occasions when StarPol cops decide they've had enough of you or your newfound friends ripping innocent bystanders new orifices and decide to get in on the action.  Because Crime Cities is set in a high tech metropolis, everywhere players look a living city thrives.  Towering buildings soar high above smoky cumulus clouds while buses and cars that look like crosses between vintage autos and rockets clog ten mile high byways, Fifth Element style.  Remarkably, one can soar both above and around them, and interact with all pedestrians too.  Unintentional crashes are common, but this same annoying traffic often shields you from killing blows, so skilled combatants can laugh with glee as they get away while some poor schmuck who was in the wrong place at the wrong time goes down in flames.  Although floating billboards and intergalactic school buses serve as makeshift obstacles and merely acceptable scenery at best, they open a world of tactical possibilities.  Never will you feel like landscapes are just lame cardboard cutouts.  The generic 3D lighting effects and repetitive texture mapping on display won't win any awards, but they do prove enjoyable.  Pepper a scumbag with laser fire and he'll go down in flames or explode with a rousing show of pyrotechnics.  Always you fight over identical urban environments that pop up magically from within rainy fog, though detailed ship models, constant visual feedback in the form of news and weather, speedy frame rates, and humorous strokes like intimate companionship ads smooth over such flaws.  If anything, more ambient sounds and voice overs should've been added.  That isn't to say one will dislike conversations delivered as still picture transparencies with accompanying text dialogue, though.  For an older product, it sure has class.  Sans hype, marketing, and promo materials, this is a treasure most folks will overlook.  Crime Cities sports neither the graphical flair of Descent: Freespace nor fan following that Independence War enjoys, but it nearly travels in the same stratosphere regardless.  That such a conceptually lukewarm program, let alone one constrained by its own setting, can excel in so many areas is virtually unthinkable in this millennium.  So buy it, suckah.  Even with naught but deathmatch multiplayer support included and various minor solo play niggles taken into account, the awesomely underhanded gameplay puts the dog back in dogfighting.  Fat chance a sequel will be forthcoming, but hey, you can't fault a techno-geek for hoping.  -- Scott Steinberg Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Feb 27, 2001"}