{"name": "Stupid Invaders", "name_review": "Stupid Invaders", "ref": "https://www.ign.com/articles/2001/02/28/stupid-invaders-3", "text": "If you put a switch in a dark room, I'm going to kill you. Don't do it. Don't you dare even think about it. If you think I'm fishing around a nearly black screen for ten minutes to find the one mouse trigger, you're mistaken. Cow poop jokes? Sorry, won't do it. Aliens with sex change fixations and pornographic film experience? Alright... I'll give it a try.  Stupid Invaders will push your buttons as much as you run around screens trying to find buttons to push. It's hilarious in a surreal, disturbing, and completely lowbrow way. The animation is nothing less than stunning, and the CG is so clear and smooth that you'll be shocked this isn't playing off of DVD. The voice acting is without flaw. The game though is... frustrating. It'll tease you with references to Oedipus complexes and phone sex, and it'll keep you clicking with visions of giant exploding chickens and poop hammers to the head, but inside your stomach will be churning. Xilam, the designers of Stupid Invaders, have spared no expense to ensure that Stupid Invaders comes off as one of the prettiest and slickest adventure games ever, but for all it's technical innovation, the actual adventure gameplay takes three steps back for every step forward.  It's hard not to get addicted, though. The opening cinematic gives you a quick rundown -- five aliens, one with two heads, one in desperate need of a sex change, crash land on earth and kill time in an abandoned house while trying to get back home. The cartoon series of the same name focused on their earthbound adventures, but the game version finally helps you to help the bizarre cast of characters finally get home. Gorgeous, Candy, Stereo, Etno and Bud give you a whole range of insanity, pomposity and stupidity guaranteed to please every range of humor. Just don't forget, this is not for kids. Don't be fooled by the cute graphics, this title is pure raunch and toilet humor, with some sophisticated nastiness thrown in to make you feel slightly less guilty.  Like The Longest Journey, this is an adventure game taken to new technical levels. While TLJ used beautiful 3D polygonal characters with CG backgrounds, Stupid Invaders does the incredible and fills nearly the entire game with unbelievable CG animation. Walking around is represented by a simple repeated walking animation, but every tiny little action, from climbing a ladder and pulling a switch to pouring baby oil on a door hinge to avoid repeated sexual hijinx with a bunny-suit wearing pornographer (don't ask) is animated with flair and detail. Where most games would just chuck in a standard animation, SI adds humorous touches. Every character has their own personality, and you'll feel it within seconds of playing them. Believe me, you'll get more than enough time to play around with your favorites. The plotline puts you in the shoes of the aliens in heavy rotation, and sometimes has you playing chunks of a simultaneous plotline from multiple character's perspectives.  As you'd expect, the actual storyline and gameplay is as bizarre as the alien invaders themselves. Walk outside of your house, and you'll immediately catch a little bunny violently humping every object on screen, than disappearing, never to be seen again. Why is there a TV on the edge of a giant ledge in the Paste Brothers factory? No clue. There are all sorts of added touches that Xilam has added purely for humor's sake, such as an odd purple stuffed bear that appears in refrigerators, closets, and armoirs, purely to hit you in the head repeatedly with a giant mallet. More importantly, you can't mention the game Stupid Invaders without immediately following it with butt. Lots of butt. Poo humor, toilet humor, fart humor, butt humor, naked butt humor, showing your naked butt humor, showing your butt pooing humor -- every variation on the scatalogical theme will be thoroughly explore by the time you finish the adventure. I know you like South Park, so this shouldn't be an issue.  Did I mention it was pretty? The clarity is stunning, particular on the many, many cutscenes in the game, all in resolution similar to Diablo II's cutscenes. No blotchy pixelation, just pure happiness. The characters movements are impressive, and the humor is right on the money. Match this with the voice actors, all from the cartoon show, and you've got a seamless entertainment experience, in least in terms of pure storyline and visuals. Good campy music, fantastic sound effects (wait until you hear the sound of their little floppy on metal walkways), and great dialogue round out the action.  Once you're past the glitz and show of the visual/aureal experience, you'll find yourself stranded back in the early 90s, unfortunately. The only thing truly modern about the adventure gameplay is the fact that it's mouse-driven -- everyhing else harkens back to the olden golden days of adventure gaming, which sounds great until you put it into practice. The Longest Journey was generally great about having April give you subtle clues about what to do next, or what use an object might be used for. SI, on the other hand, rarely if ever gives you the slightest clue on what to do next, what objects should be used for, or what your general next step should be. And because the plotline is so surreal, you can rarely count on general logic to keep you going. One shining example is a puzzle that involves a spot of dirt called ~place on ground~ and an inflatable couch. So you're supposed to figure out that if you put the inflatable couch on the random place in the ground and use a razor black on the couch, you'll fly up into the air (offscreen) to another room above that you didn't even know existed. No clues, not even the slightest hint. Classic adventure frustrations still exist in the world of Stupid Invaders. Remember the fun of having to press on objects two or three times to get the special event to happen? They're everywhere here. Remember having to fish around to figure out what parts of the room you can walk to? Despite some cool lighting effects that guide you to special parts of a room, there are tons of glitches that keep you from realizing what parts of an area you can explore. One moment you'll get a clear ~walk here~ mousover command, while other time you'll have to just wander around and magically change the camera angles. And like I said before, if I have to fish around black rooms for a single switch, I'll kill someone. Let's just say that someone's now at the bottom of a very deep river.  Even those instant deaths exist in this game, something I haven't seen since way back in the King's Quest III days. Remember the fun of not saving, then walking in a room and instantly dying, only to realize that you had to go back and repeat 20 minutes of gameplay just to get back to the instant death area? It's back. Maybe we're spoiled, maybe we're bitter, but the adventure gamers left in this world still need convincing to break into a classic type adventure game, and instant deaths certainly aren't going to help matters much.  While the non-sequiter puzzles will anger you to no end, and send you searching the web on an hourly basis only to slap your head and say ~huh?~ to the solution, you can't help but want to keep playing when you hear lines ~your butthole is going to take me back to your planet.~ Or maybe it's just me.  Stupid Invaders is two parts magic, one part dirty underwear. If you're willing to put up with some weird glitches, some frustrating game design, and some slow pacing, you'll find some of the weirdest and best humor in years. Just get your mouse-fishing hand ready.   -- Vincent Lopez Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Feb 28, 2001"}