{"name": "Tiger Woods 2001", "name_review": "Tiger Woods PGA Tour 2001", "ref": "https://www.ign.com/articles/2001/03/01/tiger-woods-pga-tour-2001-2", "text": "The one and only thing that golf has in common with professional wrestling: it's the Sport of Kings, while puroresu would be the King of Sports.  This bit of trivia was brought to you by The Myriad Interconnections That Turn Dave's Cerebrum Into An Evil Spider Web Of Terror.  Thank you.  If golf is the sport of kings, then video golf would be the sport of aspiring commoners, those of us out there who can't afford the psychotic expense of a day on the links, but still enjoy the quaintness of it all: placid scenery, absolute quiet, silly pants hiked up past your navel, and long sessions of contemplating whether you should swing an inch to the right or left.  Luckily, golf games are getting better and better at simulating all that silliness (and the nuances of the actual game to boot), and Tiger Woods PGA Tour 2001 on PlayStation 2 (achoo!) may be the best yet.  I am not quite what you would call a conoisseur of the genre, but this has graphics that show up even PC games -- Links 2001 and the PC version of Tiger Woods both fall well behind it when it comes to 3D characters.  The console control interface, meanwhile, throws in some gameplay elements that only our beloved little boxes can handle.  The big drawback is a very small feature set, but there's still an awful lot of golfing in this game.  Gameplay  One quirk of control that may draw some criticism (or at least conservatism) is the complete absence of digital control.  Presumably due to the ascendance of the Dual Shock 2, the only swing interface available uses the analog stick, in the same manner that's been an option in the last two or three PlayStation EA golf games.  You hold the stick back to fill your power meter, then snap it forward when you want to swing -- it feels just like the suspension preload in ATV Offroad Fury.  You can hook or slice the shot by bending the stick to the left or right, and add a dash of spin while the ball is in the air, to guide it just a little bit in one direction or another.  Those used to the old tap-tap-tap digital controls are going to have to take some time and get used to the new/old system, but if you used it before, you'll be right at home, and it offers you a good deal of control once you get the hang of things.  There's a tutorial in the help section to give you feedback on where your swing is going, if you persistently hook or slice, and a few minutes there should improve your game nicely.   In addition to the basic swing controls, you have a complete club selection, four different types of shots with each, stance options to affect the arc of the shot, and a strong interface for placing shots -- you can select a point on the course and the shot power meter will show a handy mark to tell how much power is needed to drop it there.  The 3D wind indicator could stand to be a little larger, but then it might obscure other parts of the interface.  As it is, it's readable, just not quite so obvious as I might like it to be.  Putting is aided by a grid setting that just slightly exaggerates the shape of the terrain with a neat 3D morphing effect.  This doesn't actually change how the course plays, it just shows up the features of the green a little more clearly, so you can better judge how to arc and power a shot.  Besides that gimmick, there are also typically sharp controls for aiming and powering your putts.  The one trouble with Tiger Woods 2001, as ominously foreshadowed above, is that the feature list is more than a little lean.  It's an unfortunate consequence of the time it took to get a solid engine up and running on PS2, and on account of the much more complex 3D modeling for courses and players on PS2.  There are only six pros (to play as; several others appear as names on the leader board) and three 18-hole courses (Pebble Beach, Poppy Hills, and Spyglass Hill).  Compare that to a whopping 17 courses in the PC version.  The flipside, of course, is that the PS2 gets a much better-looking game.  Graphics  The modeling and texturing of both golfers and courses in Tiger Woods is certainly impressive -- everything is very smooth, and the many shades of the essentially monochromatic environments (green, green, and more green) are expressed quite nicely.  What really stands out after a lengthy play session, though, especially if you score a few birdies or eagles, is how refined the character animation is.  The stances, swings, and mannerisms of the golfers are replicated with excellent attention to detail.  Subtle, small body movements give away tension when they're standing still, and after an especially impressive (or poor) shot, their poses are very true to life.  Compare the game Tiger after a birdie to the real Tiger after a birdie and the resemblance is uncanny.  The realtime shadows are another high point.  Though there aren't many of them, the animating shadows for the flags and golfers are nice and smooth, with few sharp edges.  Tree modeling isn't the best, with recognizably flat foliage, but the falling leaves are neat on the rare occasions that you encounter them.  The camera tracking is usually quite good, with some dramatic angles thrown in to spice up a long drive.  On a few occasions, it'll wind up stuck behind an unusual bit of architecture (the bluffs at Pebble Beach, for example), but that's basically a cosmetic problem, with no effect on gameplay.  What does effect gameplay is when the game simply decides not to track a shot, which also happens every so often -- this defeats the purpose of giving you the in-air spin controls, and makes it frustrating when you then land invisibly out of bounds.  There are also a few bouts of framerate failure, taking place at odd times like post-shot animations, but it never interrupts gameplay or the progress of the ball in flight.  Sound  Tiger Woods has some very nice sounds for a game that's quiet so much of the time: a variety of crowd noises for excitement or sympathy, as well as voice samples that deliver commentary from both announcers and the golfers themselves.  The latter wears more often than the former, since the library of specific comments is necessarily limited.  You can hear polite applause a hundred times and it doesn't grow repetitive, whereas the tenth ~A struggle just to finish~ as you grind out another double bogey is aggravating. The golfer voices are a bit better, though, as they cut in to comment on a spin or particular shot.  It sounds like each individual pro has his own repertoire of quips, which helps stretch things out a little (unless you prefer a particular golfer). Tiger Woods 2001 is a very well-made game, and the pieces are in place for an excellent sequel next year once EA has the time to model a larger complement of courses and golfers.  As it is, it offers excellent gameplay and graphics, but it'll be up to you to decide whether you'll run out of steam after completing the three courses that are available.  They're three very good courses, and the Tour and challenge modes offer plenty of variations that stretch out their longevity, but it's still a poor selection in comparison to many other golf games.If you have to have the best-looking game around, though, look no further, and if you pass on this year's model, you can be assured that Tiger Woods 2002 is going to be a very fine game of golf.", "date": "Mar 1, 2001"}