{"name": "NCAA GameBreaker 2000", "name_review": "NCAA Gamebreaker 2000", "ref": "https://www.ign.com/articles/1999/08/24/ncaa-gamebreaker-2000", "text": "NCAA GameBreaker 2000 has been the staple of many sports gaming fanatics football diet for a few years now.  The first installment of the popular series was met with a great sense of enthusiasm and it sold extremely well.  The reviews were favorable and the overall experience was an exciting one.  Last year the taste for NCAA GameBreaker waned quite a bit.  Developmental changes to the title doused the more unique features (such as a controllable camera while running) reducing some of the GameBreaker fire to cinders.  This year the game has returned improved in almost every major category and 989 Studios has again shown their resilience as a developer. Gameplay Laced with a plethora of modes and extras, GameBreaker 2000 is plum full of football goodness.  In the mode department, you have Scrimmage, Fantasy League, Tournament Season, Bowl Season and the new Career Mode.  In Career Mode, you can function as either the head coach or the offensive or defensive coordinators from amidst the Division 1-A teams.  You are hired on as coach in one of the smaller schools, and through your coaching prowess, you can earn promotions into the bigger and better programs. Fail however, and your tail will certainly be canned.  Do well, and then as you can make a run for the National Championship.  On the way to the big game, you can tweak GameBreaker 2000 by adjusting things like injuries, penalties, game speed and computer AI.  GameBreaker 2000 is rather smart; that is with the exception of a number of ~money~ pays that seem to work too well too often.  However, spiking up the AI in the game will result in significant reduction in how effective those plays are.  Speaking of being effective, Total Control running and passing is back, and has always been one of the highlights of the GameBreaker franchise.  Using these features, you can lead and underthrow receivers to beat good defensive reads by the CPU or a live opponent.  With Total Control running, players can make their runners perform spectacular feats such as double spins, diving over piles, shoulder charges and high steps.  The control is very responsive and the feel of the game is tight.  You will see blockers do a fine job of creating holes, but they close fast.  At the same time, your receivers will get free long enough for the player to burn  pass in before the coverage can tighten things up.  Players will show off these moves amidst 114 NCAA Division I-A teams, along with their respective stadiums and a host of 50 classic teams from the past.  The game has the new TV-style presentation, Keith Jackson doing the announcing duties, a Play Editor to customize and create your own plays, drafting of GameBreaker players into the new NFL GameDay 2000, Blue Chip recruiting, a Heisman Trophy race and more statistical tracking than one can imagine.  The interface is sluggish, the pay calling screens leave something to be desired and there is a decided lack of penalties and fumbles in the game, but overall this game is truly fun in many respects and is thus a well-rounded football package by any standards.  User controllable celebrations add a new multi-player dynamic so one can taunt friends at will.  That was an interesting inclusion for sure. Graphics In the area of graphics, visuals and ambiance, GameBreaker 2000 is solid.  The player models are of a high polygon count, with nice detail and varying size.  You can also notice a perceptible difference in the sizes of players at different positions.  The stadium models are standard and do a decent job of representing their real life counterparts, though some heavy aliasing in the line markers down-field can be annoying at times.  The game sports a nice, crisp color palette, and details such as logos on helmets have been captured with detail.  In addition, player's uniforms will develop mud and grass stains as weather effects such as rain and snow factor into the gameplay and aesthetics of the on-field environment.  However, here is not the only place that GameBreaker 2000 shines.  Making full use of a very smooth frame rate, GameBreaker 2000 is home to some very nicely implemented animations.  The sight of tackles jukes, spins, men going in motion, the quarterbacks snap count and post play animations are wonderful stuff.  The game is smooth and does not bog down with intense on-field action.  One area of concern is how changing direction using the controller makes the players movements become (instantly) less fluid.  989's football games have always been a bit twitchy on controller input.  In fact, past versions of their games have offered an adjustment for the degree of ~slide~ sensitivity found in directing ball carriers around the field.  While this is no longer an included option, something should be done to make directional changes less (inhumanly) abrupt and staccato.  Nonetheless, with the addition of animations like players stumbling, or extending for the first down, as well as grabbing of facemasks, pounding shoulder pads, and performing cut blocks, the aforementioned ~twitchiness~ can quickly be forgotten by many.  The tackling in this game appears to be very momentum-based, as players of larger size or faster speed will quickly drag a would be tackler an extra few yards at times.  This comes off very realistic and can be an advantage on short or long yardage situations where every inch counts.  Unfortunately, the frequency of such encounters is high, and can seem more of an unfair advantage in the long run (no pun intended). Sound I have been taking exception with the fact that 989 have not changed the crowd sounds since the very first NFL GameDay for several years now.  The track used is a looped five-second reel that has a very annoying whir at the end of the loop that drives many like me crazy!  There has absolutely been no effort to improve the signal callers shouts, the tackle sounds or the crowd interactions.  I find this dismal and apathetic on the part of those responsible for that phase of the development.  Cookie-cutter approaches to game development can hurt a title.  Now maybe that is picky, but the edginess of the sounds coupled with that annoying (measly) five second crowd loop, can lull a person into a sonic nightmare of a trance.  Keith Jackson sounds terrific, though he must be getting a bit senile, because he is often wrong about too many aspects of the game.  He will call the wrong down, yardage, and formations.  He says some phrases excessively, and in the end becomes another annoyance.  That is unfortunate, because he is truly one of the game calling greats of our time. Overall As football simulations go, NCAA GameBreaker 2000 is a pseudo arcade/simulation experience.  The gameplay is fast, furious and fun.  The visual are terrific for system that only has 2MB of RAM, and the AI, while spotty at times, is not stupid by any means.  Some tweaking to address the money plays, more time spent on voices and sounds, in addition to cleaning up the cryptic interface a bit, and GameBreaker 2000 would easily be the pinnacle of college football on the PlayStation.  For many, these issues are trivial and won't matter in the end.  That being the case, the game is at or near the top of its class by many standards, and is representative of how far we have come in terms of football game development in the console arena.    -- Fabian Blache III", "date": "Aug 24, 1999"}