{"name": "Triple Play Baseball", "name_review": "Triple Play Baseball", "ref": "https://www.ign.com/articles/2001/03/17/triple-play-baseball", "text": "Any time I see or play a new baseball title, one thing is inevitable -- I compare it to Earl Weaver Baseball for the Amiga, in my humble opinion the greatest sports game ever made.  Earl had so much going for it. At the time, it was state-of-the-art in graphics, it had the ability to swap around players ad infinitum, and the game just seemed to have a brain, a knowing presence that other baseball titles never did. Players would do well for a while and get on hot streaks, or they could be in the dumps and not hitting a damn thing. Somehow, the Amiga did all this. Don't ask me how, I'll probably never know.  Triple Play Baseball for the PC certain exceeds Earl on the graphic side of things, but in a lot of ways it still doesn't measure up. Graphics and gameplay are excellent, but there's a few things it leaves out that still irk the Earl lover in me.  The graphics are excellent, to be sure, but it's a little disturbing that the PlayStation 2 graphics for the game look better than the PC. Maybe I'm from the old school where the PC always reigned supreme, but it's a little disconcerting to see a console outstrip our beloved PC in graphics. You can tell this in the crowd graphics, in particular. On the PS2, it looks like thousands of individuals, on the PC it looks like a big, muddy mess in the stands.  The graphics are pretty good, although the animations appear slightly jerky, and you notice some polygonal tearing from time to time. Even with the graphics cranked up to 1024 x 768, frame rates remained pretty solid, in the 30s or so. Player faces are excellent, and even offer some occasional game-related faces -- a frown for a lowly grounder, a smile for a nice base hit.  The sound in the game is very good, with baseball sounds pitched perfectly -- the thunk of the ball on the bat, the satisfying thud of ball in leather on a catch, and stadium vendors shouting about hot dogs. The game's announcers are good, too -- with actual related ad-libs during the game. After a particularly hefty strike, the announcer may exclaim, ~Woosh!~ Jim Hutson handles the play-by-play, and Buck Martinez is the color man.  The problems aren't too many, and are mostly overshadowed by the game's good points. One trouble is AI -- sometimes, it's not too smart. For instance, when the ball rolled toward my first baseman, of course, I ran to pick it up, but the pitcher never ran over to cover the bag. Either the pitcher was really stupid or his AI was.  It's also not always easy or intuitive to control the fielders. Throwing in the infield is pretty easy, just point the D-pad to the base you want to throw to and press the 'A' button, no problem there. But when it's a fly ball and you have to take charge of the fielder responsible for snagging the fly, sometimes it's not so easy -- you'll end up moving him in exactly the wrong direction, for some reason.  And another thing, why can't I get a pitcher up in the bullpen? Other games, like Earl, allowed you to get a pitcher warmed up before you slapped him into the lineup. Now, you just pick a pitcher off the bench and throw him right in -- whatever happened to the warm-up?   There are times, too, when the frame-rate takes a serious hit. Especially when the camera pans back on foul balls, the frame rate is seriously choppy. And that's not to mention that the ball looks entirely too big for the players and the stadium. It's about a quarter as big as the players, which would make for a baseball about as large as a beach ball, an interesting proposition.  There are a few little innovations that make the game worth while, and worth playing. For instance, in the pitcher-batter interface -- the heart of any baseball game -- holding onto the gamepad button for slightly longer than normal will give the pitch more power. Of course, use too much power, and that pitch you meant to be a strike might stray outside the strike zone. It's a nice touch by the designers, and one that shows they were really thinking about how to make the heart of the game as good as possible. You can also chose whether the pitch will be a ball or a strike, which is another good offering, since there are times when you definitely don't want to serve up anything that will result in a hit. Say, if the bases are loaded down and Mark McGwire is at the plate.  All in all, Triple Play is a good, if slightly flawed effort, that keeps up the chops of its predecessors. EA got it right htis year and, if you're a PC baseball player, you'll definitely want this one. But I still -- and probably always will -- have a special place in my heart for good old Earl Weaver.  -- Mike Morrissey Want to share your opinions with the world?Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Mar 17, 2001"}