{"name": "All-Star Baseball 2002", "name_review": "All-Star Baseball 2002", "ref": "https://www.ign.com/articles/2001/03/19/all-star-baseball-2002-3", "text": "After a slow start on PlayStation and Saturn, Acclaim's All-Star Baseball series went on to become fairly popular and well-regarded on Nintendo 64. But since the series became an exclusive to Nintendo's system, fans of other consoles were left out in the cold and often wondering if the game was really deserving of all that adoration. This needn't be a concern any longer because Acclaim has delivered the latest game in its heralded series, All-Star Baseball 2002, to Sony's newly released PlayStation 2.   Developed by Acclaim Studios Austin, All-Star Baseball stands as one of the most feature rich baseball games that you'll find on a console. It doesn't offer nearly as much as the typical baseball simulation on the PC, but most players will find that all of the important bases have been covered here.   The game offers a bevy of gameplay modes including Quick Play, Exhibition, All-Star Game, Season, Series, Home Run Derby and Batting Practice. The individual games and seasons are highly customizable, with options like Stadium, Game Time (day, night, twilight), Weather (no precipitation, rain, snow), Sky (clear, fair, overcast, stormy), and game difficulty (rookie, veteran, and all-star) being settable for individual games.   The season is equally as customizable, with the only shortcoming being that it only allows for one human controlled team per season, so people looking to play the same season with friends or family don't really have that option. Otherwise, the schedule can be set to 162 game unbalanced, 81 game half season, three game league round robin, on game league round robin, 87 game round robin, 29 game round robin, 162 game unbalanced non-interleague, 162 game balanced.   And for those of you that would rather not play with the regular major league rosters, the game has a very hearty Player Draft that enables you to build a team based on your picks in a draft involving all of the players included in the game.   Beyond the fantasy draft, the regular roster management abilities are similarly as deep. The line-ups can be setup specifically for playing against a left- or right-handed pitcher and with or without a designated hitter and it's easy to do all the basic stuff like sub player, swap position, and swap order.  The pitchers can be distinguished between starting rotation, middle relief, long relief, and closer.    The game, however, requires that you have five starting pitchers, so it doesn't permit a four-man rotation, which takes away some of the strategy of handling a pitching rotation over the course of a year and trades are limited to equal number of player trades and there's no pulling up players from the minors or sending them back down. On the plus side, it does allow for the warming up of pitchers in the bullpen and allows for complex in-game decisions like double switches.   The create-a-player option is as deep as any you'll find in any console baseball game around. The raw number of pitch styles and batting stances that are available are mind-boggling and all of the important attributes and details about the way the player looks are completely up to the user. The only weakness is that it's not possible to create a player with perfect ratings in each category, unless there's some yet to be released code or secret to it.   The stat tracking in All-Star Baseball is another of its many strong points, as just about every single important stat is kept and tracked throughout the regular season and not lost once the playoffs start. What's most impressive is that the box scores for every single game played during a season, regardless of whether it was played by a human player or not, are saved and laid out exactly as you will find them in your morning newspaper. Player awards are also given for Cy Young, Rookie of the Year, MVP and others, and there's a option called Games of Note that showcases all of the games over the course of the year that had a significant milestone reached, such as no-hitters and games where a player hit for the cycle.    Gameplay  The best thing about All-Star Baseball is that it completely backs up all of the stats and features with rock-solid gameplay that can appeal to both baseball purists and casual fans looking for a fun to play arcade-style baseball game. For instance, on the batting sides of things, when the game's set to the Rookie difficulty level with the Easy Batting turned on (which turns off the cursor), users need only to worry about the timing of the swing to hit the ball and can expect a bevy of long balls.   And on the opposite end of the spectrum, if you jack up the difficulty level to All Star, the games are generally much tighter, and while still a bit homer heavy, the game's have a more realistic feel to them and pitching duels will be a fairly common occurrence when top pitchers in the game face off.   And even though the frequency of homers are high when you use the Power swing over the Contact swing, players will find that the homers are being hit by the good players more often than by the bad ones. And using the Power swing continuously on the All Star setting will not only result in more homers, but also in a higher than average number of strike outs.   The cursor-based batting interface is very deep and in addition to controlling whether or not the player uses a Power or Contact swing, the cursor can be adjusted in Contact mode to have the player try and pull the ball, hit it to the opposite field, try to hit it into the ground, into the air or any variation of each.   Pitching is pretty standard stuff on the exterior, as players simply select the pitch and then the location as customary in a baseball videogame. But what really sets All-Star Baseball apart from every other console game is the depth in the number of pitch types available in the game. Pitchers can have up to six different pitch types in their arsenal and unusual pitches like the circle change-up, two-seam fastball, knuckle curveball and spit ball are all in the game.   What's more, pitcher fatigue is accurate represented and not only will users see a drop in speed with the pitches over the course of the game, they'll also notice curveballs flattening out and a drop off in terms of the accuracy of hitting a target. It's also possible to work hitters to get strike outs, but oddly enough in all of the game's that I've played, I've never once seen a computer player take a called third strike -- even in a game where I was able to strike out 22 batters with Pedro Martinez.    Fielding options are pretty minimal, as players can either go full automatic, which has the computer control everything (including throwing), or manual, where the player controls just about everything (positioning of the fielders can be set to automatic). When controlling the fielders by yourself, the player uses the face buttons to throw to each corresponding base and throws can be pre-loaded by pressing the button of the base that you want the ball thrown to before the player catches the ball.   The biggest grievance with regard to this aspect of the game is that the camera angle generally puts you in a bad position to get a good jump at the ball since it follows the ball first and then pans to where it's hit. This will often result the user running the player in the wrong direction before the camera finally shows where the ball is going. Luckily, it doesn't often result in hits falling in that should be easy outs. Also worth mentioning is the fact that the players have a sort of gravitational field around them, so there are often plays where the ball will look like it's going to get past the fielder, but actually get caught because it's in this magical region around the player model.    While the game's fielding problems can be easily ignored, there are some noteworthy problems with the game's baserunning that might actually ruin the game for some. The computer-controlled baserunners are simply stupid and the end result is a lot of very unrealistic baseball situations and outcomes. The majority of well hit balls that make it to the wall in left/center or right/center field end up being singles by the computer because they'll run through first base before going for second. And even when they do go for second, they'll have generally made the decision too late and will subsequently get thrown out because of it. Likewise, you can dive for a low hit liner in front of you and have the ball get past you and roll all the way to the wall and the computer will still stay at first base.   Yet, even with the horrible baserunning, All-Star Baseball can be considered a very realistic baseball game. The raw number of types of hits off the bat are pretty amazing, with just about everything that you would see in a real baseball game happening here, including foul pop-ups, grounders that pop-up after hitting the mound, and hard hit ground balls that make it past the first or third-basemen down the lines.   Graphics  The player models are realistically proportioned and the stadiums are very detailed and accurately modeled, with new details like the ~Bite~ in Cinergy field and other stadium-specific background objects. And while All-Star Baseball is clearly the inferior product when it comes to texture details on the players and stadiums, as well as in terms of the smoothness of the pitching and batting animations, when compared to Triple Play Baseball, it makes up for its shortcomings with a lot of variety in its fielding animations and details.   There are just so many little things that you'll see happen in the game. Players will dive for a grounder and either get up to make a long throw to first base or just do it from their knees. Most of the transitions are pretty smooth, too, when it's being controlled completely by the computer. Outfielders will seamlessly go from an over the shoulder catch to a throw to the cutoff man and players will see a lot of variety in throws, which will see the first baseman swipe at low thrown balls that bounce, reach out for well-thrown balls or jump-up for a high-thrown ball.    Conversely, there are some cases where the transition animation between throws is pretty awful. If you don't take advantage of the pre-loading of throws, the player will reset to a base animation before going to throw the ball after catching it and even when you do pre-load throws, there's a little hiccup in the middle of the motion that makes it look like the player is having problems getting the ball out of his glove. It's never a major nuisance, but something that definitely could use some improvements.   Observant players will find that All-Star Baseball is filled with a lot of little details in the way of animation that might get overlooked by some. Outfielders will slap their gloves on their thigh when waiting for a fly ball and fully animated base coaches will drop to their knees and pound the ground to let the baserunner know that he should slide, and the umpires will realistically signal home runs, foul balls, strikes and other calls. The crowds are also fully animated, even though still 2D, and pitchers that are warming up in the bullpen can be seen doing it during gameplay. All-Star Baseball might not seem as visually as impressive as Triple Play Baseball on the surface, but it definitely holds its own thanks to all of these little things.    Sound  Thom Brennaman handles the game's play-by-play, while the manager of the Arizona Diamondbacks, Bob Brenly, does the commentary with the PA duties taken care of by the Texas Rangers' Chuck Morgan. The general play-by-play is generally dry and unexciting, with even the emotion announcements seeming a bit on the robotic side, but it's generally in tune with what's happening in the game and sometimes pretty in depth. What's really cool is that a very good job has been done in realistically mixing in the PA work with the commentary so that the commentators will often still speak to each other while an announcement is being made in the background.   People looking for outrageous arcade-sounds to spice up their baseball game, will be sorely disappointed with what All-Star Baseball has to offer in terms of sound effects. But, purists that want more realistic sounds will be in baseball heaven. The crack of the bat is pretty sharp and there are a lot of cool crown noises and background stuff that'll pop-up over the course of a game.Since I haven't quite put enough time in with the final version of 3DO's High Heat Major League Baseball 2002 and haven't even seen Sony's MLB 2002 in action at all, it might be a bit premature to label All-Star Baseball 2002 the best game on the system quite yet. On the other hand, I have no problem saying that it's a better overall game of baseball than EA Sports' offering, Triple Play Baseball, and offers visuals that are far superior to 3DO's soon-to-be released product. All-Star Baseball 2002 isn't a perfect game and it does have some major flaws, such as the horrific baserunning by the computer AI, but it's a very solid game of baseball that can be attuned to fit the gameplay needs of the finicky baseball purist or the casual fan. It might be a bit homer happy on the whole, but it's still possible to get low scoring pitching battles against the computer on the All Star setting, even after playing a lot of games. For instance, deep into a season playing as the Boston Red Sox and after a five game winning streak where I was able to crank 21 round trippers, I lost a 1-0 pitching duel with Greg Maddux of the Atlanta Braves. Maddux limited me to three hits, all of which were singles, and Atlanta scored its only run in the sixth inning after Maddux bunted Brogna to 2nd who then scored on a single by Veras after a strikeout of Furcal. It was a disappointing loss, but one of the most rewarding games of videogame baseball that I've played in a while. It's because of occurrences like this and the fact that the game offers such a tremendous amount of customizable options and a large feature set that I strongly believe that All-Star is the best in the genre currently available on PlayStation 2 and is the game that all future releases must live up to.", "date": "Mar 19, 2001"}