{"name": "Re-Volt", "name_review": "Re-Volt", "ref": "https://www.ign.com/articles/1999/08/26/re-volt-3", "text": "Why has the Toy-Volt Co., been so darn successful at producing top-selling  toys for kids? What is the key to their success? How do they do it so  easily? Their meteoric rise to power in the kingdom of toy manufacturing  was epic, mystical and downright magical! Whatever it may be, whatever it  had been, the recipe is skewed now for some reason. All of a sudden, the  latest production units have been coming off the assembly lines with  ~literally~ minds of their own.  As with anything that has freedom of thought, in this case, the latest batch  of Radio Controlled (RC) cars, they have fled the scene of shelf life, and  headed into society to wreak havoc and have some mischievous fun. (I know  this sounds a bit kooky, but I didn't create this story...okay?)  Gameplay So you enter the game as one of these perturbed little toys with brains...what  are you going to do next? Well, how about churning up some terrain and  competing against others like you-for the hell of it? I mean...what do you  have to lose? Well the answer is everything; the race, your trophy and most  certainly your dignity. Right?  Let me say this up front...~Re-Volt is a quite a hoot from the word 'GO!'~  This game is a straight forward arcade racing game replete with milestones to  achieve power-ups to grab and no damage to be concerned about (except for  those temporarily bestowed upon you by opponents via power-ups).  You go about your task racing through a variety of challenging arenas.  These include a botanical garden, a supermarket, an average everyday  neighborhood, a museum, a ghost town and even a toy store. Collect all the goodies, earn all 28 cars, win all the races and tournaments  and you could unlock every hidden vehicle and even the Reversed or Mirrored  tracks. The game keeps track of your progress by recording Best Times,  Stunt Arena cars collected, and the Cups you win in the Championship Mode.  There are 14 single-player tracks, four multi-player arenas and seven  different racing environments to from which to choose. Playing through all  of these options requires a friendly control scheme.  To get the most out of the experience, Re-Volt offers a variety of control  schemes from Junior RC, for beginners to Simulation, where you will  experience the full speed and realistic collisions and suspension effects.  Be mindful that some cars are gas powered and others are electric.  Additionally, some are front-wheel, rear-wheel and four-wheel drive.  Four-wheel vehicles serve to be better at gripping, while rear-wheel  vehicles can perform some very swerving turns and spinouts. The cars are  rated in the categories of Speed, Acceleration and Weight. Weight factors  into the grip or slip ratio, but is not quantified as such in the game's  instructions as a separate rating as in games like Need for Speed, Ridge  Racer and Gran Turismo.  Practice, Stunt and Multi-Player modes set up a nice learning curve for the  ultimate in RC racing dominance. The Stunt Arena is particularly cute, in  that when you enter you may not have a car available to you that is suitable  to capturing all of the twenty, count 'em (20) starts you must grab.  Nonetheless, the Stunt Arena tracks your progress, and once the player has  unlocked the cars needed to traverse the tricky spots where some stars hide  out, they will see that stars previously obtained are still accounted for.  In regular Multi-Player, two racers can compete in a split-screen scenario.  In Battle tag, you have a two-minute timer, and play against another player  to find the hidden star. Once the star is in your possession, you are ~IT~  and have to avoid passing off the star so that your clock can count down to  zero. If another car tags you, they become ~IT~ and their clock begins  counting down and son. The first player whose clock reaches zero wins. There are tons of things to pick up and use to your advantage such as the  Shockwave, Fireworks, Bomb, Oil Slick, Ball Bearing and Turbo Battery to  name a few. You can use these times against rival cars to slow them down,  spin them out and plain blow 'em up! The effects are temporary though, and  they have good memories when the find the person who cooked their goose. If  that is not enough for your liking, there is a Track Editor with which to  create custom racing environments.   All this unfolds via the use of three available cameras; a nose or (in-car)  cam, and two chase cams of slightly varying angles. The chase cameras are  the only playable ones. This is due in part to some glaring graphic  issues I will cover in a minute. There is also an instant replay feature  that works well for the most part.  Now, I must mention that the physics model of the cars, in terms of how they  act, react and respond to terrain, velocity and user input is rather  impressive. The feel of these little vehicles has been very nicely  captured. Some of the cars are so light that the slightest nudge of the  analog stick can whip them into a severe U-turn; while others are heavier,  slower and less responsive.  Regardless, of what type of car you prefer, there is almost something  configured for everyone's taste. Short of the great physics and decent  premise, everything else goes downhill from there.  The load times are in the ~go microwave some popcorn and return~ range; with  average loads as long as half a minute. For instance, it takes over one full  minute to boot this game from the moment the first Re-Volt logo appears on  your screen. What makes this even worse is that these insane load times  happen with every transition from mode to mode or race to race. It's plain  nutty.  Graphics Continue the debacle come the less than stellar graphics of this game.  Re-Volt could be a tech-demo of how ~not~ to create a graphics engine.  You've got a dull color palette (in most areas), very grainy unpolished  textures, tons of texture warping, polygonal breakup galore, an over-use of  fog, and all the pop-up and draw-in that one person can stomach, or in this  case ~not~ stomach. Couple these issues with the limitations of the cameras  I mentioned, and you have a recipe with an appetite for destruction.  If you happen to slam into a wall playing via the in-car camera (something  that can happen a lot in a game of this type), you could quickly become  disoriented when you realize that the wall is gone and you are looking out  over a mesa. However, if you just back up a hair or so, you will find that  you are truly in front of that wall you thought you just kissed. And from  here things get worse visually. Suffice it to say that while NVIDIA may  have found something redeeming in the PC version of this title, (they  featured it as the High IQ title for the summer of 1999) the PlayStation  rendition leaves too much to be desired. These graphics look like first-generation PlayStation material. With the time it takes to load this game, one would think the program was assembling the best  looking thing ever seen on the system. But I am here to tell ya' folks...that  ain't the case!  Sound The sounds are quite average and uninspiring by any means. There is some  great techno stuff littered within the sound files, but the quality of their  renditions not all too terrific. Add to that some very lackluster sound  effects and the game just fizzles more at this level. After the initial fascination with the physics model, the desire to see the various tracks, checking into the level of challenge in the modes, and stunt levels, the gameplay in Re-Volt quickly becomes acerbic and uninspiring. This is not to say that there is not some redeeming value to be found in the effort, but one must look hard and deep to find it-if at all. After a few hours of drilling through the core of Re-Volt, you will likely find yourself getting bored and feeling like there is no reason to go onward. This is sad, since Re-Volt does sport such a neat physics model. Hence, with some major graphical adjustments, and possibly a direction change in the premise of the game, Re-Volt could find a niche market willing to fork over the dollars for the experience of it all. Until then, perhaps the PC version has captured the true spirit of the game...", "date": "Aug 26, 1999"}