{"name": "Quake III: Revolution", "name_review": "Quake III: Revolution", "ref": "https://www.ign.com/articles/2001/03/28/quake-iii-revolution", "text": "Having run the PlayStation site for so long now, it's truly strange to see so many first-person shooters these days. It seems like only yesterday when the PlayStation's 2 MBs of RAM scared away everyone except for, oddly enough, the Dreamworks guys from attempting to create a worthy first-person shooter. Now with PlayStation 2, the system is bound to be rich with great PC and console teams alike who are ready to innovate, create, or just plain port first-person shooters to Sony's 128-bit beast. Unreal Tournament and TimeSplitters are already on the system, and Red Faction, No One Lives Forever, The World Is Not Enough, and a handful of others are in the works.   Released back in 1999 as the third in the series on the PC, Quake III: Arena didn't deliver the innovation that the series resonated with in the past, especially when teams such as Valve and Epic appeared on the scene, but it brought a new level of sheer gut-wrenching mayhem and blisteringly fast action to the genre like never before. In many gamers' eyes, it was polished to perfection. Now it's March 2001, five months after the PlayStation's launch, and EA's Quake III Revolution, the third first-person shooter on the PS2 is upon us. Is it great? Is it stupendous? Does it use a mouse? Is it better than TimeSplitters? Read on...  Gameplay Let's get this straight and out of the way real quick. Quake III: Revolution is a strange misnomer. Despite the fancy title, this game doesn't deliver any kind of revolution by any stretch of the imagination, but rather, if you're a PC gamer, a devolution. It doesn't support mouse and keyboard control, it isn't an online game, and it's not really like the PC game in any shape or form...At least that's what the guys who have ground their teeth on Quake III on the PC will tell you.   They'll probably tell you it sucks, too, but they're wrong, dead wrong. It's not like I'm winning money in contests over here playing Quake III on the PC, but I can keep up my end well enough. So, when Quake III Revolution arrived in our office a while back and we settled into a four-player deathmatch, it was not only surprisingly to see how good looking the game was, it was startling to see how well it played. Bullfrog, never having worked on a first-person shooter, ported Quake III and it numerous add-ons levels, beautifully to the PS2.   While comparisons need to be made to the PC for clarity, Quake III Revolution stands up quite well on the PS2. In fact, it's easily the best first-person shooter on the PS2. Having revisited both TimeSplitters and Unreal Tournament, Quake III Revolution stands up as an excellent single-player game, and is a remarkably fun deathmatch game on console. Sure, the developers had more time to work on it, and it's more or less a port, but everything about Quake III Revolution is surprising good in every aspect. From the crisp, clean graphics, to the rock-solid framerate, to the surprising control, to the engaging single-player game, to the numerous levels plucked from the PC game and its various add-ons, Quake III Revolution is a totally worthy FPS in every regard.   The central issues for a game such as this are speed, control, and feel. Quake III Revolution has them all. In Quake III the framerate is very fast, and we'd reckon to say that it's a near constant 60 frames per second, with the occasional slowdown in burly, crowded situations (even the PC version occasionally slows down, so it's hard to complain too much about that issue on the PS2 version). To compare them straight up, head-to-head, the PS2 version isn't as fast as the PC version, but just by a hair, and it definitely holds its own. The framerate is everything in a game like this, in which players make split-second decisions that determine life or death. Whether its in Campaign mode, or Arena, the framerate is there.   Along with the fast framerates come quick movement, speedy strafing, and rapid 180 spins, which can't be said with a straight face for TimeSplitters and Unreal Tournament. Players can run along at a quick clip from room to room, blasting everything in sight, jump on launch pads, and fly through the air, blasting and pummeling, and instantly kill or be killed in a matter of milliseconds. Spinning and turning on a dime is nearly perfect, and is certainly the best in any FPS I've seen on any console.   The last major issue is feeling. If you're a console gamer, then the practice you had playing Medal of Honor on PS, Unreal Tournament or TimeSplitters on PS2 will ease you quickly into playing Quake III Revolution. The game provides several different controller setups, but the one that works the best in my opinion is ~Advanced~ because it feels the most natural. The left analog handles running and walking, while the right analog controls looking right, up, down, and left. R1 is the fire function, L1 is jump, L2 is squat, and R2 is secondary fire. Square and Circle handle toggling between weapons.   This setup took me about five minutes to get used to and about an hour or so to know intuitively in the heat of a raging deathmatch. There is a significant difference between the two. The latter is the most important one because that's what Quake III Revolution is really all about -- heated deathmatches. In my opinion, the controls work great; they may not be the brilliant keyboard-and-mouse setup that PC gamers are used to, but they work well, in fact they work better than I ever expected.    As for PC gamers, I can't say much to try and convince them that Quake III Revolution on the PS2 is better in any way, especially in the control department. Like I said before, the control is very good, but it's not perfect. If you're a PC gamer, you'll feel like Quake III is a devolution, not a Revolution. This brings up another important point about the control. Quake III is certainly about precision, and the mouse-and-keyboard definitely provide incredibly precise precision. The analog controls by their very nature aren't as precise. They function well, but the smooth tracking motion on the slightly springy analogs just doesn't substitute perfectly for dead-on accuracy. I don't think by any means this ruins the game, but it is changed. For instance, the Railgun, one of the most powerful weapons in the game, is not quite as powerful as it is on the PC. Likewise, the balance of weaponry power is shifted more toward short-range combat. On the PC, Quake III has always worked brilliantly in short and medium range combat, but the long-range department was the extra thrill. On PS2, players can dig into the long-range game well enough, with weapons such as the Railgun, and the zoom function (R2) works fabulously, but it's simply not the same. It's far more difficult to track an opponent accurately, and it's just as difficult to lead them.   Another control element hampers Quake III Revolution, too, and that's the vertical game. Again, after playing the PC version, players will instantly notice the difficulty in tracking, leading, and anticipating players as they bounce on launching pads, job down stairwells, or swim underwater. Again, it functions well, but not brilliantly, like it does on the PC. Thus, with springy and less accurate controls, the long-range game and the vertical game don't hold up as well in a straight-up comparison. And because of this, the game devolves into Quake II, which works best as a short and middle range game. That said, compared to the FPS games currently on the PlayStation 2 (TimeSplitters and Unreal Tournament), Quake III easily is the best of the bunch, in both the single-player modes, and certainly in the deathmatches. You won't find any better deathmatches than these on PS2.   Bullfrog cleverly designed Quake III Revolution, however, to function better than its PC counterpart on another level, and the single-player experience is therefore much deeper, more varied, and more engaging because of it. Players can engage in either Campaign, the single-player mode, or Arena, the multiplayer mode. Campaign is set up in tiers, or levels, each of which is slightly different from the others in objective and course. It's well designed for newbies, and even for haughty PC gamers, who'll need to become accustomed to the Dual Shock controls. The levels are designed with easy bots in the beginning that gradually grow more wily and sophisticated as you progress.   The missions are still squarely the stuff of Quake, ranging from Capture the Flag, Deathmatch, Possession, and variations of the Deatmatch, with altered time, frag, and death counts. But they're mixed up, and in each new tier, another new level in introduced. The full laundry list includes: Deatmatch, Team Deathmatch, Single Weapon Deathmatch, Single Weapon Team Deathmatch, 1 Flag Capture The Flag, Capture The Flag, Team Possession, and Possession. The weapon list comprises the Plasma Gun, Shotgun, Rocket Launcher, Chain Gun, Rail Gun, Machine Gun, and the default Manacle.   The levels comprise all of those found in Quake III, plus the Team Arena levels, that shipped separately. They include Arena Gate, House of Pain, Power Station 0218, Arena Death, Place of Many Others, The Forgotten, Camping Grounds, Temple of Retribution, Brimstone Abbey, Hero's Keep, The Nameless Place, Lost World, The Longest Yard, The Proving Grounds, Hell's Gate, Fatal Instinct, The House of Decay, Temple of Pain, and Asylum. On the whole the levels are still brilliantly designed and create tight, evenly balanced arenas in which to frag. With wide-open chambers for close melee, snaking tunnels and hallways, dozens of launch pads, watery and lava chasms or chasing, and the outer space floating stations for longer-range combat, the levels just can't be beat. There is one exception, though, and that's the quantity of people, or rather, the lack thereof. In Quake there is almost always more than four people playing, which condenses the action, and creates a deeper, burlier sense of mayhem. With only four characters on screen at any one time, the hallways often appear empty. You end up spending a lot more time running around by yourself, not a riotin' and a lootin'.     Graphics With the exception of a slight softening of the shapes and forms on the PS2, Quake III Revolution has made the carriage from the PC almost perfectly. The levels are incredibly clean looking, with not a seam or glitch in sight, and the moody lighting, the deep reds, blues and the all-too common browns are all there in excellent form. In fact, this is truly a great looking game. The texture work is not totally original, but everything looks so incredibly polished and smooth. There is also no accidental pop-in, fogging, or aliasing of any kind. And flicker? Not seen here.  The characters are fantastically detailed and animated, too. As for the special effects, they are all there in solid form. The plasma cannon blasts off its blue oblong eggs well enough, and the other weapons, from the shotgun's spray to the Railgun's smoky trail are in good form, too. The PC shows off crisper particles and bigger Rocket Launcher explosions, and so while you see overall spectacle of the clashes is slightly lessened, but it's a subtle difference.   Overall, Quake III Revolution is a superior port than the Dreamcast version, and holds it own compared to many PlayStation 2 games. It's a sight to see, really.   Sound One of the great aspects to the Quake series has always been its great sense, and style, in the sound department. Descending from the great eerie sounds of Doom, the sounds of Quake are excellent. There is simply nothing like hearing the clink of shells bounce off your feet as you pummel the opponent, and the sensation is captured beautifully here with all of the weapons.   As for the music, or background mood music, Quake III Revolution doesn't steer into any new ground. It's quite similar to the music that's been heard from the PC version, and it does its job well, which is to create tension and hype up your adrenaline from fear and anticipation.Although I'm admittedly not a PC gamer at heart, it doesn't take a rocket scientist to see how well Quake III Revolution has arrived on PlayStation 2. After having played both Unreal Tournament and TimeSplitters again on PS2, I can easily say that the most satisfying first-person shooter on PS2 is Quake III Revolution.  The single-player Campaign is varied and challenging, creating an actual game that people will want to play, and the four-person multiplayer games are top-notch stuff. We were all quite surprised to see how fast the characters moved, how fast the framerate was, and how good the game looks on PS2. It seems that Bullfrog knows something that other developers don't, because they ported a PC game to the PS2 and made it look outstanding, and we never heard a word of complaint from the humble folk at Bullfrog. (Granted, we didn't hear anything at all from them, but hey...).Quake III Revolution doesn't deliver the same b-grade sense of humor and long list of options that TimeSplitters does, and it certainly doesn't have the killer level-building option, but what it does do  which is to bring gamers an incredibly fun four-player PC game to the PS2  it does remarkably well. Frankly, it seems like it's been too long for this to happen, but Quake III definitely fits the bill for endless hours of four-player deathmatches. Or capture the flag, or possession, or team play. It's all there. So, if you already own a PC and own Quake III, while you might be surprised at how well the port has been handed, you probably won't want this. But if you're itching to have three friends over to play until the early morning hours, Quake III is the best multiplayer game on the PS2. I highly recommend it.", "date": "Mar 28, 2001"}