{"name": "Adventure Pinball: Forgotten Island", "name_review": "Adventure Pinball: Forgotten Island", "ref": "https://www.ign.com/articles/2001/03/29/adventure-pinball-forgotten-island", "text": "Simulation geekiness isn't just for racing cars and cessnas. It's totally appropriate to take the same level of sickness and attach it to something else that exists in the real world, such as say, pinball. I'm one of those people. I've been loving and living pinball since I was a kid, and while I'm not up to the level of the tilt junkies that use to flip the scores on their tables at the local Golfland by actually physically lifting up the entire unit when the ball was headed for center, I've certainly worn through precious layers of skin tapping buttons over the summer, and now into the early morning at local pubs.   When you're a geek, things like the momentum of the ball, the layout of the board, how the flipper range works, and the challenge level mean a lot to you. That's why games like Big Race USA can be so much fun, because they really capture the style, feel, and charm of your favorite real life pinball games, while managing to fit it all on a computer screen. Low system requirements don't hurt either, thanks to the fact that almost every major pinball game released in the last five years has featured pre-rendered backgrounds with animations.  Adventure Pinball, the new 3D pinball game from EA and Digital Extremes, tends to take the formula one step forward and two steps back with an attempt to bring pinball into polygons, losing something in the transition. While having polygonal boards means that you can mess around with camera angles, moving characters, and wild level effects, unfortunately it also seems to mean a game that looks and plays worse than the finely hones pinball sims of recent years.  You've got a lot of ground to cover if you're going to explore Forgotten Island. There are nine tables to explore (plus a bonus), from monkey-ridden jungle landscapes to icy terrain, to beachfront property, all making use of the Unreal engine's properties to really get your ball into some foreign environments. A pterodactyl might pick up your ball and carry it up to a higher board in a mountain climbing table, or a set of angry Yeti may smack your ball higher up a long, narrow board in order to help you get to a new part of an icy environment. One table has you jumping from board to board on a set of floating peaks, while another one has you attacking sharks to save a stranded villager. Digital Extremes puts a lot of effort into getting your ball into some unorthodox places, but it's still about smacking bumpers (in this case, everything from snowmen to dinosaur teeth to plants) and hitting the right ramps in order to unlock new sections of the table, and ultimately give you access to another ~section~ of the island.  Even the ball's got a few tricks under its sleeve. Hitting fire or water will turn your ball into a lava or a water ball, and you'll get extra bonuses for either drying off or dousing the ball by landing it in the opposite area. There's even a cool little section of the ice table where you've got to drop your ball into a tar pit, then hit it through a lit fire in order to burn up an ice barrier. You'll even notice graphic changes to the ball when you hit a 2x or higher bonus. They're nice touches, and it just adds to the non-static feel of the game. Having a pinball game run on the Unreal engine also means that you get moving characters that you'll have to hit or avoid to make it to special ramps, or just for point bonuses. Frogs lash out with tongues that can steer your ball off course, dinosaurs transport your ball to new areas of the playing field and monkeys... fall on their butt and look funny. Doesn't this sound good? Doesn't this sound like exactly what you, the pinball consumer, have been looking for?  Not exactly. The funny thing about 3D boards is that while the animation is much better, the graphics are actually a lot worse than a pre-rendered board. Angles are chunky, and even the ball lacks the shine and reflection that you've come to expect from your pinball experience. There isn't a lot of detail to the environments, and lighting is nonexistent. While this is still meant to be a budget title, for all ranges of consumers, it seems that overall the game values mass over merit, something that becomes apparent as you start testing out the boards themselves. Once you've gotten your head around the very goal-based structure of the boards, where you'll have to hit X ramps to unlock Y door, and so on, you'll begin to notice the cracks in the game's 3D shell. First off, the engine chunks down, even on powerful systems. You'll get jitters and slight stops to the animation when a ball's running through a fast action, or hitting a complicated loop or action. Then there's just the table layout itself, which tends to be full of impossible angles and hit points. You'll find yourself consistently stuck on certain tables, finishing nine out of 10 actions only to be at a standstill because the last ramp or bumper to trigger on a table is almost impossible to hit unless you do it completely by accident -- ricocheting off of another object, or by pure luck. It's more than frustrating -- it's downright criminal when you know that you've been playing fantastic, but keep getting stuck at the same sticky points on the same sticky tables again and again.  The problem with pinball is the same thing that makes it great -- because all the action takes place on a simple board, you've got to do a lot of fine-tuning in order to make the experience shine. While Adventure Pinball has certainly got the weight of the ball down from the preview build I played, the tables themselves leave a lot to be desired. Repetition tends to kill a lot of the fun, and the focus on using the cool 3D aspects of the board ends up taking away from the fast action and skill-shot fun of your normal pinball game. What Adventure Pinball turns into, inevitably, is a set of ~find the right ramp~ games that don't have the charm or density of the more classic 2D isometric pinball experiences.  In terms of the overall graphic experience, you'll be happy with the end product, but missing the sort of realism that makes 2D pinball so fantastic. While the animated characters are certainly a cool addition, the wide ramps, chunkier looking tables, and flat textures make the overall experience less than enthralling. Most annoying is the fact that some levels now have the camera following the ball as it runs through the table, making for a truly nauseating experience as you try to focus while the screen swings left and right with the ball as it screams across the board.   Lava ball! You'll be spending most of your time listening to your annoying host's screams as he talks you through the level, letting you know about status changes as well as giving you general pats on the back for your progress. He's not horrible, but there are times when you'd wish he'd stop drinking that coffee. The music is low-key, so low-key in fact that you'll barely notice it in the background. Sound effects are kept to the foreground, which is sad since the music tends to work well, while the sound effects all too often sound like they came from a standard stock library.  Adventure Pinball will keep you entertained as you try to unlock all the tables and make your way through the entire island, but will it keep you interested when it's just about score? The tables just aren't tight enough to warrant infinite replay, and they're so structured around hitting certain ramps to unlock new sections that you may get annoyed that you have to repeat intricate tasks just to catch a cool part of a table again. Still, repetition's the name of the game when it comes to pinball, so it's hard to knock the game for something that's almost innate to the game itself. It's a good try, EA and Digital Extremes, but it would have been nice to have seen tighter but fewer tables, instead of a nice number of tables that will tend to become as interesting as a python after it's had its monthly meal.  -- Vincent Lopez Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Mar 29, 2001"}