{"name": "Quest for Camelot", "name_review": "Quest for Camelot", "ref": "https://www.ign.com/articles/1999/08/26/quest-for-camelot", "text": "Interactive entertainment has taken us on a rollercoaster ride ever since it first made its debut years ago.  From the simplest game to the most advanced, there's no doubt that the over-the-head adventure mode first  showcased in the Legend of Zelda is one of our favorites.  Quest for Camelot, a title eager to cash in off of that particular type of game, highlights sword-swinging action mixed with a plot based clearly off of  last year's box office presentation.  But the question is: ~Is it fun?~  Features: Based on the WB movie  9 worlds and 60 areas Game Boy Printer support Battery back-up For Game Boy and Game Boy Color   Sure, it's got a label that says the game's idea was ripped off from a Warner Brothers movie, but that's about it.  Is licensing supposed to make a game better?  Apparently Titus thinks so, because they can't seem to pull off a game of their own without slapping on some sort of title that they think the world is familiar with.  In this case, they're just wrapping a piece of crap up in a filthy package, and hope that it will fair well with young Game Boy lovers everywhere simply because it bears the same name as a full-length cartoon.  For starters, the game play leaves much to be desired. As the female would-be heroine, Kayley, whose destiny is to rescue Camelot from the wicked grasp of Sir Ruber, you get to swing your sword at the same foes time and time again, walk around to finish pointless tasks such as searching for a shield that barely helps, and then go toe-to-toe in boss battles that try and incorporate some sort of sense of hardcore action.  Perhaps Titus was trying to capture the spirit of old NES gameplay in Quest for Camelot, but they didn't exactly hit it on the nail with today's standards.    The game itself is rather boring and will have you walking around to find objects or people who will help you get from Point A to Point B, just so you can repeat a similar cycle all over again.  Whether you're searching for the swordsmith's lost hens or a man's missing dog, there is a serious lack of both variety and fun, which don't make the game's appeal last very long. And since there is but one way to play, Titus didn't offer its customers very much to keep them returning for days to come.  The only area that leaves less room to complain than the rest, which use the Game Boy Color's abilities fairly, is its graphics.  Because the images are large and easy to see, you'll at least be able to define who the main character is in contrast to the enemies.  All the baddies look just like they should, and everything stands out well all over, without an exception.  In certain key parts, you'll be ~treated~ to a slideshow of still frames which detail parts of the story before it cuts to the next picture.  Like most of the other parts of the game, Quest for Camelot's audio department could stand to undergo some serious tweaking. The music plays over and over again as if it were a broken record. And since the tunes are very short, they feel tremendously repetitive, not to mention they go over the top when it comes to sounding annoying. No matter where Kayley ventures off to, whether in the forest or a dungeon, the music will take its toll on its listeners' ears, offering nothing to heighten the gameplay itself. With so many elements that could have been monumentally improved upon, Quest for Camelot feels decapitated from the very start.  Titus seems to make their fair share of mistakes, and their licensed games rarely seem to prove otherwise.  Unless you are interested in staring at a Game Boy screen without any intentions of having fun, it is highly advisable that Quest for Camelot be avoided and another game be purchased.", "date": "Aug 26, 1999"}