{"name": "The Sims: House Party", "name_review": "The Sims: House Party", "ref": "https://www.ign.com/articles/2001/03/31/the-sims-house-party", "text": "Hot on the heels of Livin' Large is the newly released House Party, another expansion pack with the explicit goal of getting your Sims to loosen up a bit, use the toilet a little more freely, and get together like never before. While Livin' Large was more a new set of wallpaper, skins, and characters, with a few minor game changes, House Party rewrites all the rules, giving you and your Sims a brand new way to... oh, wait. That's Sims Online. Actually House Party is a fun way to put your Sims into a larger party, but other than that, you can count this more as a ~Livin' Large 2.5~ than anything else. While you've got the option to call house parties using your phone, there's very little in the way of gameplay changes. That's not to say that the additions aren't fun -- new group-geared toys and gadgets make socializing easier than ever (actually, it was always a lot of work), but overall House Party just doesn't provide enough to satisfy as a full add-on to the series.  That's not to say that there isn't a lot to play around with in House Party. On top of the option to call a house party over to your pad using a simple phone call (think of it as a mega-conference call with all your friends), you'll be able to buy all sorts of new gadgets, such as a teleporter that takes the place of a staircase, or giant wall fans for that industrial loft you've always wanted to build. Three new styles are available for you to play with: Tiki, Country, and Rave. Each of them have their own new skins, wallpaper, home furnishing and gadgets of their own, but being the happy little domestic that you are, you'll be able to mix and match to your heart's delight. So if you want to put that dancing hula girl lamp on your stainless steel countertop, feel free.  Of course, now that you've got all your Sims in one place, you're going to have to keep them entertained, and House Party provides you with more than a few ways to give mass enjoyment to your polygonal masses. A campfire allows your sims to enjoy some quality time by the fire, working in a similar manner to a hot tub, only with a ghost appearing every once in a while to give you a little extra entertainment. You can purchase a cake from the object menu, and then hire either a male or female performer to perform a sexy cabaret for the entertainment of your guests. Afterwards, she'll comment on your dcor and dance in front of your DJ booth, or chat with guests. Not a bad deal for the price, really. But wait! That's not all! You can hire a caterer to help you with your big parties, but only if you purchase the buffet table. Why not buy a punch bowl, while you're at it. Your guests will feel giddy and happy after a few sips, but don't let them have too much or they'll get a little rowdy... unless that's what you want. A giant hookah, er, bubble machine allows your Sims to ingest large quantities of a certainly legal substance that makes them dumb and giggly. A new parlor game can give your Sims skill points while allowing them to entertain groups of visitors with tricks and charisma. You can buy lit dance floors, or a dance cage for your rave space so your social Sims can become the life of the party. For you country boys and girls, you can ride the mechanical bull and build your body skills, while entertaining the nearby guests with your antics. You can even open up the costume chest and have your Sims throw on some wild costumes for a safe but slightly kinky roleplay.  Like Livin' Large, there are also a few negative guests thrown into the mix for when the party's a bust, such as the mime, who does French mime type things until your guests wants to play piggy in the blanket with your large knit rug and the deep end of the pool. There's also the bathroom problem, which is multiplied exponentially because you can fit such a large group of guests into your space... all of which are eating and drinking, and inevitably peeing and pooing everywhere. Install a few outdoor bathroom stalls. You'll thank yourself for it later.  Unfortunately, for all the charm and great art design involved with the new objects, we've seen a lot of this before. New group items are a godsend for those of you that hate trying to put together parties and entertain guests, and a caterer certainly doesn't hurt, but does this make for a complete add-on pack? In a world where we've been seeing add-ons that rival full featured games on their own, such as the Age of Empires 2 add-on, Sims House Party just seems like too much filler, especially when the last add-on had fans hoping for some new gameplay tweaks instead of just new objects. It's not that the new objects, skins, and wallpaper aren't fun, it's that they just don't take the game anywhere new. It's another set of clothes for GI Joe when you'd rather have another playset.  Take the whole House Party aesthetic, for instance. Wouldn't it have been nice to have actually been able to create a separate dance club, or night club space for your Sims? Instead, you've got to find ways to create a dance and party space while still trying to fit in your dining room, kitchen, and everything else to please your residents. And unfortunately, what's good for a group is rarely satisfactory for your Sims that have to live on the property. The idea of getting your Sims together to party is a great one, but the concepts are never fully utilized. What could have been a completely independent add-on that put your Sims in a different social context has instead become another set of new art pieces and objects, with minor alterations to the game itself.  The art is pretty charming though. The new objects are a blast to watch, particularly the bull and the dance cage, and even the blowfish lamps are cool to watch light up. The wallpaper and new furniture for the themes is also done incredibly well, from the haystack chairs in the country theme to the groovy inflatable furniture for your ravers. The new techno tracks for the DJ table are fun to listen to, and provide a marked contrast from the soothing Yanni-esque sounds of the rest of the game, which are great, but leave you wanting a little klinging and klanging every once in a while.  Overall this game takes yet another step back for providing trinkets when Sims fans are hoping for some new additions to the world itself. For hardcore fans of the series that want another reason to get Batman giddy at a party and making out with Robin, next to the White House staff and front of the Brady Bunch, this is a great pick-up. But for those of you looking for a way to re-ignite your dimming interest in the game, this won't work, especially if you've already purchased Livin' Large.  -- Vincent Lopez Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Mar 31, 2001"}