{"name": "UNiSON", "name_review": "Unison", "ref": "https://www.ign.com/articles/2001/04/03/unison", "text": "When I first heard that Tecmo was bringing Unison out to the United  States, I thought, ~What the hell are they thinking?~ As dancing  games go, it's got a great system, catchy tunes, great graphics, and  the infamous Tecmo ~bounce~ (Dead or Alive fans, you know what I'm  talking about). But it's also incredibly Japanese-specific. The songs  and costumes were classic J-pop mixtures of sexy/innocent, you had a  bad guy who sat on a duck porta-potty, an effeminate white guy with  an afro, and probably 30 minutes or so of Japanese speech. A total  conversion would be tremendously difficult and expensive, so I knew  Tecmo would have to make some compromises along the way.  And man, it compromised a lot. They've changed the soundtrack, the  moves, the voice acting, and even the gameplay. In fact, if it  weren't for the fact that the storyline and the graphics are the  same, I'd think this was an entirely different game. Still fun, just  totally different.  Presentation  About the only thing that remains the same in both versions is the  storyline. 200 years into the future, the world is ruled by Ducker,  who, as the name suggests, likes ducks. Aside from having a  headquarters resembling a duck's head, he surrounds himself with  robotic mallards and rules the entertainment world with an iron  first. Dancing is forbidden, and those found shaking booty are  severely punished.  Enter Dance Doctor, a lavender-clad dance master that looks like  something straight out of the 70s. He leads three girls - sort of a  futuristic version of the Spice girls to bring dancing back to the  world and overthrow Ducker.  It may sound cheesy, but it works. Tecmo's 2D and 3D design is ultra  retro/hip, combining campy 70s sci-fi/action/comedy plots and  cutting-edge design so successfully you can almost believe that  dancing could save the world. The only thing - and it's a big thing -  is that Tecmo has redubbed all the original Japanese dialogue into  English, and it suffers, since the voice acting is incompetent at  best. Thankfully, the gameply more than makes up for it.  Gameplay  Like all dance games, Unison is essentially a ~Simon Says~ game. You  move both analog sticks to follow a pre-arranged pattern on the beat  and you're graded on how well you follow the original choreography.  Where Unison's unique, though, is that it's the first to use the  analog sticks instead of the d-pad and buttons, and the first to  choreograph an entire song. In other words, unlike games like Dance  Dance Revolution or Bust a Groove, what you're doing with your  controller directly corresponds to what you see on screen. It takes a  bit of getting used to, but this is the only game where I really feel  like I'm dancing instead of following directions.  That's also because the game's flow also resembles the real  experience. Generally, each level consists of a learning phase where  Dance Doctor shows off the routine - you can move along with his  steps to learn the moves. Then you get tested on the routine. If you  pass, then you can move onto the actual show, where you have one  chance to do the routine right, or your career, and the game, is  over. Unfortunately, the American version has stripped out Doctor  Dance's voice and defaults to teaching the entire routine at one  time. Without his support or teaching the player to learn in small  chunks, it can be a little overwhelming.  Sounds hard, but the American version is incredibly easy, compared to  the original Japanese system. The original Japanese choreography had  you using the the full range of the analog sticks - circles, arcs,  diagonals, etc. If Chilly waved, you waved. The American version only  uses the four cardinal directions, which really limits the player's  connection to the characters on screen. Also, the Japanese version  left the handy dandy analog stick indicators in training mode. Once  you were on the broadcast, you had to dance from memory - much like  real life. The American version always has the analog routine icons  on, even in the final performance.  That being said, the American version's all-new choreography works  very well in four directions, since much of the new dance routines  don't rely that much on elaborate hand movements, and if you really  want to test yourself, you can turn off the indicators.  Graphics  Graphically, Unison has the best graphics ever seen in a dancing  game. What did you expect from the guys who brought you Dead or Alive  2? The DOA breast bounce (or ~chest tremor,~ as it's called by the  Japanese) is alive and kicking, the girls are cute, and Dance  Doctor's afro has a physics system that must be seen to be believed.  The 3D is impeccable, and while not incredibly detailed, the look is  perfect.  As to be expected by Tecmo's frisky artists, the girls' character  designs are top notch. Each stage in the story mode has unique  costumes - ranging from bare-midriff US flag costumes to Japanese  kimonos, snow bunny outfits, and my personal favorite, leotards and  leg warmers. The stages are also well-designed - each one has its own  unique design aesthetic true to itself down to the last detail.  Unfortunately, the stages are all designed for the original Japanese  songs, so it's strange to see girls in frilly dresses and skirts  shaking their rump to Aqua's Barbie Girl.  That's a shame, too, because the new motion-captured dances are very,  very good. The routines work perfectly for the songs, and they're a  pleasure to watch, since they're full-body routines considerably more  sensual than the more innocent moves required by J-pop dancers. The  cognitive dissonance can be jarring, so much so that sometimes I  prefer to dance in training mode more than the actual level.  Sound  There's not much to say about the sound. Almost the entire J-pop  soundtrack has been replaced with American songs. Most are great  dance club songs, like Aqua's Barbie Girl or the We are Family remix,  and there's no doubt that Tecmo spent time making sure the moves and  the music worked together. Still, when Tecmo's putting Naughty by  Nature's ~O.P.P.~ in girl-friendly game like this, you've got to  raise an eyebrow or two. But overall, great songs, and a great  selection. Unison is tremendously dumbed down for an American audience, but it's still darn fun to play. The gameplay is almost completely different, the language dubbing is horrible, but the soundtrack is rock solid and the new motion capture is definitely hipper. If you like challenging dance games, this is one you don't want to miss.", "date": "Apr 3, 2001"}