{"name": "Summoner", "name_review": "Summoner", "ref": "https://www.ign.com/articles/2001/04/05/summoner-4", "text": "~This boy is nothing but a peasant!~ Whenever you see these words, take caution. Death, destruction and uprising of the underclass is sure to follow, as is the case in Summoner, a new (to the PC, anyway) RPG that follows Joseph, a young summoner who's been prophesied to free his world from hopeless tyranny. In a 3D RPG that immediately recalls such favorites as Diablo II and Vampire: The Masquerade, you'll take part in a point-and-kill mouse-driven adventure through catacombs, islands, and far off lands in search of storyline, plot points, and ways to level up. While Summoner isn't the most original kid on the block, it's a fantastically fun adventure that keeps the action quick, while still retaining a lot of RPG detail... that is, if you could play for any substantial length of time. Unfortunately, Summoner has some major repair problems under its shiny hood that keep it from being your next favorite click-and-dungeoncrawl RPG. Can it be that Summoner suffers from the not-so-legendary Vampire's curse?  Joseph has a problem with summoning. As a child, he used his powers to defend his town from attack, and accidentally called a demon so powerful that it destroyed everything in his town, innocent and evil alike. He threw the ring down the well, vowing to never summon again, and returned to his life of sullen but secure peasantry. Games being what they are, Joseph is soon called back by an old mentor who's been on the search for him for ten years. Seems that he's more than just a powerful young adult -- he's the key to salvation for his entire land, thanks to a prophecy and his powers. You'll slowly work your way up from a solo sword wielding battler to a powerful summoner with a party of characters to control, not to mention the monsters you can summon to help you in battle.  The thing that makes Summoner so fun is that it's a great bridge between console games and RPG adventuring. The base structure and storyline is very classic western fantasy stuff, with a million mythical locations to remember, race histories to hear about, not to mention creation stories and gods shudder at. You'll level up and have the option to pick which of each character's stats to bump up, you have a nice drag n' drop interface to put new items on your characters with, and you can press the space bar at any time and give yourself time to select spells, or use items without worrying about realtime limits. On the other hand, your characters all fit into specific types, with Rosalind acting immediately as your healer, and Flece picking locks, sneaking, and doing long range attacks like the good thief she is. You can pick stats, but the types of stats you can upgrade are all very character-specific. In other words, Joseph will never have the option of lock-picking, just as Flece can't summon monsters. Summoner even simplifies Vampire's already simple interface by tossing new spells into your character's lists as you go up in levels, taking you out of that sort of customization altogether. While you can bump up stats for Rosalind that give her access to higher level spells, you can't actually pick each and every spell that she'll learn next.  Also present is the now-classic PC scheme of tossing a million or so tiny sub-quests to accomplish while you're on your main quests, much more so than any console game I've ever played. People will talk their heads off when you chat with them, and there are tons of citizens in every town, so many that you'll feel pretty overwhelmed when you reach the first major town, Lenele. Fortunately, key characters with important information have little speaking bubbles with ~!!~ over their head, making it a much less confusing experience. You'll want to keep close track of which characters are in which parts of town however, particularly as the mini-quest list gets longer, and longer, and longer, and...  How does Summoner actually play, though? The comparisons to Vampire will be many, since everything from the interface to the gameplay style will feel nearly identical to anyone who played last year's gothic RPG, though I'm happy to say, camera problems and AI problems are nearly nonexistent in this game. Backgrounds and walls simply fade to transparent when they're in the way, making it much, much easier to explore tight areas, and your other characters tend to be pretty smart about not blowing out their magic powers within 10 seconds, or attacking you, or being dumb, or dying within ten seconds. You get the picture. In order to attack, you simple click a button to get into combat mode, then click on the opponent. As you swing, a chain will appear, allowing you to perform chains that you can keep rolling, causing more damage as long as you can get the timing right. You can also put specific attacks on those chains, so that you can pick the best effects that the chains have on foes, with different special attacks for every character. It's not revolutionary, but it certainly makes it more fun than just clicking and waiting to either or win or lose. You can set your most used spells in a set of spaces on the menu bar, to use quickly, just as in Vampire and Diablo. There's even a hotkey to pickup nearby items like Diablo. It makes the pacing of fights pretty quick, and while they're nowhere near as complex as say, Baldur's Gate, they're definitely more entertaining than your average Diablo dungeon romp. The summoning is fun, and gives you a nice selection of new characters to use -- you can actually use summoned monsters just like other characters, healing them, and even commanding them and using their special spell abilities. While it's certainly not the focus of the combat, despite the title, it's really fun to call up a water dragon or a blackfire elemental when you're feeling the heat, or just need a battle pick me up when you're feeling bored.  Every aspect of this RPG has been simplified just enough to make it friendly to those who aren't necessarily familiar with hardcore RPGs.  Characters, for instance, are usually pre-set in the most convenient AI settings, with healers already pre-set into ~heal/magic use~ settings instead of aggressive or support. It's more than simple to just click and go once you've got the hang of things. You're encouraged to switch between characters to keep them leveling up quickly, and the AI makes it easy to do just that. Dungeons are filled with simple puzzles, and tons of monsters to destroy, and the skill levels have been tweaked to provide challenge without ever becoming unfair, or too simple to get into. Sometimes the sub-quests can pile up too quickly, and there are moments when it can get pretty confusing to figure out where to go or what to do next, particularly in the beginning of the game, but overall Summoner provides a solid, story-driven adventure with enough back story to choke a room full of D&D freaks, while still entertaining the casual gamer.  For all its solid gaming, there's one big problem with Summoner, however. The bugs. Oh, the bugs. I've had Summoner perform magical glitch tricks with the menu system and the mouse while I'm trying to play, I've had bad slowdown problems that have crashed gameplay, and I've had the worst of all -- crash outs that quit the game out completely, leaving you with a stunned hand on your mouse, and your eyes staring at your desktop. I had to replay chunks of the game three times before I quickly learned to save every 10 minutes or so just to protect myself, and even then I'd slam my fist down when the game completely died in the middle of a heated battle. The saddest thing about all this is that this comes after getting the first patch for the game. I almost gave up when a particular boss battle would either glitch or crash nearly every time I was in the middle of the battle; I finally finished it after about 10 attempts, and four reboots. Match that with the whopping 800MB minimum install, and you've got a big beast that may cause you to have irregular migraine problems, and that's before you ever reach the first puzzle.  The graphics are solid, and have some great touches, particularly in the architecture of the Monk's island, as well as the foamy green water surges in the first sewer catacombs that you explore in the game. It's good, sometimes great, but never as intricate as the design of Vampire. Faces can get kind of freaky in particular, and textures lack detail when zoomed in upon. Most regrettable is the horrible fogging that takes place, even if you're playing it in the farthest distance. When you're running from one side of town to another, it's sad to see entire chunks of town appear in from the fog, particularly when you're exploring pretty simple scenery sometimes. The sound, however, is nothing but great, with some solid voice acting, and some great soundtrack scores that sweep from acoustic guitar tunes to epic choral pieces that highlight major moments in the storyline. It's constantly enjoyable, and will keep your interest throughout long adventures, which is saying something.  Every artform has its mythos, and its curses, and now it looks like gaming has one as well. For all the high points in Summoner, it suffers from the same bugs and crashes that plagued its cousin, Vampire: The Masquerade. Even the instant crashouts are present, which is extra disturbing. Still, Summoner doesn't suffer from the gameplay and camera problems that made Vampire so rough to get through. While it may not have the mature themes of Vampire, Summoner gives you a fun mythical journey that will keep you fat and happy while providing the same level of 3D RPG fun, particularly if you've been looking for a lighter RPG that will keep your mouse busy without taxing your strategy skills too much.  File this one under curse of the Vampire -- it will undoubtedly get better (not buggier) as patches are released, and time goes on, but at this point you'll find yourself with a fun, easy to use, and even easier to crash gaming experience.  -- Vincent Lopez Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story. My expectations and opinions with regard to Summoner have changed over the course of the past five or six months more times than I can count on a single hand. It began as a game that I was very interested in playing, quickly changed to something I had no interest in at all (crappy version on display at E3 was the cause of this), back to something I wanted to play and so on. Just about every time my anticipation for the game would peak, it would be quickly reversed by some new revelation that made me completely uninterested in the product. In fact, coming into this review, Summoner was the one launch game that was on my list of games to review that I was not looking forward to playing through. To cut a long story short, after playing a little over 30 hours of the final product, I have come to the conclusion that Summoner is a very enthralling role-playing game experience that is without a doubt the best of the RPGs that are available at launch. It isn't the be all and end all of RPGs and hasn't really lived up to all of the hype that it has been receiving from this Website and others, but it's a very good game. While it does have flaws (they're all mentioned in the text of the review above), the game has a compelling storyline, plenty of intriguing plot developments, and an insanely deep combat system. Plus, it offers gamers a very long adventure that will likely take well over 30 hours to complete just the main quests and probably more than double that when you factor in all of the option mini-quests. While a bit short of greatness, Summoner is an admirable role-playing game experience that is more than one could have ever really hoped for in an RPG that's available at a new system's launch.", "date": "Apr 5, 2001"}