{"name": "Strikers: 1945 2", "name_review": "Strikers: 1945 II", "ref": "https://www.ign.com/articles/2001/04/05/strikers-1945-ii", "text": "A shooter?  In 2D?  On the PlayStation?  *rubs eyes*  Yeah, I guess so.  Fancy that.  The classic shooter isn't what you'd call the most prevalent of genres on the American PlayStation, now or at any time.  Narrow the field down to include only sprite-based specimens (which kicks G-Darius, the Working Designs-localized Ray games out of the running.  Was Philosoma 3D?  Been a while...) and you've got...uhm, just Strikers 1945, I guess, unless you want to count Metal Slug X and In The Hunt, despite their slightly nonstandard presentation (i.e., SD commandos and submarines instead of proper super-powerful space fighters).  Cheers to Agetec, then, for filling in a terribly underrepresented genre.  To be sure, Strikers isn't the most impressive of specimens.  It's lost some of its looks on the way home to the PlayStation, and like a lot of Psikyo's games (the Gunbird series is another example) it doesn't quite have the depth in its patterns or weapons system that marks a really great shooter.  It's still firmly a quarter-muncher at heart.  But that doesn't mean it isn't entertaining, and it should be available for a low enough price that fans won't feel cheated after picking it up.  Gameplay  See the little guy down there?  That's you.  See all the guys up there?  That's them.  I think you know what to do from here.  But seriously, Strikers adheres to the shooter formula that pops in plenty of Psikyo games and related specimens.  Each of the six different fighters (all homages to and extrapolations from various weird WWII aircraft) has a basic shot, secondary missiles, and limited-use smart bombs.  Power-ups increase the strength of the first two, while extra bombs can be found to extend the life of the latter.  There's also the super meter, though, since this is actually Strikers 1945 II (Agetec tweaked the name, since the first one never came out here).  Charge up the meter and you can blow away a column of enemies with progressively more powerful special attacks.  And so, with those weapons in hand, off you go.  The variety of craft and attacks is good, but it's mission design where Strikers falls down a little, because it has very simple levels.  It's nowhere near as egregious as GigaWing, but the odor of arcade-fermented cheese does linger here and there, and rarely do you encounter an interesting use of the environment (as in Radiant Silvergun or Forgotten Worlds).  Plain old bullet-dodging is made more interesting by the variety of ships, though, since each one has different attributes for speed and size -- some of them can slip into smaller gaps, or get out of the way more quickly.  That definitely becomes a factor in the later levels, where the hail of fire rains down plenty thick.  Graphics  Strikers is letterboxed down both sides to preserve the vertical composition of the arcade version, although there's an option for a sort of pan-and-scan mode that allows a little limited scrolling back and forth on the Y-axis (this lets you see more of the field if you want to).  While the aspect ratio is fine, though, the animation is not quite perfect, in comparison to the arcade or Saturn versions.  Strikers looks fairly good for a 1997-vintage PlayStation product, with decent-sized bosses, lots of fire, and an inoffensive degree of slowdown, but it still doesn't look as sharp or smooth as games you could play on the Saturn or Dreamcast nowadays.   Sound  I love shooter music.  Soaring orchestral themes and cutting-edge techno are all well and good, I suppose, and they certainly have their place in other genres, but shooters require shooter music, and Strikers 1945 has proper shooter music.  Born though it may have been in a single composer's MIDI keyboard three or four years ago, it's still suitable mindless-destruction accompaniment.  The same goes for the zap-zap-zap KABOOM WHOOSH sound effects, bringing to mind as they do the lost shooters of my youth. Which is Strikers' appeal in a nutshell, I guess.  Those without a nostalgic emotional investment in 2D shooting are probably not going to be quite so into it -- they need a softer introduction to the genre, through something a little flashier like the Ray games.  I'd say everybody's first shooter should be Silvergun, except the bloody thing can't be had for love nor money (grumble grumble).  If you're on a budget, meanwhile, I'd say save your shooting cash for Metal Slug X, whenever it decides to come out (hopefully soon).But for the budget price, this is a good shooter value, something to fill in the corners while you wait for Slug and remind you of the good old days when a game like this came out twice monthly.  Ah...", "date": "Apr 5, 2001"}