{"name": "Batman: Chaos in Gotham", "name_review": "Batman: Chaos in Gotham", "ref": "https://www.ign.com/articles/2001/04/09/batman-chaos-in-gotham", "text": "Batman had a good run on Fox Kids and Kids WB, but all good things must come to an end -- the conventional Batman made way for the futuristic Batman Beyond, thrusting the vigilante to the inevitable world of the Cartoon Network reruns. But his legacy has survived, as UbiSoft and Digital Eclipse bring the animated Dark Knight to the Game Boy Color in a halfway decent action platformer that, despite a few sloppy gripes, will make a Batfan happy. Features 18 levels Two playable bat characters: Batman and Batgirl Control bat vehicles: Batmobile, Batcycle, and Jetwing Use bat gadgets: batarangs, bombs,  and grappling hooks Only for Game Boy Color   There's a reason why the game's called Chaos in Gotham -- anybody who's somebody on the streets of Gotham are creating a little terror for whatever reason. There's been a breakout in Arkham Asylum, where all the creepy, violent nutcases are held, and now it's up to Batman to play the nighttime criminal wrangler -- but he'll have a little help from his friends.  The game's design is very traditional, with Batman at the lead in a level-by-level action-platformer. His main weapon is his fists and feet, as you'll make sure he can get to the end of each level relatively unscathed by punching and kicking enemies, as well as jumping from platform to platform. Because he's Batman, he's got a few tricks in his belt -- you can plant bombs to detonate under enemies feet, whip out batarangs to temporarily stun enemies, and launch the ever-popular grappling hook to grab hard-to-reach items. On occasion, you'll hand over the keys to Batgirl or Nightwing (the original Robin) and control those guys for a level or two, just to give the old guy a break.  The gameplay's a lot of fun, but in many cases you can by-pass a lot of the battling simply by leaping over the bad guys -- they don't chase you down, and you're neither rewarded or penalized for being the pacifist vigilante. And there's no incentive for using your weapons -- in most cases, you don't need to throw your batarangs or drop landmines, since a punch to the head is much more effective. The controls in switching your weapon are very sloppy, as you have to hit select to rotate between punching, grappling hook, batarangs, and bombs. And they'll stay that way until you switch them back, so if you switch to the grappling hook, you better switch back to the punch controls or you'll look like a goof leaping in and launching your rope while getting a fist in the face.   But there's a lot of variety to the gameplay, as interspersed throughout the adventure are little minigames -- you'll have to drive the Batmobile all over the streets of Gotham, fly over the skyline in a Batwing, and zoom your batcycle in a race back to the city, just to name a few. None of these little challenges are anything special, and they do have a very ~rushed~ feel to them, but it's a definite draw to get through the normal levels just to see what the designers threw in as an extra stage.  The real draw to Batman: Chaos in Gotham is the art team's attention to detail -- the game really looks like a Batman & Robin Adventures title. For one, Batman animates with incredible fluidity as he runs, leaps, rolls, punches and kicks his way through the game. The backdrops are equally impressive -- Gotham's never-changing red skyline is just as creepy on the Game Boy Color screen as it is on the television screen. The real problem comes from the fact that you don't really know what's a platform and what's a part of the background without a little trial and error. The artists didn't make it easy to tell the difference between playable surface and just pretty graphics, so you'll find yourself walking on rooftops you might not expect to have access to, or landing on platforms you thought were way off in the distance. This game is a decent title that turned out surprisingly well. The game does have a few glitches in several of the levels, showing a bit of a rush-job in places -- but all in all the game is a good, long adventure that's actually a challenge to complete.", "date": "Apr 9, 2001"}