{"name": "The $100,000 Pyramid", "name_review": "$100,000 Pyramid", "ref": "https://www.ign.com/articles/2001/04/12/100000-pyramid", "text": "I would consider myself a game show fan, okay fanatic, alright, I admit it, freak.  For the past few months or so, I've watched the Game Show Network with fascination -- pulled in by the oddness of Family Feud, the irresistible tug of Super Password, or the strange euphemisms of Gene Rayburn and Match Game.  But my favorite was -- and continues to be -- the $100,000 Pyramid. Maybe it's because the game is so fast-paced, or maybe because people can win life-changing amounts of money (for the 1970s, anyway), I just find the game entrancing. It's so much better than most of the other fare on the channel. Wheel of Fortune and Jeopardy? Forget it, they don't hold a candle to host Dick Clark and the Pyramid.  Sierra Attractions has now come out with a game that will let you get in on the Pyramid excitement at home -- the $100,000 Pyramid CD-ROM.  The game offers three modes of play: single player, two players or party mode (where four people can play). The party mode requires, of course, that the person getting the clues not cheat and look at the screen. If your partner gets the clue you're trying to give, just hit the space bar to indicate a correct answer. If the other team uses a part of the word or makes anything other than a facial expression (gestures or body language) which aren't allowed, you can hit the SPACE key from the other team to disallow that clue. Each team gets 21 chances to guess words, with three rounds of 7 words each.   Single player is the mode where its just you and one of the game's made-up celebrities (Rock Stone, Charise Goodwin, Steve Burley, or Wanda Winters) go against the clock to see how many words you can get in 60 seconds. (Which is 30 seconds more than you actually get on the TV show) The animated celebrity gives you the clues, and you must deduce the words they're trying to convey. It's not really all that hard, and it's also a good bit of fun.  To start, you must pick one of the six categories on the board. Keep in mind, though, that the names of the categories often are deceiving. For instance, the category could be ~You Blew It~ and the category could be types of musical instruments that you blow into. The game features more than 700 categories, so there's little threat of the game repeating itself.  The seven words you have to guess then are related to that topic in some way. Your partner gives clues to try to make you guess the keyword they're looking for. As they give the clues, you type in what you think the word is they're trying to convey. If you get close to the word, or even just begin to type it, the computer will usually finish it off for you. Even if the word is very similar to the word the game is actually looking for, sometimes, you'll get credit for it. It's a nice touch, particularly since things worked that way on the actual show.  If you get the minimum number of points you need (in each set, you're given 7 words to try and guess, with a total of 21 words), you move on to the Winner's Circle, where you can win the ~really big money.~ It starts at $5,000 and goes up to $100,000.  When you go to the Winner's Circle, you have 90 seconds to guess six categories. These are quite a bit tougher than the words in the regular game. For instance, if your partner gave you the clues: tape, stapler, paper clips, pencils, what would your guess be? If you said THINGS YOU FIND ON A DESK you'd be good at the game. If you said: THINGS IN MY HOUSE, then you'll proabably never be any good at this game, and you should go back to playing Quake.  Graphics in the game are about what you'd expect, with sparsely drawn and animated ~celebrities~ giving you the clues. They move their mouths as they talk and flail their arms a little, especially when you pass on a clue and go to the next one, but there's not a great deal of graphical power expended on the characters.  Sound in the game is about as good as you'd anticipate, with all the game show bleeps and buzzers in full effect. The biggest disappointment of the game comes with the sound, though. Not only is there no ~cuckoo~ noise for an incorrect or disallowed clue  (which only happens in the party mode). But the show's theme music -- which to me, is one of the most catchy themes on TV -- has been supplanted by non-descript computerized music that sounds as if it was created just for the game. It's pretty lame compared to the real thing, and it makes me very disappointed.  The biggest complaint about the game is that it doesn't give you a chance to see what words and categories you couldn't guess. (And this is especially true once you've moved on to the Winner's Circle). If there's a word you couldn't get right during the regular game, it just moves on to the next round, without telling you what the word you should have gotten is. In the Winner's Circle, this is especially annoying, because your partner can be giving you clues for 20 seconds trying to get you to say: THINGS IN A CAR and you can type everything else around that, but never get it. And if you don't guess it right, the game will never tell you what the category was, but you'll definitely want to know.  All in all, $100,000 Pyramid is a good diversion for a few plays and one of the better game show titles we've played. If it weren't for the disserted theme song and the inability to see the words and categories you've missed, we'd rate this much higher. But as is, it's just good to suck up a few minutes of your spare time.  -- Mike Morrissey Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Apr 12, 2001"}