{"name": "ESPN MLS Extra Time", "name_review": "ESPN MLS ExtraTime", "ref": "https://www.ign.com/articles/2001/04/24/espn-mls-extratime", "text": "For many people, International SuperStar Soccer was, and still is, the greatest soccer game that ever existed. I am one of those folks who played that old Nintendo 64 game and still love it to this day. With the countless iterations that have followed from Konami's early glory days of ~futbol,~ the company also has tried, perhaps in vain, to diversify its soccer games for different markets. Konami's latest attempt is to tap and penetrate the American market more than ever before.   But it's all messed up. Because while the Japanese received Winning Eleven 5, arguably the greatest next-generation soccer game on the planet, and Europe appears to be receiving ISS Pro Evolution, the soccer-poor US gets the strange hybrid from Konami's Honolulu Studios. ESPN MLS Extra Time isn't just retrofitted with the ESPN license, commentary, presentation and music, it's an altered -- more like neutered -- version of Winning Eleven Five that's just not as good as the original. The graphics, animation, the commentary, stadia, and the gameplay aren't as good as that pure Japanese product. But, and here's where it gets weird, in many respects, the game still retains enough of the good stuff to be thoroughly enjoyable.   Gameplay Much like International Superstar Soccer, ESPN MLS plays much more realistically than most soccer games, in particular FIFA. Everything about this game reeks of studied plays, natural offensive plays, and the kind of quick, spontaneous explosions that make soccer so exciting. Like in Winning Eleven 5, ESPN has built its cornerstone gameplay around the through-pass and strategic offensive plays. Unlike in FIFA, in which pretty much every play transforms from a center pass from the corner into a stunning bicycle kick, in ESPN, players must penetrate holes in the defense with through-passes and quickly strike to earn points. Learning where open players are, reading the field, and learning how to manage your shooting skills are absolutely crucial to winning. In short, it's inherently a true soccer fan's game.    What's tricky about ESPN's game is getting to grips with the shooting controls. I hadn't played a Konami soccer game in some time and it took me about four matches to truly handle shooting properly. Heck, it took me two games just to be able to shoot, period. The default control features X as pass, Triangle as pass-through, RI as sprint, Circle as center/lob, and Square as shoot. On defense, players use X as cover or safe attack and Circle as slide tackle. The hardest part is mastering shooting. A little meter appears on the screen indicating the shot's power, and with just a little bit of pressure the meter jumps instantly to field goal (as in American football) status. This could easily be remedied with a smoother, more gradual response, but unfortunately, it's not the case.   Another aspect of the game that differs from most soccer games, and FIFA in particular, is handling and dribbling the ball. Dribbling is not a separate function the way it appears in FIFA. Players handle the ball by cutting left or right or by sprinting, and the dribbling animations are part of those moves. To be honest, I don't miss that aspect of the game (it can play a bigger role in FIFA if you choose to use it), and ESPN's gameplay shows that it's essentially complementary. Compared to Winning Eleven 5, the dribbling and ball-handling is also not as refined by any means. It's as if Konami took out the ~smooth-animation~ button and stuck in a cheap replacement.   The AI on the whole is solid stuff. While the kind of annoying ping pong effect that happens constantly in the mid-field of FIFA doesn't happen here (and thankfully), it's harder to score a goal than in FIFA, and to keep momentum and control of the ball is also more of a challenge. But if you play Winning Eleven 5 next to ESPN, the level of scoring is much higher. Games in ESPN end up being more like 3-5, or 4-5, than 2-1, or 1-0.   As you increase the game's difficulty, however, what happens is two-fold, the offensive game becomes much more challenging, as does controlling the mid-field, and kicking to an open player while on defense. The holes are clogged up better by the defense, and through-passes are much more difficult to connect. In fact the battle for possession overall becomes far more challenging. Good passes are picked off, not just lazy ones. Defenders are quicker to slide or occasionally steal and they usually won't let you run by them for easy center passes near the goalbox. Also, they come on the attack faster in the open-field. In the harder levels of difficulty, many of my through-passes were stolen by a defender who anticipated the pass and either stretched out to snag it or slid into place to grab it. Another instance in surprising AI is when the opposite team works give-and-goes, lob passes, and uses the field to tease and encircle your players. It actually works smart plays against your ass.   Where I like FIFA better is in the interface. Throw-ins, corner kicks, and free kicks are so much more flexible and controllable in FIFA, and they make ESPN's interface look old-fashioned and primitive. Don't get me wrong, they work just fine, but the ESPN interface just doesn't compare. The interface is average at best, and tends to become more annoying and crude. As for the ball physics, they are rock solid. Balls roll and bounce with accuracy and realism. Backspins and sidespins can be seen as balls are kicked differently, and they change depending on the kicker. There aren't any noticeable curves or spins that you can see, or that actually affect the game, like in FIFA, but the game gets along fine without them.   Graphics Assisted by Renderware, Criterion's safe harbor of middleware that enables the less-than-well-funded, and the less-than-ambitious development team to get to grips with the PS2, ESPM MLS is a decent looking game at best. It's not by any means as good looking as FIFA or its more handsome Japanese cousin, Winning Eleven 5. Most of the player animations are clunky and stilted looking. The framerate is decent enough, but the animation isn't interpolated well enough, so a lack of fluidity and smoothness is lost.   Oddly enough, while the running and other basic character animations are simplistic, the motion-captured moves and a few animations that follow them are quite spectacular. They are subtle, but they are genuinely real, just like in the pros. For instance, if you look closely when a defender attempts to steal a ball from you, he uses his shoulder to edge you out, just like in real soccer. In other situations, such as slide tackles and slides, the opposition clogs up an open field, players shift their bodies, hips and shoulders to enact the play. Goalies protect their bodies when sliding, and fallen players fall naturally onto the field. But in the end, it's as if the framerate speed and animation ruin the good motion capture work and lessen all the good work.  In terms of straight presentation style, however, ESPN does win bonus points for re-creating the event almost exactly as in the games on TV. In fact, all of the ESPN games from Konami have delivered very accurate and convincing presentation styles that make you feel as if you're getting the real thing.   Having said that, as for the game's overall look, ESPN doesn't by any means earn many points. Compared to the Japanese version, it's not as smooth moving, nor is it as fast. Little things like jaggies and aliasing problems seem to have appeared in greater form in this US version, and even things like the fine level of texture detail, facial and clothing textures are worse. The stadia are usually empty (which is more a reflection of MLS than the game itself) and the crowd is pretty much the same, forgettable, but the whole overall atmosphere is really downgraded. The fields are essentially squares of grass that are pieced together, but they aren't any worse than in FIFA.   Sound What's weird here is that it's difficult whom to pin this one on, ESPN or Konami. What truly dampens the game's entire audio presentation is the commentary, which is incredibly repetitive, inaccurate, and totally uninteresting. Clips such as ~Good passing but do they have any plans to get into enemy territory?~ are heard several times in a half, and if you have ever watched soccer, 98% of soccer IS passing, so it's ludicrous to even utter this kind of talk. Other lines, such as ~This could be interesting...~ and ~The crowd quieted down there for awhile but then it started to pick up...etc.~ are completely and robotically announced more times than I can shake a stick at.   So, is this Konami just doing its job, re-creating the exact MLS commentary? It's about half and half, honestly. Konami apparently didn't invest too much in the commentary itself, but wanted to make the game ~American,~ which unfortunately means less informative, intelligent, and less ~interesting~ to listen to. This game, much like the ISS games before it, is rooted in a more rigorous style of play that demands smarter and more simulation-like play than EA's efforts. Even with this downgraded American version of Winning Eleven 5, I have to say that I prefer this more realistic style of play than FIFA's. That brings me to FIFA's score, which is a little higher than it deserves. If I had to pick any soccer game on the planet, I'd pick Winning Eleven 5. If I had to pick any American soccer game, it's probably be this one, because of its reliance on realism, straight skill and the player's soccer knowledge. But what dampens this game's overall effort is that it's been altered too much from the Japanese version, or re-created in with so many little strange affects that it doesn't feel right in so many respects. If only they had just brought Winning Eleven 5 here and left it as it is! Damn! Ah well. It's a good game, but with a face-lift that never really worked.", "date": "Apr 24, 2001"}