{"name": "Rumble Racing", "name_review": "Rumble Racing", "ref": "https://www.ign.com/articles/2001/04/24/rumble-racing", "text": "While last year's NASCAR Rumble on PlayStation was a very enjoyable racing game, it had a few nagging problems that held it back. The souped-up versions of real NASCAR vehicles were cool, but seemed somewhat limited, the racing was really fast, but was hampered by the lack of balance with the power-ups, and the AI in the middle to late levels was frustratingly malicious and much too difficult. Fortunately, it appears that the game's developers had most of this in mind when it came time to make Rumble Racing, as just about all of the problems of the original have been completely addressed.   The NASCAR license has been removed, allowing for more creative freedom for the game's developers. This shows through most in the game's brilliant vehicle designs, which are a lot more inventive and much more imaginative than what was offered in the first Rumble. And even beyond the purely aesthetic improvements that were allowed thanks to this newfound freedom offered, there were actually some enhancements made in terms of gameplay that might not have been completely befitting of a NASCAR licensed title.   Gameplay The most notable change or enhancement would have to be the inclusion of a trick system that's quite similar to the one used in the Stormfront Studios developed Hot Wheels Racing game that was also published by Electronic Arts. The big difference is that it's all done about a million times better here in Rumble Racing.   Tricks are pretty easy to pull off and actually play a very important role in the actual gameplay because performing tricks give you a speed boost and the length of the boost is determined by the difficulty of the trick. While it's possible to win races on the earlier levels on the easy difficulty setting, the need to try and perform tricks to gain a speed boost increases more and more as one progresses through the game. And on the trick-based tracks, it's really important to try and perform difficult tricks whenever possible in order to gain the most boost possible to increase your chances of finishing in first place.   One of the biggest problems of the original was that the balance of the power-ups seemed pretty chaotic and it suffered from the same problem as Mario Kart in that it kind of pushed the player into a position where it benefited him or her to stay towards the back of the pack as long as possible. While the power-ups are still going to be better for those that are in the back, which is the way it has to be, and the ever-popular tornado power-up can easily have a last place racer move up to first place at any moment, the general balance is much more refined.   The AI has been tuned in a way where if you just stay towards the back of the pack, hoping to get all the cool power-ups, you might not be able to catch the leader on the last lap every single time. You can get away with it on the early levels, but towards the middle to late half of the game, you'll want to make sure you race your best from beginning to end.   Improvements have also been made to the game in the area of track design. The levels seem to have more shortcuts and the shortcuts actually have some depth to them in that there are some that are better than others are. Taking a particular shortcut could mean that you miss out one that's even better, so players will have to really learn each track to find out what shortcuts to take and which ones to pass on.   The only real complaint that I have about the game is that the AI can be a bit too harsh at times. Challenge is always welcome, but it shouldn't ever be challenging to the point where you're annoyed or feeling cheated. And this happens sometimes when playing Rumble Racing. The overly aggressive CPU AI will often hit you from the rear and knock you flying around, leaving you ripe and ready for another car to hit you just as you land. Before you know it, you've gone from first to last just because some computer controlled car ran into you. This isn't something that falls in the area of being a fair challenge and could've been improved just by increasing the ~invincibility~ time of your vehicle after recovering from an accident.   Even so, this is only a small problem in a game that really has few significant flaws and is quite simply a lot of fun to play. The racing is some of the fastest you'll find anywhere and the basic game design is just about perfect. The single player experience is very rewarding in that there are a few different difficulty settings and the progression in each is pretty balanced as you move from the Rookie to the Elite car classes. What's more, there's a lot of reason to play through the tournaments as they each open up new cars and tracks along the way.   Additionally, for those of there out there that play games with friends, Rumble Racing offers up a variety of two-player split screen options including co-op and competitive play. In co-op, you can race with your friend as a team in the same tournaments in single payer, opening up even more cars and tracks. The only thing missing is support for four-player split screen racing, which could've proven to be a lot of fun even if level detail had to be scaled back to keep up the framerate.   Graphics With a game that moves as fast as Rumble Racing does, a steady framerate is extremely important. A solid 30 frames per second is a must, but 60 is obviously desired. From what I can discern, Rumble moves at a solid 60 frames per second at all times without even a hint of slowdown. And this is in both full screen single player racing and two-player split-screen gameplay, regardless of how many CPU controlled cars are on screen at one time and with any amount of power-ups being used.   Things aren't quite as amazing in other areas, but aren't bad, either. The textures on the cars, especially the low-end ones, are pretty plain looking and the detail of the car models are nowhere near as good what's possible on PlayStation 2. They're not poor by any means, though, and the vehicle designs are quite imaginative and tremendously cool in some cases.   The backgrounds are kind of in the same class as the car models, meaning that there's some very impressive stuff mixed in with some not so impressive. The trees look really good and there are some impressive special effects being used, but the shadows and lighting in general isn't in the same league as other racing games on PlayStation 2 like ATV Offroad Fury. The interlace flicker is about on par with most other PlayStation 2 software titles, so it's nothing really to complain about and the pure beauty and raw magnitude of the tornado power-up more than makes up for any of these minor shortcomings.   Sound The music is probably a perfect fit for the game, but that doesn't necessarily mean that I have to like it -- and I don't. It's completely befitting the artistic design of the game's vehicles and the tempo matches the general speed of the game, but that's not always enough. The overly hillbilly sounding tracks just aren't something that I want to hear over and over again in a racing game that's so addictive that six hours at a time are being put into it.   Even so, the music isn't bad, per se, just not something I would have preferred. Likewise, it doesn't ever really detract from the overall gaming experience and there's always the option to turn down the music volume or bump up the effects, engine noise or speech, all of which are very well done.   Those that were annoyed by the commentator in last year's NASCAR Rumble will be pleased to know that the annoyance level this year is nowhere near as high. He still makes his occasionally crack-up, but it never comes close to being annoying, even when the frequency is set to high.   Likewise, there are some very powerful engine noises and the sound effects for crashes, bumps and the like are well done. The only real complaint to be made here is that the engine noises don't seem too varied from car to car, but it's not that big of a problem considering that this isn't a simulation.  Rumble Racing is all about fast arcade-styled racing and it does what it intends to do just about as well as possible. There's not another four-wheeled racing game that moves nearly as fast, and it's arguable that the speed you get with the Elite class cars is comparable or even a cut above the breakneck speeds offered by the top of the line vehicles in any of the Wipeout titles on PlayStation. The developers have done a perfect job of making tricks an important aspect in determining your success, so they're not just there for show. This combined with the raw number of unlockable goodies and the numerous single player and multiplayer play modes available all add up to what's an extremely deep and replayable racing game. Rumble Racing is clearly one of the best, if not the very best, racing game that's currently available on PlayStation 2.", "date": "Apr 24, 2001"}