{"name": "Project Justice", "name_review": "Project Justice", "ref": "https://www.ign.com/articles/2001/05/01/project-justice", "text": "Fighting gamers can really be an elite bunch; whether they're talking about the float mechanics of Virtua Fighter, the counter combinations in Tekken, parrying timing in Street Fighter III, or even juggle combos of Marvel Vs. Capcom II, sometimes we take fighting games WAY too seriously.  Even I'm a bit of an elitist when it comes to fighting games - a ~fighting game snob~ of sorts.  Sometimes, I just want to play a fighting game that is just plain fun, a game that doesn't take itself too seriously, but still has a solid gameplay elements.  Games like Waku Waku 7 and Groove On Fighting are great examples of what I'm talking about; fighting games that are just plain zany but somehow incorporates a solid gameplay engine that makes the game enjoyable.  And joining the fray with its with over-the-top special attacks, a crazy high-school theme filled with unique character designs, and a fun fighting engine are the experts of 2D fighting games, Capcom, with their newest Dreamcast title, Project Justice.  Following the Rival School series first seen on the PlayStation, Project Justice is a 3D fighting game that takes place in one of the most dangerous settings we can imagine.. .that's right, back in high school.  Twenty characters are readily selectable and they range from a baseball slugger, gang members, club presidents, and of course, cheerleaders.  Many of your favorites from the Rival School series are found here with new additions including Momo the saccharine sweet tennis player, Yurika the violin player, and Zaki a female gang leader who probably has Hannibal Lechter in her family.  The story revolves once again, around Justice High School; the events from the previous Rival Schools have passed and the students are back to their usual high school activities...  but something is amiss!  Respected students have been seen attacking innocent bystanders and the new student, Kuro, has some evil plans in his mind.  Take a team of students and do what any teenager skilled in the martial arts with unnatural leaping ability would do  an afterschool fight!    One of the most noticeable differences is obviously the visuals.  While not trying to enter the arena of a Soul Calibur the graphic quality of Project Justice is pretty good.  Nice 3D backgrounds, and some fun-looking character models really give this game a distinct look.  With the power of the Dreamcast, you get a cleaner more colorful version than the Rival School series on the PlayStation.  And in the at sense, it's a bit disappointing because overall, Project Justice isn't really pushing th power of the Dreamcast.  Special effects are above average; they're basically the same effects from PS version of Rival Schools, but just a lot cleaner.  Basically, they've took the Rival Schools game and optimized it for the Dreamcast.  And I've always love the 2D artwork of this series, and it really stands out in Project Justice ; the game makes use of the 2D artwork quite frequently to give it a real ~comic book~ feel. Project Justice has a pretty solid fighting engine, but as I stated above, this game does not take itself seriously.  If you didn't know that from the wacky character designs, you'll definitely notice it when playing the game.  Whether it's serving up flaming volleyballs, the powerful flashes of a camera, or getting smacked around by a tennis racket, the attacks only get wackier as they get more powerful.  Sure, you can stick to your basic weak and strong punch and kick attacks but it's so much more fun performing the Street Fighter standard special attacks.  And then comes the team up techniques and those that have played the original Rival Schools are in for a real treat. Project Justice allows you to pick three team members so you have a choice of two team-up techniques instead of one!  More importantly, if you're the recipient from an enemy's team up technique, you can actually challenge it!  While being attacked in a team up technique, so long as you have your Burning Vigor Gauge (the meter at the bottom of the screen) filled up to two levels, you can challenge the team-up attack.  When this happens, one of your partners faces off against the remaining third partner of the enemy and if you deliver the first strike within the time limit, the team up attack will be countered!  And since there's three team members, Capcom thought it would be even crazier to add triple team up attacks... of course, they require a full charged Burning Vigor Meter, but getting one off is certainly worth seeing it.  As much fun as it sounds, Project Justice does have a few bad marks.  While there are a few extra characters to unlock (and yes, bouncy Tiffany is one of them), you can only watch the hilarious team up techniques over and over again for so long.  Replay value is a bit lacking, especially since they took out the cool board game from the import version.  While the game sports a Training mode, League Battle Mode, Tournament mode, and an Extra mode (gallery and music), it's not really enough to keep me coming back.  There's also not a whole lot of depth to this game; the combo system is very simple and the timing to counters is very easy to learn.  While I'm not exactly a fighting guru, even I was able to learn 20 plus hit combos in a matter of minutes.  Still, if you're having a recess between a Dreamcast RPG or Phantasy Star Online, Project Justice delivers hilarious fighting action for those that never took high school too seriously.  --Anthony Chau, IGNDC", "date": "May 1, 2001"}