{"name": "Myst III: Exile", "name_review": "Myst III: Exile", "ref": "https://www.ign.com/articles/2001/05/07/myst-iii-exile-3", "text": "The Myst series is certainly surrounded with its fair share of hype. Myst and its sequel Riven are two of the best selling games over any platform of all time. In fact, its so popular that they tried to cash in on a shoddy realtime 3D version of the original. The original team at Cyan has moved away from the series in search of new territory and handed the torch over to Presto who are known for games like the Journeyman Project. And they did a pretty good job. The visuals are still real purty like and the puzzles can be challenging, but when it comes down to it, even with the added effect of the 360 degree panning, the game is just another puzzle/adventure game, even if it is a good one of those.  I'm going to skip most of the mumbo jumbo here because pretty much everyone that plays games has heard of or played at least a little bit of the Myst series. Basically it's a point and click adventure game that puts you in the role of a man stuck in some very strange worlds. And to get out and complete the adventure, you've got to get through some incredibly elaborate puzzles. But a big part of the appeal of the games has always been the incredible otherworldly designs that pervade the worlds.  But lets start with the story. The universe of the Myst series is built around a creative mythology where certain people have the power to create worlds with pen and paper. These worlds, called ~ages,~ can be visited via linking books. Place your hand in the book and zappo, you're in the world you wanted to go to. The worlds you travel to in Myst were created by one of the D'ni named Atrus. The story follows that his sons went about wreaking havoc on the various worlds. Riven took a little skip in that story with Atrus and his problems with his father. Now, in Myst III, we're back to more problems caused by Sirrus and Achnar. At the beginning of the game, you find yourself talking with Atrus in his study about his new creation where his people, the D'ni, will try to rebuild their society. While you're talking, a strange man bursts into the room, steals the new book along with the D'ni inside of it, lights the study on fire, and then jets into another linking book. You, being the heroic sort of person that you are, follow him as quickly as possible.   Once you arrive in the new world, the game begins in earnest. You'll find yourself on a training island of sorts that Atrus set up for his sons. You know this from his journal, which you received before that guy went fire crazy. This beginning island is really just a starting point for each of the lesson ages in the game. This first age, called J'nanin, has several puzzles to get into the three lesson ages where you find clues that will allow you to chase after the angry man and get your book back. Along the way, you'll find another journal. This one is Saavedro's and will outline a bit of what this guy is all about. The book is missing some pages that you'll find scattered about the levels that will give you clues to solve puzzles as well as fill in some of the story's blanks.  Once you've thought your way through the puzzles on J'nanin, you can jump into the lesson ages, which Atrus explains more about in his journal. The three worlds are all very different and all very pretty in their own way. One of the lands is a very Jules Vernish type area with strange devices. The second is a land fairly hard to describe, but dedicated to teaching the need for delicate balance in the world. The third is an island without any machines. Plants are actually used as devices with some used as magnifiyers and some as staircases and some as spyglasses... It was a very strange world that fit together in a chaotically reasoned out way, which worked perfectly with the theme of nature.  The visuals in each of the levels were just as great as they've always been, even if I couldn't find any way to go higher than 640x480... so sad. But aside from that, the pre-rendered art is just as spectacular as always. And one of the first things you'll notice is that you can now view all of that art with the new 360 degree panning feature. This isn't like a first person shooter where you can just walk around, but you can spin the view in every spot you stand in the game. It certainly doesn't detract from the enjoyment. All of that very unique and alien architecture and design found in the series is still there, but now you can really get a good look at those things that were always just out of sight in the first games. And there's the added incentive of worlds that are a little more alive than they used to be. Water ripples, birds fly around in the background... Okay, so it's not that much more alive, but at least they did something.  Now it's kind of hard to decide whether this is a good thing or a bad thing, but the puzzles in Myst III weren't nearly as difficult as its predecessor. The Myst series has been known for its frustratingly hard puzzles in the past (see the 80% of people that didn't finish Riven) so a small drop in difficulty from Riven back to the difficulty of Myst isn't really unappreciated. This isn't to say I wasn't challenged by a couple of the puzzles, but several of them could be completed through trial and error, and others took only a modicum of brainpower to find my way through [That sounds about right for Dan -- Steve]. In fact, the only ones I really had a problem with were the puzzles where I should have been writing things down. Just remember to jot info down on anything that you can focus on, or has some kind of animation and you should be fine. That said, I still had a tough time with a couple of the puzzles.  The great thing, and the biggest reason that the puzzles were a bit easier than Riven, is that all of the islands and puzzles were self contained so that you could actually see things change when pulling levers and pushing buttons. There wasn't any of the ~pull this lever to activate some crazy thing all the way on the other side of the island~ crap. Very happy about that.  Throughout the game, a dynamic score that changes with the mood of the game will accompany you. It's always pleasing to listen to, especially since the music comes in tracks so that it changes all the time so you aren't listening to the same few songs over and over and over again. The music is always nice and ranges from dramatic to mysterious and can really bring you further into the game. Unfortunately, it seemed to have a couple of bugs in the system. I never crashed, but the music did jump really suddenly a couple of times giving the effect of the record being turned off all of the sudden with that scratching noise that makes everyone jump and groan.  The funny thing here is that, no matter what I say here, millions are going to flock to the store to pick up this newest brainteaser. And while all of us here at the office are probably a little biased as there isn't much gameplay in games such as these, Myst III: Exile will undoubtedly please fans of the series. But on the other side of the coin, the lower difficulty level might be a downer for those that managed to finish Riven. Either way, Presto did a pretty good job with a notable addition to the series.  -- Dan Adams Want to share your opinions with the world? Talk about it on the IGNPC message boards,  orsend some mail to IGNPC about this story. I can't see myself recommending Myst III: Exile to anyone at any time. If you wanted to pick it up for Windows or Mac, chances are that you already have or will (especially now that it's dirt-cheap), and console adventure fans should find it almost worthless. Possible to own only by the remote chance that a cheapskate family member sees it in a bargain bin, it's in your best interest to steer clear of this one and wipe your memory of anything even remotely associated with it.", "date": "May 7, 2001"}