{"name": "Mace: The Dark Age", "name_review": "Mace: The Dark Age", "ref": "https://www.ign.com/articles/1997/10/04/mace-the-dark-age", "text": "A year after its release, Nintendo 64 is still without a well-rounded quality fighter. Atari Games and Midway (the same duo responsible for San Francisco Rush and Wayne Gretzky Hockey) have once again teamed up - this time to produce the Nintendo 64 port of the arcade fighter, Mace: The Dark Age.    Mace pits ten main characters (plus two bonus and two more hidden) in a battle to recover the Mace of Tanis, a magical artifact that can restore order and peace to their lands which have run rampant with disease, murder and chaos. Behind this corruption lies Asmodeus, a dark magician who thrives on the anarchy and pain of the world and who, incidentally, also holds possession of the Mace. As expected, the best fighters from around the medieval planet (Europe: A.D. 1300) are gathered and dispatched on a quest to recover the mysterious Mace, and thus, the game begins.   If we were basing our review on looks alone, Mace would receive very high marks indeed. The graphics are noticeably crisp, boasting anti-aliased characters and backgrounds. The art and character design of the game is also very well done and equally as impressive, with a variety of fighters to choose from. In addition, backdrops are partially animated, with moving clouds, burning fires and flowing streams. However, there are problems, the biggest of which lies in character animation and framerate. Possibly because of the attention to detail, character animation is sometimes choppy and, because of that, gameplay suffers. Also, some backgrounds have the problem of clipping improperly and overlapping now and again, but that's really nothing more than a minor annoyance.   There is a grand total of 14 fighters, including two bonus and two hidden. The list consists of: Al Rashid (an Arabian assassin), Countess Taria (priestess of black magic), The Executioner, Koyasha (Ninja), Lord Deimos (an evil Knight), Mordos Kull (warrior for hire), Namira, Ragnar Bloodaxe (a beserker from the icy fjords), Takeshi Tsunami (Samurai), Xiao Long (Blind monk),  Sir Dregan (dead warrior), Ichiro, Gar Gudrunson (dwarf) and Hellknight (a demon from hell).   Each character can perform a number of different moves and combos as well as fatalities. The fighting system is a lot like Street Fighter in that there are projectiles and spells as well as close battling. Koyasha, for example, has the ability of throwing an electro-shuriken, which is very effective, but can also sweep into an opponent, spin kick and finish with an ankle bite. All in all it's not a bad fighting system.   Control is sluggish and feels heavy at times. We're not entirely sure if this is how the development team wanted it or if framerate and animation drops are playing a hand. Don't expect a quick, fast-moving fighter, though, as Mace just isn't it. The game isn't slow, but it's not exactly fast, either. If you were happy with Dark Rift's pace then Mace should be equally as satisfying.   Mace also includes a practice mode in which players can battle it out against a dummy (named 'Spanky). No time limit or boundaries -- just good old fashioned violence the way it ought to be: one-sided.    The audio in mace is better than average, with songs that fit each stage. There are over 14 different music cuts and 333 sound effects. The reason we know this is because Midway has also included an audio option in which players can listen to all the songs and play with all the effects..  Mace: The Dark Age probably isn't going to blow anybody out of their seats. The graphics, despite a few minor drawbacks, are clean and good looking. The gameplay is standard and unoriginal, but once again, not bad. When it comes down to it, Mace has succeeded in beating Dark Rift as the best fighter for Nintendo 64, but that's nothing to celebrate. A little more time perfecting framerates and tweeking control could have gone a long way.", "date": "Oct 4, 1997"}