{"name": "CART Fury", "name_review": "Cart Fury", "ref": "https://www.ign.com/articles/2001/06/01/cart-fury", "text": "Midway hasn't made any real big surprising moves lately, and Cart Fury is perfectly in line with this pattern. Much like Hydro Thunder and even a touch like Arctic Thunder in its simple-to-use, easy-to-play, and fast-moving, coin-op style, Cart Fury essentially dumbs down real CART (Championship Auto Racing Teams) racing so that anybody and hopefully everybody can have a go at the world's fastest racing sport.   If you have played the arcade version, you'll find no surprises here. Cart Fury is a wonderfully fast racing game that puts gamers in the position of racing against a fierce group of competitors, and enables them to collide, crash into full-on pile-ups, and to deploy power boosts to speed by the competition. The game is fun for about two hours, and only if you're easily amused, but it's poorly constructed, despite the extras that have been added for the home market. If I were to recommend it, I wouldn't know to whom I would, because I don't know anyone interested in shallow arcade games that feel suspiciously like they've been recycled from former coin-op racers.   Gameplay  You played the arcade game, now you have the chance to play the home version. It's just about the same, with a few extras. Cart Fury is a really a weird hybrid, but it certainly works better than say Nascar rumble. The racing is fast, which is what gamers and racing fans like, and the cars are well designed and even prettier than I expected. The racing itself is right on the money in terms of being like the arcade version: The loose, bouncy shocks and tight handling is still on target, and the framerate appears to be right at 60 frames per second. The AI is still very random and occasionally annoying, and as you'd expect, gets increasingly so as the difficulty levels are ratcheted up.   If you liked that kind of drunken-style driving, then this should be you're thing. Personally, this fashion of racing really does belong in the arcade only. I mean, if Midway had put some kind of creative effort into truly making Cart Fury work on the console, in the same way that Namco has consistently transformed games such as Tekken and Soul Calibur to the home, my enthusiasm level would be much high than it is now. But as it is, in most respects this crude port is painful to look at and play.   Strangely enough, even Midway can overcome its many development weaknesses. One of the things that makes Cart Fury fun in its own particular way is its light approach to racing. This is not in any way related to Gran Turismo. The game is simple, unsophisticated, straightforward driving, with little skill required. In fact, almost no skill of any kind is required to beat this game in easy, medium, or even in the hard settings. You mom and your son, or your friend, who has never played a videogame in their life, can play this game in about two tries. It's arcade friendly I'll say, right to the bone.    The best thing about the game is the Super Boost, the massive collisions, and the enemy AI who challenges you to beat him. The regular boost is given at each check point or after each lap, and if you beat a set required time set, you earn the Super Boost, an ultra powerful jolt of speed that makes pulling up into the top three cars a breeze. The massive collisions usually happen near the beginning of the race, and players have to dodge flying parts and cars to avoid blowing up themselves. And the selective enemy who challenges you is a neat extra. He basically challenges you to beat him, and he's kind of a wild card driver that may beat you in the last seconds, but he's always gunning to beat you or force you into a crash. It's a nice touch.   But there are problems everywhere, if this game is to be taken seriously. The AI is where I'll start. Half the time it's easy, and the other half it's brutally mean, despite any kind of consistent driving approach. The AI cars seems to be on a rubber-band loop that jettisons them past you, and then about 30-45 seconds later they let you catch up, regardless of whether you're on a tight turn, a snaking loop, or a slick straightaway. Or regardless of whether you have used the last bit of your sacred Boost power.    So, the AI is weak, to say the least, but what worse is that the learning curve is about as quick as rabbit sex. The game's skill set is absolutely flat as a pancake. So, once you have mastered the driving (five minutes into the game), that's it. When you win, you're never sure why, and when you lose, you feel like you were cheated. The required ~skill~ is just to stay on the track -- and out of collisions -- but you'll find that they might just seek you out regardless.   The interface and the menu system is just short of a tragedy. It looks like it was cobbled together with Hubba Bubba chewing gum and Meow Mix cat food crumbs. It's boxy, without style, and crude, and in some places in just doesn't take the extra step to look anything but lazy design. And the gratuitous women in short pants and leotards? Man, Midway, the '70s -- and the '80s -- are over. I like my sexy women and all, but you guys really have to wake up. This stuff is just stupid.   Graphics  Cart Fury shows off the development team's ability to make a racing game really fly, with lots of background textures, dozens of cars on screen at one time, and to show some really cool multi-car pileups. The car designs are quite nice, and it looks like, despite the arcade-style driving, the cars are seriously modeled from the real CART racecars themselves.   The graphics on the whole, however, aren't anything special in comparison to the kinds of amazing games we have seen in the last few months. The cars look good, but they don't look great. The backgrounds are finely detailed, and they're often pretty, but the game suffers from a subtle already-been-there look to it. I can't tell you how many times I have seen this game before in some slightly different vein. The whole concept reminds me of Off-Road Thunder, Arctic Thunder, Cruis'n USA, etc., etc. There are no special effects or technical stunts being pulled off here, and there is nothing that strikes the eye as totally unique. The whole graphic approach appears to have been to remain common and uninteresting.   Sound  When it comes to the sound department, Cart Fury is just embarrassing. The sound is quite poor, to put it nicely. What happens in Cart Fury is that no matter how much you adjust the sound settings, the music is low. It's louder and more noticeable in the menu system, actually, and then it's just repetitive second-string hip-hop or something worse, so it may be a good thing that you can't hear it while playing.   But it's the sound effects that are the most ludicrous. Every time a car passes, you literally hear the same exact sound, regardless of the speed of the car, or your distance away from it. It's just a sampled car passing sound that is as silly as it is ordinary. I could go on, but the sound quality doesn't deserve more words. In short, the sound production team on this game appears to have been given about $5, and it clearly wasn't enough.I have played this game countless times before, it just had different textures and titles. Midway's Cart Fury is a mediocre arcade game that has little to nothing to pull it out of the small but growing racing lineup on PlayStation 2. It's fast, it's got some neat pileups, but it's shallow, repetitive, skill-less, and has screwy AI. I would not buy this game unless I was desperate for any kind of racing game, and I mean desperate. And I'm a sad online reporter and all, but I'm not desperate for crappy games.Don't waste your time with Cart Fury. If you are in any way interested in driving games and you make the mistake of buying it, you'll just feel like you've been cheated out of $49.", "date": "Jun 1, 2001"}