{"name": "B-17 Gunner: Air War Over Germany", "name_review": "B-17: Air War Over Germany", "ref": "https://www.ign.com/articles/2001/06/04/b-17-air-war-over-germany", "text": "In August 1982, Mattel released B-17 Bomber for the Intellivision with the Intellivoice cartridge, making it one of the first home video games to feature voice. It was loads of fun, and pretty damn innovative for its time, an era when downright ugly games like Atari 2600 Pac-Man and Atari 2600 E.T. ruled the store shelves.  Now, along comes B-17 Gunner: Air War Over Germany, a title developed by SunStorm Interactive and published by Infogrames. The developers also consulted with the 390th Bombardment Group in Tucson, Arizona on the game. The title has some decent graphics and sound, but amazingly, is less fun to play than good old B-17 Bomber on the Intellivision. Not only that, but it's not very realistic, either.  As you prepare to jump into battle, the menus are nicely done and very informative. If you're inclined to, you can read through a few extra menus to learn more about the plane you'll be flying -- the B-17 Flying Fortress -- and the German Luftwaffe planes you'll be fighting against. The music during these menus is also very well done, and gets you in the mood to head out into the wild blue yonder.  The actual game starts out with you already in the air, ready to shoot down the bandits who are trying to bring your bomber down. In other words, you don't get to see yourself taking off at all. This is fine, but it sort of brings the sense of realism back a couple of notches.   Once you're in the air, you'll see enemy fighters approaching from all sides. It's your job to switch around to the various gun positions in the plane -- there are six overall -- and try to shoot these bad boys down. It's much harder than it looks. You've got to account for giant lead times because your bullets are so slow, and the planes, comparatively, are so fast.  The graphics of the plane are okay, but not the most realistic you've seen. This again, dampens the realism of the game, which you'd think the developers would be striving for, especially in a game of this sort.  Clouds you'll fly through on your way to the target are well done, and nicely transparent/fluffy. Unfortunately, the terrain below is less well drawn, and is mostly just a mass of colors and textures, without much definition. The biggest trouble with the graphics are the slowdown that happens whenever you get two or more planes flying by; it tends to make it a little difficult to hit them when the screen is jumping around, back and forth.   Some big problems with the game are the fact that you can shoot at your own aircraft -- which are following you in formation -- and apparently have no effect on your mission. During the game, I shot down several of my own planes, and still succeeded in the mission, somehow.  That's not to mention that you can conceivably fire your machine guns for as long as you want without overheating them. Now, this is good in the sense that it makes it easier for you to hit the enemy fighters. But once again, it's not very realistic.  As enemy fighters hit your plane, you'll take damage, of course, with your gunning positions being taken out one by one. It doesn't seem like the enemy planes can actually bring your plane down altogether, as I took a lot of damage without ever being sent plummeting to Earth.  Sound in the game is decent, but a little repetitive. You can only hear the rat-ta-tat-tat of machine guns for so long before it starts to get old. Chatter among the crewmen on your plane is fairly good with excellent voice acting, but also tends to repeat itself too much. I mean, how many times can you hear ~You son of a bit ...~ before it becomes tiresome.  Another complaint is about the actual bombing runs, when they happen. As you approach the target, the computer automatically switches you to the bombardier view, allowing you to unleash the bombs when you see fit. This is all fine and good, but it seems like you should be given more control over when you go into the bomb view.  Bombing graphics are not very good, either. Obviously, you won't be able to see the ground and buildings below from the bomb view very well, because you're so high up. Still, it would have been nice to be able to see what you're blowing to bits with a little more detail than the game provides. That's not to mention that the explosions after the bombs hit are pretty poor. Just a puff of gray ~smoke~ is all you see to let you know you've hit the target. When the game decides the mission is over, it simply stops you in mid-air, and loads the results screen. You don't get to see yourself landing. And then, you'll get to see if the mission was a success or failure, and how many enemy planes you've shot down. You'll also see your point total for the mission.  It seems that in games like this, you've either got to decide to go for realism or arcade action, since those likely to play the game are mavens of either this era or this plane, in particular. And because of this, they want the closest thing to the real experience. To fall down on the realism level of the game seems to be the worst thing the developers could have done. The realism isn't scaled down enough to permit arcade style gamers to enjoy the game either. It seems like the developers tried to walk a fine line between arcade action and realism, and fell flat on both levels.  The game offers no multiplayer options, and judging from what we've seen in the single-player experience, you probably wouldn't be able to get anyone else to play it with you, anyway.  -- Mike Morrissey      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Jun 4, 2001"}