{"name": "Spider-Man 2: The Sinister Six", "name_review": "Spider-Man 2: The Sinister Six", "ref": "https://www.ign.com/articles/2001/06/08/spider-man-2-the-sinister-six", "text": "At the end of the Game Boy Color's tenure, handheld fans are sure getting their money's worth. Nintendo brought out the two excellent Legend of Zelda Oracle titles, and now Activision is adding its excellent parting gifts, including Spider-Man 2. Sinister Six is the sequel to last year's excellent Spider-Man platformer, a title developed by Vicarious Visions. This year's offering is done by Torus Games, and improves on everything the original did well.   Features 18 levels Brand-new moves Password save Only for Game Boy Color  The action is very similar to his last handheld adeventure. Spidey is on the loose in the rooftops of Manhattan, and everything that makes him a spider/man is on display here. He can swing on ropes of web with the greatest of ease, cling to every imaginable surface and fight baddies with an assortment of punches, kicks and swinging attacks. He can even spin a web ball to ensnare his foes before he goes in for the kill. The control this time is even better than in the original. The jumping and swinging function is a bit more responsive and Spidey cling to literally everything on the map. It's obvious that the cityscapes have been set up with this in mind. There seem to be even more ledges, more walls, and more hard-to-reach precipices in this one.  The web ball feature has been updated as well. Now, in order to trap enemies in your web, you'll have to keep your web shooters full of fluid by collecting spider icons scattered around the map. This innovation is nice, because last time out you could tie up literally everyone. Now, you have to employ strategy and hold on to your juice for the boss fights. The fighting is a bit different as well. Torus has added in comic book style ~Whap~ and ~Blam~ balloons during fight sequences. This made the game feel decidedly Batman to me, but whatever. Artistic license.  In the original game, Spidey was pretty much free to roam throughout the city at any point during the game. Encounters with master villains occurred in places you had already been, and almost the entire world was available to you at all times. This game puts you more ~on tracks,~ which is both good and bad. Part of the appeal of the last game was the fact that you really felt like you were kicking around town fighting crime and searching for clues to lead you to the next boss. Now, the game makes it quite obvious where you need to be, as your Spider sense flashes to point you in the right direction any time you stand still. This urgency is okay, but it definitely pushes the pace of the game. More casual crimefighters (like Spidey himself) might find this slightly annoying.  Spidey looks great. It's amazing to me that they could get him to look so great on such a small screen, but then again, I am always mystified when these e-smiths weave their computer magic. Torus has infused personality and a good deal of animated realism into the webslinger, and that is no small feat (ha, ha, hardy, err, em).  The environments are also every bit as vibrant and beautiful as the original's. Since it is set in many of the same places, they actually look similar. In fact, the first couple of levels feel lifted right out of the first game. However, as the levels progress on, the game begins to differentiate itself. The game also sets itself apart in boss battles. While Spider-Man had a couple of repeating duels, including a trio of Carnage appearances, this one actually offers up the Sinister Six. And they're old school Spidey foes, too. Doctor Octopus. Sandman. Mysterio. While the boss battles themselves were oversimplified, it was nice to see these guys still sticking it to Spidey (or the other way around).   The average baddies you face tend to be a bit weaker here as well. One of the arguments against the original is that the villains that patrolled the Manhattan streets were too tough... it was too easy for these glorified punks to take down our superhero. To that I say, ~Ever been to Manhattan?~ Seriously, though, this helps to soften the learning curve, making this game more accessible than the last. Overall, the game is much easier than its predecessor, which is probably good. Some of the challenges in Spider-Man were practically unbearable.  The music is nothing to write home about and the story is traditional comic book fare, but the game still manages to be one of the best platformers on the GBC. Ultimately, this is a nice closing chapter in Spider-Man's saga on the Game Boy Color, and a great appetite-whetter for the Spider-Man offering on the GBA.", "date": "Jun 8, 2001"}