{"name": "X-Men: Wolverine's Rage", "name_review": "X-Men: Wolverine's Rage", "ref": "https://www.ign.com/articles/2001/06/08/x-men-wolverines-rage", "text": "Marvel Comics' Wolverine has made his share of appearances in the video game world, but since dulling his blades on a few SNES and Game Boy bricks, Logan has stayed in the folds of his X-Men team for videogame outings. That all changes with Activision's latest offering, a star vehicle for old Sharpy, developed by Digital Eclipse. But is it any good? Well, it isn't going to win any platformer of the year awards, but it doesn't embarrass itself like some previous X-titles (Mutant Academy, anyone?). Features 20 levels Several attacks to utilize Password save Only for Game Boy Color.  The game is a multi-platform hack-n-slash adventure of sorts. Wolverine is loose in the city and he's got crime to fight in the only way he knows how: by cuttin' up everything in sight. Wolverine's Rage capitalizes on the shortcomings of the GBC's two-button system by only giving Wolvie two things to do: 1) Hack at stuff with his claws and 2) Jump. This limited approach seriously hampers the number of things you can do with the game. Literally all that takes place is jumping and hacking. If you're not interested in this kind of simplicity, turn back now.  However, if you're a diehard Snkkt addict, you'll like what they've done with Wolverine. Our favorite pointy-haired mutant looks as good as he possibly can on the GBC. His animations are great (especially when he slips into rage mode) and his crouched walk is excellent. They've got him in his classic yellow and blue threads as well, which is a great decision. It would be cool to unlock other costumes, but oh well.    If I have one complaint with the graphics, it's with the enemies. They look fine--in fact, very similar to baddies from the original Spider-Man--but their actions are often tough to see. Since lots of the environments are dark, it's often tough to pick up projectiles and bullets head your way. And it's a bit difficult to tell when you're connecting on your attacks as well. Since Wolverine has to be really close up to attack, this is a serious drawback. The environments themselves are richly detailed. The city he moves through looks appropriately burned-out and desolate. Like some of the other Marvel titles on the system (Spider-Man 1 and 2, most notably) the environment plays a big factor here, and it definitely doesn't disappoint.   Neither do Wolverine's mutant abilities. In addition to the ten-inch adamantium claws that spring from his knuckles, Wolverine possesses the ability to slowly heal himself over time. This is not lost on the creators of the game. If you stand still and avoid danger, Wolverine will slowly heal. Since each level is timed, you only have the opportunity to fully heal approximately once per level, but it's a nice bonus. Of course, the hacking and slashing is there, but the game also provides a look into the heart of the berserker. If you press the attack button several times quickly in succession, Wolverine will go off into a rage, turning into a flurry of aggressive metal. While the rage is cool as all get out, it is impossible to control. Once you go into a rage, you'll take down everything around you, but you'll likely fall off of the ledge you're on and have to work your way back to where you were. There's a lesson here: berserker rage is a double-edged sword. Not only do you lose control of Wolvie while he's going off, but the rage drains health from Logan. It's a cool maneuver, to be sure, I just wish it was a little more practical to use.  The game is actually pretty tough to beat, as the common enemies in the game can be pretty chippy and plentiful. Luckily, there is a Password system and the opportunity to continue. Each time you begin again, you are given five lives to work with, so there's some salvation in that.  There aren't many sounds in the game except for the steely sound of Wolvie's claws, but the accompanying music is pretty good. Think Beethoven's Moonlight Sonata mixed with the original Mega Man theme. The best thing about it is that it flies slightly under the radar and doesn't quickly get old. So it's got that going for it. If you love Wolverine, it's quite likely that you'll love X-Men: Wolverine's Rage. If you don't know Wolvie from Adam, you'll probably see this as just another platformer. My opinion: It's mindless fun, and easy to pick up for a quick level or two. If you're looking for a little bit deeper game, try out Spider-Man 2 instead.", "date": "Jun 8, 2001"}