{"name": "Rayman Advance", "name_review": "Rayman Advance", "ref": "https://www.ign.com/articles/2001/06/14/rayman-advance", "text": "If you're going to show off what the Game Boy Advance can do, it doesn't hurt to dig into videogame's past for titles that really wowed 'em back in the day. Ubi Soft chose to revive its 1996 hit Rayman, probably one of the most original and colorful side-scrolling platform games ever created -- and what a conversion it makes on the Game Boy Advance. Not only is this game beautiful to look at, Rayman Advance also fits the portable market amazingly well -- Digital Eclipse has developed a definite winner for the Game Boy Advance's US launch line-up. Features 60 levels 6 different worlds Battery Back-up Only for Game Boy Advance   Mr. Dark, the game's nasty, nasty bad guy has kidnapped the inhabitants Rayman's land: Protoons. These little guys give Rayman his energy -- without 'em, he's just a weak, ordinary guy with no arms or legs. So it's off to trek the land to free the Protoons from their cages.  The game's not over until all the Protoons from the game's six worlds have been rescued. Rayman Advance is, essentially, the PlayStation version of the game crammed into a tiny Game Boy Advance cart. I say essentially, because I'll have to take Ubi Soft and Digital Eclipse's word for it -- I've never been able to play through the original game due to the sheer impossibility of it all. You have to understand, as beautiful as Rayman was on the console, it was downright difficult to play, definitely bordering on the frustration level.  The Game Boy Advance version, thankfully, brings that toughness down to a more playable level. The development team reworked and arranged the levels so as not to make them so cheap in difficulty. The result is a classic 32-bit action title that's more forgiving in gameplay and a lot more accessible for folks who aren't professional platform gamers.  Many players won't see the big deal in the beginning -- sure, the graphics are absolutely stunning, and the characters flow with eerie, limbless animations, but the first few levels are just a prelude to what lies ahead. Rayman can't do much right out of the gate other than walk and jump -- but beyond the initial challenges he'll earn his first ability: punching. By throwing his fist, he can knock enemies out of existence or drop eggplant fruit from their vines to use as platforms. Later on, he'll gain a ledge grapple capability so he can pull himself up on platforms...then comes the hook grab to swing from suspended rings in specific levels, and then comes his helicopter glide. Since he doesn't have his abilities right from the start, earning them actually encourages players to go back to previously completed levels in order to properly finish the game -- several trapped Protoons can only be rescued by utilizing Rayman's earned abilities.  And the level design varies throughout the game, adding to the excellent gameplay -- in some levels, you'll do the standard left-to-right, platform-hopping thing. But later on, you'll hop on the back of a (dare I say it) cute mosquito character that you originally defeat as a world boss creature, flying through the air in a fast-paced challenge. One of the coolest levels include out-hopping a rising pool of water, creating platforms by planting seeds in the ground.  The Game Boy Advance title is absolutely gorgeous, offering multiple scrolling backgrounds with superbly detailed, painted look to them -- this game just shows how much color the Game Boy Advance is capable of displaying on-screen. Everything animates with life, from the enemy characters to the worlds' surroundings. And Rayman is absolutely huge -- the game is using a pixel-for-pixel conversion from console to handheld, and the Game Boy Advance doesn't have the resolution to show the whole screen at once.  The game's not perfect, and it's obvious that the development got a little more ambitious with hardware that's new territory -- most of the game moves smoothly, but when too many sprites get on-screen, the pace hiccups with choppy scrolling. Some sprites also have an awkward pixelation to them, as if they were scaled up from a low-res image to make them appear larger than they were supposed to be -- this is evident in items like the level checkpoints, where the picture board is so blurry it's hard to see what it actually is.  Rayman is still a tough, challenging game, and thank god Ubi Soft was smart enough to include the battery save in the cartridge -- the design encourages bouncing back and forth through levels already created, and this would have made one mess of a password system if the publisher decided to play it cheap with its first Game Boy Advance title. Plus, having the battery enhances the portable experience, as players can zip through a level, save the game, and come back to it at a later point in time.    Rayman rocks on the Game Boy Advance -- if you want a title that'll show Game Boy Color fans a reason to upgrade the system, you can't go wrong with this game. Graphically, this game tops 'em all -- but be warned of the minor processor hiccups through some of the more intense worlds.", "date": "Jun 14, 2001"}