{"name": "Madden 2000", "name_review": "Madden NFL 2000", "ref": "https://www.ign.com/articles/1999/09/03/madden-nfl-2000-4", "text": "In ten years, Madden NFL games have been the standard by which all other football sims are measured. After a rocky start with Madden 64 two years ago, the team at EA Sports and Tiburon got it right on the console with Madden '99, which may still be the best football sim on the N64. This is because with Madden 2000 the franchise takes a step in the arcade direction with newly done graphics and boost in overall speed. It doesn't have the same NFL toughness and details that we've come to expect from Madden, but it's still one of the smartest games going and a whole lot of fun to play.   The Facts  Increased frame rate and overall players speed. New on-field graphics including nets behind goalposts, TV-style yard markers and personnel on the sidelines. New route-based passing system will allow passer and receiver to run ~timing patterns~ where the ball arrives just as receiver breaks open. Expanded franchise mode will allow multiple users to trade players and juggle salary caps over multiple seasons. Redesigned high-resolution graphics will include proportionate heights and weights for the various positions. Redesigned physics will factor in the heights and weights of the players when ball carriers and defensive players collide. (A punishing fullback should be able to flatten an undersized defensive back.) New Player Hot and Cold streaks. New enhanced audio and play-by-play calling. New player taunts and animations. Improved juke move and running game.   Gameplay The game plays smoother and a lot quicker than '99. The first thing you'll notice is the difference in the running game. In M99 it seemed only the way to consistently gain yards on the ground was by bouncing to the outside and outrunning the defense to the corners. For 2000, even mediocre running backs can take advantage of holes created by the offensive line. Great backs like Eddie George will not only hit the hole faster in M2000, but once through, they'll keep their balance and have defenders bouncing off of them left and right once you get their momentum going. For all of the realism that M99 gave us, the difficulty in using the running game changed the way we approached the offense and forced us to rely on the pass. Just like in the NFL, a pass-oriented offense may be fun to watch but it makes it tough to win a game. <br  The running game isn't automatic. You'll still have to pay attention and juke and spin and speed up at the right times to maximize your effectiveness. Following your blockers and waiting for your linemen to pull and make their blocks is key as well. The main differences is that the more responsive control will allow you to throw a move very quickly and your momentum can power you through or around incoming defenders.  The passing game is still very good. You'll have to call the right plays and make the right reads just like real NFL coaches and quarterbacks to be successful. There are a handful of new gimmicks that have added a lot to the passing game. Throwing on the run is a huge addition to the passing game that will allow you to fire the ball without your quarterback setting his feet first. In M99 you had to allow your QB enough time and space to set up and throw under pressure. Now he can fling while running for his life, but it definitely won't be the prettiest pass you've ever seen. In fact, if you try to go 50 yards downfield while throwing on the run, don't be surprised if your pass goes way out of bounds. It's a great feature to have for the new wave of young mobile quarterbacks like Jake Plummer and Kordell Stewart. Those guys are always making big plays on the run.   The new Hot Routes feature is a great addition. Rather than calling an audible at the line of scrimmage and changing the entire play, you can change the routes of the individual receivers with a clever little control stick and button sequence. After selecting your play you hit the C-up button and the audible icon will pop up. You hold down the button of the receiver whose route you want to change and then press the control stick to determine the new route you want him to run. Up will send him on a fly route, down is a curl and left or right will send him on an out or in pattern depending on the receiver's location on the field. You can change the routes for every receiver if you want but you've to remember the new route assignments and you have to change all of them before the play clock runs out. This is an outstanding bit of NFL realism that football gamers didn't even know they wanted. In the NFL a receiver changing his route at the line of scrimmage is often done with just a nod of the head or wink of the eye to the quarterback. It can take years for a pass catcher and quarterback to develop that kind of rapport with each other. In Madden 2000, you can have third year man Plummer hitting rookie wideout David Boston on improvised routes on the first play of the season.  The Madden Challenge is another great addition to the game. You can unlock secrets of the game like hidden stadiums and such by completing in game tasks and answering trivia questions for points. Accumulating more points will lead to bigger and better secret codes that can be saved to you use profile or simply input each time you play the game. An added twist to the Madden Challenge is that you can pick which level of the Challenge you want to tackle. Just like rookie, pro and all-pro game modes, the Madden Challenge gets tougher and has greater rewards the higher the difficulty level. For example, on rookie level you'll get points towards the Madden Challenge for completing a 30 yard pass at any point in the game. But on the higher difficulties you'll have to finish games with three receivers having caught over 100 yards worth of passes each or have two running backs each with 100 yards rushing. When is the  last time these things happened in an NFL game?  The arcade mode of the game runs a lot like the traditional sim mode. The main differences being fewer plays to choose from and the fact that Andrew Anthony, not John Madden and Pat Summerall, is the play by play man. He's the guy that says ~If it's in the game, it's in the game,~ in those EA Sports commercials. Besides this the arcade mode just seems to have a few more turnovers and ~cheating A.I.~ than the sim game. The extra violent tackles are cool but not quite up to the standard set by Midway's Blitz games.  Graphics  Madden is smoother and quicker because of the new player models. Where the players in M99 were authentic right down to fabric animations on the jersey, the players in M2000 are a little blockier with huge upper bodies and disproportionately small legs. Think Blitz but not as grotesque. They still look and move like NFL players but the fellas look like they've been hitting the weight pile over the summer. All of the details of the individual uniforms are there right down to the tiger stripes on the sleeves of the Bengals' jerseys but they just don't look as sharp and polished and lifelike as the players in Madden '99.   The players in M99 looked so solid that the great tackling and pass catching animations seemed even more remarkable. This year, the animations are just as sweet even though the guys don't look as authentic as their older brothers. The players look a little more angular with sharp elbows and knees. When you get these guys churning around in a big dog pile at the line of scrimmage it can look a little like a moving Picasso painting sometimes.  M2000 has players and coaches on the sidelines during gameplay; a first for a football game on the N64. They're sprites that don't do much besides sit there. This isn't a problem except for the fact that the detail level is so low that they look like blurry cutouts, but in team colors. There are a whole lot of players wearing number 88 that don't seem to have any distinguishing characteristics. The sideliners don't come to life until one of the teams makes a great play. Should you score a huge touchdown or the defense makes a great sack, you'll get a quick little cut scene of the guys clapping and rooting for the play on the field. The best part is EA Sports stayed consistent with the offense and defense placement. If you're playing as the defense and John Randle makes a huge sack, you'll get a cut  scene with Randall Cunningham, Robert Smith and a few other Vikings cheering on the sideline for the play.   The great weather effects are back in M2000. All we're going to say is that we played at a rainy Soldier Field complete with lightning and everything. Late in the fourth quarter Curtis Enis' uniform was all dirty and caked with mud.  Sound IGN64 had a big  problem with the commentary of M99. It was good but there just wasn't enough of it. This time around, Summerall is talking it up the whole time while Madden seems to drop in just as regularly as before. Considering the great announcing gamers will get out of NFL2K on Dreamcast and the various football games on the Playstation, this year's Madden had to step up and show off the N64's sound capabilities.    Summerall is accurate with his comments, calling out blitzes as they happen and even questioning the reasoning behind some plays. Madden himself adds his usual colorful commentary that makes him famous, but it never seems to be enough. You almost want Madden to be on the play by play call just so you can hear what he might say about every play.   The crowd noise rises and falls with the action on the field, but unless you tinker with the individual volume controls it almost seems too low when there's nothing going on. While fans really do keep quiet when the action on the field sucks, in videogames it's nice to hear that consistent buzz and then the big roar when something spectacular happens.  Madden 2000 is a great game and a lot of fun to play but it doesn't offer as complete a package as the superb Madden '99, which deserved a higher score last year in my opinion. The improved running game opens up the offense and will really get you into the strategy of playing NFL football. Great additions like the Madden Challenge and the Hot Route system will give you plenty to focus on if you're a diehard football fan. It's fast and great to watch but the change in the look of the players will have to grow on me. Fortunately the great A.I. is still there to keep me matching wits with the machine and that's always a good thing to have. The omission of classic teams didn't bother me as much as I thought it would since they're the same teams with the same ratings as last year. In QBC 2000 you can build a custom team using some of those throwback players so there's more motivation to have them. Because I'm such a fan of football sims I can be overly critical at times, but from top to bottom, Madden NFL 2000 is a fine representative of the tenth anniversary of Madden football.", "date": "Sep 3, 1999"}