{"name": "Startopia", "name_review": "Startopia", "ref": "https://www.ign.com/articles/2001/06/21/startopia", "text": "Well I just totally lost track of time. You see I was deep in the process of creating a fully functioning wacky little port on a space station in order to grab as much of it as possible before the computer could claim most of the station as its own. The name of the game is Startopia and it's a whole bunch of fun. Mucky Foot has put together a pretty, well designed, interesting, detailed economic/building sim with enough character to attract even the dead guy that tried to take my job.  When first getting into the game, gamers will be likely to just take a breath and say, ~ooh, pretty...~ while zooming in on the various inhabitants of your space station and their activities. The game is just plain beautiful. It manages to combine a really great cartoony feel with the characters and building design while keeping a very futuristic feel with some really terrific textures that look both high-tech and colorfully playful at the same time. Alien design is fairly Star Trekky with most of the beings taking on a 2-legged, 2-armed construction. But unlike Star Trek, it didn't bother me at all. The design of each of the races was diverse enough in their own ways that there was plenty of personality and originality to be handed around after all was said and done.  But don't let the light and slightly childish look of the game fool you. When you get down to it, there's a whole lot to be done here and a fairly difficult computer to do it against. The game is divided into a few parts. You can play through the missions, go into the open sandbox mode against the computer or by yourself, and play against other would-be space station managers over the Internet in multiplayer games.   The missions themselves are failry creative and teach you how to take care of certain things a little bit at a time before they really start laying on the difficulty to make sure that you have all of the basic concepts down. But before you even get into the missions, you can run through the nice tutorial missions that will teach you about the basic controls of the game. They'll teach you how to unpack crates that hold buildings, technologies, droids, and hardware as well as how to build structures, switch between decks of the station, edit the biodeck, hire employees, track the people on your station and all of that good stuff.  Once past the tutorials, which don't take too long and are very helpful if you're like me and don't like to read the manual, you can jump into the missions. These teach you even more about the game by introducing aliens one at a time until you begin to realize what all of their needs and wants are while teaching you about the buildings that they work in as well. For example one of the first missions introduces the Greys, which are those black-eyed guys that you keep hearing are going around abducting people. Well it seems these Greys are the doctors of the galaxy and therefore work in the sickbay. So the mission puts you in the position of being hired by the Greys to start up a new medical station. You'll have to cure 100 patients of different types during the mission while letting very few of them die. Every time one dies, you're penalized with an energy credit (Startopian money) deduction from your reserves. But at the same time, if you manage to keep the hospital spic and span while curing patients, the Grey inspectors will give you a rather tidy bonus for doing so well.  This is general idea for many of the missions. You'll get hired on by whatever alien race and be given a few mission parameters you have to follow. All the while, you not only have to hire employees to take care of running the different jobs -- recycling, security, gardening and the like -- but you also have to be able to keep all of your employees happy and keep travelers rolling in to pad your money bin. In order to keep all of the different creatures happy on your station, you'll need to build recreations such as discos, love nests (pretty much brothels), bars, music shops, etc... All of these will both bring income in and keep your people happy. But on top of that (literally) is the bio-deck where you have a transformable landscape where you can grow plants for resources and create little havens for the various aliens to remind them of home.  But in order to get all of these things up and running you'll have to deal with a pretty nifty trade routine. Once you gain enough to get a star dock up and functional, you can begin trading with the various races that sell some things cheaply and buy other things for more. So get your trading skill cap on because the wily trader that pays attention to supply and demand will end up with a boatload of credits. Until you do get the star dock running, you're going to have to deal with an entertaining if slimy character known only as Arona. He gets one of the greatest voices in video games that I've heard in a while blending a money grubbing edge with a friendly way that just kinda makes you want to shake his hand and kick him in the behind/nuts at the same time.  In fact, pretty much all of the sound in the game was pretty terrific. Sound effects and the strange voices that each of the races spoke were well crafted and entertaining. To top that off, your computer advisor has a pompous yet helpful attitude that never once got on my nerves and I actually found myself listening to announcements that I had already known about. You can definitely tell there is some kind of influence from Douglas Adams here both in the voice and the quirky sense of humor of the game as a whole.  The interface also worked pretty damn well for me. Everything you need can be accessed through the use of the mouse. Camera control is easy as pie. Placing buildings, switching levels, checking out the status of the various compartments and decks, hiring and firing employees, and getting info on all of the residents and visitors are as easy as pie. There were a couple of things I would have liked to see like a go to feature for events but I can't really complain. Using items is easy enough through an interface that will beam whatever item you click on into a handy little ten-slot inventory so that you can transport goods, pick up trash, and all of that good stuff if you don't want to wait for your droids to do it.  Once you get past taking care of just a few compartments (the station is donut shaped and divided into 16 sections), you're really going to find yourself running around wondering what's going on if you didn't plan things out very well. Especially when you start playing against opponents that are trying to buy new station compartments before you can to claim the station as their own. Work fast and efficiently in order to win the day because this game gets pretty darn hard in later levels and against the computer in sandbox mode. You have to worry about security against enemy spies and saboteurs, building brigs for criminals, researching technologies so that you don't have to trade for them, etc...  If you like economic sims, you'll like this game a whole lot and I really hope you go out and buy it if you can run it. I love these types of games and I just want to keep playing it more and turn into a recluse like I did with Pharaoh. Too bad I have to start playing other games now. Hopefully I'll be able to fit some playing time into the cracks of my schedule... must find excuse to play more...  -- Dan Adams Want to share your opinions with the world? Talk about it on the IGNPC message boards,  orsend some mail to IGNPC about this story.", "date": "Jun 21, 2001"}