{"name": "NASCAR Heat 2002", "name_review": "NASCAR Heat 2002", "ref": "https://www.ign.com/articles/2001/06/28/nascar-heat-2002-2", "text": "After getting a chance to watch the recent NASCAR Winston Cup race at Sears Point just last week, my interest level in America's most popular sport increased tenfold. It was the first race that I've watched live since a Budweiser 500 at Dover Downs between eight and 10 years ago and I had almost completely forgotten the intensity of this extremely popular and highly-underrated racing sport.   Coming off the high of the race, it wasn't too hard to get up for the review of Monster Games' latest NASCAR racing simulation and first for PlayStation 2, NASCAR Heat 2002. Based on the current NASCAR Winston Cup season, Heat 2002 features 19 of the 23 official tracks (it's missing Chicagoland, Indianapolis, Kansas and Pocono) and 25 real-life drivers including Dale Earnhardt Jr., Jeff ~Booo~ Gordon, Tony Stewart (surprise winner of the Sears Point race), and Rusty Wallace.   Sadly, Bobby Hamilton, who recently became of favorite of mine after his poor yet impressive performance at Sears Point, and his #55 car apparently didn't make the cut, as he's not one of the professional racers in the game.    Gameplay Luckily, Monster Games made up for this oversight by including a fairly well-rounded feature set that should appeal to both the diehard simulation fanatic as well as the diehard NASCAR fan that might just want to jump into the game without much thought going into how to adjust the gears, suspension or weight distribution of his car.   The game offers the same basic play modes that are a current staple in the series -- Beat the Heat, Race the Pro, Single Race and Championship. The Beat the Heat mode is somewhat similar to Gran Turismo's license tests in that their mission is to teach you how to race. There are 36 tasks to complete that include simple things like completing two turns on a track under a certain amount of time or learning to draft another car to more advanced tasks like finishing several laps on a particular track in first place when you start at the end of the pack.   While some of these challenges work out great and really help teach the player how they should actually race in the game, some of it actually has the opposite effect. For instance, all of the second tier tasks have the player start at the back of the pack with one lap to go with the expectation of finishing in first place. While the challenge is there to get the gold trophy, it's not a realistic situation, as this would never happen in a real race. This can teach the player some bad habits and doesn't serve a real purpose in trying to improve the player's driving skills.   Even still, the Beat the Heat mode is really fun to play through and adds and extra dimension to the game that's not seen in other NASCAR games. It's just too bad that it couldn't have been designed better to actually help the player improve his driving skills, which would be great for those that haven't played that many driving simulations but are interested in really learning how to drive in a NASCAR race. In the same way, it would've been nice if there were some demos showing a gold medal being won, with gauges showing things like when the computer accelerated or braked and the general racing line. This way, the Beat the Heat could've served as both a cool extra gameplay mode and a learning tool for the novice.   The Race the Pro mode is simply a chance to go up against any one of 11 real drivers and their best times on one of three tracks. There's not really a lot to this, as it simply consists of you racing against a ghost car, but just like the Beat the Heat mode, it adds an extra dimension to the game and gives the player something to do when he's not taking part in any of the game's main play modes, which includes Single Race, which lets you race with any driver on any track, and Championship, which is the meat and potatoes of the game.   The Championship mode is in essence a simulation of the current Winston Cup season minus a race here or there. It can be setup to be of various lengths (both the season and the race lengths), and with factors like wear rate (can be increased so that you need to pit on shorter races), flags, opponent strength and realism (Normal or Expert) able to be adjusted.   The Normal mode, which is best suited for someone that's looking to jump right into the game, doesn't let you adjust any of the settings on your car between races and sort of cheats a bit to keep you from spinning out too much and won't completely destroy your chances of winning if you splash into a wall or get a little too touchy feely with a lot of other cars. The races aren't necessarily easy, though -- as if you bump up the opponent strength to Hard or Pro you'll find that you have to perform extremely well if you expect to finish in first place.   The difference between Normal and Expert mode isn't really the challenge of the racing aspect of the game but more the driving. On Expert, the game won't let you get away with as many mistakes. If you don't brake enough going into a turn or try coming out of one too early, you can expect to slam into a wall, which isn't necessarily going to happen on Normal. Likewise, damage to your car has a greater impact on the performance of your car and you can no longer just push around the AI cars or even knock them out of the race by clipping their rear without having to worry about hurting yourself as much as them.   Furthermore, on Expert you have the ability to setup your car between races and how you tweak your car will be a major factor in how well you're able to perform on each of the different tracks. And if you're a gear head, you'll be pleased to find out that just about everything imaginable can be customized from the weight distribution of the car to the gear ratios and to spoiler angle and the percentage of Grille Tape.   The racing physics when on Expert seem to be pretty solid and offer a very realistic racing experience, with an excellent drafting model that shows just how important this aspect of racing comes into play during real NASCAR races (this sport gets mocked often for the lack of right turns in most of the races, but there's an insane amount of skill and technique involved in the real thing). Since I've never raced in a real NASCAR race, I don't have a clue if the timing of braking, downshifting, or acceleration out of turns or the drafting physics are completely realistic, but it definitely appears as if it's so.   My biggest complaint about the game centers on the caution flags, how they're handled and the fact that the computer AI doesn't seem to wreck. Throughout an entire Winston Cup season, I didn't notice a single crash or yellow caution flag that was NOT caused by myself. The computer never once got into a big accident or pile up unless I purposely or accidentally caused one. What's more, the caution laps are completely run automatically and are out of the hands of the player when racing on the Normal mode, so there'll be nothing to do but watch the screen for several minutes waiting for the pace car to leave and let the race continue. It's not automatic on Expert, but it would've been nice to have this be a changeable option regardless of mode.   Back to the good points, NASCAR Heat 2002 deserves some praise for its control options. Racing gamers are often picky when it comes to how they like to race and there are enough control options here to meet the demands of just about all of them. Whether you like the gas and brake and the right analog stick, the face buttons or the front shoulder buttons, you'll find that there's a control configuration that'll likely suit your needs.   Likewise, the game offers four different and completely playable viewpoints including a standard behind-the-car view, a far-away behind-the-car view, a full screen view from the bumper and a cockpit view. All views work well, with the behind-the-car views and the cockpit views giving the best look at the damage that's being done to the body of your car. The only real complaint that I have with any of these is that too much of the screen is cut off for the cockpit view and the lack of hands or feet in the cockpit really makes these feel a bit awkward when playing from this particular viewpoint.   Regardless of the settings you use, you'll find that NASCAR Heat 2002 does a wonderful job of making you feel like you're really inside a real-life Winston Cup race. The intensity level when you're sandwiched between several cars trying to pass you both high and low, with your spotter yelling their locations constantly, can get pretty high -- especially when you're on expert and are trying your best not to bump into them too much.    Graphics The game's visuals are quite good on the whole but don't you dare expect to get something that looks as good as Gran Turismo 3. Then again, GT3 is limited to only six cars per race while Heat 2002 boasts 24 cars per racing event. At any rate, the car models are highly detailed, the sponsor logos on the cars are crystal clear and easy to read, and the smoke effects are more than passable.   The tracks are also highly detailed, contain a lot of infield elements and seem to be completely accurate when put up against their real-life counterparts. The framerate is generally solid but will dip every once in a while, but it doesn't hurt the gameplay too much. For the most part, if you're running a realistic race, you won't encounter the really bad slowdown problems, but if you're playing on easy and try and pass all 23 other cars on a single turn, the game will chop up drastically.   Sound The game's audio is appears to be fairly authentic, at least when you compare it to what it sounds like on TV. The sounds of cars hitting each other or the walls seem right on and the spotter, who tells you where other cars are in relation to you, will talk your ear off much like is the case in the real deal. The problem here is that after recently watching a NASCAR event live, the engine sounds in the game just fail to impress. While they do seem accurate to what you get when watching a race broadcasted on television, it fails to mimic the true power of the engine sounds when you're at a real race (turning the volume up doesn't really help). Maybe it's just asking for too much, but the powerful sounds of these 700+ horsepower V8's are one of the biggest reasons to like the sport, so it'd be much appreciated if this aspect could be brought home completely. NASCAR Heat 2002 brings a lot to the table and really offers a well rounded racing experience that will appeal to arcade and simulation racing fans. It's simply a very solid racing game and is currently the best NASCAR racing game available on PlayStation 2. EA Sports' NASCAR Thunder 2002 might give it a run for its money when it's released, but for the time being, Heat is simply the best.", "date": "Jun 28, 2001"}