{"name": "Starfleet Command: Orion Pirates", "name_review": "Starfleet Command: Orion Pirates", "ref": "https://www.ign.com/articles/2001/07/03/starfleet-command-orion-pirates", "text": "I am proud that in between games of Chill and Villains and Vigilantes, I actually played a lot of Starfleet Battles when I was a kid. Soon the allure of high school chicks and playing in the second best rock and roll band in my graduating class took over my hormone-addled psyche and I had no time for games. But in the back of my mind I always thought back on those sessions of Starfleet Battles and hoped some day to return to them. I got my chance with the original Starfleet Battles for the PC. It not only brought the battles to the desktop, but it also rendered them in real-time with fantastic 3D graphics. Starfleet Command II: Empires at War brought quite a few additions to that model and now Starfleet Command: Orion Pirates is hoping to take the experience a step further.  For the benefit of those of you who aren't conversant with all things Trek, here's the short version. Orion is a planet within the Federation with a rabid economic expansion policy. The so-called Orion Pirates dabble in trade all throughout the galaxy. While no one's ever actually admitted it, it seems a safe bet that the Orion Pirates are, or at least were, a shady arm of the Orion government.  For the game, the Pirates have been divided into eight cartels, each of which resides in a separate sector of space. Each of the game's races has it's own form of Orion Cartel working, if not in open cooperation, at least alongside it. But since the individual cartels are so far ranging, there's an eclectic mix of weapons and technology to be found on any pirate's ship. If you're not into playing as the pirates, you can assume the captaincy of the ships of any of the other races -- Gorn, Federation, Klingon, Romulan, Interstellar Concordium, Mirak, Hydran, or Lyran.  There are twelve new campaigns here along with 26 skirmish missions. Best of all there's a simple mission creator that lets you set up the engagements you'd like to see. Twelve multiplayer missions and three bonus missions based on the ~A Piece of the Action~ episode are included as well. For the most part the missions are short in nature -- go kill a single ship sort of affairs -- but some big, multiship missions will exercise your tactical thinking a little more.  Ship to ship action is the focus here. It's really very much like Klingon Academy (or is it the other way around?) where you spend most of your time in charge of a single ship battling a few other ships. As these are huge capital ships it's all very dignified and pompous even in the heat of battle. Ships turn very slowly and the silence of their turning is sporadically punctuated by small bursts of fire. While there's plenty of excitement in it, this is a game of patience and attentiveness.  You're in charge of all the systems on your ship and you give all the orders. The interface for this is well implemented enough that it sort of makes you wonder what all those extra crew were doing on the shows. I mean, if our interfaces are this good now, imagine how much easier it would be for one person to control a whole starship 200 years into the future. While there are a lot of options and readouts here, there are really far too many buttons on the interface for my tastes. During on of the tutorials the game asked me to click the flashing button on the control panel and it took me three minutes just to find it. The good news is that everything is laid out reasonably well and a convenient range of hotkeys gives you instant access to almost everything you need.  And given the robust AI, you'll need almost everything. It's possible to play the game in a dumbed down, move and shoot mode, but the AI will take every advantage it can in terms of system tweaks and tactical maneuvers. Its got a great sense of when to turn and when to keep dead ahead and, with two ships of comparable speed and maneuverability, the human player will find it hard to keep up with the AI. You can get into a few sweet spots now and then but it's rare that the game cuts you any breaks. You're sure to get a real close look at the excellent damage modeling in the game and, if you're really bad, even a front row seat for the breathtaking explosion effects. When the ships get hurt real bad, they start to trail purple anti-freeze. That's when you start regretting that you never thanked your sixth grade civics teacher for instilling in you the value of a really well-trained citizen militia. Music is sufficiently dramatic for such moments but I found a blandness to some of the voice acknowledgements your ship gives you.  Sadly, there is no z-axis in the game. Ships remain on a single plane except when passing over each other. This is a design decision that lots of developers are making. With the success of Homeworld, it's disheartening to see so many games (this one, Dominion Wars, Conquest: Frontier Wars, etc.) adopting a flat approach. I don't mind that limitation when it makes more sense (as in Age of Sail or Fighting Steel) but here it does detract from the realism. On the other hand, it's very much in keeping with the boardgame roots of the title and I can respect that.  While the ship-to-ship action is the main point of the game, the folks at Taldren (which I think used to be the name of Tal's Rolemaster character -- mine was Milkbottom) have tried to expand the promising Dynaverse II engine. In short, this is an open-ended campaign engine that allows you to roam the galaxy in the midst of a vibrant and living interaction among the various races. But while there are still a lot of great things about the engine, the system still has many of the shortcomings that plagued Empires at War.  First off, the interface is unattractive and clumsy. While it communicates information all right, navigating around the map is much more troublesome than it ought to be. When you think of Star Trek, you think of something both efficient and effective -- this falls short of that ideal. A rather boring map does little to get you excited about Gorn incursions into Romulan space.  There's still also a lack of any sense that you're part of a larger empire. Sure, you can enjoy some rest and repair at your race's starbases and planets but, apart from a few meeting engagements, the sense that you're working together with a whole navy isn't as apparent as it should be. The online version of the Dynaverse may be one remedy to that problem but there simply aren't enough players online yet. Add that to the fact that Orion Pirates isn't compatible with previous versions of Starfleet Command and you begin to see the potential drop even further.  So it seems a lot like just an expansion at first glance, but it's really more of a stand-alone mission pack with a few new features added. You don't need anything else to run it (well, a computer) and at $30 it's not at all unreasonable provided that you get a kick out of this sort of thing to begin with. It may seem as if that goes without saying but I really enjoyed this game just as a 3D, real-time version of Starfleet Battles. While the extra stuff in the game has a lot of potential, the real meat of this game is the tactical combat model. Luckily there's enough going on outside of that to give you a sense of continuity. Hopefully future versions of the game will bring that a little farther.  -- Steve Butts Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Jul 3, 2001"}