{"name": "Zeus: Poseidon", "name_review": "Zeus Official Expansion: Poseidon", "ref": "https://www.ign.com/articles/2001/07/03/zeus-official-expansion-poseidon", "text": "So the original Zeus got a 9.5 in Lasting Appeal and it deserved it. Eight months later, it's still a game that I fire up from time to time. For a jaded member of Generation X who does nothing except play every single game that ever comes out, the fact that I'd still be playing a game eight months after its release is a big deal. So how in the world could Impressions improve on it? Simple, they couldn't. But what they could do is offer a host of new missions set within the same universe with enough tweaks and changes to make it seem new.  I'm still playing it and I'm gonna keep on playing it.  With 45 missions spread out across six campaigns, Poseidon rivals Zeus for depth. The game begins with the initial founding of Atlantis. You, as the son of Atlas and grandson of Poseidon (the mythology gets a little loose here), are entrusted with the task of building Atlantis into a great city. The game starts you off with access to most of the buildings and whatnot that you'll have access to later in the game but there's a reasonable learning curve so you needn't worry.  Without spoiling the story (you know Atlantis sinks, right?) I can say that the designers have crafted a series of campaigns that build upon one another (or have so far at least) adding layers of enjoyment and understanding with each new mission. From the beginnings of Atlantis you'll turn first west and then east to establish relations with the Mayans and Phoenicians. Widening the Straights of Gibraltar and vanquishing Scylla are just two of the objectives you'll have to face here.  Atlantis soon feels the effects of a deadly plague that runs throughout the Mediterranean and your job will be to establish a new city as a remembrance of Atlantis' former glory. From this point, you switch sides and start trying to repel the Atlantean invasion of the Eastern Mediterranean. In all there's more gameplay here than is probably good for anyone who has a job to go to or a girlfriend to grace with your presence (although my wife developed a serious addiction to this game over the weekend).  While the new adventures are obviously the focal point of the expansion, it's got a couple of new additions in the area of gameplay as well. On the food production side, you'll be able to raise cattle and cultivate orange trees to feed your population. Refineries allow you to mine the deposits of orichalc (of which will talk more about later) while Black Marble Workshops let you lift black marble deposits from the landscape. From a standpoint of practicality the black marble works just like the white kind as far as we can tell. Still, it looks neat.  In Atlantis science replaces art and athletics as the primary vehicle of culture. Instead of building symposia or gyms or theaters you'll need to construct bibliothekes, universities and inventor's workshops. These structures train scholars to work in your museums, observatories and laboratories. As new technologies are discovered, the scientists will wander around the city educating the population.  A whole new range of aesthetic improvements have been added as well. Adding various artistic improvements is a great way to supplement your city's appeal. For the real improvements you'll want to construct the new pyramids that come with Poseidon. These structures (of various sizes and complexities) really boost the status of the areas they're near.  Hippodromes have also been added to the game. These are racetracks where you people can come to pay for the privilege of learning to love you. This is really a win-win situation for you as it puts money right in your coffers and does it without ticking anyone off. In fact, your citizens will love you for giving them the opportunity. Hippodromes are constructed in various parts so you can make them as big or as small as you like. Just make sure they're close enough to a horse ranch so they'll have a steady supply of horses. <p . another thing youll use horse ranches for are your chariots. these basically the horsemen of atlantean world and function almost exactly same way except that they need wood in addition to horses frigates just like triremes most part with one significant exception. wharves have a steady supply orichalc can construct fire launchers on frigates. is pretty cool devastating effect sure turn tide favor. projectiles which also be launched from orichalc-supplied towers will consume enemies an aura flame. apart triremes. fact nearly all military stuff has been changed as little possible. interface controlling troops still horrid ever but since really isnt point game its not big deal.  Two new gods have been added to the mix. Hera's sanctuary takes the form of an orchard. She sanctifies your own orange groves and corrals and sees to it that your population growth stays positive. When you pray to Hera she'll provide all of your vendors with extra goods to distribute. Most importantly however is the fact that she is the only god that can trump Zeus whenever he invades your city. This alone makes Hera an impressive addition to the pantheon. If Hera's mad at you (as she seemed to be with me for most of the first adventure) she'll not only destroy all of your oranges and half your cattle, but will also reduce your reputation among all the other cities on the map. Stupid Hera.  The Pillar of Atlas allows you to use that god's influence. He improves the efficiency with which your stonecutters work and adds artisans to your workshops. When you pray to Atlas he may even speed the construction of sanctuaries or pyramids by bringing good directly to the artisans' workshops and seeing that they are used more efficiently. This is actually a neat way to get your precious marble to last a little longer and maybe even get a few more temples out of the deal. When he's angry with you, Atlas will invade your city and petrify any citizens who cross his path. He incapacitates your stone shops and brings construction of sanctuaries to a standstill. Stupid Atlas.  Along with the gods come new monsters and heroes. Hera's Sphinx and Atlas' Chimera will provide sufficient opportunity for your heroes to prove just how brave they are. Ditto the Echidna and the Harpies. The animations of these creatures is fairly cool (although not much improved over the old standbys like the Minotaur or Calydonian Boar). Atalanta can be recruited to take on the Sphinx and the Harpy while Bellerophon (in addition to getting his own campaign) vanquishes the Chimera and Echidna.  A few basic changes to some of the other gods and heroes had to be made to accommodate the new features of Atlantis. In order to lure Hercules to Atlantis, you've got to provide him with sufficient education and horseracing venues. Jason will demand a fleet of ships be built for him. In the absence of gyms and drama schools Apollo now bestows his blessings (and curses) on the various scientific buildings in your city. Since the game is named for Poseidon you might expect him to have much more power, but that's just not the case. But he does have a snazzy new temple.  Poseidon ships with a whole new adventure and map editor that you can use to sculpt your own missions and campaigns. Overall it's a pretty robust editor that allows you to set all sorts of parameters for the missions. It's less about scripting specific events than it is about creating a landscape, deciding what will and won't be available to the player and picking victory conditions. Since this is such a finely balanced game, you may have problems getting the mix of resources and objectives just right. I know I sure did. A full editor is also available for owners of Zeus at the Impressions website for those of you who want to take it out for a test drive.  Obviously if you hated Zeus you're going to hate Poseidon as well. But if you hated Zeus then there's something wrong with you. City building sims aren't everyone's idea of a good time, but it's done so well in Zeus that you'll find it hard not to like the game. With a ton of new adventures and the same level of humor and flair (not to mention the twenty drachmae asking price) Poseidon is a great value.  -- Steve Butts      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Jul 3, 2001"}