{"name": "Drakan: Order of the Flame", "name_review": "Drakan: Order of the Flame", "ref": "https://www.ign.com/articles/1999/09/04/drakan-order-of-the-flame", "text": "The question on everyone's mind about Psygnosis' big third-person flight and foot adventure game is, ~how can she run through icy mountain tops wearing only stretch pants and a push-up bra?~ This is the prime question that I hope to answer in this review.  And I'll talk about the game a bit.  There's no doubt that someone in the Psygnosis offices not only saw some cleavage when they were playing Tomb Raider, but saw some pretty bouncy dollar signs as well. A smart, witty, half-naked franchise was just the thing for Eidos, so why not another British company? Fortunately, other than the shared lack of clothing between the two starlets, there's not much in the way of similarity between the two titles.  To recap, Rynn is some girl whose brother has been kidnapped by the Wartoks, who she then finds out have a more sinister purpose as the game progresses. Your first job is to find and bond with Arokh, a dragon that has been in slumber for centuries, and free your brother, and your world, from the clutches of the evil Navaros and his dragon. It's the beginning of a classic adventure, albeit one with a different slant. Dragons are fun, swords are fun, and slashing people with swords and then being on Dragons is really fun -- the plot here is just secondary.  Drakan controls with a combination of a mouse and keyboard, and once you get the hang of it, you'll wonder why all third-person games didn't control this way.  The control is similar to the Quake structure, so those of you with some fragging experience should have no trouble grasping the concepts. There are hotkeys for your special inventory items like health and invulnerability potions, as well as a god-given save game hotkey to allow you to save your games without having to take your fingers off the keyboard. You'll be using this option like there's no tomorrow, yesterday, or next week. Once Rynn has a dragon, the adventure becomes even more expansive, though just as easy to control. The jump and crouch buttons allow you to climb and drop vertically, and the mouse allows you to rotate Arokh easily to create flips, spins, and barrel rolls with ease. Rynn's has the addition of an inventory interface that comes straight from the Diablo gamebook, and adds a nice element of adventure to the game -- you have to make conscious decisions about what weapons to keep, and which items are the most useful, because your room is limited.  Weapons are of the slash and hack variety, with special items like the Ice Sword having the addition of spells attached to them. Arokh can only find new weapons by defeating other creatures and dragons, each with their own advantage and special attack. Lightning can aim at enemies almost automatically, but the hard to fire ice attack is much more devastating -- and of course, there's always your tried and true fire attack. Unlike Arokh's attacks, Rynn's weapons have a limited amount of damage they can take, and sometimes the designers use the fact to their advantage to make for some fun decision making. I found a fantastic axe with a huge radius and massive damage, but it was already damaged so much that it only had minimal usage before it would break. It took up a lot of room as well, so it became a matter of waiting for the prime time to use it, such as against ~big armored guy with flaming swords that's reeeaaally hard to kill.~ Though you can pick up weapons from nearly everywhere, the designers have made it so you can't actually get the weapons of the enemies you've killed -- which makes sense from a gaming standpoint, but doesn't in terms of logic, especially when you see a fat, juicy mace sitting on the ground with a Wartok that you can't use. Speaking of which, it's also a bit odd that the armor hidden in the caverns, ruins, and fortresses in the game just happen to fit Rynn's body perfectly every time, and seem to support and yet not protect her ample cleavage. I was very happy when I finally reached the island worlds, purely for the fact that I was worried that she was going to die of frostbite before I ever finished the game.  The graphics in the game are top notch, with the detail levels so high that the world of Drakan really feels like just that -- a complete world. Wartoks and dragons are a joy to watch and kill, and even after death, provide some grotesque fun. Find a strong enough weapon and you can actually lop off the limbs of your enemies -- and then kick the limbs around as they lie on the ground. The Ice Sword can even turn enemies into ice sculptures, which can then be shattered, with individual pieces reacting with real physics as you push them out of your way. They even melt after a few seconds. Blood splatters spray out from enemies and leave stains on the ground, fires leave beautiful realtime lighting effects on the walls, and tiny plates and bottles lie strewn on tables -- no matter how large a level becomes (and they take up a considerable amount of real estate), it never feels like a set of textured polygons.  Though the game has been touted as giving gamers full freedom of exploration, it's actually fairly linear. The first couple of levels have you working from one end of a map to the other, with a couple of secret caves thrown in for good measure. Most of the time, secrets are kept to hard but small puzzles which will give you access to special armor or weapons. Useful? Very much so. ~Full freedom of enjoyment~? Not really. Though the world is large, events are tied to specific section of the map, with most of the exploring focusing on find out how to get to point X. Quests are written on the hand-drawn maps in the game, and keep you posted as to major monuments on every level. After solving the quests and missions within a map, at the end of the  you'll face a beast or dragon of some kind, then it's off to the next world with your new ability. Though each map is filled with incredible detail, they don't actually combine very well, especially with the ice and island maps, which are literally connected by a few hundred feet of tunnel. Guess Drakan has some pretty sever micro-climates. The game gets progressively larger however, and places like the island world becomes less linear, throwing you on a multitude of mini-quests in order to find key items integral to the plot. It's a glorified version of the classic King's Quest ~bring me my hat so I can give you a key~ shtick, but it keeps the action at a nice pace, and forces you to seek out tiny crevices, corridors, and niches inside of each area. The majority of your time is spent in caverns and buildings finding an item, destroying a mine, or simply being queen of the heroic universe in some way or another, but a fair amount of exploration takes place on the larger world map. In that sense, Drakan delivers all that it promised -- being able to rise up hundred of feet in the air, travel to the far ends of the earth, and then glide down to eye level with a nasty Wartok is a stunning feat, and although you pay for it in terms of fogging detail (this will possibly be your first experience with smoggy island life), it's worth it for the amount of the detail that the game pulls off.  The AI makes for some entertaining battles, especially when it comes to armor-clad Wartoks with shields. Slay two Wartoks quickly, and the third will run for cover and cower behind the nearest object. Giant creatures will throw explosive barrels or rocks at you as you try to pass, and if they run out they'll be more than happy to grab the nearest creature and hurl them as well, which is a cute gimmick that never, ever gets old. Even Arokh has some nifty AI, especially when you park him and head somewhere else only to hear him frying enemies without your help. If you're in his way, he'll even shout out for you to get out of the way before he begins roasting evil. It's a nice touch in a game full of nice touches. Clipping problems aren't abundant, but when they hit, they can knock the wind out of you with their confusion, especially in instances when you're backing yourself into a corner to better face an enemy. Standard running and jumping acts and reacts pretty smoothly however, and you'll be surprised at how smart the camera can be when climbing ladder, running through cramped hallways, and running over large bridges. The mouse control also allows for quick access to custom camera views, which helps when you want to run and still get a gander at the scenery, or perhaps that giant monster bent on hurling you into the nearest wall.  And then there comes the acting.  Arokh, Rynn's dragon, talks like a mixture of a Muppet and your grandpa, which is usually fairly innocuous, unless he decides to pop up with some ~let's fry us some wartoks~ or ~I'll wait here for you Rynn.~ OK, so actually it's every time he speaks, but fortunately he keeps the chatting pretty slim. Some have criticized the game for horrible voice acting, and I'd have to agree, but what they don't seem to mention is how little of it there is in terms of actual gameplay. Yes, hearing Arokh converse with renegade dragons can be a horrendously laughable affair, but it certainly doesn't destroy the game, and since you'll only have to hear the chattle every few hours, I wouldn't count it as a soul-shearing experience. Maybe just a little trimming. The sound effects are nice but standard, with the musical score kept to mood music that you'll just as soon forget -- but it doesn't grate, either. Sound effects are slightly silly but appropriate, like the lizard-like denizens of the island world that sound like Animal (there's that Muppet reference again). Tal couldn't stop imitating them as I was playing, but I'm not sure if that's necessarily a good thing, if you know Tal like I know Tal.   The sound may be workable, but multiplayer doesn't fare so well. In fact it falls right on its scaly face. The hand to hand combat arenas are simple and dull, and the joy of slashing Wartoks and spiders doesn't translate very well to killing fellow game mates, especially when most of the battling becomes running and slashing frantically until one of you falls to the floor. The fogging is pretty horrible with air battle, which means that finding dragons to slay is like piloting yourself through cotton candy, hoping to catch a blurry glimpse of one of your foes. Master of the Dragon does a weird version of king of the hill, where one player has a dragon and everyone else must try to kill them -- but once you've played as a human, you'll realize what a losing battle this is. It doesn't really work, and certainly isn't a good replacement for a level which would allow you to fight on foot and air. Fortunately, the single player game is incredibly strong, which doesn't make up for the bad multiplayer, but makes it a bit less disappointing when it comes to the complete package.   Though the game does resort to a lot of corridor-hauling, it doesn't become bogged down in Tomb Raider type exploration, and instead focuses on traps and enemies to keep the action hot and heavy. This game is not Tomb Raider, and what it has taken from the series is mostly cosmetic, so those of you worried about long levels filled with confusing switches can rest at ease. Most of the puzzles are fairly condensed, and though a few can be frustrating, they certainly never become as confusing as some of the insane logic pounded into you by the later Tomb Raider games. Most of your worries will concern how to kill enemy X, and how the hell to run pass two giants and three dragons to get to the switch on the other side of that huge, huge field. When it comes down to the details of gameplay Drakan feels like a lot of games you've played before, but it's really the combination of those details that make Drakan so entertaining. The story won't enthrall you, some of the cave adventures will bore you, and some of the air battles can seem simplistic -- but toss them all together in a thick stew and the game really does begin to shine, especially in the later levels, where the designers become more generous with their cross-genre sprinkles. While Drakan may not be pushing any boundaries or creating any wakes in its path, the action/adventure hybrid, like System Shock, proves what interesting new children can come out of breeding popular genres. -- Vincent Lopez  World Exclusive Drakan Interview!  Mr. Robot recently flew down to LA, where he conducted an interview with one of the star of Drakan, Cleavage. Cleavage has been in the show business industry since it's inception, but has recently become a mainstay of the gaming industry, where she has risen to fame on works such as Space Bunnies Must Die!, Dungeon Keeper 2, and the mega-hit and golden franchise Tomb Raider. She's currently working on about 3,285 new games due next year.  Mr. Robot: So how long have you been in this industry for?  Cleavage: I would say that my unofficial debut was in Custer's Last Stand, but that's not what I'd like to be remembered for, certainly. I made a much larger entrance in the Leisure Suit Larry series, where I not only scored some major co-starring roles, but most of the supporting roles as well. I think Night Trap also helped to get me noticed in the industry.  Mr. R: What would you say is your greatest success?  C: Tomb Raider, definitely. It was my first starring role, and I think that the game studios took notice. Not only did I get larger parts in the next two Tomb Raider games, but I also got offers from nearly everyone in the industry.  Mr. R: Were you overwhelmed by all the attention?  C: I think it was just nice to finally get my due, after all my hard work. I mean getting a lot of attention at E3 was one thing -- I still fund that entire conference with my work -- but it was great to finally be part of the larger picture.  Mr. R: I hate to even ask this, but are you worried that you're just a fad, that you'll soon be relegated back to the festivals and b-games?  C: Honestly? I don't think so. I think the amount of revenue I've been pulling in has proven that there's a market for this, and the industry has finally realized that it's the work of people like me, not the games, that sell the products.  Mr. R: I'm not so sure about that -- there are people out there that would specifically avoid certain games or events because of your presence.  C: Who are those people?  Mr. R: *cough* smart people *cough*  C: What was that?  R: Nothing. I'm sure we'll be meeting again, Cleavage -- I appreciate your time. Now excuse me while I conduct my next interview with your fellow actor and co-star in Drakan, ass.", "date": "Sep 4, 1999"}