{"name": "Tomb Raider: Curse of the Sword", "name_review": "Tomb Raider: Curse of the Sword", "ref": "https://www.ign.com/articles/2001/07/06/tomb-raider-curse-of-the-sword", "text": "Early last year THQ scored the rights to release Tomb Raider for the Game Boy Color, an ambitiously excellent portable rendition of the very popular console series. A sequel, released by Activision this time, pounces on the Game Boy Color just in time to capitalize on the film's theatrical release, but it's not a cash-in -- the original developers expand on the first game's design to bring Game Boy Color gamers a brand new adventure. It's a familiar game, sure, but it's also a very, very good one. Features More than six huge levels High-color cutscene images Multiple weaponry Battery save Only for Game Boy Color    Lara's out of the tombs and out of trouble, but gets caught in another adventure as a sword has been taken from a local museum. When she goes to take back the artifact, she's sliced by it -- and is now part of the evil ritual that the sword will be use for...and it's up to Lara to chase down the evil cult before they follow through with the ceremony. Tomb Raider: Curse of the Sword is still a modern, portable version of Prince of Persia, and there's no way the developers are ever going to shake that reputation. But regardless of where the designers drew the inspiration, the game works extremely well on the Game Boy Color, as the game is a challenging and lengthy adventure with enough variety in the locations that'll encourage folks to continue to the very end...but expect to put in a good amount of hours to accomplish that task.  Though the sequel utilizes a nearly identical game engine that the original Game Boy Color Tomb Raider was based on, the developers added a few elements that give life to the environments. When Lara enters areas, she'll kick up stray papers that drift in the wind, or knock over cans left discarded on a ledge, or scare birds resting on the rooftops. Backgrounds utilize a much-unused technique on the Game Boy Color: parallax scrolling. Though the original title used multiple scrolling backgrounds for an illusion of depth, the sequel pushes the technique a lot further, especially in the outdoor levels where the skyline scrolls by at a different speed as the foreground buildings. Actual level designs have been one-upped from the last one -- there wasn't anything wrong with the art last year, but the color depth seems to have been given a shot in the arm. Now levels look more detailed with more colors used all over the place. The one thing that hasn't changed is Lara's incredibly huge library of animations -- she still walks, runs, hops, climbs, ducks, rolls, and leaps with amazing fluidity...almost unnaturally so.  And because the game uses the same game engine, it means that the control scheme from the original is back -- all of Lara's moves have been mapped to the two action buttons, and if you're not learned in the ways of Tomb Raider GBC, it'll take a few tries to get the hang of it. Which is a good thing the beginning level has been laid-out in a basic format -- it makes it a bit more friendly to learn the complex controls that's required later in the lengthy adventure.  The level designs are still of the ~flip Switch A to activate Trap Door B, Pick up Item C, D, and E to activate Lock F~ variety, but the team interspersed some clever action in between these puzzles. Just wait until you have to make it through the second level with only five minutes to do it. Or how about a technique where you'll have to continuously leap across a chasm, from one ladder to the next while dodging falling debris? All of the levels are incredibly huge, with several parts to complete before you can move on to the next large area...but the game can only be saved at specific places within a level, so it's perfectly normal to complete a few tasks and backtracking to the save crystal to have it recorded to the cartridge. No passwords here, folks -- Activision spent the extra buck for battery, thank god.   The only bad thing that can be said about this game is that the game ~feels~ like the original title -- but even that's not a terrible thing. The original game was a clone of Prince of Persia, sure, but the package offered was a tight one that showed that a team of Game Boy Color developers were determined to bring a quality Tomb Raider title to the handheld. And the sequel, while feeling a bit like a repeat of the original game's actions, is definitely a welcome design since the levels are arranged very well with lots of challenges along the way. And unlike the first game, in Curse of the Sword you don't have to deal with those obnoxious, tiny black bats that were next to impossible to see. The technique to kill enemies is still a bit mindless, as all opponents, from rats to thugs to zombies lack a certain AI...and all it really takes to kill these guys is distance between you and them. The battery back-up makes this a portable friendly game, as you can progress through at a leisurely pace, save the game and power down when a series of tasks have been complete.  Tomb Raider: Curse of the Sword must have been a very quick game to develop, as the game was worked on in secrecy and suddenly dropped in our laps with very little warning. But however economical the game development was, this Tomb Raider title is a quality one -- sure, it's using the same engine as the last game, but the last game was an excellent title, too. And because the first game trained us in the art of controlling the complex Lara sprite, this one can be picked up and played a more easily than the first one...that is, if you even played the first one. And the game will last you a good long while, with huge, elaborate levels and lots of things to shoot.", "date": "Jul 6, 2001"}