{"name": "Alone in the Dark: The New Nightmare", "name_review": "Alone in the Dark: The New Nightmare", "ref": "https://www.ign.com/articles/2001/07/06/alone-in-the-dark-the-new-nightmare-6", "text": "It's been almost a year since Infogrames first wowed us with initial screenshots of Alone in the Dark. The game, in still shots, looked incredibly promising, utilizing the Game Boy Color's unofficial, and barely exploited high-color mode for most of the in-game graphics and cutscenes. The game reportedly has been complete for quite some time now (as early as last December), but it waited for the other console versions to come out so that it can ride their wave to retail. The final product, unfortunately, didn't meet the anticipation buzz generated from the early peeks at the game -- as good as it looks, it's really not too much more than an interactive slideshow. Features High-color backgrounds with scrolling Special combat modes Battery save Only for Game Boy Color    In Alone in the Dark: The New Nightmare, you play Edward Carnby, the haunted and hunted detective hero of the series. This time out, Carnbury isn't out to escape the ghouls; he wants to find them. Carnby's best friend, Charles Fiske, has been found dead off a mysterious island near the coast of Maine, Shadow Island. His life pursuit of three ancient tablets which have the ability to unlock an incredible and dangerous power has somehow taken his life, and Edward must find out why his friend was murdered and what powers these tablets hold.  The game tries to be a Resident Evil title for the Game Boy Color, attempting to fill the void that Capcom left when it pulled the plug on its own portable survival horror conversion. Unfortunately, all the design really is, is a more interactive version of a Myst engine -- it's all about wandering the super detailed still screen, walking to points on the image that will trigger the link to the next detailed still screen. Every so often you'll see an obvious glint somewhere on the image, which means it's an object you can pick up and use somewhere else in the game's ~puzzles,~ which are nothing more than ~use this key on this door,~ or ~use crowbar on rotting door~. But you never get a real sense of where you can walk -- it's all about wandering around the outer boarders of the screen, hoping your character will trigger the link to the next part of the game's map.  The game's draw is its use of more detailed graphics than the normal Game Boy Color title, as the game is seemingly pushing more on-screen colors for the prerendered backgrounds. The screenshots offered to us several months ago were nearly unbelievable -- and they still are. The images on the Game Boy Color LCD screen are the same ones we've seen last year, but the color depth seems to have been reduced a lot further...almost like the developers threw the game into some sort of mud filter to darken up the graphics. It's still an impressive use of the high-color mode, but it's not nearly as impressive in final product as it was when the game was shown in development.  And because the Game Boy Color's high-color mode is too processor intensive to have both you and enemy sprites moving on top of them, combat sequences have been separated into its own mini-game. Randomly throughout the game your character will jump into gun mode -- it's an isometric, scrolling perspective where possibly a dozen creatures (spiders, wolves, whatever) leap out of nowhere and attack. Your character can rotate in eight directions and shoot, and it'll auto aim if you're facing in a general direction. This mode is very sloppily done, with single color, non-descript enemy sprites...and could have been designed a lot better than it is, but it seems like the designers wanted to try and keep this mode as similar to the ~wandering around~ portion to give the illusion of a ~seamless~ combat system. They failed. I was really looking forward to seeing Pocket Studios and Infogrames' final product for the Game Boy Color -- sure, the game wouldn't be nearly as immersive as the console versions...this is the Game Boy Color for crying out loud. But even knowing the system's limitations, there's nothing here, other than the detailed backgrounds, that I liked about the game. It's a very boring game design, the puzzles are super simple, and the battle sequences are incredibly sloppy. I don't know how the console versions faired, but it's definitely not a keeper on the Game Boy Color.", "date": "Jul 6, 2001"}