{"name": "Sports Jam", "name_review": "Sports Jam", "ref": "https://www.ign.com/articles/2001/07/13/sports-jam", "text": "Although SEGA makes some of the most wonderful arcade titles, porting them to the Dreamcast can be a bit problematic.  I'm not talking in the sense of visual differences; SEGA has done a phenomenal job of making their arcade ports to the Dreamcast fantastic.  The problem isn't the changes in gameplay or controls either  nearly all of the arcade to Dreamcast ports have had excellent control while remaining true to the original gameplay.  Longevity is the main problem with arcade ports; designed as quarter crunchers, where you're putting in a quarter to continue every 10 minutes, not too many arcade ports have had enough replayability to give DC players an incentive to play longer.  It doesn't matter if it's extra modes or online play, DC owners need a little something extra when it comes to the arcade ports.  Crazy Taxi and  Virtua Tennis were excellent examples of arcade ports that had some nice extras to give DC players a lot of bang for the buck.  Therein lies the problem with Sports Jam a great port of the NAOMI-based arcade game but with nothing beyond the arcade play that'll keeping you coming back for more.  Like I mentioned above, Sports Jam is originally a NAOMI-based arcade game developed by WOW Entertainment.  The game is a throwback to the days of Konami's Track & Field, where quick reflexes and button mashing skills were the call of the day.  Remember those button mashing 100m dash events where the faster you could repeated tap buttons, the faster you would go?  Well, Sports Jam takes this premise but adds a new twist to this ~button mashing~ genre.  Rather than using classic track & field events, Sports Jam takes specific situations in popular sports for events  three point shootoust, corner kicks, tennis volleying, football drills, etc.  The control mechanics for each of the events are pretty simple for the most part though some of the later events may require the use of the D-pad and two buttons.  Basically, you compete in four events that you choose... and that's it!  Just like in the arcade, you're playing for highest score total... oh and bragging rights, of course.  Visually, the game is pretty much a carbon copy of the arcade.  Yes, there's a bit longer load times but as far as I can tell, the visuals are top-notch.  I do question some of the animation of athletes, specifically the corner kick event.  In the corner kick event, a team mate kicks it out from the corner and you're supposed to kick it into the goal a la Pele.  Sometimes when you try to perform the bicycle kick, the animation for the kick comes way after the flight of the ball.  Other than that, and a few other small details, the game looks really good and all the details from the arcade are present  even the annoying ~Max Headroom~ announcer is here, a mixed blessing for me though.  As stated above, the gameplay is quite simple, requiring fundamental skills and reflex timing skills.  Almost all the events are pretty fun, especially the more complex events of the hockey goalie game and the tennis target match-up.  Of course, there are some extremely simple ones that are pretty boring, namely the football drill that requires only one button.  But as fun as these mini-games can be, there's the problem of longevity.  Sports Jam comes with an extra ~original mode~ but it hardly differs from arcade mode.  Beyond that, once you master the dozen or so events in the game, you can only raise your score so high before you hit that plateau of boredom.  Sports Jam can be played with another person for two-player versus contests (via split screen), which adds a little life to the game.  Ultimately, Sports Jam is a guilty pleasure that has a lifespan of about a week, with the occasional weekend boot-up with pals come visiting.   --Anthony Chau, IGNDC", "date": "Jul 13, 2001"}