{"name": "Atlantis: The Lost Empire", "name_review": "Disney's Atlantis: The Lost Empire", "ref": "https://www.ign.com/articles/2001/07/17/disneys-atlantis-the-lost-empire", "text": "Even though the publishing and developing duties have often been in the hands of different companies, most of the 3D platform games based on Disney movies for the PlayStation have had a eerily similar feel with the majority of the games being so painfully average that it's hard to tell one from the other.   In the case of Disney's Atlantis: The Lost Empire, which was developed by Eurocom, the company responsible for a couple of other PlayStation Disney titles including Hercules and Tarzan, and SCEA, who published The Emperor's New Groove for Disney, you might still be getting more of the same, but you're getting it done fairly well.   Based on the movie of the same name, which has grossed in the area of $75 million at the box office, the game follows the exploits of Milo Thatch and his team of experts on their quest to unlock the hidden secrets of Atlantis. And thanks to its Disney and movie tie in, the game dishes out an A-quality level of presentation with some amazing animated cut scenes between levels that have been ripped straight from the highly-regarded animated film.  Gameplay The gameplay for the most part is standard fare, but it has a few twists and has been designed so that the player gets a little variety in what's being done. In addition to the standard 3D platform elements that include jumping from platform to platform, standard puzzle solving and shooting enemies with projectile-based weapons or attacking them with hand-to-hand combat, there are four unique vehicles that can be driven and the gameplay is split up between the game's six playable characters.  Each of the characters has his or her special abilities and each are needed to progress through the game. The implementation of this is quite as deep as it should've been, but it does provide a nice change of pace during the game when you have to switch between characters. Where it goes wrong is that the player isn't really given a choice in these situations and is forced to go with the specific character needed for each particular obstacle. There's not any thinking involved in figuring out who you must use as it's either painfully obvious or you're just told who you should use.  In any case, it's pretty clear that this game is aimed towards a younger crowd and because of that, more experienced gamers should expect to fly through the game's 12 levels in a matter of hours, even if your intentions are to collect every single special item in the game to unlock things like all of the available movies. Novices will find that the game does have some challenges and thankfully none of it really has to do with fighting with the controls.   The characters respond quickly and aside from a few areas where you'll encounter your typical camera problems, there's not much to complain about in regard to how the game controls. Whether moving around any of the six characters or maneuvering any one of the four craft, it's easy to do exactly what you want to do and the general response is about as good as you'll get.   Graphics While I'd still prefer that a Disney-based game be done in the same art style of the movie, the game's developers have done a fine job of bringing some of the flair of the 2D characters from the animated film to the 3D world in the game. The characters and monsters all have a pseudo-animated look to them and while it doesn't quite have the impact of the 2D characters from the film, it more than gets the job done.   The visuals on the whole are pretty standard stuff when compared to other games on the system. It's not quite in the same league as something like Rayman 2, but then again, not many games are of that caliber on the system. The game looks good and there aren't any significant graphical problems to speak of that aren't common in all PlayStation games.  Sound As is the case with just about every single Disney game ever made, Atlantis gets very high marks in the area of sound. The voice acting in the game and throughout the cinematic cut scenes is some of the best you'll find in a videogame and the game's soundtrack is commendable, even though it isn't quite in the same league as previous efforts in Disney titles. Disney's Atlantis: The Lost Empire is a really fast-paced 3D action/adventure game that brings enough fresh new elements to the table that makes it deserving of a look if you're still in the market for games of this kind on the system. The use of the different playable characters could've been handled a lot better, but even as is, it still helps keep the gameplay varied and this is even helped out more by the excellent mixture of standard platforming elements with vehicle-based sections. It does by no means re-invent the genre, but it's a solid effort that's turned out to be much more enjoyable than I ever thought it would be.", "date": "Jul 17, 2001"}