{"name": "Tiny Tank: Up Your Arsenal", "name_review": "Tiny Tank: Up Your Arsenal", "ref": "https://www.ign.com/articles/1999/09/04/tiny-tank-up-your-arsenal", "text": "In the over-packed world of wacky, hip, system mascots with attitudes, AndNow and Appaloosa's Tiny Tank is both a welcome refreshment and a me-too contestant. Tiny Tank is a highly technical little battle tank that can take on the biggest and baddest of evil overlords, and yet he's part slacker and a part New York personality, too. Yes, a tank with an attitude, but no blast processing or RDA, thank you, just an attitude, a big fat attitude problem.  Gameplay Tiny Tank is cool in many ways. First of all, it's a perfect PlayStation game because it marries the hardcore shooting and action aspects still burning at the system's heart, and pleases those younger players to whom Mario, Sonic, and Crash are the end-all-be-all. He's cute, but only because his makers created him that way. If it were up to Tiny Tank he'd be the ~Mechanicore: Tank of Doom,~ as he says in the intro FMA. He also swears mercilessly. Of course, all of the bad words are bleeped out, so Tiny is kid-safe. Thankfully, Tiny Tank is funny and chatters sort of like the trio of noodle-heads on Mystery Science Theater 3000. ~Tiny Tank is my slave name.~  Aside from his smart-aleck attitude, Tiny Tank is decent shooting game, packed with 25-plus levels and a solid amount of variety. For the most part, levels are search-and-destroy missions, mixed up occasionally with sheer blasting levels, and objective-based missions. After having played a million games just like this, I have to say none of these missions were original or stunningly unique, so while they're fun for awhile, the long-term value of the game for me was lessened. However, the quirky Tiny is funny enough and the missions not so complicated that a younger generation of kids are going to love this game (which is one of the reasons it was delayed and Sony picked it up last winter).   Each level takes place in the future, July 4, 2194 to be exact, after Tiny Tank's arch nemesis MuTank mistakenly takes over the earth. The levels range from inside to outside environments on which nearly everything is traverseable, hills, tunnels, small mountains, ice berg patches, you name it. And if Tiny can't reach it by simply rolling over it, he has booster rockets that propel him into the air momentarily to reach weapons and artillery.   In essence, Tiny Tank plays very much like the tanks in StarFox 64, but he's even more versatile. Tiny can strafe by hopping or rolling, he can boost into the air, his head is a turret that can move independently of the direction he's moving, he can't run out of ammo, and, best of all, he's totally configurable. Tiny picks up weapons from dead opponents and adds them to his arsenal in graphic realtime, so you see everything attaching on-the-fly. What's even better is that by pressing select, players can rearrange the location of any new weapon to the front, back, side, etc, and arm them appropriately, with less or more firepower. Easily configurable tanks can't be anything but way cool, and Tiny Tank is no exception.   Tiny also can receive messages from HQ, pick up Nanometal (that increases his regenerative powers) and collect P-brains (to increase his intelligence). The weapon list is quite formidable, and includes a gattling gun, XA-12 Rocket, mortar, freeze gun, super blaster, pop gun, plasma blaster, flame thrower, and impulse gun. Occasionally, Tink Tank picks up funny things, too, that have nothing to do with powering up. In the first level, by beating Black Bart (a badboy cowboy robot with a 10-gallon hat guarding a generator), Tiny picks up Bart hat and continues to wear it. Quirky, funny, cool.   The last little cool things that help to increase the playability at least a little bit are the Teeny Weeny Tanks, Little versions of Tiny, these puny tanks can be set to three different settings, depending on how many brains you pick up, hunt, gather, and protect. The game's overall playability isn't monumentally altered by these little helpers, but if you manage them deftly, they do come through in a pinch.  Graphics The graphics overall in Tiny Tank are decent; they do they job. But the game looks like it should have come out last year (1998), when it would have looked better. Let's just say it's not the latest generation of graphic detail nor does it push the PlayStation's technical envelope. Having said those awful things, the game does contain several nice graphic touches. Tiny's different parts all move accordingly to the terrain they move over. And Tiny's ~face~ is animated to move, too, which is a nice little extra. Lots of lighting effects crowd the screen (from all kinds of laser blasts) while giant robotic enemies walk across the screen with less frame rate drops than I had expected. In other words, the final version of Tiny Tank has a solid to good frame rate that keeps the fluidity and smoothness flowing. Pop-in in large areas is a regular, mostly because the levels weren't designed to prevent it, and occasionally, levels are unnecessarily dark.  Sound Tiny Tank accels in the sound department. In several levels, players hear a radio playing (apparently you're hearing it in Tiny's head through his receiver), but it's not Live 105, smooth and easy listenting. It's robot radio, the music and the advertising, and it's a riot. Ads for oil and weird robot necessities are just enough to push you over the edge. If Tiny Tank does one thing extremely well, it makes you laugh. Tiny's own heckling come s in often, too, and smartly, it's not too often. Occasionally, Tiny says the same thing, but usually in a new level, he pulls out the new asides and one-liners. In the end Tiny Tank is a fun little game. It's filled with great humor and obscure touches that surprised me throughout the game. It's definitely a one of a kind game, no doubt about that. And I liked Tiny's personality. He's funny, he swears, and if he were an actor, he'd be a dwarven Bruce Willis. My gripes, as already stated, are that as an adult it was funny but possibly at the cost of being a rather ordinary shooting/action game. The level design is average, and the variety of the levels isn't much to write home about. Tiny Tank is funny, but not inspiring. Quirky, but possibly unworthy of purchase. For me it's a rental. For a 13-year-old boy, it's probably a must-have game.", "date": "Sep 4, 1999"}