{"name": "Anachronox", "name_review": "Anachronox", "ref": "https://www.ign.com/articles/2001/07/18/anachronox", "text": "For the last few years, RPGs have been segregated into two categories: the traditional ~American~ PC RPG, and the console-style games coming out of Japan. American PC RPGs generally followed more pen-and-paper routes with less a linear and freer form adventure. On the other hand, Japanese console RPGs tend to be more of interactive stories with much more linear adventures due to the stronger focus on the narrative flow.   While console RPGs out of Japan have always excelled, and American RPGs on the PC were always the top in their genre, there has really never been an American made console-style RPG that could truly hold its own against the work coming out of Japan. Until Anachronox. This sci-fi adventure is one of the first RPGs from an American developer that successfully follows the style set by traditional console RPGs, even if it is on the PC.  Anachronox tells the story of, well, Anachronox. The strange name applies to a giant floating artificial world that lends its name to the title of the adventure, even though the game simply uses the planet as a springboard to larger things (such as, say, saving the entire universe). Your main character is Sylvester ~Sly~ Boots, who has a striking resemblance to the former IGN PC tyrant, Trent Ward.  Sly starts off on his own (aside from his holographic companion who gives you tips from time to time), in debt, and simply looking for a way off the floating artificial rock that he reluctantly is calling home for the time being.   The slow and drawn out first couple hours of the game take place on the rock with Sly running around and performing errands. Eventually you'll actually get another party member (believe me, when you do it will be nice to have a little variety), and that number will grow as you progress through the game. Just wait until you meet the superhero.  You heard me correctly; I said ~superhero~. Red spandex clad with a big ol' yellow fist on his chest. Seem kind of out of place in a sci-fi RPG? Well, thankfully Anachronox has a fantastic sense of humor and that's one of the game's strong points. The level of humor is actually very similar to those in the classic Lucasarts Adventures such as Sam and Max: Hit the Road and Day of the Tentacle. Somewhat cocky, always funny, the humor in the game is such a welcome breath of fresh air in a time when very few games actually make you laugh like those classics did.  The game holds more in common with console RPGs than traditional PC games in the genre as you're mostly on a set linear path. Once in a while there will be a very small side quest (as with all RPGs), but nothing like the multitudes of quests in games such as the Baldur's Gate series.   As the game is using the Quake II engine, it's understandable that the game utilizes a control scheme that is commonly used with the engine. The game used a behind the back camera placement where view is controlled by the mouse, while movement is done by the W, S, A, D keys. This actually takes a little while to get used to as A and D actually turn you to the left or right instead as the commonly used strafe, but once you get the mouse/keyboard movement down it will not even be an issue.  Speaking of the Quake II engine, it's one of the things that hurts this game. While it does push the engine to its utmost limits, the game just looks so dated. Characters are very blocky and low poly, and their fists look like blocks. I mean, why do they need weapons in the game if they can just smash an enemy over the head with their massive block hands? Despite that the graphics are totally at a loss. Most of the environments look really good and are full of detail and life (such as people going about their day and little thing such as ships coming and going), and the use of multiple cinematic camera angles gives the game a good, if slightly dated, look.  Music and sound fares much better than the graphics. A ~Sci-Fi~ style soundtrack fills the background, and the voice acting is top notch. The humor in the text of the game filters itself right into the dialog of the characters, and the voice actors pull it off flawlessly. Very nice indeed.  The final piece of the puzzle is the combat system. Thankfully, there aren't any annoying random battles as you run into pre-determined battles, but the combat system is definitely ~console-style~. You have up to three characters in your party and you face off against any number of enemies in semi-real time combat. Each character has a ~ready meter~ that ticks down until they are able to take another action. Console gamers would probably recognize this best as the active time battle meter from the Final Fantasy series.   Magic is handled by the Mystech system, which is a series of rocks that enable the characters to cast ~spells~. Attaching bugs to it called elementors, which further enhance the magic system, can then enhance these rocks. The little bugs can even be leveled up to add to their power. This has been done in RPGs before, but any added depth to a game is good.  Where other attempts by American developers have flopped when they try to duplicate the console formula, for some reason it just works in Anachronox. Despite the aged graphics, the game makes you laugh and once you get past the first couple hours you'll find a truly fun RPG. While it isn't the 200+ hour monster that most PC gamers are used to (see Badur's Gate II for that), it will keep you busy for over 60 hours, and for a console-style RPG that is a very good length.  Hopefully Anachronox is a sign of things to come. Finally, an American developer has created a console inspired RPG that isn't destined for the bargain bin within a week.  -- Jeremy Conrad Want to share your opinions with the world? Talk about it on the IGNPC message boards,  orsend some mail to IGNPC about this story.", "date": "Jul 18, 2001"}