{"name": "Dragon Quest 3", "name_review": "Dragon Warrior III", "ref": "https://www.ign.com/articles/2001/07/20/dragon-warrior-iii", "text": "When Enix released the Dragon Warrior I & II game pak last year, I was a bit skeptical. Sure they were planning to upgrade it, but how much better could the game become if it were done on the Game Boy Color? Much to my surprise, I soon found out that the game remakes were of far greater quality than the originals, with upgrades to the game mechanics, graphics and sound that really made me realize that Enix still had the utmost respect for a game that was father to an entire genre. Fortunately for gamers everywhere, Enix has once again taken a Dragon Warrior title and given it the royal treatment. Dragon Warrior III is now here and it was definitely worth the wait!Features More than 150 different monsters to fight Nine different character classes Battery Back Up with special ~save anytime~ field log Monster medals to collect and trade Only for Game Boy ColorDragon Warrior III is essentially the prequel to the series, taking place years before Hargon and the Dragon Lord began their reign of terror and destruction. Players assume the role of a young man who carries a heavy burden. Upon turning sixteen, the King confronts you, challenging you to perform the task that your father, the brave knight Ortega, had failed to execute some sixteen years earlier - destroy Baramos, the Demon Lord. Sounds easy, right? Yeah, nothing your average 16-year-old kid, who just happens to have his Mother show him where the castle is at the beginning of the game, can't handle.I'm not going to get overly descriptive when it comes to gameplay, considering that, for all intents and purposes, most role playing games play the same. You take on quests, gain party members, build up experience points, find items, procure money and fight evil in whatever incarnation is available at the time in order to ultimately save the world from a big bad guy (in this instance, Baramos would be the Demon in question). As with most RPGs, Dragon Warrior III utilizes a simple menu system which allows for simple use of items, equipping weapons, etc. and turn based combat in which you can fight, defend or flee like a wuss. However, there are a fair amount of new features which make it stand apart from not only other games in the series, but also other games in the genre.Parties consist of four distinctive characters, including the main character. At the beginning of the game, your character is assigned a unique persona and rank, which is based upon a series of questions, asked of you by some unknown force which ~represents all~. By answering questions such as ~Is victory earned in battle~ or ~Do you prefer to fight with magic rather than fight with a sword~, the all-knowing force gives you a tarot type reading of who you are, similar almost to the Ogre Battle games, and starts you on your way. It's an interesting way to establish a character and is, in some ways, insightful. Once this has been done, you begin the game and eventually plan out your party. The three remaining characters can be chosen from one of seven classes, Warrior, Fighter, Mage, Cleric, Dealer, Jester and Thief. Each class is unique and has something to offer the party whether it be heightened magical stats or increased fighting ability.Another way in which the game deviates from the norm is with the addition of ~Monster medals~, trophies of a sort which can be traded from player to player via the link cable. Even though this is a definite nod to Dragon Warrior Monsters, it sure makes finding the 150 monsters a real challenge in and of itself. Different monsters will appear depending upon what time it is in the game and players will have to work their tail off to actually get all 150 medals. I didn't mention that before, did I? The game shows the passage of time, with day and night coming and going throughout your quest. It's a cool feature and makes for entertaining monster-hunting expeditions!Another nice addition to the game is the inclusion of new items. Dragon Warrior III on the GBC features twice as many items and armaments when compared to the NES version. Whoohoo!Again Enix deserves the highest praise when it comes to their loving attention to graphics, or in this case the re-designing of graphics. From the look of the first scene, in which your character walks from a lush, verdant forest onto an isolated rock ledge overlooking a waterfall to the lavishly designed towns and locations, Enix proves that this is a game close to their hearts. All of the landscapes, which change graphically when representing the passage of time, characters, who all share facial expressions, cut scenes, and monster designs are opulently detailed and exquisitely colored. For GBA gamers, be aware that the game is at its optimal for the system it was really made for -- the game tends to be a little darker all around, contrast wise, when played on the GBA. Colors overall seem perhaps a shade darker, but it's otherwise not a real big worry to play on the new system. The only real downside to this Dragon Warrior's graphic splendor would be the lack of backgrounds during battle sequences. This is easily overlooked once you see how beautifully animated the creatures are during the battles. Incredible. Simply incredible.The music is rich and full, making quite an impressive transition to the GBC. Almost all of the music has been ported over from the NES version with changes made that only improve upon the quality. Serious fans of the series will recognize many of the games overtures and themes, while newcomers will be completely enthralled with the musical ambience that Enix offers.Sound effects could've been a bit better, maybe if they had been given more of a digital sound type treatment, perhaps something reminiscent of the game Warlocked. Yet even so, the sound effects do their job above and beyond what most games today have been shown to do, giving berth to a wide array of different sounds that fit well in context with the game.What else is there to say? With a compelling storyline, astounding graphics and beautiful music and sound, simple gameplay and being one of the largest RPGs on the GBC to date (spanning over 40 hours), Dragon Warrior III stands apart from the multitude, a shining example of what the definitive role-playing experience on the GBC should be. Simply put, this is one of those must have games in your game library. Again, my kudos and highest regards to Enix on a job well done!", "date": "Jul 20, 2001"}