{"name": "767 Pilot In Command", "name_review": "767 Pilot In Command", "ref": "https://www.ign.com/articles/2001/07/23/767-pilot-in-command", "text": "Before I dive into my review I want to state that I am a Microsoft Flight Simulator junkie.  I own almost all the add-on packs that are available on the market, and I've logged quite a number hours in front of my PC (as my widening butt will attest to).  So I can say I'm a pretty good judge of Flight Simulator Strap-Ons (Oops...I mean Add-Ons).  So for the 10% of you gamers that play these kind of games -- read on.  For the other 90% who think watching grass grow is more entertaining that a Simulator game, click on through to your favorite porn site.    As you're well aware, Microsoft Flight Simulator 2000 is the flight sim of choice for your PC.  Many add-on packs have been produced over the years ranging from ~Airport~ (another Wilco title), to AETI's ~ProFlight~ series which adds ATC (Air Traffic Control) to the game.  All of these further enhance your flight time with cool sounds and detailed scenery at major airports around the world.    Wilco Publishing's ~767: Pilot in Command~ is their latest offering in the world of add-on packs.  They have done an excellent job of creating a very detailed add-on which should become a part of any Flight Simulator fan's collection.  Before you start up Flight Sim, you'll need to check out the manuals that come with 767: PIC.  What you say?  Where are they?  Look on the CD for a couple of Acrobat files which are key to your understanding how the heck to fly one of these beasts. You really need to read these over to learn the instrument panel, operation of the FMC (Flight Management Computer), and how to complete checklists.    There are 12 planes that come with 767: PIC, featuring a variety of carriers (all name-brand mind you, not the annoying made up ones that come with Flight Slim).  From the outside they are very detailed, right down the rivets.   Looking in on the cockpit, it is clearly not the Tinker Toy panel that comes with Flight Sim.  This is the real deal with all the buttons and levers you would see in a real cockpit (even the Fasten Seat Belts button with the cool noise). You'll also find FMC (Flight Management Computer), autopilot. Radios, and other goodies you've come to know and love from playing Flight Simulator.  All of the gauges are interactive and realistic looking.    Now that you're ready to fly, you can pick a plane to fly from the Aircraft menu, or try out one of training missions which comes with 767: PIC. There are three modules in 767: PIC to choose from: Routine Procedures, Failures By Level and Random Failures. Each of the training missions presents new problems to face during flight. The training modules are a nice addition to the product.  They will teach the future buzz-boy how to overcome problems such as the fuel pump failing and the landing gear not going down.    After pouring over the manuals and several training missions I flew from New York's John F. Kennedy airport to San Francisco International.  Once I got airborne the plane handled like a big boat  took longer to bank and climb than in the 737 provided in Flight Sim.  I was pretty surprised at how nice the FMC performed.  It was realistic with high points of elevation and nearby airports.  The only item missing from the FMC is tall buildings (which current 767s have installed on FMCs -- at least here in the U.S.).  But to be honest I didn't care, I was enjoying the view at 35,000 feet and torturing the flight attendants by making them sit every 5 minutes.  Oh the joy of the Fasten Seat Belt sign!    While taking off, I noticed the cool new jet sounds that 767: PIC adds to Flight Simulator.  While not a big thing, it definitely added to the realism of the flight.   767: PIC has several ready-made flights for you to try.  I flew the Gatwick (London) to Rome route.  The adventure was pretty realistic as the plane gets a pushback from the terminal.  You'll also hear the flight attendants going through the safety briefing and also announce when it is safe to stand.  Once again, the small things such as these added to the overall experience.    On a recent flight to the west coast (a real flight, not of the PC variety) I sat next to a veteran airline pilot who flies 767s for a living.  I showed him cockpit screenshots from 767: PIC.  He couldn't believe how detailed the cockpit was and he thought the documentation came from a Untied Airlines ground school.  Needless to say he was impressed.  Then I asked if I could date his 24 year old daughter.  That kinda ended the conversation.   So what we have in the end is a great add-on pack for Flight Simulator 2000.  I recommend that only hard-core flight-sim buffs purchase this title due to the high learning curve.    But if you want to learn how to fly a 767, or if you're really into Flight Simulator, this will be a great addition to your library.  With great graphics, realistic cockpits and attention to detail, 767: Pilot in Command is a must-have for the hard core Flight Sim fan.   -- James Beane  Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Jul 23, 2001"}