{"name": "Cultures", "name_review": "Cultures", "ref": "https://www.ign.com/articles/2001/07/24/cultures", "text": "I have to say that I'm a sucker for games like this. I love the charm and character that goes into them with their cartoony graphics and the variety of animations. Games that let you construct villages or cities from just a few pieces of wood and some dental floss into a thriving little metropolis really hold a dear place in my video gaming heart. And this quirky little game called Cultures from Funatics definitely had some features that I could get into along with that charm I mentioned... but it's just so freaking slow. Everything these little Vikings do takes forever. If the game had just had a hotkey adjustment for speed or at least had been sped up a little bit overall, I probably would have liked it quite a bit despite some of its other smaller problems.  For those that don't know, Cultures follows the story of a village of Vikings that have reached their end. The sun hadn't come out in ages for the crops to grow and their stores were running out quickly. Everybody was in desperate need of some Prozac, babies were crying, people's shoes and socks were wet (you know how annoying that is) and generally everybody was on the verge of giving up. But then one day a fragment of the sun came hurtling out of the sky and broke into several pieces. One of these pieces landed at the feet of one of the villagers signifying that this was a sign from the gods. This little village's new lot in life was to travel the world and locate the remaining pieces of the sun.   Missions start out with you and some villagers landing on a new shore to either grab one of the pieces of sun or to stock up on some more supplies. When beginning a game, people that are familiar with most resource management games will be pretty familiar with the progression of what is supposed to happen here. First you'll need to get some housing and food production going. Then you'll have to get infrastructure moving by getting wood cutters out there along with hunters to gather more food and leather. Eventually, you'll have to stick some more villagers into jobs such as shoemakers, miners, sheepherders, druids, and fighters.  But the catch here is that extra people don't just show up. You're going to have to breed them. First you'll have to marry a couple of the villagers to each other. At that point, as long as the couple has a place to live, you can right click on the female and select which gender baby you would like them to have. Once they have enough food in their living space, they'll go in, a little hanky panky will ensue, and then a baby will be delivered to their doorstep via the stork. After they've matured, they'll be fully functional members of society. As weird and corny as it sounds, I really did like this part of the game as it allows you to get a little more attached to you villagers in the game. You can rename any of the Vikings at any point as well, so if you rename them as you go along, it'll be easy to check in on them and see how they're doing.  In order to have a successful village, you're really going to need to have your villagers humping like bunnies for a while to fill out all of the various jobs you'll create with the different buildings in the game. Any of the male villagers will be able to occupy any of the jobs and have more than one area of expertise. Villagers have to learn each of the occupations over time. Once they have learned, and you have built a school, the information will be stored for any of your villagers to learn. This makes at least one tedious part of the game a little faster in the future so that once a new Viking has matured, you can send him to school and teach him what he needs to be an efficient member of society. Each of these member then supposedly become individuals with their own personalities and the like, but it's hard to tell how they differ aside from how lazy they are, which I generally attributed to if they had a house or not. They do have certain needs which you can see by clicking on them. They have to have sleep, food, entertainment, and religion. It's a little like The Sims in this respect, but not nearly as extensive.  Objectives in the scenarios range from trading to military actions in order to procure pieces of the stone or defend your village. Trading in the game is pretty simple, if a little annoying. In order to trade with another culture, you'll need to set up signposts with a scout, which can take a while as they walk so freaking slow. But once they're set up showing your merchants the way to the friendly villages, you'll be able to set your trade route and what you want to trade very easily and not have to really worry about it again.  Combat in the game is not a hugely important feature. While you will need to employ force to attack and defend at some points, there isn't a whole lot of strategic manuvering here. Every culture has the same units that move at the same speed. There are the spearmen, the swordmen, and the archers. You can figure those out pretty easy. It's evident that they didn't intend this game to be a tactical blockbuster. It is interesting when you mix this with the need to actually birth and raise new Vikings if one is lost however. It definitely makes your decisions to fight a little tougher. Not only do you have to take all that time to get a new functioning adult, but you may have also have named him and grown some attachment there. It was a sad day when my first warrior crumbled into a pile of bones. Poor JujuThor, we knew you such a short time, yet you lived through such gloriously silly battles.  But like I said before, besides some minor considerations like not being able to tell your workers which warehouse you want their goods delivered to, the biggest fault here is the incredibly slow pacing. There is a cheat code (hit F2 and type funspeedup) that sends your villagers into a super fast frenzy, but this is a little awkward and different levels of speed besides super slow and super fast would have been appreciated. I really dig these kinds of games as they allow you to plan things out and try new build orders and see how they work. But when it takes years to construct buildings because your Vikings walk too damn slow, even after you've built roads, and sleep all of the time, even after they have a home and a wife to cook their lunch, it gets tedious. There's only so much you can take of that kind of slow gameplay.  This could have been another good addition to the ranks of games such as Settlers, but it just falls a little short. I like relaxing games, but I also like to be able to move on to the next challenge before any children I actually have grow up and begin their own careers as iron smelters or mushroom collectors. I usually like to play games like this after a scenario is finished just to see how big I can make my village, but that would have taken a long, long time. I found myself just pushing on to get farther in the game instead of just sitting back and enjoying the experience. This game almost had something, but was just missing a couple more pieces of that sun that would have made it shine.  -- Dan Adams Want to share your opinions with the world? Talk about it on the IGNPC message boards,  orsend some mail to IGNPC about this story.", "date": "Jul 24, 2001"}