{"name": "Gundam: Journey To Jaburo", "name_review": "Mobile Suit Gundam: Journey to Jaburo", "ref": "https://www.ign.com/articles/2001/08/01/mobile-suit-gundam-journey-to-jaburo", "text": "Bandai America is a strange company, even stranger at times than other semi-autonomous puppets of hulking Japanese parents.  It does things for reasons no man can understand, because its decisions are made by some strange group-mind suspended over the Pacific between the Japanese suits on the one side and the American suits on the other side.  This is why you see stuff like Dragon Ball GT Final Bout released in a tiny limited run in the United States, which is confusing for many reasons.  On the one hand, it ought not be released, because it is the worst fighting game ever made; on the other hand, legions of slobbering fanboys will buy it; so Bandai compromises and releases only a small quantity of copies, meaning it is eventually sold on Ebay to the extremely stupid for large sums of money.  Strange phenomena are spawned by Bandai America.  I'll leave aside trying to make sense of Digimon, because that just makes my head hurt, and move on to the game at hand, Mobile Suit Gundam: Journey to Jaburo.  This is the American version of the Japanese Mobile Suit Gundam game released last winter, retitled with a reference most Americans won't get, which leaves me wondering why they bothered.  It's a 3D action retelling of the first Gundam TV series (which only a tiny handful of Americans has actually seen), letting you replay famous episodes and missions in the cockpit of your own RX-78.  As Gundam games go, it's alright, and as drooling fanboy bait it's first-rate (aside from the inescapable English dub), but for mecha action on PS2 you can do a good deal better.   Gameplay  Gundam doesn't have the same control scheme as Armored Core 2, and it has a different set of problems, but the feeling of playing it is nevertheless hauntingly familiar.  There's analog control here, and an automatic lock-on, but that lock-on isn't all that friendly much of the time, and it doesn't work terribly well with the weapons suite.  The result is a lot like what happens when you're playing Core -- you spend a lot of time flailing about trying to track fast-moving enemies, balance between aiming and dodging, and figure out how on earth you're supposed to get anywhere near an airborne opponent.  Aiming on the Y-axis is similarly problematic.  If you're looking straight at a flyer, it's no big problem to take them down with the beam rifle, but you're not likely to have much luck trying to lead a target moving perpendicular to your line of fire, and the auto-aim will place the shot well behind them.  Hand-to-hand combat is pretty clumsy, too.  The perspective makes judging the range of your beam sword a questionable affair, and even the cutting-edge RX-78 moves in fairly clumsy fashion.  The lock-on works better for close combat than marksmanship, though -- you can at least hit something if you're willing to charge them head-on, and the Zakus aren't quite fast enough to Heat Hawk you to death in that sort of situation.  The game is still playable, keep in mind, just rather clumsy.  The difficulty level balances some of the problems with the control, though.  The mission design doesn't seem to frequently present you with particularly difficult challenges, although the variety is nice -- attack, defense, escort, and other missions appear.  Heck, even Char isn't much in the way of opposition.  Circle-strafing is an effective strategy against most MS opponents, and there are few other enemies than can inflict a whole heck of a lot of damage.  Your allies, the Guncannon and Gun Tank, are there mostly for window-dressing (while appreciated, they're not particularly effective), but then you don't seem to need them terribly often.  Graphics  It doesn't look perfect, but this is a serviceable 3D rendering of the mechs and scenes from the anime (after all, the original Gundam TV series is more than 20 years old).  The Mobile Suits are smoothly modeled and textured, especially the Zakus, and there are some fun little effects like light trails behind their cyclopean eyes.  On the other hand, the environments aren't often much to write home about, with some interesting bits of architecture at times but frequently bland textures.  Occasionally you'll have to deal with a very short range of vision, too, when an area uses the cover of night to hide a short draw distance.  The special effects, likewise, feature small highlights amid a generally bland package.  The explosions are nice, but the lighting is only fair, which doesn't do a great deal in conjunction with the relatively basic textures.  In general, the game doesn't stray too far in a visual sense from the show that inspired it, which you can take in whatever way you please.  Crazy Geek Stuff  This, of course, is the really important part.  Bandai games are not necessarily intended to be games -- they are conduits designed to funnel money from crazed anime geeks into the anime/game/toy death conglomerate's coffers, and so plenty of goofy extras are on the agenda.  MS Gundam is a prime example of this, including dozens of cutscenes and hidden original animation sequences to overcome the better nature of the game enthusiast/Gundam fan.  This really gets interesting when you unlock the battle mode and start finding the hidden animation sequences -- opponents join the fray from 0079, 08th MS Team and every series in between, and once you beat them, you get to see original movies from their various settings.  On top of that, there's the basic fun of just being able to play the original story, since the game sticks so faithfully to the structure of the Gundam TV series.  Of course, it would be really entertaining if you didn't have to play as Amuro, considering what a hosehead he is, but I understand the need to put the player in the role of the hero.  Anyway, if you want to root for the bad guys, that's what Zeonic Front is for.  The dub?  Well, what's there to say?  I could go into a thorough discussion of why dubbing OG Gundam is an utterly ridiculous decision, since you're not going to meet many fans who enjoy both dubs and 22-year-old TV series, while most people who are into stuff this old-school hate dubs, but there would of course be no point to that.  Thus, I'll just say that the game is dubbed in English, and you can probably live with it, although it's disappointing to see so many classic characters without their classic voices.  But dubbed or not, there's an awful lot of classic Gundam stuffed in here, and classic Gundam fans should accordingly take note.  The game end of things is actually pretty good by Bandai's standards (remember that this is the company that made the Dragon Ball 3D fighters, among other crimes against Art), and the goods are delivered when it comes to fanboy appeal.So it's not a recommended purchase for those who aren't fans of the series (and Gundam Wing followers are advised to stay well away), but it was never intended to be anything else.  Bandai knows where its bread is buttered, after all, and I see no reason to fault them too greatly on that account...", "date": "Aug 1, 2001"}