{"name": "WWII Online", "name_review": "World War II Online", "ref": "https://www.ign.com/articles/2001/08/06/world-war-ii-online", "text": "From a standpoint of concept, it's one of the most ambitious games around. But people don't play concepts; they play games. That's where things tend to break down. With some rare exceptions the game is extremely unrewarding as a consequence of both technology and design. We posted our initial impressions about a month ago and promised to bring you the full review once things got a little more stable. Well now the game has been out for two months and things are a little better but not much.  For those who don't know, World War II Online (WWIIOL) is the first of the persistent electronic battlefield simulations to make it to release. You and thousands of other players log on and become infantrymen, tank commanders and pilots in a massively multiplayer environment. It's been a dream of gamers and developers for a very long time now and, sadly, the full realization of that environment is probably still a few years away. As it is, gamers who have already shelled out $40 for the game have to contend with massive and numerous patches. Better still, some of the game's promised features -- persistent scores and rankings for one -- seem to be missing altogether.  The success of a game like this is proportional to the number of people who are playing at any time. On that score, WWIIOL falls short of expectations. The initial concept of a single server for the whole community may have been too ambitious. Still, while the various servers that are running might be heavily populated, the fact that these players are scattered across a map of Europe tends to put players at a distance. It's not uncommon to have to travel around for fifteen or twenty minutes before you encounter the enemy. Hell, sometimes you can go around for five or ten minutes before you even see another friendly player. In this respect, the game fails to deliver the massive combined arms battles that one would expect.  And the lack of cooperation and cohesion is unfortunate. Trying to get the various players to get together for an assault is an exercise in frustration itself. The moreso given that the rest of the players are having the same problems connecting that you are. You'll sit on a truck for ten minutes while the various infantrymen get their act together and join up. By the time you make it to the battlefield you'll have spent a good twenty minutes in the game. I should also mention that far too many players are opting for tank or plane roles as a result (although the time it takes to reach a battle in a tank is also prohibitive).  I'm amazed that the vehicles are modeled so well. Each of the tanks and planes in the game feels distinct and unique. They all look spectacular with moveable control surfaces and fully modeled, 3D interiors. Having said that, the physics modeling might be a little too severe. I appreciate the effort that goes into modeling torque for the planes or adding ten separate gears for a tank but the casual player is definitely going to be put off by this. Planes bump and jerk during take off and tanks tend to flip over a little too easily. The blackout effects for the planes seem to occur without any mercy or warning whatsoever. Who cares if it's realistic if it isn't any fun?  The graphics in the game are actually really decent -- as long as you consider the enormous scope of the project. The 18 different vehicles are very detailed and the environments are genuinely believable. Lots of trees, buildings, rivers and hills make the terrain a real part of the action. Still there are some clipping problems here and there and the time of day lighting model still seems to have some occasional issues. You'll go from the middle of the night to pre-dawn to night to afternoon back into pitch black all within the space of a few minutes.  Lag and frame rate problems also seem to plague the game. When the servers are full, you can have some really long load times and even when you do manage to connect, you can count on serious slowdown anytime more than a handful of people are on the screen. I found that it was nearly impossible to connect on the weekends or later in the day. You can get on much easier in the morning but there seem to be less people playing at those times. I was running a solid 20 or 25 frames per second for the most part (although the frame rate drops to a ridiculous 10 or 15 the second you step into a plane). It's not so bad but it does tend to get distracting after a while.  While we still feel it's important to give online games the benefit of a few extra weeks before we do the full review, it's getting past the time where we should tolerate another flawed launch. All persistent online games require a period of balancing and tweaking post-release -- that's totally understandable. But in the case of WWIIOL, the game was rushed out the door long before it was ready for serious public handling. Part of the decision must have been the D-Day anniversary but I can't understand why the publishers felt the need to get the title in stores so quickly. It's obviously not in competition with any other titles on the market right now. Silent Hunter II, Destroyer Command, C&C Renegade and Ghost Recon are all close fits, but they don't even come close to delivering the same experience lying dormant in WWIIOL.  It's been a real hardship for me to give the game as low a score as it's getting. For me, very few games have seemed so exciting in their pre-release phase. I've been anticipating the electronic battlefield for some time now and while it's exciting to see this first attempt, there's still a lot of room for improvement. The primary issue seems to be stability. A game as unreliable as this one is currently isn't worth the $10 a month you'll eventually have to pay to subscribe. (PlayNet has not begun billing for this service as of the writing of this article.) But developers must also address the challenge of providing a game that's real enough to please hardcore fans but approachable enough that casual gamers will flock to the servers in sufficient numbers to provide a real sense of battle.  -- Steve Butts      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Aug 6, 2001"}