{"name": "Gran Turismo 3", "name_review": "Gran Turismo 3 A-spec", "ref": "https://www.ign.com/articles/2001/08/07/gran-turismo-3-a-spec", "text": "When I think of GT3, the words ~much hyped,~ ~highly anticipated,~ and ~killer app~ immediately spring to mind. Let's face it, unless you're a PlayStation 2 owner who has a really, really, really deep-down hatred for racing games, GT3 is the most important release yet for Sony's l'il black box.  Sure, there have been some really good releases on the system already, but GT3 pushes PS2 software to new heights. Graphically, it's a marvel. Super-smooth, incredibly detailed and stunningly lifelike, GT3 raises the graphics bar several notches beyond any racing game we've ever seen before, inside or outside of a videogame arcade. Phenomenal object modeling is combined with amazing attention to detail and astounding lighting to deliver a simply incredible racing experience. The way the sun bounces off the road as you turn corners and glints off the metal and glass surfaces of the cars completely fools your eyes into believing they're watching real cars drive around real tracks. The shadows and lighting are used to really bring the environment to life and make it look more solid, more visceral and more realistic than any other race game.    Sound too is amazing. You can really hear the difference in the car engines, from the low rumble of a big-block monster like the AC Cobra to the tortured scream of the high-revving S2000, each car plays its own music. The sound effects are also that much clearer and more detailed, and combine beautifully with the graphics to deliver a simply stunning experience. The game's soundtrack boasts some all-new tunes for the American version including selections from big-named artists like Snoop Dogg, plus a few tracks carried over from the Japanese release. There's a lot of variety here, so regardless of your tastes, you should be able to find something that you like and since the game allows you to select the exact music tracks that you wish to hear, you'll never have to listen to anything that you don't want to.   And the gameplay? Well, it goes without saying that once again, Polyphony has come up with the goods. Indeed, while it may be disappointing to some that GT3's car count is less than a third of GT2, it nevertheless packs a far, far greater racing challenge than its predecessors did. GT3 features 60 beginner, amateur and professional championship races, as well as 10 rally races and 10 endurance races. And some of those Championships are huge, featuring 10 different races, each requiring the player to complete anywhere between 20-78 laps. This is not a game you will complete overnight. Indeed, GT3 packs such a huge challenge that if you're serious about completing the game, you will be required to put in a serious amount of time and effort to do so. Sony has made the game's progression a little easier in the beginning of the American version by upping the credits that you start off with and giving out more prize money in the Beginner and some Amateur races, but it's still going to take you quite a bit of time and effort to make it through this gem.  The racing is more varied than before. There are a lot more manufacturers races this time around, ranging the Silver Arrow Mercedes-only challenge and the Toyota Vitz Challenge through Beetle Cup Racing to the Type R meeting and Evolution Challenge. The '80s car races are back, as well as a slew of specific challenges, such as British GT car racing, roadster races and all the usual FF, AWD, FR, NA and Turbo car races. And best of all, GT3 has an F1 Championship. There are six hidden F1 cars to unlock in the game (based on real, older F1 cars that raced between 1986 and 1994), and if you can complete all 40 Beginner and Amateur races, you'll unlock the F1 Championship. This is a huge challenge in itself -- 10 different races ranging from 25-78 laps each. The entire Championship requires about 10 hours to finish by itself. Polyphony wisely included a save game option this time around that enables you to save during a Championship and come back to it later. You'll be using it a lot; that's for sure.  At this point, I will say this for the record -- I love GT3. It's the best racer out there, and it's definitely the PS2 killer app. However, it's not perfect. There are some problems inherent in the game that I hope can be ironed out for the next GT title. So without further ado, let's talk about the AI.   Generally speaking, I'm disappointed. The cars pretty much drive exactly the same way that they did in GT2. I use the same tactics and drive the game in exactly the same way than I did in GT2, and I get the same results. Those expecting a marked AI improvement in GT3 over GT2 will be sorely disappointed. Yes, the handling is smoother. There's more detail, and more finesse. But fundamentally, to all intents and purposes, the racing experience in GT3 is almost identical to racing in GT2.  I've driven around the track following the AI drivers, and watched them closely. They all follow a strict line. If another AI car gets in the way, they bump each other out of the way. There's no attempt to drive around one another -- they just bump and jostle until one gets ahead of the other, and then they follow the line again. It looks OK from a distance, because there's no damage, and the bumping is usually subtle. But follow behind and you can see how it works.  There seems to be little difference from Beginner to Pro in terms of driving style. They still drive the same way, they still bounce off walls and each other. They still screw up corners, and they can still be used to lean on. Like I said before. I see very little difference between GT2 and GT3 in practical racing.   There are around 185 cars in the game, including beasts like this one.  Something that disturbed me last night is that I ran the Pro League GT World Championship in the Mazda 787B. Now I have not touched that car. It's completely stock, with no tire upgrades or stage tune. Yet I completely blew away all the other cars in that race (Toyota GT1, Nissan R390, Panoz GT1, GT40 Racer and the highest-powered Zonda)-- including another Mazda 787B. I could easily out-accelerate and out-corner it, to the point where I was lapping 10+ seconds faster than that car. I thought this was going to be a close race, considering the cars should be identical in power. Yet it wasn't -- I won with ease. I don't know what the problem is, but I was very disappointed by the fact that a human player can blow away an AI driver using an identical car.  Oddly enough, the most exciting race so far has been the Pro League Vitz race. In that one, the computer provided a little more of a challenge, but I still managed to win all the races in the series -- but the competition were always fairly close behind. Perhaps the AI is better at driving smaller cars than bigger ones...  Something that I have always felt is that most exciting racing occurs when all the cars are evenly powered. That's a true test of your driving skills -- seeing how you stack up against the competition on a basis of skill, rather than using a more powerful car and using its superior acceleration and speed to win. However, in GT3, you never know what power your competitors have. Polyphony doesn't mention it anywhere in the game, and I think it's a poor oversight. Adding that information would allow those who want a challenge to tune their car to match the competition, rather than having to guess and making their car either too powerful, or not powerful enough.  Which leads me onto another thing. I've been hoping with every new version of GT that there would be more stock car races. Or races with very strict horsepower (and even weight) limits. That would make for some really close, challenging racing. But there's nothing like that in GT3. It uses the same racing structure in GT2. The end result is that if you're a seasoned GT player, you have to work to find a challenge in this game. However, if easily winning every race with an overpowered car is your bag, then you're gonna love it.   Is this a real car or a car model from the game?  I must admit to also having a few issues regarding the track selection. Personally, I don't find the Test Track particularly exciting. Even less so when I'm racing a Vitz. Yet, that's one of the races -- 10 laps around a track that is just not fun with a small, underpowered car. Unless, of course, you really enjoy racing flat out for half an hour, barely touching the joypad. There are several races like this, where you run the Test Track or the Speedway in cars that should really be driving around something like Autumn Ring mini, or Grand Valley East. I really miss the smaller tracks. They're great fun to drive the smaller cars around. Others may enjoy driving the Test/Speedway Tracks in little cars, but personally I don't think they're conducive to fun racing with small cars. Speedway tracks are fun for racing cars. And small tracks are fun for small cars -- and I feel GT3 is definitely missing a few small tracks. They help break up the action. Personally, I feel that Polyphony has overdone the pure racing tracks at the cost of smaller, twistier racing tracks.  I am also not really impressed with the Complex String course. OK, so it's fun to have a hardcore test track to race your car around and test it out, but it has little practical application. It's never used for racing (as it's wholly unsuitable for that -- wait 'til you driven around it, and you'll see what I mean), and therefore rarely gets used. So it's a bit of a waste, really. I'd have much preferred to see Autumn Ring/Mini in the game instead of that one.  Finally, I feel that I must say something about the length of some of the races. The game features 80 different racing Championships, and as I've already said, some of them are incredibly long. To the point where I think it's unnecessary. There are 10 endurance races, which each require an hour and a half to more than two hours of racing to complete. There are also 10 or so Championship races which require anything from six to 10 hours to complete each. I can't complain about the challenge, but I do complain about it getting old. I mean, let's face it -- it's not like we haven't ever seen these tracks before. I've already driven around these tracks endlessly in GT1 and GT2 --and now I'm doing them all over again. And once you've done a few Championships and have raced 10 races with 10-15 laps each, frankly, it gets tedious to have to do yet another Championship with virtually the same tracks, only this time do 20 laps each time. And then do it again, this time with 30 laps per race. And then you remember you've also got to do the Endurance races too....  Despite seeming to have a very big track selection, the sheer volume of races means you have to drive around the same tracks over and over again, and that's going to become tedious for anyone other than a hardcore racing fan.    100+ hours of gameplay... But, despite all that, I still love this game. It's not perfect, but it's still the best racing game out there. The cars are fab, and there have been few disappointments for me, apart from the ones that are listed above. After playing daily for about a month, my garage has about 130 cars in it, and many of them are killer. There's no denying racing is fun, and graphically, this game has absolutely no equal. It's a huge game. The real challenge is trying to complete all the races -- and that's going to take weeks for hardcore players, and months for casual players. The arcade mode is better than ever, and ironically at its highest level offers more of a challenge than the GT mode does.GT3 is without a doubt, the PS2's killer app. It's a truly remarkable game... which goes to show how good GT2 really is. It has moved across from PSX to its next-gen sibling with very little change to its fundamental gameplay and game mechanics. And despite it being to all intents and purposes almost exactly the same game we played a year or so ago, it still provides the best racing entertainment you can get outside of a race track. I've played GT2 endlessly, and I'm still playing GT3 -- even though it's pretty much the same stuff in a prettier package.I don't think many people will be disappointed with this game. Like I said, it's not perfect, but then most things aren't. GT3 offers the finest racing, the best cars and the highest-quality automotive audio-visual feast available on any gaming system anywhere, and as far as I'm concerned, it's an absolutely essential purchase for anyone who loves cars and racing.", "date": "Aug 7, 2001"}