{"name": "TRL Trivia", "name_review": "TRL Trivia", "ref": "https://www.ign.com/articles/2001/08/13/trl-trivia", "text": "You've watched it every day since MTV first put it on the air a few years ago. Total Request Live (TRL to those in the know) is your favorite show and you can't get enough of it.  Well, the answer to your prayers is here, Carson Daly-boy. TRL Trivia from Take 2 Interactive is out, and it's a game that will let you test your TRL knowledge -- or at least let you play out your TRL fantasies.   Developed by Hypnotix, the fine folks behind such games as $100,000 Pyramid, Deer Avenger 3D, and Panty Raider: From Here to Immaturity, the game puts you in the trivia hot seat. It becomes your mission to answer as many questions as you can about videos, music, movies and celebrities.  The game begins with a fair 3D representation of the TRL studio MTV has built in Times Square. You'll fly through the studio for a few seconds, and then begin the game.  Choose how many players will be competing -- the game allows up to four -- although they'd all have to be hunched over the same keyboard to play at the same time. The game offers no LAN or Internet play.  The game's voice is done by MTV VJ Brian McFayden, and he does a decent job of it. Unfortunately, so much of what he has to say is repeated ad infinitum. You'll hear ~I thought somebody would get that one~ or ~Looks like you all missed that one~ more often than you thought possible as you play through the game -- and that's in the single player game. You'd think they'd have different sound clips for the one player game than they do for the multiple player one, but alas, they don't.  And then, there's the worst of the bunch: ~They say great minds think alike. I guess everyone missing the same question is thinking alike, right?~ Uggh. Trust me, it's barely funny the first time you hear it, and not even close the tenth time.  When the game begins, you chose from among six or nine categories, depending on what you've picked to begin the game. Categories have to do with everything from music to movies to pop culture. Some of the categories include: Girl Power; Through the Years; Screen Test; Boy Bands; The Rap Lowdown; and I Sing in the Shower.  Questions are generally multiple choice, which is good for someone like me who has a really low attention span (thanks, MTV) but there are different kinds of questions as well.  Take the Through the Years category, for instance. In this category, you'll be asked to put things in chronological order, either movies, videos, songs or albums. Can you put them in the right time order?  There's also ~speed round~ questions. These test your reflexes as well as your knowledge. The game will put a keyword at the top of the screen, and then flash different answers below it over the course of a couple minutes. Hit your ring-in key if the phrase or word flashed below relates to the word at the top of the screen. Get it right, and you get points. Hit your key at the wrong time, and points are deducted, smart guy.  And then there are the ~Guess Who~ questions. In these, the game will present a series of four clues over the course of a couple minutes. You then must chose from among four possible people that the clues relate to.  You hit a certain key to ring in so you can answer the question. Once you hit your ring-in key, you'll have to pick the correct answer in 60 seconds, or you can hit three keys to give you more options.  One key will give you more time to answer the questions, while another key will skip that question and go to the next one. The third key will just give you a new question outright. Each key can only be used once during a five-question set.  Each category you chose will have five questions within it. Answer the questions right, and get a certain number of points added to your score. If you answer them incorrectly, you'll have the point total subtracted from your total. Ouch.  One odd thing about the way the questions are set up is, though, that you don't get any bonus for ringing in quickly. Ring in right away, and you'll get the same points you do if you wait until the very last second to ring in. And not only that, but if you don't answer at all, and just let the clock run out, you don't get any kind of penalty. Seems a little odd to us.  Once your done with the five question set, you'll move on to choose a new category. Once you're done with all the categories, you get to see your point total displayed as your final score.  The game also features its share of terrible jokes, like this one: ~That's all she wrote for this category. Don't ask who she is, all I know is, she's done writing.~  Overall, TRL Trivia is a good diversion for a few minutes, but there are definitely better trivia games out there. And even in the short time we played it, we got a fair number of questions repeated, so don't expect the game to last you too long.  -- Mike Morrissey Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Aug 13, 2001"}