{"name": "Test Drive Off-Road -- Wide Open", "name_review": "Test Drive Off-Road -- Wide Open", "ref": "https://www.ign.com/articles/2001/08/23/test-drive-off-road-wide-open-3", "text": "~I love these things.  They're so American.~  -- Jesse Custer  And a very American game this is too, even if it was published by a bunch of Frogs.  This is quite clearly an Angel Studios production -- indeed, the mind's eye can almost exactly capture how this game got made.  Angel has an engine in search of a license, Infogrames has a license in search of an engine, they meet, fall in love, and the result in nine months or so is Test Drive Off-Road Wide Open, the first decent game to ever have ~Test Drive Off-Road~ written on it.  Emphasis on ~decent.~  This is not a great game, and in fact it is due to be beaten like a gong by Rainbow's own second effort when Smuggler's Run 2 debuts later in the year, but if you want to race big trucks, this ain't a bad one to rent or wait for a price drop on.  Infogrames has positioned the title wisely, too -- it'll likely get a big boost once Smackdown 3 blows open the redneck sector of the market for PlayStation 2. Gameplay  Wide Open obviously employs the terrain and physics engine from Smuggler's Run -- it just adds a little more weight to the vehicles and a little more structure to the courses.  Instead of point-by-point mission-based driving, you compete in checkpoint races, some taking place on a circuit, others just running from point A to point B.  It's possible to go wherever you want to, since the tracks are set in Smuggler's Run-style gigantic open environments, but in practical terms you have to stick to the course, since missing a checkpoint generally spells a certain loss.  The tracks have plenty of shortcuts and alternate routes built into them, though, which complements the different abilities of the trucks.  A quick truck generally has to follow the course closely, because it can't handle rough terrain or hill-climbing well.  In contrast, your big fat Hummer will get blown away on the straights, but it's better for cutting corners and powering its way up hills.  The beginning tracks tend to have a bit of Mario Kart to them, with single killer shortcuts that guarantee victory, but later on the style settles down a bit and you actually have to rely on your skill to win, as well as a little bit of dirty driving (the AI is just aggressive enough to make things interesting).  Like most Test Drive games, this is still a pretty straightforward, hammer-down racer, but Angel's physics engine still does a good job of simulating the effect of terrain and bouncing suspensions.  The career mode offers plenty of different races to try, and the fun of gradually upgrading your rig.  You can't buy individual modifications as in Gran Turismo, but each truck has four degrees of modification, running from ~stock~ through ~unlimited.~  Stock is exactly that, and each successive level gradually adds both performance characteristics and exterior war paint -- once you hit the unlimited class, you'll be driving a gigantic jacked-up redneck assault machine complete with massive grille, extra headlights, and flames on the front end.  The flames, I think, are a brilliant touch.  Graphics  Unsurprisingly, this game is roughly comparable to Smuggler's Run, although it suffers a bit in comparison here and there because it's trying to draw more varied environments than SR's relatively uniform deserts and forests.  The trucks look good enough, though, with some solid reflection effects and great suspension animation, and there's a basic damage model that animates fun stuff like bumpers flying off and windows breaking.  The courses aren't afflicted by draw-in, although it would have been nice to see smoother mip-mapping routines.  As it is, you can clearly see the new textures popping in as you drive closer to objects in the distance.  The framerate is generally solid, regardless of the number of trucks on the screen.  It's an eight-man field, and there's never any skipping when all of them take off from the starting line.  Every so often, though, the tracks throw in some scripted events, like boulders avalanching down a cliff on the final lap of a race, and that occasionally causes the engine to take a hit, especially if there are three or four trucks on the screen when that happens.  It's rather a toss-up as to whether those elements should have been included -- on the one hand, they do add to the excitement of the races, but perhaps a constant framerate should have been a priority.  Sound  Bizarre mix of music in this game.  On the one hand, you have some fairly pleasant, mellow beats, courtesy acts like the Digital Assassins.  On the other hand, you have really awful heavy metal, led by some Load-era Metallica.  Bit of a split personality, isn't it?  There's a track skip feature in the pause menu, though, so it's not hard to pass over what you don't particularly like.  As far as volume goes, there's enough music here, although perhaps two or four more tracks could have filled it out just a little better.  Speaking of filling out, that's also what ought to have been done to the engine noises.  I've heard a Hummer running, and I can attest that in real life, a 6.5-liter turbo diesel makes a sound somewhat rougher in texture and higher in volume than the dull buzz it creates in this game.  If you're going to make a game about big, stupid, thuggish vehicles, they ought to make some big, stupid, thuggish kind of noise.  The crashes, clanks, and thuds of trucks impacting the environment and each other are fine, but they ought to be accenting a heavier backgroud riff, as it were.Test Drive Off-Road is not, and never has been, a complicated concept.  You have big trucks, you have open space, and the race is on.  All it ever needed was a decent engine to make it work, and Angel has finally supplied that after Infogrames cranked out three straight utterly worthless installments on the original PlayStation.As a result of that blessed simplicity, you should know immediately whether or not you want to play this game.  If you want to race big trucks in open spaces, I can say with considerable surety that this is your ticket.  This isn't a genre-breaker of any sort, though, and in a larger sense, it's just like most other Test Drive games: an effective racer, but not one that attempts to reach very far.  Luckily, the creators of Wide Open didn't have very far to reach.", "date": "Aug 23, 2001"}