{"name": "Saiyuki: Journey West", "name_review": "Saiyuki: Journey West", "ref": "https://www.ign.com/articles/2001/08/29/saiyuki-journey-west", "text": "Heaven knows why, but there are still plenty of good RPGs left to play in the final eight or ten months of the PlayStation's lifespan.  Every other genre has deserted the system in the face of an onrushing horde of edutainment, budget, and simply godawful titles, but strategy and role-playing stand firm, and thanks to some of the smallest software publishers on the market right now.  Questionable business, maybe, but it's great that gamers are getting a chance to play imports like Saiyuki: Journey West, a tactical RPG just recently released by Koei.  Saiyuki is, for the most part, a straight skirmish-scale combat game.  You don't have a great deal of control over your fate anywhere save for the battlefield -- outside combat, you move around a constrained world map, and you relate to the environment and characters only in cinematic sequences.  But this is a well-made game of light strategy, and the historical-mythical setting works wonders for improving the potentially tedious atmosphere.  If more games featured gigantic were-monkeys, maybe we wouldn't have to write so many surly reviews around here.  Gameplay  As far as visual presentation goes, this is a dead ringer for Final Fantasy Tactics or Tactics Ogre, but Saiyuki has its own style of play, closer to something like Vandal Hearts or Vanguard Bandits (although it dispenses with VH's guessing-game positioning, and it isn't half as cheap as VB was at times).  Tactics had its massively deep system of party management and character development, issues with which Saiyuki hardly bothers.  Instead, it focuses on more basic issues of positioning and skill management, especially as that relates to the Were system.  The lead character, Sanzo, is a fighter and spell-caster, with the unique ability to summon powerful guardian spirits.  Everyone else, however, has a Were form, a powerful monster that they can transform into to use more powerful abilities.  This ability is limited, though -- it's a little like Bloody Roar in the sense that a character can be knocked out of Were form if they take enough damage while transformed.  Thus, it may be dangerous to overuse it early in a fight, and the transformation sequences may be long enough that it's overkill in an ordinary battle.  Generally, the game's balance offers plenty to do during combat, although it's not as complex as some related games when it comes to advancing your party outside battles.  New characters join as part of the gradual progress of the plot, and each adds their own set of skills and specialties, particularly as they relate to the game's element system.  As in something like Chrono Cross, each character is aligned to an element, making them effective against certain elements and vulnerable to others -- thus, using the right characters against the right elements is an important part of your strategy.  The element system helps add an extra layer to simple positioning and health/time management, since it can give an advantage to an ally in a tight spot, or leave a seemingly well-guarded enemy vulnerable.  The same goes for the occasional spot of environmental interaction, which helps mix up the stages.  Graphics  As mentioned above, Saiyuki looks so much like one of the Tactics games that you'd swear they share the same graphical engine.  The level of sprite quality is similar, even if it doesn't have quite so many impressive 3D constructions as Tactics.  Saiyuki has a great design sense going for it, too -- artist Akihiro Yamada has created some genuinely beautiful interpretations of the mythical cast.  His portraits go a long way towards conveying the emotions of the dialogue, too.  A la Xenogears or Grandia, there's a grab bag of different faces that accompanies each window, all of them sharply drawn.  In the age of PS2, these visuals aren't going to knock anybody dead, but they're quite good in a PlayStation context, with suitably momentous effects when the Were forms take effect, or when Sanzo summons a Guardian.  The sprites do look just a little bit iffy when the camera pulls in close, but that's one of the things I've learned to deal with since the death of the Saturn, and as usual, artistic invention goes a long way towards helping overcome the limits of technology.    <font Sound  The music here is a mixed bag, but it gets better as you progress further into the game (away from the theme music -- more on that later), and the localization actually has some high points.  The few bits of English dialogue, mainly in the character introduction sequences, are delivered remarkably well, and at least never poorly enough to spoil the lovely cutscenes.  The text translation leaves very little room for complaint as well, flowing nicely and granting each character a very distinct personaly, and as for the godawful opening theme song (it's in the media section below, and must be heard to be believed), I'm not sure which side of the Atlantic to blame for that one.  I'd like to think Koei USA isn't that tone-deaf, though...But even if they did write that one, they still did a good enough job with the localization to forgive any minor complaints.  Koei's done the RPG market a favor with this one -- it's great to see a game this well-made come almost completely out of nowhere.  Saiyuki may not become an immortal hundred-dollar Ebay hit, but it deserves the attention of gamers who'd like a relaxing excursion into tactical combat.  And it'd be a real treat if someone buys it expecting a Dragon Ball Z adventure, and gets something actually decent instead...  If you can find a copy, then, since the print run is liable to run out any day now, pick it up and try to keep your PlayStation from getting too lonely.", "date": "Aug 29, 2001"}