{"name": "Dragon Riders -- Chronicles of Pern", "name_review": "Dragon Riders - Chronicles of Pern", "ref": "https://www.ign.com/articles/2001/09/04/dragon-riders-chronicles-of-pern-2", "text": "The world of science fiction seems to be a great gene pool of original material to draw new and exciting concepts for video games.  In the world of sci-fi, rare is it for any reader not to have heard the name Anne McCaffrey.  As one of the oldest and respected science fiction/fantasy writers, her literary works based on the world of Pern are some of the best known and in the 30 years since her first book, she has garnered fans across the world.  Thus it would be natural that a video game based on the universe of Pern would not only deliver great enjoyment to fans of McCaffrey's works, but also enable gamers who have never read any of her works to become curious enough to jog down his or her nearest public library.  So, let me steer both groups - the longtime fans of Anne McCaffrey and Dreamcast owners anticipating this science fiction adventure - clear; while the story remains pretty true to the world of Pern, Dragon Riders - Chronicles of Pern is an awful mess of lengthy loading times, terrible camera angle control, and a slowness of gameplay that makes this one of the most disappointing games to come out this year.  The finality of the last sentence of the above paragraph comes in part because this title had so much potential - after playing the very early preview version of the game several months ago, this title could have been a science fiction based Shenmue.  Alright... maybe not, but when it's back by a pretty strong story, the word ~epic~ floats on my lips.  The world of Pern is a beautiful land with lush green fields, beautiful mountain ranges, and deep blue oceans... but every two hundred years, the Red Star that orbits Pern passes so close that the Star's life form known as The Thread, is able to jump to Pern and feed upon the rich land with little judgement and no hesitation.  The only way to combat this non-sentient menace is the use of powerful dragons whose powerful flame breath weapon could incinerate the Thread.  Thus a bond between these dragons and the humans were formed to combat the Thread.  To lead the squadron of dragons in flight, the Gold Dragon ridden by a Weyrwoman, must guide dragons and dragonriders to effectively coordinate the attack.  Unfortunately, the Weyrwoman has recently passed away and at the possible worst time and now, it is up to you, D'kor, to find a new Weyrwoman to ride the mighty Gold Dragon.  A bit much for the story, but it has a ton of potential to allow your D'kor to visit several different places and talk to many different people.  Beyond the core strength of the story is the delivery from a cast of computer characters with good voices.  Although the detail of the characters faces and their animation while speaking isn't that great, the voice acting is above average.  The voices are accented with European inflections  (a strange mix of Irish, English, and Scottish) and they're speech is structured with formal words like ~my duty to you~ that gives a medieval court-type atmosphere.  Graphically, the game is no Shenmue, but there are some nice details to the cities and there are several visual literary references that will keep fans happy.  The overall look of the game is a bit muddy and the frame rate isn't great, but it keeps to the theme of the universe pretty well.  Unfortunately, the good story and above average voices cannot save this title from the slew of flaws.  It's arguable that camera angles are the key to making a 3-D adventure game a success; the next key would be having precise controls.  Dragon Riders has neither of these.  I cannot think of a Dreamcast game that has worst camera angle problems than this title; it almost made me forget how bad Blue Stinger's camera flaws were.  The problem lies in the fact that you cannot control the camera at all and with real-time 3-D backgrounds, you better make sure the player can view the action without 3D obstacles obstructing his view.  Sadly, this occurs way too often in Dragon Riders as it is so easy to lose track of your player because you've moved him to the next room, yet the camera has not followed!  What's worst is that this camera problem can occur when enemies are nearby.  For example, in one quest you have to find a young boy lost in a cave filled with tunnel snakes.  Well, moving D'kor to the end of a corridor, the combat icon appeared indicating that something was going to attack me... and I couldn't see what it was or where my character.  This could've been avoided if they left the ability to control the camera in our previous version.  Combine this unresponsive control, a boring combat system, and very long load times and you'll understand how it was a complete chore to play this game.  Forgetting about the camera problems would be easy if there was something that would counter the bad taste it left in my mouth.  But no, Dragon Riders delivers more bitter fruit by incorporating clumsy control with a boring combat system.  First off, control with D'Kor is unresponsive and I really hate the backing up mechanic; no matter how long you hold down to get D'kor to back up, he only takes one step back.  Interaction with field objects isn't very good but that really becomes apparent during combat.  When the combat icon appears on the screen, you can go into combat mode.  Once you do this, you can execute a light, medium, or hard attack by holding the A button while pressing up on the Analog pad (how long you hold up on the Analog pad determines the intensity of the attack).  You can also sidestep left or right, circling the enemy, and press down to defend.  Other than the ability to use a crossbow (with limited ammunition), the collision detection during combat is very questionable.  On top of that, it's often too easy to defeat enemies by simply circling around the target as he attacks and striking from the enemy's weak side.  To condemn both the awkward controls and terrible camera angles comes in the long load times that player's have to suffer - we're talking upwards of 30 seconds. Dragon Riders - Chronicles of Pern isn't without a few merits.  As mentioned above, the story is interesting and the voices have good character.  Additionally, I really like the experience system; by accomplishing certain deeds, you'll increase your strength, knowledge, and reputation.  By increasing these basic attributes, you'll be able to move heavy objects, talk to powerful computer characters, and gain notoriety as an honorable warrior.  I also like how you have to learn skills before you can actually use a sword, sneak around, or even scribe in your journal.  Still, the good points are totally outnumbered and suffocated by the huge flaws and even the most ardent fan of Anne McCaffrey will suffer through Dragon Riders - Chronicles Of Pern.  My suggestion: grab one of her numerous novels and use your imagination.  It's certainly better than suffering through the ~Thread~ of flaws that even dragon breath can't erase.  --Anthony Chau, IGNDC", "date": "Sep 4, 2001"}