{"name": "Silent Scope 2: Dark Silhouette", "name_review": "Silent Scope 2: Dark Silhouette", "ref": "https://www.ign.com/articles/2001/09/17/silent-scope-2-dark-silhouette", "text": "While light-gun games have always been relatively one-dimensional, the level of intense action coupled with lots of eye-hand coordination has always made them fun -- and sometimes despite their single-mindedness, great experiences. They're the original arcade game, descending from man's desire to shoot/hit something. As a game, it always makes for a pure, simple kind of entertainment.  Silent Scope 2 Dark Silhouette, the sequel to the original Silent Scope, once again descends from the arcade, and just like the first game, it plays without any kind of peripheral light-gun to enhance it. The PS2 home version uses the dual shock to aim, and while I'm a big fan of the dual shock controller, it's no substitute for a light-gun sniper rifle. The feel of that arcade gun, along with its ease of motion, is the essence of the game, I would say it's at least 50% of the game's appeal. Without the gun, Silent Scope is more of an exercise, a drill. It's decent fun, but it doesn't come close to the level of excitement of adrenaline rushes that the arcade version delivers.   Gameplay Although there is no gun peripheral to do this game justice in one's home, the best thing about the Silent Scope series is still very much intact, and that's sniping terrorists. In that respect, Silent Scope 2 offers more modes than the arcade, including Arcade (which is a story-based mode), Original (three substantial missions), and Linked Play (via link cable, two players can play head-to-head).   The best part of the game is still the Story mode, in which the rather formulaic plot unfolds, and through a series of chases and attacks, you're able to take out the baddies one limb at a time. In itself, the story is practically worthless, boiling down to a fight of good versus evil, with you being on the good side. In Story mode, players can select between two snipers, Jackal and Falcon, each of which takes on different perspectives during the same offensive. To exemplify this difference, in the early snowy levels against the second sub-boss, Jackal attacks from ground level, while Falcon situates himself in a high perch from a side view. If you like the game the first time through, playing as the second sniper adds a nice replay touch.   The default control scheme is a simple scheme of X for fire, left analog (L3) for directional movement, and Circle for releasing the zoom lens. Perhaps the most important facet of this scheme is Circle, because the game is based on a short timer and moving the gun with the zoom lens on is very slow, just like the arcade game, so by temporarily turning off the zoom lens, players can quickly move their rifle across the screen.   After each mission ends, players are provided with a very basic stat page, relating hit percentage, shots taken, hit, missed, etc., which looks like it was taken straight off the arcade version. Players can also fiddle with the gameplay options a tad, by changing statistics to alter the difficulty level. Players can change the number of lives, number of seconds per mission, difficulty (from 1-8), and other aspects in sound, controller scheme, scope and screen adjustment, and system and sound setups.   The biggest problems with Silent Scope 2 is inherent in the kind of game it is, an arcade port of a great light-gun game with a sniper scope light-gun rifle. It's not like the port is bad. It actually offers more than the coin-op version. But the translation to a home version loses the visceral, live-action feeling from the arcade version. The second most annoying aspect of the game is that the dual shock isn't that accurate. Just like in first-person shooters, the dual shock makes life harder than it should. I suppose you could say that the arcade rifle also has its pros and cons, but the dual shock just isn't as accurate, and since the clock just doesn't stop, the dual shock can hinder as much as it can help.    So what Silent Scope all boils down to is sniper gun goodness, minus the sensationalistic feel of the arcade rifle. And for those who have played the arcade version, there is a big difference. I don't blame Konami for not delivering a light-gun rifle because the cost would have been exorbitant relative to the cost and profit margin of the game, yet I'm not terribly thrilled with the watered down feeling that the final game delivers, sans the rifle sniper.   Graphics Silent Scope in the arcades is a decent looking game, with lots of polygons and large environments, with basic looking people and vehicles. It's neither terribly pretty nor is it atrociously ugly. The PlayStation 2 version has that same feeling. It's a decent looking game that looks very much like the arcade version.   A certain amount of shimmering can be seen, but hardly worth mentioning, and aliasing is kept to a minimum. Honestly, Silent Scope 2 isn't a system showboat, and so it's not going to impress anyone on PlayStation 2. But remember, it was stunning in the arcades, either.   Sound As for the sound, well, that's a problem. Silent Scope 2 is by no means a good sounding game. The arcade game was never big on production values. Voice-overs were relatively bland and rough sounding in the first place. And the music is constantly looping, unoriginal action stuff. So naturally, the PlayStation 2 game doesn't offer anything different either. This is straight, medium grade, arcade-quality music and sound effects. Nothing really worth talking about. You have really got to want to snipe stuff to buy Silent Scope 2 Dark Silhouette. It's a decent arcade port that does add more modes to the game, although they essentially boil down to short mini-scenarios out of the existing game, and it's got a decent level of replay value, but it by no means challenges the system, or shows off the PS2's graphics, or does anything new for the genre. And for those of you who actually own a link cable, you'll have a bucketload of two-player fun. In the end the extra modes are decent, but they end up being more like a side dish of slightly overcooked cabbage, rather than a better marinade for the meat of the game. Rent Silent Scope 2 before you buy it. No offense to those folks as Konami, which makes some stellar games (Silent Hill 2, MGS2), but while Silent Scope 2 Dark Silhouette takes a unique angle on the light-gun game genre -- and it's fun and relatively engaging -- I personally would rather play Namco's Time Crisis 2, which is going to rock.", "date": "Sep 17, 2001"}