{"name": "NHL '02", "name_review": "NHL 2002", "ref": "https://www.ign.com/articles/2001/09/18/nhl-2002-5", "text": "Another year, another sports game from EA.  No big shocker there.  But while EA occasionally gets lambasted for doing the same thing over and over with a few minor improvements, you still have to hand it to them -- they continue to create some of the best sports games for any platform, whether console or PC.  After doing the same sports game year after year, it's often difficult to breath new life into a franchise and call it a new product...but EA has done just that with NHL 2002.  While NHL 2002 certainly shares a lot of the elements from 2001, it's by far one of the biggest steps forward that we've seen in the series in years, and as good as 2001 was, 2002 is even better.   First things first...the little things.  Although ease of navigation is something that's overlooked in many PC games, I have to hand it to EA for what they've done with the series -- they've done a good job reworking the menus in this year's version to make them cleaner and easier to find the options that you're looking for than the menu system in 2001, which I found convoluted and difficult to navigate.  With all the features in NHL now, it's nice to see that EA isn't just slapping up the old menus with a quicky addition here and there.  They really thought about ease of use this year, and it shows in the options layout.  With a few minor improvements, the graphics in 2002 are pretty much the same as in 2001 -- and that's certainly a good thing.  Like last year's version, the digital skaters actually look like their real-life counterparts, complete with fully deformable faces that show emotion.  The crowds show emotion as well, and occasionally you'll get a close-up shot of a few fully 3D spectators at key moments in the game, reacting appropriately to the situation at hand (although the crowd is still comprised of 2D sprites when you're playing).  This crowd emotion actually plays into the game now, and the more you hype them up with big hits and impressive shots on goal, the more your team is rallied to play harder.  The arenas look spectacular as well, and the ice looks even better than last year, with added translucency and reflectivity, and lights and player reflections dance on the ice as you glide over the surface.  There are also a number of new animations in this year's version, which add to the realistic look and feel of the game.  Unfortunately, the same can't be said about the Face in the Game feature that, as in previous years, often has comical effect, as demonstrated on some of the IGN employees in the screenshots below.  It still doesn't work very well, and although you can distinguish players with noticeable facial features such as mustaches and burly eyebrows, all of the IGNers with no such features that I digitized ended up looking like little chin, big mouth, huge nosed, wide-eyed mutants -- but who's to say that they don't really look like that and I've just been fooling myself all these years?  This isn't a big concern though, since most people won't use this feature, and it doesn't affect the gameplay at all.  As you might expect, all of this graphical acuity requires a lot of power.  The game can get very choppy at higher details, especially during major animation changes such as player contact or shooting the puck, and if you have less than a 600MHz computer with at least a GeForce2, you'll definitely have to weigh performance versus detail.  Of course, once you do turn the detail down, you lose all of the great lighting effects and reflections on the ice and your teammates look like block-headed mutants...  Keeping with the high graphical quality of the series, the sound in NHL 2002 is nearly flawless.  Big hits echo through the arena, the crowd wails and cheers when the home team does well, and the unmistakable smack of wood on rubber is exquisitely reproduced in NHL 2002.  But what really shines this year is the color commentary, provided by Jim Houston and Don Taylor.  I thought last year's commentary was bland and repetitive -- not this year.  The commentary tracks are genuinely funny and entertaining, and aren't nearly as monotonous and repetitive as in previous years.  Of course, this may not be your thing, but you can just switch it off if you don't want to hear them razzle back and forth.    Of course, the primary element of any game is how it plays, and again, NHL 2002 improves on an already solid framework.  My favorite change in this year's series is that the default speed is faster than 2001, although you can change the game speed to suit your play style.  To me, hockey is all about speed and fluid movement, and 2001 always seemed a bit slow to me.   One place the extra speed doesn't really fit is the fight sequences, which are as uninspired and useless as ever.  The skaters throw punches so fast and are so stiff while fighting that it's almost as if you're watching an old Laurel and Hardy slapstick routine from early film. I really hope EA revamps their fighting system for 2003.  I know it's not a big part of the game, but everything else is so well done that it stands out as a blemish on an otherwise superb game.   On an up note, controlled puck handling gets a major improvement this year, and now you have a graphical indication of how much control your player has over the biscuit.  The longer you control the puck without being hit, the darker the circle around your character's feet becomes, allowing you to hold on to the puck better if you are challenged by an opposing player.  The deke is also much more useful in this version, as you can control the direction of your deke to fake out your opponent more effectively -- or you might opt to flip your puck over your opponent's stick using a saucer pass.  All in all, as good as last year's version was, the gameplay is even tighter and you have more control in 2002.  The AI seems to be enhanced as well, reacting to your situations better -- although last year's AI was fantastic, and there was little that needed to be improved.  Like last year, the opposing team changes its style depending on whether it's ahead, tied, or behind. If they're having trouble getting shots off, they'll stop being picky, even shooting from the neutral zone if they have to.  Auto line changes have been improved, and the computer rarely makes a change during the rush, instead opting for more opportune times to pull your line off of the ice.  The goalie AI has also been enhanced, with a dynamic system that looks for how you shoot and closes the gaps on your regular go-to shots if you tend to slap the same shot over and over.  However, I still found some shots easier to make than others, like passing quickly back and forth in front of the goal and hitting a one-timer, but that's probably just because it's easy to get the goalie off balance and out of sorts if you do such a move in real hockey as well.  All in all I was happy with the AI in NHL 2002, and even though it's not a huge step over 2001, if it ain't broke, don't fix it.  While the easy mode is very easy to beat (I'm talking about 20 to 0 games almost every time), the medium setting offers a challenge, and I still have a hard time winning consistently on the difficult setting, so there's a little something for game players of all levels here.   So what's truly new in this year's version?  Well, one of the biggest trimmings is the addition of NHL cards to the game.  These cards are digital trading cards that are similar to the cards in Soul Calibur.  After completing tasks such as scoring on the first shot of the game or beating the Canadian team in tournament mode with the Japanese team, you'll earn points that you can use to purchase cards.  These cards offer you game enhancements from the predictable -- such as boosting a player's stats for a few periods or giving your team a defensive advantage -- to the completely strange -- such as ~big head~ mod or ~Sumo hockey.~  Needless to say, with over 300 total cards in the game, you'll have plenty to unlock before you play NHL 2002 out.  The cards do a good job at keeping you hooked on the game as you try and complete more challenges so you can earn more points to buy cards.  Other new additions to this year's outing include Game Story, which spotlights a player if they're doing particularly well in a game.  It doesn't really add a lot to the gameplay, but it does keep you up to date as to how some of your key players are performing.  There's also a new breakaway cam this year, which kind of reminds me of bullet time from Max Payne.  If it's just you vs. the goalie, time will slow down, the screen will turn gray, and your vision will change to a fish-eye lens.  This adds a bit of tension to the game since it's just you against the masked goalie, but it's also somewhat distracting as the gameplay changes dramatically from the fluid, fast movement to an almost acid-induced freak-out complete with your skater's heartbeat and strange camera angles.   Like previous versions, NHL 2002 includes support for up to 12 players in multiplay.  Unfortunately, since the game was just released to the public today, we haven't been able to find any games on the Internet.  However, since NHL is a pretty popular series, we expect you'll be able to find plenty of online games within a week or so.  Overall, NHL 2002 includes more options than we're used to expecting out of a EA Sports' typical yearly offering.  Although the game has more arcade elements this year, there's still plenty for you sim purists here.  You don't have to play with the cards if you don't want to, and you'll find everything that you can think of -- including all NHL players (even the 2002 rookies), trades, custom coaching strategies, fantasy draft, full season play, tournament play, custom players, all the NHL teams plus a few key International teams, plus much, much more -- in the game.  If you're a hockey fan, you definitely won't want to miss this one, and you'll probably find this one entertaining even if you're not.  I'm impressed with all that EA has added to the series this year, and I highly recommend NHL 2002 with only the slightest of reservations, even for those of you who already own NHL 2001.  -- Tal Blevins      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Sep 18, 2001"}