{"name": "Wendy: Every Witch Way", "name_review": "Wendy: Every Witch Way", "ref": "https://www.ign.com/articles/2001/09/20/wendy-every-witch-way", "text": "has been developed by the extremely talented Pocket team at WayForward Technologies. These folks were responsible for the very original Xtreme Sports for Infogrames, the colorful and fun Sabrina: The Animated Series for Havas, and the unique action title WWF Betrayal for THQ. Each Game Boy Color game this team works on utilizes a variation of the same game engine, but they all have a unique feel and design that shows just how creative the development team can get on the handheld. And even though Wendy is a title aimed for the younger crowd, the game design is so original and fun that it honestly shouldn't be missed.   Features 12 levels 3 bonus levels Password save 3 original Game Boy Advance levels For Game Boy Color and Game Boy Advance  For the uneducated, Wendy is that young, red-pajama wearing witch that showed up every so often in Casper cartoons and comics. In Wendy: Every Witch Way, the little girl has opened up a chest that's holding magic stones, and when they're freed from their ~prison~ and head off to a mysterious floating castle...that comes crashing down to earth. With the fortress now grounded, gravity has gone askew, and it's Wendy's task to grab the stones to make everything right again. Wendy: Every Witch Way is, at least for the Game Boy Color, an extremely original action title. On the surface, it looks like a standard jump and shoot platformer, but the developers added a new element into the mix: gravity. With a single control press, Wendy can turn the ceiling into the floor of every level, making the world go topsy-turvy. The  level designers take full advantage of the gravity element, requiring you to constantly flip upside-down to rightside-up in order to get through each and every round in the game. Some challenges are simplistic, requiring Wendy to flip upside-down only to avoid a row of spikes on the floor. Other levels are a lot more elaborate, forcing players to navigate a maze of vertical gutters that expand well past the edge of the screen. What's more, every enemy in the game has his own strength and weakness in this crazy gravity, and you'll have to figure out how to deal with each of them by flipping the force back and forth. This adds a lot more strategy to the game design -- it's clear that designers put a lot of thought into the design of Wendy than to create ~Generic Platform Game #31A.~ At the end of each of the four ~worlds,~ players enter a side-scrolling shooter bonus level. These levels are obviously afterthoughts -- they're fun, sure, but nowhere near as fun as the actual game levels.   To appeal to the folks that have tossed their Game Boy Colors in the junk drawer in favor of the Game Boy Advance, Wendy features three unique levels that only unlock when played on the GBA system. These levels don't take advantage of the Game Boy Advance hardware, but it's great to see that developers are finding ways to appeal to the segmented GBC/GBA market in a single cartridge.  But the game's biggest fault can be connected to whom it's trying to appeal to -- even though the game is incredibly fun, it's not incredibly challenging. Levels are very short, and because it's only 12 levels big, it can be completed in about an hour on the Normal setting. There's a Hard setting, but other than adding a couple more enemies in the level, it's not super taxing, either. The only challenge is in the original GBA-unlockable Advance World -- these levels are hard simply due to the fact that you can only get hit once. Yep, we're on the Game Boy Color's last legs, and many developers have moved onto the greener pastures of the Game Boy Advance. But Wendy: Every Witch Way is a heck of a game that gives the GBC a proper send-off into the realm of the retired game systems. This game features excellent graphics and animation using WayForward's incredible 8-bit scrolling engine (complete with parallax/multiple background scrolling), and original gameplay elements that all come together as a great Game Boy Color title. It's just a shame that the title is super easy to beat.", "date": "Sep 20, 2001"}