{"name": "Tokyo Xtreme Racer", "name_review": "Tokyo Xtreme Racer", "ref": "https://www.ign.com/articles/1999/09/09/tokyo-xtreme-racer", "text": "NOTE: Since doing this review, I've been corrected a few times by some major car buffs out there.  Apparently, Tokyo Xtreme does use real car designs, logos, and model numbers, only Genki changed things just enough to avoid legal issues.  I think I'll quote Mr. Neo Soul on this one: ~Toyota Supra, Subaru Imprezza, Mitsubishi Lancer Evolution 3 AND 5 (a car that never made it state-side), Mazda RX7, and even the MR2.  Let's see, what else....ahh, the BRAND new Mitsubishi 2000 Eclipse, and the Brand New Honda S 2000 (Porsche Boxter's soon-to-be rival), The Nissan 240 SX, Honda Civic, Acura Integra (with japanese-style headlights, not the american round ones), and who could ever forget the infamous Nissan Skyline GT-R that never made it too America because 800 HP factory standard was a bit too much for the American Highways . . . I take it you really don't know much about cars unless there is a brand name slapped onto it.  And obviously that is where this game lacks....but that is ALL it is lacking.  You see, Tokyo Xtreme does not have official licenses, BUT they have the EXACT chassis numbers, and those exact chassis numbers also happen to be the numbers that real car companies reffer to when building their automobile.  So basically, if you did your research, the numbers displayed that represent a Honda Civic in the game, are the EXACT same numbers that Honda used to classify the car in their records.~  Anoop humbly stands corrected . . . regardless, read the review, and buy this game now!   Who would have thought that any driving game featuring one track, an unrealistic driving model, unlicensed cars, and no body damage, could be so fun and addictive.  Such is Genki's Tokyo Xtreme Racer, a title which takes elements from, of all things, the fighting genre and sticks them into a racing game.  The result is the most addictive single player racing experience to come around since, perhaps, the free run mode was introduced so many years ago.  How's this for a scenario.  You start out with about 25,000 dollars cash.  You use this to purchase one of twenty-five fictional cars, then take off to the highway of Tokyo.  So, you're driving around, and you see a car that just doesn't look right to you.  Maybe it's the way the bastard's driving, maybe it's the car's color . . . or, maybe you just know that the car belongs to a rival gang.  Regardless, you HAVE to challenge this guy to a race.  You flash your high beams, turn your hazards on - anything to get the SOB's attention - and then the two of you take off like David Letterman on his way to work, racing down the highway, free of rules, free of safety precautions.  There's no finish line - you just know from experience when you've won.  And when you are declared the winner, you'll earn buying power - yen, dinero, cash.  This is Tokyo Xtreme Racer, in a nutshell.  The game is centered around the notion of the player challenging street-wise opponents, labeled as rivals, to races.  Once a race begins, a fighting game-style energy meter appears at the top of the screen.  The meter for the trailing car depletes slowly (the rate actually depends on how far back he is), and the first one to run out of energy looses the race.  The winner is awarded with money, and both you and your opponent then continue on your drive about the highway, only at a much more leisurely pace.  You can challenge the same guy over again (even if you beat him already), or you can go find another, more powerful opponent.       The rivals are divided into about twenty gangs, each containing between 4 and 12 members.  When you've defeated all members from a gang (this can actually take quite a while, as some gangs aren't well represented on the streets), the gang leader will appear on the highway, and as opposed to all the other races, where you were the one doing the challenging, he'll be the one to challenge you to a race.  Defeat him, and you'll have wiped out the entire gang.  Occasionally, a super-powerful racer known as a Deva (I think they actually mean Diva) will appear on the highway and challenge you to a race.  There are four of these in all, and they're quite difficult to beat.  You can consider these guys to be the bosses of the game; they'll appear one at a time, apparently when you've defeated enough opponents, and once you've defeated them all, you've passed the game.  Defeating opponents, whether it be gang members, gang leaders, or Divas, will earn you money which can be used to upgrade your car (using a very simple and well-explained upgrade scheme that's easy for the novice to follow), or buy a new car.  You'll have to purchase upgraded engines and transmissions and mufflers and whatever if you expect to be fast enough to defeat some of the higher up opponents (I had to go through two full engine upgrades in order to defeat my first Diva, for instance).  You can also, for fun, change the paint job on your car, and add more stylized bumpers, hoods, and headlights.  Yes, you can now experience what it's like to be among the elite group of young punks out there who like to modify their cars in order to impress their chicks (there's no Chinese lettering in the game, though).  What makes this whole system work so well are the various subtleties to its implementation.  First off, you're free to drive around the highway at your own leisurely pace, not doing anything.  It's all up to you to challenge an opponent, and you can determine whom you want to race against, and whom you want to avoid.  If you don't like anyone on the highway (or, maybe all the remaining opponents are too difficult for you), go home and return the next day; you'll usually find a brand new set of opponents to challenge.  Alternatively, you can wait until you come to a portion of the track that you like, and then challenge one of the more difficult opponents; since you don't race around the entire track on one go (you actually use about a quarter of the track), the location of your race can be a huge determining factor in who comes out victorious.  Also notable is the game's use of traffic to affect gameplay.  As you drive around looking for opponents, you'll drive by many cars which can't be challenged; these are just common, simple Japanese folk who are out for a drive on the town.  When you do actually race, these cars become obstacles, and avoiding them becomes one of the trickiest aspects of the game (using them to block your opponent becomes a good strategy for driving dirty, as well).  So how's that for an original concept, eh?  This mode of play is what the game calls its Quest Mode, and it stands alongside the two player split screen mode which features a similar energy meter concept, and the Quick Race mode, which makes you go from one opponent to the next, without all the worry about car modifications and rivals.  The Quest Mode is the meat of the game, though, and it's nearly impossible to stop playing once you've started.  Furthermore, there are just so many increasingly difficult opponents to challenge that you'll loose sleep, and maybe even loose your job as well.  In fact, I think I almost lost my job as a result of the game, as I recently stayed up 'till 4:00 in the morning, racing against various rivals, when I new all along that I had to be at work at round 8:30.  Our editor in chief questioned my intentions when I showed up at work at about 10:30, but all I had to say was ~Tokyo Xtreme,~ and he understood.       Now, don't get me wrong, the game isn't perfect.  There are some serious deficiencies, primarily involving the driving model.  The cars don't feel realistic as they cruise through the streets.  The U.S. version actually feels a little bit better in this area, but Genki ought to read the AM2 book on driving realism before making the next incarnation of this game.  The strange driving model occasionally makes winning a race more a matter of luck than skill; either that, or winning a race is too often a matter of having a better car than having better driving skills.  Contributing to the somewhat odd feel of the cars are the moderately twitchy controls.  The game requires that you use the analogue pad for steering, and it's sometimes hard to keep from oversteering when making a slow turn.  Then again, I never really liked the use of the analogue thumb pad for steering purposes (I'm more of a digital pad kind of guy), so if you're accustomed to using analogue in the likes of Sega Rally and Gran Tourismo, you should do fine here.  The other major problem involves the single track.  It's a particularly massive track, but it stands alone, and it can get somewhat bland after a while.  Actually, there's a good reason for having just one track, as it feels so utterly realistic that way, but what the game needs is more alternate paths through the track - maybe the ability to go off the freeway and race through certain sections of the empty streets (then again, the Japanese version's title of ~Tokyo Highway Battle~ would've been a misnomer).  I'll admit that when racing, you just don't notice the problem, so focused are you on your opponent, and the game does allow you to drive through the course in reverse direction, but a little variety never hurt.  Other possible additions that come to mind include weather conditions, time-based effects (it would be so utterly cool to have the glare from the sun be the reason for your having lost a race!), and maybe Genki can obtain a license to use the actual car names, since the game (rightfully) doesn't allow for car damage.  But, these things are like the lack of a same character versus option, turbo speed setting, and super meter in the original Street Fighter II.  You can't really complain about them, but you can certainly suggest them, and hope that the developers take note, and consider them for use in a future product of the same vein.  For now, despite these problems, I'll take Tokyo Xtreme Racer over most any other game in the Dreamcast lineup.  It's just so addictive.  Gamers looking for a full-on racing product, complete with multiple tracks, officially licensed cars, and changing weather conditions, can wait for Sega Rally 2, but anyone looking for a fun, unique, addictive gameplay experience, will want to look into Tokyo Xtreme Racer.     -- Anoop Gantayat - You're not just racing through Tokyo, you're ~EXTREME~ racing through Tokyo - it's different!", "date": "Sep 9, 1999"}