{"name": "NFL Blitz 2002", "name_review": "NFL Blitz 20-02", "ref": "https://www.ign.com/articles/2001/09/24/nfl-blitz-20-02-5", "text": "Four times. That's right, four times Midway has moved its NFL Blitz property to the Game Boy market. And not a single time has it been any good. While I can understand the difficulty of trying to squeeze the intense gameplay on the 8-bit Game Boy Color, there is absolutely no reason why the series couldn't look and play decently on the Game Boy Advance. But for whatever reason, Midway fumbles yet again, creating another pathetic portable version of its very successful football series. Features All 31 teams Season and Exhibition mode Practice mini-games Password save  Only for Game Boy Advance  In case you haven't been around for the game's shining moments in the arcade and on every console, Blitz is an extreme and basic rendition of American football. It's not out to simulate the game by any means -- it's meant to take everything that makes football cool, and amplifies it. The game removes four players from the mix and makes it a seven-on-seven affair, and spreads the action out by making first downs occur at 30 yards instead of 10. There are no penalties, either, so anything goes to get the necessary touchdowns.  The Game Boy Advance version throws everything that makes Blitz fun and clutters it with programming and design sloppiness. You'd honestly think that the Game Boy Advance could offer a close representation to the Blitz engine by using the system's sprite capabilities. Sure, polygonal characters are way out of the question due to the system's lack of 3D hardware, but we've seen games that can fake 3D quite well on the GBA -- Mario Kart Super Circuit, Konami Krazy Racers, and GT Advance to name a few. But the 3D-ish engine created for the Game Boy Advance version of Blitz 20-02 is so choppy and full of bugs it's amazing the game made it through testing at Nintendo. Players disappear and reappear when the camera scrolls. The field texture glitches out every so often during plays. Sometimes smaller sprites overlap bigger sprites for no apparent reason. And let's not forget some of the bugs that trick the engine into giving the opponent an extra few yards after a tackle.   The artwork does nothing to convey the extremeness of the franchise -- you'll never be treated to explosive hits, taunts, super tackles, or any of the other over-the-top animations that made Blitz so much fun and amusing to watch. Instead, tackles trigger a ~fall-down~ animation...sometimes. Players do celebrate in the endzone, but with a goofy two-frame animation that's just silly and embarrassing to watch.  And correct me if I'm wrong, but videogames are supposed to offer a challenge...right? Blitz 20-02 has some of the worst AI routines in a football game that can be figured out simply by running the first available play in both the offense and defense list. Seriously. In the first game I played, I found the hole that made scoring touchdown super easy in one or two plays, and it can be repeated over and over and over, no matter if you're playing the Bengals (the worst team in the game) against the Bills (the top rated team). Kickoffs can easily be taken to well past the 50-yard line 99% of the time, and you'll never have to pull off a field goal or punt in the game once you find out the simple trick to ~outwitting~ the opponents. And with this game's poor attention to computer intelligence, it takes absolutely no effort to win in Blitz 20-02.  What's worse is that the game is a single-player affair -- there's no link cable option to challenge a friend, and that hurts the game further since playing against another person changes the computer AI into something a lot more unpredictable. And just because the back of the box mentions mini-games, don't expect anything special here -- they're just elements from the game repeated over and over. Kick a field goal from virtually any spot on the field, or try to score a touchdown from the 50 yard line on a single down. That's pretty much it.  To the game's credit, I've always felt that the previous Game Boy Color Blitz games were just unplayable, simply due to the fact that the hardware just wasn't up to snuff. The Game Boy Advance version is playable, but it's just so darn sloppy and rushed that it's a massive let-down for myself and anyone else waiting for the day when Midway would actually produce a quality, handheld version of their awesome football franchise. I'd say ~wait until next year~, but the track record shows that the company just doesn't care about the handheld market to bother.", "date": "Sep 24, 2001"}