{"name": "Casper: Spirit Dimensions", "name_review": "Casper: Spirit Dimensions", "ref": "https://www.ign.com/articles/2001/10/01/casper-spirit-dimensions-3", "text": "In Casper: Spirit Dimensions, which has been developed by Lucky Chicken for TDK Mediactive, the biggest question is why can't Casper just fly through all these walls? While there doesn't seem to be an answer for this in the game or the manual as far as I can tell, maybe we should assume that since the game takes place in these four different Spirit Dimensions that the walls and objects in these worlds might not allow for ghosts to go through. Hell, it's a game, so let's all get over it.   Assuming you're able to get over it, Casper: Spirit Dimensions is a game worth giving a look whether you're a big fan of the Friendly Ghost or are just looking for a unique action/adventure game. The game puts you in the role of none other than Casper as he must try and rid the four Spirit Dimensions of Kibosh who has taken them each over with the idea of ruling the universe.   Gameplay  What makes Casper a unique action/adventure is that while moving through these four worlds, which includes The Medieval World, The Spirit Amusement Park, Kibosh's Factory, and the Spirit World, he has complete freedom of movement in all directions.    It takes a little while to get used to, but once you get the hang of controller Casper's 3D movement with the left and right analog sticks, you'll find that it's easy to move him around in these relatively expansive 3D environments. You'll still encounter problems targeting enemies with your Spirit Blasts, which is your main method of attack, and turning around quickly isn't as fast as it should be (even when you use the R1 button for a quick turn).    Aside from these small problems, the general control is more than adequate and you'll rarely find Casper doing anything that you don't want him to do once you get the hang of using both analog sticks to control him. The game encompasses 16 total levels and the gameplay is comprised mostly of collecting jewels, power-up items to give Casper more health or stronger elemental based attacks, or special items to open up doors or allow you to progress to the next level.    This is where the game ultimately fails, as it never feels more than just a fetch quest. The puzzles are rarely thought provoking, even though there are a few challenging ones, and the gameplay is pretty repetitive and unmoving. There are some NPC characters to interact with, including Wendy the Witch, but it honestly adds little in the way of bettering the gameplay experience.   The simplistic nature of the gameplay might be a case of the game being designed for a younger audience in mind, which would be acceptable. But, the relatively steep learning curve of the game's controls might be too much for some beginning gamers, especially when you take into account that it's often hard to quickly turn, face and target enemies that are attacking you.    Graphics  The visuals in Casper: Spirit Dimensions are actually surprisingly good. This is by no means a game that will make your jaw drop or blow you away, but it's very pretty. The textures are fairly low resolution and simple in nature, but the developers have done well in using a nice variety of textures and using lighting to help overcome the shortcomings. In fact, the game makes use of a lot of well placed colored lighting to spruce up many levels in the game and it works in creating a dark and creepy, yet very colorful atmosphere.    Similarly, the backgrounds are filled with nice little eye pleasing extras such as crackling fires and great looking water. And there's not a hint of slowdown problems, as the game's framerate stays pretty constant throughout. Quite simply, it's very pleasant on the eyes.   Sound  Casper also does reasonably well in the area of sound. The sound effects are really good and when you play the game with surround sound, it helps create a nice dark and ominous mood. This feeling is even furthered by the classical music soundtrack that helps to add even more to the game's atmosphere. The only problem is that the soundtrack seems to repeat a lot and this repetitiveness can be a problem.   The voices aren't all that good and some of the lines that are delivered are do so pretty poorly, but they get the job done in this cartoon universe and don't ruin the overall experience at all. It's just that they don't really work to enhance the game in any way.Casper: Spirit Dimensions proved to be a pleasant surprise. Joking about the inability of Casper to go through walls aside, it's actually a decent game and given that it's a 3D action/adventure game based on a kids license -- it's a bit of a rarity. Even still, it's not a game that I'd suggest that you go out and buy unless you're just dying to play a new Casper game or need a 3D action/adventure fix. The bottom line is that there are enough great games out there right now for PlayStation 2 that you don't need to waste times on the ones that are simply in the average to good range, and that's where Casper stands, or better yet, floats.", "date": "Oct 1, 2001"}