{"name": "X-Men: Mutant Academy 2", "name_review": "X-Men: Mutant Academy 2", "ref": "https://www.ign.com/articles/2001/10/01/x-men-mutant-academy-2", "text": "As the PlayStation is slowly eclipsed into licensed-game limbo by the red-hot PlayStation 2, Activision appears content on giving the 30-plus million owners of the system something to cheer for. X-Men Mutant Academy 2 is a solid sequel to the first fighter that came out last summer, and features new characters, new moves and new levels.   X-Men Mutant Academy 2 doesn't change too much from the first game. In fact, it enhances many of the aspects from the first, including the training levels, and once again delivers a ton of extras. It also should be noted that the medium and hard levels are jacked up from last year's title, so players will have either, A) a much harder time, or B) the time of their life. Either way, you still get to fight with mutants, and that's the best part.    Gameplay  Using the rock solid fighting formula that has made series such as Street Fighter, Virtua Fighter, Tekken, and Dead Or Alive so popular, Paradox Development aimed to make X-Men a competitive, hardcore event. The game boasts a good, deep single-player game, and is of course a tremendously entertaining two-player game. The single-player game is rich with characters, including six new ones to add to the 10-strong roster, but also features a great bonus area (called Cerebro), and a super training section.   Paradox went to town with the Training mode, ~Academy,~ with two parts to choose from, Academy Training and Independent Study. Academy is the most informative, since it posts a paragraph or two about what style your character likes to fight in, which is helpful, followed by a group of all the characters moves, organized by their kind. Players learn everything about their characters by performing each attack, combos, etc. and then training. Each move is written out, and the menu indicates when you've got it down. Independent Study is just a free-form practice area, which also lists your moves.   The fighting system is straight out of Street Fighter, just like in X-Men Mutant Academy 1. The fact is, if you're going to copy a style, Street Fighter's one of the best fighting styles to imitate. Quarter turns are the predominant move used here, with lots of back left-forward right moves, and fewer Z-style moves then I remember from before. The game's biggest new feature is the addition of the aerial attacks. These moves are a natural progression in the game, adding an abundance of energy to the fighting. With air attacks as part of the mix, juggles, air combos, and just good ol' extra ass whooping makes the game extra fun.   The character selection is great this time around. When Paradox added six new characters, it deepened the game in a couple of ways: It added more variety in the simple selection process, obviously, but it also created a much wider range of styles to pay attention to. X-Men Mutant Academy 2 isn't quite at the level of a title like Virtua Fighter 3, which demanded that you fight each character according to their style, but the huge roster does approach that idea.   Gambit, for instance, is more defensive than say, Beast or Wolverine, who depend on a sheer onslaught of combos, supers and juggles as often as possible. New characters such as Havok and Rogue blend super powers with strength simple moves. Nightcrawler is a weird one, equipped with his sword, but also very dependent on his transporting ability, and Forge joins the other projectile characters such as Cyclops and Mystique as their more or less primary powers.   For the most part, the gameplay balance between characters is good. As in any fighting game the developer has their favorites, and it appears to me that Beast and Gambit are quite heavily favored, while characters such as Toad and Mystique unfortunately have not been toned down much. These last two characters are, I must say, extraordinarily cheap, and they unbalance what is essentially an even scale. Also, of the three difficulty levels, the medium level, which is the default one, has been jacked up quite a bit so it's now hard. The opponents come out swinging heavily and show incredibly aggressive behavior -- even within the first three opponents. I am still not a big fan of the hovering characters either; that function serves to annoy more than anything.    So, I'll finally stop teasing you now and give you the whole list of characters. It includes 10 selectable characters from the first title -- Wolverine, Cyclops, Gambit, Storm, Beast, Phoenix, Mystique, Toad, Sabretooth, and Magneto. The new characters include Rogue, Forge, Nightcrawler and Havok. Two others are secret, and must be unlocked. One of them is Psychlock. There are special appearances by Marvel characters also, including your friendly neighborhood Spider-Man, among others.    As with the first Mutant Academy, X-Men 2 uses a Super Meter system. The Super Meter increases as you deliver damage, but also enables players to use different moves to build the three branches of the meter up. For instance, you can build up whatever Super you like by using special moves, and then you can manage your power from meter to meter, providing a unique optimization function not normally found in all fighting games. One of the problems that we had with the original was that it had a bit of a balance problem, as some characters seemed so much more powerful than others.   Other than what I have mentioned, there aren't too many other things to complain about in X-Men 2, other than that the production values seemed a little weaker this time around. For instance, the slowdown during Supers causes stutters in sound and forces major slowdown in the entire game, too. And there appear to be total sound relapses when Nightcrawler performs his throws as well. The jacked up AI in Medium might cause some folks to get very frustrated, too. And Hard, well, it's VERY hard.     Graphics For the PlayStation, X-Men Mutant Academy 2 looks very good. The character textures show a little more definition and shading, creating better-looking muscles, body shapes, and whatnot. And the levels are cool, too, especially because there are several more than before. There appears to be much more good use of good-looking light-based particle effects, seen best in characters like Cyclops, Forge, Gambit, and Mystique.   What's also nice about the game are the extra costumes that can be unlocked by beating the game, which add lots of replay value, but also add visual depth to the game, too. Paradox went to town on the X-Men and Matrix-style Supers, too. When the move is enacted, the camera shows the attack, then stops the action, pans the camera around the characters Matrix-style, and then records the rest of the move. It's nice, and well done here, although this technique sure has been used a lot lately.   But while X-Men 2 looks decent for a PlayStation game, the artwork style also resembles a strangely, randomly knit quilt, too. Just by looking at the giant difference between the CG style of the characters and the in-game style there's a huge difference. Toad looks entirely different in his out movie than he does in the game itself. Like the first game Toad is ~old toad,~ fat, and wears that really stupid gold and purple outfit. But in the CG, he's slim and short-haired, and in a different outfit. Then, there's the loading screen artwork, which totally contradicts the look of the characters in the CG in the game, and not just in general looks, we're talking generations worth of X-Men styles, with different looks, outfits, haircuts, sometimes ever powers. This thing is a total contradiction of styles if there ever was one. It's inconsistent, and unsettling. If the artists were just trying to go for as many looks as possible, for the ~biggest reach,~ they may have succeeded, but only while failing to reach one iota of consistency.    There isn't much left to say about the game graphically, given that we're all moving on to the PlayStation 2, GameCube, and Xbox, making PlayStation games look really old and imperfect. But comparing it strictly to other PlayStation games, X-Men 2 boasts respectable looks.   Sound The X-Men aren't usually a very witty bunch, and so with the exception of say, Wolverine, who says very predictable things like, ~Is that all you've got?~ ~Not Even Warmed up,~ and ~Amateur,~ or Toad's ~Kicking your butt makes Toad happy,~ you won't get too much vocal genuinely smart words out of these guys. Wolverine's lines are only good because he always so mad. I did like Beast best because he's usually so serious. After pounding an opponent to the ground, he'll say something like, ~Violence is never the answer.~ Spider-Man (yep, he makes an appearance) has some decent lines, too (~Ho! Newsflash, you've got to hit me to beat me,~ and ~You guys don't fight well, solo, do you?~), but for the rest, they're all rather tame.   The voice acting is great for some characters, while it's hum-drum or even weak with others. Wolverine, Beast, Toad, and Xavier are by far the best acted, with nearly perfect imitations of their TV show voices. Characters such as Sabretooth, Magneto, Forge, and others are less accurate or impressive. Paradox Development has always had a knack for fighting games (X-Men Mutant Academy, Wu-Tang, Thrill Kill), and although pretty much the rest of the world has moved on to newer systems, X-Men Mutant Academy 2 has a lot to recommend about it on PlayStation. And even though there is a certain level of cheapness from some of the characters, and enough play for newbies to jump in an play with a good deal of button-smashing, the game has progressed and grown from the first iteration in other areas. It's a little bit more of a skill and finesse game than it used to be, despite the things I mentioned above, and the supers aerial attacks and combos for the now much wider range of characters gives this game legs on which to stand. Skilled players can totally wipe out the competition with long combos and supers, and the air attacks great longer combos for far more damage.  I liked the first game in the series, and I recommend this one for anyone still avidly interested in buying new PlayStation fighting games, and especially for those who're X-men fans. Hard-core Street Fighter and Tekken fans need not apply. X-Men 2 is by no means innovative or new in concept, but as with all good sequels, it's better in all the right places, and for X-Men fans it's great fun.", "date": "Oct 1, 2001"}