{"name": "Monopoly Tycoon", "name_review": "Monopoly Tycoon", "ref": "https://www.ign.com/articles/2001/10/01/monopoly-tycoon", "text": "Classic games on the PC can take one of two approaches -- either reproduce everything as faithfully as possible with only the most minor alterations or reinvent the whole game entirely and count on people liking the new version better than the original. But if you're Hasbro (or what used to be Hasbro) then there's a third option open to you -- you can somehow miraculously combine the two approaches and create something entirely new yet wholly original. From Risk to PacMan, Hasbro had made excellent PC versions of nearly all of their arcade and tabletop properties. Monopoly Tycoon is no exception.  Anyone expecting to open up the box and enjoy a nice traditional game of Monopoly will be pleasantly disappointed. The game that taught all of us the value of unfettered, unquenchable greed has undergone a few changes. And we're not just talking about the real-time focus and the total lack of dice -- this Tycoon-ized version of Monopoly is much more about real entrepreneurship. Like all good capitalists, you and your opponents will grow fat exploiting the aimless mob that lives and works within Atlantic City. You'll need to provide them with houses and shops where they can drop their money in your coffers with great convenience.  Like the board game, the city is divided into blocks. Marvin Gardens, North Carolina Avenue and Boardwalk are all here. The train stations and utilities each occupy their own blocks as well. Any player may construct a building on any block (at least at the start), so you'll soon see apartments and restaurants and theaters rising to the sky as your city develops. There are even some new buildings (like the hospital, library and city hall) that don't seem to have much of an effect on the game itself but add to the illusion that you're playing in a real city.  The illusion is heightened by the variety and beauty of the graphics. Seeing the entire city rendered in full 3D is genuinely exciting. Although the city itself is only six or seven blocks wide the draw depth is remarkable. The buildings are the real highlight here. Each building comes in an array of styles so you can have thirty different apartments that all look different. The same can be said of the businesses as well. Lots of cars and pedestrians roam about to give an even stronger sense of life to the game. You don't get absolute control over the camera, but the range is more than adequate for your needs. And by ~more than adequate~ I mean ~really convenient.~  During the game you'll be facing up to five other players. You'll need to establish a place for people to live and give them plenty of opportunities to shop. On the apartment side, you can place buildings of various foundation sizes and heights on any of the open city blocks. You'll want to place the forty or so businesses in the game near wherever the traffic seems highest. And since there are five other people trying to do the same thing, things get competitive really quickly. You can set prices and stock levels for each of your businesses in an attempt to undercut your competition. If you want to take out Racecar Boy then you can just build your businesses next to his and drop your prices.  Since the game plays out in real time, you won't get a break. (The game does have a pause feature, but you won't be able to do anything while the game is paused.) There are a number of summary screens that help you get a grip on the overall situation. On the zoomed out city view, you can see which services are most wanted on each block (each block that has a residence at least). You can also see who owns what and where. Setting prices and stock levels can be done at the zoomed in block view. As in the board game, you can obtain a monopoly by buying the various blocks outright. Any player can construct on any block, but only the owner of the block collects rent from the tenants. And if you've got all three blocks of the same color, you can build gigantic, moneymaking hotels.  The single player game consists of a series of graded scenarios. Each scenario has three different levels of difficulty (although even the lowest level is still pretty competitive, even in scenarios where you don't have any direct competition).  In one scenario you'll have to be the first player to obtain a certain number of sales or reach an established daily profit. A race for the highest net worth (set to expire at a particular dollar amount or time deadline) can also be fun.  More interesting are the mayoral race scenarios where you've got to maintain a positive cash flow while also cultivating the love of the people. If you get enough votes, you can kick back and watch the kickbacks roll on in. An elimination mode is also included for the truly hardcore economic Darwinists. The least popular player is eliminated at the end of each day. The game also has a truly excellent tutorial that's divided into several small chapters that you can go back and review at your leisure.  Offerings on the multiplayer side of things are pretty much the same as they are in single player. You can set up scenarios with each of the single player victory conditions. Unfortunately, because this is a real-time game, there's no hotseat option. Still, playing the game on a LAN or over the internet is still enjoyable. Whatever.  Once you've exhausted all of the game's scenarios, there's a very open-ended and forgiving sandbox mode. This is where you can really get a sense of how all the various parts of the game relate to one another in a non-competitive, deep pockets kind of environment. Any game that asks you to develop a thriving community out of dozens of separate but related elements should provide an open-ended, no victory scenario.  I can't really think of anyone who won't enjoy this game, at least on some level. Recent games like Corporate Machine or Zeus offer a similar kind of experience and might seem more sophisticated, but the level of challenge in Monopoly Tycoon is every bit as high and the relationships among the various elements are just as clever. Combining an awesome real-time capitalism game with the elements of the board game, Monopoly Tycoon is more than worth the time you spend with it.  -- Steve Butts      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Oct 1, 2001"}