{"name": "Yanya Caballista: City Skater", "name_review": "Yanya Caballista City Skater", "ref": "https://www.ign.com/articles/2001/10/15/yanya-caballista-city-skater", "text": "The best thing that can be said about Koei's first skateboard venture is that in the most innocent and light-hearted of ways, in the light of what videogames have been, and should continue to be, Yanya Caballista City Skater is a light-hearted ~fun~ game. It's not a very good skateboard game, it's not a very serious title, and it's not something most people will ever record in their memory cells as being a skateboard game that drew them into the extreme-sports realm. No, it's a throwaway. Except for this: The goofy, cute aliens who invade earth are so adorable that those who do buy this game perhaps will feel happy inside, the way cotton candy and a ride on bumper cars makes one feel.   Gameplay The premise behind Yanya Caballista is absolutely childish to the point that even a comic book company would have rejected it: Aliens have invaded San Francisco, Ca., and even the strongest of army forces can not damage them. The alien forces named Gawoo are white, blue-eyed ghosts that resemble gobs of candy and look entirely harmless. They're everywhere, doing something that scares everybody off the street (except for the busy stream of traffic that crowds them while you're skating), and neuters America's finest.   So, logically, naturally, the city's grungiest, coolest, most athletic chilling group of kids is the only savior. And how to do they off the mean aliens cloaked in bed spreads? They skateboard. They pull off phat tricks. They get rad on the city's most famous buildings. Oh yes, friends, they skateboard like the blood-red Americans they are and they do it like Tony Hawk and co. And by doing so, they awe the Gawoo to such a degree that in the face of such awesome tricks and kick-flip happiness, they instantly disappear. The moral of the story? Skateboarding saves San Francisco, and possibly even the world. God bless skateboarding.   So, with kick-ass story like that (one that I think is actually so silly and na?ve that it's endearing), players MUST play this game, right? Well, for anyone who likes skateboarding games, or for that matter, games with a decent sense of control, City Skater is not quite cotton candy and bumper cars. No, City Skater's biggest problem is its control: The imaginative but failed attempt at using a little plastic skateboard that fits over the two dual analog controllers. Just like Ascii's Surfoid (Surfing H30 in the West), the idea is cute and neat looking, but it doesn't make for great control. The pop-on skate fits over the two analog controllers, theoretically enabling players to use the skateboard to guide the skater across the environment, pushing the R3 right, while L3 left, or by pressing down on L3 and R3 to pull off moves.   The novel approach is neat, but it falters badly. The manual recommends that players turn the PS2 controller sideways in their hands, holding it vertically, so that the little skateboard points up and down, and so that the two handles of the Dual Shock point right, instead of down. It's designed for players to use only their thumbs, pressing down on the dual analogs to pull off maneuvers, or to shrug the board left or right for spins. The two biggest are that the board actually slipped off the dual shocks a few times while I played it, and that the quick response needed to pull off accurate moves in a timely fashion, which is what skateboarding games are all about, is entirely lost on the dual shocks.   Other than the goofy story and the bad control, City Skater is a rather simple game that follows the standard, pull-off-a-trick here, beat-the-clock goals there formula that we've become used to in skateboarding games. The biggest difference as you progress between this game and any other is that the pestiest Gawoo require specific moves to be obliterated into alien dust. Naturally, the goals here are slightly more surreal: you pull off tricks to evaporate aliens, who look all too close to Mr. Bill (Ohhhhh, noooooo!) before he gets his face corked. Those are truly the best moments of the game, and although they're a weak idea on which to base a title, it's quite cute to see their expressions over and over.   The bulk of the game is in Street mode, but there are other modes to play. There is a hefty basics introduction, which is mandatory is you want to succeed, a Street Mode (kind of like Career), Ramp Mode (by pulling of tricks you create music), and versus mode, for two players.   Graphics Koei went for cel-shading in City Skater, following Sega's Jet Set Radio as an example. What the company's designers have created, however, leans more toward the simplest of Saturday morning cartoons, than a gritty, urban environment. The environments are simplistic and basic, with dull, ordinary textures on the backgrounds, and predictable characters. The cel-shading itself isn't bad looking, and neither are the environments, but they're far below the average graphics we have come to expect on the PlayStation 2, and as players dig into the game, they'll find the entire game is just rather mundane looking.   Sound Remember how you loved the music on games from the Genesis and Super NES? Well, don't grab your emulator just yet diehard fans, because Yanya Caballista City Skater's music is a reprisal of the good old days. The music here is electronic and simplistic in sound, with very tame themes running throughout. It's like the music designers wanted a happy, light set of tunes that recalled the ~glory days~ of the 8-bit and 16-bit systems (which by the way, weren't bad, just limited), and wanted also to mesh them with current popular kinds of music, such as ska, power punk, and pop. The music matches the game's themes, no doubt, but it leaves much to be desired. Yanya Caballista City Skater (a Caballista is a skater dude or skater chick, by the way) is one of those cute, fun games you might get for someone who doesn't play games more than once a year. It's simple, and it's novel, and the skateboard seems really cool, but only at first. The story idea is cute and hilarious and the emphasis on the Gawoo's adorable behavior and expressions is worth looking at, for about an hour, max. But don't be mistaken by the game's flashy cover art (which is cool and colorful), although this looks like a neat game, it's not a good skateboarding game by any stretch of the imagination. Playing with the controller in vertical fashion with a little finger skateboard doesn't do the game any justice at all. Koei would have been much better off ditching it altogether and using the standard Tony Hawk scheme. Furthermore, the trick set is limited to few moves, and they're difficult to pull off, due to the nature of the analog sticks. It's neat to see that the L3 and R3 buttons are being used, but if the end result is that the control doesn't function very well, it's not that good of an idea. Skateboarding fans stay clear of this one, unless you're in a goofy mood, and you just want to play something entirely silly. Casual gamers beware, too. Rent this game first and then decide if you want to purchase it. It's cute, but the effect only lasts about an hour, and given that Tony Hawk's Pro Skater 3 is just around the bend, the decision has been made before you.", "date": "Oct 15, 2001"}