{"name": "Paris-Dakar Rally", "name_review": "Paris-Dakar Rally", "ref": "https://www.ign.com/articles/2001/10/15/paris-dakar-rally", "text": "It doesn't take but more than a moment of playing Paris-Dakar Rally to realize it's bunk. But it does take several hours of playing Acclaim's latest rally racing game to truly understand that Paris-Dakar Rally is a sub-average in every respect of the word. So it makes a lot of sense to me now that while Acclaim has been busy trying to re-forge its image with some truly good games (All-Star Baseball, Dave Mirra's Freestyle BMX, and Extreme-G3) in this next-generation, it's still not quite there. And Paris-Dakar Rally, a primitive, sleep-inducing, brain-numbingly bad attempt at a rally game, is a perfect example of what's holding the company up.   Gameplay With Paris-Dakar Rally, at least there's a hook of some kind. I mean, unlike Colin McRae Rally, which offers a stunning physics model, subtle, precise control, an incredible variety of courses, and great vehicle deformation, Paris-Dakar...well, it has its own special deal. The big hooks here are the name ~Paris-Dakar,~ and the wide variety of vehicles you ride. Only, in the US, very few people, and I mean very few people, know or care about rally racing (except for yours truly), and the ominous trek that is the Paris-Dakar race means diddly-squat to them and everybody else.   So yeah, vehicle variety. You can race with a standard set of rally cars, but also, there are buggy vehicles one can race, dirt bikes and ATV vehicles. You can ride as any of those vehicles through any segment of the races in Arcade mode. In Time Trial or Campaign mode you must pick a vehicle and stick by it. In Arcade mode, by placing in the top three racers, you move on to the next segment, opening up a new track. In Campaign, you need to minimize damage through four-segment courses, and repair in between courses, as your score accumulates after each and every one. Perhaps the best thing about the game is that it's got a relatively long list of courses (all split into four segments), and that players can view them through about five camera perspectives, including two nice inside the cockpit ones.   But despite it's interesting but gimmicky pull, Paris-Dakar breaks down and flails as a rally game in every way. While no real true rally games have appeared on the PlayStation 2 yet, Paris-Dakar won't satisfy any fans of the genre, or driving fans in general. First, the control. Just last week I complained that while playing Arctic Thunder, I felt as if I was passively experiencing a game that happened around me. About 50% of the time in Paris-Dakar I watched as my car pointed straight and strange, perplexing things would happen to it. Sometimes, I would hit tiny little bumps I couldn't see that would send my car spinning. Other times, I touched the shoulder of the road and I was sent into a four-point over-steering struggle with my vehicle that caused incredible maneuverings about the course. Needless to say, even when I learned the controls and mastered this particular game's sense of rally racing, I never felt comfortable driving. In fact, I found the ATV and the motorbike more favorable, because they provided more control than the rally car itself. Think about that for a second  the bike and the ATV are easier to control than the rally car in a rally game.   Paris-Dakar is a racing game that doesn't try to balance sim or arcade styles, it's genuinely an arcade-style game. But it's by no means a good arcade game. The control is loose and difficult, and the game's physics model is simplistic, rough, and unforgiving. It's difficult to get a good sense of power slides, which comprise 90% of a good racing game's controls, and they're minimalized here, and not really a big part of the game's emphasis.   With an emphasis on just staying alive, with no skills that pertain to rally racing, Paris-Dakar is an experiment in arcade craziness, or gameplay randomness, very similar to Arctic Thunder. Even from the beginning, I found it difficult in to place in the top three spots, and this is coming from a guy who lives to play rally racing games (Colin McRae 2 being the best I've ever played), and who is good at them. I found it quite amusing that in the manual, there's a great description of the Paris-Dakar race that perfectly fits the actual videogame itself. ~Less than 15% (of the contestants) ever cross the finish line. It's tough enough just to survive the 1,000 miles through the world's harshest terrains, let alone to win the rally.~ I would concur; most folks won't finish (or hopefully even start) this game. But here's how I would have written it: ~Less than 15% (of the contestants) ever cross the finish line (because the game sucks). It's tough enough just to bear the 1,000 miles through the world's most mundane terrains, let alone to win the rally. Hari-kari has never looked more appealing.~   There are a number of inconsistencies in the game as well, one of which starts with the fact that it's easier to beat most levels with an ATV or a bike than a rally car, but they get more interesting after that. There are no visible checkpoints in the game, so you never know at what point you should measure your times. But highest on the whacked list, however, is that while this is a rally game, Paris-Dakar can't decide whether to show opponent cars or not. In real rally racing, drivers race against other racers' times. Here, you appear to race against other racers' times, too, because there are no other racers on the course. Or at least, that's what it seems like at first. Out of the blue, your standing may change from 17th to 4th, but you'll never see yourself passing a car, or any other cars pass you. And then, you'll see a single motorcycle of a lone buggy come plugging along, or sitting in the course, with a blown engine, or something like that. And voila! It appears as if you are indeed racing against other cars! So, where are they on the course? Only the gods of the treacherous Paris-Dakar Rally universe know how or why they do such things.   In short, the gameplay is poo.   Graphics We have been here before, and it's the middle of the road, where the graphics are average in texture quality, the resolution is decent but not good, and the vehicles aren't entirely crappy looking, but you never get that hot, obsessive feeling that pushes to play this game. Visually, Paris-Dakar fits right in the middle of the road, between decent and poor graphics.   Really, there isn't much to say here. The game didn't get much loving in the visual department. The crude polygonal backgrounds and dull brown-green color palettes remind one of a swamp or a bog or a garbage dump more than a rugged rally course. Plus, there are dozens of little polygonal glitches when you travel off-road that appear. I saw a strange weird brown screen that flashed across the screen a few times when I was stuck and it make me feel a little weird about world I had traveled to for a moment before the course reappeared back on screen.   Sound Just like the graphics, the sound department appeared to be low on resources, imagination, or both. When these cars smack into things, it often sounds like somebody is dropping a hammer onto the garage floor, or flinging a wrench into a washing machine. The cars also sound particularly weak. If these cars sounded like this in real life, it would make people believe that sewing machines, an electronic can opener, or a dot-matrix printer ran them. Weak sauce. In short, I would be embarrassed to drive a rally car that sounded like Jim Carrey making the most annoying sound in the world, but apparently, the folks at Acclaim thought it sounded acceptable. Though it's the first rally game on the system Paris-Dakar Rally is a real stinker. It's a totally weak rally game through and through, with bad control, no real sense of rally driving (unless you like to feel completely out of control), and despite the offerings of four different vehicles being offered, not one of the experiences is a good one. As usual with games that try to do too many things, it would be have been far better for the designers to focus on doing one thing really well, like the hum-drum concept of making the rally racing experience in a rally game a good one. Oh, well. Paris-Dakar Rally is a total wipeout and leaves itself clouded in a giant plume of its own dust. My recommendation: do not buy, do not rent, do not pay heed to Paris-Dakar Rally.", "date": "Oct 15, 2001"}