{"name": "Batman Vengeance", "name_review": "Batman Vengeance", "ref": "https://www.ign.com/articles/2001/10/17/batman-vengeance-6", "text": "Ever since the brilliant awe-inspiring Frank Miller version of Batman (The Dark Knight Returns) struck American like a wild comet from heaven in the early 1980s, DC Comics' Batman has led one of the greatest comic book revolutions ever seen. More specifically, The Dark Knight Returns (along with The Watchmen and a handful of others) helped to revitalize the comic book industry and opened markets to movies, new TV series, and a wider acceptance of comic book characters in mainstream altogether.   That's a lot of credit to give on comic book character, but in my mind, it's right on. What's more important is that Batman, who had become one of the dullest superheroes in the universe thanks to the too many reruns of the once-hip '60s TV series, and his particularly bad role in the Super Friends on Saturday morning TV, was entirely re-invigorated with dark vengeance, superb imagination, and more significantly, a great sense of awe. Once the lame-ass vanilla gadget flunky, he became the Dark Knight, a fearful ruthless, thug punisher, who had strong, deep relationships with his evil nemeses, and a deep, mythic presence, bigger than most people had ever imagined.   Now, almost 17 years later, Batman has set the pace for mass media comic book characters in four live-action movies, a handful of new TV series, and most recently, videogames. And what's nice is that Batman Vengeance, Paul Dini's and Bruce Timm's animated series, gets the whole evil Batman thing quite well. Ubi Soft's Batman Vengeance is a remarkably accurate re-creation of the animated TV series in a videogame in both visuals and presentation, offering a next generation feel, and replete with familiar gameplay elements. Batman Vengeance won't break any molds, but it's a good arcade game that pays admiration and respect to Gotham's vigilant defender.   Presentation  Batman Vengeance is one of those games that gets presentation. When a designer understands this idea, players find that the things they've been slight annoyed about for the last five years have vanished. More importantly, the game, such as Batman Vengeance, is scripted and delivered with such an eye for detail that you, the player, actually feels as if you're experiencing something else. Not just a game, but an experience. Ubi Soft gets Batman (I'm referring to Paul Dini's and Bruce Timm's animated series specifically), and from the very first seconds of this game, you'll feel that you're being given a proper experience, with full respect to the comic book character's true essence.    Intermixing cutscenes and gameplay to start the title off, Ubi Soft runs credits in with simple button commands and delivers the premise of the game in one colorful stroke. Following the initial prologue, players train in the Bat Cave and work out the mysterious details of the game's first set of clues. With Kevin Conroy doing the voice as Batman, and Tara Reid voice acting as Batgirl, the game mimics the show exactly. The animation used in the game initially resembles cel-shading, but isn't. It's a simple flat shading technique that resembles the TV series quite well, and while it's a little simplistic compared to some of the best games on the system, it's quite fitting. And everything else from the score to the artwork, and menu system fonts suggest an eye for style.   Gameplay  Batman Vengeance is a story-driven, mission-based game that features all sorts of classic mini-games and Batman foes. The Joker is the first villain to appear, and it is he who sets up Batman in a mystery involving an innocent woman who is nearly killed by an explosive bomb, and her kidnapped son, who is being ransomed for $5 million. But as Batman looks deeper into the ploy, he finds it's much deeper, and involves Mr. Freeze, Poison Ivy and Harley Queen, too.   The game offers a camera that enables characters to move around without a rigid camera always stuck on Batman's back, and gives them the ability to return them to the behind-the-shoulder perspective with a tap of the R1 button, a nifty solution to getting lost and losing direction. It also offers a first-person mode, which is kind of neat, although limited in use. More on that later.   The game itself is a compilation of arcade-like gameplay styles that relies on a third-person perspective camera angle to show our superhero in his basic mode. He can walk, run, sneak, jump, and use a dozen or so bat gadgets to complement his martial arts fighting techniques (or at least that's what Alfred calls them). Players will find that they can drive the Batmobile and fly the Batplane, sneak around stealthily like Batman ought to, and free fall, much like players could in certain Earthworm Jim levels. But gamers also find that in addition to a relatively fun little fighting system, consisting mostly of kicks and punches, they'll get to use Batman's bevy of gadgets and moves specific to the Dark Knight himself.    By double tapping X and Batman jumps and holds his cape to glide to safety. By pressing Circle, players duck into a block, enabled by Batman's cape. And by pressing R2, players get to see Batman's library of mechanical goodies. These include Flashbombs, Batcuffs, Batarangs, Electric Batarangs, Remote Electric Charges, a scope, Batgrapple, Nets, Bat launcher fired Stunners, and the Bat Launcher itself.   The gadgets themselves are cool, for the most part, but using them becomes a little tedious. Players have to stop the action, enter into a menu, select the weapon, and then use it, breaking up the game by stopping the action. To simply switch to another gadget, it's the same process.   What's happening in the big picture is that Batman is controlled in two ways, in the third-person perspective that's occasionally altered with cinematic views, sort of like in Resident Evil, but also in the first-person mode. The problem with this is that players can't get to every one of Batman's moves and gadgets and fight at the same time. In first-person mode they can explore and use gadgets freely, but they can't do things like open doors, or punch and kick. Conversely, in third-person perspective, players can open doors, jump, walk, fight and kick, but they can't freely access all of their weapons. It's more than a little awkward.   There are two additional notable problems that will certainly bug players. Batman cannot do things such as jump kick, or fight in air, which seems like it'd be totally natural for the caped crusader. The other thing is a casualty of animations. It appears that when Batman is transitioning from one animation to another, the animations are interpolated from one to the other, or aren't interpolated very well. The end result is that players often have to wait for Batman to finish his animation before starting another; this happens a lot when Batman is using his cape to glide, when he's smoothly jumping onto a ladder, or when he's jumping. These little things add up.   Another problem I have with the game is its canned, or at least limited, sense of freedom. While Batman can indeed move around in full 3D, there is usually very little offered for him to do. The gameplay mostly consists of him meeting relatively simple objectives, such as freeing frozen guards, or hitting select buttons or fighting. The problem isn't so much that these elements are done poorly, it's that everything is obvious. When you have to find the right door out of the room, there is hardly ever a wrong door to fool you. When you have to find and hit the right switch, there are rarely, if ever, any wrong switches to hit. So, when you do find the switch, or door, it's simply a matter of finding it. Everything else in the levels is non-interactive, which A) doesn't encourage exploration, or B) much thought. Thus, it's clear that while Batman's gameplay is gauged for younger players and fans, and not for longtime hardcore folks.    Still, with Batman it's the variety that counts. Players will find that in addition to the regular set of moves, they earn special kick-butt automatic Super Moves, five in all. These moves floor any opponent when enacted, and they complement Batman's standard hit-kick combos and use of gadgetry. In fact, the fighting system, although rather simple, is totally fun, surprisingly so. The kicks and hits are quick responsive, and with a little figuring out little moves such as charges and the use of Super Moves create a fun fighting experience. Players get to fight head on with lots of thugs and henchmen, but also get to go head-to-head with bosses too, such as the Joker, for starters.   To sum up the gameplay, Batman Vengeance Isn't the greatest comic book character game I've ever seen or ever played, but it's fun. The game is packed with variety, with each mini-game working well, and with five stages and 19 playable levels, it's a relatively big game that can be beaten in under 10 hours. Players will also feel as if they're finally playing a Batman game that does the character some justice, pun fully frickin' intended.   Graphics  Ubi Soft made this game easy for us to review from a visual point of view. Batman Vengeance is designed to look exactly like the TV show of the same name, and it does that very well. Simple, flat textures with highly stylized backgrounds and character designs accurately resemble the show and carry a wonderful cartoon look and feel.    Compared to games such as Gran Turismo 3 A-spec, Devil May Cry, and Silent Hill 2, the game's visuals don't compare in any way, shape or form. Batman is a simple looking game that, in fact, is plain looking, and can be said to look rather dull -- at least in terms of textures. But when you look at overall art direction and design, Batman Vengeance is a winner. The city of Gotham looks absolutely beautiful, complete with red skies, comic book architecture, and tons of style. Blinking lights flitter everywhere, dark streets are rampant, and players will find great pieces of architectural structures such as Gargoyles, grand arches, and modern day neon lit buildings are found throughout.   The characters all look exceptionally accurate to the animated series; Batman is designed with a huge square jaw, squinty white slits for eyes on his mask, the currently longer ears, and with a stoic, slightly angry look on his face. The Joker looks is very pointy, with a sharp chin, lots of green and white on the face, and he moves exceptionally well. He's just as comical as he is evil. And naturally, the Iceman is skinny and bald, with a thin neck and a weird voice, not anything like the bulky, burly Arnold as seen in Batman and Robin (Batman 4). Both Poison Ivy and Harley Quinn look, move, and act remarkably smoothly and well.   Sound  Batman is scored with a great action movie score that generates a great deal of drama and, when necessary, as with the Joker, a little flights of humor. The music is right on the money, for this kind of game.   The voice acting is what really carries the game's aura presence, though. Kevin Conroy as performs as the voice of Batman, Mark Hamill plays The Joker, and Tara Reid takes over as Batgirl, but just as convincing as characters such as Harley Quinn and Poison Ivy. The game is certainly a high mark in comic book games with a high level of production value. In fact, I feel that this game greatly benefits from the authenticity of the voice actors as much as any other aspect of the game.While there hadn't been a good comic book based superhero game in the 32-bit era until Spider-Man came along on PlayStation back in 1999, Batman Vengeance appears to be the first comic book-based game on the next-generation systems to kick things off. The game is rich with presentation and graphic design, and everything from the city of Gotham to the character designs to the menus are stylistic and smart. The texture detail is certainly lacking, but it could easily be passed off as a design decision as it could be Ubi Soft's inability to dig a little deeper into the PlayStation 2's innards. The game itself is not the next-generation butt-kicking game I hoped it would be, but it is a fun, varied title that, despite harboring some awkward control here, and simplistic design there, winds up being a respectable arcade game, steeped in Batman lore. It's packed with gadgets and Batman stuff, boss levels that show off at least a few of Batman's better known enemies (The Joker, Harley Quinn, Poison Ivy, and Mr. Freeze), and it lets you drive the Batmobile and fly the Batplane. It's a good game, not a great one, but if you're a fan of Batman in any shape or form, you'll enjoy it. It's also very kid-safe stuff.", "date": "Oct 17, 2001"}