{"name": "Trouballs", "name_review": "Trouballs", "ref": "https://www.ign.com/articles/2001/10/17/trouballs", "text": "joins the very last of a dying breed: Game Boy Color games. Trouballs is a decently designed puzzle title that makes a decent diversion on the handheld...it's not exactly the most original creation on the handheld, but the game has elements throughout that make it a title of its own. Features More than a hundred puzzles Password save Only for Game Boy Color Trouballs puts you to the task of linking four or six of the same colored balls in a square or rectangle fashion in order to make them disappear. The only control you have is over a series of ~gears~ that the balls rest against -- by rotating the gears clockwise or counterclockwise, you switch the position of the balls sitting against the four positions of the gear. The challenge is to work your way through the levels, switching the balls' positions to make them disappear before time runs out. The game features more than a hundred different level layouts and designs -- get deeper into the game, and the more challenging elements start entering play. For example, in more difficult levels some gears are tethered by belts, so rotating one gear might rotate a series of gears...and balls. In other levels, you're faced with an ever increasing bin of balls that fall from the top of the screen to the bin below, and you'll have to constantly remove balls from play so that the bin doesn't fill to the very top of the screen.  The design borrows from the whole Tetris/Puyo Puyo/Puzzle Fighter genre, but the gearing elements give the game a certain originality to the game category. And it's challenging, too...maybe just a bit  too much early on. Some early levels are a lot harder to complete than the ones that follow them, which might make you feel all cocky that you're getting so good at the game...only to have your butt kicked by the next puzzle you face. The only thing I'd change about its presentation is its odd habit of wiping the clock clean when you win a standard puzzle, and lose the ~constant flow~ challenges -- I actually want to see just how much time I had left on the clock...or just how close I was to winning. Clearing the clock after the end of the level is just a bad programming decision.   With that said, Trouballs is a decent package with a lot of different puzzles to complete -- and you can gain access to the ones you screw up on with the included password after a successful round. A ~create-a-puzzle~ option and a ~marathon mode~ would have been decent additions to the design that would have increased the value of this Game Boy Color game...but as it is, Trouballs is a good overall effort for the 8-bit handheld's last breath.", "date": "Oct 17, 2001"}