{"name": "Toki Tori", "name_review": "Toki Tori", "ref": "https://www.ign.com/articles/2001/10/23/toki-tori", "text": "As the lifespan of the Game Boy Color winds down to its last remaining few gasps of breath, it's outstanding to see that the system's last days will have a few games to give gamers something really special to play before they move on. Toki Tori is a real stunner for the 8-bit portable, because it offers a excellent playing game in a design that pushes amazing graphic techniques that the system is definitely not known for.  Features More than 60 levels 10 different tools to utilize Battery save Only for Game Boy Color  The game that the Netherland-based development studio Two Tribes created for the Game Boy Color is very similar in concept to Lost Vikings, where players utilize the skills of their character to advance through the structured levels that put these skills to the test. The character Toki Tori is a just-hatched chick that's been left behind after all his brothers and sisters have been mysteriously egg-napped out of their coop. With Toki Tori out of his shell, it's up to this guy to track down his buddy eggs and find out why they were taken in the first place. He doesn't come empty-winged, either, as each level gives the guy a finite number of skills to use, ten in all -- he can build a bridge to gain access to platforms that are just out of reach of his limited hop, or teleport from one level to another to zap to a place that might be out of reach of a ladder. Later levels require the strategy of creating platforms that disappear only when an enemy ghost wanders onto the activated surface. There are sixty level designs in Toki Tori, separated in four worlds of 15 puzzles. When the player completes an entire world, he or she can redo the world in its ~hard~ mode, or move onto the next world.  The game structure of Toki Tori is more trial-and-error based than relying on the gamer's action skills. Sure, several levels do involve outrunning enemy critters and blasting them with an icegun, but you'll spend most of your time carefully plotting out how to tackle each puzzle, and restarting the round each time you happen to screw up...which will occur more times than you may realize. Many puzzles have defining areas that are meant to deceive you into performing an action that might not be the proper move, and several puzzles can only be completed in one specific way...there's no squeezing yourself out of a corner in this game ; once you've screwed up, it's time to hit that reset option.  And as fun and challenging as Toki Tori is, what really makes the game shine is its attention to graphical effects...something that'll probably make you go ~wow!~ when you see it in action. Right from the get-go, you're assaulted with vibrant color palettes, transparency effects (walk behind the waterfall and you'll see what we mean),  animated backgrounds and foregrounds, and multiple layers of scrolling...graphic fluff that's a rarity in the world of the Game Boy Color, and just goes to show how much effort the developers went though to make the game. And it even fits right at home on the Game Boy Advance, looking as close to a native GBA game as any Game Boy Color title has ever come.   Capcom picked up a good one when it snagged Two Tribes' Game Boy Color puzzle title for release this year -- Toki Tori may seem like some cutesy platformer by the almost artificially sweet happy face on the front of the box, but the game is brutal and challenging, especially in the deeper levels. And what's more, it retains that ~let me try that again~ element, even when the levels get frustratingly hard...and trust me, they do.", "date": "Oct 23, 2001"}