{"name": "AeroWings", "name_review": "AeroWings", "ref": "https://www.ign.com/articles/1999/09/09/aerowings", "text": "The Dreamcast launch has been nothing if not  varied.  If flight combat isn't your thing, then the antithesis of Konami's Dreamcast launch title Air Force Delta has to be Aero Wings.  This title, originally released in Japan as Aero Dancing: Featuring Blue Impulse was certainly an instant hit with flyboys and girls alike.  With photo-realistic environments, terrific flight mechanics and tons of stunt missions to fly, there is much to like about this modest offering.  We've taken it for many a spin and here is our lowdown on how the flight checklist looks.  As I mentioned, Aero Wings is the stunt simulation counterpart to Konami's Air Force Delta.  In AW you don't have any weapons to fire and no baddies to slay, but you do have to have wits of steel and some very intuitive controller motions to affect the stunts that one must complete in this gorgeous game.  A much more advanced form of Nintendo's Pilot Wings, AW will stand as the sole entrant into this niche category for flight simulations on the Dreamcast, at least for now.  Several hours of patience and intense flight time must be logged into this game to ultimately arrive at the pinnacle of stunt flying stardom.  Players should not expect to be able to sit in the cockpit and begin to perform amazing feats of flight without having truly begun to master the minutia of articulating precise movements while flying a variety of very nimble and extremely fast aircraft.  Since there are no weapons to be concerned with, the only thing that matters is how well you can nose your plane around the courses.  As the player's abilities begin to progress, they will find themselves performing stunts like Barrel Rolls, Vertical Cupids, Immelmans, Figure Eights, Close Formation Flying and loads of other hair-raising, knuckle-whitening maneuvers.  The game offers a Training mode in which to become familiarized with the internal cockpit controls of the plane along with their various affects on flight.  It will serve the player well to spend time there, learning how to read the gauges and how to use them to influence their flying style.  To ease players into the atmosphere of the game, players start flying in the Blue Impulse Mission.  (Blue Impulse, mind you, is the Japanese equivalent to the US Blue Angles, and these bad boys can fly the seat of their pants off!)  Moving right along here, Blue Impulse Mission is a bona fide training ground where players can familiarize themselves with the a variety of required flying skills and tricks.  You will start with simple take-off, turning, landing and loops.  Then it's onto formation loops, and other close flight tactics.  Graphical tutorials couple with graphical debriefings are used to make sure that every nuance of flight is understood and implemented correctly.  There is a lead plane instructor, presumable from the Blue Impulse flight squadron, which will critique your progress and tell you when you need practice.  He is not very verbose, though his inflection is good, so you know for sure when he is happy.   The other modes are Sky Mission Attack, and Free Flight.  In Sky Mission Attack there are various checkpoints that are the milestones of each mission.  Tufts of floating, circular cloud-like formations mark the checkpoints.  One must navigate their plane within close proximity (or through) the rings to be credited for having flown the correct path.  These are conspicuously (and sometimes inconspicuously) strewn about the courses in a variety of challenging locations (i.e, next to hard structures like...buildings!).  As things progress, navigating your plane toward these checkpoints will become significantly more difficult.  To accomplish these objectives, you will sometimes be required to perform drastic moves; like skimming the tops of mountains, only to plunge several hundred feet to the hard-deck before being able to skirt through a ring-which was deliberately placed in such a precarious position-to force the player into implementing their acquired skills to accomplish the task.  As you complete these missions, you will be awarded with additional planes to fly.  The mix is replete with the F-class planes in addition to several others for your perusal.  There is no cash equivalent, so the planes do not have to be purchased as they do in Air Force Delta.  Not a criticism, merely an observation.  Free Flight is a crafty game of Follow the Leader; where formation flying is the main crux of things.  In this mode, the player takes on the active role of flight-leader.  The flight is truly free, so you can do just about, whatever you like.  You can choose the number of members in your flight team (up to four total) and have the ability to direct them, to perform a variety of stuns, on your command.  All of the aforementioned tutorials really help to pull things together for the player so, once they enter this mode, they have a nice working knowledge of what can and cannot be done, and what planes are better at certain types of maneuvers than others.  From a graphical standpoint, this game is very lush and very convincing.  From high above in the sky, rural areas look very organic, with detailed textures representing the actual terrain.  Cityscapes are nicely detailed, though not as spectacular as they could have been.  There are some noticeably ugly seems, where textures were not blended together that can detract from the overall quality of the presentation, but it is understandable at this juncture in the life of the system.  Anyone who plays this title will certainly be enamored with the models of the various aircraft found in the game.  They are realistically colored and modeled right down to the paint jobs and spiffy decals.  Players will find themselves deploying the landing gear over and over again just to ogle at how realistic it all seems.  The cockpits are varied, though the same reference data is available for in-flight viewing.  There are three playable camera views, with in-cockpit being the favorite, though not always the best for formation flight.  Beautiful lighting during night flights, rolling waves along shorelines and a tremendously convincing skyline further enhances this entire visual splendor.  Abundantly impressive is this games diverse and savable replay mode.  From Training flights to Free Flight Mode, you can save just about any replay you so desire.  Moreover, no matter how long a flight, nothing gets cropped.  Apparently there is enough system RAM to handle all that data.  Making things even better is the fact that the camera angles used in the game during replay are simply stunning.  Various positional chase cameras, in addition to fixed and panning cameras capture all of your flights in glorious detail.  You will view some of this stuff and think that you are watching Maverick flying below the hard-deck in the motion picture Top Gun.  But how is the control? Well, this game is simple in some ways and very difficult in others.  Early missions in the Training and Sky Mission Attack are relatively simple to complete successfully.  However, as things progress, the challenge exponentially increases and (perfect) practice makes for (almost) perfect results.  You have to spend time with this one to get past the initial ignorance and learn the subtleties of the control.  Given enough time, and numerous tries at various missions, you will suddenly feel that you have gotten it; and can then really begin to enjoy the depth of the title.  But for those not so inclined, this game has flight physics that a real enough to allow the casual gamer a chance to see how a plane handles in the wind, and then enjoy marveling at their successes or laughing at their mistakes.  The Dreamcast analog pad is tuned as best as can be expected (I would think) to give the player some nice tactile flight responses.  This is not to say that a dedicated analog flight stick would not help, because it most certainly would in this case.  Nonetheless, the Dreamcast analog pad is used fully.  The D-Pad is used for deployment of flaps, landing gear and the all too important air brakes.  The player can also deploy smoke during stunt flight.  It looks cool, and it is a nice touch.  The planes found in the game are truly representative of their relative wing type, maximum airspeed, weight and general flight characteristics.  The environment plays a pivotal role in how the planes fly as well.  For example if you a flying over water as opposed to dry land, the plane will respond differently at low altitudes to how the air is rebounding off the surface!  From every aspect of visual, tactile and physics performance, this game is at the top of its class.  Sonically, not super-sonic mind you, the game is in the median range of the spectrum.  The planes sound better than those found in Air Force Delta but there is not enough else going on aurally to make the missions more exciting. In replay mode, the sounds do shift according to the player's location in or around the plane.  This is a nice effect, as real planes sound differently from inside than out.  I think that CRI missed an opportunity here to use the astounding Dreamcast Yamaha sound configuration to its fullest potential.  The music is decent, but nothing to write home about.  In addition, the voice actors are just so-so.  Then, other effects like landing and crashing are bland, almost to the point of being weak.    I have always said when talking about Aero Wings, that if you truly dug Pilot Wings, this is a nice slant on that premise.  You are however limited to fixed wing craft, and won't have the chance to pilot rocket jetpacks and all that kind of stuff.  But if planes are your fascination, you will find tons of gameplay in this title.  The controls are very good, even with the Dreamcast analog pad, and the visuals are certainly next generation quality.  Casual gamers can fly for fun, while serious minded folks can work their way through tons of missions with progressively harder objectives.  I would say that makes for a pretty well balanced game, and that is always a feather in a game developer's cap.  -- Fabian Blache III, Contributor", "date": "Sep 9, 1999"}