{"name": "MX Rider", "name_review": "MX Rider", "ref": "https://www.ign.com/articles/2001/11/01/mx-rider", "text": "MX Rider is a good-looking motocross game, and that may be enough to make it a success, but there are some, or perhaps indeed many, who will find it a bit too simplistic in some ways to have a good deal of longevity.  Motocross as a genre still seems to be searching for the best possible balance of arcade and simulation elements -- nobody has quite hit the happy medium between challenge and simplicity -- and the same problem bedevils MX Rider.  Twist the throttle and you go.  There are other controls, but they definitely take a tertiary role.  That's unfortunate, because otherwise this game has a lot going for it.  It has a strong graphics engine with a lot of special features, a perfectly constant framerate even with a full field of racers, more than enough tracks, and a very cool international flavor (this is, after all, an Infogrames entry), but all that longevity needs strong core gameplay to give it life in the first place.  That, at least from my perspective, still has yet to be hit upon.  Gameplay  MX Rider seems to lean towards the arcade style of play, although not quite to the degree of some of EA's more recent Supercross specimens.  On the one hand, it uses an SSX-style turbo boost linked to trick performance, but tricks are a relatively de-emphasized component of actual racing, and turning on a dime is linked to two separate brake controls -- you use a rear brake to slow down normally and a front brake for sharp corners.  On the other hand, the sensation of speed, the physics of cornering, and reactions to collisions are all definitely tweaked towards a more liberal experience.    The stunt system essentially conforms to my expectations of motocross freestyle components, in that they exist to suit the demands of those who don't understand what makes a fun game.  Stunts in MX Rider are animated very mechanically, and they generally last long enough that you'll crash before you pull them.  The transition animations inspire a bad laugh, too -- crash a double barrel roll and you'll finish the second revolution at ground level, with the crash animation playing once the trick is done.  The Freestyle mode proper features far more opportunities for big air, but as always, what of it?  Stunts-only action is implemented in more fluid fashion in games like Tony Hawk and SSX.  If you must have freestyle motocross specifically, MX Rider probably does the best job in the genre with its over-the-top fantasy arenas (since MX 2002's floatier physics and less precise steering lending themselves to poor stunt control even in its stunt-specific arenas), but if you're willing to replace that motorcycle with a skateboard you're liable to have a better time all things considered.  On the presentation side of things, career/championship mode is reasonably complete, with plenty of races and options for character customization.  The most interesting thing about this game presentation-wise, though, is that it's based on international motocross.  Seriously, it's licensed by the FIM, the same sanctioning body that runs motorcycle road and track races, and features a whole slew of pros who compete in motocross and supercross in Europe, South America, all over.  It's a bit of a surprise to one with a US-centric viewpoint, but very interesting once you get into it.  There are European bikes in the game, too, from Husqvarna (thought they just made chainsaws, did you?) and KTM, Swedish and Austrian companies respectively.  There are also bikes bearing the Oxbow brand, but strictly speaking that's a clothing company -- they don't make motorcyles in reality.  Graphics  Along with the keen presentation, a superior graphics engine helps make up for some of the gameplay issues.  MX Rider moves very fast, quicker than the somewhat floaty MX 2002, and both backgrounds and riders have plenty of detail to whip by as you race.  The dirt effects are the big standout, though.  Drive through mud and dust, and your wheels kick up a very realistic roostertail, to the point where it almost obscures your view.  Even cooler, your bike and rider pick up a great coating of mud as the race progresses.  It's hilarious to see a rider on top of the podium with miniskirted race chicks flanking him as he waves his trophy from underneath an inch-think coat of dirt.  Rider animation has evolved to the point that few games get it badly wrong, and MX Rider is no exception.  Leans, elbow motions, foot-dragging and the like all work together to create a very realistic body English package.  Suspension animation is equally nice, the front and rear wheels reacting effectively to the track.  The only complaint here, and it's really more of a gameplay issue, is that crash behavior just isn't quite right.  Sometimes you splash an opponent with a hard collision, sometimes you bump them ahead, sometimes you crash yourself, sometimes nothing happens.  There doesn't seem to be much rhyme or reason to it.  Sound  What's that I hear?  Is it generic pop punk?  Why, yes, it is.  Well, it's a motocross game.  Not much else to expect.  Besides get, the audio is reasonably inoffensive, with good engine noises, occasional voice clips (although the commentary isn't a constant presence a la EA Supercross), and appropriate thump-crack-bangs when riders mix it up.  The absence of commentary is an up or a down depending on your perspective, but the soundtrack definitely needs an infusion of creativity.  Sometime, somewhere, somebody will come up with a better idea for tracking a motocross game than generic pop punk, and I'll shake their hand when they do. In the end, it's mainly just another motocross game.  MX Rider presents an effective visual package, and an off-beat variation on the usual heap of licensed trimmings, but the game itself just isn't a compelling enough experience to mandate additional attention.  Twisting the throttle and going may be fun in real life, but without a way to translate the handling of rhythm, body control, and other deeper elements of racing strategy, it's going to get old relatively quickly.", "date": "Nov 1, 2001"}