{"name": "Power Rangers Time Force", "name_review": "Power Rangers Time Force", "ref": "https://www.ign.com/articles/2001/11/02/power-rangers-time-force", "text": "Once Amy Jo Johnson hung up the pink spandex and headed over to befriend Felicity, I was done with the Mighty Morphin Power Rangers. Besides, it was hard to keep track of those superheroes when they left Angel Grove to save space from the evil forces of...cripes, who was the arch villain after Lord Zed? Anyway, apparently, to folks who don't follow the exploits of the live action anime bastardized for American consumption by our good pal Haim Saban, the Power Rangers are now 30th Century protectors of the timeline or something. Makes for a decent videogame idea at any rate, and THQ's continued the license on the Game Boy Advance by recruiting Vicarious Visions to the task of reproducing the show's action on the little screen. The game produced for the handheld is a decent diversion for the younger crowd, but it feels a little incomplete...possibly rushed to production to insure that the cartridge makes it to market while those kung-fu fighters are still ~in~ with the kids. Features Seven different locations Megazord boss battles Password save Only for Game Boy Advance  In Time Force, you'll take control of the five different-colored (and similiarly animated) Power Ranger characters through different periods in history, wiping out the evil threat before they pollute the timestream. The game is a basic sidescrolling action title that puts heavy emphasis on button-mashing up-close combat, platform jumping and item collecting for its game design. It's mindless fun in a sense, and the designers threw in a bit of technique by offering hand-to-hand and weapon-based fighting, as well as implementing different jump and attack attributes for each of the colored rangers. But for some reason a little bit of necessary polish was overlooked -- you have no sense that you're leaping from one time to another other than the level graphics, and when you leap into your gigantic robot battler, there's literally no transition between the two differing level designs. Cutscenes and graphic splash would have worked to the game's advantage here, as I had no sense of location simply because the locations kept bouncing from one place to the next without any plot device buffer to help the mind comprehend what the heck is going on.   Vicarious Visions' last claim to fame was its excellent action platformer Spider-Man: Enter Electro for the Game Boy Advance, and I'll bet a Turbo-Action Megazord that the same engine used for the webslinger's at work in this game produced for THQ. That's not a bad thing, as it most likely helped the development team build a better title than what it could have been. Like in Spider-Man, Time Force character sprites have been animated smoothly through prerendered means, and the backgrounds scroll by with multiple layers of depth. But most amusing of all, the same gripe I had with Spider-Man occurs in Time Force -- the hand-to-hand combat lacks a needed flair that follow's the show's universe. These guys are karate-chop masters who can flip, fly, and flop at their enemies with the grace of a caffeine-injected squirrel. Even when the game jumps to to the giant robot sequences, not a whole lot of imagination was offered during these sequences...it's just a whole lot of button mashing until the enemy dies. And even then, you really have no sense that you've accomplished the task until the scene changes to the next level.  But once again, Vicarious teamed up with the Shin'en guys for the game sound, and once again the audio of the Game Boy Advance excels with music that kicks...even for a kiddie Power Rangers game.   I wasn't expecting much out of this Power Rangers game, but hey...the low expectations actually worked to Time Force's advantage. There's a bit of fun to be had out of this simplistic game -- it's certainly a better-than-average game design, it's just not much more than that. The lack of any cohesive story design does make finishing levels a bit confusing...this was definitely a quickly-designed game shoved out the door as soon as it possibly could.", "date": "Nov 2, 2001"}