{"name": "Project Eden", "name_review": "Project Eden", "ref": "https://www.ign.com/articles/2001/11/03/project-eden", "text": "Project Eden, at the very least, is a better example of a PC port than most that you'll find on consoles these days, made a bit more impressive by the complex interface it sported on its home platform.  It is genuinely playable, if not without its issues, which is a lot more than could be said for an attempt to bring, say, Counter-Strike, Falcon, Command & Conquer, or Quake III to PlayStation 2.  With effort, you can actually make it work.  Yes, I'm aware C&C and Quake came to consoles.  And we all agree that those were very bad ideas, yes?  Eden is still a problematic game at times, particularly with regard to the way the visuals influence gameplay, and its slow, methodical pace is going to appeal more to the cerebral, PC-oriented breed of gamer, but console fans who get into it will find hours upon hours of deep-delving puzzles and action to occupy their time.  This is not Metal Gear -- you will not beat it in a sitting.  Take that as you will, since some people seem to enjoy games they can beat in a sitting these days...  Gameplay  Make no mistake about one thing before you buy Project Eden -- this is a puzzle game.  The characters carry guns, but they don't do a whole heck of a lot of shooting in comparison to the amount of time spent wandering around trying to figure out which way to go.  ~Characters~ is in plural, yes.  You control a four-character team, each of which has particular special skills that have to be applied in concert to make it through barriers.  The hulking cyborg can survive hazardous environments; the technician can fix things; the computer expert can hack up databases and control software; the leader has the security clearance to make it through key checkpoints.  There are also some fun extra tools and vehicles, like little remote-control land-based and aerial drones.  One of the interface's best qualities is how easily it makes controlling the team.  Each character is mapped to a D-pad direction, so you simply tap one with your thumb to instantly take over that team member.  Of course, perfection is hard to attain when you bring a PC interface to a console, but Project Eden makes a better go of it than most.  The biggest issue is managing to keep your whole team moving when you control the team leader.  On the PC, I assume this was just one simple hotkey -- tap it and everyone follows.  On PS2, you have to have all the members centered properly in your field of view, at the right range, and then hit the ~follow~ command.  The trouble is, unless you pay close attention to who's following, it's easy to leave the tail-end Charlie behind and not notice until you're on the other side of the level.    Once you get your head around the complex interface, though, problems like that subside, especially with the fine online help files, and you can get into getting stuck.  The philosphy behind Project Eden's puzzle design is admirable, at least until you become frustrated with the difficulty level.  For the most part, tasks and challenges are very effectively integrated with the features of the environment and the skills of the four characters (except during the occasional unfairly manipulative bits, like where the game takes advantage of the fact that you're not able to jump).  It's not just ~find the switch and flip it,~ it's ~have the one character hack the database, the other goes into the gas-filled chamber to shut off the valves, and the third guy follows behind to repair the switch and flip it once he's done.~  This is a far more realistic style of brain-teasing than we ever saw in the Tomb Raider games, and hence more engaging and more believable even when it's forcing you into convulsions of head-scratching.  Those will come on shortly, of course.  It's always tough to judge whether puzzles are ~too hard,~ as it were, or to put it in more effective terms, challenging because they are designed poorly rather than challenging because they are designed well.  Some games lead you by the nose through their puzzles, pointing the way to go and the objects to manipulate in very clear terms.  Project Eden is quite the opposite, to the point where you can spend a lot of time simply wondering what there is to do next.  You occasionally receive tips and briefings from both your control and people in the game environment, but not so often that you won't frequently just stumble across the place you're supposed to go.  The interconnected nature of the areas lends itself to running around in circles, and it doesn't help that the darkness of the graphics (discussed later) often hides exits and doors you can open.  For a game with so much rambling about, incidentally, your progress is curiously linear, since while many doors exist, only the ones pertinent to your path can actually be opened.  The rest are just wallpaper.  As you get deeper into the game, though, more immediate matters press, like the people, things, and things-that-are-people that infest the lower levels of the world and generally want to shoot, claw, eat, or all-of-the-above you.  Killing things is naturally hampered by the kind of imprecise aiming that we've come to expect from this genre of game on PS2, but the bad guys aren't often lethal enough to make that a big issue.  Indeed, death frequently isn't that much of an annoyance in Project Eden.  When a character dies, they're just resurrected at the last Regen Point you passed, no worse for the wear.  Of course, trotting back to rejoin the rest of the party may be a bit of a problem...  In the end, Project Eden is good enough that any significant objections to its puzzles and other gameplay elements mostly boil down to taste issues -- you can't point at an aspect of its design and peg it as bad enough to deserve serious complaint.  It's slow, methodical, and challenging, so draw your personal conclusions from that assessment.  Graphics  Project Eden looks better than something like Rune or Unreal Tournament, but it belongs to a similar school of PC ports, the ones that are inexplicably darkened on PlayStation 2 (especially through composite video, so play this game through an S-video connection if you can).  The textures are not nearly as blurry as the ones in those games, though, and the framerate is in fine shape -- it skips a little in big areas, but nothing to moan about.  This game has some very big environments, to address that subject further.  Look up and skyscrapers tower, look down and huge pits extend down into the lower levels.  Core's artists have done a good job of creating and presenting an interesting future world, the compressed layers of gradually degenerating civilization.  Our heroes, of course, are a little disappointing after the incredibly fluid protagonists of games like MGS2 and Devil May Cry (and the passersby aren't much to speak of at all).  They have Lara Croft's signature not-quite-touching-the-ground walk, and very stiff, predictable animations for other actions.  It's a strange sort of laugh to see Carter, the lead character, fire his gun with the exact same motion I recall from Captain Kirk's phaser quick-draw in the old Star Trek TV cartoon.  The weapon effects are decent, though, with some nice lighting cast by the basic zapguns -- why's the missile launcher so wimpy, though?  You've got this giant Robocop-looking cyborg dude, with an alternate missile launcher, but they're just little flashing lights that go off with a smallish pop.  Videogame missile launchers have a long and storied heritage to live up to, and Project Eden's certainly does not.  Sound  It doesn't sound that great, either.  You expect a loud, dense effect from that sort of thing, but Project Eden seems to prefer a higher, tinnier sort of tone in its sound effects.  It also clearly proceeds forth from a British development house, with more than a few accents from across the pond in both the main and supporting characters.  That's not a knock unless you just have something irrational against English accents -- the quality of the voice acting is pretty good overall, although you don't hear all that many sustained conversations.  Most of the time, you just hear shortish quips, which don't inspire many judgments either way.  Neither does the music, bent as it is mainly towards ambient sounds.  Cinematic sequences, of which the game has a few (particularly as you dig deeper into the story), are highlighted by backing compositions, but you won't pay much attention to any sustained features of the soundtrack while you're actually playing the game proper.Like I say, it essentially boils down to a matter of taste.  Project Eden is not going to appeal to a great deal of gamers. Those are the folks who'll play Devil May Cry for the fast action or Metal Gear Solid 2 for all the cinematic gosh-wow.  If you're going to compare Eden to something on PlayStation 2 as far as style of gameplay, think ICO, but without the atmospherics.  It's similarly puzzle-intensive, and takes the cooperative aspects of ICO's design to an entirely new level.  The story actually makes sense, too -- everybody speaks one language.  Fancy that.Pick this one up, then, if you need an even more dense and complex adventure experience.  There's a lot of meat here, even if may be cooked a little tough for the average palate.", "date": "Nov 3, 2001"}