{"name": "Capcom vs. SNK 2 2001", "name_review": "Capcom Vs. SNK 2", "ref": "https://www.ign.com/articles/2001/11/06/capcom-vs-snk-2", "text": "Capcom Vs. SNK 2 is a game that almost nobody who reviews games for a living can actually review properly.  This is an interesting phenomenon.  2D fighters have evolved to the point where the important changes from version to version can only be properly appreciated by the dedicated technicians who play them.  None of these people are in the industry, because that would mean having a full-time job, and nobody with a full-time job has enough spare time to play 2D fighters seriously anymore, even lazy print bastards.  Dilettantes such as us can only say ~well, that looks better than game A, but not as good as game B,~ and graphical considerations have long since ceased to have any meaning to serious 2D fighter fans.  They want to know what frames of animation are gone here, whose attack has priority there, which character can now jump yea, and all the other minutiae that we know nothing about, because, sad to say, we work for a living.   See, I know a lot of people in the games business, but the folks among that number who are actually good at 2D fighters I can count on a single hand.  And one of those guys works for Capcom.  At IGN, the only decent Street Fighter head is Anthony Chau, who picked up his skills back when he was still an arcade fiend in college, and his proficiency ceases somewhere circa Second Impact.  The same goes for my very specialized area of knowledge.  I know King of Fighters '97 backwards and forwards, on account of I played it for two years straight while earning my master's degree.  Everything else is just ~well, it looks better than game A, but not as good as game B.~   My point?  I guess this is all just apologia.  Those of you who need to know only the basic assessment of Capcom Vs. SNK 2 don't care, and may read on.  Those of you who want the real dirt have already bogged off to whatever die-hard sausage fansite you prefer, so that doesn't matter either.  Curse this stupid conscience of mine.   Gameplay  It's Street Fighter.  We're familiar with this, yes?   Capcom Vs. SNK, despite the ~Vs.~ in the title, is closer to Street Fighter Alpha in tone, but the addition of four new fighting ~Grooves~ to the sequel (compared to two in the first game) broadens its style of gameplay substantially.  It now has gameplay systems in common with Alpha, Alpha 2, SF2 Turbo, KOF '97, and just a little bit of Mark of the Wolves, if you count the inclusion of Just Defense in the final groove as some kind of kinship there (although it doesn't have most of the final Garou's other signature gameplay elements).  You can find a system that includes almost any of the special features from those games, if not all of them in one, and all their different styles of handling defense and super combos.    The different Grooves are fairly well-balanced, considering how much they depend on the individual taste and style of the player.  The selection of fighters, of course, is a little less even -- as is common in this sort of thing, the newer characters have a bit of an advantage.  Hibiki, the lone Last Blade representative, has evil range and speed, and Eagle seems to school everyone around the office.  Rock isn't so bad now that everyone has to relearn his counters, though, and he wasn't too overpowering in Garou to begin with (at least that's not what I found in my experience).  In any event, with 44 characters to pick from and shuffle together with the Ratio system, which allows you to vary the power of a 1- to 3-fighter team, you should be able to find a strategy that both wins and appeals to your personality quirks.   As for the specifics of the PS2 version, the core gameplay itself is as solid as you'd expect for something that's hampered by a PlayStation controller.  The Dual Shock's face buttons force you to slap at least one pair of attacks up on the shoulders, so whichever way you slice it your combos will be goofed up just a bit.  The best control solution, of course, would be the six-button ASCII PlayStation 2 fighter pad (now with no stupid VMU slot bulge!), but that's available only in Japan as yet.  For now, die-hards will have to make do with third-party controllers or older, discontinued official arcade sticks.    Graphics  It's kinda beating a dead horse at this point, but the 3D backgrounds make the issue especially glaring in CvS 2 -- Capcom needs to switch to high-res sprites.  This isn't a hardware issue, since the high-res Guilty Gear runs at an arcade-perfect blazing fast on PlayStation 2.  Someone at Capcom's art department just can't quite bear to make the leap, for whatever reason.  As a result, you have beautifully clear 2D/3D backgrounds, filled with great animating elements, and characters in front of them that look like an explosion at the pixel factory.  The number of animation frames is fine, but the frames themselves are made to look unpleasantly jagged by the contrast with the backgrounds.  I keep my Neo Geo cabinet next to my desk with Mark of the Wolves permanently installed, and I'd argue that Rock Howard looks better in 16 bits than he does in 128.  Of course, the Neo has the advantage of the 29~ RGB Monitor of Fear and Flame (my God, I love my Neo), but still, these sprites are starting to look pretty cheap.   With the death of the Naomi, then, we'll see what happens.  For the nonce, Capcom can at least take solace in the knowledge that its backgrounds look great (the addition of 3D special effects being a questionable improvement, although I'll allow that Rock's wings look pretty cool as a purple fog effect).  Capcom Vs. SNK 2 outdoes itself when it comes to 3D animation, even more than Marvel Vs. Capcom 2 -- double-decker buses drive by, rally racer's jump off sand dunes, merry-go-rounds twirl, the whole nine yards.  It feels like an awful lot of effort has been spent on a secondary visual element, but at least they can be appreciated on their own.   Sound  Since Street Fighter Alpha 3 or so, it feels a little like Capcom has ceased to take itself seriously when it comes to presentation elements.  The selection interfaces and sound design have gotten increasingly wacky in all its 2D fighters.  Marvel Vs. Capcom had ~Let's Go Crazy!~ -- now, CvS2 announces fights with ~Live And Let Die!~, among other ridiculously macho slogans.  The music has gone thoroughly bizarre, too, boasting an eclectic selection ranging from traditional technoized game music, weird attempts at soul, and goofy idol pop.  It isn't an unpleasant soundtrack -- hey, there's something for everyone -- but the overall effect inspires the image of some frothing sound designer throwing a bunch of CDs into a blender.Mock my uselessness!  I know you're going to, all you Madman's Cafe regulars.  I wave my four-slot at you!  I have a Japanese Neo 29, with Money Idol Exchanger even, and I bet you don't!Ahem.  I was writing about a game, wasn't I?  It was Capcom Vs. SNK 2, and it's a very fine 2D fighter, the broadest collection of characters and fighting options outside of Marvel Vs. Capcom 2.  It also has one distinct advantage over MvC, in that it's not a cheap-ass button-hammering pile of snot (even a dilettante such as I can tell that).  The only disadvantage to its arrival on PlayStation 2 is the inevitable difficulty caused by the PS2 controller, and with luck that will be remedied by a decent fighting solution soon.Just do something about those sprites, then, and Capcom will deliver a fighter to end all fighters.  Admittedly, I won't be able to do that one justice either, but at least it will make my job of saying ~Yes, Game A here definitely looks much nicer than Game B~ much easier.", "date": "Nov 6, 2001"}