{"name": "Aliens Versus Predator 2", "name_review": "Aliens vs. Predator 2", "ref": "https://www.ign.com/articles/2001/11/07/aliens-vs-predator-2-2", "text": "Back in 1999, Fox and Rebellion teamed up to bring us Aliens vs. Predator, the first-person shooter that used the term ~person~ very loosely, as you could play from the perspective of three separate races: Human, Predator, and Alien. Now Fox has enlisted the talents Monolith to once again immerse us in the universe of outer space hunters, slime-dripping monsters, and freaked-out Marines with Aliens vs. Predator 2.  One of the biggest draws of AvP2 is that it continues the legacy of the first AvP and lets you play through three separate scenarios -- one as a Colonial Marine, another as a Predator, and also as an acid-imbued Alien. Since we already detailed the background story for the three races in our earlier preview of the game, I'll jump right into the game itself.   Unlike the first AvP, and luckily for those of you who like a sense of continuity, the three storylines overlap somewhat in AvP2. Although the original AvP had three campaigns, the stories never intersected, and they felt like three very separate experiences. You'll visit many of the same places in each of the three campaigns in AvP2. This gives you a real sense of playing the same story from three different points of view, something that was sorely missing in AvP.  Of all the campaigns, the Marine story is the most fleshed-out -- probably because it's easier to tell a story from the Marine's point of view since everyone involved speaks a human dialect. However, all of the campaigns play out well, and the cinematic feel of the game makes you feel like you're part of the big screen experience.  Keeping with the feel of the movies, the atmosphere of AvP2 is intense, and literally had me jumping out of my seat on several occasions. This is the scariest game I've played since Clive Barker's Undying, and it's a certifiable freak-out...especially during the Marine campaign. Although you begin the game with your team, you're quickly separated, only adding to the tension and sense of isolation. The Predator and Alien campaigns have their share of chilling moments, but you tend to feel a little safer when you're an armored bug.     Although the storylines overlap, each species plays very different. In the Marine episode you'll rely on your heavy armament of guns, your light amplification goggles, and your hacking device that lets you open doors and hack into various electronic equipment. The Predator is also very well armed, but it's a much more stealthy game than the Marine campaign as your cloaking ability is very important in the face of overwhelming odds. The Alien campaign is a combination of both stealth -- especially early on as you progress from a face hugger to a chest burster to a full-grown drone -- and full-on claw and tooth action. Since you have full run of the floors, walls, and ceilings, the Alien scenario can be quite disorienting and even mildly nausea-inducing, and it's hard to get your bearings until you get used to it -- definitely something for those of you who get sick playing first-person shooters to consider, because the effect is greatly intensified when you play as the fish-eyed Alien. Level design is pretty straight-forward and, even though there are a few twists and side routes to find (especially in the Alien scenario), you're pretty much led to your objectives without too much of a break in the action. And while each episode is rather short on their own, the combined effort should keep you busy for well over 20 hours.  AvP2 is built on the Lithtech 2.5 engine, the same engine that powered Fox's No One Lives Forever. While the graphical quality isn't quite as pretty as QIII, AvP2 is one of the most beautiful Lithtech games I've ever played. Expect well-detailed bump-mapped textures and excellent lighting effects, which really shine against the mostly dark, foreboding environments. All of the character models look like they're right out of the movies, and like NOLF, are enhanced with blinking eyes and 3D eyebrows (at least the human models), adding to the realistic look. Unfortunately, the Lithtech engine isn't the best for rendering natural terrains, and the trees and hills in the Predator scenario are blocky, but they get the job done. The engine is also rather hardware intensive, and unless you're on a fast, fast system, you can expect some stutters on full detail. I played the game on an TBird 800 with a GeForce2 Ultra and I encountered a few spurts and jumps.  The sound work in the game is excellent, both in production and presentation. AvP2 features familiar sound effects directly from the movies, including the Marines' pulse rifles, Alien clicks, and Predator roar. The dynamic orchestral soundtrack changes with the mood of the game, becoming more intense during high-adrenaline situations and settling back into the background when you're wandering around. The string-heavy tracks really add to the tension of the missions. For the most part, the voice acting is well done, although a few of the actors and actresses do sound stiff and lack the emotion you would expect during a full-on Alien attack.  AI is pretty standard fare for shooters. No one takes cover or really backs one another up, instead your enemies come right at you, guns, claws, or spearguns blazing. Your enemies will sometimes run away and look for help if they're pinned down or injured, but for the most part it's just run and gun. I did encounter a few instances where the AI got hung-up on the environment, but not too many problems, and nothing that really detracted from the game.  Even with everything that's good with the game, AvP2 does have its share of bugs and annoyances that mar an otherwise outstanding title. Like the AI, I also got stuck in the environment on more than one occasion, so bad in fact that I had to reload an old game. I also ran into a couple of instances where scripted events failed to trigger, so I had to again reload my game from my last save point to set them off -- long load times make those situations even more annoying. Like nearly every FPS, AvP2 also has its share of clipping problems. This isn't so bad in the Marine campaign, but it sometimes makes it impossible to retrieve the head for either a trophy (Predator) or for a health boost (Alien) if the body slumps into the landscape. Another irritation comes every time a new level loads. When you enter a new area, you automatically switch back to your weakest weapon, which is annoying but doesn't effect the gameplay as you're rarely put into a situation where the action is heated within the first few seconds of a level load.  While the three single-player campaigns are the real meat of the game, there are plenty of multiplayer modes to keep you busy for a long, long time. The six multiplay modes include the standard Deathmatch and Team Deathmatch (Marines vs. Predators vs. Aliens), as well as Hunt (one player is the hunter and tries to kill all the other players), Survivor (similar to Hunt, but the goal is to be the last player standing), Overrun (two teams of any race duke it out), and Evac (two teams with one trying to reach the evacuation point and the other trying to kill them before they do). However, while it may seem like a lot of multiplayer options, the main objective in each comes down to slaughtering the other players. Not that that's bad, but I wish there were a few more creative modes. The designers did do a good job at mixing up the races though, and each of the classes has a number of variants to choose from that slightly changes gameplay, such as the super-agile yet weak Runner Alien, the powerful Assault Predator, and various Marine specialists like the demolitions expert and sniper.   The network code is decent, although not as good as games built specifically for multiplay like Quake III, Unreal Tournament, or Tribes 2. Performance was hit and miss, but I attribute that to specific servers since it varied so wildly from server to server. Even on some low ping servers I was getting extremely laggy performance, so it was a matter of searching for a good server to play on.  All in all AvP2 is a fun -- yet buggy -- experience, that's action-packed and complemented by an intriguing storyline. Like the original AvP, it doesn't break out of the standard FPS mold, but it is entertaining and terrifying at the same time, even with all of the annoying bugs. It still comes recommended in its current state, but after a patch or two, AvP2 will be a must-have for any shooter fan.  -- Tal Blevins      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Nov 7, 2001"}