{"name": "Test Drive Off-Road -- Wide Open", "name_review": "Test Drive Off-Road -- Wide Open", "ref": "https://www.ign.com/articles/2001/11/08/test-drive-off-road-wide-open", "text": "It's a testament to the strength of the Xbox launch that there are multiples of nearly every genre out there at launch, including off-road racing titles. Not only can you take on massive environments in Wide Open, but you've got 4x4 EVO 2 already in stores as well. The question is, does Infogrames' Xbox version of the PS2 racer play, look, and feel good enough to compete with some of Microsoft's first-party lineup, as well as polished racers like Project Gotham?  It's certainly not in the same category, at least. Wide Open is pure arcade, from the crazy jumps to the sticky physics. It moves faster and covers more ground than 4x4 EVO 2, and it's a much crazier affair than the enclosed, cerebral racing of Gotham. The title is true to what's in store, namely huge,, wide open racing through what seems like an entire outdoor world of hills, tunnels, and jumps. It's a giant affair, done with the gas pedal pressed to the floor, and the biggest cars ever made in America or the ~Alpier~ parts of Europe.  Gameplay  Anything with Test Drive attached to the title can be assumed to be leaning towards the arcade rather than the simulation, and Wide Open is no exception... in fact, it pushes far into Arcade simplicity with some sticky physics and a straightforward game style.  You've got single races, a career mode, and a new Xbox-only stadium mode to choose from in terms of single player entertainment, and while career mode may get your toes tingling about tweaking your cars to perfection, it's more of the ~win this set of races, and get X amount of money for a new car~ variety. That's fine -- I love being able to get into the game and not worry about whether my shocks are just perfect for racing in Hawaii vs. Moab, Utah. Career mode will choose your area from the three major environments (Yosemite, Moab, and Hawaii), and your mode. Beat the set of races in a season, and you'll get cash to unlock some of the better cars in the game. Single race gives you the freedom to choose your races at your leisure, while Stadium follows the Single race mode, only now you're in stadium tracks that are much, much tighter than racing in nature's backyard.  At first, the Wide Open experience is frustrating because you'll find yourself losing on the initial levels, purely because you can't beat the other cars at their top speeds. But winning races in Wide Open has more to do with picking the appropriate car and finding the right shortcuts than anything else... figure both of those out, and winning a set of races is as easy as driving by braille. For hardcore race fans this will no doubt irk you, especially since technique is certainly in the background, but those of you looking for huge jumps, snake-like tracks and momentum will be pleased.  The physics may not be such a welcome addition, to either camp. It's definitely a world of magnetized roads in the game, which allows the cars to take hills at odd angles, and fly off huge jumps without spills or flips. You may not enjoy the rubber band effect that happens when you hit bumpy sections of a race, and find that your car flops and sticks in an odd fashion that's against what you expect for a racing game, especially one that's supposed to take place on dirt, sand and gravel. The hand brake, in particular, is drastic and proves itself more of a nuisance than anything else, since cars rarely powerslide in the game -- they screech around like you've flicked them in the back tire. The camera doesn't follow you through power slides, either, so trying to oversteer when you're looking at a car from an odd angle makes it tough to really get into taking sharp turns like you're used to.  The competition can get a bit annoying as well, particularly when you're about to clinch first place after fighting to catch up to the main pack, only to get tossed off the track by an AI opponent that locks bumpers with you, and drags you off course. Sometimes the other cars are so bent on smacking you out of their way on the way to first place that the game feels more like you're trying to outrun Christine than some guy just trying to win a few bucks in a race. The magnet trick that keeps your cars stuck on the road seems to be the same one that will get you locked to another car if you smack into them at the wrong angle, basically ruining your chances of winning a race. On the other hand, you'll also catch dragonfly moments of pure beauty when you watch two -- or even three -- cars ~mating~ as they lock together on the track, giving you perfect opportunity to get ahead in the race.  In terms of structure, there's nothing easier. Win races, unlock more cars. Sell your car after a few races, and use the winnings to buy a better one. Levels are massive, so the races will always show off new sections of the environment, which at times seems endless. Play in Free Roam mode and you'll be astounded at just how massive levels are in the game... there's a lot to see as you get deeper into the game. Framerates are solid and fast, which keeps the speed and the pacing of the game at a frenzied pitch. The structure of the game itself is fun, but it may not be the level of depth or the right sort of challenge you look for when you're spending money on a racing title.  Graphics The game certainly seems to sacrifice size for density... but on the Xbox, does it need to? This game illustrates the difference between the PS2 and the Xbox's power more than any other game at the moment. It wasn't the prettiest of PS2 games, but there's a lot of space being shown off at any one moment in the game. After seeing Halo display some massive environments, however, the generally flat, open terrain of Wide Open just doesn't show off the system like most Xbox titles currently at launch. Plus, expect some heavy pop-up for large objects, as well as draw-in for some textures. They promised more objects on screen and new lighting and weather effects for the final version of the game, though I've yet to discover anything that goes beyond what's been shown off in the PS2 version.  The cars are nicely detailed, with specular effects to give them a clean, reflective sheen -- though it looks like they're reflecting a general background, and not the specific environment surrounding them. Make sure to put the time into the game to unlock some of the crazier cars in the game, like the Avalanche... the extra details like hitch rigs and massive extra tires give the cars even more cool charm. As with most games using real vehicles, there's not car damage when you're tumbling down mountainsides and smashing up the competition, either.  Sound The same reason why licensed titles are usually crap is the same reason why the soundtrack on Test Drive is a mixed blessing: money. You pay for big licenses, and you've got less money for the details. Major bands like Metallica give Fuel to Off-Road's fire, but because they've scored some major songs, there's less of them to be had overall. Unfortunately, that means lots of repetition, especially when you consider how many races are in the game to begin with.   Hey, you'll just load up one of your soundtracks instead, right? Wrong. No soundtrack option is provided, which is a shame considering the lack of packed-in music. The lack of interesting in-game audio makes the whole package feel even emptier... engine noises aren't as burly and reactive as they should be, and sound effects from the environments are few and far between.  Multiplayer You can play a nice selection of races with up to three of your friends, as well as take on King of the Hill in three different arenas -- it's pretty simple stuff, but really fun once you get into it. It's not exactly deep, but it's definitely a way to enjoy the game with you and your friends, and without a sacrifice to the framerates.  There's no doubt that this game is fun -- but when isn't flying off of giant cliffs and hurtling over mountains? Unfortunately, the simple arcade feel, matched with some pesky race design issues make this game less interesting than it has any right to be. Arcade racing doesn't have to mean simple, but unfortunately Wide Open is both.You'll have a great time with this game... but it just doesn't provide the technique and depth that you'll want out of your racer, no matter how fast action you like it.", "date": "Nov 8, 2001"}