{"name": "Oddworld: Munch's Oddysee", "name_review": "Oddworld: Munch's Oddysee", "ref": "https://www.ign.com/articles/2001/11/10/oddworld-munchs-oddysee-4", "text": "Getting the second in the Oddworld series right as it was beginning to build up steam on the PS2 was a coup to Sony's marketing might. Abe had become one of the unofficial mascots of the PlayStation (along with Spyro, another PS deserter), and was one of the handful of characters that exemplified PlayStation's adult and mature approach to the platformer. No collecting coins, no dumb ~kooky~ character designs... just a dark, death-filled comic adventure featuring a thing with a stitched up mouth.  Now Abe, and Munch, are under Microsoft's umbrella. The company did the right thing by buying up a few existing franchises to complement its homegrown ones, and while it seems a bit cold, this is a business -- and if you're going to lure kids away from the competition, the scent of Abe, Scrabs and Glukkons doesn't get any sweeter. Another category had been filled, and the Xbox launch now had an official launch platformer, and not just any old character, but one of the best. There was just one little problem... fattening Abe up.  Abe's Oddysee was an old-school tribute to games like Prince of Persia back on the PlayStation, where 3D had taken hold. But for the next-generation, the Oddworld team opted to finally bring the characters into a 3D universe. The initial demos seemed like Abe was going to be the PlayStation 2 equivalent of Zelda, with promises of monster-raising, seasons, tribal warfare and a huge, evolving world to explore. But the question is, did the final result on the Xbox meet any of those promises, or more importantly, expectations? Unfortunately, Abe and Munch's gameplay on the Xbox comes off as clumsy as their character counterparts.  Gameplay In Oddworld, you played as a former slave/worker that, almost despite himself, rose to lead his Mudokon people against the evil corporate scumbags the Glukkons. In Munch you're introduced to a new race, the Gabbits, who have been driven to extinction simply because their lungs happen to match the chain-smoking Glukkon's size and fit for replacement surgery. To make matters worse, Munch has been implanted with a sonic device by the Vykkers in an experiment, and is to be used to capture more creatures. With the help of the Fuzzles, big-toothed fuzzballs used for product testing, Munch escapes, meets up with Abe, and together they set out to stop the Glukkons at their game... not to mention win back the last can of Gabbiar -- Gabbit eggs -- in the world.   If you've played the other Abe games, you'll be familiar with the general controls -- mind control with a trigger, gamespeak with most of the buttons, and a general action button that allows you to jump, throw characters, and trigger levers and buttons. Munch is similar, though his special power is to control mechanical objects through special terminals peppered throughout specific levels. Just as in Oddworld, the game is built more one death puzzles than exploration, and usually you'll be trying to figure out how to get Abe and Munch (and usually some Fuzzles and Mudokons) to a specific point, usually through a set of mines/sligs/scrabs/paramites. The biggest difference is that now, you can command your Mudokons and Fuzzles to attack, using them as your troop of warriors to help you get through specific points in the game.  It's an odd choice, but the designers have actually opted to make the game smaller, rather than larger in the jump to 3D environments. While the original Oddworld had Abe running through massive environments -- albeit on a screen by screen basis -- Munch keeps the 3D environments small and contained, at times so small that you're able to see the exit from where you appear at the entrance of the level. The world of Oddworld is sliced up into tiny bite-sized pieces, and levels are no longer environments, they're sections of the game to beat. You work your way through a level, free Mudokons, find the exit pads, and transport to the next level. Repeat. No longer is the game seamless and driven by the storyline -- it's a bunch of puzzles with slices of cutscene in between for flavor. As you get farther into the game you'll be introduced to new game concepts, like using a crane to launch bombs, or working with both characters to get past obstacles, but the overall structure is more akin to a puzzle game than a platformer or adventure.  This becomes most apparent when you realize that you've got to get a group of characters across a bunch of obstacles -- usually by hand. You'll use Abe to open a door, send Munch through it, walk Abe through, find Mudokons, toss them into transport holes that will send them flying closer to where you want, then free them... then go back and bring Munch all the way to the exit. The fact that every level plays out in the same way, with the details changed, makes this more repetitive than it should be. The obstacles, despite minor changes, still require the same solutions, and the action is always about repeating tasks and running and back and forth through areas rather than exploring environments, or learning new tasks. Most importantly, the puzzles themselves, once you've had a change to learn the obstacles involved, are mainly about actually going through the tasks at a slow pace, killing or disabling all obstacles, rather than enjoying fast action sequences, or figuring out a particularly tough puzzle. You know that you've got to get through sligs to pull a switch to get Munch through, because you've done a similar task 15 times before. Grumble all you want, but yes, most of the time you'll have to take out ever Slig and carry every character to a location if you have to do it with one. This wouldn't be half as bad if games like Ico proved that you could do the same sort of gameplay without the repetition or meticulous mood. That being said, there are some great moments, such as when you've got to ~herd~ huge groups of Scrabs into pens, then lock them inside in order to free a group of Mudokons and get them through a pasture safely. Those types of levels are far and few between, however. The original Oddworld pulled off this sort of repetition because the environments changed regularly, the tasks were kept short and fast, and new challenges were introduced regularly -- not to mention that Abe's journey was enthralling enough to keep you going.  Munch, however, has a definite pacing problem that keeps the game from either pulling you along through the story, or through the gameplay. Individual ideas are fun, like being able to take over a Sleeper or toss a bomb on a sleeping Slig from overhead, but in execution they're lacking the speed, spark, and stress that make games great. Because the levels toss you in and out through teleportation, there's also no connection from level to level, and until the last third of the game, no real sense of where you're going, or why. When you visit the Raisin for the first time to get your quest you'll scratch your head wondering how you got there in the first place. In fact, the cutscenes tend to show you all the aspects of the game that you wish you could have played. If you snuck onto an airship to get into the Vykker floating lab, why not make that a level of a game instead of a cutscene after you finish another unconnected level in a factory? If you take out a factory by sabotaging it, why not make that a part of the game instead of a cutscene after simply reaching the other end of a level? Again, it's the repetition, and lack of variety that makes Munch suffer. You don't just take over one executive and have him give money toward's your ~Gabbiare fundraising~ account, you have to do it with two handfuls of them over a set of levels, and so on.  There are moments when the gameplay works, like one level that has you commanding cranes and a Big Brother Slig, dodging mines and commanding an Executive. Near the end of the game things get denser, and the gameplay becomes more satisfying, given that more and more pieces of the game have been introduced, and the difficulty level is raised higher. The introduction of group commands, and generally using Fuzzles and Mudokons as an army, is also one of the high points of Munch. While you may not enjoy having to hand-transform every one of your Mudokons into tomahawks, or into arrow-firing marksmen, you'll love watching them nail some Sligs on your command. Fuzzles especially, particularly when you get revenge on the Big Brother Sligs that will cause you so many headaches later in the game.  It's a hard pairing -- the love you have for the series and the characters still transfers into the dialogue, character design, and personalities of the Oddworld heroes... but the gameplay just doesn't fit with the fun you enjoyed on the original game.  Control Part of the problem with the repetition of the game also comes in the control scheme, which was obviously meant to be easier, but ends up making the game more frustrating than anything else. Jumping is erratic and so fast that you'll spend extra seconds just trying to do simple tasks, like hop onto a box. Having one action button is great in theory, but trying to pick up Mudokons and carry them when Abe won't stop jumping is more trouble than it should be. While some people have complained about the gamespeak, I didn't have problems with the characters listening to me, though I found that having them attack enemies was a hit and miss affair. Sometimes they'd charge forward on your command, while other times they'd shrug their shoulders and cry ~nothing to do, Abe!~ while their pals were being smacked by Sligs a few feet away.  The introduction of vending machines to give you power ups seems like a great idea, but once again, it also slows down the gameplay -- to beat a set of Big Brother Sligs high up on posts, you'll have to drink health, aqua bounce, and zap, go kill two, swim back and drink all three again, and repeat. Powers are great, but having to repeat them again and again shouldn't be what gameplay is about.   Graphics The subtleties of Munch are impressive -- a level may not look dense, but watch the lighting as it plays over characters and structures. Clouds leave shadows on the ground, the water reflects when under the direct glare of the sun, and tons of characters appear onscreen without a hiccup.   Unfortunately there's little variety to the levels, and you'll find yourself either inside a factory, or outside in the hillsides of Oddworld. That's not to say there aren't some gasp moments, such as the large gear-filled level from the early demos, and a huge reservoir that you have to explore and raise the water level in... but there's just not the variety that was hinted at in the original demos of the game, and there's no exploration of other unique environments like the forest briefly shown off in the early moments of the game.   The camera also stays so far back that it's hard to notice some of the nice details on the characters in the game -- it's meant to keep the camera from getting in the way, but it also makes the game appear less visually impressive than it actually is. Munch has a nice look, and the characters are still filled with that same charm from the other games, but there's a lack of variety here that keeps the game from grabbing your attention after the first five or six levels. As a side note, you'll be disappointed if you're a fan of the series like I am, and expected to see all the initial objects from the first demos in the game itself, like seasons, flying ships, being able to change the environments dynamically by your actions, and so on.   Cutscenes are just as wonderful and funky as all the previous Oddworld efforts, especially the opening movie introducing the plight of the Gabbits, and poor Munch's implant. The Raisin is another highlight, as is the sight of the Lulu the Glukkon decked out in rockstar gear.  Sound The voices are incredible -- did you expect anything less? Lorne Lanning does most of the characters in the game, and they're filled with the same brutal humor and funny quips as the other games. The Vykkers and Fuzzles are funny additions especially the creepy chirping and coos of the little round beasts... right before they chomp into an enemy. Sound effects are mostly from earlier games in the series, but of the same high quality that you've come to expect.   Music-wise, things are kept minimal, with a few repeated tracks for stressful moments... a little too repeated, by the time you're at the end of the game. Dynamic as they are, you'll still find yourself wishing for more than the same couple of loops pumped up when you're trying to get through a group of Sligs, or around a minefield.  What made the first Oddworld so fantastic was the integration of story, action, art design and sour humor that made it one of the most polished packages I've ever seen on a console. You may not have enjoyed the 2D Prince of Persia style gameplay, or maybe you didn't like the creepy character design -- but as a package, it was hard to argue that Oddworld as a whole was the product of a unique company, and a unique mind. Those of us that loved every bit of the original game -- and I'm one of them -- felt like we'd finally found a platform game for grown ups.Munch is also that, but only in spurts and moments. The jump to 3D has been a tough one on the series, and rather than tweak the game design altogether, they opted to mimic the 2D ~learn from death~ style, which plays out as slow, repetitive, and at times tedious in the large and more complex 3D environments. What's worse is that the game and the storyline aren't integrated at all, with cutscenes wedged betweens levels that have no thematic connection.The final product comes off as anything but polished, and suffers from a lack of variety, and an overabundance of repetition that keeps this game from truly shining like I wished it would. As much as I like the characters and the design of the new Munch game, I'm still hoping for the true spiritual sequel to my good old Abe.", "date": "Nov 10, 2001"}