{"name": "NFL Fever 2002", "name_review": "NFL Fever 2002", "ref": "https://www.ign.com/articles/2001/11/13/nfl-fever-2002", "text": "Pro football players will tell you that winning and losing games comes down to who makes the plays and when. It goes for both offense and defense that if you seize the opportunities when they present themselves and limit your opponent's chances, you'll usually come out ahead. These maxims of NFL football hold true when evaluating Microsoft's first console football title, NFL Fever 2002, this year's rookie in the Xbox football competition.   Both Madden and Sega Sports' 2K series are well established and so gamers should have pretty clear expectations of each game. Fever on the other hand is the new kid, designed from the ground up to make the most of the Xbox, so expectations were justifiably high. In the end Fever, plays a decent game of football but seems to get caught up in a bit of an identity crisis that muddies the bright points. Considering that Madden has locked up the football sim market --EA Sports is indirectly responsible for others creating the ~arcade~ football genre-- it's easy to understand why Microsoft would want to go in another direction with Fever, but even an arcade style football game has to abide by certain rules and standards.   Gameplay In Fever 2002, there's a very obvious focus on ~the big play.~ Since the most crucial element of any football videogame --foreign or domestic, arcade or simulation-- is the passing game, there will be a lot of emotion when things either work out or don't work out each time you put the ball in the air. The issue with Fever is that sometimes it can feel like you're not in control the way you should be because the CPU is focused on creating a situation where a big play can occur.   For example if you've got Kurt Warner, Isaac Bruce wide open near the sideline and your eyes and veins are bulging at the chance to stick it to the defense, you're thinking ~let me rifle this ball in there like a Randy Johnson heater.~ So you mash Bruce's button as hard as you can and Warner proceeds to lob a perfect spiral up into the stratosphere. You're thinking ~$%(@$, why the hell did he do that?! It's gonna be picked off now!~ The entire defensive backfield is converging on Bruce's position like honeybees to a Lifesaver as the ball takes what seems like 10 minutes to get there. Yet, even without you taking control of him, Bruce makes the catch with a crowd of defenders around him, and he's dropped to the turf immediately. A 33 yard gain with no yards after catch is good, but not what you had in mind.  This is an example of Fever trying to make something bigger out of what should be an already huge routine catch and run. The big play brand of football is how Fever wants to play ball, which is no problem in and of itself, but tweaking the game's speed, AI and animations to pull it off makes things too inconsistent even for this to be considered an NFL simulation. Fever can be mastered but only by those willing to acknowledge they're not totally in control, like we had to do with Midway's NFL Blitz series.  Fever ends up feeling much looser than you'd expect and really it's a matter of taste as to whether you can hang with this kind of play. As I mentioned earlier, the speed of the individual players, the AI for the players that you're not controlling and the beautiful animations are all excellent individually, but don't always synch up like you'd want them to. Even for an arcade game, you want the animation and speed to be consistent so that you can catch the game's rhythm and learn what it takes to be successful. Inconsistency can mean that a receiver that is open, totally covered or about to be open can literally be any one of those three by the time you get the ball there. And whether you're on offense or defense, you won't really know what you've done right or wrong.    A player like Cleveland's rookie RB James Jackson can sprint literally within inches of a decent safety like Baltimore's Rod Woodson and score a touchdown because Woodson was too slow to get into his tackling animation once he realized he had JJ barreling at him at full speed. In the NFL, this would only happen if Woodson was out of position or being blocked. In Fever, it will be because they literally made Jackson too fast when his turbo boost kicks in and Woodson's AI routine doesn't kick in early enough in the play. Next time you'll just have to call a better defense or take control of Woodson yourself to avoid the rookie running all over your defense.   However, if you can get used to Fever 2002's gameplay, there are plenty of other features to help get you into the game. We've written extensively about the Dynamic Player Performance feature that changes player ratings from game to game in a season or dynasty based on how well he performs. This is a great addition that seems long overdue. In games like Madden, you always had to wait until the end of a season to see how your guys changed and even then it had more to with age than how they performed for you. Every player is evaluated in relation to every other player in the league. Charles Woodson is already one of the best cornerbacks in the NFL, so it will take a lot to boost his ratings because A) he's already extremely good B) he's expected to be play excellent ball week in and week out. For those of us who like to draft and develop rookies in Dynasty modes, the DPP feature is just what we'll need to make heroes out of zeroes.  The Trophy Case is basically what you get on the other end of developing all of those rookies. It's Fever's one stop place to see all of the records you've set and awards you and your teams have won. Likewise, this is where you'll see all of your Hall of Famers and retired jerseys should you be lucky enough to have players that good. It's a nice treat to see Jerry Rice and Cris Carter inducted into the Hall of Fame the year after they retire.  Relocating NFL teams and challenging past Super Bowl champions really round out the longevity of Fever 2002.   Graphics The excellent animation and gorgeous player models is where NFL Fever 2002 scores the big points. The players are very stylized with exaggerated physiques and, in the case of offensive and defensive linemen, exaggerated bellies, but they all look splendid and move very naturally.   And Fever has captured some of the most minute details of NFL football that we can't even see on television just yet. Jerseys move and twist like fabric and even have a glossy sheen to them when they're clean. When they get dirty, they look even better with authentic soil textures. Helmets reflect the surrounding stadium and lights --but not other players-- as effectively as the hood of a brand new car. Stunning. Riddell, Reebok and even Microsoft themselves should be plenty happy with clarity of their logos emblazoned on helmets, jerseys and gloves because there's no mistaking which company made what.   The players do move as accurately as you could want in a football game with some extremely accurate momentum effects. A 300 pounder lumbers forward under his own weight  and you can almost see the strain in his knees and ankles. A 180 pound receiver runs and cuts like smaller man but he's still a smaller man with some weight to him. The quarterbacks cock the their arms before a pass nice and high like they teach you in high school football and they snap their wrists and follow through on their passes with textbook precision. Like I said before, I have no problem with the animations themselves, they're absolutely awesome. I just wish they were integrated into the game a bit more seamlessly. As it stands now, it's hard to appreciate the way Fever moves during the flow of the game because what you see are animations of guys doing something you don't want them to do.  Sound The audio portions of NFL Fever 2002 are another mixed bag of good and bad. The Public Enemy remix intro music and NFL Films themes from ~The Power and The Glory~ CD are all big winners in the music department. They get you through the menu system and into the game with a sense of excitement not nausea.   The player sounds are all adequate with the grunts and growls you'd expect to hear on every play. The crowd cheers and boos nice and loud but I expected some stadium specific chants and calls like ~Duuuuuuuce~ whenever Eagles running back Duce Staley runs the ball.   The commentary from Dick Stockton and Ron Pitts isn't quite there yet. You get the feeling that Pitts is watching the game and Stockton is watching the game, but they're not watching it together. They don't interact with each other's comments at all. Beyond that, Stockton often comes off like one of those animatronic American presidents at Disneyland. He recites his lines but they don't always flow together as seamlessly as a professional broadcaster's are supposed to. ~BROWN... kicks... the ball... and...... JOHNSON... has... the... ball... at... the... twenty...... five...... yard...... line~ is not what commentary should sound like on the Xbox. And Pitts' attempts to add some colorful expressions come off sounding like a bunch of bad jokes at a funeral.  NFL Fever 2002 was one of those games that impressed me immediately with it's outstanding looks and the way it moved. Like a bubbly supermodel however, when I wanted to get to know it better and see what more it had to offer, I was a bit let down. Fever 2002 had no intentions of being a pure football sim even though it had the full-on stat tracking, Dynamic Player Performance and comprehensive trophy case --elements that would excite football sim fanatics. So I adjusted my perspective to evaluate it as an arcadey type of game. In which case it lands somewhere between NFL 2K2 and Blitz in terms of playability and quality. But I could not and still cannot shake the idea that Fever wants to be a sim, but it's AI and overall integration weren't fleshed out enough in time for launch, and so it gets the arcade label to differentiate it from Madden. How else do you explain things like a full fledged NFL Draft and Free Agency system but no realignment or Houston Texans for 2002 in Dynasty Mode?But Fever is fun for a wide open, high scoring game of football against the computer or a friend and that is definitely worth something. Just don't expect to be rewarded for a consistent effective ground game or sound offensive or defensive strategy. With Fever you just fire up your Xbox and let 'er rip.", "date": "Nov 13, 2001"}