{"name": "Final Fantasy VIII", "name_review": "Final Fantasy VIII", "ref": "https://www.ign.com/articles/1999/09/11/final-fantasy-viii-3", "text": "It's fair to say that when it comes to RPGs, there's everyone else, and then there's Square. Nothing has ever approached the Final Fantasy series as the benchmark against which all RPGs are ultimately judged. Final Fantasy VII sold more than a million copies in the US, more than any other RPG ever to hit PlayStation, and deserved every bit of its success, bringing the series into 3D with style and ambition to spare.Final Fantasy VIII pushes that envelope even further, and it would be wrong to say it's not the game that everyone expected. And for a lot of reasons that's a great blessing. It's also starting to become something of a curse, because if FFVIII shows anything, it's that RPGs have a little further to go.GraphicsIt's probably best to start here, because of all FFVIII's good points, the graphics are easily the strongest. The low-polygon characters of FFVII are gone, replaced with sometimes surprisingly realistic high-polygon models that only look better the closer they get. If you're one of those who thought the angled boxes that Cloud used for hands in FFVII -- not to mention the positively lethal spikes that stuck off his head to represent hair -- were a silly distraction, then FFVIII's cast of Squall, Rinoa, Quistis, Zell and the rest will be a sheer delight.This is due in a large part to the character animation, which is beyond great. Whether it's the in-game sequences or the pre-rendered cut scenes, just squint a little and you could almost swear you're watching real, live actors. There are scenes in FFVIII (the witch Edea's parade; a certain scene with Rinoa gasping for breath) that rival anything you've ever seen in a feature film for scope, detail, and emotional impact. You will be amazed.In fact, the overall production design is often jaw dropping. FFVIII follows FFVII in using realtime 3D characters over pre-rendered backgrounds, and every new scene is more impressive than the last. Also like FFVII, FFVIII mixes fantasy elements with a high-tech, sci-fi look, a world at once unique and instantly recognizable, familiar but full of surprises.Simply put, nobody, absolutely nobody does graphics better than Square, and it's never done a better job than FFVIII. Sound Along with the graphics, it's well worth a brief mention that the Final Fantasy series nearly always has been graced by some of the best music found in games, and FFVIII is no exception. Much of the impact of the cut scenes and in-game events is owed to the game's musical score, which is, in a word, terrific, with nary an out-of-place note (although it could have done without yet another variation on the FF battle theme -- tradition is one thing, but enough is enough).Gameplay Here, unfortunately, is where things start to slip. In many ways, FFVIII makes a break with Final Fantasy games of the past -- the trouble is, it doesn't do it quite enough.First off, the entire magic system is completely different from what you're used to, and mostly this is to the good. Instead of characters gaining spells as they increase in experience, they can simply ~draw~ spells from enemies, so any character can cast just about any spell. In fact, spells can be collected and shared among characters, and there's no such thing as magic points -- you just run out of a given spell and have to find the right creature to draw more from.Also, each character can be ~joined~ to a category, known as the Guardian Forces, elemental creatures of great power who confer all kinds of abilities on the character they're joined to, from esoteric things like preventing random encounters to more fundamental abilities, like being able to use items or even attack in combat. Each Guardian has his or her own set of abilities to give, which are earned as the Guardian gains experience. However, each character can use only a limited number of abilities, so carefully doling them out to each party member becomes a serious strategic puzzle.If this sounds intensely complicated, it is, but the system also works very well, enabling you to customize your combat strategy in any number of different ways. It's exactly the kind of stat keeping that RPG fanatics love to obsess over. If there's a flaw in the system itself, it's that most of the Guardian Forces aren't simply given, they have to be found. Although the locations of many are obvious, it's easy to miss a couple of important ones. However, that's a relatively minor complaint.But it does lead to the major complaint. The most powerful spells in the game are cast by summoning the Guardian Forces directly -- calling down these powerful beings to attack your enemies with devastating elemental spells. Which is all well and good. In fact, by now it's pretty standard RPG fare. The problem is that the artists and designers at Square seem to have fallen overly in love with their work. The Guardian Force attacks are incredibly cinematic sequences that can go on for nearly a minute, which is amazing the first, oh, 10 or 12 times. But by the hundredth time you've had to sit through Ifrit slamming his big lava bomb into the ground, or Shiva throwing out that wave of ice, you really, REALLY begin to wish you could skip the whole process and just get to the part where you find out how much damage it did. Even small battles against common creatures can drag on for minutes, and when you add in that you're usually getting attacked at random, sometimes after moving only a step or two, it becomes a real exercise in tedium. Granted, this is the same as it ever was for RPGs since the first Dragon Quest, but never before have spell sequences been so complex, involved, and, well, just plain LONG. It's really become time to either change the way we play RPGs, or simply stick to simpler battle animations -- at the very least, make shorter sequences an option, y'know?StoryIn many ways, the story has always been the core of the series' appeal, with sprawling, melodramatic plotlines, but once again, FFVIII departs from the norm. True, the current storyline has its apocalyptic side, but this time it's pretty firmly grounded in a much more intimate, character driven work. Frankly this is a welcome change -- the world-shattering events of previous games occasionally overshadowed the more human side of things.And FFVIII comes really, really close to pulling it off too. It follows a group of young cadets, recently graduated members of SeeD, an elite, freelance mercenary force. Three of them -- ex-instructor Quistis, hot-headed Zell, and their moody leader, the game's main character, Squall -- are assigned to help a rebel faction in a nearby kingdom, headed by a young princess, Rinoa.From there it naturally gets complicated, but there's no reason to go into it here and spoil things. Suffice to say there's a lot to like about the story, and a number of surprises to keep you guessing. The problem is that the character at the heart of everything, Squall, is basically a pouty jerk. He's grumpy, abrasive, and doesn't really seem to give much of a damn about anyone but himself for a pretty significant portion of the game. Roughly halfway through you find out why (without going into detail, he had a tough childhood and doesn't want to risk being close to anyone), but almost every other character had nearly identical experiences as kids, and none of them grew up to be cold fish.Further, the blossoming love between Squall and Rinoa -- which, theoretically, thaws him and eventually redeems him -- seems entirely one-sided, and you have to wonder what she sees in him. Though Squall performs some heroic feats to save or protect her, he otherwise seems only marginally more responsive to Rinoa than he was to Quistis, who's attraction to him. Squall just blows her off without a thought before you're even through the first disc. In fact, there's never really a moment you can point to and think, ~Ah, he's changed.~ And, considering that the love story is so integral to everything that happens -- not to mention forming the central image of the box art -- it's incomprehensible why no one says ~I love you~ to anyone, ever.Fortunately, there's plenty of drama to go around, and enough other, more likable (or at least understandable) characters to root for that things keep moving and you're pretty unlikely to get bored. However, it's tough to overlook the fact that FFVIII does break one cardinal rule: when your story is character centered, you'd better center it on a character the audience can care about. Squall, unfortunately, just doesn't fit the bill.At the end of the day, given that so much of the game is so outstanding, it just makes the game's faults stand out in sharp relief. For every moment of breathtaking delight, there are a dozen predictable, endless battle sequences. For every scene that genuinely moves you to laughter or tears, there's at least one where you want to grab Squall by the short hairs and slap some sense into him. On the other hand, there's no denying that in many ways Final Fantasy VIII is another high water mark for console RPGs. Certainly, no other game (on PlayStation at least) has ever looked this beautiful, or contained such a sheer volume of places to explore and secrets to ferret out. It also boasts about the trippiest ending sequence ever in the history of videogames, and that alone pretty much makes it worthwhile. It may not exactly convert anyone who's never played an RPG before, but there's enough magic here to make any true believer's toes tingle.", "date": "Sep 11, 1999"}