{"name": "Shaun Palmer's Pro Snowboarder", "name_review": "Shaun Palmer's Pro Snowboarder", "ref": "https://www.ign.com/articles/2001/11/13/shaun-palmers-pro-snowboarder-2", "text": "Shaun Palmer's Pro Snowboarder is an interesting case.  You see, normally, developers get better the more they work in a particular genre.  They learn from experience and user feedback, gradually picking up a better handle on what makes a certain sort of game fun, and as a result their efforts gradually improve.  Polyphony Digital makes racing games, for example.  First, it made Motor Toon GP, which was good.  Then it made Gran Turismo, which was very good.  Just recently, it made Gran Turismo 3 A-spec, which was exceedingly good.  And so on.  Uep Systems, or whatever alias it has currently taken on as a part of its efforts to work the Japanese bankruptcy laws, appears to buck this trend.  First, it made Cool Boarders, which was pretty iffy.  Then came Cool Boarders 2, which had some improvements.  Following that, you get Cool Boarders Burrrrrn and Cool Boarders Code Alien, which were okay and reportedly quite good, respectively.  And now, you have Shaun Palmer's Pro Snowboarder, which is one of the dullest entries in the genre I can recall.  Strange indeed.  This may have something to do with the philosophy behind the Activision O2 line, which apparently is to recreate the success of Tony Hawk's Pro Skater across the entire spectrum of extreme sports, regardless of the possibility that what makes a skateboarding game good might not have anything to do with what makes a fun snowboarding or BMX game.  That philosophy worked well enough with Mat Hoffman's Pro BMX to create a decent game, but it falls flat on its face with Shaun Palmer.  The result is a slow, clumsy, repetitive game, a decent graphics engine sucked dry of life by useless gameplay.  Given the presence of SSX Tricky on the racks right next to it, Shaun Palmer doesn't deserve a second look, or even a first.  Gameplay  As Mat Hoffman was Tony Hawk on a bike, this is Tony Hawk on a snowboard.  It doesn't have a graphical engine in common (presumably being powered by some of the same technology as Code Alien), but great wodges of its game design came straight from Neversoft's classic.  There is no racing in Shaun Palmer, or at any rate that aspect of the game is greatly de-emphasized.  Instead, the goals are as in Tony Hawk: perform tasks and tricks (all of a very familiar sort) through each level to progress to the next one, gradually encountering new challenges and building up your rider's abilities in tandem.  A good idea?  It might have been at some point.  However, several complications introduce themselves early on.  Chief among them is that Shaun Palmer is slow.  Very slow.  Press forward, hold down the X button, kick the controller repeatedly, sacrifice virgin bullocks on the altar of Baal, none of these possible solutions do any good.  Your rider progresses forward at the same soporific pace, occasionally picking up a touch of velocity thanks to a jib or moderate slope.  That extra speed bleeds off soon enough, though, and it's back to trudging along down the hill.  Another problem has to do with the fundamental nature of snowboarding.  Snowboarding progresses in one direction.  You can turn your board around, but that just means you go the same direction backwards.  It's possible to turn around on a skateboard, which is why accomplishing goals in a single level of Tony Hawk doesn't become an unpleasant or tedious task.  Miss it once and you can always turn around and go back in a couple of seconds.  In Shaun Palmer, gravity intrudes here -- miss it once and you have to restart the level.  Not so much fun when you missed a goal that's three-quarters of the way down the mountain.  Performing tricks is a more satisfying experience, but the trouble is, you can't shake that haunting reminder of Tony Hawk.  Shaun Palmer's trick system is almost exactly like Tony Hawk, except the special moves are Street Fighter revivals (half-circles and such) instead of simpler double-taps.  There are even manuals and such in this game, which I find a little confusing.  I don't snowboard, but I can't envision the possibility of doing a nose manual.  You'd dig into the snow and pitch over flat on your face.  Questions of realism aside, if this is so much like Tony Hawk, why play it?  It's just very slow Tony Hawk, with very poor level design in comparison.  Tony Hawk levels are smoothly interconnected masses of lines working in concert.  Shaun Palmer levels are long, straightforward collections of very obvious individual lines -- yes, you're obviously supposed to ride that branch to that railing to that lip, and so on.  There's nothing of the freedom to create new and more challenging combos that you find in Tony Hawk.  It's all just laid very simply in front of you, and it isn't very much fun at all.  The multiplayer mode is a minor exception to this rule, since it removes the brutal obstacle of the level goals and adds some simple competitive elements to make things more interesting.  It isn't so hard to make this aspect of the game fun, simply because of the fundamentally cool nature of being able to carve around and beat your friends up (the ~Push~ game, where you fight over a share of the split screen, is particularly entertaining).  This isn't enough to carry the game by a long shot, though -- there should be some reason to play the single-player game, and I can't find one.  Graphics  Shaun Palmer's Pro Snowboarder looks just fine.  That I will happily give it.  The graphics engine is solid with no framerate problems, the backgrounds are suitably colorful, the textures are sharp, and the animation is smooth, especially for the special tricks.  There's none of Dark Summit's weird float or jarring snap to the movements -- everything flows neatly according to the controls you input.  Perhaps the only complaint regarding that animation, and it's a minor one, is the way the lip tricks (inverts and the like) relate to the environment.  Perhaps it's a question of the riders' scale versus that of the backgrounds, but you don't seem to quite be in contact with the surface you're supposed to be tricking off.  That feeling passes soon enough, though.  The models themselves, regardless of those questions of scale, look about as interesting as licensed snowboarders can, which is unfortunately not all that much.  The differentiation in size and appearance is good, though, from tall, skinny riders through short and weedy ones.  There's good clothing animation for all that baggy cold-weather gear, too, although not quite as nice as what we've seen in Konami's ESPN sim snowboarders.  Sound  Usually I can count on Activision to feed me a good soundtrack regardless of gameplay issues, but Shaun Palmer breaks the streak set by Tony Hawk and Mat Hoffman.  We have a whole lot of generic modern heavy metal here, resulting in a sound that will appeal only to fans of, well, generic modern heavy metal.  A group to which I do not belong.  The slow, repetitive, guitar-driven drone and distorted whining vocals do rather suit the pace and style of gameplay, but in this case that just compounds the pain.  There's nothing in the effects suite to brighten things, either, save for ordinary thumping noises and the occasional dull quip from a rider.Shaun Palmer has a strong graphics engine and solid control, but if IGN gave out a ~Fun Factor~ score, this sucker would get a big, fat goose egg.  Zero.  I challenge anyone to have a good time with this game, especially considering how much fun you could be having with its competition in the snowboarding market.  You could argue that this is aimed at a market interested in a realistic snowboarding game, but where's the realism?  Do you grind that many lift lines in reality? In short, I don't recommend this game in the least.", "date": "Nov 13, 2001"}