{"name": "Vampire Night", "name_review": "Vampire Night", "ref": "https://www.ign.com/articles/2001/11/14/vampire-night", "text": "The game's credits list Vampire Night as published by Namco Hometek and developed by Namco, Sega, and WOW Entertainment. One would think that something produced by the great minds of these fine companies would be nothing less than perfection, but that's sadly far from the truth. The game's development was handled almost completely by WOW Entertainment, the group that's responsible for the House of the Dead series, and despite the collaborative efforts from two arcade powerhouses, the end result is a product that's less than either Sega or Namco's best.  Gameplay Vampire Night is still a good game, though. It's just not a spectacular one. If you've played any of Sega or Namco's arcade light gun games you pretty much know what to expect here. This is a very generic, straightforward, light gun shooter that can be played with either the GunCon, GunCon 2or Dual Shock controller (we don't suggest playing it this way).   The gameplay is exactly what you'd expect in a game of this type, you point the gun at the screen and shoot the bad guys, who in this case are vampires, werewolves, or other mutated beast. You re-load you gun by either pointing away from the TV screen and pulling the trigger or by putting a controller on the floor and using one of your toes to press any of the buttons on the controller to re-load (very effective, but makes the game hella easy).   There's not really a lot of depth to it, and that's where the game suffers a little. Enemies and bosses do have weak spots that you can hit to kill them faster and you do have the added challenge of saving humans by shooting off the Sarcomas (an organism stuck on them that will transform them into beasts if you hit the village instead of it), but that's really it. There's nothing really in the way of branching paths and hitting the weak spots isn't that much of a challenge.   Like most light gun games, Vampire Night can be beaten in less than an hour, but unlike some of the better ones, you won't likely have the urge to play this one over and over again. The game is also fairly easy and while the bosses are nicely designed and immensely cool, their patterns are pretty basic and not too hard to figure out.   There is a Special mode that adds some RPG-ish elements to the game, giving you missions to complete and weapons and items that you can buy after collecting silver for completing missions or shooting certain breakable objects in the game, but it's poorly put together, making it a chore to play.   Since you can only check on the missions and buy the new weapons and items before and after games, and not in between levels, it doesn't really change how you play through the game that much. It's obviously better than nothing, but don't expect something that'll increase the game's replay value exponentially.   There is a training mode that gives you a bunch of mini-games that you can complete, which adds some additional replay value since you can have some fun just trying to beat your best times. But, the training mini-games aren't quite as entertaining as what you'll find in Time Crisis II and don't really add all that much to the game.   All said, Vampire Night is still a fun game to play. It's not quite as deep or as good as House of the Dead 2 or Time Crisis II, but there's still a lot of fun to be had with shooting things. Well, shooting virtual things, that is.   Graphics The visuals in the game offer an odd mixture of good and bad. On the good side, the art is really good. The standard enemies are designed well and the boss characters that you'll encounter are some of the coolest looking baddies that you'll likely see in a game of this kind. Some of the backgrounds and special effects you'll see are also very commendable and some of the environments are downright gorgeous. And you get all of this with a fairly constant framerate with little to no slowdown to be seen.  On the bad side, the game suffers from a lot of background flickering during certain stages and while the character design is great, the models themselves are a bit overly blocky and are poorly animated. It's not a huge problem, though, but it's enough to keep this from being a good show of the system's visual prowess.  Sound There's actually quite a lot of excellent orchestral music that's played during cut scenes and during the menus, but if there is anything played during the game you aren't likely going to hear it. During gameplay you can expect to hear nothing but the ~bangs~ of shots being fired, the sound of your gun re-loading, and the voices of the characters and enemies you encounter.  The voice acting is pretty horrid, but it's the type of B-movie horror voices that you've come to expect from arcade light gun games, so it's nothing to complain about. The dialog is equally as cheesy and the infamous ~Don't come! Don't come!~ line screamed by a squeaky, high-pitched, voice of a young girl is here to give you a chuckle every time you get to hear it.  When Sega and Namco first announced that they were collaborating on an arcade light gun game, fans of both companies couldn't help but be excited. Two of the greatest developers of arcade games in the world working together on a game seemed like a sure-fire recipe for success. Sadly, Vampire Night isn't quite the masterpiece that one would think would come out of such a fine partnership.It is by no means a bad game and is actually a top-notch light gun game for the most part. But while you do see strong influences from each company involved in this title, you can't help but feel that Vampire Night is more of a step back in the genre as far as gameplay is concerned. What you have here is a very basic light gun shooter that doesn't do anything that expands upon what we've seen in previous games by both Namco or Sega, including Time Crisis II, House of the Dead or even Virtua Cop. In fact, the game even lacks a lot of the depth that you'll find in those aforementioned titles. Even still, it's a fun and enjoyable light gun game. As is the case with most games in the genre it's fairly short, but makes up for it with the fact that it easy to pick up and play again at any time since you never really have to devote too much time into it to get a reward of some kind. If you already have Time Crisis II and are looking for another light gun game to play on your PlayStation 2, you might want to give this a look. Otherwise, it's more of a weekend rental.", "date": "Nov 14, 2001"}