{"name": "Batman Vengeance [GBA]", "name_review": "Batman Vengeance", "ref": "https://www.ign.com/articles/2001/11/17/batman-vengeance-4", "text": "What's this? The Caped Crusader fighting the forces of evil on the Game Boy Advance? Hey, the guy's running around in tights on the GameCube, PS2, and XBox this holiday season, so why not on the Nintendo portable, right? As diverse as the gameplay is in the handheld rendition of Batman Vengeance, none of the four different play modes in this game really excels in design or style. Overall, the GBA edition is a better than average adventure on the system, but there's no excuse for the clumsy animation and collision detection, as well as the stupid driving portions in the game. Features Four gameplay modes Password save Only for Game Boy Advance Batman Vengeance for the Game Boy Advance follows the same original storyline of the console versions, but in terms of gameplay, it's its own design. The game follows Batman as he rids the streets of the familiar Gotham evildoers -- throughout the 20 levels you'll meet up with the Joker, Mr. Freeze, and Poison Ivy, as well as the random assortment of cronies that hang around with these evil characters. The main levels are of the usual platform layout...you know the drill: run from right to left, beat up bad guy, avoid his missile, reach up and grab the ledge, pull yourself up and continue on until the end of the road. The designers do throw a bit of Bat-isms into the mix, such as using the grappling hook in certain instances, as well as tossing a few Batarangs to hit the baddies from a distance. But the game doesn't strictly stick to the side-scrolling, as levels jump back and forth into an old-school  side-scrolling shooter via the Batwing, or an overhead, Metal Gear-style action sequence with Robin.  Unfortunately, sandwiched between most of the levels is this downright awful driving level that's best described as  Spy Hunter-meets-Bump 'n Jump, but not nearly as fun as these two games. The challenge is to beat the clock, reaching the end of the road before time runs out by avoiding all the traffic, potholes and random crates on the street. But man, if I could have skipped these levels altogether, I would be a happier man. They're not so fun, and the artwork is just downright lame...the potholes that are tossed around the pavement literally look like massive piles of poo.  The entire game is a challenge from start to finish, but sometimes the challenge of Batman Vengeance is learning the little collision detection glitches in the side-scrolling levels. Batman can hold onto most ledges, but sometimes, for no reason other than to make an area more difficult, the same platform graphics in the later levels can't be grabbed.   The biggest letdown in Batman Vengeance is its clumsy animation -- this game is based upon the animated series, yet our tiny on-screen persona moves very stiffly...which is unbecoming of our cartoon vigilante. Oh, the game looks like a Batman game, with the red sky painted over the skyline background, but for the first Dark Knight adventure for the 2D powerful GBA, a bit more attention to detail is expected. The music is also a serious letdown, as the developers use that terrible Game Boy Color soundchip for the background tunes. At least the introduction and cutscenes are well-done -- Ubi Soft recycled the rendered sequences from the console versions and created still screens to push the story along. And while Ubi Soft tried to make saving a game an easy task of remembering a simple password after each level, it's a snap to guess since they're all words from the Batman universe (Surprise-surprise, the level 2 password is BATMAN.) In three guesses I pulled up the final battle in the game...that doesn't do much for the lasting ability of Batman Vengeance. With all the different styles of gameplay, there's a lot to do in Batman Vengeance, sure...but most of the designs are extremely uninspired, and the animation comes off stiff and wiry. It just feels like the game was made by a team unfamiliar with the GBA hardware, and didn't have enough time to get up to speed with what it can do. ~Better than average~ is the best way to describe Ubi Soft's first Batman adventure for the Game Boy Advance.", "date": "Nov 17, 2001"}