{"name": "Batman Vengeance", "name_review": "Batman Vengeance", "ref": "https://www.ign.com/articles/2001/11/19/batman-vengeance-3", "text": "How many Batman games have hit the market during the course of the franchise? Five? 10? 40? We don't know for sure, but given that the quality of each respective release has almost always been excessively poor, the number is probably too high -- whatever it is. The truth is that over the years the Dark Knight and bad, bad videogames have gone hand in hand. But with the release of Batman Vengeance for GameCube, developer Ubi Soft has proven that it doesn't need to be that way -- that, in fact, the Caped Crusader can star in a piece of software worthy of playing.  Vengeance is the result of Ubi Soft's attention to detail -- both technically and in presentation. It is not a game without faults, but its solid, if formulaic gameplay mechanics and beautiful cartoon style combine for an experience that is definitely recommended.  Features  Play as the Dark Knight in an all-new 3D adventure Uses an impressive 3D engine developed by the Rayman team Uncover a mysterious evil plot involving the Joker and other classic enemies Travel through 19 open environments through Gotham City Explore, fight, sneak, decipher, drive, pilot and engage in mid-air free-fall battle Wield batarangs, batgrapples, flash bombs, remote charges, batcuggs, nets, the batlauncher, batscope and more Features more than 40 minutes of rendered cinematics GameCube version features sharper graphics and runs at 60 frames per second   Gameplay Batman Vengeance is based on the Warner Bros. Batman: The Animated Series which first aired on television nearly a decade ago. The style of the cartoon, dubbed ~Art Deco,~ blended blocky, fluidly animated characters with dimly lit ambient environments. Strong writing, top voice talent and an overall excellent style attracted a large audience of hooked followers and soon feature films followed. Ubi Soft's GameCube action-adventure copies the look and feel of its predecessors admirably.  It's a black, mysterious night in Gotham City when Batman receives an anonymous call explaining that a fire has erupted somewhere close by. Naturally the Dark Knight investigates the situation, where he finds a stranded, helpless civilian girl named Mary. He rescues her from a bomb and she explains that the Joker has kidnapped her son and that he's demanding a ransom for the boy's safe return. And so begins the well-devised plot of the game, which takes players on a fun romp through atmospheric environments in Gotham, in battles with enemies the Joker, Poison Ivy, Mr. Freeze and more, and through a selection of different play modes to boot.  Vengeance is a 3D action-adventure with enough twists, turns and all-around variety to keep the play fresh and gamers guessing. The standard mode of play sees the Dark Knight through 19 environments based in or around Gotham City. Here Batman must simply make it from point A to point B and do battle with a number of different enemies along the way. It's a somewhat formulaic setup, but it's executed quite nicely. Usually levels are designed to be wide-open so that in addition to exploring the ground floor, the Caped Crusader can also use his batgrapple to swing up to second- and third-story buildings and continue onward. Though levels may fool gamers into believing otherwise, Batman has very linear goals. For example, in Gotham City, it's possible for Batman to explore the rooftops of the beginning low-rise areas, but until players discover that they need to use his batgrapple and pull themselves up a few stories they will have made no real progress. Other areas call for the Dark Knight to activate a switch or jump across a platform before the next sequence of events can take place.  Most of the game follows this outline. Explore, find enemy, fight enemy, handcuff enemy and move on. Explore, fight enemy, handcuff enemy, find key, unlock door nearby and move on. It's all separated with the use of gadgets -- swing up to a ledge here, stun someone there. There is the occasional puzzle, and one in particular that we quite like in which Batman must connect a stream of wires to disable a security system before time runs out. But for the most part the adventure adheres to these rules. This is not a bad thing either. It's just not terribly different.  The analog stick manipulates the superhero, while A serves primarily as the action button: jump and glide, as well as kick in combat situations and shoot projectiles in gadget mode. The B button, meanwhile, functions as the punch key. X shields Batman from enemy attacks. Y makes Batman sneak around walls. L acts as a communicator in standard play and is also used to execute special moves in combat mode. Finally R goes into first-person mode and, in conjunction with the analog stick, works to select Batman's various special gadgets, which play an integral role in the game. The setup isn't immediately intuitive, but once players familiarize themselves with the controls they will have no problem cycling through gadgets on instinct alone and performing various jumps, glides and sneaks without a hitch. Also, Batman's control is tight and responsive, which is a must for games of this type.  There is a combat mode in the game that, while basic, adds an extra level of depth to the experience. As Batman encounters various low-level goons, the camera zooms slightly closer around the action and the enemy becomes locked in a z-target-like fashion. This allows players to strafe around foes without breaking from a fight and it works very well. Here Batman can kick, punch and perform combinations, and he can also execute several special moves that inflict more damage. The system is welcomed, except for the occasional area in the game where Batman approaches an enemy that cannot be hurt in combat mode and still it automatically goes into it. Once this happens, players must attempt to break the Z-target, quickly activate first-person mode and find the right gadget for the job. And more often than not, a foe will attack while this is done making the procedure incredibly difficult.  There are other modes of play in addition to the mix of action-exploration levels too. Some levels require that Batman fly his ship over Gotham City and others see the Dark Knight racing the batmobile through the crowded streets below. These offerings add variety to the adventure, but neither is as cleverly designed or well executed as the standard missions.  Levels are varied and very well paced. The Dark Knight must make his way through Gotham City at night complete with red skies and flashing lightning. He must progress through moving trains -- both atop the speeding railway and inside of it. He travels to the icy insides of a building invaded by Mr. Freeze. Does battle with Poison Ivy, but not before travelling through an evil plant infested underground. There are high-rise fights, brawls with the Joker, and much, much more. Without doubt, the variety in the selection of stages is one of Vengeance's greatest strengths.  Graphics What Batman Vengeance does quite brilliantly is totally recreate the look and presentation of the cartoon series it's based on. Ubi Soft has done a wonderful job making the Dark Knight look and animate just as he does in the television series and movies. Batman moves with a perfect fluidity. When he runs, his cape swings realistically, and when he glides his cape becomes outstretched to support his weight. He bursts through doors, hauls himself up ladders and even slides down them. It looks splendid. But on top of that, environments, often large and sprawling, are beautifully lit and overflowing with dark, cartoony ambience. Lightning flashes in the distance, rain drops down, and everything is almost too black to make out. For once, it really looks as though players are inside the cartoon and that's quite an achievement.    An in-game screenshot of Batman Vengeance for GameCube   However, Vengeance does suffer from the same problem that hinders so many 3D adventures: a less than perfect camera system. For the most part, the camera works great. It is placed where it needs to be and switching between third- and first-person modes goes off without any glitches. But occasionally a corner will disrupt the action and it becomes difficult to orient the hero's position. It's never so bothersome as to become annoying, but it's a noticeable chink in the game's armor all the same.  The GameCube version of Vengeance warrants purchase over the PS2 original because it has seen significant improvements in fluidity. The GCN port runs at 60 frames per second with rare drops to 30 in a few scarce levels, where the PS2 one runs at 30 and sometimes below. Further, the GameCube title features a few additional animations that weren't in the previous version. So, for example, when Batman releases a charge onto an object, gamers will see a new hand animation that actually shows him pressing the explode button. Unfortunately, Vengeance does not run in progressive-scan mode for those with HDTVs.  Sound The audio portion of Batman Vengeance is exceptional. Often a game of this type suffers from painfully poor voice acting, but happily this is not the case for Ubi Soft's adventure. Quite to the contrary, the development studio has used voice talent from the cartoon series -- Mark Hamill, anyone? -- and as such all of the characters deliver their lines believably and with a certain mood that should be familiar to those who have lovingly watched the television series or movies. Batman speaks with a dark and cool voice while the Joker's is high and shrilly and both very fitting for the occasion. Meanwhile, sound effects are on par with the rest of the goods and musical scores are in equal good form. Very well done.As an old-school gamer, I've learned to hate Batman-branded videogames over the years as not-a-one of them has been worth investigating. But Batman Vengeance surprised me -- it's a quality 3D action-adventure complete with a fun story. It's got great, ambient graphics and atmospheric audio too. And while it might be a little formulaic, the game delivers a polished play experience complemented by solid, tight controls and a host of gadgetry unique to the franchise. I've had fun with it.The game does have a few drawbacks though. First, it's fairly linear, which means it's also somewhat easy. Also, while the combat system makes for a nice addition most of the time, I've had several bouts with the setup itself as I've tried to break from it to enter first-person mode and shoot an enemy. And topping everything off, the camera system -- like in so many 3D action games -- is sometimes a little disorienting.But even with a few shortcomings, Batman Vengeance for GameCube is still a satisfying experience. I can easily recommend it as a buy to everybody who enjoyed the cartoon series or for those who are just looking for a straight forward action-adventure with some pretty visuals. At the very least, give it a rental and see if it's right for you.", "date": "Nov 19, 2001"}