{"name": "Missile Command", "name_review": "Missile Command", "ref": "https://www.ign.com/articles/1999/09/16/missile-command-4", "text": "Dipping deep into the fast pit of Atari arcade and console classics, Majesco pulls up another game that deserves to live on in the current gaming market. Missile Command is another original production from the company (not a colorized version of an existing Game Boy product, like the company's Game Boy Color renditions of Centipede and Super Breakout), and while it's not terrible, the game could have been a lot better. Features  Modernized rendition of the classic arcade game One or two players alternating Multiple city backgrounds Rumble cartridge Only for Game Boy Color  Just a brief classic gaming lesson  Missile Command originally came out in the arcade in 1980. The idea was simple  protect your six cities from an onslaught of descending missiles by maneuvering a cursor and firing your own defensive weaponry. If your cloud engulfs a missile, it's destroyed. The game ends when your six cities are taken out by the enemy missiles. The game has been ported to many systems, including the Atari 2600, 5200, Jaguar and Atari Lynx.  If you've familiarized yourself with the original Missile Command games in the Arcade or on the Atari systems, you may want to throw the strategies you've learned out the window. Because of the two button configuration on the Game Boy Color system, the designer(s) didn't create three missile bases to fire from. So instead of the familiar three cities, missile base, three cities configuration, it's been changed. Now, it's one city, missile base, four cities, missile base, one city. Honestly, this configuration is enough to throw even the most seasoned Missile Command players for a loop.   Another change: the cities you're protecting are now part of tangible, real locations, such as New York, Paris, Cairo, and Sydney. You change locations after protecting each one for two rounds. After that, you're treated to a stupid little animation specific to the location (like a waving kangaroo for Australia, for example).  Even though the game is written specifically for the Game Boy Color (it won't work on black & white systems), it doesn't look like it really takes advantage of the system's abilities  colors seem very washed out, and explosions are extremely difficult to see against the blue skies of certain cities.  In terms of gameplay, other than the differing city configuration, the Game Boy Color rendition plays similar enough to the original to make retrogaming folks happy. The cursor moves slightly choppy and slow, and the pace of the game is interrupted by disturbing pauses between levels. If you've been reading this site for the past few months, you'll realize what a huge fan I am of the classic games, and how much I love seeing these titles come out for the handheld systems. I've always liked Missile Command  it's not my all-time favorite game, but I've spent a few hundred quality hours on the arcade and Atari 2600 version. I even liked what Atari did on the Lynx version of the game. Majesco's game is better than average, but it needed a little more time in development. It's just a bit too sloppy...they could have done a conversion of the arcade's three missile base configuration (A button, fire from the right base;  B button, fire from the left base; both A and B buttons to fire from a middle base). But they didn't. It's still a decent game, but don't expect a fantastic conversion of the classic.", "date": "Sep 16, 1999"}