{"name": "NBA Live '02", "name_review": "NBA Live 2002", "ref": "https://www.ign.com/articles/2001/11/21/nba-live-2002", "text": "We continue our tour of EA Sports' Xbox lineup with our professional evaluation of NBA Live 2002. If Madden is EA's number one sports franchise, then Live could very well be second-in-command with the amount of research and resources dedicated to the series. Traditionally, the Live franchise has captured all of the intricacies and details that make NBA basketball so exciting, going beyond just the X's and O's of the sport. For the 2002 edition on Xbox, that trend has continued with heaping mounds of NBA flavor. But once you get into the nuts and bolts of this videogame and take a look at the basketball Live plays, it's more YMCA than NBA.   Features   Over 50 new dunk animations complete with celebrations. All new Jam Cam and Swat Cam bring explosive plays to life with special cinematic effects. Refined facial animations New Franchise Mode allows you to play GM for up to 10 years. More player detail including accurate hair styles, accessories and tattoos. Enhanced low post play with more control over shot selection, rebounding and defense. New Pre-game cinematics build the hype for each upcoming game. Endorsed by playground and Houston Rockets superstar Steve Francis.   Gameplay You can have all of the player endorsements, TV campaigns and billboards you want, but eventually Xbox owners are going to want to get some realistic NBA ballin' from Live 2002. I found that Live actually offers a better sense of NBA athleticism than any hoops game to date but that the offensive and defensive strategies --as controlled by the AI-- are pretty weak even at the highest difficulty settings. The NBA is the highest level of the game, so Live shouldn't play like EA's blockbuster hoops title NBA Street, with all of it's gravity defying moves and impossible plays. The problem isn't with the playbooks, but the execution of those plays and how the defense responds --either in the single player game or head to head with a buddy.  In Live 2002, pretty much any NBA superstar can take any other NBA player off of the dribble at any time, thus opening up all kinds of options on offense for you. Usually you'll just take it to the hole and score the easy dunk or layup, because that's what the basketball gods say you're supposed to do when you have the lane.  Stephon Marbury, Gary Payton, Ray Allen, Tracy McGrady, Lamar Odom etc. are all great players and highly rated in Live 2002, but none of them is unstoppable especially when they're going against each other. A good player, like Michael Dickerson, on a crappy team, like Memphis, should not be able to take a good defensive squad, like Miami, to the hole, at will, over the course of an entire game. Even in the well done Franchise Mode, on the toughest difficulty setting, with fatigue on and everything, you just have to keep getting the ball to your go-to-guy to pick up the victory.   There's nothing wrong with a team's best player being head-and-shoulders above his teammates, but I at least want to earn my points. I don't want to be able to just hit turbo and speed by a good defender like Scottie Pippen with a good all around player like Antawn Jamison every time down the court. It's better to force gamers to earn a layup or dunk by working the ball around, throwing a fake or some other one-on-one move to get free. This is what makes Sega Sports' NBA 2K series so engaging for serious hoop fans. Because just like in real life, you can have a lane to the basket all you want in that videogame, but you are damn sure going to earn it each and every time. In real life, James Worthy had one of the quickest first-steps in the history of the game and he could literally go to the basket whenever he wanted. But opposing defenses would work together and rotate to prevent him one way or another from scoring every time down the court. A sim game like Live has to have some mechanism, whether it's the defensive AI or overall speed of the game, that prevents gamers from scoring whenever they want. It's just that simple.  Beyond this though, no other game captures the fluidity and athletic ability of the NBA and its players than Live. This is an area better discussed in the graphics department but it is one of the redeeming qualities of the game.  The 1-on-1 and Practice Modes are back in Live to help you sharpen your individual skills and the best part is being able to take some of the greatest legends of the game out onto the blacktop. Players like George Gervin, Bob Petit, Julius Erving and even Penny Hardaway when he was still good, are yours to control to help you get a feel for Live's control. Having access to both a crossover button (X) and a stutter step button (black) to go along with the good old pump fake (tap B) and spin move (Y) make for quite an arsenal. And it's much easier to appreciate these moves when you're playing your buddy one on one rather than a full five on five game because when a man gets beat you know who's to blame.   The Franchise mode as I said, is comprehensive. Using an intricate points system to keep you from stockpiling talent, the free agency and trading rules do a good job of keeping you honest. Maybe the NBA didn't want EA to expose the details of their salary cap so managing a player's points instead of dollars is as close as you'll get to being a real NBA general manager. But you'll get your awards, NBA news and stats sorted and arranged any way you like after every game. The NBA, like FIFA, doesn't lend itself to a very exciting franchise experience like we see in NFL and even college football games, but Live 2002's is as solid as you could want.  Graphics The framerate is as steady as they come, the player models themselves tend to be a little too ~plasticky~ for my expectations and the animation is outstanding.  When you see a vicious rebounder like Danny Fortson goes up for a board, you can actually see him gather himself and stretch for the ball like a guy that's been doing it for years. The seamless transition from one motion-captured move to the next is what makes the game look so smooth. Players don't ~hop~ from one position or pose to another, they move arms, legs and bodies to make a spin move, go up for a shot or steal the ball. Vince Carter slashes to the hoop, shifts his weight and elevates with amazing authenticity because each part of the sequence flows into the next. Just like in real life.   There are some hitches here and there that go hand in hand with some clipping problems but they're mostly forgivable. Live 2002 doesn't have the sense of mass like we've seen in the NBA 2K series where you can appreciate the contact between players when they bump into each other or commit hard fouls, so it's easy to dismiss other shortcoming.  The player models look like polished up guys from the PS2 version of NBA Live 2002. This is understandable with the rush to get it out to the public, but the power of the Xbox makes it so much more noticeable. When Pippen's facial expression pop from one to the next it's so abrupt because the Xbox let's you see every detail of his face so clearly. Allen Iverson and Shaquille O'Neal's tattoos were scanned and slapped onto their Live 2002 counterparts but stretching of the player model's skin makes them pretty much unreadable. That same stretching is why the player jerseys seem connected to player's skin.   Sound Announcing in sports videogames has gotten better over the years thankfully but with so many companies making so many games for so many sports leagues, we've quickly ran out of announcers. This is why Joe ~The Show~ from NBA Street is serving as color analyst for Live 2002 broadcasts. His high-pitched screech of a voice combined with EA's contrived ~authentic~ urban vernacular was only tolerable in Street because the game was super fun. In Live, there's nothing but Joe, his run of the mill play-by-play man and the squeak of sneakers and basketball to listen to. It gets old by the second quarter. By the fourth quarter of the game you're pretty much numb to it.   The music is appropriately hip hop in Live 2002, but the tunes fit well within the game. There's nothing on the soundtrack that sounds like a single trying to outshine the videogame itself.  I wish Live played as well as it looks and half as well as it moves. The ultimate hoop game strikes a balance between game speed, play mechanics, animation and AI that gives you a cohesive experience. With NBA Live 2002, the athleticism of the animations is superb, the speed of the game is well balanced and all of the trappings of the NBA are there. It's the kind of basketball Live makes you play that throws everything out of balance. It seems that it was tougher to score consistently in NBA Street, an intentionally arcadey hoops game. Ironically, the mechanics just end up being way too simple for a gamer that wants a full fledged NBA simulation experience. I'm not saying I want to be matching wits with Pat Riley when I play, but there should be a substantial challenge when I first pick up the game that lessens as I get better and learn how the game thinks. With Live, you can pick it up and dominate it within minutes regardless of teams involved or difficulty setting. The game will look damn good while you administer ass kicking after ass kicking, but even those with the lowest self-esteem will eventually realize Live 2002 is just patronizing them. Sports games, even hoop titles on Xbox, are supposed to have built-in longevity because of the supposedly never ending waves of competition. Live 2002 surrenders very soon after you switch the power on.", "date": "Nov 21, 2001"}