{"name": "Crazy Taxi", "name_review": "Crazy Taxi", "ref": "https://www.ign.com/articles/2001/11/21/crazy-taxi", "text": "Acclaim's port of the addictive circa 1998 Sega action-racer has arrived with GameCube launch. It's an oldie but still a goodie, and despite its dated look it gives those who never owned a Dreamcast the chance to experience Crazy Taxi.   Features   Drive a cab through populated cites -- rack up points and deliver fares Four different cabs and drivers, each with their own style and attitude  Two expansive, interactive courses for extensive game play  Three modes of play including Arcade, Original, and Crazy Box challenges Nine Crazy Box mini-games to challenge various driving skills  Crash, burn, and slide through the cities with tight control  Unlock secret Crazy Box modes as your skills increase Wild, mission-based gameplay infused with humor  Soundtrack by hit bands Offspring and Bad Religion    Gameplay The name ~Crazy Taxi~ is part of most gamers' vocabulary. The addictive title was a smash hit in the arcades and was also one of the best pieces of software available for Sega's now-deceased Dreamcast system. However, despite the critical acclaim Crazy Taxi could only cater to Dreamcast's comparatively limited userbase. So Acclaim has nabbed the license from Sega in an effort to give the widening next-generation console audience. However, it appears that Sega has given Acclaim no creative freedom, so Crazy Taxi on GameCube is almost a pixel-for-pixel port. Nearly nothing has changed.   The main modes of play are Arcade and Original. Arcade is an exact replica of the quarter-sucking original with the same city to taxi around, whereas Original mode features the made-for-Dreamcast city. The concept behind Crazy Taxi is basic on the exterior. You are an extreme, edgy Taxi driver that gives the city locals the rides of their lives. The city is huge and there are a huge number of fares to pick up -- there's someone around every corner. Everybody has a different place to go and to give you an idea of how far you will have to travel your potential pick-ups are color coded. Red passengers want a short ride, yellow will take you slightly farther, and green fares usually want to go all the way across town. Because everything is time-based you have to try to make as much money as possible from the fares in the given time limit. Each successful pick-up results in a time bonus. So you'll have to constantly carry a passenger if you want to stay in the game. It's clearly an arcade game at heart and it shows, but, man, what a ride it is.    Then there is the Crazy Box mode, which is debated to be the best part of the home console Crazy Taxi experience. Like Super Monkey Ball, Sega adds mini-games to its arcade games to give console users more to do since they don't have to worry about losing quarters. There are a total of nine main games including the following:   Crazy Jump: Leap to beat a certain distance. Crazy Flag: Spin out and reach the flag as fast as possible. Crazy Balloons: Burst all of the balloons on the field. Crazy Drift: Earn more than 15 total combo points by performing the Crazy Drift. Crazy Turn: Practice dropping off customers. Crazy Bound: Deliver the customer without falling into the ocean. Crazy Rush: Deliver five customers in the time limit. Crazy Jam: Deliver all three customers to their destination through a traffic jam. Crazy Pole: Deliver all the customers to their destination.   It's a crazy amount of mini-games to be sure and you'll be pulled back into them to vie for the highest score. They're incredibly fun if you enjoy the main mode of play and offer a great deal of much-needed diversity.   Still, this is all old news to arcade fans and Dreamcast users. There's no disputing that Crazy Taxi has lost some of its appeal because it's dated. Evern worse, the sequel Crazy Taxi 2 has been out for roughly half of a year on Dreamcast. However, Acclaim isn't looking to target consumers who have played the previous iterations of Crazy Taxi. It's looking to take advantage of an userbase that will undoubtedly crack 30 million -- a number three times the size of Dreamcast's installed base. So regardless of the fact that the title is old that doesn't make it less enjoyable to those who haven't played it.   However, Crazy Taxi is not by any means perfect. With only two major cities to explore and nine mini-games it still feels like an arcade game. If you've never played it before you'll spend a few weeks developing carpal tunnel syndrome and sore thumbs. Eventually, though, when you've developed all of your routes and mastered the control it wears out.   Graphics This is basically just a direct port of the Dreamcast version. It looks like a Dreamcast game, and retains all the bad pop-up and texture bluriness familar with the original. It just isn't particularly impressive when you stack it up against visual behemoths such as Factor 5's Star Wars Rogue Squadron II: Rogue Leader. We know what the console can do and Acclaim's port of Crazy Taxi isn't coming close to capitalizing on the GameCube hardware.  On the positive side of things the game runs at 60 frames per second constantly. It's fast and never hitches up. In fact in the same areas that the Dreamcast original and PS2 port slowed down, the GameCube version holds up and keeps things blazing. This much we're satisfied with, but it's hard to forget you're looking at visuals from 1998.   Sound A mighty fine soundtrack by Offspring and Bad Religion. This one stands up to the test of time if you didn't have to hear it the first time around, though with only seven main tracks they will get very tiresome quickly. The soundtrack just can't stack up to a game like Tony Hawk's Pro Skater 3 which has one of the most electric videogame soundtracks to date.   Interestingly, Acclaim changed the voices from the Dreamcast version. We're not sure if Sega's contract ran short on the original or exactly what happened, but they have gotten worse. They weren't especially good to begin with, but now they're ever more mediocre. Crazy Taxi is an awesome game if you didn't play it on previous systems. Don't let its original 1998 release sway you from picking it up for GameCube if you haven't played it before. Chances are you've heard good things about it and now you can enjoy it on a Nintendo system. Even better, the controller is especially comfortable for the game, which requires a lot of button mashing. If you have played Crazy Taxi before or already own it there's very little reason to pick it up on GameCube unless you're looking to waste money. It's the same experience for the price of a new GameCube title.", "date": "Nov 21, 2001"}