{"name": "Deadly Dozen", "name_review": "Deadly Dozen", "ref": "https://www.ign.com/articles/2001/11/28/deadly-dozen", "text": "It's the height of World War II and the United States has enlisted twelve of its most rough and tumble down and dirty warriors to carry out the most dangerous and important of tasks against a seemingly unstoppable Nazi Germany. Pick four from this pool of classically stereotyped Marlboro men and lead them headlong into the jaws of the world's most terrifying war machine in this budget-priced squad-based first and third person shooter.  Out of the dozen of deadlies, you can control any four on one mission. The squad mechanics are developed simply and manageably. At anytime you're free to control any of your team, those whom you're not in control of are ordered around by four simple commands: follow, hold, hold fire, and fire at will. There are also seven different types of formations that can be assigned to them -- I found all to be pointless (it will become clear why as I unravel the game's AI).  When you endeavor to control a vehicle, all of your squad members will instantly also ride along. Kind of like in Ultima IV when you'd walk around the map you'd be one guy with a shield, and then, bam! In a fight your whole team would appear. Getting into vehicles is to Ultima IV's one guy on map as moving around outside is to Ultima IV's everybody appears in a fight (see that, IGN will even help you with the SATs).  If one of these fine allied chaps of yours should perish serving their nation they will obviously no longer be available for future missions. This is important because you have a limited supply (not all people can be expendable), and each individual has a specific set of characteristics. Some have better aim (moving up from perfect to perfect + 2), some are more skilled at distributing medicine (but they still can't heal themselves), and so on.    You can switch which characters you take into a mission between missions, regardless of how seemingly impossible such a switch would be (you're deep behind enemy lines and you can pick different guys as if they came from a teleporter). It's cool that you can change it up, but more effort should have been put into explaining exactly how you're able to change your team, (like you rendezvoused at a checkpoint or whatever for reinforcements). It's a minor, minor gripe to be sure, but one that nevertheless draws that extra little bit away from the believability the game so heavily relies upon to succeed.  Deadly Dozen differentiates itself from other budget titles cluttering the bin with a graphical step up from the competition, the glorious Serious Sam excluded.   The game can be played out from both the first and third person perspectives, (first being my choice in the Pepsi challenge despite its lack of peripheral vision), but as a testament to the restrained budget, there are no weapon transition animations, so them popping up instantaneously can be a bit disconcerting. In fact, this level of aesthetically functional design over style and extravagance is indicative of what will be found throughout. A lot of the animations on all of the characters are stiff, but passable, the same can be said of the bulk of effects from weapons and such. It's as if Deadly Dozen came with the motto ~Never bad, but always passable~ branded clearly on the box.   Environments are impressively large, but only visible in bite-sized segments -- the perpetual barbeque haze is in full effect, but the game does draw a solid amount of flora that litter the landscapes (grass sticks up, trees are decently textured, etc.). Indoor areas come primarily bland and boxy, some even with significant reductions in performance. Combat moves freely between the two.   Deadly's method for madness won't topple the supremely reigning Halo anytime soon, but the incorporation of vehicles and a plethora of weapons is commendable. Driving cars can be a blast. Hurtling through Nazi gauntlets on narrow French streets invokes sense of speed and exhilaration with the applied physics causing the car to bob and bounce accordingly over changes in terrain. Cool, fun stuff.  Exchanges of fire are brief and typically involve no more than five or six people at a time -- a little disappointing when compared to other titles that can offer immense firefights involving dozens of participants. The real problem with combat lies in the artificial intelligence, or lack thereof.  The game's levels, as they often come dark, soaked, foggy and littered with trees, compound AI misbehavior and unfairness by a factor of ten or twenty. Engaging opposition that can unfairly pinpoint you from extreme distances and under cover is one thing (heck, I can take on and beat Quake 3's Xaero on Nightmare), so I can handle Nazi's whose eyes rival those of a hawk's, but not when I can't see them back and at least put up a defense (however futile that ends up being). Because Deadly Dozen's environments are so saturated with things that impair sight, and because its enemies are often times so keenly aware of your position and can capitalize on this ridiculous amount perception with ease, combat amounts to fighting an army of mutant Miss Cleo/Owl hybrids armed with rifles. In playing the game, I found that for approximately 80% of the time the only way I could identify an enemy's position without them first repeatedly shooting me in the face was to let my compatriots freely open fire on whomever they spied. Because they're thankfully as visually endowed as their opponents, they have more of a fighting chance than you.  To worsen the situation, every shot sustained causes a brief moment of inactivity, immovability, and disorientation to your player. Consequently, taking one shot from a sniper who could in reality only be fifty feet away generally means taking ten shots if you choose to stand your ground and return fire. Running like all hell in this juggling situation is highly advised. Try and reposition yourself to search out and acquire a clean shot on your aggressor and you'll suddenly find yourself the unwelcome parent to however many bullets they happen to have left in their clip.  When you do run, be sure and completely steer clear of your obnoxious team members as they'll gleefully stand idly by obstructing your path despite your back quickly turning into a bullet hotel. It seems that if they do not have a direct line of sight on the enemy and are not themselves being specifically attacked, your squad members will for the most part do nothing. There often came a time when I'd be on point and would take a shot from nowhere, in panic I'd of course turn tail and run to safety before attempting to lay down some lead death of my own. Too bad for me the brick walls that are my ~teammates~ seem content with standing directly in path stupidly bumping into me and each other. Twenty seconds later three members of my four-man team are dead and I'm still uttering profanities that would make Red Fox blush.  But encounters like these only apply to snipers and riflemen, right? Oh no, every enemy is subject to the same ~see and shoot with uncanny accuracy and consistency~ AI algorithm; that even includes those who come armed with the commonly known Schmeisser submachine gun. Sure, it's supposed to spray bullets all over the place (especially at ranges), but damned if the little buggers can't steadily nail you with nine out of ten shots even if you're just barely peeking around a corner (without any lean option I might add) and the entire viewable distance of the game, littered with a plethora of obstructions, lies between you and them.  Conversely, when the AI is not supernaturally aware of all that you do, they are dumb as doorposts. You can be in a room and fire off twenty rounds into a German and his dog, but the chap outside won't so much as blink on eye. Inconsistent to say the least.  Still, amazingly enough, all of these inconsistencies and aggravations don't completely hamper an otherwise enjoyable game. Because of Deadly Dozen's confounding ability to replicate and exhibit the atmosphere of the era in the shadow of its faults, cautiously romping through burnt out villages and a rain soaked countryside is still actually fun. Playability never brightly shines or screams for attention and merit, but it comes passable, just enough so that it can comfortably rest on its highpoints and let the game's other facets supplement what remains lacking.  Aurally, for instance, is truly good and plays a substantial part in helping to solidify an oft shakey game, and not just talking just as far as budget titles go, but for gaming audio in general. The music is an exceptional compilation of inspiring militaristic themed tracks that effortlessly meld almost Mission Impossible esque rhythms with ominous overtones typically associated with peril, war, and looming Nazi threats. It all works superbly and just feels right. Really cool stuff.  Not as startlingly impressive, but still worthy of praise are the game's many audio effects. Gunfire, explosions, yelps, splattering rain, footsteps, and the like, are all accurately realized and delivered. Some don't seem quite on par with what early versions of Medal of Honor: Allied Assault has treated us to in the past, but still rightfully claim their place among the upper echelons of gaming.  No multiplayer? In a game that revolves around squad-based play mechanics and boasts extensive character attributes, they don't include multiplayer? This is doubly insane when you consider that playing with human opponents and comrades would immediately do away with a majority of the faults that riddle general play... ~Damn, this AI is impossible to contend with, thankfully multiplayer will have no such problems...~ Whoops. ~Vehicles are cool! Boy, I can't wait to try them out with a buddy...~ Whoops. The game's single player scenarios can only carry it so far and excluding multiplayer of every kind was a grievous error, budget or not.   Despite it's substantially underdeveloped and misguided artificial intelligence and complete lack of lasting value, Deadly Dozen acceptably weaves together a respectable World War II era action title that will be sure to dominate its nook of the bargain pen. It comes recommended simply because it's cheap and passable, but don't expect the extravagance of Serious Sam before it, the sheer combat of Halo, or the production value of either the upcoming Allied Assault or the recently released Return to Castle Wolfenstein. Provided you have the tolerance and will to play out somewhat excessive instances of trial and error, the game will make you smile. Go in, but go in warned and informed.    -- Ivan Sulic      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Nov 28, 2001"}