{"name": "Twisted Metal: Small Brawl", "name_review": "Twisted Metal: Small Brawl", "ref": "https://www.ign.com/articles/2001/11/29/twisted-metal-small-brawl", "text": "Crazy car chaos. These three words best describe Twisted Metal Small Brawl.  I've been a big fan of the Twisted Metal Series and was very intrigued when I heard they were doing another one for PlayStation.  Intrigued not only that it's a new Twisted Metal, but also Incog Inc. is taking its violent twisted masterpiece and changing it into a game suitable for kids.  Every Twisted Metal stars Calypso, a madman who forces a group of lost forgotten souls to play his evil twisted game.  Contestants drive cars armed with machine guns, missiles, and bombs then proceed to destroy each other.  The one who survives the carnage gets one wish of anything their heart desires.  The twist is the wish ends up turning against the player and the outcome always comes out bad.   In Twisted Metal Small Brawl the set up is no different.  The difference lies in the characters themselves.  Calypso is now a schoolyard bully who forces all the kids of the neighborhood to play his twisted little game.  Since the contestants are kids, no one can drive, and the game is played with remote controlled cars.  However the RC cars are far from safe by any means, for each auto is strapped with deadly weapons of destruction.  So charge up your Tyco Turbo and proceed to kick the living daylights out of your fellow man... or in this case kid.   Gameplay The game has your typical Twisted Metal modes. Tournament, the basic story mode, Challenge, choose you car and who you want to play against, and Endurance, how long can you survive? There is also a two-player mode. In this mode there's, Head to Head, you and your friend to the death, Cooperative, cooperating to take on the world, and Free For All, everyone's on their own.   How is the story mode?  Well, the game has your classic beat eight levels and you beat the game.  Each level adds another level of difficulty, more hazards, more cars, and/or less weapons.  Once you hit level four, the game gives you a midway boss, one filled with shields, unfair weapons, and tons of fun (but minus the tons of fun). Upon reaching the eighth level you must defeat the final boss, much harder than the midway boss, and therefore packed with more fun!  (Sarcastically speaking of course.) Beating him gives us what we all desire when we play a game for hours on end, the ending. Now, the endings are very short and not quite as creative as the endings in Twisted Metal 2. But this is the part I find very ~twisted.~ The character models are just so creepy, those abnormally big heads and bugged out eyes alone probably bumped up the ESRB rating to Teen. But seriously this story mode is really lacking compared to Twisted Metal 2's, even if this is supposed to be for kids.   If you played the earlier Twisted Metal games the control setup is pretty much the same.  If you haven't the controls are pretty smooth.  But I do have some complaints though, like the control configuration options.  You get three choices.  Three.  Your options are Small Brawl, Reverse Small Brawl, and Original Twisted Metal modes.  Now I wouldn't complain so much if there were actual differences between these modes, but there isn't.  Basically switching from mode to mode changes one button and right and left when you go backwards.  That's it.  And the button the game changes, allows you to pick from Turbo or Unused.  Why can't they make it so that you could customize each button?  I've seen it done before, and why don't they have all of the settings that Twisted Metal Black had?  It's the same developer.  Where's my Control Freak!?  I get no love.   The other new weird change is the battery attacks.  You know the extra moves you get, like shield, freeze, and mines.  Now I know what you're thinking ~They had those in Twisted Metal 2!~  True. And they kept this in 3 and 4, even though 989 Studios developed those.  But the problem I have is they changed the key configuration for doing them.  If I remember correctly the key config for shield back in 2 was up, up, right.  I tried it in TW4 and it worked!  I tried it in TMSB and... nothing.  Apparently they changed the move to left, left, down, down.  (This is also how to raise the shields in Twisted Metal Black.  Why'd they change it?)  Now I know keeping the move in the game is nice, but if you have a series of games wouldn't it make sense to make the moves the same?  I think so, especially when I have five guys around me barraging me with missiles. ~Shield, damn it! Where's my shield!?~   Characters The vehicles are all characters from Twisted Metal 2.  The ability to play these classic cars is cool.  There are also a number of hidden characters to unlock but I'll let you figure that out on your own.  Wouldn't want to spoil your fun.  He's the list of selectable characters in Twisted Metal Small Brawl  Sweet Tooth Crimson Mr. Grimm Shadow Thumper Outlaw Warthog Twister Mr. Slam Spectre Hammerhead   But don't get your hopes up to soon if you think this is going to be the same old TM2. Almost everyone's Super is different.  Crimson is lacking his boomerangs and instead is supporting three flaming paper airplanes.  Thumper no longer has his flamethrower of doom, and in its place are three ricocheting super sonic shockwaves that blare out towards your opponents. I'll let you figure out the other differences between the characters.  It'll be a surprise!   Levels The levels are well done. Since you're driving RC Cars everything is huge.  It's fun to drive up slides in the playground and you must maneuver past the lawnmower in the tree house level. Here's a list of levels for those of you wondering.   Playground Peril Carn-O-Maul Easy Death Oven Minigolf Mayhem Meat Your Maker Gridiron Gore Tree Top Rumble Now Slaying  The problem I find with this game is there are no hidden areas in the levels.  In Twisted Metal 2 you could blow up the Eiffel Tower and cruise the rooftops of Paris, or explore the underground temples of the Amazon.  I looked around for hours in TMSB, every level is pretty much ~What you see is what you get.~   Graphics This is not a pretty game.  The graphics are really poor.  And I say this not comparing it to Twisted Metal: Black, which would be totally unfair.  No, I'm comparing the graphics in TMSB to Twisted Metal 4. The vehicles in Twisted Metal 4 look so much cleaner and nicer than those in Small Brawl.  The levels are also not very pretty.  You get a sense of what things are but not much more than that ~Oh that box thing is a popcorn container.  I guess.  Is that white thing a golf ball?~   The menus in this game are poor. If you like looking at boring black screens with colored words then you need to play this game.  This game seriously looks like a throwback. It seems like Incog Inc. put all its time and effort into Twisted Metal Black then said, ~Oh yeah, we got another game to do on the PlayStation.  Oh well, here you go!~  And it's such a disappointment considering that Twisted Metal 2 had beautiful menus.  Nice big metal buttons and cool camera moves as you selected different cars.  It made me want to play the game more and more.   Sound The music is your typical TM music.  It's nice tune to listen to as you blast your enemy into smithereens. The sound effects are also nice, explosions, picking up items, executing battery attacks, all have a cute sound effect to go along with each action. Last thoughts?  This game really feels slapped together, at the last moment kind of sense. And even if it's not, it feels that way. The menus are horrendous, and the graphics are appalling. Come on, when you see a series of games, you expect them to improve, in graphics, sound, gameplay, and level design.  In Twisted Metal Small Brawl they're all worse.  And I'm not even comparing it to Twisted Metal Black on the PS2, I'm comparing it to the previous TM games on the PlayStation.  Twisted Metal ~1~ was better than this game. And there's no reason for this, Incog Inc., the developers of the first two Twisted Metals and Twisted Metal: Black, developed this game.  If you liked Twisted Metal 2, then keep playing it, don't buy this game because you will be thoroughly disappointed.  Twisted Metal Small Brawl is essentially Twisted Metal 2 with a lighter, simpler story, worse graphics (Is that a man's butt sticking out from under that sink?), and no hidden areas (Where's Paris?  Where's the freeway?  Where's the fun?).  Now, if you have Twisted Metal: Black, heed my warning weary traveler and turn back, for there is great pain, horror, and misery, if you continue to tread this way.  Buy it? No. Rent it? ...Well, if you truly love Twisted Metal, you could rent it, but you might be sorry.", "date": "Nov 29, 2001"}