{"name": "Ecks vs. Sever", "name_review": "Ecks vs. Sever", "ref": "https://www.ign.com/articles/2001/12/01/ecks-vs-sever", "text": "Here's a gaming first: Ecks vs. Sever is a videogame rendition of a movie that hasn't even started production yet. When BAM Entertainment acquired the rights of the license from Franchise Pictures, the company put Crawfish to the task of developing a game around the existing script. Crawfish took the challenge and developed a really fantastic first-person shooter on the Game Boy Advance, pushing the GBA's hardware with an impressive 3D-style engine and surrounding it all with a very tight design. This makes the third FPS on the Game Boy Advance system this year, and though it's a close call, Ecks vs. Sever is the best one yet on the system. Features Two different characters 24 single player levels Password save Link cable support for four players (multiple cartridges needed) Only for Game Boy Advance Ecks vs. Sever follows, who else, two characters...an ex-FBI agent named Ecks, and a professional assassin by the name Sever.  If you choose to play as Ecks, the game follows his adventures as a flashback as he chases after Sever. Play as Sever, and the tables are turned as the game follows her perspective on the action. Either character can be accessed from the beginning of the game, and each of the characters' 12 missions are variations on the other's 12 missions. Like all first-person shooters, the challenge is to kill or be killed, taking out a wide variety of enemy characters, picking up additional weaponry, ammunition, shielding, and health along the way to last the entire mission from start to finish. Ecks vs. Sever's entire imagery, which includes its graphic engine and art style, is the game's strong point. The 3D engine is a Doom-style raycasting engine, but the developers tweaked the engine specifically for the Game Boy Advance. Though the game doesn't allow for textured floors and ceilings, the engine does allow developers to create a wide range of level structures, including multi-floor buildings, staircases, raised platforms, and elevators...all in an incredibly smooth flowing environment with relatively high resolution textures.  In some levels, you even have to climb out of windows onto fire escapes to gain access to other parts of the mission. The artists went for an almost photorealistic look, or at least as far as the Game Boy Advance's capabilities could allow...and this adds to the game's feel. Enemy sprites have been rendered with several frames of animation for all of their moves, so when they fall into a heap on the floor, it's a smooth motion from standing to laying position. Some textures even animate, and several objects, like fire hydrants, bottles, and chairs, can be shot with impressive results.  Crawfish didn't create a strict cut-and-dry point-A-to-B FPS like Doom, though most of the missions in the game end up that way anyway. The missions themselves range from reaching a certain room to getting out of the level within a certain time limit, and these slight changes in tasks add a welcome variety to the game design beyond the ~run like a maniac to the end of the level~ strategy...though the second missions that actually encourages this should have been redesigned, since it's a snap to buzz right by all the slow-witted security guards and SWAT members to the exit. But when you get to wield a sniper rifle to take out long-distance enemies, or the dark levels where you have to find the night-vision goggles, you can forgive the one or two lackluster level designs.  The game's 12 levels per character are enjoyable overall, but the enemy AI could have been programmed with a little more aggression. At least in the early levels, enemy characters rarely chase you down...making them glorified targets instead of threats.   The controls are very intuitive overall, but the sidestep strafing command is a might too touchy to be of any real use...just slightly tapping the L or R button will cause your character to move a bit too far in that direction. And this makes hiding behind walls a bit more of a chore since you can't really creep out from behind cover to take out an enemy.   The game's huge selling point is it's absolutely awesome attention to multiplayer gaming. Throughout the 12 single player missions you can unlock new levels that can only be accessed in link cable play. There are different ways to play the link cable matchups, from standard deathmatch to the cool ~find parts of a bomb before the other players~ challenges. And the framerate only drops a tad during these matchups, but it's completely playable and an absolute blast when four players get into the match. It would have been even better  if Crawfish implemented computer AI enemies so that players who don't have anyone to link up with could get a feel for what they're missing when they don't take advantage of the link cable. But as is, Ecks vs. Sever is one of the best four player games made yet for the Game Boy Advance. And it's highly recommended that you encourage a buddy or three to pick up a copy of the game so you can see just how fun it can be.  The sounds are also well done, with digitized samples used for each of the weapons in the game. But the audio could have been used a bit more to the game's advantage...enemies are mute, never uttering a word as they try and gun you down. And the standard pistol weapon honestly needs a different sample altogether...that unimpressive ~piff-piff~ sound could have come from a bottle of Windex. Music is non-existent during missions, so the action is eerily and unnecessarily quiet half the time.  Though the game isn't as maniacal and adrenaline-pumping as Doom, Ecks vs. Sever is a better action game because it feels like a GBA-specific adventure, and not a limited port of an existing design. I think the game would have felt more complete had the developers worked animated cutscenes into the mix instead of relying on tiny text between levels to drive the storyline...but overall, this first-person shooter is an excellent game, and it's Crawfish's first attempt at the genre on the handheld. And if you don't take advantage of the game's link cable support, you're missing out on some crazy fun on the Game Boy Advance.", "date": "Dec 1, 2001"}