{"name": "Baldur's Gate: Dark Alliance", "name_review": "Baldur's Gate: Dark Alliance", "ref": "https://www.ign.com/articles/2001/12/03/baldurs-gate-dark-alliance-7", "text": "This is one good-looking game.  Baldur's Gate: Dark Alliance is powered by one of the best 3D engines yet devised for the PlayStation 2, a feat for which developer Snowblind Studios deserves considerable acclaim.  All the Lobotomy veterans on the team are well overdue a fete, considering how little credit they got for the brilliant programming of their Sega Saturn games.  Powerslave had a heck of an engine, it was just that nobody played it.  That problem shouldn't plague Dark Alliance, though -- it should receive all the success it deserves.   It is based, after all, on one of the most reliable concepts in videogames.  It's a dungeon hack.  It's a good dungeon hack.  Boy, do I love a good dungeon hack.  In terms of depth, there will not ever be anything to touch the glory of NetHack, but Dark Alliance does more than enough to make it a standout in the genre.  It has deep dungeons, twisting passages, tricky puzzles, dangerous traps, a wide variety of opponents, and +3 Masterwork Flaming Long Swords.  Or something like that.  You get the idea, right?   I suppose there are some gamers out there who would eventually cool on the prospect of running around, hacking things, building up a character, and charging back out into the fray for more running and hacking, but we'll quietly gloss over that possibility here.  Even if longevity is a consideration, though, Dark Alliance is a cut above in that respect, with an engaging story, asubstantially different experience for each of the three character classes, and a brilliant multiplayer option.  If you're not convinced yet, well, perhaps we'll have to descend a few levels deeper...   Gameplay  At first glance, it's easy to say ~Oh, that's Diablo,~ but it's worth noting that the console port of the first Diablo played very poorly, while Dark Alliance controls as smoothly as you please with the interface provided by the Dual Shock 2.  The inventory subscreens are very straightforward, there are hot buttons for things like the important potion-quaffing commands (healing and mana rejuvenation), and magic spell selection is handled with a nice Metal Gear-style inventory overlay in one corner.  The GUI occasionally has a lot of transparent overlays, including spell selections and the area map (which you can keep in two different positions), but the action itself is rarely obscured.    Thus, it's easy to proceed directly to the matter at hand, which is hacking.  Dark Alliance has a loose quest structure, with the occasional secondary objective branching off from the straight line of forward progress, and basic puzzles occasionally block your path through an area (with some platforming, switch-pulling, and brain-teasing in roughly equal mixture), but the balance of your time is simply spent smashing your way through dungeons and the attendant mobile opposition.  This, in a proper dungeon hack, is as it should be (at least in the author's opinion).  A hack doesn't have to go stale if the creators put enough time into a broad selection of items, enemies, and environments, and that Snowblind most certainly has done.   Just playing through the game with a different character class makes a huge difference.  There are three: a dwarven fighter, who sticks to hand-to-hand combat, a human archer with a blend of spells and ranged attacks, and an elven sorceress whose emphasis is naturally on magic.  The dwarf is probably the best beginner's character, thanks to his straightforward style, but trying out the spellcasting characters offers a lot more versatility, not to mention more impressive graphical effects.  Picking a fighting emphasis doesn't entirely remove you from the fun, though, since there are a few special skills that operate as spells (the dwarf's Bull Rush attack is always entertaining).  On the flip side, the fast casting system (flip through the inventory with one thumb and cast with the other) doesn't bog down the sorceress in comparison to her more martial fellows.   Whichever character you choose, though, there are plenty of landscapes to hack through (forests, mountains, mines, castles, swamps, ice caves, sewers, and more), and a wealth of assorted widgets to collect as booty from these various dungeons.  In relation to that subject, a few comments on the game's use of the Dungeons & Dragons license might be in order.  As far as how this game relates to the 3rd Edition ruleset, I can't say much, given my unfamiliarity with the new system, but I'm inclined to say they're something like distant cousins.  If combat uses D&D rules, its resolution is still entirely transparent, and the item system seems to add a lot of streamlining and variation on its own.   What it does draw from the license, however, and use very well, is its setting and the characters it uses to populate that world.  The entire Monster Manual isn't here, but some of its most amusing highlights certainly are -- there are traditional bad guys like kobolds and gnolls, imposing types like frost giants and beholders, and plenty of quirky favorites, including displacer beasts, umber hulks, and gelatinous cubes.  At the risk of burning my already tattered credibility to ashes, I'm tempted to boot this game at least half a point up the scale just on account of the gelatinous cubes.  Fans of the Forgotten Realms setting should also be able to pick out plenty of landmarks, since the adventure moves far afield from Baldur's Gate.    One area where the rogue's falls down a bit, however, is the boss encounters, which occur at key junctures throughout each act.  I realize it may be difficult to program a complex battle sequence within a system that's geared primarily towards dispatching enemies with a few basic attacks, but some of these climactic battles are, well, awfully anticlimactic.  Indeed, challenge seems to be inversely proportional to visual spectacle at times -- the thief leader halfway through Act I has spells, dirty tricks, and teleportation to mix things up, while the gigantic white dragon at the end of Act II can be easily dispatched by simply stepping to his side and slashing with abandon.  He still looks brilliant, that's not a problem, but it would add to the sense of occasion if it took a little more effort to understand his attack patterns.   Or perhaps it was just because my Masterwork +3 Great Sword of Speed was too much for him to handle.  As you know, one of the central appeals of a good hack is the acquisition of stuff, and Dark Alliance does a fine job of offering the player plenty of stuff to acquire.  The item system makes do with limited space by mixing up a wide variety of qualifiers with all the different weapon types, so you could have perhaps a dozen different variations on the theme of ~long sword~ varying from ~flaming~ to ~adamantine~ to ~of wounding~ and everything in between.  It would be nice if there were a greater variety of support items -- the bulk of the stuff selection is confined to weapons and armor -- but a Deck of Many Things is a tall order to ask of an action game, I suppose.   Graphics  To put it in particularly geeky terms, we're closing in on the 3D equivalent of a Larry Elmore piece here.  Most of its world is viewed from a distance, but Dark Alliance still manages to be packed with detail in almost every aspect, from animation to modeling to textures.  It impresses with both its immediate impact and sustained impression -- you can look at it and say ~wow, that's cool,~ then keep on looking and find more little things to go ~wow~ over.   The world is presented from an isometric top-down view a la Diablo, but it's all rendered in real time, and a goodly portion of areas allow you to rotate the camera 360 degrees with the right analog stick.  Even when you can't, in larger outdoor areas, the automatic camera direction is smart enough to keep things in order.  The 3D engine lets the game do all kinds of neat things Diablo can't, or do what it does better.  Lighting effects stand out first and foremost -- the layers of light and shadow here are something else.  Light from direct and indirect sources blends together to cast realtime shadows from 3D objects and create all kinds of different reflections on each surface.  Polished stone reflects a dull glare, while bright flashes glint off ice and light and shadow ripple together across a disturbed pool of water.  Changes in light sources are reflected with a remarkable degree of consistency, whether they're caused by the extinguishing of a torch, the explosion of a barrel, or the flicker of your Flaming Masterwork +3 Warhammer of Disruption (sorry, couldn't resist).    Perhaps the lighting effects wouldn't be so impressive if they didn't play across such well-rendered surfaces, but luckily Dark Alliance has some of the most polished modeling around.  Objects and surfaces have plenty of polygonal detail beneath the sharp textures, and this is the game to finally kick all that aliasing nonsense directly in the teeth.  The engine runs in high resolution at 60 frames per second without a single glitch or jagged edge, ever.  There's never a break to disturb the appreciation of the mountain ice caves, the forests beneath them, or the Baldur's Gate sewers.  Yes, even the sewers look great -- there are some brilliant textures for different stone surfaces, and lots of detailed modeling to add junk in the corners, layers of dust, and the general impression of age.  The design of each area lends it a particular atmosphere that way.   The animation of both living and inanimate objects grants the game world a corresponding degree of life.  Dark Alliance invariably has a degree of repetition to its motions, but there's still some very fine animation here, from top to bottom.  Take barrels, for example.  You'd think smashing a barrel is one of those things that would get short shrift, a very simple animation, but the barrel-smashing in Dark Alliance is a cut above.  Crunch up a crate or keg and you get the immediate collapse, with a nice puff of dust to accent, and an excellent aftermath with different pieces clearly bouncing in the logical directions.   Then you get into the sunken crypts and start smashing up skeletons, and things really get entertaining.  Bones fly everywhere from the collapsed undead, a class including four or five model variations with different armor and weapons, while their zombie cousins crawl around on the floor biting at your ankles.  This is a hoot -- when you kill a zombie, more often than not its surviving torso detaches and keeps coming at you.  Meanwhile, throughout the rest of the game, there's just as much attention paid to the lizardmen (you can behead them), the kobolds (you can hack all kinds of chunks off), the gnoll hordes (their weapons fall every which way), the green slimes (slime!  slime!), and all the rest of the bad guys.  The modeling and animation of the bad guys makes them great to admire living and even more fun to admire dying.    The game's few glitches tend to come when they're dead.  Corpses and the other detritus of combat (bloodstains, hacked-off pieces, etc.) persist throughout the game, and every contingency obviously couldn't be taken into account.  Dead enemies often clip through walls or interfere with lightmaps, and there's a very funny bit where you fight up a series of mountain switchbacks -- the ground is obviously sloped, but the corpses are programmed to sit as if on flat ground, so they sort of float a foot above the terra while their shadows fall as they should.  This certainly doesn't get in the way of gameplay, though -- rather, it's just something one would point out for the sake of amusement.   Sound  Also on that note, something you want to watch out for in the voice acting department here is Cam Clarke, who plays a priest of Ilmater in a state of continuous pants-wetting terror.  If the name isn't enough for you to get the joke, he happens to be the same actor who plays Liquid Snake.  It's a fun sort of contrast, if you happen to have played both games.   Along with the fun references you can pick up, the voices in Dark Alliance are of the same quality that we've come to expect from the better class of PC RPGs.  This isn't quite a story-driven game, so the actors don't have a great deal in the way of plot or deep character development that they have to support, but the voices do a very good job of adding to the atmosphere of an area, be it the Elfsong Tavern (staffed by the ubiquitous cute barmaid) or a swamp filled with spell-maddened lizardmen.  Your character also occasionally has something to say -- the gruff dwarven warrior pipes up with the odd funny quip when you try and make him pick up more than he can carry.   The less coherent elements of the soundtrack do an equally good job of holding up the atmosphere.  There's nothing like the swoosh of your sword, the screech of a dying kobold, and the wet smack of assorted corpse-bits hitting the floor to suck you into a fun dungeon-hacking experience.  The variety of sound effects for different enemies, spells, weapon types, and characters is substantial, giving each battle its own particular soundtrack, and quieter stretches of exploration are still spruced up by the environmental sounds.  In dungeons, torches crackle, dark forests are filled with the sound of rustling leaves, rippling water sounds as good as it looks, and the same goes for those brilliant exploding barrels.  It shows real thought on Snowblind's part to make barrel-smashing so interesting, since you do so much of it.  Along with the great animation mentioned beforehand, there's a solid crunch for the initial impact and well-orchestrated clatters to match the scattering of broken pieces.   In comparison to all this, the musical score tends to pale somewhat.  There's not a great deal of sustained music in the game, and when it does appear, for some reason it's turned down far too low.  Here and there you come upon some very well-composed orchestral pieces backing up key moments and lengthier sequences of the game, but they're quiet enough to feel more like ambient music at the time.  The solution, I suppose, is to kick up the independent volume controls, although it's strange that you would have to.  Much of the game is still accompanied by nothing but environmental effects and the sounds of battle, though, and for that time the issue is moot.There is honestly not a great deal to complain about here.  Dark Alliance runs considerably shorter than anything else with the Baldur's Gate name on it -- I'd reckon you can whack the game on Normal mode in 15-20 hours (though restarts mean the game clock may be misleading) -- but the three character classes add substantial replay value, and the multiplayer mode is a must if you've got a friend who can stick with you for the long haul.  The two-player mode lets you each pick a class and team up throughout the entire adventure, which should make for some seriously entertaining mayhem.  Pity I lead such a shut-in existence...But let's bag the pity and start doling out the congratulations for a job well done.  Snowblind has put together one of the best engines on PS2 and one of the best hacks in the business, certainly the best a console has ever seen.  Even the mouse-clicking hordes of Diablo fans might be lured away from their PCs, and I can certainly attest that a NetHack devotee can find solace in the arms of non-monochrome graphics.  Now give me a sequel with some ioun stones and Ropers, and I promise I'll be perfectly happy.", "date": "Dec 3, 2001"}