{"name": "Legend of Zelda: Link's Awakening DX", "name_review": "Legend of Zelda: Link's Awakening DX", "ref": "https://www.ign.com/articles/1999/09/17/legend-of-zelda-links-awakening-dx", "text": "Legend of Zelda. No other name in video game history can grab and shake your attention with such vigor. Ever since Link's first adventure in the mid '80s, the series has gained immense popularity, and rightfully so!  Because of the ingenious mind of one Shigeru Miyamoto, we have been able to journey through the land of Hyrule and beyond on several monumental occasions, and the experience found within each one has left a high watermark for other creators to look up to.  Since its first arrival on the original Game Boy years ago, Legend of Zelda: Link's Awakening proved that Nintendo's handheld system can have the same walloping punch as its own 16-bit funhouse.  And with entertainment in extreme doses, it's not amazing to see why, either!  No matter where your tastes lie in gaming, you can't go wrong with one of the most ultimate titles of all time.  And since the fourth installment in the series has been revamped in a new DX edition -- with plenty of extras for those of us with a Game Boy Color -- the hours of fun just keeps on going.FeaturesFully colorized version of 1993 classic. Three battery-backed save slots. Includes new GBC-only dungeon. Game Boy Printer Support. For Game Boy and Game Boy Color.  Although there is but one mode in The Legend of Zelda: Link's Awakening DX, there's certainly not a shortage of places to go, people to meet, or things to do.  Oh no, there's a much different tune to be sung the second after you wrap your thumbs around the buttons of your Game Boy with this sucker in the slot.  The moment you enter the solitary island of Koholint, you'll come to grips with just how humongous this portable adventure really is, and with dozens of characters and places to interact with, Zelda DX has a lot to boast.  A long story short, you're the notorious hero Link who has set off on a personal voyage far away from home.  During a dark storm, your ship is destroyed by a blast of lightning, and you fall unconscious -- until you wake up under the care of Marin and Tarin, who point you in the right direction to begin what may be the most engrossing adventure yet!  Full of dark enemies, musical instruments, mysterious motives, and a sleeping fish, Zelda DX is gaming at its best, and is liable to keep you addicted until you answer the Wind Fish's ultimate riddle.  Everything from the original version is here -- there's neither a place nor object missing.  In fact, the new DX edition has a bit more added.  In addition to the normal amount of dungeons, you'll be able to seek out and enter a special hidden one which, although short, gives veteran players seeking a new experience somewhat of what they're asking for. And since it's tailored specifically for the Game Boy Color and its newer hardware (it cannot be accessed without it), it definitely adds a bit more value to an old classic, especially since you receive a set of blue or red armor upon the dungeon's completion.   The newly revamped Game Boy Color mode fits the restraints well, and bring to life what once dwelled in the realm of black and white. Throughout the color-enhanced version of Zelda DX, it can easily be inferred that Nintendo has reworked its magic to fit new standards.  Now that it looks much more like its original NES counterpart than ever before, Miyamoto's masterpiece holds water on an all-new ground, and it certainly shows.  A splash of color goes a long way, and there's little to be said otherwise.  As for the other extras in the fourth Legend of Zelda, there are several. The most noticeable of the bunch would have to be the Game Boy Printer compatibility, which is certainly an interesting addition.  During many parts of the adventure, which aren't always easy to discover, your picture will be taken and stored in the Koholint photo shop, where you can drop by whenever you wish to view your picture collection.  And if you've got the compatible printer, you can make stickers from whatever photographs have been taken. The true challenge of this, however, is to find all the places where you get your picture taken.  If you can find every single last one of them without aid from a player's guide, you'll be a true Zelda Master indeed. If that's not enough to set your minds on gaming fire, then you seriously need a reality check, because The Legend of Zelda: Link's Awakening has never been anything but one of the top video games of all time, and its latest, enhanced version is nothing short of perfect. For years to come and then some, it will continue to remain one of my all-time favorite adventures, and unless someone puts a couple of gun barrels to my head, my opinions won't be swayed.  If you don't already own Zelda DX, there's no reason from this point on that you shouldn't.  So hop in your car and step on the gas, 'cause the best Game Boy game of all time has been for sale for quite some time, and you're missing out on oceans of fun.", "date": "Sep 17, 1999"}