{"name": "Patrician II: Quest for Power", "name_review": "Patrician II", "ref": "https://www.ign.com/articles/2001/12/11/patrician-ii", "text": "I'm a man of simple pleasures. I like boats, enjoy making money and absolutely love studying the Hanseatic League of 13th century Europe (okay...so the first two are true...and the word Hanseatic does have a nice ring to it). Therefore I assumed Patrician II, Strategy First's long awaited sequel to the original late 80's Amiga version, and I would be a solid match. And although I'm not a hardcore strategy enthusiast, I am down for a little trading on the high seas action once in a while.  Patrician II puts you in the role of a lowly Hanseatic merchant trying to claw his way up the big time position of Patrician. Along the way you must keep your people happy, trade goods like a rabid Wall Street investment banker, and, best of all, avoid swashbuckling (I love that word) pirates who would just love to steal your loot. So as you can imagine, Patrician's objectives are simple: make money, acquire fame and stay alive. However, the game's intense micromanagement and seemingly endless gameplay facets are what make it both a strategy nut's dream and a casual gamer's nightmare.  The core gameplay of Patrician II, trading, is handled in simple and solid fashion. It consists of primarily purchasing one of twenty raw materials at one port, then either storing them in your ~home trading office~ for later use or selling them in another town for a profit (hopefully!). The actual task of buying and selling is a breeze; requiring the user to simply travel to a port, observe the prices and load/unload the inventory to/from your ship. Perhaps the most appealing facet of the trading interface is a display of the average price you paid for your purchased goods...a nice little tool that prevents forgetful boneheads like myself from buying high and selling low.  The initial hours of gameplay can seem fairly monotonous (unless of course you really get a kick out of buying Iron Ore at 45 gold and selling it at 49), but once you build up sufficient funds and establish yourself in your hometown, Patrician II really starts to blossom. Think its time to expand your trading empire? Simple, just build a nice little fleet at the shipyard. Starting to hear complains from citizens in your hometown? Just shut them up by making a donation to the church or by building a well.   The gameplay possibilities are extensive, and each avenue you are able to pursue is surprisingly deep. For instance if you by only selling beer in your hometown you're in for a nasty surprise. Since Patrician II considers beer a ~poor citizens commodity~ (what a load of crap!), you will start to gain favor amongst the poor while isolating yourself from the rich. Such niches like this make Patrician II a truly engaging simulation that will easily provide a dedicated user with 50+ hours of gameplay.  Patrician II's primary fault is the lack of direct competition with other Hanseatic traders. Although their influence and actions can be seen indirectly in the game's economy and towns, you have modest actual contact with them. In my opinion, one of the most enjoyable features about strategy simulations (such as Civilization III) is diplomacy and the ability to outwit your opponents rather than just out produce or out buy them. Such a feature is sparingly utilized in Patrician II, taking away some of the epic glow on which the game thrives and also rending the Multiplayer portion of the game essentially useless. Furthermore, Patrician's half-hearted attempt to incorporate pirates into the game proves to be a burdensome distraction...getting ambushed by pirates on the open sea gets old VERY fast, especially considering the dumbed-down conflict interface.  Fortunately Strategy First has a knack for making multi-layered, intuitive interfaces; otherwise Patrician II would be a never-ending pile of confusion. Everything from trading, to building construction and ship management is accessible through a few task bars and display panels. Upon first glance it may seem a bit overwhelming, but after about an hour of gameplay you'll find yourself comfortably adjusted. That is not to say that the game's extensive tutorial is unnecessary. In fact, I highly recommend running through it once so that you can understand some of the Patrician II's obscure icon references that are interlocked throughout the main interface (for instance, one can only figure out if his/her ship has a captain on board by searching for a small star located next to the ship's crew information).   While the graphics in Patrician II aren't exactly something to write home about, they do manage to get the job done. Cities are displayed in vibrant color and significant detail, buildings and ships are crafted with intricate design, the open sea comes equipped with informative cloud movements and snazzy water effects, and interactions with shops are supported by beautiful CGI standstills. And while the game's 2D engine does look noticeably dated (reminiscent of the pre Age of Empires era), it's accessible nature and superb atmospheric elements make it tolerable.  My only major graphical gripe with Patrician II concerns the game's citizen animation: for some reason they aimlessly wander the town in choppy, robotic fashion (and still manage to whine like its their job).  Casual games will undoubtedly be bogged down by the intense micromanagement apparent throughout Patrician II. From the beginning, when managing funds and keeping the people happy can be a real headache, until the end, when keeping track of an entire fleet of ships can seem as monotonous as watching as NASCAR race, Patrician II continually requires your utmost attention and energy. However, if you are able to endure the lulls, you will most likely find Patrician to be quite a rewarding experience.  -- Michael Perlo      Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Dec 11, 2001"}