{"name": "Fatal Fury: Mark of The Wolves", "name_review": "Fatal Fury: Mark Of The Wolves", "ref": "https://www.ign.com/articles/2001/12/12/fatal-fury-mark-of-the-wolves", "text": "As we move on to the next generation of consoles, there's no doubt that developers will utilize each of the next generation console's graphic abilities to astound gamers with wondrous visual delights and perhaps introduce us to new gaming adventures.  But as much fun as it is to explore this new 3D world of gaming, there's should be a lot of love for the ~old~ style of video games - 2D.  And let's face it, as much as we love bump-mapped textures, transparencies, and dazzling real-time lighting effects, there's something to be said about wondrous hand-drawn visuals, crazy 2D animation, and delightful colors.  Even as the 3D world tries to emulate this hand-drawn style with the technique known as cel shading, it would be hard to imagine a 3D game as incredibly animated as Metal Slug or Street Fighter III.  Hardcore 2D fighting fans know exactly what I'm talking about and will be glad to know that their 2D solace can be found on one of the last 2D fighting games on the Dreamcast - Fatal Fury: Mark Of The Wolves.  Developed by the former 2D gods known as SNK, Fatal Fury: Mark Of The Wolves was originally known in the arcades as Garou: Mark Of The Wolves.  Like we've said before, the story for fighting games is far from the most important part, but with the lineage of 2D fighting titles SNK has produced over the years, the story of the game is an interesting one.  Taking place many years after the Fatal Fury series, a tournament has been established to see who is the king of fighters this time around.  Although only one of the twelve fighters makes a return from previous SNK fighting games - Terry Bogard - several of the characters have some sort of attachment to other famous SNK characters.  Most notable are the furious kicking brawlers, Kim Jae Hoon and Kim Dong Hwan, sons of SNK original fighter Kim Kaphwan as well as Rock Howard, the son of Terry Bogard's Fatal Fury's nemesis, Geese Howard.  Like any fighting game, the goal is to knockout your opponent by depleting his health meter while prevent the opposing fighter from doing the same to you.  Using the standard four button layout - two punches (weak and strong) and two kicks (weak and strong) - perform a combination of special attacks, throws, and super attacks in conjunction with D-pad commands.  It's similar to the format 2D fighting games have taken since the inception of Street Fighter II but Mark Of The Wolves has dozens of different techniques to learn and master.  It's often been said by the uninformed that if you ~play one 2D fighting game, you've played them all.~  That's like saying NFL 2K plays exactly like Madden 2000, and we all know that's not the case.  Sure, MOTW shares some similarities to several other 2D fighting games out but as you delve a little deeper into the gameplay mechanics, you'll discover some interesting techniques.  First off is the T.O.P. system that stands for Tactical Offensive Position.  The T.O.P. system basically highlights a certain area of your health meter - beginning, middle, or end. Wherever you chose to highlight your health meter is up to you and you cannot manual activate the T.O.P. system until your health reaches that T.O.P. area. Once it does, you'll have several unique abilities that will enhance your offensive abilities (i.e. additional damage to attacks, new attacks), as well as defensive ones (i.e. healing within the T.O.P. gauge).  You cannot use your T.O.P. attack until the T.O.P. meter is activated and for good reason; T.O.P. attacks cause heavy damage and even if they're blocked, it's such a heavy attack that blocking it one too may times will cause an opposing fighter to drop his guard animation.  Another unique play mechanic is the ~Just Defended~ blocking system.  It's sort of similar to Street Fighter III's parry system - where you tap forward at an oncoming attack to parry the attack.  MOTW is backward of the play mechanic, but just as forward thinking - instead of tapping forward, you tap back right as the opponents attack connects.  Essentially, your blocking right at the last second before an attack hits you and when you do this properly, a blue aura will appear. During this ~Just Defended~ phase, not only do you regain a sliver of heath back, but you'll also be able to immediate counter attack by canceling your guard. It takes some time to get used to the Just Defense mechanic as I'm sure most fighting players don't wait till the last second to block an incoming attack.  These are just two of the several different techniques you'll find, making Mark Of The Wolves a pretty darn tactical 2D fighting game.  Although most gamers can expect great 2D visuals from SNK, Mark Of The Wolves features some of the best 2D animation in a 2D fighting game.  While characters aren't quite close to being as luxurious as the high resolution fighters of Guilty Gear X, it certainly holds up in terms of character animation and style.  Additionally, the game rivals the likes of Marvel Vs Capcom 2 in terms of special effects; the gratuitous amount of hitting sparks, fiery missile attacks, and flashy lightning visuals are generously displayed even with the simplest special attack (i.e. Butt's rising uppercut).  It's simply astounding how smooth the idle animations are and you'll begin to notice little details for each fighter; for example, you start to see additional stylish nuances for each character like how, J.Benet blows a kiss when she jumps in the air.  The backgrounds are a bit plain, but there are some nice little peculiarities of SNK character and landmarks in the background.  Where Mark Of The Wolves falls a bit is the lack of longevity.  There are numerous special attacks to master, and dozens of combinations to discover but in terms of extra modes, there are but a few.  These include the survival mode, practice mode, and a decent gallery page.  Unfortunately, that's not quite enough to give your average gamer incentive to invest time into the game; something on the level of Street Fighter Alpha 3's  World Tour Mode would've been really sweet or a wealth of SNK characters to unlock.  You would think that with SNK's long list of characters, you would see a few cameo appearances.  Additionally, while the game is quite balanced in terms of play mechanics, there's definitely some character balance issues as some fighters - namely Rock Howard and Kevin Rian - are quite a bit more powerful than rest of the characters.  Yet, these shouldn't be too great of a distraction for any hardy Dreamcast gamer and  Fatal Furty: Mark Of The Wolves is definitely a worthy purchase, especially if you do appreciate the finer elements of the forgotten 2D genre.   It's ironic that one of the last Dreamcast games happens to be from SNK, a company that recently announced it would be going out of the video game business.  Two companies that have been favored by hardcore enthusiasts everywhere, drastically changing - in SNK's case, disappearing - with the times.  Some may comment that this is definitely a sign that hardcore gaming is dead while others, the greater majority, welcome this ~changing of the guard~... the shift of old-school traditional games to this brave new world of 3D visuals and ~mainstream~ gaming.  Whatever the case may be, those who still cling to their 2D ways, still remember the first time they saw Terry Bogard pull of his Power Geyser, and still trying to find some life to breath into the last Sega console, Fatal Fury: Mark Of The Wolves should not be passed up.", "date": "Dec 12, 2001"}