{"name": "Frogger's Adventure", "name_review": "Frogger's Adventure: Temple of the Frog", "ref": "https://www.ign.com/articles/2001/12/14/froggers-adventure-temple-of-the-frog", "text": "The Frogger rights have reverted back to their rightful owners, and Konami's using its muscle to send the little amphibian off on his first adventure on the Game Boy Advance. The company may have produced an awful traditional 3D platformer on the PlayStation 2, but we Game Boy Advance owners are the lucky ones, as the portable adventure is more rooted to the original, classic arcade game with its traditional traffic-avoiding gameplay and nothing more than that. The result is a great pick-up-and-play game for the GBA that's not exactly spectacular in presentation...but the classic design is plenty for a froggin' good time on the handheld. Features Five worlds 15 levels Battery Save (four save slots) Only for Game Boy Advance   Not that the game even needs a storyline...but the task in Frogger's Adventures: Temple of the Frog is to collect stolen sacred elements that will save the swamp from a certain death. Each of the game's fifteen different levels and boss battles requires the same up/down/left/right hopping that made the original arcade design such simplistic fun. But instead of swerving to miss vehicles on a busy highway, your travels will take you through caverns, ancient ruins, and even a few underwater levels avoiding enemies and obstacles that'll make the Frogger croak if they nail him.  If you've given Majesco's own Frogger 2 a few turns on the Game Boy Color, this game will feel very familiar since the gameplay in Frogger's Adventures is extremely similar. It just looks a whole lot more colorful...though some of the animations could have used a few more frames of polish during the death sequences.  But that's picking nits.  Frogger will have to pull off a few new techniques in his first Game Boy Advance design, including a superhop that will leap two spaces instead of one. Because this skill requires the toad to be facing the proper way in order to superhop, hitting the L and R buttons will rotate the little guy clockwise or counterclockwise so you're not leaping in the wrong direction. Easy as pie. But the levels certainly aren't, as you'll also have to traverse land that crumbles under your webbed feet, moving platforms, spiked floors...even out run a rushing torrent of water in a couple areas, all while avoiding the wandering snakes, trolls, and rolling boulders that'll flatten our poor amphibian if they get too close. The level design is challenging on the hand-eye coordination level...but there aren't too many ~puzzle~ type elements to tax the mind. It's all action, baby...and that's what makes it fun.  And, since no videogame is seemingly complete without a boss battle after every few levels, the designers felt it necessary to include them in Frogger's Adventures, too. The challenges here aren't any different than in the regular worlds, since, to succeed, you have to avoid hazards to gain access to floor switches that'll hurt the big, bad guys. Hit enough switches to knock out the boss, and it's off to the next world.  The designers added one element to insure that gamers inspect and traverse every inch of the level, but it actually backfires on them instead. To gain access to the last level in the game, players must locate at least fifty coins that are scattered all over the game's levels. When a coin is snagged, it's tallied into a counter up in the corner of the screen. That's all well and good, but here's the problem: you don't lose the coins when you lose all your lives and continue the level. So, when you start a level anew with a fresh set of lives, the coins reappear in the level...and you have the same amount of coins that you had when you died. So, in other words, you can easily rack up the fifty coins just by grabbing all the coins in the first level, then purposefully lose all your lives and restart the level...then recollect all the coins. Continue ad infinitum.  And that's a shame, too; one big blemish in an otherwise very solid and fun action title.  I really dig the classic Frogger, and I really dig this update. The game's a bit on the short side, but the ride to the end is an extremely fun one. I do wish the developers had incorporated some of the simple gameplay elements that were established in the Majesco sequel for the Game Boy Color...the ~best time per level~ feature, for example, could have added a bit more to this game's replay value. But overall, the Frogger namesake has been honored with another great handheld action game.", "date": "Dec 14, 2001"}