{"name": "NFL 2K2", "name_review": "NFL 2K2", "ref": "https://www.ign.com/articles/2002/01/10/nfl-2k2", "text": "Just because the NFL's regular season is over, that doesn't mean it's too late for Xbox gamers to get fired up all over again for NFL 2K2. When it debuted on the Dreamcast two years ago, the Sega Sports franchise was the first real challenger to Madden's throne with its solid and intuitive gameplay. Now in the year 2K2, NFL 2K2 arrives on the Xbox, as the first Sega title for the system, with the enhanced graphics and improved audio elements like you expect from Microsoft's console.   Rather than improving the areas of their NFL game that needed help -- like the franchise mode -- Visual Concepts instead built upon the game's strengths and focused on giving gamers more of what they've always liked about Sega football. The substance over style formula has always worked and will continue do so, but NFL 2K2 is screaming for a little more flash and glitter to go along with those meat and potatoes.   Features   Fully licensed by the NFL and NFL Player's Association Animated sidelines with chain gang, teams and camera crews Natural lighting effects Advanced playbooks and play calling system Realistic TV presentation with improved commentary, replays and telestrator usage Players with faces and facial animations New quarterback behavior system Revamped passing system    Gameplay In football videogames, the passing system is the most important element. You get the sense that the team behind NFL 2K2 worked on fine tuning the passing game before anything else when preparing their game to make the transition from Dreamcast to PS2 and Xbox. The passing mechanism is easy to learn and difficult to master, just what football gamers are looking for. The animation, pace of the game and passing mechanics all flow together so that you'll instantly know what's expected of you when you drop back to make a pass with your QB. Brett Favre is bound by the same rules as Jon Kitna, but you'll notice the difference between them when you play because one does everything with ease and the other has to make a perfect throw every time to complete the pass. This is how it's supposed to be done.  And the Maximum Passing feature which allows you to fine tune the throw to a specific place around the receiver is still one of the best inventions in videogame football.   The pass defense is just as sophisticated and advanced as the offensive system. Defensive backs make decisions to cover receivers a certain way and take away some options from the offense, just like in the NFL. It doesn't matter if you've got Favre throwing passes to Jerry Rice out there, if the DB is taking away the sideline, you're not going to complete a pass to the sidelines. You'll have to try something else.  As you become more familiar with the game you'll begin to recognize coverages and the routines of players on both sides of the line of scrimmage. This makes the passing game a never-ending exploration of NFL offensive theory.   The running game in 2K2 seems similar to the previous, Dreamcast versions of the game. It's not bad, it's just not as intuitive as it should be. I have no problem with a defense stacking the line of scrimmage and simply having more tacklers going against my blockers on a running play. But too often in 2K2, what should be a nice 5 yard gain ends up as a run for no gain simply because the blocking routines are too sophisticated for their own good. There are tons of no-talent running backs in the NFL who make it to the Pro Bowl year after year because they follow the basic rule of ~follow your blocking.~ So then in NFL 2K2, why do fullbacks and offensive lineman spend so much time changing direction and wandering around the line of scrimmage looking for somebody to block? This ends up being a great way for them to end up running into your ball carrier. This of course, only sets him up for a bone crushing hit from a speedy linebacker.   The franchise mode is as thin and undeveloped on the Xbox as it always has been on other systems. The question is why? As great as the between-the-lines gameplay is in NFL 2K2, it's not so great as to make it impossible to get some decent Franchise mode features throw in there. Again, this section of the game isn't as logical as it should be. The menus during the offseason where you're supposed to concentrate on building your team up for the next season, are difficult to understand, navigate and use. For example, when you propose a trade and the other team objects, rather than being able to fine tune the trade and perhaps switch the players involved in the deal, you have to back out of a couple menus and propose an entirely new trade with all of the new information. Free agency is simply take-it-or-leave-it shopping trip. There's no bargaining or haggling over years or salary like in real free agency. You simply see how much a guy wants and for how long and make a decision to pay him or not. Surely VC can do better than this on the Xbox.  The outstanding passing game in NFL 2K2 makes for some damn fine multiplayer gaming. Since games among friends usually degenerate into a hailstorm of Hail Mary passes, it's nice to have a solid passing system to support wide open aerial attacks. And by support I mean that NFL 2K2 will still force you to make some outstanding plays even though you're just playing with friends.  Graphics The first thing you'll notice about the looks of 2K2 are the player faces. They have them! Now every game has to make its leaps and bounds where appropriate and it just wouldn't have been right if Sega brought football to the Xbox with those strange blank non-faces we saw in Dreamcast's NFL 2K1 and 2K. They actually used photos of real NFL players when they could so that stars like Jerry Rice and Brett Favre really look like themselves. If you're some special teams scrub though, you'll just look like a plain old face in the crowd.   The player models aren't as angular and sharp as they have been in the past although you can still see their cubist roots if you squint your eyes. The uniform details are better than they've ever been right down to the Korey Stringer memorial ~77~ patches on Minnesota's uniforms.   The animations are all effective although still a little unnatural. They move so quickly it can look a little herky jerky at times. Edgerrin James doesn't run with a herky jerky style in real life. Some guys might, but not everybody should run like that. Actually, the animation suffers from the same problem as the player models and other visual elements: they seem limited by NFL 2K2's Dreamcast roots. Meaning that the players and animations look  more or less like they did on Sega's machine, but the additional power of the Xbox has made them look and move as well as possible.   The camera work especially in the replays is excellent in NFL 2K2. Seamless transitions and optimal angles that would make directors at ESPN jealous will have you smiling from ear to ear. Plus there's great commentary to go with those replays.  Audio  In fact, NFL 2K2 has the best commentary in a football game to date. You can have all of the professional announcers you want, but they can't hold a candle to Dan Stevens and Peter O'Keefe. Their insight and interaction with each other is genuinely interesting but the best part is they actually comment during replays and talk about what you're seeing. That's a feature most of us remember from watching football on TV, it's amazing that up until now, guys like Madden and Summerall have yet to say anything about what we're watching during those automatic replays.   The player chatter, where they call one another out by name, is still there and very welcome on the Xbox. Even if they do all sound like the same guy, you'll find yourself turning up the player chatter volume on the options menu.   The crushing hits and grunts of players is all good stuff as well. The crowd even seems to be an educated football crowd, booing and cheering in time with the action on the field.   NFL 2K2 is a competent entry in the Xbox football derby along with Madden, Microsoft's resurrected NFL Fever franchise and any other football title that may come along. Its combination of pick-up-and-playability and decent gameplay should make it very appealing to Xbox owners. But the problems of the game add up in a hurry. Beginning with its outdated rosters and team ratings (ie. Pittsburgh and Chicago are poorly rated, New York Giants are great) all the way through to its underdeveloped Franchise Mode, 2K2 does many things that will justify you waiting until next year's NFL 2K3.If you love the series and want to see how it turned out on Xbox, NFL 2K2 is worth the purchase. It can't match the polish and NFL intricacies of Madden and doesn't look as good as NFL Fever, but it has the middle ground locked down.", "date": "Jan 10, 2002"}