{"name": "Universal Studios Theme Park Adventure", "name_review": "Universal Studios Theme Park Adventure", "ref": "https://www.ign.com/articles/2002/01/10/universal-studios-theme-park-adventure", "text": "from unknown developer Nai'a Digital Works and publisher Kemco Entertainment, takes players on a day-long stroll through the attractions destination of the same name. Using a combination of pre-rendered backgrounds and fully 3D mini-games, visitors can explore the massive park, collect money, earn stamps and caps and try the rides. It all seems well rounded enough.   But what succeeds in theory fails in execution. Universal Studios is a clunky, disorganized mess of a game complete with unclear goals, a sloppy navigation and map system that barely works, and a slow pace. The visual presentation, which is more befitting of a first-generation Nintendo 64 game in its barren environments and simplistic, blurry textures, seems to suggest that this is a game for kids. And yet, the entire setup for the T-rated project -- confusing and disorienting -- comes as a complete contradiction to its style.  The Facts  Spend a day at Universal Studios and enjoy the rides Play as one of six different characters  More than eight different rides to choose from  Receive hints and guidance from cartoon character Woody Woodpecker  Answer hundreds of trivia questions  Solve special puzzles  Collect stamps to unlock new areas  One and two-player games   Gameplay There really isn't a whole lot to Universal Studios Park Adventure. Players pick a character (there are several with different ethnic backgrounds) and enter the park. Woody Woodpecker greets visitors and explains that they are free to explore the park at will. The idea is to find the different rides, go on them, and earn points and stamps this way. The problem is that most of the rides in the park are initially locked (Woody says there are too many people in line), which leaves players to find ways in. Special caps (hats) can be purchased for each ride, which enable players to enter them at any time, but these cost thousands of points. And so there are various ways of coming by the money. Picking up garbage around the park and throwing it away results in extra points, as does winning a bout of movie-related trivia. So on, etc., and so forth. This is all fairly basic stuff as far as videogames go. That's not necessarily a bad thing either, it's just not terribly refreshing.  The main character, who is controlled with the analog stick, searches the park via a series of pre-rendered scenes a la Resident Evil, except nowhere near as inspired. Players can press the A button to interact with the various people that frequent the park, most of whom offer up sentences such as ~This is exciting!~ or ~Everything here is fun!~ Finally, the X button brings up the map (once players have found it), which is pretty much the most useless thing ever given that it attempts to 3D-ize a series of pre-rendered scenes and fails. Control is simple, but responsive. Picking up garbage is incredibly easy, as is interacting with people. But like the rest of the adventure, it's far from deep and running blindly between rendered backdrops can and does grow tiresome.  The rides themselves, unfortunately, aren't much better. There are at least seven, each of which offers a different play style than the rest. The Jaws attraction, for example, pits players on a sailing boat as the giant shark attacks, the idea being to throw crates into its mouth as it approaches the boat. It's easy and boring. The Jurassic Park ride is on rails, and sees gamers targeting and shooting at the T-Rex, velociraptors, and pterodactyls, while racing from them on a jeep. The targeting system is buggy and sometimes doesn't seem to hit the dinosaurs as they come at players, which is annoying, but even with that the task is generally -- wouldn't you know it -- easy and boring. The Back to the Future ride is kind of like a 3D racer; players must speed after Biff Tannen in his DeLorean through different time eras from the ice age to present day. Easy and boring. Then there is the WaterWorld Adventure ~ride~ which, it turns out, is nothing more than a badly rendered FMV of a craft crashing into some water. The good news is that players get to choose which seat in the audience they'd like to view the action from. Easily the best ride in the game -- and only because it offers more control freedom -- is the BackDraft Experience, which lets players run through a burning building putting out fires and saving innocents. Clearly this is stuff for kids.  And yet, kids will find many of Universal Studios Theme Park's intricacies a turn off. For example, the Trivia Quiz, a touted feature of the game, asks questions that will almost always be too difficult for young players. ~How many members made up the team of Sneakers?~ We're guessing that not many five-year-olds are major Robert Redford fans. ~In what year was Universal Studios Florida Built?' Again, this is probably not information that Little Billy is yet privy to. And these are some of the easier questions. But beyond that, the setup of the park itself is disorienting. Three qualified IGN editors working together could not figure out the map system of the game so that we could get to the E.T. ride. And given that most of the rides are initially closed, we don't believe child gamers will have the patience to pick up garbage and answer trivia questions in order to first find Woody Woodpecker and then purchase a cap. Meanwhile, adult gamers won't want anything to do with the game's tired play mechanics and outdated visuals. Which leads us to...  Graphics Beautiful, sparkling effects, glossy characters and outstanding lighting. But enough about Universal Studios Theme Park's box art. Let's focus on the actual graphics of the game, which unfortunately aren't up to par (with most N64 or PSX offerings). Instead of creating a fully 3D park for players to explore, developer Nai'a Digital Works instead went with pre-rendered backgrounds. While they generally have a blurry look about them, the backdrops get the job done, delivering enough detail for us to recognize key areas of the park. We see different themed locations from western world to Jaws land and so forth, which look respectable, but not exceptional. Polygon characters featured in the foreground of the backdrops, though, seriously lack detail and animate with a robot like fluidity, which is unacceptable. The fully 3D environments, look like something out of a bad N64 game -- typically exceedingly blurry textures and very little in the way of geometry make up most of these lifeless areas. And believe it or not, the framerate sometimes suffers too. Very unimpressive.  Sound The music in Universal Studios is licensed and therefore for the most part acceptable. It is usually based on the movies the rides mimic, except compressed. Speech is limited, but Woody Woodpecker does talk occasionally to explain something and while he sounds a little goofy and again a slight bit compressed, most people probably won't mind. Some of the sound effects, however, quickly become repetitive -- the roar of the T-Rex for example. All in all, though, not a terrible audio experience, but not a memorable one either.The best part about Universal Studios Theme Park is the Trivia Quiz portion of the game -- and that's clearly something for adult players to enjoy. The rest is a jumbled mess of disorganized goals, sloppy navigation and boring destinations topped off with incredibly dated graphics and an overall adventure that can fairly easily be beaten, if one has the stomach for it.Not recommended for young or adult gamers.", "date": "Jan 10, 2002"}