{"name": "PaRappa the Rapper", "name_review": "Parappa The Rapper", "ref": "https://www.ign.com/articles/1997/11/19/parappa-the-rapper", "text": "It isn't very often that a game like PaRappa finds its way out of the great cookie-cutter factories they call games development houses. For quite a while Sony was unsure if it should release PaRappa here, fearing US gamers wouldn't find the game as amusing as they did in Japan. Whether it actually does catch on remains to be seen, but if I have anything to do with it every PlayStation owner will soon be rapping along with PaRappa.  The game concerns PaRappa (a rapping dog) and his multi-specied friends PJ Berri, Sunny Funny, and Katy Kat. Appearing almost more like a cartoon than a game, it chronicles PaRappa's life, including his fascination with Sunny Funny, a sunflower. PaRappa faces the same    kinds of hurdles most teens do -- learning    courage, getting a driving license, going on    dates -- but the way the game is presented is what makes it so intriguing. All of the characters are flat like slips of paper (indeed PaRappa means 'paper thin') and look like they've been run over by steamrollers, Tom and Jerry style. It's very odd but cool at the same time.  However, the meat of PaRappa lies in the rapping segments of the game. To get to the next stage, you must mimic a number of teachers, including an onion-headed karate master, a Rastafarian frog, and a moose that sounds a lot like Queen Latifah. Rapping is accomplished by pressing the correct buttons at the correct moments, all in time to the music. It's easy at first, but gets more and more difficult as the game goes on.  While the words may seem a little strange next to folks like the Wu-Tang Clan, remember this game was made in Japan. However, this just ads to the quirky nature of the game. The music is top-notch as well.  PaRappa's only real problem lies in the length of the game -- it's way too short. However, once you've beaten it in good standing, you can ad-lib, or 'freestyle,' in the levels. This adds to the replayability of the game. Plus, it's worth playing again just to hear the great music!  PaRappa isn't for everybody. It's very silly and odd, and somewhat childish. But if you're the kind of gamer that still watches cartoons, you may just fall under the spell of PaRappa. I know I did. I gotta believe!  Adam Douglas", "date": "Nov 19, 1997"}