{"name": "Mobile Suit Gundam: Zeonic Front", "name_review": "Mobile Suit Gundam: Zeonic Front", "ref": "https://www.ign.com/articles/2002/01/24/mobile-suit-gundam-zeonic-front", "text": "Zeonic Front, if nothing else, is proof positive that nobody in Japan has ever played Rainbow Six.  Bandai's new game of squad-based tactical mecha combat replicates Red Storm's PC favorite down to all its various design flaws, so that in between the undeniable satisfaction of a plan coming together, there's also the goofed-up navigation system, the scattershot AI performance on both sides of the firing line, and the generally clumsy and slow pace of combat.  Curiously, Japan's major critical organs didn't seem to notice much of this -- Famitsu Weekly awarded the game one of its highest possible scores -- so like I say, you can tell that R6 never made much of a dent across the Pacific.  But anyway, as Rainbow Six was a good game, so too is Zeonic Front, with a little extra on the side.  It actually does tidy up some of the problems that result from bringing this game design over to a console, by switching to a third-person perspective and adding some friendly auto-aim commands, and of course, it also has the cachet of the Zeon mecha's fundamental coolness.  Those who have not followed Mobile Suit Gundam may ignore this discussion, and indeed much of this review, but it has to be said that, despite the billions of civilian casualties in the opening salvo of the One Year War, the Zeon always had a lot more style than their purportedly morally superior opponents.  Sharper uniforms, cooler mobile suits, the snappy ~Sieg Zeon!~ catchphrase, all that fun stuff.  On the other hand, its strategy is more than a little arbitrary, its interface is often dense and unfriendly, its graphics don't measure up even to the slightly above-average Journey to Jaburo, and Bandai hasn't got its mission designs together half as well as Red Storm has.  Zeonic Front is still a ~fans-only~ game, just one that's tolerably so, a la Gundam: Battle Assault.  Bandai is making better games in the last little while, but Rome, as they say, wasn't built in a day.  Gameplay  If you have played Rainbow Six or its assorted descendants, you know how this bit goes.  Zeonic Front is a 3D action game with an extremely heavy tactical bent, requiring that you manage up to three mobile suit teams both before and during a mission, planning out their routes and tactics in advance and adapting during battle to the conditions you encounter.  This is accomplished through a waypoint-based navigation system -- you design the path you want a team to follow by connecting the dots around a map, and picking out particular points along the way where they should accomplish certain tasks.  Just as in Rainbow Six, this works well enough, although you never have as much control over your teams as you want.  That's part of the game's strategy, though -- you need to learn how to direct the AI instead of trying to treat this like an action game and micromanage everything.  The route planning system is rather daunting when you first get a look at it, especially since the game doesn't do much to teach you how to use it, but after a little trial and error, it's possible to make a big difference in a mission's success or failure by tuning the routes of your AI-controlled teams.  The same goes for the in-game interface, with its many command sub-menus.  It takes time to learn, but works well enough once you have the hang of it.  Where I find trial and error a little less acceptable is in Zeonic Front's mission design.  This is one of those situations where obeying basic strategic principles will not necessarily get you anywhere.  Rather, you need to learn the game's unique strategic principles (which don't necessarily correspond to anything you've learned anywhere else), and more specifically, you have to learn the strategies that will win each mission.  After four or five of the easy initial sorties, the game becomes very difficult, and the only key to success is learning what specific strategy you need to use in each mission.  Some of these are often highly counter-intuitive -- you have to sacrifice a certain unit at a certain time, use a specific support item without any advance indication that you need it, retreat for no reason from attacking units, and so on.  Playing something like Rogue Spear or Ghost Recon is generally much more rewarding in this area, because the game and the missions are designed such that learning consistent, logical strategic principles will lead you to victory each time out.  Zeonic Front is more frustrating in this regard, since death is generally attributable simply to not having played a particular mission enough.  It can also occasionally be chalked up to the control scheme, although if you accept the limitations designed into it as part of the game's basic concept, it works well enough.  This is not Journey to Jaburo by any means -- your mobile suits move slowly, aim somewhat inconsistently, have extremely short range for the most part, and can't do any of the blazing-fast stuff that Char always got to pull off in the TV shows.  If you accept that fact and learn to build your strategy around the controls' limitations, you should be fine, but it must be noted that those expecting a straight action game here will be sorely disappointed.  You also need to remember that the Zeon line forces were mostly cannon fodder in the old TV show, and Zeonic Front is balanced exactly that way (again oddly echoing Rainbow Six).  You may mock the Guncannon's primitive looks, but it'll blow your Zakus to hell before you get anywhere near in range.  Those who like a strategic experience and like Gundam, though, will probably have a good enough time.  Zeonic Front features a wide variety of missions, from assault to defense to escort to intelligence-gathering, and plenty of different ways to customize your mobile suits.  Only four basic suits are available -- Zaku I, Zaku II, Gouf, and Dom -- but you can kit them out with a wide variety of different weapons and support items.  Cloaking devices can fool enemy sensors to great effect, even if that old trial-and-error is usually needed to get the right one, and a whole toybox full of decoys, grenades, and mines can serve other useful purposes.    Graphics  Imagine MS Gundam: Journey to Jaburo run through a bit of a blur filter.  The mobile suits all look like they ought, and there are some neat animations connected to strategic commands -- hand signals and the like -- but they're still a trifle fuzzy around the edges, with lots of low-res texturing, and the battlefields around them are markedly unassuming.  The background fogs in at a relatively near distance, and even when you see it, it doesn't look like much.  Level texturing usually revolves around one or two basic shades, brown being a particular favorite.  Things get a little more exciting when battle is joined, thanks to smoke effects and lighting from explosions and muzzle flashes (nice spent shell animations pouring out of those Zaku machineguns, too), but that occasionally comes at a slight cost in framerate when something particularly exciting happens.  It's great fun to blow up one oncoming Guncannon and have the graphics blip just enough that the distraction lets his wingmate get you.  The fundamental coolness of many of the visual designs here helps make up for technical failures, though.  The old Zaku II is still a classic creation, as are many of the lesser-known Zeon support units -- those funny-looking tanks have aged oddly well.  Charlotte the operator sure is cute, too.  Sound  This game definitely blows stuff up real good.  When the dreaded signal ~Blue Leader Crash~ appears across the screen, signifying the death of your lead team commander, the metaphorical crunch of your plans falling to pieces is echoed very nicely on the soundtrack.  There are similarly authentic and impressive sound effects for the Zaku MGs, assault rifles, and bazookas, both their reports and the sounds of their impacts.  Unfortunately, the musical score here isn't much at all.  It's played very quietly most of the time, and even when you can hear it through the thump of MS feet, it doesn't rise above the level of average-sounding rum-dummy-dum military themes.  ~Average~ also precisely characterizes the voice acting in most places.  The actors have decided to play it very safe, adding minimal inflection to most lines.  Even when the Earthnoid scum are breathing their last as you roast them alive in their mobile suits, they can't seem to muster an awful lot of enthusiasm.  Here and there you can find characters that are a cut above, though -- Kai, the uptight Guncannon pilot from White Base, manages to amuse on the occasions that you encounter him.The long and the short of it is that the license is still having to carry Bandai's games.  The difference between now and some of the bad old days is that it's not quite collapsing under the weight anymore.  Zeonic Front does not break any new ground, and it is certainly not recommended to anyone who's not a fan of the series, but at least it will entertain those who are amused by the prospect of playing as the bad guys.  Yeah, it was a shame about all that nerve gas and the colony drops, but dang, that Gouf Custom sure looks cool.This one's worth at least a rental for Gundam fans, then, and lucky enough, they probably won't manage to beat the balance of the missions before they have to take it back.  There are 13 in the main tree, with more hidden missions to play through afterwards and locked options to add value to another trip through the story mode.  Just don't start yelling ~Sieg Zeon!~ around the house, kids.  Your mother might start to worry.", "date": "Jan 24, 2002"}