{"name": "Car Tycoon", "name_review": "Car Tycoon", "ref": "https://www.ign.com/articles/2002/01/26/car-tycoon", "text": "Here it goes. My time to come out of the closet and open up to my friends in the gaming world has finally arrived. I have to confess -- I like economic sims, and I'm not ashamed to admit it! Go ahead, say it: ~Tal, you're a dorkus malorkus.~ There, now don't you feel better? Yes, I find it entertaining to build my own digital corporation and crush all those that refuse to bow down to my economic might. Hey, it's just another day in the life of my virtual CEO, Miguel Morrissey-san, President of Everything. And while the hey-day for the economic/business sim was arguably the mid-90s, we've seen a golden resurgence of sorts recently with the release of games like The Corporate Machine and Capitalism II. With that said, I was hoping that Car Tycoon would bring back fond memories of one of my favorite classic business sims Detroit, another game influenced by the auto industry. Instead it just turned out to be a mess that more resembles a disjointed 47-car pile-up more than a well-tuned hotrod.  In an odd paradox, Car Tycoon is both oversimplified and too complex at the same time. Simplified because the game doesn't give you that many options. When you begin the game you pick the color of your corporate logo. Unfortunately, all of the cars you make have to be the same color, so there's no variety in the look of your mighty auto fleet other than body style. Adding to the cookie-cutter feel of your cars is the fact that you can't rename your cars, even though the manual suggests otherwise. I tried and tried and tried and all I could get was for the damn field to read ~new car,~ but every time I would try to type my own car name like the ~Impaler~ or my all-time favorite ~Thunderturd,~ it would just revert back to the prescribed name.  Okay, so both the color and naming problems are minor (yet annoying) points of criticism, but the whole game is full of little things like that which take away from the enjoyment because your options are so limited.  The most obvious is the lack of enough stats to actually evaluate your business performance effectively.  Economic simulations should be filled with numbers, charts, graphs, and stats, but it feels all too often in Car Tycoon that you're just making blind decisions with no basis. Wondering how many models you sold last month so you can get an idea of what models are trendsetters? Well too bad, chump! There's no way to tell in Car Tycoon because all you get is a watered-down annual report on your progress. Wondering why a particular model is selling more than another? Shove it in your keyhole, sparky! There's no way to tell because you don't have any consumer statistics to look at. Again and again you're left wondering why you're doing so well (or, as the case may be, poorly) because of the lack of enough data to make this a true economic simulation.  The complexity of the game comes into play with the mechanics and poor design decisions. As if the lack of stats wasn't enough, trying to figure out exactly what everything that is in the game does is frustrating, and the flimsy manual offers little help. Instead of explaining how to operate many of the game's various components, the manual only offers descriptive accounts of what each can be used for with no concrete details of just how to perform the actions. I still have no idea how to actually deliver a large order of cars to a big customer, how to see how much money I have in the middle of an auction, or how to define the number of cars go to a particular dealership -- or if these, what I see as basic and logical options in an economic automotive simulation, are available at all.  The game also lacks focus and rationale. For example, there's a stock market component in the game, but absolutely no explanation as to why you should play the market or how the stock prices are affected. There might as well just be a roulette wheel for you to wager money on, make the stock market more in-depth, or make an entirely separate stock market game called Stock Market Tycoon (I've already copyrighted it, so don't even think about it). On a similar note, you can click on the houses in the neighborhoods surrounding your dealerships to see the inhabitant's income, but there's nothing in the manual or game that explains how their income affects the game whatsoever. You can assume the richer neighborhoods will buy more expensive cars so your dealerships near those neighborhoods should carry more expensive cars, but that theory didn't work in practice, so more often than not I was just left scratching my head and wondering why these components were even there.  On a high note, there is a lot to do in the game. You can play 20 different scenarios or opt for open-play from 1950 on, but who cares considering it's nearly impossible to finish a game problem-free? Car Tycoon is so riddled with bugs that you can rarely get far into it before the game freezes or, heaven forbid, crashes your computer. And on more than one occasion I've lost all of my progress in a scenario because the save game was stuck in a permanent pause mode when I loaded it up. To make matters worse, all of the bug pop-ups are in German. Cryptic bug reports are hard enough to understand when they're in your native tongue, but trying to figure out exactly what happened when all you have to go on are messages like ~ist kein gueltiger Integerwert~ and ~Zugriffsverletzung bei Adresse 004534F8 is Modul 'CAR_TYCOON.EXE.' Lesen von Adresse FFFFFFFF~ will leave you searching for das Verzeichnis.   I played the game on three separate systems and I ran into numerous bugs on all of them, and the game crashed multiple times on all of the test machines. Not only should these fatal bugs have been caught before release, but the fact that the team didn't even bother to fully translate from German leads me to believe that compatibility wasn't exactly a pressing issue for Fishtank. This coupled with incredibly long load times (we're talking over a minute on a 1GHz machine with 512MB RAM) makes Car Tycoon more of an exercise in frustration more than a sound business sim.  My mother always told me not to leave without saying something nice (what she actually told me was ~Shut up; you're embarrassing me,~ but I think knew what she really meant). Although it's hard to find much good in Car Tycoon, I will say that the tunes -- which range from surf to jazz to semi-industrial -- are catchy and fit well with the different time periods. But good music certainly isn't enough to carry this buggy, poorly designed, mess of a game which should have never made it through QA.  -- Tal Blevins     Want to share your opinions with the world? Talk about it on the IGNPC message boards,  or send some mail to IGNPC about this story.", "date": "Jan 26, 2002"}