{"name": "AirBlade", "name_review": "AirBlade", "ref": "https://www.ign.com/articles/2002/01/29/airblade", "text": "Airblade shows the developers of Criterion Studios getting a fair bit better at this hoverboarding concept they're so fond of, but they're not quite ready to graduate yet.  The sacking of their earlier game's racing elements is a big step in the right direction, followed up by a switch to a Tony Hawk-style stunt emphasis, but the design of Airblade's main single-player story mode pulls the game back just a bit.  The levels and objectives lock a game that should offer an unprecedented degree of freedom into a frustrating series of linear challenges.   Mind you, Criterion gets summa cum laude in the technology department.  This is a brilliant advertisement for the Renderware graphics engine, which no longer inspires giggles around the office when we see it in press releases.  Airblade runs as smooth as you please in the single-player mode, never draws in a thing, features respectably sharp texture detail improved by remarkable lighting, and includes more than a few superb animations for its trick-styling hero (please forgive me for that one, I just couldn't resist).  This was good-looking when we saw it at the last E3, and it's still good-looking now.   It is still not quite fun to play at times, though, and that will always be what matters.  Airblade is a respectable contender, and offers something very different with its floaty, free-form trick control, but Tony Hawk 3 still gets to own the skatepark for a while longer.   Gameplay  Airblade places you atop a widget that bears the game's title, a board what hovers (or hoverboard, if you like).  There is a long story to the game about how it houses an experimental anti-gravity power generator or somesuch, but it's easiest to just think of it as the scooter toy from the second Back to the Future movie (Airblade feels more than a little like an homage to that particular sequence now and again).  In videogame terms, it controls like Tony Hawk's skateboard, with a few important differences.  Floating above the ground means you don't necessarily need to ollie to perform tricks, you can swing from poles (more on this later), and in general it's a good deal harder to crash, despite what I'd think would be terrible balancing difficulties.  Miracle of modern technology, perhaps.   The method in Airblade is to jump, grind, and trick about the obstacle-strewn levels, which is a familiar concept, but the goals are not necessarily familiar at all.  The core of the single-player game is the story mode, where you control a nimble-footed freedom fighter in his quest to escape the corporation that wants the hoverboard back.  In practical terms, this means accomplishing what are almost platforming challenges, requiring that you follow certain lines to hit, swing, or grind objects around the six different levels.    Is this fun?  To be honest, at times it feels like an extended version of the training sequences in TrickStyle.  You are presented with one challenge at a time and minimal instructions on how to accomplish the less obvious goals, which frequently means running up against a wall as you fumble around the level to find out which line completes the current task.  Some goals are married to extremely convoluted and counterintuitive setups, one slip during which sends you back to the beginning of the line -- and maybe you were trying the wrong line all along.  It's great fun when a plan finally comes together, but the frustration factor beforehand can get pretty rough.   This would be no problem if there was something else to do while you worked on that line.  That's how Tony Hawk handles things -- if you can't get a particular secret tape or what-have-you, you can almost always address yourself to some other challenge and come back to that hangup later.  Most of Airblade's goals are presented in linear fashion, though, connected by cinematics and event triggers, so there's just that one goal to bang your head against, and the clock ticks away all the while.  The punishment for running out of time?  Going through the motions of all the completed goals after you're forced to restart the level.   Airblade is much more fun in the freestyle and score attack mode, which offer many more opportunities to appreciate its trick system.  It's a good deal like Tony Hawk, but with enough kinks thrown in to make the business of combo-ing around a level entertaining, especially once you learn how to use the advanced tricks (double- and triple-button taps) and the long-distance lines that the grab-and-swing maneuver opens up.  There's also a very free stunt attack mode, with Tony Hawk-style objectives presented in more friendly fashion, but you have to beat the story mode to unlock that.  Two-player multiplayer games are hampered by a drop in framerate, but these are still a good time, especially Ribbon Tag, where ~it~ drags a length of police caution tape behind him.  It gradually grows longer, making it harder for ~it~ to keep ahead of the chasing competition.    The story mode is where all the unlockable goodies are hidden, though, and the aggravation factor there overshadows the fun of just scooting around town.  There should have been more rewards for success in the freestyle modes -- that's where players' skills and the real potential of the trick system are tested.  It's also disappointing to see only six levels, one of which is a linear racetrack/obstacle course.  The potential of the basic game system here is great, but needed to be let loose by more and better level design.   Graphics  Like I say, no more cracking jokes about seeing that barking-dog logo on Winning Eleven and Grand Theft Auto -- Airblade showcases an engine technology with all kinds of fine qualities.  The texturing is strong, with plenty of variety around each level and a surprisingly high level of detail (lots of weathered surfaces and bits of graffiti here and there).  Fine lighting effects add another layer on top of that, especially in nighttime levels lit up by streetlamps here and there, and there are some cute blur filters on cinematic sequences.  The passersby don't look all that hot, but our hero (or heroes, once you unlock new player models) has decent detail all round, and the trick animations are great.  Board and rider alike flip and spin with ease, and the hoverboard leaves neat little contrails from either end.   The framerate never fails in the single-player mode, but it takes a big hit in the split-screen game.  It's possible to get used to the slowdown, since the game still runs fairly consistently at the lower rate, but it's more than a nagging problem.  The other major issue with the game's visual presentation is how the camera behaves.  It doesn't snap behind the main character in quick direction changes, forcing you to slow down and wait for the perspective to drift back around, and long falls, especially near tight corners, can produce all kinds of vertiginous nonsense.  I can't reliably re-create the effect, but every so often the camera will even decide to rotate around the long way, displaying the game upside-down for a few seconds.  Even if you don't necessarily get sick playing 3D games, this one may do it to you.   Sound  At times, we dread the arrival of European games at the office, but Airblade pleasantly eschews the tradition of UK trash-techno.  The beats here are all original and very pleasant, blending long mellow stretches with occasional blasts of rapping and guitar thrash.  All the music suits the character of the game very well, bobbing and drifting along between the occasional moments of big air, big tricks, and big drops (whoooah, the camera's upside-down again...).   It's hard to say whether the voice-acting is silly -- it may be the acting, or it may just be the story that spawns these lines.  Probably a little bit of each.  In any event, the cinematics don't take up much time in between bouts of slogging away at the latest round of challenge lines, so the worst acting possible couldn't bring the game down all that much.The story mode's level design is another matter, though.  No, I'm not saying it's the worst thing possible, but it does bring down a game that might have been a lot more fun with a broader focus.  Why not go back to Trickstyle's competitive design, and just throw out all that appallingly annoying race nonsense?  With these graphics, this control scheme, and pure trick action (plus more intensive line design in the levels), we could have something pretty special.Unfortunately, we just have something that's pretty good.  By all means give Airblade a try, but it's not something that gets the unequivocal dive-in-without-hesitation recommendation.  Pity we can't give that one out more often...", "date": "Jan 29, 2002"}