{"name": "Expert Pool", "name_review": "Expert Pool", "ref": "https://www.ign.com/articles/1999/09/23/expert-pool", "text": "In the beginning, the big goal in billiards simulations was to try and recreate the actual physics of the game as accurately as possible. With the release of Interplay's Virtual Pool that goal was achieved and pool simulators reached a level of realism that had only been dreamed of a few years previously. With this success though, came the realization that in order to deliver the full experience of a good round of pool, developers would have to provide some of the atmosphere that surrounds the game. With their latest release, Expert Pool, Psygnosis has managed to move along way towards this new goal, providing not only a load of different table styles and play locations, but also a huge number of different opponents, each with their own AI routines.  Let's take a look at the basics. Expert Pool offers up 19 different games: 9 Ball, Straight Pool/Continuous, Rotation, 3-Ball, 6-Ball, 10-Ball, Four different versions of 8-Ball (Professional Tournament Rules, Tournament Rules, US Bar Rules, and Euro Bar Rules), Bank Pool, 1 Pocket, Speed Pool, Bottle Pool, Cutthroat, French Billiards, Straight Rail, Cushion Caroms and Pocket Billiards. Within each game there are a handful of options like Illegal Shots, Elimination, Pocket Nomination, and Ball Nomination that can be turned on or off to tune the game exactly to your skill level. Each round can take place in 13 different settings, ranging from Ed's Billiards, a local hang out all the way to The Dome, the place to go if you're looking for the best competition. Each of the tables in these different settings play just a little bit differently as well. Adding even more variety to the game options is the fact that there are close to 200 different opponents that each offer up their own specific style of play. There's also a mode that will teach you how to set up and sink several different trick shots.   Once you actually start playing the game, you'll probably find it similar to, but just as good as every other serious pool sim out there. Control is well laid out and will take most players only a few minutes to understand. Unlike THQ's Ultimate 8-Ball, which made aiming with precision somewhat difficult due to its constantly tight mouse control, Expert Pool offers two different levels of aiming, one that changes the cue angle quickly (which is designed for setting up your shots) and one that makes very small changes (which is used for making the final touches on your shot). All of the computer opponents in the game are very challenging (perhaps a little bit too much so in the very beginning), and move very realistically in the various game environments for the most part. I did find that the game suffers from occasional clipping problems where you'll see one of the players' sticks going through the wall of the table, but this a completely cosmetic problem and doesn't really affect the way the game plays out. The one problem that I did have with the game's interface was the difficulty of setting up shots that require you to hit the cue off center. It's not that I didn't know how to do it, but the fact that it took a little while to pull off made me skip using it in situations where I should have. This may just be my inherent laziness at work.  Expert Pool also looks a hell of a lot better than its competition. All of the game's characters and locations looked fantastic and moved just as well. Ball motion also looked good, and there were never any of those moments (that happened all too often in both Ultimate 8-Ball and Virtual Pool 2) where what seemed to be a missed shot would suddenly disappear into the pocket. Unfortunately, the game's sound wasn't quite up to the same level. While the soundtracks for the various locations were solid (if a little bit bland), the in game speech repeats itself all too often and gets pretty annoying pretty fast. I turned it off after Steve threatened to kill me if he heard the phrase, ~Would you look at that, it's a scratch,~ one more time.  Expert Pool also offers up three different multiplay options, all of which work very well. In addition to the standard Local Multiplay, where all players take turns shooting on the same machine, the game also offers a LAN option and Internet play through GameSpy. All of the games worked well and we never experienced any slowdown issues no matter how many player we piled into a game.  There's no doubt that Expert Pool is an excellent pool simulator, and I would recommend it to just about anyone who's interested in the sport. It out performs THQ's earlier release Ultimate 8-Ball on just about every level (except it doesn't include any of the oddly shaped tables) and is miles beyond the last generation of Interplay releases.  -- Trent C. Ward", "date": "Sep 23, 1999"}