{"name": "WWE Raw", "name_review": "WWF Raw", "ref": "https://www.ign.com/articles/2002/02/08/wwf-raw", "text": "If you're going to have The Rock by your side, as Bill Gates did when he unveiled the Xbox at the 2001 CES, then you know the first WWF game for the system had better kick cosmic amounts of ass. It was THQ's mission to publish such a game and they made an extremely wise decision to have Anchor develop WWF Raw. The Tokyo-based company created the well-received Ultimate Fighting Championship on Dreamcast and their experience with realistic models and detailed grappling animation shines through brilliantly in their first WWF game.   The wrestling engine will remind many fans of the Aki/Asmik wrestling games on the N64, but with so much more polish and other Xbox enhancements the experience will feel more realistic than ever before. However, Raw's weaknesses as a first generation Xbox title are apparent with one glance at the main menu.   In writing our review of Raw, we've enlisted the help of Masahiro Onoguchi, the Chief Development Officer at Anchor Inc. Onoguchi took the time to share some of the finer points and background info on Raw with us and we'll include his comments where appropriate.   TV-style presentation with in-game cutaways and ~Double Feature~ replays, dynamic lighting effects and fully scaled arenas. Hundreds of WWF signature moves and animations Assault wrestlers on their way to the ring. A first in wrestling games. Create-a-Wrestler Multiple modes including six man Royal Rumble and King of the Ring tourney. Authentic entrances with Titantron videos Four player tag team, handicap and triple threat matches.   Gameplay Raw features a very refined grappling system that's much more fluid and responsive than any wrestling game to date. Furthermore all moves are limited by the amount of available ~energy~ your wrestler has at any given moment. So rather than a strong or weak grapple and a full complement of moves for each, your wrestler has one grapple and it's up to you to know if he or she has enough energy to pull off the move you want. Logically, simple moves out of a grapple like a slap or a chop to the chest don't require much energy. Bigger moves like a sidewalk slam or a stalling brainbuster take more juice and if your wrestler doesn't have it, the grapple will be broken by your opponent or even countered. This is a great innovation that forces players to strategize rather than just drop a dozen piledrivers on an enemy.   Everything you do uses energy in Raw and you'll see the bar moving back and forth near his or her feet. The variety of striking moves you have at your disposal use up a little energy. Running by double tapping on the D-pad or leaning the left analog stick uses energy. Picking up a table and swinging it takes way more energy than picking up a sledgehammer and swinging it at somebody. You can swing a chair until your wrestler runs out of energy, usually 5 or 6 blows, and then he'll drop it. Energy replenishes in less than one second as soon as you stop moving and give your guy a chance to recover.    The box at the end of your energy meter functions as a health indicator too, but you'll only notice it when you're taking a beating. The faster it blinks the more vulnerable you are to a pin or submission attempt. You want that box to stay solid and not blinking at all.  Raw does a brilliant job of incorporating the crowd into the play mechanic. No you can't fight in the crowd but the crowd approval meter at the bottom of the screen is just as significant. Through out the ups and downs of the match the colored bars matching the colors of the different wrestlers will grow or shrink in relation to how the crowd feels about you. You cannot pin somebody that the crowd likes. Charismatic wrestlers like The Rock and Stone Cold Steve Austin pretty much have the crowd behind them no matter what, so it takes one hell of a beat down to pin those two. Snore kings like Steve Blackman rarely get much crowd support. The key is getting the crowd behind you by executing a variety of moves and attacks and building their excitement level until your crowd meter starts to flash. This is when you can pull of your signature move and really send them through the roof. If the crowd is behind you and the other guy's health box is blinking you're ready to get the pin. But for you sadistic sickos out there, the crowd will turn on you and start rooting for the other guy if you over do it and keep beating the crap out of a guy when he's already ~pinnable.~  The item system in Raw might be the best innovation in the genre. During any match there are chairs behind the announcers table (even though there are no announcers) and other items like tables and ladders strewn about the ramp area or around the ring. All of these can be picked up and used offensively or used conventionally. That is, you can pick up a chair and smash a skull with it or simply unfold it and put it down for somebody to sit on. You can use a table or ladder in the same way. But there are also as many as six black trunks around the ring and ramp area that will have items in them. Everything from microphones to foam fingers to spiked dog collars to sunglasses to bazookas can be found in these trunks and used as weapons. Hats and pineapples don't do as much damage as steel pipes and scales but they're all usable. Also the obvious items can be used conventionally and worn by the wrestler. So if you bust open a trunk with Trish Stratus and pick up the chef's hat in there using the B-action button you can have her put the hat on her head and wear it during the rest of the match by hitting B again.  But that's just the beginning of the fun with items in Raw.  ~The team members are all gamers and we'd sit around and say to each other 'I don't like how all of these wrestling games use items' so we came up with our own item system that's more like what we think wrestling is like,~ says Onoguchi. ~ So you can pick up items, use them in a match or wear them and even break them in some cases. But you can also use these in Create-A-Supersar mode.~  And this is really what the Create-A-Wrestler mode in Raw is all about. Well that and the amount of control you have over your wrestler's entrance. You can of course pick from over a dozen faces, multiple genders, how you want to cover each individual body part and so on. But those items you find during matches can be assigned to your CAW. If you find Stone Cold's camo fishing hat and the Undertaker's shades, you can assign those items for you character to wear. And by wear we mean he or she will come to the ring with that hat and those shades on and should they get knocked off by a vicious punch from your opponent, they become items like any other items on the screen. You can assign stuff to a CAWs head, face, neck, shoulder, waist and hands. There are roughly 120 different items and most of them can be carried to the ring during your entrance. Some items like the broken steel chair pieces (the pad where you sit and the steel frame will separate from each other) can't but you'll hardly miss 'em with all of the umbrellas, water bottles and whatnot you can carry.   ~Some items are more difficult to get than others. I want to see how many people are able to get Kurt Angle's medals. One is just a medal, the other is his genuine authentic gold medal and it's very carefully hidden. That and the deck of cards, that's a fun one,~ adds Onoguchi.  When you win a belt in Title Mode, that belt becomes and option in CAW. And there's nothing more beautiful than coming to the ring with multiple championships around your waist and over your shoulders. Furthermore those belts make super effective weapons should they become knocked off during a match. That's even more incentive to win one.  You control basically every element of your CAW's entrance in Raw. The lighting controls are exhaustive as you can select the color the pace and the pattern of over half a dozen different lighting elements. Music is limited tot he established WWF themes however. Anchor wanted to include the Xbox's custom soundtrack feature but that will have to wait until the next version of the game, they say. But you won't mind much when you see the level of detail in the intro animations. You can take the Undertaker's motorcycle entrance or Eddie Guerrero's heel act and assign it to your CAW in its entirety. All of a sudden your guy will be rollin' around on 'Taker's chopper  or spitting at the fans like Latino Heat. Very impressive.  The game modes in Raw are a little disappointing because there isn't much variety. Under the Exhibition Menu you have 1 on 1, two varieties of tag team matches, a triple threat match, Battle Royal, a Fatal 4-Way, a 2 on 1 handicap and a 3 on 1 handicap match. This may sound like a lot of options but it's not when you consider that they all--with the exception of Battle Royal-- have the same winning conditions: first pin wins. You can change the winning conditions and all of the other match rules but there's not much in the way of specialty matches. Considering we saw cage matches and ladder matches on the N64, in games with just as many wrestlers and animations, there's no reason why we shouldn't expect at least the same on Xbox.   Also it's disappointing that two of the features that were supposed to make it into Raw were left out at the last minute. Six men in the ring is now, six wrestlers on screen with four in the ring and there's no fighting in the crowd even though you can go all around the ring and back by the stage area.  ~Implementing fighting in a crowd is more difficult, in terms of programming, than it looks. We didn't want to do a sort of mediocre version of fighting in the crowd. Rather than putting lots and lots of mediocre modes in the game we wanted to fewer well done game modes,~ says Onoguchi.  The Royal Rumble is the only other arena setting besides Raw but you don't get much for winning the tournament other than a celebration screen. The Title Mode lets you go after the Women's, Hardcore, European, Intercontinental, Light Heavyweight and WWF Heavyweight belts. But there's no story driving the action here. The higher the belt, you simply have more matches to win. The Women's Championship only requires three victories compared to 12 wins, against the very best guys in the game, for the WWF Championship. So when you create your kick ass character there's not much for him to do other than conquer a handful of other wrestlers but there's no extra sense of adversity. Each match will simply feel like an exhibition match. A story driven Career Mode is so sorely missed because the rest of WWF Raw is so very well done.  The AI in Raw is extremely tough even on the default difficulty setting. Gamers should expect a surprisingly steep learning curve but it's nothing to be intimidated by. The ability to interfere with your opponent's entrance is a great addition mainly because you don't always land the first blow. And watch out for run-ins. You never know when the interfering wrestler is going to switch sides on you.   Graphics The level of detail in Raw begins with the wrestlers themselves. Every scar, every tattoo and damn near every hair out of place has been re-created on the Xbox. You can clearly see the reflective shine on Undertaker's leather pants, or Chris Benoit's snaggled tooth, or Rikishi's jiggling cellulite or that new tattoo on the back of the Big Show's neck whether it's during their intro or during a match. The lighting effects are subtle but they work well. Remember WWF Raw is lit for the TV cameras so everything should look the same pretty much from every angle.  The camera work is and underrated feature in this game. During one on one matches the camera will often cut from it's 3/4 view above the ring to a more dramatic angle to better capture the action. It's all done seamlessly and you'll never get disoriented coming into or out of the 2 second shot. The camera work is simplified for the 3 and 4 wrestler matches. The camera cuts on wrestler intros makes the whole thing look like it's a TNN broadcast as the wrestler's go about their routines on their way to the ring. Some intros even have different camera moves each time you run them.  But the overwhelming strength of Raw's wrestling animation is what carries this game. The Rock moves with all of the attitude of The Great One. From his moves to his taunts to his ring entrance, The Rock is animated consistently as the TV personality. In fact many of the moves in CAW are named after WWF Superstars because they're that unique and that recognizable. The Bubba Ray punch looks nothing like Kane's uppercut and each move has its specific timing and speed. It's all of the transitions from one move or animation to the other that really make this game so authentic. You never see a guy hop from one animation to another. If you want to follow up that left hook with a chop, you're going to have to wait for Jericho to reset himself before he can throw the next move.  You'll especially like some of the facial animations. Even created wrestlers will contort their faces and grimace in pain. But the coolest is how some of the superstars will be moving their lips as they come down the ramp during their intros or during their special moves. You can almost hear Bubba Ray telling D-Von to ~get the table!~ when he makes his two armed gesture.  A smaller guy like Spike Dudley is extremely quick and looks undersized when he goes to pick up somebody like Test, who's damn near a foot taller than him. The models may not be in proportion but it's good to see a wide variety of body shapes and sizes and animations that are consistent with those shapes and sizes. Rikishi is a lumbering oaf who runs out of energy very quickly in Raw but he has a lot of power in his moves. The Hardy Boyz always have the energy they need to pull of a high risk move but they can't take much punishment from opponents because they seem to wear themselves out.  Sound The sound quality in Raw is evident in the wrestler intros. Just turn on your surround sound system and listen to the gong and the ~dead man walkin'~ during 'Takers entrance. You can even hear his motorcycle start up and rev as he comes down the ramp. All of the WWF Superstar themes are of the highest quality and faithfully reproduced in this game.  The background music during matches isn't very endearing but it's hard to think of a song that would sound good in a wrestling match than can take anywhere from 1 to 30 minutes. Some of the menu music gets a little freaky though with all of the subliminal echo-ey samples.   The sound effects of the weapons are well done. The metal objects ping and gong when they smash into an opponent and everything else makes the appropriate thud or thump when it comes into contact with something. The crowd reactions are right in time with the crowd meter but a better ~boo~ sound effect will be in order next time around.  We already mentioned the absence of the custom soundtrack feature but it's worth repeating here. A WWF game simply demands this Xbox only feature because it's the kind of thing wrestling gamers have wanted to do for a long time. Think of how Microsoft, the WWF and THQ could cross-promote a new WWF CD with all of the new themes the wrestlers are sure to have next year.  ~The game was supposed to be a launch title but we didn't have all of the information about the Xbox's capabilities. So we weren't even able to use all of the features of the hardware for this game like we wanted to. But we'll definitely be ready for the next version of the game,~ adds Masahiro Onoguchi.  We'll be sure to let Anchor know that we  have to have wrestler voices in the next Xbox wrestling game too. It's another case where they look like they want to speak so therefore they should. WWF Raw has a fantastic wrestling engine which goes a long way towards making this game enjoyable. It looks and feels like you're in control of a WWF match from beginning to end and this is what wrestling games are supposed to give us. I was a huge fan of No Mercy and Wrestlemania 2000 on N64 and this feels like a huge next generation leap forward from those games in terms of gameplay. I'm not sure how Wrestlemania X8 is going to turn out on GameCube, but I know long time Nintendo/wrestling fans would definitely want something like Raw.The lack of a true career mode hurts this game the same way it hurts sports games that merely pay lip service to this feature. I had lofty expectations for the first Xbox wrestling game and I wanted to see complicated, interactive, choose-your-own adventure type story modes. Even though I was being very unrealistic, it's still disappointing that Raw, with this Title Match Mode, does not even attempt any sort of true career/story mode.With that said, Raw does a whole lot more good than bad, and it's still a game that Xbox owners need to pick up if they have even the slightest interest in the WWF. I'm not sure if there's such a thing as casual WWF/Xbox fan but Raw will appeal to them as well with its outstanding WWF realism. The hardcore fans will get plenty of enjoyment out of the difficult AI, the awesome multiplayer modes and the super deep Create-A-Wrestler mode.", "date": "Feb 8, 2002"}