{"name": "NHL 2K2", "name_review": "NHL 2K2 Review", "ref": "https://www.ign.com/articles/2002/02/12/nhl-2k2-review", "text": "It's been a couple of years since Dreamcast fans have had a hockey game to call their own. The original hockey title for the system was the solid SEGA Sports title NHL2K. It was a good simulation style hockey game with great gameplay, good AI and decent graphics, but not as many features ad we'd hoped for. But that was a while back.    Now the hockey drought is over, thanks to NHL 2K2. Not only will it be the final hockey game for the system, in all likelihood, it will be the final game for a severely underrated system. So how will the Dreamcast go out, you ask? With a bang. NHL 2K2 is good so good that it will have you playing your system well into next year.    NHL 2K2 builds on the solid NHL 2K engine, and makes a lot of improvements. Visual Concepts and SEGA have added sliding poke checks, shot deflections, protecting the puck while stickhandling, dumping around the boards and lots of additional goalie AI. If it takes place in the sport of hockey, you'll likely find it in this game.  Visually, the game has improved considerably as well. The framerate is silky smooth, the player models look great and the ice reflections are heavenly.    You can tell a lot of care went into making this game airtight. The folks at Visual Concepts can take a lot of pride in what they've created here. In short, this is the most realistic and wholly fulfilling hockey title out there and I'm a huge fan of EA's NHL series. 2K2, however, takes hockey simulation to another level. Each player on the ice feels like an individual, and acts according to how he would in the NHL. Stevens is a bruiser. Bure is a finesse player. Roy is a technical goaltending master. This level of attention to detail is amazing and it makes for a complete and rewarding gaming experience.   Gameplay  In terms of where it fits in the spectrum of other hockey games, 2K2 is on the simulation end of the rainbow. Hockey enthusiasts will love it. Casual hockey fans will learn something. But everyone will have fun. Why? Because this game is less arcadey, the scoring is kept down. While this might disappoint those who like pouring 13 goals in per game, the rest of us will be rejoicing. A game doesn't have to be all about the scoring to be cool. NHL 2K2 makes other things, like crisp passing, quick poke checks and impossible saves feel as good as scoring a breakaway goal. And that makes all the difference. Not that scoring doesn't feel good. If anything, it feels double-good. When you finally beat Dominic Hasek, it's because you thought about how to beat him and executed to your plan.    Part of the reason it's so difficult to beat the netminders in 2K2 is that their AI has been improved considerably. They're aware, rarely out of position and able to make spectacular saves much like the real goalies in the NHL. They're much faster at getting down to cover the five hole than in the original, they take much better angles and are quicker at recovering. What's more, each individual goaltender has his own tendencies. Roy is able to meticulously put himself in the correct position, cutting down your angle. Hasek, on the other hand, is a lot looser in the net, but more able to dive across the mouth of the goal and make lunging kick saves. A goalie like Brodeur will come out and play the puck, whereas Lalime or Potvin hangs back and lets the action come to him.    Each goalie has a vision rating as well, so if he can see you, he has a better chance of stopping you. This makes screening the goalie an effective means of scoring goals.  The defenders in front of the goaltender fiercely protect the crease, give up their body and are quick to clear. They're a lot quicker to the puck, and a lot better at poking it away. Like the goaltenders, the defenders each have different styles. Some are bruisers who will just knock you down anywhere in front of the goal. Others are more interested in trying to block shots or clear the puck. Still others are always looking to lead the charge up the ice. In short, they're a lot like defenders in the National Hockey League, and, like the goalie, they'll force you to figure out a way around them. In fact, you'll have to set up all kinds of things in order to score. Luckily, 2K2 gives you lots of tools to do just that.   In addition to the standard hockey controls that everyone is used to, NHL 2K2 offers advanced controls which are handled by pressing a combination of the left trigger and a face button. Using advanced control, your offensive player can sidestep with the puck, take a slap shot, flip pass and deke. These controls take a little time to get used to, simply because it's rare to have to press combinations of buttons in a sports game. But once you master them, they add another layer of richness to gameplay. The sidestep is especially effective, as it allows you to maneuver around the staunch defense that the game throws up against you. The flip pass, once mastered, can be mighty nice as well. If a defender goes down to block your shot, you can flip pass over him and one-time it. This kind of advanced control is lovely. You don't have to use it, but if you can learn it, the game gets even deeper, and that's saying a lot.    Defensively, you also have more control than in an average hockey game. Defenders also have a side step, as well as a diving poke check, the ability to hook and a separate button combo to block a dump attempt. This is especially crucial when a shorthanded team is trying to clear their zone. Perform a block dump when they attempt to clear along the boards and your defender will squish against the glass to keep the puck in your zone.  Speaking of clearing, when your team is controlling the puck, the dump functionality is awesome. In the past, hockey games have always sent a ridiculously hard clear down the length of the ice into the corner. NHL 2K2 allows you to feather the puck against the boards, clearing the puck and sparking a break.   In fact, there are tons of offensive and defensive plays you can call using the D-Pad. Not only can you sub lines in and out with this button, but you can cycle through and select various plays on either side of the ice. It's a little clunky to have to cycle through to get the play you want, but with so many plays, there was really no other way to do it. Still, you could be stuck trying to get the correct play called while the opposing team is skating all over you. You can leave the play-calling up to the computer as well, but what fun is that? You can actually learn a lot about hockey by calling the plays yourself. The manual is actually really helpful in explaining how each play is supposed to work. Once you learn how to use the plays, they do a pretty good job of simulating real hockey. Granted, you have to know a lot about the sport to understand it all, but if you're willing to experiment, you will be rewarded.   Fans of the old game will remember how difficult shooting a one-timer could be. That problem has been fixed. Now, if you have a player in position, and his rating allows him to take such a shot, he will gear up and rip a one-timer. It's also been fixed in the two-player game. All in all, shooting feels really good. You have full control over exactly where the shot is going. In addition, NHL 2K2 now includes actual shot deflections. You can control these yourself, or just take a shot at the goal when an offensive player is nearby, and depending how good he is at deflections, he may try to change the direction of the puck to sneak one by the goalie. The deflection is one of the most fulfilling parts of the game. The first time I got one to work for me, I nearly cried. It was just that pretty.   The whole game feels very organic; all of its parts work together fluidly to create a free-flowing hockey experience. What's great about it is that you can get out of it what you put in. If you want a more basic hockey experience, stick with the easier controls. If you want a full-on hockey, with line changes, all rules, tons of plays and every single control you could hope for, you can get it. What's more, each player feels a little different than the next. The AI is set up to treat every last guy as an individual with different tendencies, fluid logic and obvious strengths. This makes for a different experience with each match-up.    Every team has its own personality as well. If you want to dump and chase, play with the Flyers and get your bruise on. If you want an all-out offensive assault, take the Avs and light up the scoreboard. If you're a defense junky, take the Red Wings and, well, shut people down. Or take a weaker team and impose your will upon them. If you know how to manage, you can get a lot out of your team just by knowing where their strengths are.   As for modes, NHL 2K2 has the standard Quick Play, Exhibition, Tournament, Season and Playoffs. All of these are as you'd expect. Quick Play and Exhibition give you head-to-head action right away. Tournament lets you set up a custom bracket-style contest with 4, 8 or 16 teams. Playoffs lets you jump into the action and compete for the Stanley Cup immediately. Season allows you to go through an entire year-long hockey campaign. The Season mode is fairly bare bones. You can trade and track stats, but that's about it. There's also no Franchise mode, which is a serious oversight. Outside of solid gameplay, which 2K2 has, the single best way to extend the appeal of a title is to have a complex, rich franchise mode. It's obvious to me that all of the love went into gameplay and they ran out of time for the franchise, but it would have made an excellent game even more outstanding.    Graphics  The development team behind NHL 2K2 set a solid 60 fps as a goal, and it looks like they met that goal. This game is buttery smooth. As smooth as grandma's cheesecake. As smooth as Billie Dee Williams. As smooth as a baby's you get the idea. They didn't even have to sacrifice much in order to lock the framerate in. The marks left by skaters have been toned down during regular gameplay, and the bench areas aren't crazy with motion, which helps.    In addition to a smooth framerate, the arenas look amazing, especially the ice textures. The surface reflects everything, including each specific scoreboard. When you're playing in Toronto, you'll see the maple leaf reflecting from the bottom of the scoreboard at center ice. As you get near either goal, you'll see the track lighting from above twinkling on the ice. As players move over the surface, their skates leave tracks. This feature was included in the original game, and the tracks stayed on the ice most of the period. Now, the scratches are there, but mainly during replays and face-offs. They add a little more realism, but it's nice that they no longer slow the game down.   The rest of the arena looks great as well. Although the crowd is composed of simple polygons, it looks great when viewed from the front. The plexiglass is nice as well: it warbles and buckles when players get knocked into it. Each arena sports individual details that make it distinct, furthering the realism even more.    Perhaps the most impressive graphical element is the player animation, especially the goalie animation. There are a lot of signature goalie moves here that haven't been previously captured: diving kick saves, twisting last-ditch efforts to turn a shot away, lightning-fast glove saves. You can tell that the motion capture team really knew what they were doing.   Other player animations are equally rewarding. The skating and shooting animations are smooth and authentic, and some little touches have been added to extend the realism. Players get spun down to their knees, react facially to hits and stumble without falling. Great attention to detail all around. This extends to the player models, which look a lot more differentiated than in NHL 2K. Player sizes differ, as do body types. Theo Fleury looks a lot different than John LeClair. Faces have also been improved a lot. About twenty players per team have their faces in the game, and for the most part, they look really good.     One of the problems that plagued the original NHL 2K was bad collision detection, especially around the goalie. When watching the replay, you would see the puck carom off of what appeared to be thin air and magically come to rest in the goalie's glove. The collision boxes have been shrunk a great deal, and the puck reacts amazingly with players' bodies, sticks, walls, etc. It appears to touch all surfaces. When the puck  starts flinging around in the crease, it's fun to watch in replay. The dance and skip of it is captured really well.   The only problem that remains is that sometimes the goalie appears to vacuum the puck into his glove. One frame it will be a few inches away, and the next, you won't see it. The same holds true when the puck is between the goalie's legs. Even if it gets behind him, sometimes he will reach down and the puck will magically go into his glove. The reason for this is that a minor animation is missing that would link the two. You only notice it on replays (and even then, it happens rarely), but graphics hounds will surely notice. Ultimately, NHL 2K2 provides a great, solid visual experience.   Sound  Sega Sports has set a high standard for commentary in their games and NHL 2K2 continues the tradition. The play calling is informed and witty, and not as repetitive as many other games. From the pre-game blurbs to the post-game wraps, the scripts are knowledgeable and well-read, and the chemistry between the announcers is good. The commentary lags behind the play a little bit, but what hockey game doesn't?   I would have like to have seen a little more context sensitive commentary during replays. This was something we saw used to good effect in NFL 2K2, and it would serve to further enhance the game experience here. On penalty plays, it would be nice to see a replay of the offense and hear the commentators say something like, ~Stevens is headed to box again. That's his third penalty tonight!~ or ~Domi has been to the box a lot this year, racking up X number of minutes this season.~ That might be asking a bit much out of the Dreamcast technology, but it would have been nice.   As for the other audio, the crowd sounds are nice, but I wish they built with the action more. If it's late in the third period at home and you're working the puck around in your opponent's end, the crowd should sustain an insane level of cheering. Instead, crowd noise is pretty much limited to shots, saves and checks. This is all right, but doesn't provide the emotional lift I'd like it to. The sounds of hockey are spot-on. The crack of the slapshot, scratch of the skates and thump of checks are all good. I wish there was a little more chatter on the ice, and the board checking sounds aren't extreme as I'd like to hear, but overall the sound is done well.If you have a Dreamcast, and love hockey, run to the store tomorrow and buy this game. It's fun, fast-paced and deep as the Dead Sea. The gameplay and features are the slickest out there, and in terms of simulating the experience of hockey, NHL 2K2 delivers the most authentic representation I've seen yet. It's lacking a Franchise mode, but that's a feature that will surely be added to 2K3. Until then, this is a great game.", "date": "Feb 12, 2002"}