{"name": "Mall Tycoon", "name_review": "Mall Tycoon", "ref": "https://www.ign.com/articles/2002/02/12/mall-tycoon", "text": "After the overwhelming success of Roller Coaster Tycoon, ~Tycoon~ games have become the darling genre of the industry. Over the past year we've seen a horde of Tycoon titles pop up. Most of these are budget bin denizens such as Car Tycoon, Fast Food Tycoon, and Monopoly Tycoon. But even the big boys like Microsoft have jumped onto the bandwagon with their recently released Zoo Tycoon. Unfortunately for gamers, most of the titles trying to cash-in on the Tycoon craze have gotten no where near the quality or fun-factor of Roller Coaster Tycoon, and most of them fall in the ~mediocre~ category, or even worse, favor the ~craptastic~ end of gaming. Well make room for another, because there's a new entry in the Tycoon wars, and it treads the border of average with one foot still stuck on the bad side.  What you'll instantly notice when you load up Mall Tycoon is that the visuals just aren't up to today's standards. Heck, they aren't even up to last year's standards, or the year before that. The graphics looks like they're right out of the early 90s and consist of the ~three Bs~ -- blocky, blurry, and blotchy. And while Tycoon games have never been known for their dazzling graphics, it's rare that you run across a game in 2002 that looks as dated as this one.   While the in-store scenes do contain some decent and cute animation -- like the fat girl getting a tattoo where the sun don't shine flailing her legs in the air -- if you zoom in you'll notice that the customers running around your mall are actually blotchy, flat sprites. Given the poor graphics quality, it's a wonder why the game requires a 16MB video card for something that looks like it's from the olden days.  The game itself is simple enough for a child to figure out, which is both a good thing and a bad thing. I had no problem getting into the game, and within ten minutes I was building my first customer-friendly shopping extravaganza. I do have to admit I had some fun setting up the Shops at the Taleria, which included stores like The Guitar Prick (a music/tattoo shop) and of course there's my all-time favorite Pets 'n' Pretzels*. From the overwhelming response of the Pets 'n' Pretzels clientele, I really think this is going to be the franchise of the future, so none of you better steal my idea!   What did you think of Mall Tycoon?  However, after you play it a bit, you realize there's really not much to the game. Gameplay basically consists of setting the rent and your take of the sales percentage for each store and sitting back while you rake in the cash. Yes, some stores perform better than others from month to month, but with the exception that bigger department stores tend to do more business than smaller boutiques, there's no real rhyme or reason as to why one store outperforms another. While you can click on individual shoppers and find out where they're going, there's no real market research to figure out what stores the community wants, and the graphs and charts are sparse at best. It just seems that the more stores you build, the more people come to the mall, and the more money you can make off of rent and sales. This simplicity coupled with a lack of enough stats to effectively evaluate how your actions are affecting the game make Mall Tycoon an extremely shallow economic sim.   To make matters worse, I ran into quite a few bugs while playing the game, ranging from odd graphical glitches where the entire screen would redraw itself every time I moved the mouse, giving my mall a strange hall of mirrors effect, to the much more drastic crash bugs that I encountered occasionally.   On a high note, while the sound effects are sparse, the music in Mall Tycoon is some of the best I've ever had the pleasure of listening to while playing a budget title. The eclectic mix of tunes ranges from bubbly lounge to swingin' jazz to breakin' funk beats, and I even found myself pushing on through the mindlessness of the game waiting for certain tracks to come back around. But unfortunately good music does not a good game make, and the simplistic gameplay soon got so boring that even the music tracks couldn't convince me to play more.As you've probably already guessed by now, I wasn't all that impressed with Mall Tycoon. Building your own galleria is fun for a bit, but because it's such a simple economic simulation, there's just no staying power here. This coupled with dated graphics and a smattering of bugs is enough to plop it right into that ~mediocre~ slot I was talking about earlier. The game does have a few redeeming qualities and may appeal to children and casual players, but real gamers shouldn't even waste their time on this one. Now I gotta get out of here to go pick-up a Pomeranian and a salty treat.*copyright 2002, Talmadge Garvin Blevins", "date": "Feb 12, 2002"}