{"name": "Prehistorik Man", "name_review": "Prehistorik Man", "ref": "https://www.ign.com/articles/2002/02/13/prehistorik-man", "text": "Looky, looky!  Another platform game!  Well, maybe my enthusiasm is a bit overdramatic, but seriously, how many of these things have been programmed over the years.  Despite the Game Boy Advance being a relatively new system, Prehistorik Man is, essentially, just the same ol' platformer formula. It's not surprising, since this game was released on the Super NES almost a decade ago. Features 22 Levels Two Difficulty Settings Password Save Only for Game Boy Advance Prehistorik Man puts you in the role of Sam, the savior of Mankind.  The village chief has teamed you with several village members to use their special skills to complete each level.  Along the way to the final level, the Dinosaur Graveyard, you must gather food whenever you can to help the villagers survive through the winter.  Sam must use his skills with his club, hang glider, wheel, and pogo stick to complete each level effectively. Titus has done a nice job with the look of the game.  Prehistorik Man has the look of a classic 16-bit platformer; 2D, left to right scrolling, and all characters sprite driven, not rendered.  A style of presentation so neglected that to see it today almost gives it a freshness.  Level design is adequate, with a few surprises here and there, and character animations are amusing, such as Sam's ability to run like a dog for extra speed.  The sound effects are simple but get the job done (a noteworthy exception is Sam's scream he uses as a power weapon.  The scream coupled with the animation is straight out of a Hanna-Barbera cartoon).  The graphics are bright and colorful, while the levels are different enough in appearance so as not to bore you after the first five levels.  The problems with Prehistorik Man lie in the overall production of the game.  Although there are many levels to the game, the levels are relatively short in duration.  While character animations are decent, too many of the creatures just seem to do the same thing over and over again.  Sound may be good enough to let you know what is going on, but the music is nothing special for this genre, and many of the effects are used for different creatures and scenarios.  Plus, there are too many inconsistencies in the details of the game that detract from any attempt at creating a unique game world for the player.  Why is Sam, a caveman, collecting birthday cakes and french fries for the village?  I know Prehistorik Man is not supposed to be an accurate representation of 1,000,000 BC (BCE...sorry), but why is he collecting fast food?  He collects fast food, yet he has life insurance bonuses chiseled in stone.  They got that part of it right. It's little things like that that don't make Prehistorik Man a complete platformer.  Details, details, details.  These are what send platform games over the top.  The Marios and Warios on any of the Nintendo systems are always good examples of this dictum.  Even past prehistoric platform titles like Bonk for TurboGrafx 16 take this to heart.  Titus seemed to be going the in the right direction, as witnessed in Sam's animations, some of his missions, etc.  But they just didn't follow through with the complete game.  In the end, Titus' lack of effort in adding the finishing touches will only help move Prehistorik Man to the discount shelf sooner.", "date": "Feb 13, 2002"}