{"name": "Smashing Drive", "name_review": "Smashing Drive", "ref": "https://www.ign.com/articles/2002/02/14/smashing-drive-2", "text": "The day Namco announced it would support Nintendo GameCube was a great day. The company neglected the Nintendo 64 for the duration of its life with all but a few titles. However, with Namco's first GameCube release we can't help but be a little perplexed. Smashing Drive is a port of the Galeco developed arcade racer -- not quite a knock off of Crazy Taxi and not quite San Francisco Rush, but something in between. It's an experience that will only appeal to a select group, and if it does it is too short to warrant a purchase.     Features  Completely destructive, fare-driven gameplay Leave a path of destruction behind you as you deliver customers to their destinations Race against an opponent cab driver and run him off the road Find the most unlikely of shortcuts, crashing through buildings and scaling skyscrapers Clear or even destroy traffic with your ear-piercing sonic horn Get power-ups including turbo boosts, wings, and a battering ram New two-player mode in GameCube version   Gameplay Smashing Drive is truly an arcade game brought to life on a console without the quarter slot. You fill the role of a wild city cab driver, working 24 shifts in an unreal environment where the object is to get your passenger from point A to point B by any means possible. It's a no-holds-barred environment, but there are still a few gameplay rules to follow, letting Smashing Drive unfold in a very linear fashion.  The game begins with you placed firmly in the seat of your cab, which is already in motion. You do not actually have the freedom to pick up the passenger of your choice. This is in direct contrast to, say, Crazy Taxi, which many might be quick to try to compare Smashing Drive to. You have your car and the road ahead of you. Hit the A-button for gas and steer with the analog stick. That's all there is to the control, though you can use your horn to clear traffic and the B-button brake for sharper turns. The object is simply to crash through the city, pick up power-ups, find shortcuts, and avoid damaging your car so badly it barely runs. The catch, of course, is that you have a time limit. You have to make it through a checkpoint in the middle of your run to refresh your available time. In the midst of this you're racing against an opponent cabby. The artificial intelligence is pretty weak. He doesn't attempt to run you off the road and usually stays just ahead of you or just behind you. He doesn't take shortcuts and does not pick up power-ups. That said, the only obstacle he presents is finishing the race before you because you made the mistakes.  To be a truly good Smashing Driver you'll need to pick up the power-ups and locate the available shortcuts. This is really the only place you'll find any available amusement in the frantic, one-way racer. There are three levels of difficulty where you race to the finish in the morning, afternoon, and night. Hence the said ~24 hour shifs~. In each of these levels of difficulty there are three available areas of the city to complete, each chock full of nifty shortcuts. Some are pretty cool, sending you up the sides of skyscrapers and subsequently down an empty elevator shaft, crashing through the lobby into the streets; or, on the rooftops, atop an airplane, and even in the middle of a sports stadium. It's all meant to be very far-fetched, which is exactly where the entertainment value lies.     Unfortunately, it's a quick and shallow ride that ends fast. Once you can successfully find the shortcuts, memorizing the upcoming turns and twists, you'll usually have no trouble finishing the cab run and grabbing your fare. As noted previously, it's an arcade gameplay design put onto a home console. The only added benefit is multiplayer, and that also dries up speedily. Smashing Drive is a neat concept, but fails pretty miserably in execution. It's just far too linear to offer up any compelling gameplay. There are no permanent upgrades for your cab, no cars to unlock, and only one final bonus destination to surprise you.      Check this one out in the arcades where you can at least experience the stunning sensation of the seat jolting your vertebrae with each crash. The Nintendo GameCube controller rumble is decent, but it just doesn't offer up the same experience. Plus, would you rather drop a buck or two at the arcades or shell out full price for a GameCube title with nearly no extras? We think we've made our point. Test-drive it, rent it, but unless you find yourself addicted to it, it's probably not a worthy addition to your GCN library.  Graphics The visuals in Smashing Drive are truly something to behold. The original arcade hardware was about twice as powerful as the Nintendo 64, which explains why the nearly texture-less title looks like an N64 racer running at 60 frames per second. It's blurry, there's a lack of geometric complexity, and the particle effects are very outdated. A good example of these primitive graphics can be seen by gazing at the laughably monotone skies. The artists couldn't even be bothered to brush in a few clouds or something other than a flat color? The only things to be proud of are, perhaps, the solid framerate and real-time car destruction. But, even the destruction of your car is pre-programmed, limited set stages that visually show off how badly your car has been beaten up.   Sound Definitely one of the most god-awful soundtracks ever created. The collection of about four or five songs is downright nauseating. The composer attempts to create 80s rock ballads with lyrics that actual have meaning to the Smashing Drive world. ~The other car's your enemy. Blah blah blah. Let's smash this town.~ Morning breath never tasted so good in comparison. We've asked ourselves if anyone could actually like this music. Even the composer -- dare we call them that -- would have to be somewhat crazed to think he/she created something anyone would want to listen to. You might say, ~Just turn the music down and turn up your CD player.~ A nice thought, but the developers conveniently decided to tie the sound effects to the music volume. An absolute curse to any player willing to give Smashing Drive a try. The sound effects, including crashes, explosions, metal-on-metal scrapes, and the like is palatable. However, like most of the game features, the effects come in limited supply. Even voiceovers are annoying at best. When I review a game, I like to actually play through it. This is pretty standard in the industry, as it's the only way you can fairly review it. So, when I had to take on Smashing Drive, I figured it might be a bit daunting to try to progress through the various levels. Instead, after about a half-hour or so I had nearly beaten the game and found most of the shortcuts. It's an arcade game port. It's not a title I feel is made for the home console market. I don't care how desperate you are for GameCube software, Smashing Drive is nothing I'd recommend to anyone to buy. Even to my worse enemy, I'd only suggest a $1 rental. It's just so shallow and lacking any kind of noticeable depth. If you're extremely bored and have some penchant to play every available GameCube title, rent it. It's somewhat worth it to see what an N64 title other than F-Zero X would have looked like running at 60 frames per second. And, finding a few of the more wild shortcuts can be fun toobut only for so long.", "date": "Feb 14, 2002"}