{"name": "Tiger Woods 2002", "name_review": "Tiger Woods 2002 Review", "ref": "https://www.ign.com/articles/2002/02/19/tiger-woods-2002-review", "text": "For some odd reason real golf never quite appealed to me. Perhaps it is the game's inherent association with aging, death, and decrepitude that always worked to turn away an exuberant youth such as myself. I'm sure it can be bliss if you're one of those people incapable of playing a ~real~ sport, but even then that's obviously only provided you've got the speedy golf cart and hapless slave to lug around your baggage for you. Otherwise, standing out in the sun all day waiting for some pompous ass to take his swing would just be a bit too unnerving and enraging (I turn murderously fussy when I have to wait more than five minutes behind people at miniature golf, and that normally results in ambulance sirens and court hearings, so you can imagine me on a real 18 hole). Besides, being constantly shunned at country clubs because they don't take food stamps or give discounts for brought in crushed Coke cans is really devastating to the fragile psyche of a young man such as myself.  Thank God for the miracle that is personal computing technology, for without it, we wouldn't have PC golf -- a means by which to inanely waste away one's entire life. And your parent's thought you'd never amount to anything (all those Christmas cards made out of napkins that simply said, ~We still hate you, Dick~). If only they could see you now, cleverly avoiding your precariously held employment by playing a game of virtual golf in your cubical.   ~Why yes Mr. Butts, I am of course still dutifully working. Why no Mr. Butts, I don't believe that could have been golfing noises you heard emanating from within my workspace. I simply cannot see how that would be possible, sir. I have been doing nothing but laboriously toiling away at pleasing you and all the while advancing the company since I arrived at 7:45 AM. Perhaps Dan is the one slacking off again? Might I recommend another savage beating to set him straight, sir?~   Those feeble minded fools! I could play golf all day instead of working and none would be the wiser. Yeah, I'd have to contend with Dan's incessant wailing (all the beatings take a toll on his punk ass), but that's a small price to pay for the opportunity to gloat over a computer controlled Notah Begay and his legions of mindless drones and hotties that follow him from show to show. Damn them pro golfers and their titillating groupies!  Unlike EA's other marquee sports franchises, fueled by sometimes suspiciously incremental design principles, Tiger Woods PGA Tour 2002 is a new development studio (to EA anyways), a new engine, and then all of the other standard additions atop that. Should you buy it? Should you skip this crap and head to the scores? Is all that gas you've been constantly siphoning from your neighbor's tank starting to take its toll on your health and soul? All of these are legitimate questions, and I might just answer a few, but then that would require reading on to find out.   Enlisting the talents of Headgate, of Sierra's own PGA franchise fame, EA has this time around opted to switch around the game almost entirely. It's still important that a lot that went into the previous Tigers be retained, but this iteration can just as easily be thought of as the next installment of the PGA Championship series or even a new game in and of itself as it can one of Tiger's own. Take the TrueSwing technology for instance. In addition to traditional 2 and 3 click methods of control, Tiger 2002 incorporates a PGA Championship modified TrueSwing control implementation (now in both vertical and horizontal flavors). If you're not familiar, you essentially aim, click to initiate mouse control over your character, and then move the mouse forward and back to approximate the swing of your player (no meters involved). Proper motion, range of movement, and consistency of flow are emphasized for performance and success, but I just as easily whipped the mouse back, held poor Vijay Singh at a right angle for a good twelve seconds, and then slammed my Logitech Dual Optical forward at blinding speeds that sent the ball well past mach two (it would have disintegrated a pelican if there were one to hit). Sure, it didn't go very high, but it went pretty damn far, and I'm all about the length, yo. Additional text post swing provides ample indication as to what you did right and wrong on that last hit.  TrueSwing is a killer novelty, assuming you have an aforementioned optical mouse and not one whose ball can barely move due to being encrusted by years of mistreatment, Cheeto dust, and beer drool. The hand pointer used in most of the game is a bit off, which makes initiating a swing a tad awkward as you have to precisely select the end of the golf club itself, or more accurately, where the end will rest when your player moves into position. But, the only gripe I had with the TrueSwing itself, oh how I love thy sensual name, is that it sometimes couldn't keep up with me. If you move fast enough your golfer will animate a whole of two frames per swing (drawn back and swung through). This problem is ridiculously amplified if you don't have the system to crank Tiger.    Which conveniently segues us into another area of this review: graphics...   ~PC's rox0rz!!! No PS2 or Xbox game looks as good as my Medal of Honor at 1600x1200 with everything cranked and running in 4x FSAA glory. Sure, sure, my computer did cost $4,500, will be obsolete in six months, and I still only get 20fps...but you're an idiot, so shut up!~  It should be pretty clear by now that our market sucks. We spend and spend, and reap little the way of actual benefits. Games still run sporadically well, and the next-generation of titles practically necessitates the next-generation of hardware. This year's Tiger falls into this very same category. The game is stunning, now entirely rendered in 3D (aside from the gallery who are all still high-resolution 2D images). In fact, Tiger could very well have been used as a technology demo, and it was! The problem is that enjoying the game in all its wonder is a hefty burden to place on today's average machines. A burden I'm guessing the non-gaming golfers the title so happily caters toward won't be able to handle. Though, previous FMV efforts ran like Tal (which is to say not at all), so I suppose it's really just a give and take.       If you can play Tiger maxed and acceptably, you'll find startlingly vast, meticulously detailed environments and almost as equally detailed characters to populate it. The massive compilations of polygons that make up Woods and friends do well to create golfers of unparalleled sex appeal (an oxymoron by definition). Grass textures, especially those in the rough, are astonishing. Water reflects, gloriously detailed trees sway, and everything is modeled and textured with uncanny accuracy. Some transitional animations for the characters are a bit stiff and instantaneous, but its a fair tradeoff for being able to view, from a multitude of fully controllable camera angles, a player who can now properly bend his damn knee while on a slope.   Entirely, the most entirely exciting aspect of 2002's visuals in its entirety is its ability to render an entire course nearly entirely (sorry, had a brief case of the Dans). Land plots that will never come into play are nevertheless drawn. The end result is a far more believable, expansive experience, however unseen it may end up going. There are still limitations to the world, but it's highly improbable that you'll ever encounter them during play unless you specifically try to, and even then it's pretty hard.  Aside from an 80's love tune that plagues the menu system (it just instills horrifying images of people with perms disgustingly dancing and French kissing), all of the audio is at the absolute very least acceptable and solid. Some of the commentary is borderline drabble, ~I'm sorry dad. It just went off in my hands,~ but the majority of announcer feedback is helpful. The birds also chirp, the water gulps, the grass crunches, and other menu music plays according to locale chosen.  With so much effort being focused on the development of the new engine, course creation tool, and implementation of the title's wealth of options and modes, it seems EA has neglected to include as many courses and golfers as it perhaps could or should have. Six plots have been included: TPC at Sawgrass, Princeville, and Royal Birkdale with exclusives on Pebble Beach, Poppy Hills, and Spyglass. A handful of professional golfers have also made the grade this year, but I didn't see any women making the cut, nor any old-time favorites (you know, what's their faces, Jack Nicholson and Arnold SchwarzzenPalmer). Excluded deliberately? Probably. There's always more money to be made in selling sequels, especially now that there's plenty to offer in those sequels, but the customizability and creation software included should allow for near endless downloadable expansions to the game, not that I'm saying that in anyway makes up for what little has been packed in.    There are so many modes, options, toggles, and otherwise configurable aspects of Tiger 2002 that it's utterly terrifying. Start at the usual by switching up clothes and hats, or move your way straight into the customization of skill sets for existing players. Screw that amateur stuff if you want and get into importing courses from other games, or even just creating a new one from scratch. If creation and editing aren't your forte, just breeze by those options and move right in on a staggering amount of play modes -- a lot of which I doubt the average player will even use, but it's still phenomenally awesome that they exist. Seasons, shootouts, match play, foursomes, and plenty of multiplayer are all present and accounted for. Add all this to an insane amount of choices when it comes to ball, club, and shaft picking and you've got a very well-rounded experience. Like anyone ever questioned EA's ability to pull off a feature sound product.    During play, it'd be nice if the overlaying map that depicted your position, that of fellow golfers, and even the flag, would indicate which direction you're facing instead of representing you as a blob. But then it'd also be nice if other golfers wouldn't clip into you as you putted (in truthfulness, this bug only occurred once during play).  A few other miscellaneous problems that appeared in earlier versions have once again mysteriously reared their nasty little heads. The physics applied to balls is sometimes unpredictably aloof (I just like that word). Seven out of 10 times there's ne'er a problem to be had, but a cross-section of three out of these 10 shots can reveal some problems.  Rules of the game not withstanding, if a ball lands in the rough somewhere between the tee and the fairway (in holes where applicable) the game will more often than not disallow the ball to continue moving. The round will stop the second the ball touches earth and you'll move on to your next shot (via drop) or next player. Sometimes it's painfully clear that if the game was allowed to continue, and the ball allowed to roll, its ultimate position would be in your favor (it'd roll down a slope and on the green, or whatever). That's kind of annoying.  If you do get it on the green or fairway, there's a chance the ball won't roll or bounce at all. I've observed it uncannily come to a complete thudding halt when it hits the ground as if it landed in a sea of tar. As the ball sails through the air: Ooh, ooh! I may be landing just on the edge of the fertile land but the damn thing will bounce in my favor and put me just one scant putt away from victory... Thud. Plop. Stick. What the f--?   What did you think of Tiger 2002  Finally, you'd think a golf ball whizzing through the sky would be able to pierce the tops of loosely packed trees. Not so. I've seen the little white wonder knick the very peak of flora and head straight down to the ground like it encountered brick somewhere along its flight plan. The optional control change is cool and the new engine exciting. But, but, but, a player must ask him or herself whether he or she has the system to enjoy Tiger 2002, or is crappy FMV still going to be the preferred bag of tea for avid golfers still running on PIIs and Voodoo 3s? Moreover, can you really invest time in creating new courses and downloading those user-created ones off the net, or are the few pack-ins where it's going to end? Savvy golfers sporting CPU boxes forged by Zeus himself (because he's into computers nowadays) will probably be in heaven, but for the rest of us, despite a wondrous compilation of options, modes, and configurables, and even a new, rather stunning 3D engine, Tiger is just more of the same (a melding of PGA Championship and previous EA efforts), with perhaps a bit less. Crazily enough, this is still pretty darn good.I may not be allowed out on most golf courses in civilized society, but I know a solid PC game when I see one. Tiger Woods changes enough to be new, competitive, and certainly better than last year's outing despite substandard amounts of players and courses. Golf fans shouldn't be too disappointed at all.", "date": "Feb 19, 2002"}