{"name": "New Legends", "name_review": "New Legends", "ref": "https://www.ign.com/articles/2002/02/20/new-legends", "text": "The Xbox has been a console proving ground for many new development studios with prior experience in the realm of PC gaming -- and rightfully so as the Xbox architecture is very similar to the PC. While the Xbox has often been criticized for all the lesser-known companies developing for the system, those familiar with PC gaming certainly recognize a name or two when looking through the annals of Xbox developers. One such name is Justin Chin, head of the relatively new dev studio Infinite Machine. While New Legends is Infinite Machine's first project, Justin and his team carry a lot of weight in the PC world as many of them were the labor and minds behind such LucasArts' classics as Curse of Monkey Island, Dark Forces, and the highly-acclaimed Jedi Knight.  New Legends puts you in the role of Sun Soo, a martial arts master proficient in both ancient combat techniques and modern warfare. The setting is a futuristic China that is a combination of the old and the new, mysticism and machines, blades and bullets. Once destined to rule the Soo Kingdom, young Sun Soo has suddenly found his country fall into turmoil as a ravenous, bigoted prince has overthrown the ~Mongol half-breed~ Emperor Roa Khan. Something sinister drives Xao Gon's tyranny, and it has started to seep out all across China. Survivors are few. Heroes are even fewer. Oh, you can just feel the tension in the air!  As these things often go, you're the only one left to stand against impending worldwide doom -- well, you and a few of your friends who just happen to like China the way it is, thank you very much.   Gameplay Saving China from the clutches of Xao Gon doesn't come without a little bloodshed, and luckily for you, Sun Soo isn't against picking up a sword -- or two -- to get the job done. In New Legends you can dual equip your weapons, using the X and B buttons to swing or fire whatever may be in Sun's respective hand. The battle system works pretty well, and you can come up with some pretty good combinations that blend close-combat whackability with long-range firepower.   However, combat feels automated and predictable once you get the hang of it, and you can almost guarantee certain victory no matter what the odds by constantly hitting one of the attack buttons rapidly and tapping the block button when (and if) you get hit back. While it's entertaining in the beginning, the repetitive gameplay becomes monotonous as you get further into the game. This coupled with a loose, wonky camera system that occasionally gets stuck behind a pillar, bed, train, cannon, shrine or any number of other objects makes combat a chore after a while.   I wasn't very impressed with the AI either. New Legends relies on the notion that more is better -- the more people beating on you, the better. Instead of enemies acting in a strategic manner, they mostly all just bum-rush you at the same time, although I've seen enemies patiently waiting for me to invite them to attack with a polite smash in the face. All of that is really moot though as you don't have to fight 90% of the enemies in the game. You can opt to just haul ass to the end of the massive levels and the appropriate cutscene will play and the next level will load. Lovely!  The big levels are nice to explore, but they're occasionally so big that you're left looking for more foes to slice and dice, and it's these parts where the action wears thin. Breaking the action seems to be a constant theme running through New Legends as the cutscenes are preceded by long load times that really kill the expediency and urgency of your mission.   On a positive note, New Legends does sport a wide and varied arsenal. From studded clubs to razor-sharp swords to fiery hand cannons, you can be assured that you'll find the right arm to cause harm. Along with the story, this was one of the high points of the game as each of the weapons is accompanied by some rather nice animations, but more about that later...  Graphics The visuals in New Legends just don't live up to the expectations of a next generation console. While not quite as bad as the N64 or PlayStation, the graphics are on the same order as an early Dreamcast title. The character models show very little detail and the environments -- although large -- are extremely blocky. This coupled with more jaggies than an early PS2 game and you're left with a title that offers up more steamed vegetables than it does eye candy.  The blotchy, plain texture work also leaves a lot to be desired. Walls are often represented by one color with only slight variation. The effect is so bad on some of the walls that it makes it difficult to locate tunnels and culverts because the bland textures offer no depth to the playing field. Lighting and shadows are used sparsely throughout the game as well, further constricting the sense of depth and dimension.  Since combat plays such a large part in the game, you'll be happy to hear that the combat moves themselves are animated nicely, and there's a lot of variety between the various weapon styles as well as the combos. Regrettably the animations aren't as smooth as they should be as the game st-st-stutters at the most inopportune times, like when you're in the middle of a fight or you're trying to make that perfect jump across the bridge to safety. With the bland, dated graphics you would expect that the powerful Xbox could keep a steady framerate -- but you'd be wrong.   Sound Like the graphics, the sound work in New Legends is mediocre at best. While I was impressed with the use of surround sound (you can track your enemies based on sound alone, which is a good thing considering the camera sometimes leaves you blind in the middle of a fight), it seems like the development team just didn't put too much care into crafting the audio.  Whether it be the lapping of water, the swishing of swords, or the patter of footsteps across cobblestone walkways (which incidentally sounds just like the coconut-tapping horse trots from Monty Python and the Holy Grail), the audio effects in the game all sound canned, and are frankly just pitifully bland. It might not be so bad if you only had to hear the weapon swoosh when you're in combat, but it accompanies every selection you make in the in-game menus -- from choosing your control options to picking a new weapon -- so after about three or four thousand times it gets a little repetitive.   The music is repetitive as well, and rarely fits what's happening on screen. For example, an intense battle may be accompanied by the sound of soft plucked strings while pounding drums echo brazenly while you're simply exploring an area you've already cleared.  Like the rest of the sound work, the voice acting is nothing to get excited about. As epic as the story is, the actors and actresses just don't really seem into it, and their emotion doesn't match the plight of the characters in the game. I guess it's pretty obvious by now that I just wasn't very impressed with New Legends. As good as the story and weapon variety is, the game is ultimately overshadowed by wonky camera work, uninspired voice acting, poor graphics, and repetitive gameplay. I could forgive the game if it were just the graphics that weren't up to spec, but New Legends just has too many gameplay problems to be worth your time. The Xbox deserves better than this, and so do you.", "date": "Feb 20, 2002"}