{"name": "UFC: Tapout", "name_review": "UFC: Tapout", "ref": "https://www.ign.com/articles/2002/02/21/ufc-tapout", "text": "Wrestling is for sissies.  At least when compared to the real blood and bruises found in Crave's Ultimate Fighting Championship: Tapout.  Drop two men (or women!) in an octagonal cage and have 'em duke it out.  No gloves.  No holds barred.  The result is a fast-paced, brutal battle utilizing strength, speed, and strategy.   Features  Authentic fighters from the UFC  Sprays of blood during battle  Create-a-player mode  Player intros and victory celebrations  A variety of punches, kicks, throws, grabs, and armlocks    Bloodsport  UFC fighters won't go home to mama lookin' pretty.  This is not a game for the feint of heart.  No, no one gets decapitated or eviscerated here, but some of the punches really feel savage.  A good shot to the face can bring a splattering of blood and a roar from the crowd.  I hate to admit that this is absolutely thrilling.  There are no broken bones in UFC, because the threat of a broken bone is what makes you tap out.     Gameplay  There are three ways to win a match in UFC: Tapout.  By knockout, tapout, or by decision should your match actually last three rounds.  Matches can be over in just a few seconds, or close to three rounds.  In the time I've been playing Tapout, I've yet to have a match go three full rounds.  Scoring a knockout isn't too tough.  As you punch, kick, and attempt submission holds, your stamina decreases.  This makes you easier to take down.  You can actually wear yourself down and only take one or two hits and be knocked out.  If you stop attacking, your stamina will quickly recover.     While standing around punching and kicking might suffice for button-mashers, the true challenge of UFC is the strategy that comes from submission holds.  You take a gamble every time you make an attempt to throw your opponent to the ground and force them to tap out.  Tapouts seem to happen more often to you than for you.  When your opponent attempts to force a tapout (by pinning your head against the ground, bending back your arm till it's about to break, or giving you an Indian burn) you'll need to quickly counter.  Fail and your match will be over.  And, of course, your opponent will attempt to counter your moves.   Punches and kicks can be countered, if your timing is perfect.  These always lead to an attempted submission hold and is usually one of the cooler animations in the game.  The game really excels once you are on the mat.  Whether you are on top or underneath, you will have the opportunity to bludgeon your opponent into submission or try to force a tapout.  Blocking while on the mat is essential, as you don't want to give your opponent an open shot.  Here, you have to use some guesswork and strategy.  Deciding when to punch and when to attempt a pin will determine whether you win or lose.  You can attempt to reposition yourself to gain advantage of a foe on the mat, or try a surprise pin from underneath.     There's a lot of depth to the fighting engine that isn't apparent the first few times you fight.  A training mode would have gone a long way to making the experience of UFC more pleasurable to the casual gamer.  Most of what you learn comes from losing time and time again.  Mashing buttons just won't get you far enough in this game to satisfy you.     Tapout has four modes of play:  Arcade Mode -- Take on random fighters as you try to gain the UFC Championship Title.  UFC Mode -- A bracket tournament with randomly selected opponent's placed into the other brackets.  Tournament -- Choose all the fighters and place them in any bracket you want.  Exhibition -- A single one-player or two-player fight.  Along with four fighting modes, UFC offers a create-a-player mode.  There are only a handful of fighting faces to choose from and there's essentially no customization.  So, no extra tattoos, or giving a guy a scar.  You'll get stat points to put into your fighting skills.  One thing I do like is picking three descriptions of your character.  These define what he is good at and sometimes his personality.  Here are some examples:  Cat-Like Reflexes  Experienced New Jack Hustler  Incredible Striker  Just Plain Bad  Vicious on the Ground  Graphics  The player models look great in Tapout.  Well-defined muscles and properly proportioned bodies make the sequel to the Dreamcast's original UFC look much prettier.  The faces have some great detail.  Several of these guys have a little case of male pattern baldness.  Still, there are some issues here.  For one, the arenas are very bland.  Since this is the case for the real-life octagonal arenas, you could say Crave is just being authentic.  But there's nothing wrong with spicing things up a bit.  The crowd's aren't an essential part of the game and they sure look it.  There's some collision detection glitches, where peoples bodies kind of merge in submission holds.  There's also a bit of flicker sometimes at the top of the screen, but it's almost unnoticable.  The fighting animations are smooth and there are some really cool moves that can be pulled off.   What really erks me though, is the camera, which seems to have gotten a lot worse since the original UFC.  Each time your position changes (via submission hold, breaking a grab, etc.) the camera changes as well.  It would be a nice cinematic touch if the camera didn't often pop up right behind a post or the referee.  While the post is transparent, it's still difficult to see the action.  And in Tapout, you need to react quickly to your opponent's move.  Of course, when the camera moves behind the ref, it's almost impossible to fight.  Ive lost a few battles thanks to the ref's prominent posterior.   For those desperate for blood, there's plenty in Tapout.  However, the blood pattern always seem the same size and amount, and after only a few seconds it disappears.  Still, it's exhilarating when you get a double-fisted smack into your opponent's face and blood shoot onto the mat.     Sound  There are no commentators here and the crowd is mostly just a forgettable sea of static roars.  The players manage repetitive grunts, but lack any of the flavor you might hope for.  Sound is where Tapout is at it's weakest.  It would have been great to have some realistic punching sounds, but instead you just get some canned smacks and groans.   This game is not going to be fun for a lot of people, because they won't take the time to learn some of the subtleties of submissions and counters.  It will just frustrate them.  But those who loved the original and those with the desire for a solid fighting engine that isn't about button mashing, will really enjoy this title.  The create-a-player is pretty weak and could have used a lot more customization.  The game itself just doesn't muster enough pizzazz to truly wow players.  That doesn't mean the game lacks excitement.  Getting a quick tapout or countering a move and shoving your opponent's face in the ground got a yelp of joy out of me many times.  The fighting engine, and the game overall, really hasn't changed much since its initial appearance on the Dreamcast.  There are new fighters and a lot of new moves to enjoy.  The game is more of the same, but that's not so bad since the game was good the first time around.", "date": "Feb 21, 2002"}