{"name": "Pirates: The Legend of Black Kat", "name_review": "Pirates: The Legend of Black Kat", "ref": "https://www.ign.com/articles/2002/02/25/pirates-the-legend-of-black-kat-2", "text": "Ah, the pirate game. Just as the movie The Legend of Monte Cristo has had 11 remakes on the silver screen, the lure of making a good pirate game is just as tempting, and recounting the string of pirate titles appearing on the hordes of dead and living systems doesn't require too much research.   So instead of listing the laundry list of old pirate games that precede Pirates The Legend of Black Kat, let's take a good look at this one. A hybrid title boasting a full, third-person perspective adventure and a ship battle system, Pirates lures players into an ancient world of lost beaches, treasure chests, giant crabs, skeletons, and the lore of Treasure Island.   Pirates is good clean fun and it's a decent take on the genre, partly because it's Zelda-like in adventure, but also because it's battle system is engaging and unique. While technically it's got problems, graphically it's a mixed bag, and even gameplay-wise it wobbles toward middle-of-the-road techniques, overall Pirates is a good long adventure that may not best the best of its kind, but it's a better than decent pirate game, and that's something to be.   Gameplay: Land Adventures Pirates The Legend of Black Kat, formerly known as Pirates of Skull Cove, takes the pirates game down both familiar and unfamiliar paths. The adventure aspect is quite well known. Fashioned after games such as The Legend of Zelda: Ocarina of Time, Pirates throws in everything, all of the well-known conventions in action-RPGs and Action-Adventures: Hordes of evil peons, scattered pick-ups, power-ups, and scant bits of eccentric items to collect and return for extra goodies. Rather than providing puzzles like Zelda or Escape From Monkey Island (the other pirate game on PS2), Pirates offers fetch-quests  some quick, others long-run affairs. And it's all washed down with a good bunch of boss fights. You have seen and played a great deal of this game before. For the most part, these bits have been executed better than average.   The third-person perspective game is more aimed toward collecting and fighting, with a good amount of exploration tossed in for good measure. Playing the game as the daughter of the legendary Mara (whose identity your father always concealed from you), you play Katarina, whose father is killed by a power-hungry pirate at the game's outset, providing two incentives  one to seek vengeance on the man who killed him, and the other to discover your mother's identity.    With a decent tutorial that explains how to navigate ships and how to fight, collect and use the environment around you, Pirates does well to explain its case. Controlling Katarina is relatively decent stuff. She's motion-captured nicely, so when she runs, flips, or attacks with a sword, her moves play out smoothly and fluidly. You can tell the motion-capture work was based on a real fencer, resulting in elegant swashbuckling attacks, defensive stances and efficient movement in between. While it's nice to see, the animation editing and overall result, however, isn't so appealing. Katarina slides as she walks, as if on skates. It's difficult to bring her to a singular spot, and the general movement is a little loose, too.   The adventure aspects of the game are quite fun, indeed, but when it comes to the action aspects, the results, much like the control, are mixed. Katarina can walk, run, attack, block, open chests, execute special moves, jump, double jump, and the camera at any time swivels around to show her at any angle. But her moves consist of a single attack, which can be doubled or tripled into respective chain combos. It's good stuff for a few fights, but leaves one wanting a wee bit more. A few more moves would have added greatly to liven up the hundreds of fights in which you engage. Naturally there is more, in the form of projectiles and specials. Katarina finds knives, mini-kegs and potions to kill or subdue her foes. She can throw knives while standing still, walking or in the middle of a double-jump; the same with mini-kegs. This adds to your small repertoire, and it helps. Also, Katarina finds more powerful swords as she progresses, each with three upgradeable levels. But still, a few more moves would have added a lot.   The whole adventure takes place in a slew of coves, seaports, and on dozens of islands. These are broken up into the kinds of locations we all have become familiar with over the years: There are the Pirate Isles, the Haunted Isles, The Voodoo Isles, the Winter Isles, the Volcanic Isles, and lastly, Skull Cove. Each set contains its own group of like enemies and its own bosses. You fight massive crab bosses, Black Beard the Pirate, Voodoo bosses and Skeleton bosses. The boss fights are well balanced, mostly, they're sometimes a little cheap, and occasionally clever.   Amongst the obvious, run-of-the-mill gameplay elements one encounters, nice touches abound. Transitioning from land to sea is easy, with smooth cut-scenes that do the work for you. Magic portals appear after special encounters have occurred, enabling Kat to instantly return to ship, without wasting time walking. Save Points are not difficult to find and are nicely integrated with the use of Parrots. And unfortunately corniness hasn't been entirely avoided: Kat can ~smell~ treasure. Using the dual shocks, the closer to buried chests she walks the stronger the rumble, until she finds them. It's still a nice touch, if a bit kitschy.   As a third-person action-adventure game, Pirates is decent, well rounded, but simplistic. One does question the intelligence of creating a pirate game that lacks the sense of humor so readily abundant in previous pirate games, and while a few attempts are made occasionally, they're sorely lacking.   Gameplay: Ship Combat Designed as a fully integrated two-part adventure, Pirates also offers ship combat, which also has its own set of problems, but at least they're unique. To get from one island to another, Katarina sails on her ship, the Wind Dancer. The transition from land to sea is smooth, thanks to quick cut-scenes, and once on the ship the camera lifts up to a roving third-person perspective, which reaches up as high as the Goodyear Blimp. Players sail from island to island looking for ports and specifically ports with piers on which to anchor. Once anchored, even if enemy pirate ships scour the coast, your ship won't be attacked until you return to it.   Ships adventure in a completely different way. As Captain of the ship, Katarina starts off in a specific cove, and as she fights enemy forts by blowing up their towers, or sinks enemy ships via cannon battles, she earns resources (sails and timber), money, and maps. With new maps, she can venture to new islands. Technically, the island structure is set up well. The world stretches on for as far as you can see, but it's only when you reach a wide section of the particular cove that an indicator appears, signaling an opportunity to sail to another island. The map appears, and you choose the island to sail to, followed by a cut-scene. It would have been great to fit all of the islands into one big landscape without the loading, but I guess we'll have to wait for the PS3 for that.   Combat is enacted somewhat like old pirate ship battles.  Ships are mounted with cannons, which only can shoot from the port and starboard sides. Each ship has the ability to sail at a regular pace, or by using special wind power, at an accelerated pace. Once you find an enemy ship the fight begins, and each opponent blasts away, circling around one another and waiting until their cannons reload again. The ships degenerate in realtime, catching on fire, slowly sinking, and having their masts broken down, with nice particle bits flying off each time a cannonball hits it. It's great fun to watch a nasty, blow-for-blow ship battle because it's all or nothing, with the loser being blown to bits, exploding into a huge fireball, and leaving the enemy a treasure trove of resources.   Ships can be repaired and upgraded, too, and by buying more sails and extra timber, they can repair in realtime. Having beaten an enemy, players pick up their goods. Or, by having conquered a fort, Kat can purchase goods inside the fort. Extras come in handy, providing special attacks and a little variety. Stink Bombs, Fire Bombs, Chain Bombs, and special ship attacks add new dynamics to the fighting. Another attack, straight up ramming, is great fun, too, because it rarely damages your ship, but heavily damages theirs. The ships can be upgraded several times to bigger, more powerful crafts, until finally they can shoot cannons from the stern and bow, too.   The camera system is flexible and it does the best it can, given the set up, but it is frustrating, requiring constant adjustment. The camera can be changed automatically or it can be set using R3, but since the combat is always fought sideways, and the ships always move forward, there never seems to be a perfect angle from which to see everything.   Ship battles are fun for a while. The combat is a little stiff for most of the game because it must be fought from only the ships' sides. On the other hand, the game also offers strategies, such as crossing Ts and using your enemy's weaknesses against him. Still, it seems as if the ship combat could have broadened to newer areas. It appears to have been reigned to fit into a bigger pirate game concept, but a more complex, more robust combat system would have made it truly fulfilling. Just a few ideas include the ability to pair with friendly ships and entering into bigger battles with them; using a wider variety of resources to build the ships would have been nice, too; and boarding another ship (switching back to the third-person perspective) would have been awesome. The two-player combat mode is OK, but it doesn't do anything to broaden the game's reach, and ends up being pretty dull after a fight or two.   Graphics Visually, Pirates executes some things well, while in other areas it suffers. As I said before, the characters all look good, and their movements are excellent, eve if Kat's own moves tend to make her look a little bit like she's on skates. Texture-wise, Kat is well endowed and well dressed, with long wavy red hair, and pirate pantaloons and frilly, puffy long sleeves to boot. She's sexy, even if her accent is not watered down French (or something).   Technically, the adventure part of the game is pretty, but only up close. The LOD (level of detail) perimeter is too close, and so when Kat is standing still, the beautiful butterflies, grassy hills, tombstones and skeletons all look spectacular. But when she starts moving, the LOD line marks a big difference in the game's looks  from highly detailed to vaguely fuzzy, with a stuttering jump in between that's far too noticeable and hurtful to the eye. This happens at sea, too, with fish and other objects in the water, and overall, it makes the game feel unfinished and unpolished.   Still, the best visual things about Pirates are the water and the ships. The lagoons range in depth, and you can see right down to the bottom of many coves. What's neat is to see the landscape descending underwater, and the water above it darkening accordingly. You can see fish darting around underwater in schools and sunken pirate ships, and lots of little extra details that help to make the coves mysterious and forbidden. The water itself isn't the very best I have ever seen (in the ~Year Of Great Water~), but it's still pretty. It sparkles with sunlight and shows off a few convincing textures that fool they eyes quite readily, whether it's in dark waters or lighter ones. When the camera shows off the ships on the wide-open seas, the vast ocean occasionally shows texture patterning, but when it doesn't, the oceans look massive, murky, and ominous.   The reminds me, the light work in this game is extra good. In sunny areas, the light reflects off the water, and on land rays of light shine down through trees, or hit the bay just right, creating a summer-time feeling that's pretty close to reality.   As for the ships, the best thing is to see them in combat. They bust into woody bits, catch on fire, their sails get shredded, masts crash down, and water starts to seep into the hull. Also, every aspect of the ship is fixed in realtime, too, and though it's a small detail, it's cool to see.   Sound First off, the game is done in DTS 4.0, which is cool in itself, and provides better than average quality. I can't say too much about the sound except for that I was hoping for better dialog. Something funny, out of the ordinary, not just the same ~Arrrghh, matey~ pirate jargon I learned when I was six. Kat's dialog is also bland and forgettable. Even the funny mermaid, the one who asks for the flowers, is so not funny it's hurtful.   The soundtrack is run-of-the mill ~adventure~ music, giving players a feeling of high seas escapades, clashing combat and sleepy, beautiful strings during walks through the meadows. The music didn't feel finished either. There were times it lapsed, or stopped, and then started again. And yes, I know it is location generated. But that may be the problem because instead of fading in or fading out smoothly it jumped and warbled when Kat reached the outer limits of its reach. Also, the music even sounded a little out of tune. All in all, I wasn't impressed.  A decent but not an inspired game, Pirates The Legend of Black Kat is at least better than most pirate games. The sailing and combat aspects are incorporated well with one another, offering a neat combination of gameplay aspects. But it's clear that the adventure aspect takes the spotlight over the ship combat, and unfortunately, it's average stuff. The dialog is flat, the characters apt but not memorable, the fetch quests familiar but don't burn into your memory cells, and the combat is simplistic and leaves players wanting more. Even more upsetting is the ship combat -- you know that there's more to ship combat than this. And yet what players get is a pretty slim combat package that could have integrated the game even further with bigger battles, friendly ships joining in, and even pirate fights on board. Those are just my own ideas, and who knows if Westwood could have executed them. But Pirates forced me to think about what else I really wanted in a pirate game -- what else a pirate game needs to be. Perhaps if there is a Pirates 2, Westwood can grow it to an even greater extent. As it is, Pirates is a tad better than run of the mill.", "date": "Feb 25, 2002"}