{"name": "Animal Forest", "name_review": "Animal Forest (Animal Crossing N64) Import Review", "ref": "https://www.ign.com/articles/2002/02/26/animal-forest-import-review", "text": "With no new US game releases on the horizon, it's a sad fact for N64 fans that some of the most interesting titles for the platform will never come out over here. Treasure's Sin & Punishment comes to mind -- a shooter that's not only good, but also very ~US-friendly~ because of its impressive graphical effects and non-stop action. Seeing sales of some of the lone N64 releases like Tony Hawk 2 and thinking back at Donkey Kong's successful romp on the late SNES, it's rather perplexing to see Nintendo drop the system like it's a hot, radioactive coal. Perhaps Nintendo needed all its marketing dollars for GameCube, or perhaps the harsh profit margins of its own cart-based console were just not appealing anymore -- whatever the reasons, don't count on ever seeing another new N64 game again. It's ironic, too, since even the 12-year-old SNES is still enjoying a relatively active install base when compared to N64. Luckily, there are still some quality import titles for N64 that never came out over here -- and you can pick up most of them for very low prices.Top Nintendo 64 Import Games8 ImagesOne such game is Doubutsu no Mori, which translates to Animal Forest, a Japan-only communication adventure that has already seen a semi-sequel on GameCube. The latter version's future is still unsure, but it's possible that at least Animal Forest + will one day be released in the western market. But if you want to play the game that started it all, then the N64 game is the one to get.GameplayAnimal Forest is best described as a mixture between Harvest Moon and a classic game compilation -- an every-day life adventure set in a whimsical fantasy world. Everything starts off on a train where you are introduced to the first of many animal characters that populate the village you are about to move into. Upon hearing that you don't have a place to stay yet, your new-found friend calls a buddy of his from the train to ensure that you will have a roof over your head the moment you arrive. And sure enough, the train pulls into the station and a bipedal Tanuki (presumably to be called Tom Nook if the GameCube sequel every arrives in the US) welcomes you to... well, whatever you decided to name your own personal town on a disc. In case you're new to Japanese fauna, a Tanuki is an animal found in Japan's forests. Although it looks like a mixture between a raccoon and a badger, it's more familiar to the Japanese in the form of its fairy tale counterpart, a hat-wearing creature that likes to drink Sake and plays tricks on people. But don't worry, Animal Forest's Tanuki is a very trustworthy fellow -- not to mention helpful.The Tanuki then offers you to buy one of four houses. Since you don't have much cash but look honest and needy, he loans you the money with the understanding that you pay him back and help out in his shop. Thus starts an open-ended adventure -- or rather non-adventure -- in a sleepy little forest community populated by talking animals. This game is not about exploring sprawling levels or pushing about blocks to open up doors. Animal Forest lets you become part of a quiet little community, with all its relationships, daily chores, tons of collectible stuff, and occasional excitements. As a matter of fact, some of the things you can do in Animal Forest wouldn't be considered fun at all were they to take place in real life. But that's the beauty of the game. You don't have to do them. Don't want to be nice to the talking duck and help him find his lost glasses? Fine, don't do it. Not interested in catching fish? Sell your fishing rod and never use it again. Or better yet, sell it to your little brother.Animal Forest takes a hint from Nintendo's own Pokmon games and stresses communication both inside and outside of the game. A family member who plays the game when you're not home enriches the gameplay experience as much as a friend who owns another copy of Animal Forest. If you haven't figured it out yet, Animal Forest offers successive multiplayer gameplay. Up to four players can share one cartridge and live in the same town. When player #1 is playing, he or she can check out the other players' houses, send them letters or gifts, or leave them messages on a bulletin board. This creates an interesting dynamic that makes it feel like you're living in a village with real people. It's really a perfect game for families as the parents can hide treasures and leave tips for their kids on how to find them. Siblings on the other hand will enjoy the rivalry of what items they have collected and how they can tease their brother or sister by setting traps and the like. But that's not all. You can also link up with players who are enjoying the game on their own cartridge. By going to a train station, you can depart your village and save to Memory Pak. Load the Memory Pak from your buddy's Animal Forest cart, and you can visit a completely different village, with different trees, animals, and items. For example, your village may be limited to apple trees. Bring back a pear from your friend's village and plant it to grow pear trees (and pears) in your own town. Any fruit not indigenous to your village will fetch a higher market value when sold. Sounds a little bit like the old ~gotta catch'em all~ idea behind Pokemon, doesn't it?Well, there are more similarities to Nintendo's most popular franchise. Like Pokmon Gold/Silver, Animal Forest is on a real-time clock. The sun sets when the sun's supposed to set. The town's convenience store closes in the evenings. Animals sleep at night. And every hour, a clocktower lets you know what time it is. But Animal Forest takes the concept of real time even further: the game also knows what date and year it is. This data is used to synch gameplay events to actual goings-on in the real world. For example, if you play Animal Forest in December, the village you live in will be all wrapped up in Holiday preparations. Play Animal Forest in Spring, and the inhabitants of the forest will gather underneath the blossoming trees for some Japanese-style Hanami (Flower Viewing) celebrations. Summer means thunder storms, fireworks, and lots of bugs, such as noisy cicadas, large buzzing beetles and beautiful butterflies. So unless you live on some tropical island (you bastard) or in Australia, the seasons and weather patterns should roughly match what's going on outside your house.Animal Forest is not a game you are supposed to play and finish in one sitting. You're not even supposed to play it for a long time every day. This game is designed from the ground up to sit next to your console for months to come, enticing you to pop it into your Nintendo 64 and check out what's new in the forest. The more you play Animal Forest, the more you realize that this game is deeper than you may have thought. There are different layers of gameplay, some of which may be forever hidden from the player. At the very heart of the game is a sense that adventure can be found in your very own backyard. You don't need to travel to far-away lands and rescue a princess. The game definitely seeks to teach players that doing everyday things can be fun and interesting, too. And nature and communication are at the center of it all. You make friends with the animals in your village, help them run chores, send them letters, collect fish, bugs, and fruit and sell them for money, pay off and upgrade your house, fill it with furniture, take part in a monthly raffle, celebrate Japanese holidays, buy clothes, cut down and plant trees, and so on. Then there are the hidden Famicom (NES) classics. If you manage to get your hands on Famicom consoles, you can play emulated NES games like Donkey Kong or Baseball within Animal Forest. And the game even keeps track and saves your records.List of Famicom/NES classics obtainable in Animal Crossing for N64:Balloon FightClu-Clu LandDonkey KongDonkey Kong Jr.GolfPinballTennisI could go on and on about the gameplay specifics, but you're best advised to read our Inside Animal Forest features or the ongoing Animal Forest + Diaries on IGNcube. This is a review, so you want to know if the game is any good, right? Yes, Animal Forest is good. It's a charming little game that's proof that Nintendo hasn't run out of ideas. Sure, Animal Forest is a mixture of many gameplay styles that we've seen in other games before, but combined they really come together to create a very unique and original game. That's not to say Animal Forest's appeal is universal. Hardcore gamers who are used to playing videogames for hours on end alone every day will quickly find that Animal Forest isn't that kind of game. You can only play it for an hour or so each day until you run out of things to do or you get bored with running errands that you've completed before. And even though you can enjoy the game by yourself, Animal Forest really comes into its own when you're sharing a cart with a few friends or siblings. It's a communication game, after all, not an adventure like Zelda. But herein lies my biggest complaint.You really can't fault a game for being focused on life in a small village -- but Animal Forest didn't have to feel as confined as it does. The different festivals, diverse collectibles, and clever gameplay options ensure that you will come back to Animal Forest for a while, but how cool would it have been if Nintendo had implemented small sidequests like the designers behind Harvest Moon 64? On some days, when absolutely nothing was happening in my village, I was hoping that perhaps the train could take me to a place that I had never been to. But there is no hidden cave, no secret island, no overworld, if you will, other than your own village. One of the great things about other Nintendo games is that there are always hints of future adventures that keep you going and excited about things to come. It can be as simple as a locked door, a pipe you can't reach yet, an invisible block, or something sparkling at the bottom of a lake. Even though Animal Forest has tools that enable you to cut down trees, catch fish, or dig holes, you get your hands on all of them very early on. There is no hammer to let you advance to a secret area by smashing a rock. The promise of being able to play more Famicom games in the future may keep some players going, but ultimately, the little teasers to entice me to return to Animal Forest every day after I've upgraded my house to its maximum size just aren't there. Nintendo must have realized this, too, because the GameCube Animal Forest + features an additional island you can get to with the help of your GBA, more house upgrades, as well as a museum that gives collecting fish, paintings, fossils, and insects more meaning. Here's hoping future Animal Forest games (and I do hope this is the beginning of a franchise) not only sport a village, but a sense of a surrounding world as well.GraphicsAnimal Forest uses a very simple, yet effective graphical style. Even though it may not be as impressive as Nintendo's 3D adventures like Ocarina of Time or Super Mario 64, the top down view of Animal Forest is reminiscent of classic SNES games, like A Link to the Past. The overall look is akin to a picture book, with geometric shapes and stylized design elements instead of realistic grass or wood textures. It's a very pleasant game to look at and the cute characters that wander all over the map on their own really feel like they're alive. Sadly, the main character is a bit of an odd choice. Like Captain Olimar in Pikmin, Animal Forest's ~Raggedy Ann~ look-alike lacks, er, character. Considering that one of Nintendo's biggest strengths lies in the creation of memorable characters, it's disappointing when the protagonist of a game is so vastly overshadowed by the other inhabitants of the world. To me, being able to like a main character and identify with him or her makes a game instantly more enjoyable. The Animal Forest main character is just too generic and forgettable to be endearing. If the idea was to move the much more memorable supporting cast into the foreground, such as the singing dog Totakeke or shop owner Tom Nook, then Nintendo should have given players the ability to design their character's face as well.SoundThe Animal Forest composers must have worked overtime to come up with the many different melodies you will hear when playing this game. Not only does the music change every hour of the day, Totakeke will sing a different song every Saturday -- which you can collect and play back on your (in-game) home stereo. Totakeke's repertoire is extensive and ranges from country to techno. The background music you hear while playing most of the game is low key and doesn't get old quickly, but nothing compares to Totakeke's riotous unplugged delivery of the different musical genres. Playing his guitar while ~singing~ the songs with robot-like voice synthesis (he only sings the notes, not actual words), it's hard not to laugh at Totakeke wailing ~do-reeeeeeeeeee-miiiiiiiiiii doooo!~ before howling like the dog that he is. The voice samples are incredibly cheesy, but it's deliberately funny and unforgettable. As a matter of fact, many editors at IGN have MP3 versions of some of Totakeke's music on their computers and will blast them at the most inopportune moments. Other than the often tinny instrument samples for most of the music, the sound effects are good all around, with realistic foot steps and tool noises, as well as high-speed speech synthesis for the animals' language. It's pretty funny to hear the animals say your name when they address you. Don't expect accurate speech, though. It sounds more like playing back a tape at high speeds -- you can kind of make out the words, but you need to read the subtitles to figure out what's being said.Animal Forest has an addictive charm that will make you want to play the game every day just to see what's changed. But unless you're playing with four players and you've got some friends who own the game as well, the fun doesn't last as long as it should. But that's not saying much as many high profile console games end after only 10-15 hours (such as Luigi's Mansion, Pikmin, Metal Gear Solid 2, Ico, and so on). Animal Forest is different in that it's relaxing rather than exciting -- and it of course lasts longer, but it's enjoyable only in small doses once you've figured out what life in the village is all about. Oddly enough, Animal Forest has all the makings of a massively multiplayer network game. Should Nintendo ever embrace the online gaming format, you can bet your N64 game collection that Animal Forest will be one of the games that will prove how much fun human interaction over the web can be. Although the core gameplay is the same, the GameCube upgrade of Animal Forest expands on the N64 game by adding more items, more ways of customizing your world, GBA connectivity, and more emulated classics. Both are great additions to your game library if you're into titles like The Sims or Harvest Moon, but be aware that they do require some knowledge of Japanese to make it through. As long as you can read Hiragana and Katakana, you're fine. If you don't know any Japanese, you will probably get stuck trying to figure out what chores the characters ask you to do. If that doesn't deter you, you might want to refer to our Animal Forest Diaries to get some help when you're lost.", "date": "Feb 26, 2002"}