{"name": "Circus Maximus: Chariot Wars", "name_review": "Circus Maximus", "ref": "https://www.ign.com/articles/2002/02/26/circus-maximus", "text": "With so many games releasing over a variety of systems, you start to see the same ideas recycled again and again.  That's why, when a fresh idea comes along, we get really excited about the game.  It's great to play something new, with an original concept.  So when I got my hands on Circus Maximus: Chariot Wars, I was more than hopeful.  That hope was crushed the first time I put the game in my Xbox.  And each subsequent journey into the world of Circus Maximus has gotten worse and worse.   FeaturesChariot racing galore  A variety of ancient Roman areas  Fierce chariot combat  Training mode to help hone your skills  Cooperative play with a friend  Gameplay  Ben-Hur look out, there's a new kid on the block  As a chariot racer in ancient Rome, your goal is to earn some Dinari and become Rome's greatest chariot racer.  Each chariot has both a driver and a warrior.  In Maximus, you get the pleasure of controlling both as you race through various areas of the Roman Empire, including Alexandria and the Coliseum.  Run over helpless pedestrians or ride on one wheel, and the crowd will throw Dinari your way.  Winning races also scores you Dinari, which are needed to enter the next race.  Circus Maximus has four modes of play:  Circus: Arcade mode.  Race in any open level against three other competitors.  Empire: Multiplayer mode.  Work together, with one player as the driver and one as the warrior, or race against each other.  Tournament: Career mode.  Advance through levels by earning Dinari and winning races.  Academy: Training Challenges.  Learn the ins and outs of the game here.  It won't grow you any extra fingers, though.  So many buttons, so few fingers  With so many buttons to choose from on the Xbox, developers can be tempted to use them all.  That's fine, so long as they don't require you to use them all at the same time.  Such is the case with Circus Maximus.  Imagine, if you will, as I describe the setup.  You may even want to heft your Xbox controller to see if your fingers are flexible enough to pull off these stunts.  You control your chariot with the left analogue stick.  Simple enough, eh?  You control your warrior with the right analogue stick.  This moves him around, lets him duck, or lean forward.  Now, while you're using the two analogues, you'll need access to both triggers, because they help you make sharp turns.  Of course, to maintain speed, you'll have to keep a finger on the A button.  Possible?  Well, we're not done yet.  When competitors get beside you, you'll need to press the black, white, Y, or B button to attack and the X button to block.  This is not a pleasant gaming experience.   To be fair, there is an auto-drive option that lets you focus on your warrior and lets the game drive for you.  But, why would you want to play a racing game in which you aren't driving?  That's like a Nascar game where you are in the pit crew.  Boring.  You can have a friend pick up a second controller so one can control the driver, the other the warrior.  But that means that friend doesn't get to race against you, another fun staple of the cart racing genre.  Your third option is to have extra fingers surgically implanted in your hand.  I went with that option, just so I could finish this review.  So, I'm out $140,000, but at least I can play me some Circus Maximus!  It's worth it right?  Uh, sadly, no.   Even if you ignore the fact that you have to have new fingers grafted to your hand just to play this game, you still won't want to play.  By the end of the first lap, it's become all too pass.  And that's a bad thing to say about a chariot racing game.     Beware falling rocks  There are shortcuts in Maximus, but they all seem a bit too obvious.  You just have to be awake and you'll see them.  Though rival warriors are your main competition, your race is not without natural perils.  Falling rocks and trees will attempt to impede your path.  It's cool at first, but since the same rocks and the same trees fall on the same track every time, it gets old (and easy to avoid) fast.  Tree roots and branches need to be avoided (through masterful steering or ducking), but these tend to only be a problem the first time around as well.   Where did the fun go?  The true measure of a game is how enjoyable it is.  Bad controls are no big deal when you're having a ball.  But there is no ball to be had here.  It's a challenge to find the desire to even finish some of these races.  So much seems to depend on luck.  If you run into (or sometimes near) a wall, you crash.  But that never seems to keep you out of the race.  A few seconds later, you're right back in the thick of it.  So there's no real consequence for crashing or being stabbed to death, unless it occurs in the last leg of the race.     Playing with a friend in cooperative mode doesn't help the fun.  In fact, I'd rather play with the seven-fingers required controls than play with a buddy again.  If you play as the warrior, you just sit around waiting for someone to fight.  And you're no longer driving in a cart racer.  Kind of silly.  If you're the driver, forget about enjoyment.  The roads aren't too tough and your main job will be staying awake to cross the finish line.     Graphics  The warriors and their chariots are the best looking aspects of the game.  The environments feel a little bland.  After an initial run, it just feels like the same thing again and again.  With only four races in the field, the game runs very smooth.  Your horses legs move properly and the warrior animations are fluid, with each of them having several different attacks.  Still, anything seen at a distance looks very flat and even up close the textures just aren't there to give a sense of realism.  The collision detection is a problem.  You don't have to even hit an object, just get near it, and you'll crash.     The effects won't wow you.  Sparks from wheels grinding on wheels fail to dazzle.  They look a bit cheap, actually.  One of the things I love to see in games is reflective water effects.  There's no love here from Kodiak Interactive.  The water is flat and even the splash of your horses running through a stream are boring.     Sadly, there's no fanfare to go along with the game.  You lose a bit of the pageantry you'd want from a chariot racer.  Especially once you've won.  Where are my streams of rose petals?  Or at least something to showcase my victory and vilify my enemies.  But the victory isn't really celebrated.  Part of the mythology of chariot races is ceremony.  Kodiak has left that out of Maximus, which is a shame.     Sound  This has both the best and worst features in the game.  The sound effects are well done.  The horses racing on the ground sound authentic as do the clang of swords clashing.  The competitors' grunts won't make you cringe, and their cries of defeat are pleasant to the ear.  The effects work well to bring you into the game, make you feel as though you are racing in ancient times.  And then, the taunts begin and suddenly it's 2002 again.  Most of the male warriors seem suitable, but the female voices are terribly miscast.  They say things that make it seem like Kodiak Interactive was trying to be hip.  But it comes off more like what your dad thinks is hip.  Here's a list of many of the terrible modern taunts that completely ruin the atmosphere of Maximus:  ~Come get some~  ~Come on, let me kick your ass!~  ~Ohhhh yeah!~  ~I will kick your ass!~  ~I'm a naughty girl~  ~You go girl!~   The music is hard to comment on since its presence is meager.  Why aren't there soaring trumpets and other gladiatorial signatures during the race?  Instead you are left to the ambient sound, which is good, and the terrible taunts, which are, well, terrible.  Circus Maximus is an ambitious game.  It's a great concept that fails in just about every aspect.  It seems Kodiak Interactive put some effort into this game, but it just doesn't pay off.  The graphics are average, the gameplay is bad, and frankly, the game isn't any fun.  I thought maybe I was alone in this, that maybe somehow I was missing something.  So I let a few other editors pick the game up.  All of them instantly agreed, the game isn't fun.", "date": "Feb 26, 2002"}