{"name": "ESPN NBA 2Night 2002", "name_review": "ESPN NBA 2Night 2002", "ref": "https://www.ign.com/articles/2002/02/26/espn-nba-2night-2002", "text": "Basketball has always been the trickiest sport to replicate in a game. The complexities of a triangle offense, coming off a double screen and letting go of a pass before your target player has reached his spot are going to continue to be among the hardest feats to accomplish by game designers.  ESPN NBA 2Night 2002 from Konami struggles more than NBA Live 2002 from Electronic Arts. But struggles and bad are two different descriptors. The Konami game isn't bad in a Blasto or Clayfighter 63 1/3 sort of way, but it does have some issues.   A complete game, ESPN NBA 2Night 2002 is an average basketball title. You can play a season of a few different lengths, 14 games, 28, 56 and the full 82. Whether it's season, exhibition or playoffs, you can adjust quarter length from one to 12 minutes. The default length is three minutes. There are five difficulty settings: easy, normal, hard, very hard and super hard.   Games can be played in simulation and arcade mode. The difference between the two modes is not drastic, but effective. Arcade mode means no rules. No out of bounds, no stupid infractions like defensive three seconds that the NBA has adopted this year as it now allows zone defenses.   As I always do with sports videogames, I hope for more in the arcade mode of a simulation game. Being able to shoot like an immortal would be nice, or at least like someone having a career night.   One aspect I  really enjoyed last year was the Create-A-Player feature. You could also adjust the attributes of existing players. This was nice for a few reasons. If one player was too dominant, give him a little dose of Kwame Brown and make him worthy of nothing but the bench. Shaquille O'Neal is too money of a jump shooter in this year's version. I would like to tone that down. Or if you have a favorite player, say one who went to the same university you did, you can make him a demi-god and live vicariously through him. Marcus Pope fans apply here. But the best part of adjusting abilities is you can make your favorite team as good as they are in real life by upping the stats across the board or at least among the starters. The New Jersey Nets are playing phenomenal basketball this year, but they're among the worst-rated teams in the game. Being able to change that would be so choice.   Gameplay Last year's version lacked a turbo button. After playing this year's I wonder how much the button was really missed. Now you can kick it into high gear and it's useful bringing the ball up court to set up for a buzzer-beater, but you couldn't drive past the notoriously big John ~Hot Plate~ Williams using turbo. So it's a feature, but it's not particularly useful.  Jump shots are done well. For the most part you won't hit a high percentage of three pointers unless you're using an NBA marksman. And players who are left-handed shoot left-handed. That's attention to detail I appreciate. All manner of sports games have botched that one.   Rebounding in ESPN NBA 2Night is a disgrace of Sam Bowie proportions. Say you're guarding a perimeter shooter and the shot goes up, it often hits the rim two or three or four times before going in or coming out. I watch three or four NBA games on satellite per week and I'd estimate the ball bounces two or three times on the rim. But in ESPN NBA 2Night the ball bounces about 15 times as often it does in real life. The second and third rim hit make it basically impossible to gauge when to jump to yank down a board. It seems to fool the CPU as well. Something's definitely wrong because your team or your opponent will get five or six consecutive offensive boards fairly often.   Passing is a little dodgy. You can throw almost any pass at any time. Hitting a player in stride is one thing  maybe a thing done best by John Stockton or Mike Bibby  but doing so through three or four defenders is a bit much. And by doing nothing but depressing the pass button, your point guard might throw a 60-foot behind-the-back pass from the free throw line in the backcourt to your center in the post.   The other thing that bugs me, and I blame NBA Street for this, is the complete lack of moves. Where's the crossover, the wacky dribbles and spins only quick point guards can do, where's a shimmy and shake? Well, there is a shake move, but it does little to CPU defenders. The best fake is a fake shot. Yawn.   Oh yeah, almost forgot, in my second game I managed to steal the ball twice in one quarter from deft dribbler Gary Payton using the otherwise inept Jahidi White, who's 6'9~ and 290 pounds. Nice.   Graphics  As the teams are introduced you'll get your first glimpse at the accuracy of the player models. Player skin tone is faithful to their real-world counterpart's melanin-darkened epidermis. The court, baskets and arenas are done rather well.   Players walk and dribble as they should. It only struggles when players are near the rim. There are various motion-captured animations for dunks. At times a player may grab a rebound five feet from the rim and without segue the player moves into a motion capture dunk animation that should only begin when he's on a fastbreak.    Sound  The not-so-dynamic duo calling the game from the booth is an odd choice indeed. Brent Musberger, a veteran sports broadcaster, has been paired with ESPN's Stuart Scott. If you are a fan of Scott's delivery and catchphrases like ~boo yah,~ ~and the Lord said you got to rise up-a~ and ~jammm~ then you'll enjoy the color commentary because Stu is in typical form. Musberger's play calling trails the action on the court at times. Overall, the commentary is pretty typical, a little late, a little uninspired and unfortunately par for the course with sports games. Therefore, I don't have major complaints, other than the normal ones...   The in-game sounds are spot on. There may be a little too much shoe squeaking, but that's minor. The dribbling sounds, the clang when your jumper isn't falling and the crowd are pretty good. ESPN NBA 2Night 2002 does not reach the bar set by NBA Live 2002. It's not altogether a dismal title, but the rebounding and passing flaws bring it down pretty far. Which is a shame, because the game looks very good, the sounds of basketball are fairly represented and the color commentator, if you like Stuart Scott, is amusing to a greater degree than it is repetitive. If you have not enjoyed the NBA Live series in the past, give Konami's game a try. Otherwise, may we suggest NBA Inside Drive on Xbox.", "date": "Feb 26, 2002"}