{"name": "FIFA '98", "name_review": "FIFA: Road to World Cup '98", "ref": "https://www.ign.com/articles/1997/11/25/fifa-road-to-world-cup-98-2", "text": "Football, aka soccer, is the most popular sport on the face of the planet. Next year, the finest national teams in the world will gather in France to participate in the World Cup, the biggest sporting event on the face of the planet (which England will win - yeah!).  EA's FIFA: Road to World Cup 98 is all about this legendary event. It's unbelievably comprehensive -- and it plays a great game of football, too. About bloody time too, if you ask me. I've really resented EA's previous 32-bit FIFA games for their suspiciously-similar-to-the-Genesis-version AI and generally poor graphics. This time, though, the franchise has been pretty much overhauled from the ground up, and the end result is something that football fans can really cheer about, rather than having to resort to rioting in the streets as we usually do.  The presentation is second-to-none. From its blistering opening, complete with Blur music, though its immense amount of options to its up-to-date stats (as opposed to really outdated stats on previous FIFA games), FIFA 98 is as good as football games get on PSX. Every national team is in there, from Tahiti to Brazil, and so are a wealth of European and South American club teams, including England's Premiership and Italy's Serie A. The focus of the game, though, is the World Cup itself. Players can participate in the tournament-to-be, or take a trip back in time to '96 and start at the qualifying stage.  Graphically, the game is very good. The frame rate is ever so slightly choppy, but that's all forgiven once the game begins proper. I was really impressed by the player animation, which is very subtle, lifelike and varied. This, combined with the refined and responsive controls, results in a game that looks, feels and plays like real football.  The AI is very well executed so that the teams actually play as a proper team, rather than the simplistic kick-and-run of previous FIFA incarnations. Off-the-ball movement is convincing, and the team's tactics, positioning and play style can be defined to suit the player's requirements. This adds extra depth to the game, and on higher difficulty settings, getting the tactics right can play a vital part in ensuring victory.  The sound is blistering. Great crowd noise and marvelous commentary really spice up the game's atmosphere, and with the music from top bands combining with the excellent presentation screens, the whole thing looks and sounds like a sportscast.  FIFA 98 is top of the league, and definitely puts the life back in a franchise which was starting to look very tired and worn. It's definitely the best football game on the PlayStation by miles, and with its absolutely astounding number of options, teams and gameplay styles, I know that it's going to keep me very happy until the real World Cup starts next summer.  Jaz Rignall", "date": "Nov 25, 1997"}