{"name": "Fatal Frame", "name_review": "Fatal Frame", "ref": "https://www.ign.com/articles/2002/03/05/fatal-frame-2", "text": "Fatal Frame may not be the first videogame to be based on a true story, but it is probably the first to advertise the fact.  It was a bad decision on Tecmo's part to add the subtitle, in my mind, because this is in fact a very good game, and it's a disservice to the production to immediately stamp it with the same brand as so many appalling Saturday-night TV movies.  ~Based On A True Story!~ seems to immediately call up images of Ricky Schroeder, Valerie Bertinelli, and mysterious diseases summoned out of nowhere for their brief moment in the media sun.  Either that or Judith Light on the run from her fifteenth abusive husband.  Fatal Frame has nothing to do with any of that.  It is, in fact, quite an inventive piece of survival horror, managing to keep the fright up and the frustration down with a few smart design decisions and an abundance of creepy style.  You have all probably heard of the central gimmick -- our heroine fends off the lurking terror with the power of an enchanted camera -- but the more you play the game, the less noteworthy that asset becomes in the face of a genuinely well-crafted thriller package.  It's a better-looking game than we would have expected from an unknown development team at Tecmo, with a serviceable engine guided by a steady artistic hand.  This won't be the source of a sea change in survival horror, which remains the object of a certain amount of backlash in gaming (some of it coming from exactly this quarter), but Fatal Frame proves that there's life and potential in the genre, no matter how badly some other games have tried to kill it.  Hope through fear?  Stranger things have happened.  Gameplay  Evaluating examples of survival horror nowadays has boiled down to two related questions, or three if you bring them together.  One, is it an effective dramatic experience?  Two, is it a frustrating gameplay experience?  And three, is the value of the dramatic experience enough to outweigh the pain of the gameplay experience?  In the case of a poor survival horror game, such as Resident Evil: Code Veronica, the answer to number three is No.  In the case of a good one, Silent Hill 2 being the present pinnacle of the genre, the answer is Yes.  To take things a question at a time, Fatal Frame is most certainly scary, and more than that, scary in a very classy way.  It's a haunted-house tale in the traditional mold (although the Japanese setting lends it an exotic quality from a Western perspective), with surprisingly little reliance on violence or up-front shocks.  Frightful things are happening here, make no mistake, but for the most part cruelty and death are witnessed after the fact, or through obscuring filters.  They're an ominous presence, rather than an immediate threat.  The fear here is of what you don't see, or just miss seeing, not what jumps out from behind the two-way mirrors and whatnot.    The flip side of that artistic choice, of course, is that Fatal Frame may come across as a trifle less creative than some of the competition.  Silent Hill 2 remains alone in its own class of truly inventive perversion -- Tecmo's developers have for the most part passed over the bizarre psychosexual dimensions explored in Konami's game.  As I say, though, Fatal Frame's use of the Japanese setting and elements of Japanese folklore in story and puzzle design notch it back up in comparison to the straight B-grade template in Resident Evil.    And shocks are fun, but it's a much neater trick to create a slow, continuous build of suspense, which Fatal Frame does nicely.  The game begins with a superb prologue sequence, as the heroine's brother explores an introductory area done up in grainy, high-contrast black and white.  Something happens to him, but what?  The game proper begins when his sister Miyu follows him, trying to find her brother and uncover the mystery of the cursed Himuro mansion.  The interlocking stories of her brother, a missing literary figure, and the mansion's original inhabitants are gradually told through research notes and supernatural flashbacks -- just as in System Shock 2 (a high compliment as well as an indication of similarity), odds and ends both mundane and frightful gradually make up the puzzle.  So it's a fine work of art -- is it tolerable to play for any long period of time?  For the most part, yes.  The camera is a neat concept that doesn't wear out its welcome, providing an unusual alternative to the usual lead pipes and shotguns.  It helps that ~combat~ (or whatever you might call it) isn't an especially common occurrence in Fatal Frame, at least compared to the running shootouts of Resident Evil.  Ghosts show their ethereal faces only now and then, just often enough for their presence to be a continual threat while battles remain a major occasion.    Activating the camera brings up a first-person view, with the central viewfinder serving as a lock-on sight of sorts.  Holding it on the target longer makes attacks more powerful, but being ghosts, the enemies have a tendency to flash in and out of sight.  Taking the shot when it's available is the key strategic issue, with positioning taking a secondary role -- Tecmo was kind enough to include controls for moving in the first-person view (including strafing and a quick 180 turn).  Battles have their rewards aside from disturbing thrills (more on that later), with ghosts' spirit energy converted into points that can be spent improving the camera.  Faster charge rate, bigger viewfinder, more power, and a variety of fun (if comparatively non-essential) special powers are available for purchase.  Movement in third-person is favorably tweaked a bit to make encounters more tolerable.  One of the classic issues with games like this is movement colliding with the shifting camera.  Onimusha is the latest example of the problem -- when the camera shifts to show a new scene, the definitions of right, left, and forward suddenly change, which can be deadly when you want to keep fleeing a ghost.  Fatal Frame has plenty of sudden changes in perspective, despite its realtime backgrounds, but it also has a method for getting around this, though.  The square button automatically moves the character forward, no matter what the definition of ~forward~ is, so running like hell isn't that hard at all.  Getting lost is occasionally not so hard either, but the level map makes it easy enough to re-orient yourself.  Of course, much of Miyu's time is spent exploring the house, completing typical fetch-and-carry quests and solving brain-teasers.  Luckily, Fatal Frame doesn't demand an inordinate expenditure of shoe leather, relying on actual density of events to make the game interesting rather than stretching it out with puzzles spread all over the map.  The camera is a fun puzzle element now and again, too, its powers revealing clues otherwise obscured by illusion.  Just remember to keep a close eye on the reams of notes you pick up -- some of them seem inconsequential until they become the key to a puzzle several rooms later.     Graphics  And aside from all that, it's a worthwhile experience to just wander about the mansion.  The interesting thing about Fatal Frame's environments, though, is how rare it is to get a good look at them.  Illumination is provided by flickering torches, the occasional moonbeam, and Miyu's small flashlight -- if none of those are present, out go the lights.  The simple dynamic flashlight effect was a neater trick in Alone in the Dark, which didn't have the advantage of Fatal Frame's realtime backgrounds, but it does the job with few complaints, and glitching surrounding the shadows is very rare.    If the whole game were lit, it would probably still look very nice, with plenty of period detail mixed into the background textures and models.  Chests of drawers, suits of armor, hanging votive lanterns, torii gates, and all sorts of other widgets help fill the space, and the overall impression of decrepit age is conveyed quite effectively.  Still, darkness and shadow have their place.  Miyu's realtime 3D model doesn't have an exceptionally impressive suite of animations, but she's very nicely lit, and no rough edges break up the pattern of light and shadow.  The ghosts in Fatal Frame frequently inspire the same ~how'd they do that?~ impression as Ico's famous shadow beasts, but the handle is a little more evident -- it looks like they're just a mix of transparent textures, although the blurring/warping effect on the background behind them is evidently a little more complex.  Regardless of the technical details, the bottom line is that they look sharp, appearing in more than a few different forms (humanoid and otherwise) and smoothly meshing with the environment around them.  Sound  Which also goes for the sound effects, proven by the Silent Hill series to be an absolutely vital element for establishing the atmosphere of a horror game.  Fatal Frame isn't so heavy on musical accompaniment as Silent Hill -- no grinding industrial noise here -- but the quieter, ambient feel of the soundtrack suits the game's more low-key presentation.  And when it wants to drive the point home, it certainly does, blending heavy discordant sounds into powerful flashback cutscenes.  It's those same sequences where the voices are very effective as well.  I assume that the dialogue was re-recorded in English by Tecmo USA, for both the cinematic sequences and the occasional taped research records, and if that is so, they've taken a step or two forward from the slightly painful Unison.  Perhaps it's not so much of a surprise, though -- most of Miyu's lines and the research notes are underplayed, making them easier to dub, and cutscene dialogue is usually part of a collage with strong music and effects.  Either way, though, the dialogue doesn't break the mood established by the rest of the game, which is an A-OK job compared to most other horror games.Fatal Frame would succeed just fine in a vacuum, though, not just in comparison to relatively weak competition.  It's still a bit of a stiff game to control, leaning more towards the Resident Evil end of things even if it does discard the hated pivot-to-turn control model, and the camera combat system will probably burn a few healing items until you learn how to time and execute attacks, but to elaborate on an earlier point, question one is still more important than question two.  Fatal Frame delivers a well-above-average fear quotient, and with a good deal more elan than some other games one might name.Horror fans are advised to pick this one up at their leisure, and even the jaded might find something to renew their interest in the genre.  It brings new ideas and a freshened style, both of which have become rare commodoties in survival horror.", "date": "Mar 5, 2002"}