{"name": "Las Vegas Cool Hand", "name_review": "Las Vegas Cool Hand", "ref": "https://www.ign.com/articles/1999/09/24/las-vegas-cool-hand", "text": "Gambling.  You've seen it before, and chances are, you've lived the virtual life of a high-stakes tycoon.  Card games, slot machines, roulette, and the like have all appeared in loads of video games, so it's not very likely that Take 2's Las Vegas Cool Hand will receive a standing ovation. Cool Hand does little to make the portable gaming scene an exciting one -- since it has only three different card games available, it should have the words ~Slightly Entertaining On Road Trips Only~ embedded into its casing. Features:  3 different card games: Solitaire, Blackjack, and Cribbage 4 modes per game For Game Boy and Game Boy Color   Let's face it, Take 2 didn't go ape wild with Las Vegas Cool Hand.  Take a gander around the three games included -- Solitaire, Blackjack, and  Cribbage -- and it won't be hard to see why.  Neither of the card games are through the roof with entertainment, and their variations don't do a whole lot to throw boredom in the trash can.  Although Cool Hand makes somewhat of a bearable travel partner, it just doesn't have enough to keep lasting interest.  With the hopes of hooking potential buyers who have been nipped by Vegas Fever, Cool Hand tries to boast classic gameplay, and that's about all it has going.  Perhaps it would be somewhat enjoyable if it had more than just a few overdone card games in its corner, but it lacks more fun than it contains.  In this case, classic gameplay and fun are two very different things, and it doesn't have enough of the latter to deserve a place in your possession. Neither one of the three games, nor their variations, are beyond the call of electronic gaming duty.  Although fun on most everything but this, Las Vegas Cool Hand's offerings don't stand out. For those who are unfamiliar with its card games, here's a brief run-down on what's available:  Blackjack:  Try and beat the dealer by getting the highest possible score under 22. If you go over 21, or the dealer beats your score, you lose. Solitaire:  Solitaire is a one-man game only, and is played by trying to place the cards from several piles and a deck onto four aces. Cribbage:  This is a game in which the player tries to reach 121 points against other players. Las Vegas Cool Hand doesn't manage to retain the spirit of casino action despite what its name suggests, and its graphics and music don't have any aces up their sleeves.  It has a poorly-designed, simplistic-looking interface that does little to keep your eyes from popping out of their sockets in amazement, and the graphics during gameplay itself don't strive to grab your attention.  The most impressive bit, no buts about it, is when the dealer shuffles the cards -- Sarcasm intended, that's got to be one hell of a trick the  programmers at Take 2 pulled off!  And if you think the graphics are bad, just listen to the music!  The tunes became so repetitive that I had to turn the volume all the way down.  There would probably be no review for Las Vegas Cool Hand here today if I kept the music going, because I would have gone completely insane and taken several innocent lives down with me in a bloody rampage -- It's THAT bad!   After having played one of the best Vegas simulations on the SNES years ago, Vegas Stakes, I can see that few other games in the genre seem to shine. Las Vegas Cool Hand pales in comparison on so many levels, and leaves a lot for gamers to whine about.  Although it's only a Game Boy game, players have come to expect more than just a pathetic remix of what others have done year after year after year.  And if programmers can shrink Resident Evil into a tiny cartridge, surely Take 2 could have included slot machines, craps, and more. Since it has so very little to offer hardcore gambling fans looking for a good time on the run, Las Vegas Cool Hand should undergo a name change: ~Fear and Loathing in Las Vegas Cool Hand~.  Although it doesn't have Johnny Depp or acid trips, the title makes much more sense;  you'll fear the music  and loathe the gameplay!", "date": "Sep 24, 1999"}