{"name": "NBA Jam 2002", "name_review": "NBA Jam 2002", "ref": "https://www.ign.com/articles/2002/03/07/nba-jam-2002", "text": "on the Game Boy Advance is an attempt to recreate the two-on-two over-the-top basketball design of the game popularized by Midway in the arcades. Acclaim is definitely not new to the series, as this publisher was the company responsible for the ports of Midway's design for game systems almost ten years ago...and Acclaim even picked up the series from Midway for additional arcade and console iterations a couple years later. But it seems that the development team responsible for this portable version is new to the series, as the GBA game is quite possibly the worst version of the series yet created...and definitely one of the worst titles available for the system. Features 140 NBA players Six gameplay modes Password save Only for Game Boy Advance  There must be a reason why the team responsible for the Game Boy Advance version couldn't base the game on art assets or design elements of the established Midway arcade versions (or Acclaim's console ports for SNES and Genesis), for the portable game has completely new artwork and animations in the same side-scrolling two-on-two game design. The Game Boy Advance system has better graphics capabilities than the Super NES, yet the GBA game, for some reason, is tons uglier than NBA Jam games released on consoles a decade ago. Character sprites, while having fluid animations, don't look anything like their real-life counterpart and have distracting jagged edges all over their bodies. The crowd is way oversaturated in colors, and the action in foreground many times gets completely lost in the busy background.  The quality of the audio is relatively OK, with decent quality samples for the crowd noise and announcer. But quality is one thing...the sound can, and will, get absolutely obnoxious because the ~play-by-play~ announcer (if you can call him that), only says about a dozen things. And he says them over...and over...and over. After every single pass, he'll call out, ~Nicely received.~ I kid you not, in a standard regulation game of NBA Jam 2002, you'll hear that phrase said at least fifty times.  At least. Of course, you'll get some drunken frat boy shout ~Shoot it, man!~ about half as many times during each period.  This attention (or lack thereof) to the audio is a far cry from the clever commentary that the game's been known for in console and arcade iterations in the past, and just tacks on one more thing for fans of the series to get disappointed about in the GBA design.  But it's the gameplay that's NBA Jam 2002's sinker. It's two-on-two like the classic NBA Jam series, sure, and there are even a few high-flying dunks, too. But that's it for the similarities, as this Game Boy Advance title didn't get even a single coat of polish during playtesting. The ball never seems to be connected to the players' hands, making it difficult to see it fall into the basket during a dunk. The game's clock is only visible about a quarter of the time since it's only displayed on the half-court press bench...so unless your eyes are focused on the awkward timepiece during play you'll never know when the period's about to end.  The turbo gauge disappears much too quickly and doesn't refill fast enough to be of any use to players during gameplay. When a player or team goes on fire, the only indication of this ~enhancement~ is a flaming basketball that continues to burn even when the opposing team has the ball. And apparently, and most importantly, no one realized that players can sink full-court three pointers more than 75% of the time. To test this, I set the game to ~Hard~ (its highest setting), and did nothing but shoot full-court shots. Final score: Me: 77, Computer, 55. That, folks, just isn't supposed to happen.   On top of all this, the game's progress is saved via password...so to advance through the season or playoffs, you'll need to jot down a 12 character password. To add insult to injury, NBA Jam 2002 doesn't even have link cable play for multiplayer support, an absolute shame because the NBA Jam series is all about thrashing a human opponent. This is a completely solo outing, and once you've learned that half court shots are sinkable...that's all she wrote.  I'm not one to understand the intricacies of the NBA Jam license, why Midway dropped it and Acclaim picked it up like a smoldering hot potato those many years ago. But I do know one thing: the first Game Boy Advance NBA Jam title is one of the worst developed games on the system thus far. I really wanted to like the game, too, as I've been a huge NBA Jam fan since Midway unleashed it into arcades over a decade ago. NBA Jam 2002 joins the ranks of Mortal Kombat Advance and NFL Blitz 20-02 as ~Good Franchises Gone Horribly Wrong on GBA.~ The game looks and sounds average (except for some extremely repetitive sound bites), but the gameplay and balance is so poorly done it's a wonder how much (or little) time this title actually spent in development.", "date": "Mar 7, 2002"}