{"name": "Knockout Kings 2002", "name_review": "Knockout Kings 2002", "ref": "https://www.ign.com/articles/2002/03/08/knockout-kings-2002", "text": "Four years into its boxing lifespan, EA's Knockout Kings has finally evolved into a boxing game that goes against the grain of each and every boxer EA has published before it. Back in 1998 the series started off with the biggest name licenses in the business, a good variety of modes, and respectable gameplay, aimed in the right direction. After last year's effort, however, which showcased frustrating slow boxer motion and a mechanical feel, but likeable, in-depth training modes, and solid commentary that helped direct gameplay, Knockout Kings 2002 has come out slugging like the young Muhammad Ali: Playful, lighting-fast, and unmerciful.    This year's version is an arcade game through and through, but it's the first game since Mike Tyson's Punchout on the NES that genuinely delivers the same addictive, furious face-pummeling action but that also retains a respectable level of strategy and depth to make the game worthy of a purchase. And if you really want, you can fight in first-person mode, too.     Gameplay   Knockout Kings 2002 is completely different than any other game in the series. EA stripped the game of its usual luxurious gameplay modes, entrances cutscenes, and has even eliminated a training mode, pairing the game down to the nitty-gritty, pure and undecorated slugfest that it is. Bios? Forget those. Ringmen pep-talking you between rings? Nah. Excessive stats? Training? Ha! Knockout Kings 2002 has done away with nearly everything the old series packed, except the boxers themselves and the name.    Is this a bad thing? It depends on your love for the series to date, but it's also important for a series to grow and change. I loved playing Victorious Boxers and even Ready to Rumble for what it was, and Knockout Kings 2002 takes many of the good elements from those series and fuses them into this new iteration. This version is deadly fast, highly addictive in single-player and especially in two-player mode, and it handles the art of boxing in a simpler, yet subtler fashion than Knockout Kings ever did. I definitely feel this version outperforms its predecessors, and though even it posts a few rough spots, this is how console boxing should be -- brutally fast, intuitive, and over-the-top but skill-based. In short, Knockout Kings is a knockout punch.   Following the excellent model first seen in Victorious Boxers: Ippo's Road to Glory, Knockout Kings 2002 uses a meterless interface and a boxer model with an upper torso that's able to swivel fluidly at the waist independently of the hips. Using the left analog controller the boxers move differently depending on their proximity to their opponent. EA has simplified the concept into a circle diagram, of which there are three circles.    For instance, in the farthest ring, players move left, forward, backward or right using the left analog button. As they move closer, they enter into the second ring and the directions remain generally the same, but as they come in close with the opponent, into the closest ring, their actions change. Again, using the left analog button, a slight left move produces a bob or a weave to the left. To pull your head away from the opponent, pull slightly back on the left analog button, and to duck an opponent, move the left analog slightly forward. The moves take some time to adapt to, with bobs and weaves the easier of the bunch, and ducks being the hardest.    The system works well, and in short time you should be having a blast. The X and O buttons are left and right hooks, the Square button is jab, Triangle is right hook, and L1 is block. L2 is an illegal punch, Select is a taunt, R3 is an illegal backhand and R2 is the boxer's special punch of combo. R1 enables players to throw uppercuts. For Southpaw fighters the face buttons are reversed.    In Knockout Kings 2002, players are as close to the boxer's motions as possible, the way they move, punch, duck, and dance around the ring. These boxers move with an incredible sense of fluidity and smoothness. The game runs at 60 frames per second, and never lets down, enabling the player to constantly move and box without technological restrictions. Unlike last year's game, which was a cumbersome mechanical game, players are free to set up their own style of boxing, or to imitate the real boxers themselves. If you want to fight like Sugar Ray Leonard, you can jab and weave, punch and dance all day and night. If you want to fight like Aaron Carr, or Evander Holyfield, you can.     Another instinctive and intuitive control design was to use the dual shocks to convey health and damage. So, if you're about to go down, you'll feel the controls buzzing, and if you're healthy your controller won't be vibrating out of your palms.    But there are, unfortunately, drawbacks to these controls. It takes an awful long time to master bobs and weaves, ducks and sways, and it's intensely frustrating because it's learned in mid-fight, by getting your face bashed in. With a strong sense of offense, pummeling or lining up your moves with combos and counters, none of which is very subtle, Knockout Kings 2002 can be an deft button masher. But the subtle art of ducking and dodging is counter to the heavy-duty offensive strategy. It's all about slight moves, subtle touches, and incredible timing. It's counter-offensive in a sense. And it becomes an issue with which to grapple, especially when you realize the block function is only part of the defensive solution. You need to barely move the button forward, barely move left or right to defend.    Following the same line of thinking, low blocking and low punches are difficult at best, but they're crucial to win. When opponents come at you and try to punch your guts in, what possible defense is there? Do you really duck forward? In real life, you can dodge, dart, or block low, but there is no sensible way to block low punches well. Again, you must duck slightly forward, just barely. It's possible, but it's a calculated risk that may backfire at a crucial time.    Now you can argue that I'm not good at the game, which would be wrong. I did quite well, and I did take my fair share of hits, but I had great fun and I'll play the game again and again, And I know this for a fact -- boxing is brutal. Taking hits is part of the game. Yes, it's hard in the pros, too. But with such a heavy emphasis on powerful offensive play, the defensive aspect of the game shouldn't be this difficult.    Oh yeah, and since I'm in the groove, in Victorious Boxers, players would learn new moves and would be coached (even if it's often awkwardly localized) between rounds. The manager you get? Worthless. He looks and acts like a louse, and gets rid of you after three losses. He doesn't do anything worthwhile. If you're going to give us a manager, make him useful, EA! This guy just gets in the way and adds extra load times. Blah!   Still, the game is deep and remarkably flexible. You can fight pretty much any way you want, imitating styles as you wish, or attuning your play to the boxer's style and strengths. The combinations aren't built in with clunky ~hit this, hit left, hit that, push up~ buttons. Instead, players make it up as they go along. Want to run in with a straight, followed by an uppercut and a roundhouse? Do it. The game teaches as you progress.    Knockout Kings 2002's set up is simple. Players can select Exhibition, Career, or Tournament modes. Exhibition is a single fight against the computer AI or another person, and you can select each boxer in any of the three weight classes of the game, heavyweight, welterweight, and lightweight. Career enables players to select a real boxer or a created boxer who can then slug his way through three tiers of competition for the belt. Tournament is created for four players, computer AI or real, to fight in a single-elimination chart to become the champ.    But despite the simple setup, EA's rock solid roster of pro boxers is there. The overall lineup of pro boxers features 45 of the greatest boxers ever, including the game's star, Muhammad Ali, Sugar Ray Robinson, Lennox Lewis, Felix Trinidad, Oscar De La Hoya, Sugar Ray Robinson, Evander Holyfield, and more. As players progress they'll unlock a handful of extra secret boxers, too. Knockout Kings also features eight venues, including Caesars Palace in Las Vegas; EA's own Redwood Shores ring; England's Wembley Arena; Patriot Arena in Texas; Atlantic City, NJ; Roppongi Palace, Tokyo, Japan; Northern Lights, Seattle, Wa., and Dortmund Garden, Dortmund, Germany.     Graphics  What players should notice right away is how good the boxers look. The shape and form of the boxers' bodies is excellent, and the facial resemblance is highly detailed and artfully re-created for each boxer. On the surface they all look great. As you progress, even more awesome details reveal themselves. Like many games before it, the boxers in Knockout Kings 2002 show facial damage, ranging from swelling around the eyes, to bruises, cut lips, cut brows, bruised brows, and mangled faces. The evolution of damage is pretty awesome to watch, especially in slow motion. The visual effect has a major impact on the realism of the game, and it works wonderfully here.    Speaking of slow motion, two incredible items are revealed when a boxer is knocked out. First, you get to see the brutality of your connection in all its bruising glory. You get to see what hit and where the other player was positioned, etc. And the reaction of the boxer is awesome, just awesome. When you land a hard knockout punch, in the replay you'll see the other boxer's face impact, his lips and face move with the punch, and the head turn in reaction to the force of the punch. It's great.    But, that's when you land a solid punch. When you land an awkward punch, the collision detection's weaknesses are as plain as punch, so to speak. With an awkward knockout punch, the glove may hit the player's side or face, but at a weird angle, and the opponent may move in a completely different way than it seems he should. Sometimes, it appears as if the punch didn't hit him at all. It's no big thing, but when you slow the camera down, all sorts of things show up -- good and bad.    My biggest complaint about the replays between rounds is that nearly every time, they only show one big scene. I'd have liked the option to see more. What's more, since the training mode was zapped, learning from your mistakes during the replays is more crucial then ever. So more replay would have been better. More equals better.   As for the boxer textures, the body skins look brilliant this year. The bodies are rippled with musculature that's accurate and shapely. Biceps and triceps show nicely, while back and stomach muscles appear with graceful lines and it's clear that the artists paid keen attention to every body detail. Most men wish they were cut like this. And, the smooth framerate never drops, keeping the action uninterrupted, and the game looking perfect.    Sound  With the announcers, EA has continued to use them to deliver creating and color commentary, but also to guide and assist the boxer. You can often determine what you're doing wrong if you listen in.    No commentary is perfect, and quite often you'll hear the same phrase repeated, but in Knockout Kings 2002, it's better than most. The colorful commentary is fast, and does a decent job of keeping up. They don't make too many mistakes, either. They also make fun: ~Even I could have blocked that,~ or ~That was telecast for miles.~ The commentators describe your condition, or by describing the opponent's condition, be it dazed, stunned, or staggering, they assist.    The crowd, well, the crowd was ho-hum. It cheers very evenly. Even after a win, the crowd remains at the same level it was throughout the match. I mean I won a few matches and the place was pretty much the same as in the beginning. It's so-so. As for the music, it's rappy, in-house EA-style music, very much like that found in Madden.With Knockout Kings 2002, I found that I was remarkably addicted, but also frustrated with the defensive scheme. The single-player mode is enticing, and the two-player mode is relentlessly addictive. It's hard to go for just one fight with a friend. A single bout turns into five, then turns to 10, and it's pretty much a night by the time you look at your watch. If you buy this, I strongly recommend planning out a whole free day with no other obligations. I also loved the simple Create-A-Player mode (in Career mode), and the point system to build your boxer is very rewarding. I only wish that I could have added points to my real boxer as I progressed. That would have been awesome. All in all, Knockout Kings 2002 is the best boxing game on PlayStation 2 to date, bar none. It's a little heavy on offense but it's still deep and strategic, and you can play as instinctively as you like, and the boxer will respond in kind. I strongly recommend this one.", "date": "Mar 8, 2002"}