{"name": "Ghost in the Shell", "name_review": "Ghost in the Shell", "ref": "https://www.ign.com/articles/1997/12/01/ghost-in-the-shell", "text": "THQ certainly knew what it was doing when it secured the rights to publish Ghost in the Shell in the US. Originally developed by Exact (the team that made Jumping Flash!) for Sony Japan, Ghost in the Shell is a solid, fast-paced action game with just about everything going for it. No wonder THQ nabbed it.  Set in the world of Masamune Shirow's Ghost in the Shell manga, the game concerns the efforts of the Public Safety Section 9, a clandestine government police unit, and its efforts to keep terrorist activity at a minimum. Although the game doesn't look too much like the movie, reflecting the style of the manga (or comic) more, fans of both will be excited to know the game has almost 30 minutes of brand new animation.   But that's not the reason to buy this game.  At its heart, Ghost in the Shell is a solid, third-person shooter. You control a spider-like tank, equipped with bullets and rockets, the latter of which can be locked on to targets. Gameplay is simple -- travel through each 3D level, eliminating enemies. Occasionally there's a slight variation on the theme, such as the presence of a time limit, but it's pretty basic stuff.  The tank controls are, in a word, perfect. Being spider-like, the tank can cling to walls and ceilings, which adds tremendously to the gameplay. What sets this tank apart from other attack vehicles is the sliding strafe -- use both left and right at the same time and you can slide anywhere.  Even the lesser important things, such as graphics and music, are great. The game mimics its manga counterpart well, and the techno music, including tracks from artists like Derrick May and Hardfloor, is superb.  The only real drawback with Ghost in the Shell is that it's a little short. The levels aren't incredibly difficult, and don't really encourage replay.    However, if you're into Japanimation, or just love shooters, you owe it to yourself to check this game out. Sleeper hit of the year, baby.  Adam Douglas", "date": "Dec 1, 1997"}