{"name": "Mister Mosquito", "name_review": "Mister Mosquito", "ref": "https://www.ign.com/articles/2002/03/14/mister-mosquito", "text": "After numerous visits to the Tokyo Game Show, nearby every game journalist at some point has seen or played Mister Mosquito, or ~KA,~ as it's known is Japan. A light, humorous game developed by the small Japanese developer Zoom Inc., Mister Mosquito never ever looked as if it would make it out of Japan because it's a clever, creative game that isn't a sequel and doesn't really have a ~market~ per say, or such is the convention wisdom. Eidos' new division Fresh Games seems to believe there is a market for funny, oddball games from Japan, and I'm in full agreement. Gamers want crazy stuff. The more weird sh*t, the better, I say. One more brain-killing sequel or ho-hum action/racing game, and I'll keel over from boredom.    Gameplay  The aim of Mister Mosquito is plain and simple. As a mosquito, you must feed and store food, i.e. blood, for the oncoming winter (which is not technically very correct, since A., only female mosquitoes suck blood and B., mosquitoes don't ~store blood for the winter,~ as far as I can remember), but as a result your core goal is to terrorize the Yamada family during their traditional summer break at a small vacation home, by breaking up their ho-hum existence and sucking their fresh red blood.    Shown from the third-person perspective, you take on the role of a strange little mosquito, one that appears to be even mechanical in nature, one that changes colors, that grows incredibly fat, and that's remarkably cute. I know what mosquitoes look like up close, and they're not round and cute, with heart-shaped eyes. They're nasty, little, frightening-looking insects. But that's OK, this mosquito is wonderfully adorable, and his quiet bloodthirsty nature makes you feel strangely happy to be him.    Your job is to suck blood, and the first few levels enable you to do so with relative ease. As you fly around the first level, 17-year-old Rena's room, green-outline locations such as a light switch, a radio button, etc., are highlighted. By controlling the mosquito with the left analog and by pressing the circle button once you're in range, you can hit the light switch or the radio switch, which distracts Rena and sets her up for your first attack. She walks to turn off the light, and then lies down in bed to sleep. On her left thigh a small highlighted area appears, and you must fly over to it, and once in range, you hit the circle button and land.    Then the fun begins. By pressing R3, you pierce her skin, and two monitors appear on screen, one that gages the victim's anxiety level, and the other an active gauge that measures the blood pumped out of her. Contained inside the vertical bar is a moving blue bar and a small white circle laid over it. By pushing the R3 button around in a clockwise motion, you must keep the circle inside the blue moving bar, and by doing so, you will successfully drain enough blood to pass the level.    The draining, however, is where you're most vulnerable. What happens as you suck is that the victim's anxiety grows higher, from green to yellow to orange to red, and you must keep an eye on that meter as you watch the drainage meter simultaneously. Once the anxiety meter hits red, two things might happen, you are swatted, or you enter into Battle Mode.  In Battle Mode, one of the three Yamadas, Mr. Kenichi (the father), Mrs. Kaneyo Yamada (the mother), or the lovely Rena Yamada (the daughter), spots you. Then it's a fight.    The whole experience is a whirlwind trip back to the 1970s and it reminds me of the movie The Valley of the Giants, though with slightly better production values, of course. The people are huge; their hands, their eyes, the crotches, cleavage (yes, cleavage), hands, whatever, are all larger than life and players feel the heavy thuds of their footsteps and the powerful winds of their hands pass by as they try to squash you. In another little venture from reality and to win in battle mode, players must locate and attack special Relax Points, located at strange points on the Yamada family. Players can also nail Faint Points, which momentarily daze the opponent.    The trick is timing, of course, and the result is remarkably pleasurable even if you miss the whole voyeuristic aspect, though it's terribly hard to ignore. Still, the game becomes tense as you progress, and the Yamadas grow increasingly angry at your presence. The start using mosquito things like repellent, zappers, and poison fumes to trap you, and they grow increasingly violent, too. To add depth and a little more interest in the game, players can locate extra food, hearts (empty and full), and blood containers scattered in hidden locations throughout each room. It's quite fun to simple explore, while listening to the Yamadas do their thing, be it flower presentation, cooking, bathing, sleeping, etc.    But what really makes the game most enjoyable is that as you progress, the spots you're supposed to hit become difficult to pinpoint and on which to safely remain. In level 7, for instance, you must attack Kenichi on only one spot, his lower lip. The window of opportunity is short, and often results in Battle mode. The air conditioner is on, the fumes nail you indiscriminately, and Kenichi has become quite good at swatting insects in his many years. It gets a little hairy, which is good. Too bad there isn't more of this goodness.    The bodily regions are always good fun, of course, but it's the overall subtlety of the game that truly entertains. You are essentially a voyeur, a purveyor of body parts, and when you're not looking at giant butts and crotches (preferably female), you're in the bathroom attacking Rena's upper breast region while she's bathing. Needless to say, this game was made for gamers, pure and simple. And what's exceptionally great about it is that it's presented on the surface as a simple mosquito...um... arcade game. Yet the subconscious pornographic vibes are strong and present at all times. Still, no parents can truly nail you for getting involved in horribly violent games, because after all, it's a harmless game involving a mosquito, right? Needless to say, the game's perverted subconscious undertones carry a long way here.    The game's biggest problems are that it's short, the camera controls are a wonky at times (you will often see through walls, bodies, or worse the camera will be stuck behind a wall and you can't see what's going on), and that it seems somehow expensive. This game should sell for no more that $39.99. Yes, I understand that I would have to pay more for it on import, and that Eidos is making it cheap for gamers to buy the unit at $49.99, but still, $50 seems a little stiff. The controls need more work, too. Making sharp turns is difficult, and you often feel that much more nimble, dexterous moves should come from a swift little critter such as this.    Graphics  Mister Mosquito is really a terribly basic game visually. The rooms are plain and created to show off normal stuff, such as books, boxes, chairs, and the like, and none of them are terribly well textured, or even artfully portrayed. And though there is a decent amount of detail, the amount of visual detail a mosquito would see would be much more than this. But that's a little too technical. The fact is, Mister Mosquito is an arcade game based on an excellent premise, and its strong points are not visual. The one thing that works great visually, to conclude, is the scope, size, and sense of perspective of the game. You're tiny; the humans are huge. And it's that imbalance, that dichotomy of size, which creates a fantastic feeling entirely unique to Mister Mosquito.    Sound  While the graphics aren't powerful, the music and sound effects are remarkably well done. And in order to fully appreciate the music to its fullest, you must have listened to two kinds of music to recognize it: horrible elevator music and/or that which accompanies a pornographic movie. This is the music of pure porn, ladies and gentlemen, and even though you're not doing anything out of the ordinary for a mosquito, once again, the subconscious undertones of the game are harmonized inarguably in this jazzy, cheesy, wonderfully sleazed-out porn score. It reminds me a little of PilotWings 64, another game featuring great porn tunes. And, though it doesn't mean much to have my blessing, I love this carefully selected musical score.   The other excellent aspect to the sounds in Mister Mosquito is the voice acting, which is also performed with remarkable nonchalance, giving further reason to suspect something else is going on. The narrator's voice is treasonably pornographic, yet perfectly suitable for any educational video. The lovely female voice says things that ring with deep double entendres, reek with implications, and yet all she is doing is narrating a mosquito game. Ahhh, another excellent feature in Mister Mosquito.    The voices of the characters are also performed with perfect subtlety, too. There are a few questions I have, too. Why would a person say, ~ahhh...~ when you prick their skin with your spiky thingamabob? Well, it happens, and if you're a guy playing the game, and you bite a female Yamada and you've heard the lovely moans of a woman experiencing pleasure, well, hmmm...again, another thing to think about. Even you, the little tyrant bloodsucker mosquito, have a voice. After sucking blood, you give out a little playful giggle, perhaps even a little perverted? No! That must just be me... Mister Mosquito is a great game. It's a little short and about $10 more that I care to pay for it, and it has a few camera and control problems, but the game's creative premise, it's brave completion, and the phenomenal amount of laughter (sexually tinged or not, it's really how you see it) and fun to be had here shouldn't be ignored. This is the kind of game that hardcore, import, and eccentric gamers buy systems for, and there are few gamers more original than this. Eidos' deft move to bring this to North America should be applauded. At the very least, rent this, but for hilarious, harmless entertainment, but Mister Mosquito.", "date": "Mar 14, 2002"}