{"name": "Home Run King", "name_review": "Home Run King", "ref": "https://www.ign.com/articles/2002/03/15/home-run-king", "text": "For GameCube owners, it seems there is All-Star Baseball 2003 and then there is everything else. Sega and developer WOW Entertainment have teamed to deliver an arcade take on America's favorite pastime in Home Run King in hopes of competing with Acclaim's simulation offering, and on some levels this new entry succeeds. Home Run King is generally fast-paced, easy to pick up and play and fairly pretty to boot, which should make it very appealing to the baseball passerby. However, the title lacks depth on just about every front, from the limited control mechanics to the lack of gameplay and management modes, and the visuals are hardly on par with other baseball offerings -- oversights that rule out the game to the hardcore audience.  The Facts  Fast-paced, high scoring arcade gameplay Pick-up-and-Play controls, including an easy-to-learn hitting interface and fielding Four modes of play: Exhibition, Season, Playoffs and Home Run Derby Next-gen graphics with detailed player and stadium models Fully customizable players and teams Player specific batting stances and pitching styles Endless animations with everything from hook slides at the plate to leaping catches at the wall Immersive audio brings the game to life with colorful play-by-play commentary and hometown hecklers in the stands Fully licensed by Major League Baseball featuring every team, stadium, and player Endorsed by Houston Astros' first baseman Jeff Bagwell, who appears on the cover of the game   Gameplay Home Run King is definitely an arcade baseball game. The title practically screams this fact at every point, from the easily navigated menus to the speedy play mechanics. The game makes full use of the MLB license for real players, teams and stadiums, and offers four basic modes of play -- Season, Exhibition, Playoffs, and Home Run Derby, all self-explanatory enough. Beyond that, there is a Quick Start option, a Player Create mode, and a Customize feature where players can edit teams and make trades. These are standard offerings per baseball games. Unfortunately, the game lacks any Franchise or Expansion modes, which clearly rules it out for simulation junkies, but is forgivable for the purposes of this review because it's arcade-action we're after.  The batting / pitching interface couldn't be simpler. Different pitch types are selected by pressing in separate directions on the analog stick. Once a pitch is chosen, players have a second or two to align the ball where they'd like it thrown, and then a meter pops up that rises and falls. Pressing the A button when the meter is at its very top will throw the best pitch, and just the opposite. It's a design that's very similar to punting in a game like Madden 2002. Meanwhile, the batter can attempt to guess the pitch that is coming their way by similarly pressing into a direction on the analog stick. If the guess is right, the hitter's sweet spot will widen to reflect it and if it's wrong, the spot will dwindle. Guessing the pitch becomes part of the strategy, and even when players don't guess right they will at least know what's not coming their way, and thus are better prepared. The idea, in the end, is to align the batter's sweet spot box with the oncoming ball. At first, it's difficult to tell where the ball might be going -- there's certainly a process of familiarization involved, but like with so many games, once players realize what it is they need to do, executing on it becomes significantly easier.  Though not nearly as intuitive as in other games, the interface works well enough. When players connect with a ball, they feel it, and indeed it's easier to slam one out than it is in the much more difficult ASB 2003 as this is clearly a batter's game. But there are some annoyances mixed in with the simplified setup. First, there's no way to direct the angle of the hit -- players can only swing and hope the ball goes where they want it to. Second, the time between pitches is downright frustrating -- longer than most simulation baseball titles, and there is no option to speed it up. This is also an apparent problem with the opening cinematics -- they drag on forever.  Unlike Sega's World Series Baseball 2K1, a relative disaster in playability, fielding can be fully controlled by the player (or not, depending on preference) in Home Run King. Outfielders move quickly and swiftly, diving is intuitive mapped to the A button and functions good and proper, and throwing a player out is as simple as pressing toward the direction of the base and the A button. It should be noted that some rather improbable plays in reality are in fact quite possible in the game -- a double play, for example, from a pop-up to far-left field. But hey, it's arcade fun. Finally, running the bases is as simple as using the L and R triggers respectively. All of this works hassle-free and smoothly.      The Player Create mode is useful, but not extraordinary. It serves up a pint-sized selection of different face-maps, along with several different facial styles, skin colors, body types, and such clothing and gear as long-sleeves colors, gloves, and baseball bats. Like much of the rest of the game, it gets the job done, but it's terribly deep.  Graphics Home Run King is a pretty baseball game, but it won't exactly dazzle baseball fans with unparalleled visuals. The title delivers a fair mix of graphic goods and bads. On one hand, the player models are very detailed. They are constructed using a respectable amount of polygons, they sport some truly amazing photo-realistic face-maps, and they animate -- for the most part, beautifully. The different batting stances are particularly well done as the pros wiggle their arms and shoulders in anticipation of knocking one out. Sega has even added a few extra bells and whistles to this area. For example, when the camera zooms up closely to a player on base, gamers will be able to see him blow a bubble with chewing gum, which is a nice touch. The models sport real-time shadowing, but lack any self-shadowing, which is mildly disappointing. Still, the athletes themselves are definitely the graphic highlight of the game.  There are other welcomed additions too. The particle effects are up to par -- dust kicks up from slides, and when a ball is hit in the rain players will notice that water splashes from the field with its impact. It looks very soggy, just like the real deal. There are also some cinematic camera angles that work very well to highlight the play.  The environments, on the other hand, could use some work. The fields always look a little too bright or a little too dark in color, the backgrounds are poorly constructed with blurry textures and the crowds are perhaps the worst we've seen in many, many months -- 2D-sprites and horrendously animated, they look like something from two generations ago. And for some odd reason, Sega has chosen to forego any real filtering, including mip-mapping, and as a result everything in the background as an edgy, jaggy appearance about it -- not especially pretty. Further, the camera occasionally shoots the action from baffling angles, which can be disorienting and close-up shots always seem to be jittery, as if conflicting with an invisible wall.  At least all of this -- good and bad, runs in progressive scan mode for televisions that support it, though. We definitely commend Sega for taking the initiative to make its software compatible for the high-end player.  Sound If we had to choose a shade for the color commentary in Home Run King, it would probably gray. It's uninspired. Basic play calling and, believe it or not, we can actually tell when samples are being connected together to form one coherent sentence -- a drawback which definitely detracts from the atmosphere of the experience. The tones don't match up. But everything else has been covered respectably well. Bats crack convincingly, the crowd cheers triumphantly, and the organ music is in the background to set the mood. Sega has even thrown in some guitar riffs for good measure. GameCube fans looking for a worthy arcade alternative to ASB 2003 might find Home Run King interesting for awhile, but everybody else is much better served with Acclaim's game. Sega's baseball offering is fast at points, tedious others, with a clear emphasis on batting, but no way to really direct one's hit angle or power. The title boasts a decent create a player mode, but lacks the simulation-esque Franchise and Expansion ones, omissions that will be sorely missed by the hardcore audience.If you're in dire need of an arcade experience, I would actually recommend turning up the speed setting on ASB 2003 as the title is otherwise just all-around better. If that's not an option, give Home Run King a try. You probably won't be disappointed, but you certainly won't be wowed either.", "date": "Mar 15, 2002"}