{"name": "SEGA Soccer Slam", "name_review": "Soccer Slam Review", "ref": "https://www.ign.com/articles/2002/03/15/soccer-slam", "text": "Although Madden still took the spot of best-selling sports game last year, it's no secret that the market for extreme sports and action sports games is growing every month. A quick look at 2001's crop of sports games will show you that for every Madden, there is a Blitz, for every NBA 2K2, there is an NBA Street -- and 2002 doesn't look much different. Incidentally, it's the world's most popular sport, soccer, that doesn't seem to have an action counterpart. Sure, FIFA skews more on the simulation side whereas Virtua Soccer is a bit more arcadey -- but we're talking no-holds-barred multiplayer action where the referee likes to check out the chicks on the jumbotron rather than interrupt the game for off-site calls and fouls. Cue Sega's premier sports developer, Visual Concepts. Together with Black Box Games (of NHL Hitz) fame, VC is finally ready to plug that gaping hole with one hell of a soccer arcade game.   The Facts   Lightning quick gameplay, featuring furious three-on-three action, plus goalies No holds barred action lets you clothesline other players and perform brutal tackles  Earn player power-ups for increased abilities Collect bonuses including secret stadiums and concept art Choose from five game modes Variable game speed (three settings) Wear down goalies by relentlessly bombarding them with violent kicks Rabid fans embrace favorite teams with chanting and boo their opponents Intuitive controls let anyone jump into the game and advanced techniques leave room for professional depth Vibrant graphics complement the surreal stadiums for many varied fields Detailed character models are lushly animated using more than 1000 motion-captured moves and signature goal celebrations Different weather conditions (clear, fog, snow and rain) Matrix-style camera tricks heighten the sense of fantasy The stylistic cast of characters is brought to life with voiceovers  Up to four players can compete on the same side or against each other   Gameplay Soccer Slam features five basic game modes: Quick Start, Exhibition, Tournament, Training, and Quest. The Quest mode is the center of the single-player experience where you will attempt to beat opposing teams in a set of matches and bonus challenges, similar to Sega's own Virtua Tennis. You'll have your pick of six multinational teams. Light your fire with team El Fuego, storm the field with Tsunami, spark up your life with Volton, or go for Toxic, Spirit, or Subzero. The choice is yours. Each team is comprised of three individual players plus a generic goalie. The players themselves are funny characterizations of cultural stereotypes. Some are of course more memorable than others, but no matter which team you'll pick, you're guaranteed an eclectic mixture of memorable cartoon, umm, athletes. For example, there's an English punk, a Mexican wrestler known as El Diablo, an American ~football~ star, a snooty French soccer star, and a blue-haired techno-loving chick named Lola from Germany (Run Lola Run, anyone?). Each player comes complete with his or her own set of taunts and special moves, as well as slightly varying abilities. Like in cart racing games, the fatter players are slower but stronger, the smaller guys are faster but don't pack much of a punch, and so on.  The first time you play Soccer Slam, you'll be surprised at how tiny the playing field is. It takes a standard player about five seconds to run from one end of the field to the other. While that may sound like it's too confined, once you start to play you will notice that it's really the perfect size for this type of game. Soccer Slam is not about intricate passing games or about strategically setting up a winning formation. It's all about speed and non-stop action. You never have to wait -- unless your opponent chooses to torture you with a replay of his latest goal, of course. In a nutshell, Soccer Slam is this: Pass the ball, punch your opponent in the teeth, pass the ball, transform yourself into a human torch, pull off a bicycle kick in the air and try to score in the most spectacular way you can. The action is as much soccer as it is Final Fight. You can foul, punch and slide tackle your opponent without worrying about ever getting red-carded. As a matter of fact, there's no referee in this game at all so the rules of soccer are all distilled down to the smallest possible denominator: get a point by kicking the ball into the goal. Want to punch the goalie's lights out while your buddy sets up a goal kick? Go head. Just don't come crying to us later when the goalie goes medieval on your ass in return.  Team Fuego versus Team Toxic.  As mentioned above, the Quest Mode is very similar to Virtua Tennis in that it doesn't only include regular matches, but also special bonus challenges that revolve around some of the moves available in the game. One challenge requires you to score goals via one-twos (you don't get a point for directly shooting at the goal), an other one requires you to perform a Spotlight goal -- one of two special moves that puts the game into ~bullet time~ when you execute a shot from a specific spot on the field. The controls in Soccer Slam are spot on. It will only take you a few minutes to figure out how to perform low and high passes or how to deliver a super-charged volley that will make your opponent drop his controller. The game is easy to learn, but possesses enough depth to the controls to separate the beginners from the longtime players. Some of the more advanced techniques require a bit of practice, but thanks to an intuitive Practice Mode everyone can learn to play Soccer Slam like a pro in no time.   Do you often play multiplayer games? As you progress through Quest mode you earn cash from both matches and challenges which you can use to buy your team power-ups and concept artwork (which contains codes, such as Big Head Mode, Black & White mode, etc). Because each team is rated by speed, hitting, passing, shooting, and stealing, each item will help improve upon one of them. Get the shark teeth shin guards to improve hitting or get a pair of earrings for better stealing. There are a total of nine power-ups per team -- three per player (not including goalie), which play a major part in defeating the harder teams as you progress. Every time you finish the Quest mode with one of the teams, you unlock that team's home stadium. Sadly, that's about it as far as single-player depth goes. The game is a blast to play, but after you've played through the Quest mode with two teams the novelty starts to wear off. It would be a different story if you could unlock additional teams (where's our Sonic, Tails, and Amy team?) or if the new stadiums actually had special features for the players to interact with. As it stands, the new stadiums are merely eye-candy, which is a waste considering the over-the-top look and feel of the whole game. How cool would it be if the arenas were more than just flat fields? I could imagine a level with a river in the middle that slows you down slightly (unless you cross the bridge in the middle)... Or how about a stadium that goes slightly up-hill giving one team an advantage during the first half and the other one an advantage during the next? An arena with less gravity, perhaps? The possibilities are endless -- but even some basic interactive elements on the sidelines, a create-a-player, or a bomb tag mode could have broadened the game's appeal in single-player considerably.     Thankfully, the inclusion of power moves (pulled off by hitting the L button) and the killer- and spotlight kicks add a bit of variety to the game. Killer Kicks are performed by building up your power meter all the way, then passing the ball high into the air. A cone of light will then appear from which you can deliver a devastating goal kick. The Spotlight Shots are similar, but you don't have to pass to set it off. Instead, you have to track down a team-specific moving spotlight that appears on the field from time to time and deliver the shot directly from there. Both maneuvers will move the camera behind the player and switch the game into slow motion, drowning out most of the audio except for a player specific chant. It's a really sweet effect that makes scoring all the more exciting. And the developers were nice enough to include a fairly large number of options, including four difficulty settings, variable game speed, manual and automatic goalie control, as well as adjustable side, corner, and end camera positions.  A manual replay mode would have been a nice addition (there's only an automatic one when you score) to relive some of the nastier tackles, but the overall lineup of options is solid.  Multiplayer While the single-player experience isn't bad, Soccer Slam is a multiplayer game at heart. If you have two or three buddies who love to play videogames, you simply have to own this game. Second only to Super Smash Bros. when it comes to four-player fun, Soccer Slam lets you play cooperatively with two friends through the Quest Mode, or compete against each other in four-player matches of any configuration. There's no set-up time -- you simply move your icon to the team you want to be on, or, if you want to lock yourself into controlling a specific character, the player you want to control. Everything is just as slick and fast as it should be. Load times are kept to a minimum after the initial load and you can bypass victory celebrations and goal replays at the touch of a button. Add to that plenty of funny one-liners that the characters spurt after scoring a goal and you've got an instant party favorite. Get Smash Bros., Monkey Ball, and Soccer Slam, and you've got enough multiplayer goodness to last you the whole year. Graphics Soccer Slam goes for an over-the-top cartoonish look that's a far cry from the stuff you've seen in other soccer games so far. The characters are nicely detailed down to their accessories and animate extremely well. The developers did a fantastic job on making sure all the characters have a personality of their own and the attention to detail really shows in their varied running animations, mannerisms, and special moves. There are also some nice special effects for the power-up moves, such as trails of fire or puffs of smoke that resemble skulls. Texture-wise, the game doesn't break any new grounds. The grass textures looks nice when the camera zooms in close and the field deteriorates over time, but some of the field logos look pixilated and the actual stadiums could have used a little more panache. On the flipside, Soccer Slam features animated polygonal spectators that are a huge improvement over the usual 2D crowds. Framerate, you ask? How does 60fps sound? The game runs silky smooth at all times with now slowdown in sight. The menus and overall presentation are high quality as well, making Soccer Slam really stand out among the slew of shoddy ports GameCube owners had to put up with over the last few weeks.  Weather effects are in the game, but only for looks.  If you've got a DTV/HDTV you'll also be happy to hear that Soccer Slam features progressive scan support (but no 16:9 mode, like most GCN titles so far).   Sound Soccer Slam forgoes the licensed ~flavor of the week~ music that most sports games tend to go for nowadays and actually features a really nice selection of techno beats and character-specific jingles. Sound effects and surround crowd noises are also quality stuff with good use of the rear channels, but the commentary is a major disappointment. Tim Crofton's deadpan delivery may sound like real (British) football commentary, but he just doesn't have a lot to say. Given Sega's track record with funny and varied commentary in the past, it would have been nice to actually have Crofton comment on the players' backgrounds during the game. Off-beat two-man commentary, a la ~Best in Show,~ would have really fit to the hilarious visuals. I remember what I said to Midway the first time I saw NFL Blitz: oh, please do a Soccer Blitz next. It's ironic that the company that I'd never thought would release a game for a Nintendo platform has fulfilled my wish -- and delivered a game that's almost everything I expected it to be. Soccer Slam is fast and it arrives with enough personality to even appeal to all you jaded Americans who still think soccer is for moms and your little brother. The single-player experience is fun for awhile, but it's the four-player mode that really has us coming back for more. I really hope Soccer Slam sells well because it's got all the right things to be the foundation for a kick-ass franchise. If Black Box and VC can build on the game mechanics and deliver a deeper title with the sequel, there's no stopping Soccer Slam.With FIFA, ISS, and now Soccer Slam, the GameCube is truly turning out a soccer fan's dream console. Get this game. Your friends will thank you.", "date": "Mar 15, 2002"}