{"name": "Blood Omen 2: Legacy of Kain", "name_review": "Blood Omen 2", "ref": "https://www.ign.com/articles/2002/03/21/blood-omen-2-3", "text": "The legacy of Kain continues in this sequel to the original Blood Omen that appeared on the PlayStation. Blood Omen 2 marks the next generation debut of everybody's favorite vampire universe and the team at Crystal Dynamics has loaded Kain up with all kinds of blood-related goodies to keep gamers in the land of Nosgoth. It's arriving on PS2 and Xbox at the same time, so there's no port lag to worry about and we can tell you that the game looks noticeably better on Microsoft's hulking black box.   While the story is as rich and engaging as ever, it seems like the Blood Omen 2 negates some of its fun and interesting innovations by slowing down the pace of things to make sure we appreciate how fun and innovative it is. If you want some background on where this story is set in the Blood Omen universe feel free to peruse our selection of Blood Omen 2 features. Otherwise, just hop on down to the game review.   The Dark Gifts of Blood Omen 2 Interview With A Vampire History of Kain   Gameplay Blood Omen 2 has several layers of gameplay that are supposed to combine into one vampire-on-a-vengeance-trip adventure in the Blood Omen universe. The problem isn't the amount of things you can do, because there are puzzles to be solved, Dark Gifts to be used, blood to be sucked, attributes to improve, etc; it's the pacing of the overall game.   Kain's on a mission to regain his memory and his powers in Blood Omen 2. In the beginning his Blood Meter and Lore Meter are relatively short, he only has two Dark Gifts and no weapons. Draining the blood of enemies instantly fills up the Blood (life) meter and slowly fills the Lore Meter. Opening Lore Chests will fill up the Lore meter more quickly and when it fills up all the way, both the Blood and Lore Meters get a little longer. Late in the game your meters should stretch all the way down the left side of the screen. This is important because Kain needs blood all of the time. His health drains even when he's not being attacked so that if you take to long solving a puzzle, you'll need some bloody refreshment from some poor soul when you're done. This adds a layer of strategy because you don't want to waste potential snacks, by just randomly killing people and draining their blood when you don't really need it.  Draining the blood directly from the chest of the victim directly into his mouth in a little mini-cinema, is what makes Kain such a compelling character. Each time you do it, there's a different low angle camera shot that's supposed to prevent it from becoming a tedious task.   Just another bloodsucker in town  But the manner in which Kain ices his victims is what gets repetitive. Squeezing the right trigger locks onto an enemy and readies Kain's weapon or claws. Hitting X attacks, but repeatedly tapping X executes a sequence of moves that can be devastating if they land cleanly. However, Crystal Dynamics wanted each fight in Blood Omen 2 to be a unique encounter within itself, so enemies will block and counter your moves. The stronger the enemy, the faster and better trained he or she will be. The powerful Glyph Guards with their glowing armor, will put you to the test every time as they block, counter and use charge up attacks as effectively as you would. Because the fights with each enemy have a certain pace to them (ie. slower than you want it to be), coming across two or three Glyph Guards, for example, made me want to avoid them rather than waste time taking out each one of them. I found myself impatient, always wanting to get to the next part where I can do something cool like using my Dark Gifts.     The Dark Gifts: Mist, Jump, Charm, Telekinesis, Fury, Berserk and Immolate are the best parts of the game. You don't get to use them as often as you want and there's not much freedom involved. You start off with Mist and Fury as your powers. Mist allows you to become invisible, but only when you see that there's a low fog covering the ground at your feet. While invisible you can sneak up behind guards and do a kick ass assassination move that gets you one of those mini-cinemas with the cool camera angle. But the thing is you can only turn invisible when the fog is around and you can stay invisible for as long as you want while you're in the fog and not jumping or sucking blood. You will use Mist to sneak by guards and kill whatever saps happen to be standing in the fog with you, but once you've snuck and killed everybody, there's no other compulsion to stay invisible.   Jump, Charm and Telekinesis fall into the same category of situational Dark Gifts. Jump can be used to supernaturally propel Kain forward across great distances, but really it's only supposed to get you across wide open areas. Charm allows you to take control non-aggressive characters over a limited distance but usually it will be used to get somebody to open a door for you. Same thing with Telekinesis.  When you have Fury, Berserk or Immolate selected on the Dark Gift menu, they'll automatically activate once your Rage Meter fills up. The Rage meter gains energy whenever Kain successfully blocks an attack. Good players will use manual blocking where you have to squeeze the left trigger and point the left analog stick in the appropriate direction to block an overhead, low or side attack. Suckers will use automatic blocking which only requires you to squeeze the trigger sometime before an attack. Anyway, Fury adds a powerful energy melee attack to Kain's arsenal. The Rage-related Dark Gifts end up being very useful in your war against humans and vampire sellouts.  The puzzles in Blood Omen 2 are basic level stuff and veterans of past Blood Omen games won't be intimidated at all. Some of the puzzles can be complicated without being difficult because they require a sequence of actions and lots of doubling back. This helps slowdown the pacing of Blood Omen 2 as well.   No bright colors, at all, ever.  One of the more annoying features of Blood Omen 2 is the fact that you can't skip through extended cutscenes once you've seen them for the first time. They're very well done thanks to great voice-acting and move the story along effectively but you don't want to have to sit through 4 minutes of dialogue every time you die and restart at a boss level or some other crucial part of the game. Perhaps this is more of a criticism of the save point placement, but watching cutscenes over and over again when you just want to get through a tough part is frustrating, period.   Graphics The look of Blood Omen 2 is consistently dark and gothic with impressive texture work but there are a few problems. The camera work on the mini-events that you trigger --like sucking blood-- often shows off some of the game's clipping problems. The limbs and weapons of enemies that you've killed can be seen sticking through walls and poking out the other side.  The overall animation is solid even though it can seem a bit unnatural sometimes, especially with Kain himself. The flow from one animation into another, such as from walking into a throat grab, isn't very smooth. There are slight hitches as Kain goes from putting one foot in front of the other to reaching out for the enemy's throat like the second move is interrupting the first in midstream. So even if Kain's actual grab or slash looks convincing, the transition into and out of the individual actions make the overall sequence look stiff.       Kain looks the part of a badass vampire because his character model is more detailed and polished than any other character in the game. His multiple costumes and armor are very well done, even the open-chest outfits that allow him to show off his pecs and six-pack. Whatever weapon he's carrying will be holstered on his body whenever he's not using it. Most of the time you're seeing the back of Kain's head, but during the cinema sequences you can appreciate Kain's vampire facial features like his fangs and 80's pop star hairdo.   The environments in BO2 are very dark and depressed like you'd expect from such an oppressed land. But well done wrought iron gates and cobblestone streets reinforce the harsh living conditions in Nosgoth. Plus since you're out at night most of the time, there's always subtle outdoor lighting effects to impress you. It's subtle because you won't see any reflections on Kain when you pass by a street lamp but you will see shadows form and stretch around his body.  Sound:  The voice acting in Kain is top notch and the source of much of the game's humor. Crystal Dynamic's inside track to a wealth of British acting talent makes the vampire characters in Blood Omen 2 entertaining enough, that you'll look forward to each cinema. The comedic moments occur Kain only has one personality trait: pompous so he doesn't always understand when working class people use working class colloquialisms. When trying to sneak into a factory, the guard asks him who we works for, to which Kain replies ~I work for no man~ in his best stage performance baritone. He speaks the truth, but the guy isn't going to let him in with an attitude like that.   The haunting background noises, like the cool evil wind that always seems to blow around vampires, provide a nice big chunk of the supernatural ambiance you want from a Blood Omen game. There are spooky cats and crows doing their thing as well, making this game sound like a virtual Halloween game.   The grunts and howls of enemies, and Kain, taking damage are nice and chilling and vary by sex and method of death. Jamming a sword through somebody's neck sounds different than just lopping their head off. The voice acting among the townsfolk is also extremely well done. You can clearly overhear conversations when you're near other characters talking to each other. But when you pull out you weapon and start to approach them, you'll hear the change in their voices as they beg, stammer and feign bravery at the site of a threatening vampire. I enjoyed the best parts about the Blood Omen 2 like using the Dark Gifts and some of the more interesting combat methods, but I felt I had to work to hard to use them. I don't mean it was too tough beating boss characters and enemies, I'm talking about after I've earned the cool stuff. When you earn powerups and new items for your character, you want to feel like you've got an immediate advantage instead of a delayed enhancement where you'll get to see how awesome it is later rather than sooner.The story and presentation are excellent and the series hasn't lost anything with this first Xbox game in the franchise. Graphically and aurally it's a step forward for the Blood Omen universe but this game has some strong competitors in GUNVALKYRIE and Max Payne; two third person games with great sound and visuals as well. Longtime fans of  Kain and Raziel should be satisfied and casual gamers can rest assured that Blood Omen 2 is among the better half of games in the genre. You know, the half that doesn't include New Legends and Obi Wan.", "date": "Mar 21, 2002"}