{"name": "Shrek Swamp Kart Speedway", "name_review": "Shrek Swamp Kart Speedway", "ref": "https://www.ign.com/articles/2002/03/27/shrek-swamp-kart-speedway", "text": "PDI Dreamworks' 2001 film Shrek will go down as one of my top ten movies of all time. It's a brilliant piece of filmwork, from the clever writing to the beautiful CG animation...and I pop the DVD in almost monthly because it's just that good a flick. Videogame renditions of the Shrek license, however, have not fared anywhere near as well. Last year, we saw a really crummy fighter for the Game Boy Color in the form of Fairytale Freakdown. You'll have to trust us on this one; we never got around to fully reviewing this GBC game, but it was oh-so-bad. The development team responsible for that game was commissioned for Shrek's first Game Boy Advance outing in Shrek Swamp Kart Speedway...and unfortunately for the green guy, he has to headline one of the worst developed games on the system. Features Eight racers Four hidden characters Battery save Link cable support for four players (multiple cartridge) Only for Game Boy Advance Shrek Swamp Kart Speedway is an incredibly unimaginative, poorly developed racing game featuring characters from the Shrek movie in a substandard Mario Kart clone. The design features twelve characters from the flick scurrying around sixteen different track locations in custom-built go-karts. Players drive over fairytale books (which look like videocassettes if you ask me) to pick up power-ups -- if the book is white, you'll acquire offensive weaponry like projectile pumpkins, or a shrinking spell. Hit a black book, and you'll get hurt by a temporary spell. Collect four Shrek icons and you'll be able to pull off a special move specific to the character you're playing as.  TDK, Dreamworks, and even Prolific must've known how lousy this game was when the game left for manufacturing...it's hard to pick up this game and get a positive first impression with this racing game. Everything about this game has a rushed feel, from the poorly rendered characters that are completely unrecognizable during races, to the terribly chunky graphics engine that can't even look half as nice as other racers on the system, to the repetitive music and gargled sound effects that could have been done on the Game Boy Color.   The game engine's definitely the item that most people will notice about the game's quality; this less-than-30 frames-per-second chopfest causes a terrible strobe effect on the poorly-rendered road textures, making it look like the road's animating in the wrong direction as you drive over it. Objects on the track are hovering sprites that you can drive through, but they're of so low quality that they're incredibly hard to make out...and the choppy framerate makes it even worse to see these things. And when you try to throw pumpkins at opponents, they'll disappear out of sight in an extremely jerky animation...with the victims disappearing awkwardly off the screen.  There's nothing terrible about the way the cars move around the track, because the designers mirrored the control scheme of Mario Kart: Super Circuit for Shrek Swamp Kart Speedway. But the collision detection is lousy and unfair; ram a computer AI opponent in the rear and you'll come to a near dead-stop...but if the AI opponents ram you, they'll just fly right through your car, causing you to come to a near dead-stop. This game also lacks an incredible amount of necessary polish. Characters will shrink and grow from an enemy attack (not very original, I might add) in a clumsy single frame blip. Races end with absolutely no fanfare...the same repetitive music during the race continues to play as if nothing's happened. Times aren't recorded to the cartridge for future reference or personal challenges. And, the one thing I can't figure out: all the locked tracks are completely accessible in the training mode. Huh? Where's the sense of discovery if you can play all the tracks at any time? Sure, there are four hidden competitors to unlock, but the instruction booklet gives away their identities. This game is an absolute embarrassment to the Shrek name...I can't imagine anyone picking up this title over Mario Kart: Super Circuit. There really isn't anything about Shrek the movie that would lend itself to a memorable racing game, and the development team pretty much confirms this with a terribly designed Game Boy Advance title. This game absolutely could have been better with improved programming, art, music...but as it is, it's nothing more than a cartridge that'll be sold based on name alone. And judging by the sales numbers of the first handheld Shrek game, the game will most definitely sell regardless of the content.", "date": "Mar 27, 2002"}