{"name": "MotoGP [2003]", "name_review": "MotoGP", "ref": "https://www.ign.com/articles/2002/04/02/motogp-4", "text": "Though it may share the name with a popular PlayStation 2 launch title, MotoGP on the Game Boy Advance is completely unrelated...other than the logo that brands the cartridge, this game is its own design. Honestly, with what Visual Impact built on the GBA, THQ could have gone the Sega route and branded it as Hang On 2002, because this arcade racer feels a lot like Sega's classic arcade game more than anything else. It might have been a recommended game, too, but the designers of MotoGP didn't realize that portable gamers need a more convenient way to save...it isn't friendly for short gameplay sessions. Features 16 tracks Four play modes Password save Link cable support for four players (multiple cartridge) Only for Game Boy Advance  In the game, it's a simple challenge of being the fastest around each of the 16 tracks in the Tournament or Grand Prix mode. As you're bolting for top slot, you'll have to pass your competitors...accidentally nudge into them at top speed and you'll find yourself knocked into a billboard or pylon. Take a turn too sharply, and your bike can kick out from underneath you or send you skidding into the roadside objects. Get too far behind, you can pull off a ~wheelie~ turbo move to get you back into the game. The developers unfortunately went a little simplistic on the controls, though, as you don't have the ability to turn manual shifting on...this is automatic shifting all the way. The L and R shoulder buttons are not used during the races at all.  Like Sega's Hang On or the bazillion other old-school racing games of gaming past, MotoGP utilizes a behind-the-vehicle perspective for the action. And the engine Visual Impact produced on the Game Boy Advance is actually pretty slick...in a simplistic sort of way. The road texture is a detailed bitmap that scales under the bike, with an extremely fast motion and smooth framerate. Roadside objects are plentiful and full of variety, zipping past your bike on either side. But strangely, the road doesn't turn with the bike...instead, it scrolls left and right as the bike swerves to either side of the track. This technique does cause a bit of a problem with the viewpoint, though, as it honestly appears as if your bike is pointed off the track when it's actually not...only when your bike is in the middle of the road does it look like it's pointing in the right direction. It's a minor distraction at any rate...the illusion of speed is pulled off extremely well in this engine.  The game is a very tight racing game with good graphics and decent control (minus the inability to upshift or downshift), as well as four player support through the use of the link cable. But the kicker: password save that doesn't offer many save points. In the tournament mode, you're only offered a string of text after all four races...and that could honestly last for 20 minutes. And in Grand Prix mode, you're forced to race through all 16 sessions...without a save. Not putting save RAM in the cartridge is one thing...racing games really need the ability to record the best times per track, and passwords just can't do this. But to limit the places where you can save...that's just wrong. It's extremely inconvenient when you can't shut off the system after a race, especially when you're playing on the road.  As a simple racer, MotoGP could have been a lot of fun if it wasn't such a hassle to play through. You literally have to give the game at least 20 minutes each session to record any progress you've made in the game...an incredible real drag, especially in the world of portable gaming. MotoGP is a way better than average Game Boy Advance racer in looks and control, but the saving feature is a real annoyance and hurts the enjoyment something fierce.", "date": "Apr 2, 2002"}