{"name": "Tetris Worlds", "name_review": "Tetris Worlds", "ref": "https://www.ign.com/articles/2002/04/04/tetris-worlds-2", "text": "I've often wondered if Alexey Pajitnov is the world's wealthiest Russian. Not only did the now legendary mathematician create the phenomenon known as Tetris, he's managed to sell over 60 million copies of the puzzler worldwide. PDA's, calculators, computers, consoles, and even wristwatches are but a few of the endless list of platforms we've seen the popular game appear on for the last 17 years. You'd have to think with a streak as lengthy as that one, Alexey is lighting his cigars with copies of golden age comic books by now.   Entrepreneurial uncertainties aside, we now find PlayStation 2 owners as the latest targets in the ongoing dropping-puzzle blitz known as Tetris. This time with shiny new features, upgraded graphics, and an eerie new age ambient soundtrack, THQ's latest port should be the most definitive, jaw-busting, and inspiring version of the series ever or least for the first half of the year before yet another variation hits the streets.   What we ended up getting however, in all its complexities and bonus options, doesn't live up to the legacy of the great puzzlers before it. Be it Klax, Columns, Dr. Mario, or even the old Gameboy Tetris itself, Tetris Worlds is a sheep in wolf's clothing.   For the first time in recorded memory Pajitnov's creation has a full-out Story mode. Not exactly on the same level as other well-conceived game plots like Space Invaders or Pong, the true genesis of our beloved Tetrions has finally been revealed. Apparently the only remaining evidence of an ancient space-faring race of ~block-people~, the Tetrions are gateways to solar systems thousands of light years away. Of course, no one in the universe can use those gates unless they figure out the secret that's been hidden in the mystical bricks. But as anyone in their right mind knows, sentient beings have better things to do than stare at a bunch of colorful angular rocks all day (even Greedo).   Nonetheless a robot race known only as the Minos has at last figured out their secret, and in a plot twist so breathtaking it belongs in a Michael Bay film, need the best Tetris players in the world to help them use the blocks for terraforming distant worlds. In short, there are a bunch of strange looking backgrounds, and this is why they're there. Please hold the applause until after the magic show.   Oscar-winning story aside, Tetris Worlds offers six different modes of play. Selected from the ~Arcade Mode~ option hub, there are all sorts of new (but not necessarily fun) ways to tackle the Tetrions. The first, appropriately titled ~Tetris~, is the old school game we grew up with at about 50 miles per hour under the speed limit. Conquer all 15 stages of madness and you can graduate on to one of the next demon-spawned variations.      ~Square Tetris~ challenges you to make a perfect 4 x 4 square while playing by the rules of the original, and ~Cascade~ asks you to clear just that; cascading blocks created by previous line clearing. The more you can clear per Tetrimino, the bigger your bonus (and headache). Next up is ~Sticky Tetris~, where blocks of the same color stick together in an annoyingly bothersome way on the journey to clear the bottom row (probably the closest we came to having fun other than the basic mode). And finally, we have ~Hot-Line~ and ~Fusion~. While ~Hot-Line~ asks you to clear the blocks from six designated spots of difficulty, ~Fusion~ needs you to get rid of one solitary fusion brick for purposes we'll be pondering long after the Mino Extinction.   Putting it all together Blue Planet's latest is a boring mess of shoulder shrugs and eyebrow twitches, with incredibly slow block movement and a terribly delayed response time. When the object of a given puzzle is to clear gigantic stacks of rock-things as quickly as possible, lagging behind at a snail's pace is a serious problem.   There are a couple of multiplayer modes and an interesting ~information~ section that tells you about the history of the game as well, but since Tetris Worlds is no fun regardless of how many people are playing it, finding out how some Russian dude swapped yachts with Bill Gates while hobnobbing with your buddies isn't exactly an asset.     Aesthetics have never been the series strong point, with both graphics and sound effects several generations behind the rest. This particular vision continues that theme with little to no improvement in either department, and almost makes you wish for the old NES cartridge for comparison. Nearly two decades after its inception, it's strange to find the older sibling more appealing to look at than the younger one.   In the end we find ourselves thoroughly disappointed with the successor to a once great series of puzzlers. Best likened perhaps to trying to improve on the ancient game of chess, the old adage of ~if it ain't broke, don't fix it~ shoots into our skulls like the contents of dirty Civil War musket. If you're looking for a rewarding block-dropping experience however, save yourself the thirty-five bucks and pick up a portable version. Chances are it'll be cheaper, more fun, and less inclined to promote suicidal megalomania. I don't think I've ever been this unimpressed by a Tetris game in my entire life. I've been playing the game since it was conceived in the late 80s. I've seen how profound an influence it has had on modern puzzle game design. But, never, ever have I been so disappointed with Tetris. THQ's Tetris Worlds is below average and even for the discounted price, it's not worth the buy. The intended visual and aural ~improvements~ to the GameCube and Xbox versions were a waste of time. Instead the gameplay should have been totally reworked, especially the multiplayer mode. So, unless you're dying to just play Tetris -- any Tetris -- on your system, don't even bother with Tetris Worlds. The point is that there's nothing new and the peripheral elements such as art and music composition are dull to the point of being abominable.", "date": "Apr 4, 2002"}