{"name": "ESPN MLS Extra Time 2002", "name_review": "ESPN MLS ExtraTime 2002 Review", "ref": "https://www.ign.com/articles/2002/04/05/espn-mls-extratime-2002-review", "text": "With the 2002 World Cup Tournament just around the corner, it's no surprise that console soccer games are a dime a dozen right now. Since EA's got the official World Cup license locked up in the US, other sports game makers are trying their best to stand out and convince footie fans that their game is the one to get. The lineup is fairly clearly defined: SEGA's games cater to arcade gamers, FIFA skews more on the sim side, and Midway's RedCard falls somewhere in between. Konami, a football fan's favorite in both Europe and Japan, joins the fray with the US incarnation of its popular Winning Eleven franchise. But while Konami bestows Japanese and European players with new versions of Jikkyo World Soccer and ISS, American gamers essentially what looks like a version of last year's Winning Eleven -- but isn't nearly as much fun. Not a bad game, by any means, but a disappointment nonetheless considering Konami's high profile soccer releases in the past.  The Facts   Full MLS license for authentic teams and players Over 100 teams (10 MLS squads, 61 national, 24 club, two All-Star and four original teams) ESPN presentation for a TV-like appearance Commentary by Jack Edwards and Luis Tapia Match Mode, MLS Mode, League Mode, Cup Mode, Scenario Mode, and Training Mode Player & Team Editor Four-player support   Gameplay In addition to the ESPN moniker, Konami's latest tries to set itself apart by prominently featuring the MLS license. Since the MLS is now only made up of a mere 10 teams (down from last year's 12), the game also features plenty of national teams (albeit with generic player names) so that players can stage their own mock world cup. Unlike EA's 2002 FIFA World Cup which basically dumped everything outside the title cup tournament mode, ExtraTime offers league play in addition to international competitions (International, Open, European, African, American, and Asian Cup) and the series' signature Scenario Mode. As the name suggests, the MLS Mode is really the heart of the game. You basically take one of the 10 available teams through five consecutive seasons, complete with retirements, trades and drafts. In case you're wondering, retirements occur at random once a player is 33 years or older (rumor has it that all retired players move to Japan, make millions (of Yen) off of vitamin drink commercials, and live in apartments the size of our bathrooms).   ExtraTime is based on the Winning Eleven engine, and though it has all the makings of a great soccer title, it falls slightly short of the mark. At its best, the game serves up competent soccer action for up to four players (only in Match Mode, the other modes are single player only), but it's not enough to effectively tackle the competition. Let's start with control. Considering we've been playing sports games using analog controllers for a few years now, it's high time Konami gives us full analog control. The game is billed as having 360 degree analog control, but that's not quite accurate. Outside free kicks and throw-ins, the control is still eight-directional, which becomes painfully clear when you're trying to run a nice arch and pass the ball into the goal area. You either run right, diagonally to the right, or up. There is nothing in between, which translates into a slight delay even when you're trying to make minute directional changes. Ironically enough, the Xbox game actually features analog button support. There is also no effective way to curve your ball, which, coupled with the restrictive control scheme, gives the whole game a very rigid feel. On the upside, ExtraTime's overall pace and flow is fast and smooth, which makes you almost forget some of the shortcomings.  The players look good from far away, but once you zoom in they reveal their blocky nature.  The game is viewed from a moving sideline point of view -- just as it should be -- but I haven't met anyone who is actually willing to play the game using the default camera view. Konami may have done it to give the game a more TV-like appearance, but the camera is zoomed in far too close for comfort. Soccer is about passing and setting up strategic plays -- even with the on-screen radar, passing is an utter game of chance if you can't clearly see if your players are free. Luckily, you can manually adjust the camera and move it farther away (though not as much as in this year's version of ISS) without any impact on framerate. The passing game is functional, though it, too, feels a bit behind the times. You can still do 1-2 passes, but whereas most new soccer games offer you some sort of control to set up player runs, you'll need a second human player to effectively do it in ExtraTime. Thanks to manual and semi-automatic settings, player switching on defense is no problem. Player AI is generally good, but the goalie AI could have used some more work. There are, of course, moments where your computer players do exactly what you don't want them to do (strikers sometimes stop dead in their tracks and wait for the ball to come to them instead of making a run -- only to have an opposing player snatch the ball way from the immobile drone), but the soccer game that doesn't have any AI glitches has yet to be made.     Where ExtraTime really shines is in the strategy department. Like previous Konami soccer games, ExtraTime features plenty of team strategies and setup options (though quite not as many as this year's version of World Soccer/ISS). In addition to fully customizable formations and lineup options, the game serves up an excellent in-game strategy system. Using the black and white buttons players can change between defensive and offensive strategies on the fly. For example, to bolster your field coverage during offensive runs, you can decrease the number of players on defense and increase your attack level. In addition to the standard attack meter, you can also customize your team strategies with up to four different in-game formation changes that can be triggered via the right analog stick. This way, you can effectively pull off off-side traps or make sure your strikers are always exactly where you need them to be. It's a great feature for expert players that deserves to be in every soccer game (cough, FIFA, cough) -- and it's even accessible to beginners thanks to automatic and semi-automatic settings. Considering the in-depth controls for formations and strategy, it's a bit puzzling why Konami didn't also add fielding controls for corner kicks or free kicks. For example, if two players play on the same team and are about to execute a corner kick, only the shooting player has control over the game. The second player is frozen and unable to move, so there is no way to position your player in front of the goal.   Graphics Graphically, ExtraTime recalls the look of past Konami soccer games, complete with the vibrant colors and traditionally blocky player models. This isn't a problem during gameplay as you're likely to watch the action from a zoomed-out viewpoint, but as soon as the camera gets in close for a cut-scene or victory celebration, it becomes painfully obvious how ugly the player models really are. The game runs smoothly at all times, but the textures and stadiums lack the detail we've seen in FIFA, Virtua Striker, or ISS. If you're looking for fancy lightning and shadows from tribunes and other stadium elements on the field, this is not your game. The presentation is a different story, as ExtraTime's menus are much improved over past Konami efforts. If you're used to watching soccer on ESPN, you'll be amazed at how well Konami pulled off the look and feel of an ESPN broadcast. The Xbox version of ExtraTime looks a tiny bit sharper than the GameCube and PS2 incarnations, but other than that they're all the same.  Sound MLS ExtraTime doesn't do anything special in the sound department. The crowd cheers and sound effects are good, but the commentary is very basic and sounds overly robotic when it comes to calling out player names. It would have helped if Konami had recorded multiple versions of each player's name with varying intonations like it's common practice for other sports game makers. It gets even worse when you're playing as one of the international teams as the game doesn't sport authentic players. Instead of just getting generic color commentary about the teams, you'll hear: ~Player 1, Player 2, Player 1, Player 1.~ This not only ruins the authentic feel that Konami is trying to establish with the ESPN-style presentation, it really destroys any reason to listen to the commentary in the first place. To round off the meager audio presentation, the game only supports two-channel stereo sound (even if your audio receiver proudly flashes the DD 5.1 logo). Although you'll initially curse the rigid control system, ExtraTime soon comes together as an above average soccer game. It runs at a smooth 60 frames per second at all times, there's virtually no load time, and it's got a great set of modes and options. The objective-based Scenario Mode in particular adds a welcome dose of originality to the standard array of modes found in almost each and every soccer game. On the flipside, there are also a number of problems that keep this game from being a favorite. In-game strategy options aside, it's simply not as well-rounded a package as last year's FIFA, lacks key licenses, and plays nowhere near as well as Konami's other soccer offerings. Konami will always have a special place in the hearts of soccer fans in Europe and Japan -- I realize that the US is still a niche market for soccer games, but it would be nice if we could all get to play the same game next time around. Since Xbox owners didn't get the superior FIFA 2002, this is currently the only MLS game around -- so give it a look if EA's World Cup game isn't your cup of tea.", "date": "Apr 5, 2002"}