{"name": "Agent Under Fire", "name_review": "James Bond 007 in...Agent Under Fire", "ref": "https://www.ign.com/articles/2002/04/05/james-bond-007-inagent-under-fire", "text": "Electronic Arts ported the James Bond 007 in Agent Under Fire over from the PlayStation 2, bringing improved visuals and multiplayer bots to the Xbox. The varied single player game modes, the improved multiplayer game and the Bond license it self just don't do enough to correct what's wrong with Agent Under Fire.  Features   Engage in a completely immersive first-person Bond experience featuring diverse gameplay All new, original single-player storyline that builds on the Bond legacy with villains and allies, both new and familiar  Gameplay is largely first-person shooting with elements of driving and on-rails shooting A full arsenal of Q-lab weapons, gadgets and autos to utilize  Fast, fluid action and spy-packed gameplay inspired by the 007 films  Detailed 3D environments and a smooth framerate  Single and up to four person multi-player support Xbox and Gamecube versions features CPU bots for multiplayer    Gameplay The story in AUF is completely original but well within the realm of possibility for a James Bond adventure. Equal parts of exotic locales, sexy yet educated women and all out secret agent action will all seem nice and familiar to fans of the movies and the N64 titles Goldeneye and  The World Is  Not Enough  The single-player setup is based on three key elements: first-person shooting, driving, and rail-based activities. Given the pedigree of previous Bond games, the FPS component is naturally the most important one. As the debonair Mr. Bond you will blitz your way through environments ranging from winding narrow hallways to spacious outdoor platforms. The use of your gun is largely the same in both backdrops, but of course in wide-open environments you can make better use of your sniper gun. Unfortunately, you simply don't need to do this enough and it's not very well executed.  Furthermore, the speed of the bullets is too slow to be either believable or interesting. This includes the rounds enemies fire at you. The speed of the bullets ties into the overall problem of pacing in Agent Under Fire as well. The default game speed can be turned up but there just isn't that finely tuned sense of balance that's absolutely crucial in first person shooter on the console.   As GoldenEye was renowned for the element of stealth and sniper weaponry, many have come to expect this in subsequent James Bond releases. In Agent Under Fire the developers didn't leave enough room for this. You'll need to work on playing it cool when you up the agent difficulty, but for the most part blazing a trail with a faster shooting gun or luring enemies around corners is more effective. You just don't feel stealthy. The element isn't there.   To deepen the first-person shooting, Bond digs into his arsenal of Q-weaponry, utilizing tools such as the Q-Claw, Q-Laser, Q-Remote, Q-Jetpack, and Q-Specs. The Q-Claw is one of the coolest items, which lets you grapple onto specifically placed gratings to pull yourself up into different areas. In the very first level you are taught that by using the Q-Claw properly you can find different routes and secret areas. The other tools from the Q-Lab like the laser play a huge part in Agent Under Fire as well. At the end of each mission, you are awarded points for time-to-completions, objectives, and Bond moves. Using your laser to cut the lock from a gate which subsequently leads to an area with body armor counts as a Bond move, helping you tally up extra points. As a whole, the Q-weaponry helps expand on the gameplay mechanics, but in the end the FPS component can't help but feel generic.   You'd think that driving in a first-person shooter would be totally gimmicky and unpolished. Thanks to EA's experience the driving mechanics are solid, featuring totally new controls and physics. You'll have additional Q-weaponry such as missiles and a machine gun to go with it. There are only a few driving missions spaced evenly throughout the game, but they're well done and deliver up a much-needed change of pace.   Finally, the third type of gameplay style is on-rails shooting. You will find yourself poking out of the rooftop of an automobile, a futuristic tunnel car, and even the top of a tank. These levels still stay true to the FPS style, but with more freedom to focus on aiming you will be able to use the manual aim more and just go wild with your guns. Think of it like typical first person shooting but the CPU is controlling the speed and direction of your lower body, you get the torso.   The developers have used the D-pad to switch through your weapons and Q arsenal. In concept it sounds like a good idea, but when your PS100 runs out of bullets in the face of opposition you will inevitably take a lot of shots while navigating through weapons. In fact, it's not too rare that you need to go cower in a corner just to change your guns around and get things set up. That said, weapon navigation is slow and painful, and using your Q-weaponry is even worse. For some reason the creators chose to put a just enough of a delay between weapon changes to frustrate us. Perhaps it was to add strategy to your choices, but in the end it just becomes agitating. You will tire of waiting for certain tools to load into your hand.      The whole single-player mission setup is predictable and would have been more troubling without the addition of driving and on-rails elements. Perhaps the worst thing about Agent Under Fire is its inability to let you figure out anything on your own. Everything you need to interact with or shoot is painfully brought to your attention via a camera zoom and an audio cue such as ~Hmmm, fireworks,~ when you're supposed to shoot explosive barrels. And almost everything you need to shoot that is important is not only red, but also magnified by a camera pan. It removes any puzzle elements that may have occurred otherwise in the environment, and in the end strip a lot of fun out of the gameplay.   Multiplayer Now the part you've all been waiting for. Agent Under Fire features a fairly polished four-player mode. There are nearly a dozen completely redesigned multiplayer environments -- many of which have some designs that may be slightly familiar to Quake fans. Exclusive to the Xbox and GameCube version are CPU bots, which are a great addition, but there's a catch. You can only have four-players in the matches. That includes bots. So, in single-player, you can add three bots, two-player with two bots, etc. It's a nice addition, but when you have four friends over and want to team up against some helpless CPU controlled suckers, you're going to be out of luck. The action runs at a respectable framerate, however, even in four-player. For this, we're happy. GoldenEye or Perfect Dark fans won't find anything near the depth of those Rare-developed shooters, but the multiplayer mode is a solid and worthwhile addition nonetheless.  Graphics Agent Under Fire features complicated world architecture that is highlighted by a wide variety of true-to-life textures. Unfortunately, those textures don't get very sophisticated beyond the obvious like the simple reflections used on the cars, windows, and a few other objects. This is where 007's ~portational~ (you read it here first) roots are the most obvious.   The character models are nothing out of the ordinary; however, they do feature some well-done facial animations in addition to nicely designed face textures. Other neat animations include the gun swaps and reload sequences, which, while not overly articulate, are still well presented. Meanwhile, character animations not featured in real-time cut-scenes are often stiff and seemingly outdated.   We've already discussed the bullet effects that look like pellets flying across the room. If they'd called it Paintball 007 we wouldn't have a problem. Luckily, some of the more powerful machine guns forego this odd effect for more realistic gunfire and there are some environmental damage effects like steam shooting out of pipes that have been shot up.  Really, it's Agent Under Fire's impressive 60 frames per second framerate that is so compelling. It's improved over the PlayStation 2 version, which is consistently bogged down by wide-open areas with more complicated architecture. It seems the Quake III engine, which Agent Under Fire was built on, can run well on a strong console.   Sound The aural complexity featured in Agent Under Fire was actually surprising with fairly crisp directional sound.  We didn't get enough thump out of the subwoofer to convince us that Agent Under Fire is in true surround sound. But then the strange thing is, there's no Dolby or any other kind of logo on the box to indicate any kind of surround sound feature.  Bullet shells cling and clang as they strike the hard ground, gunfire ranges in tone, and voice acting is for the most part palatable. In addition to this, there are some good remixes of the Bond theme integrated into rock and techno music. There is one unforgivable element of sound, though, and that is the use of the famous ~da dunn da dunn!~ theme far too much. It's the theme that tells Bond he's done something successful. In Agent Under Fire it is used anything but sparingly, totally ruining the effect. You begin to despise it. Bond can barely reload his gun without hearing it. Halo has taught us what to expect from a first person shooter on the Xbox. It's certainly a lofty standard for every game to live up to, but Agent Under Fire could've worked on the Xbox if it hadn't come over as a PS2 port. Spiffing up the graphics and slinging onto the Xbox merely adds polish to whatever problems the game had on PS2. The footspeed, controls, enemy AI and rate of fire in the FPS segments of Bond just don't synch up the way they need to for this game to be anything more than a short term, big-licensed little snack of a game whilst Xbox owners wait for the big guns, literally, to come blazing onto the system. Unreal Championship, Rainbow Six: Raven Shield and even EA's own Medal of  Honor Xbox title can't get here soon enough.Besides AUF was an original story. Why then did we get a Pierce Brosnan lookalike that didn't sound like Pierce Brosnan? Our kingdom for a George Lazenby as James Bond videogame.", "date": "Apr 5, 2002"}