{"name": "The Scorpion King: Sword of Osiris", "name_review": "The Scorpion King: Sword of Osiris", "ref": "https://www.ign.com/articles/2002/04/08/the-scorpion-king-sword-of-osiris", "text": "In anticipation of the film's release, Universal Interactive assigned veteran Game Boy Color development team WayForward Technologies to the task of bringing the big and buff Dwayne Johnson AKA The Rock to the Game Boy Advance screen. WayForward was responsible for several well-produced side-scrolling Game Boy Color action designs, and that team has taken that knowledge to the next step on the GBA hardware. Don't let the initial looks fool you; the game doesn't set out to hammer the player in its visuals department, but its gameplay and level designs are pretty tight...making for a solid Game Boy Advance experience. Features Six worlds Two selectable weaponry Password save Only for Game Boy Advance  As Mathayus (The Scorpion King), you're set out to rescue your wife from the clutches of the evil Menthu. This guy's set out to use Cassandra's magical powers for his nasty bidding. Our hero wields a massive sword and a pair of scimitars to help him through the game's platform-leaping action, hacking and slashing dozens of different enemies through the six worlds. By defeating bosses, you'll increase the power on your Hero's Gauntlet...by collecting gems along the way, you'll increase your weapon power with each jewel. By the end of the game, Mathayus can be this unstoppable force with a full Gauntlet.  WayForward's been known for looking into past game designs for ideas that work...and it's obvious that this happened with The Scorpion King. The game isn't original by any means, lifting elements from classic videogames such as  Castlevania and Super Mario World. You'll recognize a lot of existing gameplay and level design ideas, such as the slowly plummeting ceiling of spikes, or rotating blades moving on a designated, or the platforms that give way after standing on 'em for a couple seconds...you've seen a lot of this before. But it's the composition as a whole that makes The Scorpion King a winner; the gameplay is tight, with enough variety to encourage players to continue on to the end.   But some of the ideas weren't implemented quite as well as they should have been.  Mathayus can perform extra moves with his sword or scimitars; by holding down the action button, he can spin them in his hands and perform either a thrusting motion with his sword, or throw the scimitars in eight different directions. Other than the boss battles, the levels don't really lend themselves to these extra abilities, since players have to stop in place, charge their weapons for a good second or two before letting loose with the extra moves. Once an enemy appears on screen, nine times out of ten he's already in normal attacking reach, so there aren't any really huge reasons to put these additional moves to use.  On the Game Boy Color, WayForward pushed that system's extremely limited color palette to its maximum, creating games that looked absolutely amazing compared to what other developers were generating on the system. For the Game Boy Advance, though, the team didn't seem to set out for any real ~wow~ factor. Nothing here looks like it's been 3D rendered or painted and scanned in..compared to other 2D platformers, the look of The Scorpion King is somewhat rigid. The few special effects that are in this game are extremely subtle: the barely lit cavern halls using the GBA's transparency abilities, or the rotating sprites of Mathayus' spinning weaponry. On the other hand, the character animations are wonderfully smooth, and some of the boss characters are stunning in their designs.  The one real drag is The Scorpion King's password save, but even here it's not so bad -- it's been created with memorization in mind, only requiring four color-coded characters to jot down. Though, keep in mind that it's extremely easy to guess passwords from levels deeper in the game. The game's slow progression of introducing game ideas as well as a good variety of enemies keeps things interesting in The Scorpion King. And the payoff for playing through the adventurre and finding all the secrets is a good one. It's not a huge surprise what it is, considering you're given a hint to its existence at the very start. Though it's not as stunning as the team's upcoming Shantae, The Scorpion King's a great start for WayForward on the Game Boy Advance. Let's see how far these guys can go on this handheld.", "date": "Apr 8, 2002"}