{"name": "The Three Stooges", "name_review": "The Three Stooges", "ref": "https://www.ign.com/articles/2002/04/10/the-three-stooges", "text": "for the Game Boy Advance marks a return of one of the key players in the computer game industry before the PC took it all away. It was during the time of the Amiga, Atari ST, and Apple IIGS that Cinemaware reigned supreme in stunning gaming presentations...the titles that the company originally created focused more on the visuals than actual gameplay, and players ate it all up. That's the real problem with The Three Stooges; it plays just as good, if not better, than the game released by Cinemaware more than a decade ago, but the design depended on wowing players with visuals. Don't expect a whole lot of original fun.  Features Five minigames Password save Only for Game Boy Advance The Three Stooges puts players to the challenge of collecting money for the orphanage that's about to be foreclosed by the evil banker. You'll have to play minigames to earn cash...but you only have 30 days to pull it all off. You'll have to stop a random ~spinner~ of sorts that decides which challenge you'll face for that day...it's a bit like ~Press Your Luck,~ and the ~whammy~ here is a mousetrap; get your finger snapped four times and the game's over.  This title really only has five minigames to its design, and none of them are entirely clever or original, and without the pretty graphics they could certainly have been done in Game & Watch fashion. All of the challenges are based off of Stooge ~plots~ from fifty years ago; you'll lob pies at the upper-class, scurry through a hospital to pick up discarded tools, and enter an oyster cracker contest where each salty treat scores big bucks. You'll even have to run through a side-scrolling level, avoiding obstacles by weaving past them or leaping over them in Mario fashion. And, most lucrative is the trivia contest, where a correct response will net the Stooges five hundred bucks.   The pie-throwing contest is admittedly the dud of the pack...this game's clumsy and awkward, and difficult to tell where the airborne pies are coming from. And the trivia challenges? There doesn't seem to be more than a dozen questions in the database...so once you've learned all the correct answers, it's a cinch scoring $500 every time. The rest of the games are a somewhat cool diversion, but there's nothing here that people would consider ~clever.~    The game has a great presentation, as all of the artwork and sound effects used in the Amiga game have been redone for the Game Boy Advance...so as good as the original game looked, it's been improved for the handheld. The designers even added a bit of variety by changing some situations around, like altering the pie-throwing contest into a pizza-throwing contest, and having the hospital chase cut through a supermarket as well. The design of The Three Stooges does encourage replay by offering better endings the more money that's earned before the end of the 30 days...so even though you may have scored the necessary $5,000 to save the orphanage, it's not over until you earn a lot more money for the super Stooge secret surprise. As great as it is to see Cinemaware make a return to the gaming scene, I just hope the company sees that many of their games weren't as impressive in gameplay as they were in presentation back in the day. You can't get by on looks alone anymore...which is a good theory on why the company vanished a decade ago. The Three Stooges doesn't stand the test of time on the Game Boy Advance as well as it could have...as improved as it is from its original vision on the Amiga, it could have used an extra game mode or three to make it more significant in the GBA market.", "date": "Apr 10, 2002"}