{"name": "Donald Duck: Goin' Quackers", "name_review": "Donald Duck: Goin' Quackers", "ref": "https://www.ign.com/articles/2002/04/11/donald-duck-goin-quackers", "text": "Taking full advantage of the Disney license, Ubi Soft has released what is roughly the third iteration of Donald Duck: Goin' Quackers. A title that originally debuted as a new concept on the Nintendo 64, Goin' Quackers has seen slight improvements for its PlayStation 2 and, now, GameCube release. It's a platform game through to the bone -- one that's more geared toward a younger audience than anything else. Parents and, possibly, devote Disney fans should give Goin' Quackers a look over.  Features  Authentic sound effects with Donald's legendary and unique voice acting  Collect power-ups throughout the 3D levels to control Donald's temper, if it he gets angry...things get messy  Meet up with the zany cast of Disney characters including Huey, Dewey, Louie and more  Experience 22 levels in four cartoon-inspired worlds  Unlock special features including a special moves challenge and an outfit maker   Gameplay This Disney licensed offering is more or less based on the work that went into the PlayStation 2 version with a few extras. At its core it is still a simple platform game inspired by the likes of retro 2D side-scrollers and more recently Crash Bandicoot. The game starts off with an FMV to detail the storyline, which puts Daisy Duck in the depths of that evil magician Merlock's ancient temple. The fiend is working on a diabolical device and Daisy is there with microphone in hand to tell the world what it is. Unfortunately Daisy gets a little too close and is caught by Merlock. This is where you come in. You're pit in the webbed feet of one of Disney's most lovable characters, Donald Duck. Only with your help and his undying love for Daisy will you be able to save her.   Much more interesting than the plotline, of course, is the gameplay. To say that Goin' Quackers draws heavily from title such as Naughty Dog's Crash Bandicoot would be a great understatement. It sticks to one of three formulas: forward-scrolling (most popular), side-scrolling, and occasionally reversed-scrolling (towards screen). It all takes place in 3D, but is very much the product of a 2D design in many respects. Moving through the levels is self-explanatory, forcing you to jump over obstacles and avoid enemies. Donald is equipped with a handy double-jump, creating for a mostly airborne experience. Mattress springs, webs, energy power-ups, and enemies send you bouncing back up into the air. This is to be used to your advantage and, specifically for the GameCube version, is used strategically for gameplay to help deepen the experience.   You see, Donald comes equipped with special moves exclusive to the GCN version that can be activated by performing three consecutive jumps on enemies. By pressing the R-trigger it will make Donald pause in mid-air and countdown from three, giving you time to enter the move, which is a set of directions and button presses (i.e. Down, B, B, Y, Y). There are over a dozen moves gained by spelling the world ~SPECIAL~ in each of the sub-levels in the four differently themed worlds. You get one of the seven letters when you pick up five gear pieces (not a rare collectible item and very much like coins in Mario) within a second or so. Gears are arranged throughout levels in groups of threes, fours, or fives most often. So, it's not terribly hard to do if you're looking for it. The tricky part is remembering all of these move combinations. Fortunately, they can be practiced at any time in a training area. You get high scores, which can be saved to memory card, according to moves performed and time-to-completion for the various levels.   He thinks he's so cute.  All in all, Goin' Quackers is a short-lived, simple platform much more suited to the likes of a younger audience. Extra lives are at every corner and a loss of life is almost transparent, making it very pleasant for children who might take some time to adjust to each level. There are some plenty of bonuses to unlock, but, again, this is going to be something that appeals to a younger audience willing to replay areas repeatedly.    Graphics Donald Duck: Goin' Quckers features fast, but simplistic visuals. The worlds, vibrant and true to the Disney look, sport a 60 frames per second framerate in most instances. Occasionally it chops up, but given the nature of the game we don't think anyone is going to notice or be affected by it. Goin' Quackers biggest asset is its Disney license and the team has spent some time animating Donald accordingly. The wild duck's movements are fluid and stretchy, conveying a good 'toon feeling, but overall it's not diverse enough. For example, Donald has the exact same celebration animation at the closing of each level. It never changes, but there was certainly plenty of room for that.  For the all-new special movies, however, Ubi Soft has taken the time to create small real-time cut-scenes of Donald performing these wild moves, most likely in an effort to entertain children looking for a little ~cartoon~ action to break the pace. Overall, Goin' Quackers looks better on GameCube than its previous releases, but it's hardly a feat at that. It's a clean presentation, but textures, lighting, and effects are run of the mill.   Sound Music composition is lively, upbeat and true to the Disney theme. Thankfully there aren't any annoying repeated loops, and there's a good amount of unique audio from level to level. It's mostly composed according to each major area them -- forest, city, haunted mansion, ancient temple -- but there are some differences from sub-level to sub-level.   Goin' Quackers biggest new improvement is in the voice department. No longer will you have to deal with boring text, but there are authentic voice-overs to accompany everything. There are little touches in addition to this when you will quit a menu and Donald says, ~Awwww.~ It will definitely further immerse the younger crowd into the game. And, for older Disney fans, we know that Donald's voice just plain rules. Goin' Quackers is clearly skewed toward the younger audience, and that's certainly not a bad thing for those with kids. GameCube could use a dedicated kid's title and Goin' Quackers is it. Unfortunately, it's a rehash of what we saw quite some time ago on the N64. It's a lack of effort, probably more tied to milking the Disney license than making a truly compelling game for kids. For this reason it's really disappointing. I recommend it to parents looking for something to let their kids play. Assuming you haven't already played the previous Goin' Quackers. Certainly this is the best Goin' Quackers yet, but the new additions aren't enough to warrant the pricey retail fee if you've played the original. If you're like me, you were probably hoping deep down that it would be another great platform game like Namco's recent Pac-Man World 2. It definitely is not, and if you're looking for platform titles on the GameCube I recommend you stick to that.", "date": "Apr 11, 2002"}