{"name": "Top Angler: Real Bass Fishing", "name_review": "Top Angler", "ref": "https://www.ign.com/articles/2002/04/12/top-angler", "text": "I'll admit from the start that I haven't played too many angler titles in my time. A few rounds of Sega Marine Fishing here and a Bass Masters Classic session there, and I'm about as seasoned at virtual hooking as somebody's feeble old grandmother. But lack of experience aside, I think I can tell whether or not a game is terrible, and man oh man is this one ever terrible.  Graphics I figure that I'd better start with the good, for fear of overindulging in too much bad karma. Plus it's the only way I could avoid smashing myself in the head repeatedly with my Dual Shock controller (think positive thoughts Jeremy positive thoughts). With that in mind, I'll acknowledge that Top Angler: Real Bass Fishing does have a decent amount of visual flare. Excellent water effects (especially the serene mirrored effect on the riverbed floor) and astute attention to real life scenery initially caught my eye.   Old wagon wheels, streetlights, fallen trees, and various other little knick-knacks perpetually litter the underwater atmosphere. Beautifully reacting underwater plant life and spot-on wave-creature recreations were also very pleasant to my optics. Never over-embellished, the artists found just the right amount of extra scenery to keep the landscape appositely appropriate.   The fish especially came to the forefront, moving and gliding exactly like the real thing. Shiny and majestic, every little critter this side of Ariel was quite impressive to say the least, and when I saw the way that the surface of the water reacted to the falling rain, I was almost ~hooked~. But then I started to notice the beginning of what would turn out to be many problems.   And that problem my friends, was the curse of the insidious jaggies. Now I know that we've all seen them before in a myriad of shapes, forms, and sizes, but it had been an awful long time since I'd seen them this bad. While some could blame the wretched abomination on system limitations, I for one will not. As we've seen in the past, the aliasing problem is one that can be fixed with clever programming and even smarter special effects, but apparently that wasn't an option here.   More crooked than Al Capone's accountant, the docks, boats, and surface-based objects are all primitive looking messes. Perfectly fine when standing still, the movement of your boat when traveling from location to location suddenly turns everything into some sort of gravity shifting dementia. And don't even get me started on the jerky camera and all the damn shimmering (reminds me of the fun house from the last scene in Grease). At least it isn't as bad under the water  Sound The upbeat piano renditions are all right if you're a 1930's prohibition bootlegger, but for the normal fisherman out there, peace and quiet is a much more viable alternative. Too bad the developers didn't have the foresight to give you the option to turn it off. The whole time I was playing it I felt like I was trapped in that one scene in Tootsie where Dustin Hoffman is walking proud down the street in his Dorothy getup. Once those whiny electric guitar riffs hit, I was frantically searching for the volume control.   The rest of the audibles are pretty simplistic. A slight underwater distortion noise, some splashing, and the clickity-clack of your rod are about all you get. But since this is a fishing game, I didn't expect much anyway (and after the god awful score, the less noise clashing with it the better). I'm still just peeved that there were no sound options to adjust this stuff with what am I going to do with a sound test? Remind myself how quickly the soundtrack helped to accelerate the aging process?   Gameplay The real kick in the pants though, is when it comes down to actually playing Top Angler. Possibly the most non-interactive fishing game in the history of fishing games, Angler is simply an exercise in pressing the x button a few times, wiggling your analog stick, and hoping that something happens. A Saturday night on the town for some sure, but when it comes to videogames it just doesn't cut it.   A basic example of the typical scenario is as follows: Press ~x~ to throw line. Press ~x~ again to adjust power meter. Watch camera glitch and then wait as bait floats to the top of the water. Pull bait towards you for what seems like two thousand miles watch fish do nothing with it. Repeat.   Unable to adjust the pitch of your line, inch forward, or even move the rainbow lure up and down without waiting half an hour for it to float to the top, this is more of a waiting game than real fishing. At least when you do this sort of thing in reality, there's some kind of terrific outdoorsy bonding going on between you and mother nature. The only bonding you'll likely experience with Top Angler however, is that of your boot being permanently bonded onto the behind of the person who sold it to you.   Now I realize that fish are stupid animals, and likely have no memory of what has happened in their life 10 seconds after it occurred, but there's no way in Hades that they are as dumb as portrayed in Xicat's game. On far too many occasions did I leave my lure in front of a fish to bite, watching as it got hungry and followed, only to circle and attempt to bite the air about a foot above its target. What is it doing? Are these strange fish suddenly trying to become land creatures in an attempt to gulp a great breath of fresh air? No sadly, as the answer is a much more disappointing ~poor AI~ programming debacle.   There are a couple of redeeming efforts that the developers tried to make by way of options, features, and goodies, but when you break them down to the root they're nothing but a couple of extra ways to frustrate yourself with a poorly executed bore fest. What's the point of competing in a tournament, goal challenge, or practice when doing so isn't going to make a bit of difference on the gameplay front? The repetitious outcome you find in the first hour will be the same repetitious outcome you discover in the tenth, the twentieth, and the hundredth hour as well.The second incredibly sub par title I've played over the past two weeks (the other being THQ's even worse Tetris Worlds monstrosity); it hasn't been looking very good for my PS2 so far this April. Obviously a rut that's sure to be remedied faster than not, this lack of quality software lately has really helped me to appreciate the finer titles in life. So much in fact, that it only intensifies my feelings towards the following sentence: Avoid Top Angler like the plague.", "date": "Apr 12, 2002"}