{"name": "High Heat 2003", "name_review": "High Heat Major League Baseball 2003 Review", "ref": "https://www.ign.com/articles/2002/04/15/high-heat-major-league-baseball-2003-review", "text": "According to Homer Simpson, the two sweetest words in the English language are ~de-fault.~ Well congratulations, High Heat Major League Baseball 2003, it looks like you win this year's ~Best PC Baseball Game~ by default, because there are no other competitors this year, not a single one.  At least it's a decent game, even if 3DO hardly did anything but tweak last year's version a little bit while the lion's share of their development effort went into the PS2 version -- and make no mistake, that's a different game, since it doesn't even a franchise mode, and this one does.  Ugh, what a revoltin' development. Only one new PC baseball game, and it's a rehash? Don't believe them when they tell you what happens in the console game market doesn't affect PCs -- it most certainly does, and nowhere is that more obvious than in this year's crop of baseball games. Or lack thereof.  Anyway, let's see what we've got.  Pitcher vs. Batter  The pitching-batting dynamic lies at the heart of the sport and is the key to any good baseball game. Almost any other aspect of baseball can be omitted and you still have a viable game, but if you screw this part up, forget about it, your title isn't worth playing.  Fortunately this is one area where High Heat works really well. Pitchers are given a repertoire out of nine possible pitches, though as in real life most just have the fastball, changeup, and a slider or a curve. You select your pitch, then you select location and whether you're trying for a ball or a strike.  Several factors will determine your success. Obviously velocity is important, because the harder you throw the ball the harder it is to hit. Even more important is movement. The more movement you have on your breaking balls, the more likely you are to fool the batter. A big old curveball that comes barreling into the strike zone then drops down into the dirt is going to strike out more batters than a soft rope with no snap on it.  Choosing whether you're going for a ball or strike lets you work the count, too. If you get ahead of a hitter 0-1, 1-2, or 0-2, you should be throwing balls and trying to get them to swing at a bad pitch. Conversely if you fall behind you really should be going after the strike zone -- barring other circumstances.  All this is fine and good but in the real world, pitchers can't always put the ball where they want. Most games do a horrific job of modeling control, making it far too easy to throw a strike, but High Heat is superb in this respect. Try as you might, sometimes your pitcher is going to miss the strike zone and walk people, like it or not. There are even variable umpires whose calls can be somewhat dubious. Now that's baseballalthough the real world umps are still far more unpredictable and inconsistent than their computer counterparts.  Hitting is handled just as well. You can try to guess the pitch before the fact, or you can try to eye it as the ball is coming in. Directional swings are very important and aiming your bat up, down, left, right or up the middle just feels natural and intuitive, and for the most part, it's not too difficult to put the ball into play where you hoped. And for those of you concerned about the lack of a ~power swing~ that's essentially what the pitch-guessing is all about.  Also good is the fact that players hit the way they should in real life. You can't get a home run every single time you step up to the plate. With a singles hitter, you better put the ball on the ground or you're just going to fly out a lot, while the guys with a lot of pop really can take aim at the power alleys and the porches.  That's not to say everything is perfect in Mudville. It seems as if some of the cancerous features of console baseball are creeping into the PC sims. For example, as the CPU team starts to fall way behind, sometimes it almost feels like they're guaranteed a late inning rally just to keep things close, your typical BS ~catch-up~ mode. No, no, no. In a 162 game season, every contest shouldn't be a late inning nailbiter, and in season/managerial mode, those blowouts are important so your long relievers and bench players can get some work and decrease the chance of injuries to your stars.  Another bit of creeping console-it is interrupting the on-the-field action with some fancy-pants camera angles after a home run swing. Sure, sometimes when a guy hits one out of the park everyone knows it right away, but other times a ball only barely clears the fence and your outfielder has a chance for the leaping grab. So what's the deal with interrupting the game with these mini-cutscenes? Save it for the replays.  The numbers game  No sport geeks out on stats more than baseball, and no aspect of the sport is harder for games to simulate. A knowledgeable baseball fan can usually look over the box scores, standings and statistical leaders of a given game and judge just how accurate or arcadey that game is. Lots of home runs, sky-high ERAs, and the player's team leading in every statistical category are the hallmarks of twitchy, console-style, inaccurate baseball games.  Fortunately High Heat produces some of the most accurate results I've seen in an on-the-field (as opposed to pure management simming) title since the Tony La Russa Baseball days. I played an entire season as the San Francisco Giants (not every game, I simmed games too), and true to form, the Giants had a great regular season, only to get knocked off in the playoffs. The Yankees won their division handily and took the World Series without much opposition. Arizona, Seattle, Boston and the Mets all did well too, and the only real surprise was the Florida Marlins and Minnesota Twins sneaking in.      Sammy Sosa took the home run crown with 70, followed by Barry Bonds who knocked out sixty (then promptly retired, gosh darn it). Only one pitcher had an ERA under three, and the upper echelon of pitchers in terms of wins, IPs, and ERA were all likely suspects: Curt Schilling (the only 20 game winner), Randy Johnson, Mike Mussina, and Pedro Martinez.  Obviously one season isn't a meaningful statistical sample, but these are the kind of believable results you will get with High Heat.  Show me the money  What's not believable, though, is the GM mode.  Baseball, more than any other professional sport in America, is ruled by the inexorable laws of Mammon. If the New York Yankees have a payroll of $125 million and the Tampa Bay Devil Rays have a payroll of $35 million, you don't need a Nobel Prize in Economics to realize that the Yankees will simply buy their way into the playoffs every year. Sure, you still have to spend your money wisely, not signing injury-prone pitchers to excessively long contracts (hello, Kevin Brown), but if you have piles of filthy lucre to throw around, it's easy to paper over your mistakes.  By the same token, the small and mid-market teams have to be sharp as tacks, identifying long-term prospects and making good trades to stay competitive. That's a whole host of interesting game decisions for a player to grapple with, and the whole heart of a good GM sim.  That's why the lack of any sort of financial model whatsoever in High Heat Baseball 2003 is so crippling. If you're not being forced to match your salaries to the revenue you're generating, there's simply no challenge to playing as the general manager here. You can keep your great players forever and continue to trade and upgrade your roster until you're trotting out an All-Star team every day.  It's not like a financial model can't be done, even with a Major League license -- Baseball Mogul does it. But as it stands, playing general manager in this game is like playing SimCity with some endless money cheat on.   Boring.  The Graphics and Sound  I suppose I should wrap up our review with a look at the graphics and sound.  Some reviewers are what we call ~graphic whores~ -- they'll go on and on about framerate, texture-maps, and so on, but they'll never manage to actually talk about whether the game is fun or not, or why it's fun, or where the design went wrong, and so on.   Well I'm not one of those. I can put up with a lot when it comes to sub-standard graphics. I don't care if my 3D card isn't the newest slab of silicon hot out of the chip fabs and I don't care how many polys your characters have as long as the game is fun. However I do have some expectations. For example, I expect a game's graphics to actually improve from version to version. I expect a minimum level of competence in texture-mapping, and I like my ballplayers to play in a park in front of something resembling fans, not some angular amorphous blob of Lovecraftean horror. The fans in this game look as if they've all been swallowed by a gigantic gelatinous cube.  So High Heat is a pretty ugly game. The ballparks are at best late nineties graphics, there's little collision detection to speak of, the animation can be jerky, and some of the ballplayers have the most grotesque facial bitmaps you'll see this side of Resident Evil. However the graphics are serviceable, and if you're a forgiving type or running older hardware, you can live with it. I did.  You can't say too much about the sound either, except that they've upgraded the play-by-play announcing. I still don't like the sound effects and the crowd noise in this game, though, and to be honest, most of the time I play with the game's sound turned way down and listen to a real baseball game on the radio. Bottom line -- if you have High Heat MLB 2002, you can skip this year's edition, unless you're willing to drop $30+ for some tweaks and a roster update -- and even then, you're getting outdated rosters anyway. But if on the other hand if you're sick of the arcade-style console games masquerading as PC sports games, are looking for a richer, deeper, more satisfying baseball experience, and have yet to give High Heat a try, then 2003 is a good way to go.I feel a little dirty giving a good score to what is basically last year's game, but the fact is there's little to no competition for High Heat on the PC. It's this, or statistical sim-management games like Season Ticket or Baseball Mogul, which are fine games, but since there's no on-the-field action, that's a different genre entirely. Everybody else is dead. Stormfront, Accolade, and Sierra Sports have all hung up their cleats. Even EA Sports is sitting out this season, with last year's Triple Play Baseball still sitting in stores with Jason Giambi in his old A's uniform.Congratulations, High Heat. You're the champion.By default.", "date": "Apr 15, 2002"}