{"name": "Spider-Man [The Movie Game]", "name_review": "Spider-Man", "ref": "https://www.ign.com/articles/2002/04/18/spider-man-6", "text": "We know how much IGN readers love those spoilers and in Spider-Man for the Xbox you've got the greatest interactive super hero movie spoiler of all time. The Columbia Pictures film starring Tobey Maguire and Willem Dafoe opens up on May 3, but you can get all of the big budget Hollywood action you need from Treyarch's technically impressive Xbox game. Spidey is coming to every platform out there, with the exception of Dreamcast, so you may want to check out our exclusive head to head breakdown of the three console versions to help you decide. But there should be no doubt in your mind that the Xbox version of Spider-Man is and should be the clear winner.   Previous editions of Spider-Man on the N64 and PSX looked more like the comic book adventures of Peter Parker, but the fact that this Spidey game is following a live action movie means the Xbox gets to show off its lighting and texturing capabilities. In fact the movie license also lead to a few Spidey modifications like webs shooting out of his body now and his spider sense being upgraded to telepathy/clairvoyance.   Overall Spider-Man arrives as one of the top comic book superhero games you could ever ask for. Treyarch captured all of the powers and superhuman-~ness~ of the comic books, the most crucial elements that a Spider-Man game requires. Even on the Xbox there are a few problems, both technical and otherwise, but they're all a result of Spider-Man's awesome super powers, so what can you do?  Gameplay  This game uses nearly every inch of the controller, a testament to Treyarch's insistence on including every Spider-Man power you've ever seen in the comics, and a few we haven't. X and B are your attack buttons for close quarter combat on the ground and strikes while swinging through the air. Using combinations of the two attack buttons and throwing a little Y (webbing) and A (jumping) every once in a while, Spider-Man has quite the arsenal of 30 attack moves:  Dual Fists, Field Goal, Gravity Slam, Web Hit, Backflip Kick, Sting, Palm, High Web Hit, Dive Bomb, Head Hammer, Dive Kick, Web Gloves, Adv. Web Gloves, Web Yank, Mule Kick, Uppercut, Flip Mule, Low Web Hit, Elbow Slam, Scissor Kick, High Stomp, Tackle, Handspring, Haymaker, Web Dome, Adv. Web Dome, Impact Web, and Adv. Impact Web.  You start off with a modest selection of attacks, but the majority of combo moves are found somewhere in the level in the form of gold spider icons. It ends up that in the beginning of the game, when you're doing a lot more hand to hand combat with thugs, you won't have the coolest combo moves like the Dive Bomb or Elbow Slam. But this is part of Treyarch's master plan of extending the gameplay. The combo icons are special items and when you finish a level you're given bonus points for all of the specials you collected along the way. The bonus points boost your overall score and help you unlock the game's coolest secrets like mini games, new costumes and DVD extra features. They fully expect you to play levels multiple times to both find all of the extra icons and to use newly acquired combos to beat up old enemies.   Damn right there's gonna be chaos.  You can fire web balls, use web gloves and clear out a crowd with a powerful web dome but it's Spider-Man's non offensive web uses that take the cake. Right trigger activates your web-swinging whether indoors or out. The system is automatic so that he'll keep going straight once he starts, but you can speed him up and change his altitude by squeezing the right trigger and using the left analog stick, respectively.   The outdoor web swinging is what truly captures the essence of Spider-Man. Considering that we've never really seen a man swing on web lines through a city in real time, let alone beat up bad guys in mid-air while doing it, it's amazing how satisfying this experience really is. In the middle of swinging, hitting A will break the line cleanly allowing him to change directions quickly and start swinging again with the right trigger. You can attack in midair with punches by hitting X or you can do his double-footed gymnastics style swing kick by holding B. As you progress through the game, you're forced to learn and sharpen all of your aerial skills by destroying robots and attacking super baddies like Vulture and Green Goblin.  When you get into a rhythm with your aerial maneuvering and combat skills, it's one of the freshest and rewarding videogame experiences out there.   One of the later levels has you racing through the city to defuse a string of bombs, but there are evil robots everywhere hell bent on frying you up like a tasty delicacy in one of those countries where they eat fried bugs. You'll have to have your swinging skills down to a science to get around in a timely fashion yet be comfortable attacking in mid-air so you don't get killed. You  have no choice.  Zip lining is the hot new spider power that we've never seen in the comic books, but fits so well in a videogame. The left trigger will instantly make Spidey shoot a web toward a wall or ceiling and he will be pulled instantly to the location where he aimed the shot. If Link can use his hookshot, then Spider-Man, who's infinitely tougher than that poofter, damn sure needed a zip line. It's great for getting him out of stick situations on the ground and totally necessary in some areas where he can't touch burning or electrified surfaces that might be around him. The first person zip lining mechanism toggles on and off with the right thumbstick allowing you to aim the icon with the left analog stick and instantly zip to any location within range instead of the basic up, forward, left, right and back you get using the left trigger by itself. Batman had it in Batman:Vengeance and Spidey is ten times tougher than that watered-down after school version of the Dark Knight too.   Your skill set in Spider-Man increases gradually with the enemies you face. The Shocker is the first boss you face and his slow, earthbound yet powerful attacks will be challenging the first time you take him on in Grand Central Station. Once you're seasoned in the game and you double back to kick Shocker's ass again, he'll be a piece of cake. Vulture represents the first boss that will test your aerial attack skills. Learning Spidey's mounted attack where he can jump on a bad guy's shoulders (whether on the ground or in the air) and use the attack buttons to apply an up close and personal beatdown is the key there. The Green Goblin, whom you fight multiple times is the ultimate challenge because he's fast and powerful in the air and on the ground and gets tougher each time you face him. The chattel enemies aren't as tough as they are numerous. Again handling them will be a matter of what combos you have at your disposal.      The two bonus Xbox levels revolve around Kraven the Hunter, the tight-knicker and green-slipper wearing Russkie who obviously wasn't cool enough to be included in the movie. The Kraven segments are a sort of diversion to the main story but it gave Treyarch a chance to show off the sniper level. One level has Spider-Man suffering from poison so that his health is always depleting and his Spider sense is useless. At one point, you get to play this level from Kraven's perspective  --looking through the scope of a sniper rifle-- and you have to move Spidey safely through the danger. The second Kraven level is simply a boss battle. I say simple, but it's hardly a cake walk because you're still woozy from the poison, Kraven's got a fresh bottle of his super-Kraven juice and he's got traps set all around you.   There are so many accurately reproduced Spider powers in this game that the balance is thrown off just enough for you to notice. It's so imperative that you learn the controls and all of his powers quickly that as soon as you do --about half way through the game for most gamers-- you're not going to have any trouble re-applying your skills to different situations. For example there's a cleverly designed level where you have to infiltrate the Oscorp building and use stealth to access multiple computers scattered throughout the level. All it takes is some skillful zip lining and some patience to make it through unscathed. I found myself alerting the guards just so I'd have some ass to kick. Of course, the guards and robots eventually overwhelm me every time but it's fun trying to take on all of them.   There are just so many ways you can use all of the Spider powers to get the job done. When battling enemies in the air you can jump on them and give 'em the close range beatdown or simply wear them down with the double swinging kick or mid-air web blasts and punches. One of the cooler ideas that just didn't pan out the way we know Treyarch wanted it to, is the rescue element scattered throughout the game. During your first battle with Green Goblin, Mary Jane is stranded on top of a parade float (maybe the movie will explain this) right in front of you and you have to rescue her before it crashesin 5 minutes. There's no risk or danger in rescuing MJ and delivering her to the safe spot on top of the building right next to the float because the Goblin isn't aggressive enough to make you worry about him. There's a similar set up in your fight with The Shocker early on where you have to protect security guards. The tension this is supposed to create just doesn't happen because you and Peter Parker doing whatever a spider can are overqualified for the job of saving lives and whooping ass. Forcing us to choose wisely would've made this work a lot better.  Spider-Man can stick to walls. This is one of his most important abilities and it's also the one that wreaks the most havoc with the game's camera system. It's the power that makes the indoor segments less exciting than the outdoor ones. Getting around indoors is tough for Spidey because even with the zip lining you're still going to have to do some tight maneuvering especially in combat situations. Jumping away from enemies or trying to position yourself for attack can often get you inadvertently stuck to a wall. The game will quickly switch to a transparent point of view so you can see through whatever wall you need to, but the whole process can be disorienting. Using the first person zip line function only adds to probability that you're going to lose your bearings either at the beginning or end of the zip. The camera reacts quickly and is in place instantly, it's just that you're not sure what direction Spidey is facing or where the enemies are located. All of us here at IGN agreed that this is a necessary evil in a Spider-Man game that's going to include all of his great powers. But the camera can and will leave you disoriented at several points throughout the indoor segments of the game.   You've never done this before  One way Treyarch addressed the problems of the old camera system in the PSX versions of Spider-Man is with the enhanced camera control system. The right thumbstick allows you to swing and move the camera at will, on the fly. You can toggle the lock-on cam using the white button. The lock-on cam is actually more sophisticated than it sounds since it does whatever it has to in order to keep Spidey and the target on the screen at the same time. Indoors, outdoors, in the air or on the ground you'll always see what the bad guy is doing. When lock-on mode is engaged the right thumbstick is used to move the targeting icon from one target to the next. When you're in regular camera mode, the black button is always used to center the camera behind Spider-Man no matter where he is.   You can see how hairy things can get with the camera swinging wildly around when you get the lock-on camera, the targeting rotation, all of that wall-sticking and tons of enemies swarming you all at the same time. Maybe it's a problem Peter Parker would have to deal with in real life, along with wearing tight red and blue pajamas to work, but then again we're not interested in simulating real world problems, just real world fun.  Sound  The audio elements of Spider-Man are outstanding. While it's not in true 5.1 surround sound,because the low frequency channel just isn't thumping the way it should, the directional sound and separation is pretty good.   Considering that we've got Tobey Maguire himself voicing Spider-Man, I was expecting a stunning performance in the videogame. It's not Activision or Treyarch's fault that Maguire comes off as the driest version of Spider-Man that's ever been, but that doesn't mean that it doesn't hurt the game, either. In his comic books, Spider-Man is all about witty one liners and timely jokes during the heat of battle. Even though it's the written word versus Maguire's interpretation of the character, I definitely expected Peter Parker to sound more like everybody's class clown and not like a boring guy trying to sound humorous. The volume of quips and comments from Spidey is impressive, but that's not the real problem. The lines written for him are great and just as sharp as you'd want, but Maguire's training as an actor allows him to barely pull the delivery, rather than capturing the dual nature of the Spider-Man character: fun loving guy burdened by the weight of awesome responsibility.  All of the other voices are top notch. Willem Dafoe's Green Goblin/Norman Osborn is excellent with just the right amount of world-hating insanity added when he makes the transition from one to the other. The Vulture sounds just as old and crotchety as you'd expect and all of the other villains are well done too.   I can only assume the music comes straight from the score used in the film and it's of the highest quality. The most endearing use of sound in the game comes during the outdoor levels (once again the strength of the game) while your swinging closer to the surface. You can actually hear the citizens of New York making comments about Spider-Man and what's going up among the buildings. ~Be careful honey, the Daily Bugle says Spider-Man is dangerous~ warns one mother, to which Spider-Man replies ~Yeah but they sure have great photographers.~ The lines get better than that, but you get the idea.  Bruce Campbell is your special guest narrator popping up throughout the game and the training missions. He's so good that you'll be wishing he was playing Peter Parker and delivering those awesome lines instead of comatose-boy.  Graphics  The Xbox version of the game has the smoothest framerate and the best lighting out of all the different versions of the game. Even with all of its superiority though, the Xbox could've done even more with this game. It's not a complaint about the work Treyarch put into the game, because two extra levels make for some nice bonuses, we just know that the Xbox handles the outdoor levels of this game so well, there's got to be more.   All of the spider animations are what carries Spider-Man in the end of the day. He shifts and throws his weight with each web swing and the moves become even more dramatic when you do the extra fast web swing. The attack combos are particularly well done with each move of the sequence recognizable and clear. The Mule Kick combo ends with a big dramatic double heel to the jaw so that there's no mistake about which move you just used. Again, we've never seen Spider-Man fight in real life above the streets of New York, but all of the flips, kicks, punches, spins and vaults we see in this game are convincing enough. We'll know what to expect if Spider-Man ever takes over New York for real.  The environments are extremely well detailed and textured. Movable objects in the environments like garbage cans and car transition seamlessly to throwable objects. When you get outside, the buildings are damn near to scale, although you can't get down to the street level to get that perspective. The upper levels you can play around on are definitely to scale, looking like a good 10-12 feet per story.   You can run into a few chugs in framerate when you get the camera in a difficult situation with too much action going on, but it doesn't happen so often that it takes away from the game.  I love the fact that every Spider-Man ability I could ever want has been included in this game. You get the sense that you're operating through a standard third person adventure game, but you get the benefits that come with spider-related powers. The outdoor segments are outstanding and gave me the chance to do somethings that I've always wanted to do in a videogame. You can watch Spider-Man in the movie and read about him in books, but Treyarch has delivered the only way to control Spider-Man and have him do everything  you know he's capable ofand they made it look good.Even with all of this though, the challenges you'll face as Spider-Man are no match for all of those wonderful spider powers you have. The game just comes down to a matter of persistence and patience because you get so good, so soon. Sure in the comic books, the hero always wins eventually, but even Spider-Man had to suffer through some overwhelming adversity on the way to a few of those victories. I'm not a big fan of games that force you to manipulate the camera as much as you have to manipulate the character. It's good in that you're given complete control of the camera so you can make it work to your advantage, but it's more fun to just control Spider-Man.Spider-Man is easily one of the top superhero videogames of all time and it's taken full advantage of the videogame technology out there. There's nothing like it on the Xbox and so it should be worth a few hours of your gaming life.", "date": "Apr 18, 2002"}