{"name": "Monsters, Inc.", "name_review": "Monsters, Inc.", "ref": "https://www.ign.com/articles/2002/04/18/monsters-inc-3", "text": "Even though Sony Computer Entertainment America makes games such as Twisted Metal: Black and Gran Turismo 3: A-spec, Sony also has a thing for the kids. Little kids. It likes the little tiny kids, the ones who are impressionable, and who would easily beg their parents for a game based on a movie. There's nothing wrong with that; it's business.    But hey, you know what? Monsters, Inc. is for kids who haven't played anything else on a system. See, because if they had played a game before, they would instantly ask for their money back. See, because this game is bad. Bad, I tell you.    Gameplay, Graphics, Sound, Kitchen Sink  See, this is a platformer, but only in the most formulaic sense. You've got these objects you can jump on, stuff to chase, and extra things to collect, and they're everywhere. Monsters, Inc. plays like a million platform games before it, only it feels hollow and empty, based on the most obvious of game designs, adding nothing new to the mix, and making people like me wonder how Sony's very own QA department cleared this puppy.    So, I'll be quick about the gameplay. It's formulaic, obvious, and occasionally cute. Like when you get to zip-line from rooftop to rooftop to chase the little baby girl (Boo) who's scaring all of the monsters in Monsterville, or whatever they call the city these monsters live in (it's Monstopolis).    Basically, as James P. Sullivan, or Sully, you follow the movie plot along and collect screams, treats, keys, missing monster canisters, and health icons. You occasionally get to scare mice in a timed mini-game, and when you perform well in a level, you are asked to play a mini-game, before moving on to the next level. These games, such as bonking sleeping kids in beds, are sort of like playing Whackamole. They're cheap fairgrounds fun. Something a young, young, impressionable kid would like.    Anyway, you have to keep Boo from being seen, and as you try to bring her back to Humanville, you learn that she's OK, too. Mike, Randall, Mr. Waternoose, and Boo play a big part in this game as it tries to bring back that Pixar Magic on your PS2. Yeah, bringing back the magic...   Almost as if Sony knew that this game was going to be bad, developer A2M (not Sega's AM2) stuffed in an inordinate amount of extras, in a DVD way, into the game. There are dozens of extras that, if you're a big Monsters, Inc. fan (i.e., impressionable little kids...see the theme?), would absolutely love, such as early sketches of monsters, a weird real-live tour of Pixar Studios, interviews with what seems like everybody even remotely involved with the movie, and so it's a wonderful big celebration of the movie. There are dozens of movie clips in between levels, too, which are neat, if you haven't seen enough of it already.   So the game itself is kind of like a complementary little interactive demo that's really more like a big advertisement for the movie. There's nothing wrong with that, everybody wants to make a decent living, but don't be fooled into thinking this is a credible piece of software, cause it's not. It's an interactive ad mobile, and in that it's quite exemplary.    Graphically, it's an under par in everyway, textures, designs, backgrounds, you name it. Aurally, it's an under par game, too. The game doesn't use the real voices of Billy Crystal or John Goodman or Steve Buscemi in the game proper, but their voices do appear in the movie sections.If your kid is less than eight years old and has never played a videogame -- and oh, yes, one more qualification, if he loves Monsters, Inc. -- than you might, just might, want to buy this game. See, a very narrow niche. Basically, this game is for pure Monsters, Inc. collectors only, and young parents who want to give their kids everything. Which means Monsters, Inc. is pretty much for no one reading this review. So no, don't get this.", "date": "Apr 18, 2002"}