{"name": "Britney's Dance Beat", "name_review": "Britney's Dance Beat", "ref": "https://www.ign.com/articles/2002/04/23/britneys-dance-beat-2", "text": "With the niche popularity of games such as Dance Dance Revolution and Parappa the Rapper, it's a no-brainer that companies are adopting those designs for other games. In the case of THQ, they made the obvious move to this genre when they scarfed up the Britney Spears rights. Picking on Britney Spears is so darn easy, so I'm going to leave that alone and just focus on the game itself. THQ's design is pretty okay, but it's very shallow and short, killing the value of the package. Features Five Britney Spears songs Collectible images and slide puzzles Link cable support for two players Password save Only for Game Boy Advance  The Game Boy Advance rendition of Britney's Dance Beat is pretty much as close as you're going to get to the PlayStation 2 on the limited portable hardware. The audio is actually pretty slick for the Game Boy Advance...if you like Britney Spears songs, that is. The music can't be streamed off a CD, so the game's tunes are Dentist Office Remixes...Musak-style versions of the popular Britney songs, from Oops I Did It Again to Hit Me, Baby, all instrumental other than a few tiny digitized samples from the actual tunes.   As the music plays, a Radar spins clockwise, representing the actual timing of the music being played...by following the sweeping arm, you'll see the button combination you'll need to hit on the beat. Early in the game, it's a simple matter of hitting the A button at the right time...but then the game starts throwing you a curve by including the B button in the mix. By the time you get to the last song in the Concert Mode, you'll have to deal with a flurry of A, B, and controller directions. The game's difficulty may start out being stupidly simple, but believe me, all those button and controller presses do get extremely hectic. Not exactly what I'd consider ~super fun~, but it is a challenge. The developers try to offer Britney during the gameplay by having a rendered version of her dance to the rhythm (or stumble when you screw up), but since your eyes are so fixated on the radar, you'll never see her moves unless you actually sit through the replay after the song ends.  The pay-off of playing through the game is a one-minute full-motion-video presentation of Britney Spears in concert. FMV sequences on the GBA are nothing new, but the compression and sound quality in this clip is outstanding. How much space it's taking up on the cartridge isn't quite clear...but it has to be a lot. Really.  The other extras are a bit on the silly side...a handful of low-color photos and artwork, and three slide puzzles. Whoopee!  The game is extremely short, too...five songs and a couple tile-sliding puzzle games aren't nearly enough stuff to add value to a forty dollar cartridge...and you can get all the songs, cheaper and in better quality on CD. I suppose if you're a drooling Britney fan it's something to add to your collection...but how many of you are out there? Er, maybe that's not such a good question to ask. The design does mimic the PlayStation 2's two-player battles through the GBA's link port -- both players work their own radar, but if they've performed well on a series of button presses, they'll automatically ~attack~ the other person's radar (in a sparkly effect) that'll shuffle their radar's list of controls. It's a nice addition, but it's extremely flakey; the link would continue to disconnect during the songs when we tried testing it. This two-player mode definitely needed a bit more time in testing.         I actually enjoy playing Dance Dance Revolution on the PlayStation, because it's such a physical game that gets you in the action. But when you reduce that design into control presses, the game isn't exactly a lot of fun...and that's exactly the problem with Britney's Dance Beat. Pressing A and B at the right time during a song might be challenging, but it's not a whole lot of fun. And at least with Dance Dance Revolution you get a nice grab-bag of tunes...not everyone can stand the sodapop-sugary-sweet Britney Spears formula.", "date": "Apr 23, 2002"}