{"name": "Tac Ops: Assault on Terror", "name_review": "Tactical Ops", "ref": "https://www.ign.com/articles/2002/05/07/tactical-ops", "text": "Once there was a day when all we knew was frantic running and hectic rocket throwing. That day has long since passed. ~ Clich,~ the gamers of the world now call the classic twitch shooter. ~Why isn't it more realistic?~ They query. ~Who cares about singleplayer? I only play multi.~ Wailing madly and polluting the Internet with their ignorant and tainting fanboy infected form of language, this comparatively small but vocal contingent of PC gamers is the core reason for recycled product, the very thing that creates thousands of RTSs, hundreds of Diablo clones, dozens of MMOs, and wave after wave of the realistic team-based tactical online first-person shooter. Behold this, Tactical Operations: Assault on Terror.The very name is soaked in capitalization and even a smidgeon of fear. It's not about killing or ~deathmatching,~ as the kids like to call it, it's about stopping terror, or more accurately, assaulting it (other names tossed about included Accosting Terror, Molesting Terror, We're Against Terror, and my personal favorite, Tactical Ops: Repeatedly Clubbing Terror in the Crotch With a Lemonade Bottle). Coincidentally, that very crotch clubbing anti-terrorist mentality happens to be rather popular today... Goodness, it seems that when publishing TacOps, Infogrames saw it had a popular premise, a few nifty online catch phrases, a very ~hot~ genre, and a practically nonexistent development cycle. Buy up a cheap mod; throw it in a cheap box; slap on a cheap price; show the world a cheap game. It makes money, and is certainly a financially justifiable approach that any publisher would be stupid not to play on, but it doesn't make a quality product.Being a first-person shooter, a lot of Tactical Ops' controls are pretty self-explanatory. A fact the instruction manual is happy to reiterate with some of its descriptions (yes, these are real). Jump - Self-explanatory Crouch - Self-explanatorySelect best weapon - Self-explanatoryAha! No it's not. That last one is so totally not self-explanatory. Best weapon is a very subjective thing. Is the weapon that does the most damage the best? What about the one that fires the most bullets? Has the most ammo? Shoots the straightest? Looks the prettiest? Do I have to set which weapon is the best? It better be the prettiest... Obviously a great problem this is not, but it is a good indication of the generally miserably lax effort put into making this title a valid and respectable retail product (at least they managed to describe ~Move forward~). What's good as a free mod is not always good as a $30 cardboard box, see. It's easy to be forgiving of a user made endeavor when it doesn't cost money -- when it doesn't face competition vying for that same dollar. TacOps no longer has this luxury. The moment it decided to be sold, it pitted itself squarely against the champions of the genre, champions that trounce it in literally every single respect. Just like the kid in Rookie of the Year, TacOps will now learn the very painful Ivan way that being in the big leagues isn't always a good thing. It's easy to summarize Assault on Terror. The game is a quasi-realistic first-person shooter based off of Unreal Tournament technology that indeed began its life as a mod for that game. It has since grown and now includes some 30 maps, 27 weapons, numerous character models, and several items. When I say quasi-realistic, I mean gameplay is of the one shot and you're dead variety and all the weapons are based on real life counterparts, but the game is still very much a game.Don't ever buy more than two clips.A round of Tactical Ops is like playing Quake III in dim, unbalanced levels, and dying after being impacted by just one machinegun bullet. The one shot, one kill premise is not what gets me (I can dig Ghost Recon, Rainbow Six, and Counter-Strike as much as any other person can). Rather, it's in the poor implementation of this style of gameplay where the title's fundamental and all encompassing problem lies.Level design, weapons, physics, and speed (some are to an extent configurable) force games into ridiculously brief and chaotic run and gun matches with little direction, zero strategy, and hardly any enjoyment. Imagine playing a game of UT Assault, only with objectives that didn't really matter because everyone is far more likely to die before the first is even reached. In fact, that's all TacOps is: glorified deathmatch that comes delivered behind a paper-thin objective-based veil. Consider each map a mission. Only that mission can be played on that map. There are no other modes, just the missions for each map (which aren't even listed). It's truly sad when I have to point to incredibly old N64 games as examples of superior production. Two sides, set objectives, and no variation is no longer acceptable. Developers, please just look at Golden Eye, Perfect Dark, and other PC efforts before making your titles. I'm not expecting full cooperative and counter-operative play of a singleplayer mode, but there is no reason why assassination, tag, steal the bacon, CTF, multi-team modes, domination, and other niceties can't be included. Other reviewers may think the current crop is doing enough, but I do not... Not by a long shot.     What's worse than having to play the same missions on the same maps? Every single round devolves into a kill fest, and damn fast. Levels are riddled with choke points. Stairwells that open into corridors, large spaces connected by a single door, bridges connecting two sides, they're all here. Almost every map is nothing more than a series of purposely placed graveyards strung together in such a way to force constant and always deadly encounters, because the bullets, they spray fast and lethally.It's not uncommon to die within a moment of spying an opponent. But like I mentioned above, I'm in no way opposed to one shot kills. In fact, I was once quite the astute UT Insta-gib player (a type of multiplayer that still remains one of my favorites). I could live on in that game for a good minute and a half to three minutes without dying, all the while consistently racking up monster kills. Nothing was tenser than flying around a corner and coming face to face with another pro. What ensued was bliss. Strafing, jumping, crouching, timing, dodging, environment manipulation... Hot damn, I feel enthused just thinking about it! This level of play was only made possible because UT had meticulously and lovingly designed maps and a weapon that, even though it killed in one shot, was balanced with a reload time and speed that made it workable. None of that comes with TacOps. The weapons here shoot so many bullets so fast that it's nearly impossible not to die or kill. Yet at the same time players run speedily around maps that are tight, thus constant blind encounters and frantic mouse swings, however vain, are an everyday occurrence.No Mobile Forces vehicles, no advanced Global Ops ballistics modeling, no Counter-Strike feel, no Wolfenstein teamwork, plenty of, ~Hey, I'm dead. Peachy.~ At least Assault on Terror is rather pretty. But then Unreal based games have always been attractive. This one can't ever hope to approach the level of graphical acuity found in Medal of Honor or Jedi Outcast (coincidentally both Quake III: Team Arena based -- Unreal Tech's current largest competitor). Still, there has always been something alluring about the sheen, gloss, and richness of Unreal environments. TacOps is no different. Everything here feels very polished, very structurally sound, very soft, and very thick. Some levels are dark, but it's purposefully done, thus allowing the flashlight and night vision goggles to retain some functionality, some worth. Otherwise there'd be even less reason to purchase them as items. Me and you, we're still waiting for the game that can be played in variable time and weather conditions.   Most of the weapon models (now renamed to fictional standards, preventing copyright infringement) are also attractive with nice articulation, excellent shading, and accurate designs...if you're looking at them in screenshots anyway. Playing tells a different story. None animate too well and all sound horrible, surprising too, because the opening theme, which a lot of us games editors agree causes one to immediately want to play Deus Ex, is very cool, albeit a bit out of place (sci-fi, semi-futuristic coolness where a militaristic drum beat should perhaps be). But the guns, they do indeed sound something awful. Unlike the technically superb and delightful Allied Assault, or what we've heard of the equally impressive forthcoming Soldier of Fortune II, TacOps is content with just making the wrong kind of noise, and lots of it. Rogue Spear, Ghost Recon, and Counter-Strike are about caution, care, cooperation, coordination, planning, and pacing. In those games, making decisive pushes, quick moves for cover, strategic retreats, and last ditch grabs at the gold are not only important to success, but balanced in such a way that they become enjoyable activities in play. On the opposite end of the spectrum we have the twitch shooter and even the partial twitch shooter with branches that extend into the realms of team-based gaming (i.e. Wolfenstein). These titles rely on similar precepts, but implement them in a much different way. They necessitate and then relish close quartered action made glorious not only by a person's instinct and reflex, but by superior design and testing.And that's what quality samplings from the two extreme ends of the FPS genre have in common: testing and design. Tactical Ops has neither, and furthermore finds itself, by nature, stuck somewhere in Purgatory between meticulous and methodical play and full on bunny hopping. It punishes rush tactics and frantic action with instant deaths, yet insists we play in this style and at these stupidly blinding speeds on choke point ridden maps with brutal weapons that spray far too many damaging bullets, far too fast. Three second matches are not fun. I leave you with a snippet from a scene of Angel, which is now perhaps my favorite television show currently producing new episodes (I'm weird; sue me)... ~I like trouble, but I hate chaos.~", "date": "May 7, 2002"}