{"name": "DDR Konamix", "name_review": "Dance Dance Revolution Konamix", "ref": "https://www.ign.com/articles/2002/05/07/dance-dance-revolution-konamix", "text": "Dance Dance Revolution Konamix has been three-quarters reviewed already.  Just read the original Dance Dance Revolution review.  That's three-quarters of the game presently at hand -- all there is to review at this point is the Konamix.  Hence, this is not going to be a very long review.  It is a favorable one, however, because the only think wrong with Konamix is the fact that it's come out a year too late.   This is the DDR that Konami could and should have released in the USA first, with a newer interface, newer songs, Solo mode, and a touch of original music as a favor to long-time fans.  The original USA DDR was of absolutely no value to anyone who owned a copy of one of the four or five import versions at the time.  Its interface was a generation old, and its musical selection was supplanted entirely by the arrival of 4th Mix, not to mention the presence of several times more N.M.R. tunes than good sense dictated.  These issues have thankfully been repaired.  Of course, the import contingent probably has its eyes on DDRMAX, coming to Japan in a couple of weeks, but I suppose we can't expect Konami to keep everything perfectly up to date.  For those who can't be bothered with the expensive rigmarole involved in importing PS2 games, this is a reasonably-priced, well-organized alternative.  Songs  The first American DDR had some high points in its song list, but the average was still pretty poor, with some glaring omissions.  In contrast, while Konamix has its odd moments, on the whole it's a better and more danceable collection of music.  In particular, the downtempo component under a little more control this time.  The total number of songs is much higher -- 52 in comparison to something like 20 the first time out -- and a goodly portion is kept locked to reward dedicated players.  Of course, Let Them Move and its diabolical ilk are still there, but the nice thing about the 4th Mix-styled interface is you don't have to ever even see those songs if you don't want to.  Pick the club, Beatmania, or classics categories and there's plenty of bounce available to keep the blood moving.  Which in the author's case is actually not such a good thing, but let's move on...  Interface  What's arguably even nicer than the improved song list is getting a crack at the 4th Mix menu system and mode set, which is a lot more stylish than the one used up through 3rd Mix (and in the original US DDR, never mind that there was a superior alternative already available at the time).  Songs are broken up into categories to more easily manage the larger selection, and all the menu art is in high resolution.  The mode selection includes an up-to-date array of difficulty and style modifiers -- not as many as DDRMAX, but that's no sin -- and Solo mode is a particularly welcome addition.  This lets you play any song in a souped-up six-button mode, if you aren't burning quite enough calories with your present DDR regimen.  And of course, Workout Mode is available to let you count up every one of those.There's not a great deal else to say.  My piece was spoken some time ago as far as DDR's core gameplay, and that hasn't changed a whit.  Konamix adds more on top of that, much more than its predecessor, making it a worthy purchase for DDR fans who haven't already gone to the trouble to import a Japanese equivalent.Now, to wait another year or so for DDRMAX...", "date": "May 7, 2002"}