{"name": "Hunter: The Reckoning", "name_review": "Hunter: The Reckoning Review", "ref": "https://www.ign.com/articles/2002/05/17/hunter-the-reckoning-review", "text": "Not many Xbox games are made specifically for four players.  Some games have minor four-player elements, usually split-screen, but few are designed with a four player brawl as the main focus.  Hunter: The Reckoning is a rare exception.  Developed by High Voltage, the game is all about having a few friends over for a beer and some fun.  I'll spare you the suspense--the game is good.  Based on the White Wolf tabletop RPG of the same name, Hunter mixes hectic combat with moments of dark humor, creating an intense atmosphere that is quite addictive.  Features  Zombies, gargoyles, crocodiles, exploding spider-things, vampires, and more to chop, shoot, and blow up real good Tons of melee and ranged weapons Four-player single-screen action Use ~edge~ powers to vanquish the undead Unlockable new textures and Nightmare mode Only on Xbox  A Prisoner's Revenge Things are nice and peaceful in the town of Ashcroft until some kids decide to have a rave in the old abandoned prison.  Apparently the dead don't care for house music, as the spirit of an executed prisoner helps unleash the undead on the quiet, conservative town.  Mayhem ensues, as the undead take unsuspecting Ashcroft by storm.  Children cry over the bodies of their dead and devoured parents, dogs howl to a blood red moon, and all appears lost.  That's where you come in.  As one of four heroes, you'll take on the hoard of undead, solve the mystery behind the rise of the dead, and save the town from damnation.    Gameplay Hunter features four playable characters, each with their own unique skills and weapons.  Each character begins with a melee weapon and ranged weapon with unlimited ammo.  The initial ranged weapon is a little weak, but will save your ass many times thanks to that limitless supply of ammunition.  Choose to play as:  Deuce Wyatt: Avenger Samantha Alexander: Defender Father Esteban Cortez: Judge Kassandra Cheyung: Martyr    Characters have different attributes, requiring you to employ different strategies for each one.  As Deuce, you'll want to get in close and go hand-to-hand with the beasts because the Avenger has incredible power with his axe.  The Martyr, however, doesn't do much damage with her daggers, but is fast and can run rings around zombies while blasting away with her double-fisted pistols.  Guns and swords aren't the only tools for hunters.  Edge powers can be used to effectively deal with the phantasm menace.  Some characters, like Deuce, can't rely very heavily on their edge, while Father Esteban, the Judge, needs his various edge powers if he plans to survive.    You gain experience as you kill baddies and use weapons and edge powers.  As you progress through the game, you'll be able to acquire better versions of weapons based on your experience, as well as gain new and more powerful edges.  One important thing to note is that players gain experience individually.  So, if you have been playing the game as Father Esteban the whole time and then decide to switch to Samantha Alexander half-way through, Alexander will have no experience at all, and therefore have weaker attacks and edges.  This isn't a problem if you play through the whole game with a group of friends, because you will all be gaining experience.  But should you play it alone for a while and then want to bring in a friend or two, they will have to jump in as weaker characters.  There are a variety of weapons at your disposal, such as a chainsaw, flamethrower, machine gun, shotgun, and rocket launcher.  Weapons are sprinkled throughout the world and are often hidden off the main road, rewarding players who fully explore each environment.  The controls are cleverly done: Left triggerJumpRight triggerFires whatever weapon you currently have equippedLeft thumbstickMove character Right thumbstickAim AReload your weapon or activates switchesXCycle through default weapons YCycle through edge powers BCycle through pickup weapons   The weapons you pick up throughout the game have limited ammunition.  Not only that, but most weapons take clips, which must be reloaded.  For example, at the start of the game, the standard shotgun you pick up can only hold two shots at a time, and must be reloaded frequently.  Not all weapons can hurt all creatures, so while the game is mostly a slaughterfest, you will have to learn what weapons hurt which beasties.    Killing zombies has never been more fun than in Hunter: The Reckoning.  The game has auto-targeting, so the worry isn't in hitting or missing zombies, it's in taking them down as fast as possible.  Because zombies swarm.  The start of the game eases you into zombie-killing, but you will quickly find that it's easy to have the entire screen packed with bad guys.  There's never a lull in the action and never a moment to rest.  The control scheme is perfect for the constant action.  Not once in the many hours of playing Hunter have my hands cramped or tired.  For all of the non-stop craziness, I'm able to pump shotgun blasts into the stomachs of the undead without pause.  The task of dispatching zombies never gets tedious.  Of course, what makes thing even better is that these aren't your standard undead.  These cats can fire machine guns, pistols, and even flamethrowers.  And the vampire girls are incredibly fast and nimble, able to do flips and crazy kicks.  Oh for the days when zombies walked slowly and drooled on themselves.  Does Hunter have it all?  Yes.  While anywhere from one to four players can get in on a game of Hunter, it's really meant for four.  Alone or with three friends, you'll face the same number of monsters with the same amount of weapons and ammo available.  The difference comes in the difficulty with defeating monsters.  With less players, the undead are a little easier to kill and do a little less damage.  That's not to say the game is easy, because it's not.  There are some parts that are truly hectic.  But the game is a lot easier alone than with a bunch of your idiot friends.  The main limitation of multiplayer is that you are limited in movement.  No one can stray off the screen, so you may want to run, but your buddy will be busy trying to go the other way to get more shotgun ammo.  The result is a lot of yelling and screaming, which mixes in nicely with the laughter and shouts of triumph.  This vamp can so bite me  Lives are pooled with multiple players, so it's important to keep your friends alive.  That can be hard when you switch on the ~friendly fire~ option.  With it off, you can swing and fire with impunity.  But when the option is on, you have to be careful where you point your flamethrower or you will see your buddy catch fire and flail like a spastic fool.  Hunter's only failing is in its length.  Unlike Gauntlet, there are not seemingly limitless levels to trudge through.  Instead, there is a definite ending, one you can reach in under ten hours.  However, the experience of Hunter is so enjoyable, it's not hard to pick it back up to run through again.  For those playing alone, the game certainly has replay value as you'll want to take each character through the game at least once to see their different cut scenes and to earn all of their various edge powers.    Graphics Hunter has a variety of different environments, from subways to a church to sewers to a haunted prison.  Each environment is unique and has its own feel.  Some of the monsters vary between environments, but not to too great of a degree.  There are some destructible objects, including cars and gas tanks that can be blown up to kill a good number of nearby enemies.  Deaths are sweet, with zombies taking head and gut shots, getting decapitated, quartered, and disintegrated.    The environments have good textures, with floating mist in the graveyard and slimy sewage in the sewer.  It's easy to overlook the graphics, but the level of detail throughout the game should be noted .  Because the view is pulled back and the action so furious, the miniature details on each character and zombie might be missed.  But on closer view, it's easy to see a lot of work went into differentiating the zombies and beasts.  What I love most, though, is returning to an area to find the blood splatters of a previous battle still staining the ground.  Not only is it a cool thing to see, but it's a great way to mark where you've been.  The undead are truly creepy in this game.  There are some great designs here, like the ghosts of hanged men, floating around, nooses still tight around their ethereal necks.  They let out wails of pain that damage those in its path.  Then there are the true monstrosities--ten-foot tall creatures with extra eyes and arms, just out looking for a bite to eat.  The variety of baddies is one of the best I've seen from a zombie game.  Plus, one of the bosses is a giant evil  teddy bear.  Natch.  Sound Hunter isn't a Resident Evil-type game.  This isn't survival horror, so you don't have to worry about wetting your pants with fear.  The music reflects the action aspect of the game, with some great, pumping tracks that do a fine job of kicking up the adrenaline.    A lot of the sounds in the game are done very well, such as the rap of gunfire and the boom of explosions.  The center channel is used well, as is the subwoofer.  The tap of footsteps is clean and realistic, and you can hear the Hunter pulling out a weapon, reloading, and grunting as they're damaged.  But the soundtrack and zombie noises are so loud that they drown out the smaller touches (like the footsteps).  Of course, the report of a gun should be loud, so I can't really fault the game for making it overpower some of the other sounds.  Still, a little more atmospheric sound would have been nice.  Introducing my high school gym teacher  Hunter is a joy.  A true pleasure to play.  I dream about this game.  I don't have to stop to think ~what game do I wanna play tonight,~ because I already know.  It's all about the Hunter.  The only downside is the length of the adventure, but even after getting through it once, I'm ready to go again.  Hunter is what the latest Gauntlet needed to be but couldn't.  When the next four-player slaughterfest comes out, it's Hunter they should be compared to, as it's truly the cream of the crop for the genre.  If you have friends, get this game.  If you don't have friends, buy a few and get this game.", "date": "May 17, 2002"}