{"name": "Baseball Mogul", "name_review": "Baseball Mogul 2003", "ref": "https://www.ign.com/articles/2002/05/21/baseball-mogul-2003", "text": "If you like baseball, you might listen to sports talk radio. However if you really like baseball, you might not want to listen to sports talk radio, for while the hosts are generally quite knowledgeable, the depth of ignorance displayed by the average fan sometimes knows no bounds.    Let me give you an example. I grew up in the San Francisco Bay Area, I am a Giants fan. People call our radio station (KNBR) all the time, demanding that the Giants trade J.T. Snow or Marvin Benard for some more powerful hitters who can better protect Barry Bonds. Well the problem is it takes two to tango, and nobody else in their right mind is going to be on the other end of that trade. The Giants gave those guys contracts that far exceed their actual value, and now they have to live with them. Prove it to yourself, install Baseball Mogul 2003, and try to make that trade.    J.T. Snow is a 33-year-old first baseman who hit .246 last year with eight home runs. Granted he is an excellent defensive first baseman, but he is at best a below average hitter in what is traditionally a power position. Yet he's the fourth-highest paid player on the team, making just shy of six million dollars a year. In other words, not only is he a weak spot in the starting lineup, he's also eating up a disproportionate amount of the Giant's total payroll. This makes him virtually un-trade-able, something the average fan doesn't comprehend.   Short of actually joining the front office of a Major League franchise, perhaps the best way for baseball fans to understand the financial mechanics of baseball and how it affects their team is by playing a sports management simulation. They are far more instructive in this regard than say rotisserie or fantasy league baseball, since they deal with real-world fiscal numbers, yet they're every bit as much fun.     Of Sports and Sims   What you have to understand about sports management simulations is that they are strategy games, not 'sports' (arcade) games, even though they will invariably be filed under, sold as, and forever categorized with the Triple Plays and Maddens of the world. Nonetheless, Baseball Mogul 2003 has more in common with a game like Capitalism 2 or even Civilization than it does with anything involving a gamepad or two. You never actually step onto the field and control your players -- the game is essentially a spreadsheet of baseball statistics and financial information, from Earned Runned Averages and Slugging Percentages down to daily attendance and the price of a hot dog and beer.   This is a game that has been around a while, too -- since 1997 I believe, and this is the fourth or fifth iteration. The 2003 edition isn't radically different from last year's game, so much of what I wrote about that version holds true here. However almost everything I complained about in that edition has been corrected, while a host of pleasant new features have been added, making this in every way this is a better game. I'll make note of those changes as we go.   However, rather than write this review in your typical fashion -- blandly running down the graphics, gameplay, sound, etc. in predictable order -- I'm going to tell you the story of one season of baseball. This way I think you'll get a better understanding of how the game is played.   One thing that's great about Baseball Mogul is that every time you begin a new franchise, you can step in as baseball's commissioner and set things up the way they should be -- or at least, the way you think they should be. For starters, I fixed the screwed-up, unbalanced divisions. There are 30 teams in baseball, so explain to me why there are six teams in one division and four in another? I moved the Brewers back into the AL Central, and put the Royals into the AL West. Then I moved the Montreal Expos franchise to Washington D.C. and renamed them the Senators. A decrepit dome filled with eight thousand Francophones sitting in a covered in Astroturf and marked out in ~metres~ isn't really baseball, is it? Lastly, I got rid of the DH, with apologies to George Will.   Of course, you too can do whatever you want. All the teams can be renamed, there are dozens of cities (with weather and population statistics) just begging for a relocated franchise, and with enough time and effort one could probably recreate some of the minor leagues or go back in time to when there were only 26 teams. You could even (shudder) put a DH in the National League or invent eight new cities and play entirely in Japan.    Into the Hot Seat   Now that I had MLB aligned the way I wanted, it was time to give up my commissioner seat and take control of an individual franchise. As I've said, I've played the heck out of last several versions of this game, usually as my team (the Giants) or, when I wanted a bit more of a challenge, Oakland. But that was getting a little old, so this year, I decided to play as the Minnesota Twins, one of the two teams that baseball's real commissioner, Bud Selig, has been trying to disband during the real off-season (the other team with its neck on the block being the aforementioned Expos).   The Twins were in poor shape. They had little cash, and most of their payroll was tied up in starting pitching while the position players were making league minimum, or a little more. Average attendance was among the worst in the league, and fan loyalty was a feeble D+. Obviously this was going to be quite a challenge, particularly since I was on the harder difficulty mode.   My long-term strategy was to hoard cash to build a better stadium (with natural grass and a retractable roof, of course), while trying to get the best young prospects tied up in long-term contracts with rock-bottom salaries. To that end, I increased spending on scouting, then traded away Brad Radke and some of the other starters for young prospects. This actually made my team much worse in the short run (and far more feeble than the real-life Twins are right now), but hopefully we'd become much stronger in the long term. Taking a chance on some young unknowns with a lot of potential, like putting a young unknown named David Dellucci in the third slot, I ended up with a decent core of young hitters and an adequate starting rotation. Joe Mays became my ace. Only one of my starting eight (Corey Koskie) was due to leave at the end of the season, and re-negotiating his contract was futile -- currently I was paying him one point, but for next season he wanted 28! I would have to trade him before the All-Star break, but fortunately I had three decent third base prospects down at Triple A.   (Due to the vagaries of MLB licensing, the game can't use real dollar figures for player salaries, only ~points~ -- but each point is +/-$200,000, and if you get confused you can always check EPSN.com's salary listings to your own in-game ones...keeping in mind the salaries will change as players re-negotiate, both in Mogul and in reality).    Next I added some minimum wage veterans to sit on the bench as substitutes -- it's not a good idea to have young players riding the pine when they should be down at AAA getting their swings in. I picked up a guy in his early 40s with a lifetime average of over. .300 as a situational pinch hitter, and another oldster whose average was lower but with great power and slugging numbers. There really isn't any way to tell the CPU which pinch hitter to use in which situations, however. The game never really drills down to the play-by-play management decisions of the bench and pitching coaches, only the roster moves mandated by the GM (you). As GM, the in-game decisions aren't yours to make anyway, all you do is give your field manager the tools to get the job done.    For this reason, there aren't lefty/righty stats or lifetime individual match-up stats: because they don't really make sense on the level of abstraction of this sim. What would be nice though would be perhaps a few ratings for your coaches in terms of competency and salary, rather than have them all generically be the same. You can however now set Tony La Russa 3-style tendencies, such as how often they will pinch hit, pitchout, pitch around, etc., which are useful since you want to tailor these strategies to your ballpark and your players: i.e. fast teams should hit and run and steal, whereas in bandbox ballparks you should go for a power lineup.   Next came the long, enjoyable process of tweaking my line-up, my bench, my starting rotation, and my bullpen. I sucked up all the minimum salary free agent pitchers and positional prospects who were even worth a darn to use as trade bait, and began the long process of wheeling and dealing.     Delving into the feature set   One of this game's great strengths is the ease with which you can find the players that fit your needs. There is a sophisticated player search page that lets you search the database with any number of qualifiers, from age, salary, and ability level to particular stats or achievements. Generally you want guys under the age of 30 with B+ or better ratings in their primary attribute, but who are making only one or two ~points~ ($200k to $400k), ideally for at least several more years. This is usually the best way to fill a hole -- once you have five or six of these prospects identified, you began sounding out the other GMs, to see what they want for those players. Some teams won't dicker at all, but teams outside your league who are loaded with duplicate prospects are often more amenable to trades. You can even buy and sell players outright, for a minimum bid of $200,000. The game's trading AI is top-notch, and the whole trading/search system in Mogul puts the big commercial games like High Heat and Triple Play to shame. Mogul doesn't have the full minor league system High Heat does, however, you're limited to a Triple A team -- however that team can be as large as you can afford.   Other ways of finding players include combing the Free Agent list or using the nifty trading block, which lets you throw any sort of combo of players and cash onto the auction block and see what all the other teams might be willing to give you...this is the feature I mentioned in the beginning of the review, when I was trying to trade J.T. Snow.    Once my lineup was set, I was ready to begin the season, but Bud Selig struck yet again -- handing me possibly the worst opening month's schedule in the history of baseball: 21 days straight of road games. Even in the real world, the Twins began with a mere 11 straight road games to open 2002. Fortunately my payroll was so bare-bones minimum (around $21 million) that we hardly lost any money at all, and even stayed in contention for a week or two. And so began the first of what would become several (more) seasons of rebuilding for the hapless Twins.   Another nice thing about Baseball Mogul 2003 is that you can set your pace of play. You can sim one day at a time, or entire weeks and months in one go. You can even power-sim entire seasons multiple times to sort of guesstimate your final standings. This is a great way to make time fly -- you can run through an entire month, but if someone gets hurt, an injury contingency allows you to stop the action and make the appropriate substitutions. Generally I sim one week at a time, checking the pitching and batting stats at the end of every week, tweaking the starting lineups, moving players up and down in the batting order, and combing the free agent list and trying to make trades.   One must also make numerous adjustments for injuries, particularly on a team on which everyone is either extremely young or in the twilight of their career. The sim seems to limit the effectiveness of rookies less by making them struggle than by having their bodies give out on them with great frequency -- particularly the pitchers.   By the time the dog days of summer had rolled around, the Twins were firmly planted in the cellar of the new AL Central, trailing even Selig's hated Brewers. Not a single Twin made the All-Star team, and only Detroit was keeping me out of last place. Still, the team was averaging 5,000 more fans per game than in 2001, thanks to my dramatically reduced ticket prices. More to the point, we were the third most profitable franchise in baseball, with a profit of nearly ten million dollars by August, all of which was going into our new stadium fund.    Only Baltimore and Washington were doing better -- the Senators dramatically so. They were pulling in money at a record rate, seemingly selling out every game even with absurdly high ticket prices and a last place team. It looked like our nation's capital was hungry for baseball, and that's a beautiful thing. Washington had banked $53 million in profit by September, and were sitting on $63 million in cash, far and away more than any other team in the league. That's even more than the Yankees and their ultra-fat TV contracts had, compared with which my Minnesota Twins were merely a farm team.     New and Improved   Earlier I mentioned that this year's version had a number of improvements. You can now tell your minor league staff what kind of emphasis they should make in the draft, directing them to favor certain positions (starting pitching, catching) or traits (speed, power). The player pages now include complete lifetime stats (including teams played on, thank you!), as well as the actual MLB photos and names (an issue in some past editions). The most important minor leaguers of every team are now included too, and furthermore, the randomly-generated rookies who enter the league at least now have random portraits too, rather than silhouettes. I also welcome the return of the play-by-play watch mode.   The interface has been polished (actual color in the menus!), the Help file has been expanded and re-written, and the free agent windows now include 'rumors,' indicating what other teams a player might be talking to. The new stadium construction option is fascinating new feature I haven't fully explored yet, but if you follow the game you know that a new stadium can dramatically reverse the fortunes of a team -- and the reason why is always financial, which is reflected in this game.   That's not to say everything is perfect. The screen still doesn't seem to want to resize, leaving the game only marginally larger than a pop-up ad on a PC with an ultra-high resolution screen. Also stats don't sort to the extent of High Heat, and it would be nice if at the end of the season you could have one screen where you could see all your departing free agents' salary demands, before their agents start hitting you up for new contracts one by one.   Speaking of wish lists, it would be nice if star power sold more tickets (Deion Sanders or Michael Jordan, for example, would have had an A+ ~Drawing Power~ rating in their prime), while aging veterans shunted off into the minors should probably just give up and quit. You'll also never see players complain, hold out, or demand trades. An experimental salary cap option in commissioner mode would be interesting too. And on a grim note, the threat of labor trouble might be an interesting thing to simulate.   Getting back to my season, in the end the Twins finished 80-82,in third place and ahead of Selig's Brewers. I considered that a success, all things considered. Ultimately Cleveland won my division, but were knocked off by Seattle, who in turn in a nice twist of karma fell to my very own Giants...who, ironically enough, were helped out considerably by J.T. Snow.   What did you think of Baseball Mogul 2003?   I won't bore you with the rest of the Twins story, suffice it to say that several seasons later we're well on the road to recovery, our stadium fund is just about complete, and we're about to build the new park that's going to turn us into a contender. The moral of the story is that every season is different, and each of Major League Baseball's storied franchises has a story to tell.   Lastly, I should also note that there is a multiplayer feature that lets you compete against a league full of other human GMs, rather than just against the PC. There is a small fee for using this service, but unfortunately my schedule as a game reviewer doesn't permit me to get involved in something as lengthy as an online baseball league.  Baseball Mogul 2003 is a great way to pass the time. I like to fool with it while catching a real game on TV or the radio. But beyond its sheer entertainment value, it exposes you to a part of the sport that most fans are utterly ignorant of. But through a game like this, you'll gain an understanding of the financial mechanics of baseball, and that will make you a better and more knowledgeable fan. The game easily purchased over the web, directly from the publisher, Monkeystone (John Romero's new venture). But what's perhaps most remarkable of all, Baseball Mogul 2003 is largely the effort of one programmer, a fellow by the name of Clay Dresslough, who will often take the time to answer questions directly on the game's forums. You don't get customer service like that very often anymore.", "date": "May 21, 2002"}