{"name": "Grand Theft Auto III", "name_review": "Grand Theft Auto III PC Review", "ref": "https://www.ign.com/articles/2002/05/27/grand-theft-auto-iii-2", "text": "Even though the editors at IGN ultimately chose Halo for 2001 Overall Game of the Year, after the ballots were counted and the chads examined and re-examined, the decision came down to a one-vote lead for Halo, with an intense eight to seven battle with another extraordinary impressive game. The seven dissenting votes went to Grand Theft Auto III for the PS2, and I was among those who thought it was good enough to deserve the ultimate of awards.GTA3 took up so much of my time between the Halloween to Christmas period that people considered calling the police because they hadn't seen me in so long. I was totally immersed in the game, and after finishing the game once, I didn't hesitate to pick it up and start in on it again in an attempt to find everything possible in the game. So it may come as a surprise that I was willing to snatch up the PC version for review. Call me a masochist or call me a glutton, but I just can't get enough GTA, and even after putting in well over 100 hours on the PS2 version, I still had a hankering to find out how the PC version of the game turned out, and I have to say I wasn't disappointed in the slightest.Let's get one thing straight from the get-go -- GTA3 is rated ~Mature~ for good reason. Rockstar's high-impact hooligan simulator has been in the media since well before its release on the PS2, mainly because of its mature content and themes. This isn't your typical ~collect the coins and save the princess~ types of game -- this is gaming with attitude. Grand Theft Auto III is extremely dark, gritty, and aggressive. You can hi-jack cars, gun down police officers, pick-up hookers, run-down pedestrians, and pretty much anything else you might expect from any of America's most wanted. This isn't your grandma's game. But then again, you probably aren't a grandma...or if you are, rock on for reading IGN you boomin' granny you! Just note that, like any form of entertainment, you should be aware of the mature content in GTA3.Now, with that said, screw all that politically correct BS and enter the world of Grand Theft Auto III. Like the PS2 version, you start the game as a bank-robbing thug stuck between a sack of cash and a beautiful woman. Only thing is, she happens to be a little greedy herself, and in exchange for the money, gives you a few bullet holes. This is convenient for the cops since you can't run too far with those gaping chest wounds, and you end up take the wrap for the heist.On the way to the big house, you escape from the police through a mysterious hit-and-run. You and 8-Ball, one of the other prisoners, take the opportunity during the confusion to relieve the guards of their consciousness, grab a car, and speed away from the scene to renew your life of crime and find your ex since you have a few things to discuss.Describing the gameplay in Grand Theft Auto III is a bit difficult. Basically it's a criminal simulation that gives you free reign of Liberty City, a dark urban locale teaming with hoods, hookers, and gangland warriors. It's a hybrid game that combines a variety of different elements and genres including driving, high-intensity racing, shooting, item collection, mission-based gameplay, and open-ended exploring. This is one of the things that really sets GTA3 apart from your average game -- you can do almost anything. If you can think of it, chances are you can do it. You can ramp your car up on the elevated train rails and drive around town, take to the waters surrounding Liberty City in a speed boat, pick up a hooker in your swanky low-rider, go cruising for fares in a yellow cab, or hop in an ambulance for a little joy ride.Because of the massive scale and scope of the city, simply exploring the city itself is enjoyable and rewarding, and there's never a time when you're at a loss for something to do. It's fun just to break off on your own and diverge off of the main plotline and go cruisin' around town. It's actually even beneficial, because you'll locate hidden packages and stunt jumps that you would have never found if you had just played through the mission-driven portion of the game. The scale of the game is just mammoth -- consisting of three large urban areas, the industrial, commercial and suburban districts, each with appropriate architecture, landscapes, and settings -- and you really feel like you're in a living, breathing environment when you're driving around the streets of Liberty City. This massive scale may actually be a drawback for some players as it will take you a while to learn the lay of the land and how everything works, but trust me, you will get just as much out of GTA3 as you put in.As open-ended as the game is, there is also a set track of missions you can follow to progress through the game, and there is a definitive beginning and ending to the game. Working for various underworld bosses around town, you'll be sent on assignments ranging from simple errands like carting an from point A to point B to disposing of bodies to running money for the mob to taking out rival gang leaders. And the various Dons and leaders aren't the ones who will give you jobs. There's a whole series of side-quests in the game that you may happen upon, whether it be through a tip given to you in a cutscene, by picking up a randomly ringing phone, or from your handy-dandy pager. There are over one hundred missions to complete and hundreds of miles of roads to explore, and you can play the game completely ordered and linearly or loose and random, and remain completely entertained while doing both.  What makes the game so entertaining to explore is the design and presentation of the entire package. GTA3 is just dripping with style, from the architecture of the different sections of the city to the characters you'll meet in said city to the dark humor that runs throughout the game. A huge part of this distinctive style comes from the soundwork. Developers are really starting to pay attention to game audio, and GTA3 is one of the best examples of a full-featured audio experience, and everything from the voice acting to the sound effects to the chatter of pedestrians to the music are implemented with a lot of thought and expertise.The radio stations play a big part in the character of the game. Most of the game takes place as you drive around the city, and what would a drive be without a little music? As with the previous games in this series, every car you jack has a radio in it tuned to a different station. There nine different stations to listen to in the game as it ships -- Head Radio (commercial pop), LIPS (commercial pop), Double Clef (real classical music), Game Radio (hip-hop), Chatterbox (talk radio), K-Jah (reggae and dub), MSX (drum-and bass), Rise FM (trance), and Flashback (retro 80s pop) -- and you can opt to import your favorite mp3s to an extra station so you can listen to your own play list during the game. Although there are some crackles and pops in the menu screen, overall the sound work is extremely well done, not only in terms of technical prowess, but also in terms of style.As if the music itself weren't nice enough, the voice acting is superb as well, and the cast of characters is portrayed by such big names as Robert Loggia, Kyle Maclachlan, Michael Madsen, Joe Pantoliano, and Michael Rapaport. The professional actors add a lot to the atmosphere of the game, further immersing you into the city.Most of the time you'll be in one of the approximately 50 different vehicles modeled in the game, each with their own unique handling characteristics. There is a distinctly different feel to each of the vehicles in the game, from the slow yet sturdy Flatbed to the fast but fragile Banshee. One of the neat bonuses added to the game are the Insane Stunt Jumps. Scattered around the city are several ramps that you can vault off of to flip, twist, spin, or roll your car for extra bonus cash. It doesn't really affect the game in any way, it's just fun to ramp off into the air and see where your car ends up.Driving your vehicle around town is even more fun as you watch it slowly crumple and crinkle as you run into other cars on the road or bash into light posts, fire hydrants, and poor hapless pedestrians who happen to be using the sidewalk you just made a freeway. As you take more damage you'll see parts of your car fly off, usually starting with the hood and ending with your car a flaming wreck which you better high-tail away from unless you want to end up a thug flambe.While the cars may be the focus of the game, you can explore the entirety of the city on foot if you wish. And as you'll be working out while hoofing it around town, you'll be able to run farther the more you forgo the use of a car. It's little details like this that take you by surprise when you figure them out, and make you keep trying new things to see just what you can do. This exploration on foot is where you'll notice the exceptional Artificial Intelligence in the game, as you'll be down face-to-face with the citizens of this living, breathing city.So what do we mean by a living, breathing city? Well, if you let your character just stand there, the world around you -- the civilians who walk by, the cops who stroll the streets, the traffic -- all exists around you. Just roaming the streets is an experience as you stand there, listening to the city around you. Voices from inside the hospital talk about spanking babies, old crouched women putt by mumbling to themselves, businessmen walk by complaining about needing a vacation, all while countless other folks around you go about their business in the city. And of course, as you would expect, everyone screams and runs when you shoot off your Uzi in the middle of the street.One of the biggest gameplay problems with the PS2 version was the difficult aiming system. This problem has been alleviated with the keyboard/mouse combination, which gives you much greater accuracy than the thumbstick. You just can't beat the mouse for precision aiming. The use of the mouse also lets you explore the city like never before as you can look around the environment while you're running around the city, taking in the sights much easier than in the PS2 version. I literally saw signs and buildings I had never noticed before, which only further immerses you into the living city feel of the game. However, there are some trade-offs with the control system. It is admittedly harder to drive with the keyboard than it is with the PS2's analog stick, but I think it's worth it for the improved accuracy you get with the keyboard/mouse combo. Of course, if you wish to play with a control pad on your PC you can do that as well.  Although the PC version is pretty much a carbon copy of the PS2 game in terms of gameplay, it does look a bit nicer. It's a little blocky and jaggy, but you can play in resolution up to 1600x1200 with 32-bit textures and colors, so the jaggies aren't nearly as apparent as they are on the PS2. And now that the GTA series is now rendered in full 3D, you feel like much more part of the environment than in any of the previous iterations of the series, with the smoke, fire, and weather effects only adding to this immersion.Players can choose to select the distant, top-down look, which is the classic view from the first two games, or they can look at the game from a different perspective, from a close in, over-the-shoulder view. The feeling of being this close creates a visceral emotion that's much more intense and direct than in previous GTA games. The characters in the game are low polygon models, but sport unique clothes and fashions that make them easily distinguishable from a distance, which is good since it's often good to avoid members of a particular gang that you've pissed off.All of this graphical prowess will come at a price. You'll need a fast system to run the game, and even though the minimum system requirements for GTA3 is a 450MHz machine, I recommend nothing short of an 800MHz with a fast graphics card (GeForce 2 or better) if you want to play with minimal slowdown and an acceptable draw distance. But even on the fastest of systems you're bound to run into some frame drop when there are a lot of things on screen at once, like in the middle of a race or an intense firefight.There are also some problems being reported with NVIDIA-based video cards, and I personally had a problem getting the game to run on my GeForce 3 under WinXP, but I finally got everything working correctly after downloading a file mentioned in the readme file. But the big question is, if they knew that the game had problems with the most popular brand of video cards, why even release the game until they remedied this problem?What did you think of Grand Theft Auto III?As you probably all know by now, although GTA3 for the PC was originally planned with multiplayer options in mind, they didn't actually make it to the final game. The designers supposedly even had deathmatch up and running in the game, but decided to take it out because they wanted to provide something unique and different for GTA3, and didn't have time to get it into the game before the intended ship date. As sad as the lack of multiplayer is, even without any such options GTA3 should offer up well over 40 hours of gameplay, although some of this time will be you playing the occasional seemingly impossible mission again and again and again until you finally get everything perfect. Luckily there's almost never a time when you can't find something else to do to take your mind off of a particular missions, and you usually have a choice of several different assignments scattered around the map.Even with some minor problems and drawbacks, all in all GTA3 is an amazing experience that you shouldn't miss. I say experience rather than simply ~game~ because, with a living environment that plunges you into the middle of a gang turf war and intense attention to detail, Grand Theft Auto III expands the very idea of what a game has traditionally been. It's simply huge, and the intense open-ended gameplay, believable Artificial Intelligence, pumpin' soundtrack, and total immersion in the cityscape make GTA 3 an amazing game to play.The only thing it loses any points for is the high system requirements and initial release bugs. There's nothing more frustrating than picking up an incredible game like GTA3 only to get it home and not have it work. And although I would have liked to have seen multiplayer in the game, GTA3 still stands as an amazingly in-depth and rewarding single-player experience, and I can't really fault Rockstar for not putting it in the game since they did such a great job with the single-player side.It's titles like this that give us a glimpse into the future of gaming. If you have the system to run it and you haven't experienced the PS2 version yet, I highly recommend you pick it up for the PC and give it a whirl for yourself.-- Tal Blevins", "date": "May 27, 2002"}