{"name": "Chameleon Twist", "name_review": "Chameleon Twist Review", "ref": "https://www.ign.com/articles/1997/12/16/chameleon-twist", "text": "Possibly the quietest game to be released for Nintendo 64 this year, Chameleon Twist slipped into American retailers last week. Unfortunately, this Japan System Supply developed 3D platformer wasn't advertised at all -- which is a shame because it's a surprising and refreshing addition to Nintendo 64's library.The story behind Chameleon Twist is simple. Davy, a super-tongued chameleon, follows a rabbit through a magic pot and in doing so somehow manages to transform himself into an alien and ends up in another land. He must then find a way back out again, traveling through odd worlds with only his quick wit and his long, over-sized tongue to aid him.Gameplay: Gameplay is relatively simple, but extremely intuitive. Utilizing an over-head camera view similar to that found in Bomberman 64, players must travel through odd, sometimes bland worlds, using Davy's tongue to eat enemies and advance through the game. The crazy tongue can be controlled via the analog stick for precise latching. Besides curling around enemies and sucking them into Davy's mouth where they can be spit back out like bullets at other enemies, Davy's tongue also comes standard with a number of other life saving abilities, including: a tongue-pole vault, which basically propels Davy above ground (like a hand-stand) via his tongue, which acts as a spring for Davy to reach high ledges that would be unattainable with regular jumps. Davy can also simply let his tongue fly out of his mouth, latch onto an object and then suck himself to it. This works great when the chameleon finds himself stuck on a ledge -- the only option being a pole sticking out of the ground on the opposite side of a stage. But the fun doesn't end there, either; Davy can also grab onto an object and then twirl himself around it with his tongue. Imagine for a second that players get stuck on one side of a room and the only way to the exit door, which lies at the opposite side, is by use of a pole in the middle of the area. Davy can latch onto the pole with his tongue and swing 180 degrees over to the other side. It's ingenious.Gameplay is not without its problems, however. Every now and again the camera angle will interfere with the a player's view of the action, turning what should be an easy procedure into a lesson in frustration. For example, nearly everyone who had a go with the game found themselves missing precision jumps because the angle of the action was misleading. Also, we noticed a slight framerate drop in certain situations, but it was so rare that we feel it doesn't deserve more than a mention.Graphics: Much like Bomberman 64 (a game in itself that not everyone around the office enjoys), the game has a bland, boring look about it. The first level, especially, features tiring colors and very uninteresting textures. Luckily, while the look of Chameleon's worlds never really improves, the level design -- and gameplay therein, shows noticeable progress as Davy advances through the game. Even the 3D polygonal characters are made up of minimal polys and make Miyamoto's simple enemies look lavishly detailed in comparison, but in the long run all the graphic short-comings take a back seat to the gameplay department.Sound: It should be noted that the music and sound effects aren't pretty. When we first turned the cartridge on we were immediately greeted with a number of requests to turn the volume down by fellow IGN employees. The music tries to be ~cute~, but is more effectively annoying than it is anything else. Sound effects are average, with a few token beeps and bops thrown in for jumping and enemy sounds.I couldn't get into Chameleon Twist. While I liked some of the original touches and moves (the whole tongue thing is cool), the ugly graphics and sound, useless multiplayer mode and short quest keep me from recommending the game. Chameleon Twist is one of those examples where the concept has a lot of potential, but the execution is less than spectacular. I have high hopes for a sequel, but this one is a rental at best.", "date": "Dec 16, 1997"}