{"name": "Imperialism 2", "name_review": "Imperialism II", "ref": "https://www.ign.com/articles/2002/06/07/imperialism-ii", "text": "SSI has found a way to satisfy the expansionist tendencies in all of us and that is their impressive new turn based strategy game, Imperialism II. The first Imperialism game from SSI was well made, but largely overlooked by the gaming press and gamers alike. Both titles feature and incredible depth to the gameplay and attention to detail. Imperialism II takes all that was good about the first title, improves some of the mechanics like micro-management, and scoots the player back in time to the 15th Century and the Age of Exploration.   Where the first Imperialism took place in the Industrial Age, Imperialism II lands you in a far more chaotic point in world affairs, when the major world players were Spain, England, Portugal, Holland, France and Sweden and the New World was basically a resource to be exploited. You play one of these powers, struggling for domination over the Western world through control over the riches the New World offers. Lesser nations like Denmark and Ireland are also involved in the struggle for power and can become useful allies or policy stumbling blocks as you vie for the title of Emperor of the World.    Control is accomplished through military and industrial means. Building a big enough army is one way to conquer, but the civilian side of empire building can be nearly as effective, by combining a nation's construction, transportation and diplomatic resources, you can either win over or subjugate opposing nations. Imperialism II is distinct from other economic simulations in a lot of ways, but in particular on its closely intertwined development trees. All sims have some sort of interdependency, but in Imperialism II, ignoring any one aspect of your nation's development can spell disaster in turns to come. Transportation is the backbone of your nation, but without a strong military to defend it, enemies will quickly take it over. Without transportation, your agricultural base can't deliver food to the people. Without food, your industry will suffer. Without industry, you can't build a military. The circle is very tight, ignoring any aspect of your empire is a quick delivery of your head to your enemies. Fortunately, SSI has included a lot of assistance in your resource management, taking a lot of the day to day details out of your hands.    No successful plan for world conquest can succeed without including a New World strategy. The virginal resources of the western continent provide vast quantities of natural resources that can be used to build up both your industry and your military. Establishing early transportation routes to the Americas is vital, but once their, your methods for acquiring land and power are up to you. Depending on your political persuasion, you're free to go in blitzkrieg style and wipeout the natives for their land, or you can barter for their cooperation. Either method has its plusses and minuses. Western lands are also different every time you play, with different resource and enemy allocations, offering lots of replay value and preventing players from memorizing key locations and exploiting them.   Like most civilization games, the research tree is an important area to devote time and resources. There are over 100 technologies on the research tree that you can investigate. Your research will eventually offer more than forty improved military, naval or civilian units.   Overall, SSI has succeeded in making an excellent sequel. Graphical and interface improvements make for a very enjoyable, high resolution experience. The sound design is also well done, offering a soundscape the evokes the 15th century. There is a steep learning curve, but it is worth the time investment to really learn to play the game.", "date": "Jun 7, 2002"}