{"name": "ZooCube", "name_review": "ZooCube", "ref": "https://www.ign.com/articles/2002/06/07/zoocube-2", "text": "The game is called ZooCube, but don't expect to be overwhelmed with furry animals. In fact, don't expect any animals at allother than the box-art and the single cutscene that explains the goofy storyline. In the game you're supposed to be rescuing these creatures trapped inside bizarre, colored shapes by matching them as pairs (kind of like Noah, get it?). Apparently the critters didn't make the cut for the GBA version, but they're all over the GameCube edition of ZooCube. Still, the lack of mammals and lizards running around the game screen doesn't hurt the concept or design at allthe portable version is, at its core, a lean-and-mean rendition of the fun and unique action puzzler game on the NGC. Features Seven levels Three gameplay modes Link cable support for two players (cooperative and competitive modes) Cartridge save for high scores Only for Game Boy Advance  The animal concept aside, ZooCube is an intimidating game at the start, but it's downright simple in its design. Here's the jist: you control a six-sided cube in the middle of open space, and you have the ability to rotate this cube in all directions, on all axis. One by one, objects of different shapes and colors begin to gravitate towards your cube in six directionsyour task is to simply rotate your cube and have the shapes latch onto a side. By connecting two objects of the same shape/color, these objects will disappear from play. When you have more than six objects latched to any side of your cube, the game's over.  But, to succeed in ZooCube, you do need to use your brain, since the only way to go up a level is to score pointsby just doing the basics, you're not going to advance very far. You need to use the game's point structure to your advantage. For exampleby latching the same amount of objects to all sides of a cube will give you a ~Balance~ bonus, and the thicker you make the cube in Balance (meaning, two, three, four or five objects on each side), the higher the bonus you'll earn. A ~juggle~ ball will show up whenever you clear a single side of a cube, which can simply be collected by having the next falling object slam into it. But the key is to keep juggling that ball by clearing an additional side of a cube immediately after the ball first arrives, increasing that ball's value. If you don't clear a side of a cube while the ball is latched to your cube, it will disappear and you will not earn any Juggle points. Yes, ZooCube looks complicated, but it's actually deceptively simplewith complex point scoring elements. The downside is that these bonuses aren't really explained well in the manual or in the tutorial mode...you really have to play the game a good amount of time to learn all the intricacies in the scoring.  The GBA version doesn't have the elaborate FMV sequences, crisp polygonal engine, or even the streamlined presentation of the GameCube edition. Graphic State Games built the same game design, but used sprites and the GBA's scaling abilities to simulate the console's 3D engine. The graphics aren't outstanding by any means, but they get the job done for ZooCube. The sound is equally subtle, featuring a nice soundtrack that accompanies the constant action. The cartridge saves your ten highest scores to memorybut with all the things that go on in this game, it's just a shame that the statistics beyond the simple rating number aren't saved as well. Like how Tetris tracks the number of lines a person clears.       With all that ZooCube is on the GBA, is it fun? I certainly think so. It's not the prettiest game on the system, but it's definitely the most unique, and a lot of thought was put into its design. ZooCube isn't as much a puzzle game as it is a game of quickness and endurance. It's like Tetris in the sense that you put yourself into a ~zone,~ and just do the task at hand as it gets faster and more intensethere are no Puyo-Pop style combos to worry about. When playing ZooCube, I'm reminded of playing Tempest 2000 on the Atari Jaguarjust let your mind go, and your fingers will do the rest. But it's how long your mind can be in this ~zone~ that makes or breaks your gaming session. The overall design could have a few more gameplay modes beyond the three singleplayer and two multiplayer options, it could have incorporated the whole Zoo idea better in the GBA version, and it could have explained all the bonuses a lot more clearly. But what's here is good fun that you've never played before.", "date": "Jun 7, 2002"}