{"name": "Big Metal Box", "name_review": "Oni", "ref": "https://www.ign.com/articles/2002/06/10/oni", "text": "It seems like we've been waiting forever for Oni to finally be released. I can remember the first time I saw some gameplay footage and I nearly dropped my jaw. The anticipation immediately began to build for me, and the fact that Bungie was making the game raised my hopes for the title even higher.    So the big question is: Does the game live up to my expectations?   Yeah, it pretty much does.   Oni is by no means a revolutionary or ground breaking title, borrowing heavily from console games like Final Fight or Sega's Die Hard, but it is a very good title and screams of high production quality from the opening sequence to the finale.   You probably are already very familiar with Oni's anime inspired looks and story, but in case you've been living under a rock, here's a quick recap. You play Konoko, an elite agent of the Tech Crimes Task Force. You're a karate chopping, head kicking, gun toting bad ass hot on the trail of an evil villain. The characters, futuristic city scapes and immense interiors all look straight out of Akira.   Game play is a combination of shoot 'em up action and hand to hand combat. As you progress through the game, Konoko will learn new fighting moves and gain access to more advanced and destructive weaponry. Hand to hand combat consists of punches, kicks, throws and combos. Punching and kicking your way through baddies is fine, but the combos that Konoko learns are the truly devastating maneuvers and the keys to doing the most damage while taking the least punishment.    Konoko's weaponry is whatever she can pick up off of her fallen opponents. Her guns range from machine pistols to energy blasters to multiple warhead rocket launchers. Unlike Quake and virtually every other first person shooter out there, Konoko can only carry one weapon at a time, so choosing the gun she's going to tote is as much a part of the strategy of the game as is deciding to shoot or punch.   The often quoted hallmark of a good game is ~easy to learn, difficult to master~ and that is pretty true of Oni's game play. The combat system is very straight forward, even rudimentary. One button to kick. One button to punch. One action button. That's about it. But the combination of kick and punch is extremely versatile and can be affected by the direction you're moving or your proximity to your opponent. The result is a fluid, easy to learn, difficult to master game. Movement uses the familiar FPS A W S D set with the mouse used to turn left or right and to look up and down.   The game's story is broken up into a seamless continuity of missions. The missions are broken up largely by location, with sub locations dividing the missions into acts or scenes. The level design itself is pretty creative. You'll play in a range of environments from an airport tarmac to a room filled with bubbling acid. Depending on the way the level is designed and the number of opponents, you can choose to play with a stealth approach or a full frontal assault. In many cases, stealth is the better part of valor and sneaking around with Konoko can actually be quite a bit of fun, especially if you sneak up behind an opponent and snap his spine.   As I've already mentioned, Oni's visuals are very heavily influenced by Japanese anime. Konoko's character, for example, looks lifted out of your favorite Bubblegum Crisis video. The palettes and textures tend to be on the minimal side, but they're authentic to the aesthetic so it works.   I have to say that Oni looks great on just about any video card. I played it in 32bit color on an ATI Pro and 16 bit color on a Voodoo 5 in both cases the game looked great. On the ATI card, colors were fuller, but there was a bit more clipping and definite aliasing. On the Voodoo 5, the clipping was less noticeable, as was the aliasing. One of the biggest complaints people have about third person perspective games like Oni or Tomb Raider is the blocked view effect. While the effect is definitely a part of the game, the mouse look control does a pretty good job of minimizing the impact. Walls and obstacles go partially transparent when you're close to them as well. I don't think an third person game will ever overcome this problem, but Oni has dealt with it better than most.   Like everything about this game, the sound design is top notch. True to the feel of the game, the music, speech and sound effects are all anime inspired. There are no preferences, however, to set the volume for music or sound effects separately from the voice volume. At many points in the game, I found myself having to turn up or down the volume because I couldn't understand what Konoko was saying or because the sound effects were over powering.   Considering how long Oni has been in development and the problems that Bungie has had with the development staff on this project, I more than half expected Oni to suck. In fact, the game is really quite good, but it isn't perfect. Continuing a Bungie tradition that I deplore, you can't just save when you want to (remember Marathon and the save terminals?) The game auto-saves for you when you reach certain points within the game, so if you keep getting tooled on halfway through an autosave section, you always have to keep going back to the beginning of that section. Fortunately, most missions are divided up into four or five save points, but that isn't much consolation when it takes you three hours to get past one part of the game. Multiplayer is also conspicuously absent. One of my favorite things about Bungie games has always been the great multiplayer aspects. Needless to say, it is disappointing.   All in all, if you're looking for 100% pure action, Oni delivers. The game is non-stop fun from start to finish. If not for the lack of multiplayer it would make my top ten list, but that combined with the save issue earns Oni a very rock solid 8. In stock market speak, IGN Mac analysts consider Oni a strong ~buy.~", "date": "Jun 10, 2002"}