{"name": "Majesty: The Fantasy Kingdom", "name_review": "Majesty", "ref": "https://www.ign.com/articles/2002/06/10/majesty", "text": "It is true there aren't as many games on the Mac as there are on the PC. That said, almost every game released for the Mac is an A title because those are the ones most likely to sell. Fortunately or unfortunately, depending on what kinds of games you like, those A list games have mostly been first person shooters or real time strategy games. The Mac has seen a bit more diversity lately, and one of the games adding depth the Digital Lifestyle is MacPlay's new title Majesty.   Majesty can loosely be included in the real time strategy genre, but it is both much more and much less than that. The two games that most closely resemble Majesty are Settlers II and Lords of th Realm.   Here's the basics. The game is divided into about 20 quests. In each quest you must achieve one or more goals. These goals are achieved by building a kingdom. To protect and serve your kingdom you must recruit heroes.   A typical quest might be to expunge all the evil from the land. Translate that to read kill all the baddies. You might start this quest by building a Marketplace that offers goods for sale and a tax base you can use to increase the gold in your coffers. Every building, upgrade and hero costs money, so it is important to keep an eye toward building wealth. There are roving bands of monsters flitting about in this quest, so you'll want to build a Guild to recruit some heroes to defend you. The game offers a big list of types of heroes to recruit. Rangers are explorers and will travel the map, uncovering hidden areas. They're armed with a bow and are good at a distance. Thieves are also good at ferreting out hidden gold that can be added to your coffers. They will also be the first to go after bounties, which are rewards you place on locations or even the heads of enemies. Warriors are the sturdiest of the bunch, and are the basic knight in shining armor type. Wizards are the most powerful, but are about as hardy as hamsters and are usually the first ones killed until they really get up in level. There are more types of heroes to recruit, but these are the basic building blocks of your army. Each type of hero has a specific guild that allows you to recruit a set number of heroes. Say you build a Wizards' Guild. Each one can support up to four wizards. If you want more, you have to build a second guild at a much higher price.   Once you have a few heroes to do your dirty work, you'll start to improve your kingdom, either to offer better armaments to your heroes or to increase your tax base. You can build an armory to provide better swords and armor, a library to research spells for your heroes and wizards, remote Inns for your heroes to recover in, or guard houses to protect your realm.   A second set of heroes is also available to recruit, but they tend to cost more. After you've upgraded your kingdom sufficiently, you can build temples to different gods. Each temple has a different type of hero, and a set of spells, associated with it. The Temple of Krolm offers barbarians that are serious ass kickers. The Rage of Krolm spell that the temple can cast makes all of your heroes move faster and kick more ass as well. There are nature, death and sun temples as well, each one with it's own unique benefits. Other races are also available in the game. Elves, Gnomes and Dwarves can all be recruited, but once you pick one race, no other race will join you. Like the heroes, each race offers different benefits. Elves are mean mothers with a bow, but they also bring gambling to your kingdom, which you can't tax. Dwarves are sturdy fellows, but they're pricy. Gnomes are cheap and help build your kingdom quickly, but, well, they're kind of trashy and breed like rabbits.   The real time strategy aspect of the game is essentially building your kingdom and ~harvesting~ gold by collecting taxes. You can't directly control your heroes, however, and that is where the Settlers style game play comes in. You can place a bounty on the head of an invading spider, but you can't direct a wizard to go smite the spider. It turns out you're a hands off ruler.   Majesty isn't terribly difficult, but it is terribly addicting. There is always more gold to squeeze out of your population or a new temple to build or upgrade. Each level of the game is very well designed and there is a lot of variety in the goals you must achieve. The enemies you face are also very entertaining. You can expect everything from herds of spiders to giant rock golums to green trolls to wander through your well maintained grounds. Dragons are particularly nasty creatures, as are many of the undead you'll face.   The challenge of the game is creating the right set of spells, heroes and defenses to win each level, and it is almost always different. One particular level that everyone in the office had to re-try involved the Elves kidnapping the royal brat, er, son. You get 30 game days to come up with a lot of gold or to destroy all the Elves in the realm. At first glance, not so difficult, but those elves are mean! They chewed through my warriors and my rangers without breaking a sweat. Although I did eventually find the right mix of firepower and defense, I used the full 30 days to do it. I tried the level again, this time setting out to build up cash, and managed to pay off the ransom in only 20 days. The great thing about this game is there tends to be lots of ways to achieve the set goals.   To add to the replayability of this game, each time you start a quest, it mixes up the map a bit, placing your starting point and the locations of your enemies (or potential allies) in a different place. The goals remain the same, but each play through is just a little bit different.   Majesty is also very entertaining as a multiplayer game. You can play co-operatively or competitively, depending on your personal inclination. All of the games in the office start off friendly, but end up being a last kingdom standing scenario. You can set up a multiplayer game with a variety of win scenarios ranging from amass the most gold in a set amount of time to destroy all monsters to annihilate the other kingdoms.   The art work and sound design for Majesty is top notch. Excellent voice talent is used to introduce each quest and the spell and game sound effects are dead on. Visually, the game has a lot of variety. Everything has a very medieval flair, but the buildings all reflect the type of hero or work that results from it. Spells look spectacular as well. A lightning storm spell is my favorite and it is very satisfying to see a dozen invaders take 120 volts in the kazoo. The one sort of black mark on Majesty is that as your kingdom grows in size and has lots of heroes running about, the game gets really slow. The minimum requirement is a G3/233. I played on a G4/400 and still experienced slow down, so keep that in mind.   I played through the game in a single weekend, not because it was short, but because it was so much fun I didn't want to stop. Majesty is definitely a break from the same old same old that we often get on the Mac and it makes for a great diversion. If you enjoy strategy games at all, Majesty is a winner.", "date": "Jun 10, 2002"}