{"name": "Pac-Man All-Stars", "name_review": "Pac-Man All Stars", "ref": "https://www.ign.com/articles/2002/06/11/pac-man-all-stars", "text": "The game started a phenomenon.  Kids would line up to play the vibrant and colorful orgasm of pixels that Pac-Man had to offer just to collect little yellow pellets. This simple task of collecting pellets almost makes gathering monsters in Pokemon look mature and complex; however, nobody could put the game down.  It became a household name, which was rare in those days, and has since time and again been given a face-lift and a few new buddies.   This installment in the franchise features Pac-Man, the darling Ms. Pac-Man, the little rascal Pac-Man Junior, and Professor ~To Cool for School~ Pac. In All-Stars, the group of heroes must chomp against each other in a race to complete the level's objective, being to gather the most amount of points.  While the Pac-Man series has seen many transitions during the change from 2D to 3D, the people at Infogrames have decided to bring back some of the similar characteristics from the original.  The game takes place in the ghost's home world, where an evil wizard rules over all.  Wandy the Wizard has kidnapped all of the fairies from Pac-Man's world and only Pac-Man and his group of friends can stop the evil sorcerer.  Even though Pac-Man and his comrades are all trying to save their little friends, they are, for some reason, fighting against each other.  Don't ask me why.  The companions must travel through such creatively named stages as The Creepy Forrest, The Mines, Snowy Mountain, Wandy's Garden, The Laboratory, and Wandy's Castle to conclude their adventure.  All levels are pretty much self-explanatory and similar to what we would expect from a game with platform characteristics and adolescent themes.  All-Stars has a very simple plot and storyline, but nothing about it will make anyone complain or become engulfed with rage.  Let's get something straight; Pac-Man All-Stars is not meant to be visually impressive, but nothing about the game's visuals will cause you to whine excessively either. If you were expecting the game to have similar visual effects as Everquest 2, then you are looking in the wrong place. The maps and characters are bright and colorful, as one would expect from the Pac-Man series, and the models are pretty smooth, but nothing in the game has such a fine amount of detail that it would cause a GeForce II to trip over itself in order to pump out high frame rates.  The game, as the original, features bright colors with a dark background.  Pretty much all of the maps have a dark tone to them, but the cute characters and objects override the evil presence.  Just like the game, the graphics have nothing innovative about them.  While the graphics are merely average, the sound makes you want to slam your speakers on the floor and splash them with holy water to get rid of any demonic creatures that may be occupying them. That would be the only logical reasoning for such painful noises. While playing Wandy's Garden, I determined that it is far more pleasing to hear the obnoxious squeal that a cat in heat makes rather than listening to one more minute of this game.  The most annoying of them all has to be the sickly owl.  It sounded more like an owl choking on its own vomit than a computer's lousy attempt at simulating a hooting sound.    The music has a retro vibe that I am sure the developers wanted the consumers to appreciate.  They probably wanted to be seen as old school.  They need to forget about old school and simply go back to school.  Taking sound bits from games produced 20 years ago is not very appealing.  I fear many nights of sweaty and horrifying nightmares after listening to these haunting noises.  All-Stars and the original do feature quite a few similar characteristics.  One of the familiar aspects found in All-Stars is the ability to teleport across the map by walking through one side of the screen. Pac-Man can walk through a door or cave and instantly appear on the other side of the map -- a simple, yet handy feature to fight off the more intelligent ghosts.  Another comparable feature is that the main objective is still collecting those ever so scrumptious yellow pellets.  While racking up points is the basis of the game, the basic consumption of points is by fighting for the most pellets, with collecting fruit being the secondary mean of consumption. Finally, those idiotic ghosts, who chase Pac-Man around as if they were playing a game of tag with a group of blind kids, are your main adversaries, as they have been in all of the other installments.  All in all, the game feels more like the original than most of the previous 3D installments.  Pac-Man All-Star's level of difficulty is determined on how you think the game is beaten: by passing the game, or by scoring the most points on the leader board.  The first time I played the game through on the easiest setting, I only lost one life.  I only placed out of first three times and most of those embarrassments occurred in final levels of the game when my eye lids were starting to drop faster than this game will from the sales chart.  However, when I tried the medium setting, the friendly AI picked up the pace a little bit more and I was beaten much more often.  The game grants you with three lives to start and then it costs 5000 points in order to buy a continue.  Even though you obtain tons of points throughout the game by collecting pellets and fruit, the 5000 points does hurt your attempts of reaching the top of the best score charts.  There are special items, ala Bomberman, that Pac and his friends can pick up to boost their fighting power.  Some of the traditional power-ups include Speed Up, Stun, Magnetic Pac, and Power Pellets, which make your character immune to the ghost's attacks.  The other items include Thief, which steals 10 pellets from each friendly AI you touch; Multiplier, which gives your character four times the points for all pellets collected during the time the item is activated; and Strong Pac, which allows you to collide with the other characters resulting in them losing points and becoming momentarily stunned.  The power-ups definitely add a much-needed element to this very simple game.      It's now time to reintroduce you to some old villains.  Inky and Clyde, the blue and orange colored ghosts, are the stupidest of the four ghosts.  Inky stands around and occasionally sprints in the direction of one of the characters, but it is far too easy to avoid his pathetic attacks.  Clyde is even worse.  He wanders around aimlessly with no sense of direction.  He is randomly sent in one direction or another and, therefore, has very little challenge.  Most of the time, Clyde is on the other side of the map, spinning in circles while the other characters are fighting for prime positioning for when the next set of pellets appear.  Blinky and Pinky are much harder to shake off than the other two goofballs.  The red ghost, known as Blinky, seems to be magnetically drawn to your character.  He closes in on you, following your exact direction and position.  He is by far the most difficult ghost of the four.  Pinky emulates your character.  In other words, if you turn Pac-Man in the upward direction, Pinky will do the same and continue moving in that direction until you change your direction.  Sadly, these ghosts are not difficult to shake off your tail.  Despite how easy these ghosts are to dodge, the lowliest of them all happened to hit me.  I almost threw down my controller in overwhelming rage when Clyde hit me.  The only thing that prevented me from going ballistic on my computer was the sad fact that when a ghost touches you, you merely lose a few points and you are stunned for a few moments.  That is it.  Nothing else.  The only challenge from the original game has been removed.  Beating the other AI players isn't extremely difficult, so the challenge that made the original Pac-Man so entertaining is lost.  It's like beating your three-year-old brother in a game of chess.  He doesn't understand the rules of the game, so he stands no chance.  Similarly, the friendly AI does not understand the objectives of the game.  Your companions will head in the direction of the pellets and they will grab a few, but they eventually become sidetracked by either another opportunity to gather pellets or by the fact that a ghost decides to turn in their direction from half way across the screen.  In other words, if you are just trying to simply pass the game without trying to get a high score, the game will put you to sleep faster than a bottle of scotch at a family reunion.  If you are trying to reach the highest score, I foresee many sleepless nights trying to dodge ghosts and avoid buying continues.  What did you think of Pac-Man All Stars  The final mission of each campaign has to be the closest the game gets to being like the original.  The way it works is that after all of the levels in the campaign are complete a new level is activated.  The game preps you for the new level and then the map is covered in every possible angle with pellets.  Then, to everyone's amazement, you are asked to single-handedly eat them all with the four stooges chasing you down.  Once again, if a ghost hits you, you lose a few points and are merely stunned.  In fact, you can take advantage of being hit by a ghost because the simple-minded baboons are stunned for a longer duration of time than you are.  In other words, you can give up that short amount of time and loss of points in exchange for the pellets the ghosts are hovering over since the game permits you to walk on the ghosts while they are stunned.  There is no challenge whatsoever during this part of the game.  The only thing stopping you from completing this mission is a time limit that offers too much of a cushion.Pac-Man All-Stars is nothing more than an ok port of the original from 2D to 3D with a few twists and turns along the way.  While the AI is somewhat disastrous, the sound is horrid, and the game is incredibly short, those looking to win the highest score will have to spend plenty of time on this game.  The game does feature respectable graphics and provides a simple, retro feel that will satisfy any adult who craves a blast from the past.  With a small price tag and a multiplayer that allows up to four players chomping against each other, this game will appeal to the masses for a quick fix of fun.  I mean, come on, it is Pac-man.Pac-Man was an addictive game that was the main highlight of every trip my friends and I made to the local pizzeria.  Popping in quarters, drinking cold root beer, and eating some fantastic pizza.  Oh, how the times have changed.  Arcades are scarcer now that console and PC gaming machines have taken over the realms of the video game world and they don't make a pie like they used to, either. All of this from someone who is only 20 years old and still lives at home.  But, I can tell you that this game has the feel of the original.  It isn't quite as addictive as the original, but that is because I kicked my habit a long time ago (and replaced it with gore and fantasy). If Infogrames were to take out the silly storyline and simply make it a level based, how-far-can-you-go type game, this could have been quite similar to many classic arcade games. I could have seen children running over to the machine and wasting away mom and dad's hard earned cash. Those days are over and the days of in-depth, action oriented, and visually impressive games have arrived. I, for one, am not complaining.", "date": "Jun 11, 2002"}