{"name": "Test Drive", "name_review": "Test Drive", "ref": "https://www.ign.com/articles/2002/06/11/test-drive", "text": "For a company that has pledged the most support for the Xbox, Infogrames has been awfully quiet lately. But the arrival of Test Drive for the Xbox should begin a run of games from the company culminating with the release of the powerful Unreal Championship later this year. Pitbull Syndicate got the call to develop this version, but the team has experience with previous editions of the Test Drive franchise. The series from PC and previous generation consoles was best known as more of a simulation driving experience. But TD for the Xbox plays and has many trappings of an arcade style racing game. Not quite as over the top as, say, San Francisco Rush, but you won't go confusing this game with Gran Turismo 3 either.  Microsoft's own Project Gotham Racing actually has a similar kind of arcade/sim balancing to Test Drive. Both games have the look and visual style of a simulation with accurately reproduced real-world vehicles, extremely detailed city environments and they even share three out of the same four racing locales: London, San Francisco and Tokyo. Where PGR offered us New York City, Test Drive gives us Monte Carlo.   With quick, single and multiplayer race modes along with Underground, Test Drive's answer to a career mode, Xbox gamers are getting plenty of ways to get their race on. Side modes that you'll automatically encounter in Underground include Cop Chase and Drag Race.  Gameplay  Since the quick, single and multiplayer race modes are easily understood and appreciated, it's the game's Underground feature that sets Test Drive apart. You play as Dennis Black, a talented racer trying to make his name in the underground (get it?) world of illegal street racing. Along the way you meet, compete against and hopefully win vehicles from an assorted cast of characters. There's the dim-witted stoner dude, Reese and the sexually suggestive Lisa Lux and all kinds of other strong personality types who drive vehicles with equally strong personalities.   It's the personality of these characters and the way this career mode is presented that makes Underground appealing. You start off in San Francisco racing under the flag of your generous sponsor Mr. Clark. He gives you cars (roughly 40 in the game), money, words of advice and discouragement as you battle your way through San Francisco to Tokyo and beyond. The game starts of extremely slow so you can just hop into Underground and learn the physics of the game early on without getting smoked. But eventually you'll have to beat your opponents in drag races, circuit races and linear races. The kicker is that on several of these tracks (which are basically different segments of the city) you'll find local law enforcement lying in wait. They'll track your speed with radar and attempt to run you off the road. So in any given race you'll have to worry about the five other competitors, regular traffic and the fuzz trying to chase you down. This is Test Drive's strongest point. It's been awhile since a racing game has given us this much to worry about.  You gain access to enemy vehicles by beating them in pre-determined pink slip races. But the best part is that you'll unlock a whopping four new cars once you beat all the tracks in one city. That's a heck of a payoff.  The physics of this title are extremely floaty. As in, vehicles, all of them not just yours, catch air and slide easily all over the street at the slightest touch of the control stick. This leads to a lot of crashes and out of control driving which is only compounded when the cops, opponents and traffic get involved. The AI generally keeps the races tight so that even if you come to a dead stop in a crash you'll be able to catch up to the pack.  So the end result is you'll see crashes happen in front of and behind you independent of anything you do while driving. If you're good enough to cause crashes and spinouts for the other cars then you'll be successful. But any game that openly encourages reckless and daring driving (GT3's enemy-fender technique notwithstanding) is decidedly on the arcade side of the sim-arcade continuum, but consistency is the problem that I had with TD.   The game seems to showcase crashes as a means of livening up the gameplay, yet the floatiness of the vehicles makes the crashes look almost like cartoons. You can drive a '66 Cobra head on into a delivery van or semi and cause the victim to double backflip backwards up into the air.  Shelby made the Cobra one hell of a high performance car, but I don't think it was ever built strong enough to flip other cars like quarters, even at full speed. And no damage on the cars (either the crasher or the ~crashee~) only makes the crashes seem more silly.   It's the detail in the vehicles and cities of Test Drive that'll make you think this game is a sim. So it seemed a bit inconsistent that this part of the game that's supposed to look ~real~ suddenly wrecks the suspension of disbelief by having taxis and giant sedans catapulting into the air while the car that caused it barely veers of course.  Also while all of that positioning, crashing and driving on the edge is happening, the AI opponents will throw insults and comments your way over your in-dash ~Vidi Mail~ communicator whenever one of you is passed by the other. Lots of character specific little comments like ~I guess you hear this often, but you're not good~ or ~Hey, you're not supposed to do that~ add strong doses of personality to Test Drive.    You race against the same group of enemies in each stage so you get very familiar with them and their racing tendencies after a dozen or so different races in any city. You'll recognize them by vehicle and notice that some will have no problem bashing into you whenever they come around or other will avoid contact all together. Similarly, certain enemy cars perform differently on different courses. You're supposed to pay attention to who's winning and losing on which tracks and why so that when you reach the giant level-ending race you'll know who's having trouble on the curvy or hilly parts and when to make your move.   Cop Chase puts you in the role of the police chasing down the field of six competitors. All you have to do is bash into them and wear 'em down until they can't drive anymorejust like the cops are trying to do to you when you're racing. The Drag Racing doesn't really require any steering because it's on a straightaway but it forces you car to manual transmission so you have to shift gears at the right moment to give you the maximum performance. These two minigames are engaging on their own but their integration in the main Underground works very well.   The replay mode is good because it captures entire races regardless of length.  Graphics Test Drive on the Xbox should look a lot better than it does. It isnt an ugly game, but the reflections, lighting and vehicle models are all below what we expect from the Xbox. The flickering and jaggies are indicative of the concurrent development cycles for both the PS2 and Xbox versions of the game.   The real-time reflections are not in real time but you are getting a version of the surrounding environment mapped onto the vehicles skin. Crossing the Golden Gate Bridge, you won't see anything but blue sky on your car's trunk until you pass under one of the support towers. But neither the GG Bridge nor any other reflection will be animated very smoothly. Test Drive runs at 60 frames per second but the reflections on vehicles are well below 30fps.  Test Drive is crisp but not rich. All of it's beauty is on the surface so that you get nice draw distance, clean lines on the vehicles and decent textures on the buildings but upon closer inspection, there just isn't much else there. Test Drive has such basic gameplay elements that we would expect an outstanding level of visual details throughout the game. The lighting is far below what we've seen in other driving games like Wreckless and Rallisport Challenge. That blue sky above the Golden Gate will be one color of sky blue, just like the night sky is always one color. Your car will have headlight beams in front of it but none of the other cars will.   Animation is decent. You get to see your character driving and leaning in the cockpit with each turn and he'll even bounce around a bit when you're jumping. Some particle effects like swirling leaves and trash in the street are nice, but if Pitbull can do that why not some sparks or something when there are crashes?  Sound  The sound like the visuals in Test Drive is very mediocre. There's some separation but no center channel and no low frequency applications mean there's no 5.1 surround sound. The sound effects and voice acting aren't bad at all. In fact, the voice-acting is one of the stronger technical points of the game.   I don't know if there's such a thing as stoner-surfer dude race car driver, but Reese is Jeff Spicoli on wheels, for sure. Your benefactor Mr. Clark comes off as mysterious and aloof as he's supposed to. In fact the weakest voice-acting comes from Dennis Black, the character you're controlling. Go figure.  The sound effects like burning rubber and engine sounds are all adequate but it's hard to tell the difference between the different cars. The crashes, like the head-on smashups that happen all the time, don't sound nearly as devastating as they should. If you're going to have a hooptie spinning up into the air, at least give us the sounds that go along with it. Any car with enough power to make that happen, like a '66 Cobra, should make a hell of a lot of noise when it smashes into it like a cue ball.  Test Drive comes off like an extremely mediocre arcade game that, yet again, suffers from a bit of an identity crisis. I'm not sure if the physics were arcadey and the gameplay was too much like a driving sim or if it's the other way around, but the two don't synch up the way they should. With so many other racing options already available on the Xbox and more on the way before the end of 2002, it's hard to find a place where Test Drive truly belongs. Test Drive's career mode is the strongest element and worth a look, but Burnout does pure arcade action better, Rallisport Challenge simulates driving better and Project Gotham Racing straddles the fence better than Test Drive does. I'd recommend it as a poor man's version of PGR, but that penniless bastard has to cough up the same $50 to play it so it's not really an option.", "date": "Jun 11, 2002"}