{"name": "MX Superfly", "name_review": "MX Superfly", "ref": "https://www.ign.com/articles/2002/06/13/mx-superfly-3", "text": "During the last several years there have been a dozen or more notable dirt bike racing games for various consoles. Some, like Excitebike 64, have gone onto greatness while others, unbalanced and unpolished, have suffered more unfavorable fates. GameCube has already been blemished with one of the bad seeds -- Jeremy McGrath Supercross World, (rated 3.8 out of 10), a clumsy mishmash of poor controls, lackluster options and sub-par visuals.   Thankfully, though, a great racer has finally arrived in its place. THQ's MX Superfly, packed full of tracks, riders, and trick opportunities, feels finely tuned, looks refined, and impresses with its tight, if floaty mechanics and plentiful modes of play. It's not a perfect racer, but it's a damn good one -- the best we've played on any next-generation console to date.   Features  Expanded freestyle mode with more of what's made the MX franchise dominate Mini-games, tons of arenas and wide-open worlds with secret areas to explore The only game featuring Ricky Carmichael, seven-time AMA National Champion. Play as RC or one of 26 other pros in the all-new roster of real riders from the 125cc, 250cc, and freestyle ranks The new Stunt Track Editor allows you to build your own ramps, jumps and obstacles to test the limits of your bike Racing and freestyle career modes! The only motocross game where you can Create-A-Rider choosing from the big name sponsors, all six major bike manufacturers and authentic gear. The better you are the more stuff you can buy The pros get crazier with each competition and so does MX.  Pull the new Tsunami , Rock Solid, and every signature move in the sport 22 motocross, supercross, amateur and freestyle tracks exclusively featuring Loretta Lynns, the Outdoor Nationals, the Free Ride Moto-X Championships and the THQ US Open Tight, responsive controls to pull huge wheelies, stoppies, tail whips and more  everything but the arm-pump Five different multi-player modes both in racing and freestyle, plus mini-games   Gameplay MX Superfly is developed by Pacific Coast Power & Light, which is the same team that created Road Rash 64 for Nintendo's now defunct console. It's clear that the software house has grown considerably since that time. Superfly, running on RenderWare, is packed full of features and options including 14 pro riders, 22 tracks set across indoor and outdoor environments (with some exclusive locales like Loretta Lynnis), and more. Also, in its attempt to bring gamers the most well-rounded dirt-biker racer on the market, the developer has not only enhanced the regular exhibition courses, but expanded the freestyle mode as well so that players can compete for big air and tricks on a wide variety of tracks designed specifically for those goals. Additionally, there are mini-games -- 11 in all (up from last year's two), in which riders must do everything from play a virtual game of dirt bike Horse to deliver pizzas, nail targets, slam jumps and the like. The sheer selection of tracks and play types is nothing short of amazing and, indeed, unparalleled by any other dirt bike racer available.  Luckily, PCP&L has realized that a great racer is not engineered by sheer options alone and has also created compelling gameplay mechanics. Players control bikes with the analog stick, accelerate with A, and brake with B -- these are the basics. But of course there are other executables that help to increase the strategic element of each race. For example, tapping the B button when going into a sharp turn will result in a mini-powerslide of sorts; doing it correctly not only helps take corners without losing speed, but also feels excellent -- very satisfying. For even sharper turns, though, players can use the Z-trigger button for a full-blown powerslide; this is perhaps the first time the Z-trigger has been used in any GameCube title for such a major function and it works flawlessly. It's surprisingly comfortable even. There are other subtle and not so subtle control additions. Holding and releasing the R button before going off a jump, for instance, boosts the power of the jump for some seriously awesome air time. N64 owners familiar with the eye-popping jumps in Excitebike 64 can expect ones just as big in Superfly, and sometimes noticeably bigger. Pulling back or forward on the analog stick while in the air will make riders flip backward or forward with analog sensitivity, which is very well done. Similarly, pressing left or right in mid-flight will enable riders to spin their bikes; pulling off a 360-degree turn this way simply rocks.   On top of everything else, there is a wide -- really wide -- selection of moves that can be performed, from fakies to supermans to tsunamis, with the R and face buttons while soaring. This system is incredibly unintuitive at first as players will want to be done with the R button after they've used it to boost a jump, but with some practice it eventually becomes easier. Never quite easy, but easier. To its credit, at least, the trick system is addicting and worth the time and effort.  The backbone of Superfly is its physics engine, which is a mixture of realistic and arcade. What this ultimately translates to is a play style that is highly floaty -- bikes soar high up into the air and hang there with potential for massive tricks and stunts, but it sometimes comes at the sacrifice of pure adrenaline speed.  The floaty gravity of the title, even more so than Excitebike 64, may turn off some players interested in pure speed and nothing else. At the end of the day the racing experience is still fairly fast, it's just not the emphasis. Air junkies, meanwhile, are sure to be thrilled at the prospect of catching some of the truly gargantuan, chasm-clearing jumps featured at every corner in the game. Personally, we love it, and just as intriguing are the tracks themselves, which are designed to branch in multiple paths. In Freestyle Mode, crafty riders will even discover hidden areas to levels, including an Area 51 spoof complete with aliens and spaceship shadowed in the desert.  Size? No problem -- look at this level, for example.  The meat and potatoes of the title is its Career Mode, in which players create a rider from scratch, start him or her on an amateur tour and then go pro, earning cash, unlocking new courses and circuits, and generally advancing through the game. It isn't easy. Again, the comparison must be made to Excitebike 64 -- a difficult racer; sometimes frustratingly challenging, in fact. Even on the beginning circuit, players may at first have trouble scoring first place against rider AI (up to 12 other bad boys on screen), and pro tours will absolutely have them pulling at their hair. The true testament to the game's balance and design, though, is that even after losing gamers will want to try again and again until they get it. And if that's not one's cup of tea, they can play around in the Freestyle Career Mode, go for single Exhibition races, or have at some of the mini-games.      There are two other modes to discuss, both of which have a profound impact on replay value. The first is the multiplayer mode, of course. Here up to two players can play head-to-head (split-screen) in any of the other modes, from Exhibition races to Freestyle challenges and mini-games. The mode works well and is generally a lot of fun, particularly where the big jumps and mini-games are concerned. Because it runs a bit slower than the single-player experience, however, the sense of speed is diminished even more and as a result some of the Exhibition courses feel sluggish by comparison. Still, everything said and done, a welcomed addition that most gamers are sure to enjoy.  The other addition, perhaps more important to some, is the Track Editor, a fairly robust thing with enough options and abilities to keep players busy for a good while. The interface is a bit barren, but it's all packed in there, allowing gamers to fill an entire stadium (three different ones, including a space station, which is very impressive) with ramps, jumps and platforms, and obstacles like barrels and soccer balls. It's even possible to throw whole trucks in there so that players can jump them. Unfortunately, though, the track editor doesn't enable gamers to edit or modify actual terrain -- so the dirt is always flat and unchanged, which is disappointing. PCP&L has attempted to make up for this with two create-a-tracks that have a couple of curves thrown in for good measure, but it's not the same. Even without the option, though, the editor feature is pretty solid, and perhaps we can look forward to terrain modifications in next year's version.  Graphics and Technology In the past we've seen games that run on RenderWare which don't bother to take advantage of the middleware's full potential. Thankfully MX Superfly isn't one of those. The title's fairly easy on the eyes, in fact. The engine itself is clean and able to draw massive environments with no loss in detail, noticeable pop-up or draw-in, but more it can also spit 12 or more riders on-screen at once with no drop in framerate fluidity. True, the game runs at 30 frames, not 60, but we'd take a solid 30 over a 60 / 30 split any day of the week and twice on Sundays.  Riders themselves are fairly high polygon in nature, (though they occasionally have a squished look about them), and sport crisp texture work to boot. Some of the driver animations are top, silky smooth, realistic tricks, bike kick-outs, and flips and spins while others appear out of form for one intangible reason or another. A true-to-life physics model sends bike flying and crashing in every direction as if real.   Polishing up the visual experience are a wide variety of locales, from dusty deserts to dirty indoor environments, rocky terrain, mountain areas, city spots, and more, all rounded out nicely with detailed architecture and high-resolution textures. Riders boast full shadows that change with the level, some portions of maps are fully bump-mapped, reflection-mapped, environmentally-mapped, etc. There is a light model that highlights bikes and riders as they jump and soar together throughout the locales, there is an advanced particle effects system in place for smoke, dirt and more, and it all comes together triumphantly.  There is the occasional clipping. The very, very occasional slowdown, which probably won't even be apparent to most, and the infrequent ugly texture. But overall Superfly is a surprisingly pretty racer with enough bells and whistles to satisfy the graphic tart in all of us.  Sound The audio portion of Superfly is a blend of passable and excellent. The sounds effects get the job done -- a selection of dirt-bike noises, thumps, skids, motors, crashes, screams, yells and the like, the standard, basically. These mingle with some poor commentary contributions in which the announcer mainly delightfully shouts ~Yeah!~ and ~Woo-hoo!~ over and over. But the music tracks more than make up for this. With excellent contributions from Hoobstank, Hotwire, Funky Homosapien, Souls of Mischief, Spineshank, The Dickies, The Vandals and more, the soundtrack really, honestly rocks. Players may want to go and buy some of these tunes after they've heard them. Everything runs in Dolby Surround Sounds too, which is a plus.  Some of the tracks in the game are downright beautiful. MX Superfly is a great dirt-bike racer. It's packed full of features and options, including 22 tracks of varying locales (both indoor and out) and 14 pro riders for starters. If you're one of those types who lives for big air videogames, then this game is virtual gold for you. You can soar in Superfly -- really soar. Huge air potential, massive tricks and stunts -- you can clear chasms while performing one-handed 360-degree spins if you like, and it's just as entertaining and satisfying as it sounds.I find myself going back to the Freestyle mode more and more just to try out tricks on the giant levels and see if I can discover new areas -- many of the courses hold compelling secrets, which is fantastic. But the racing option, admittedly not quite as speedy as some other dirt-bike games on the market, is very satisfying (and hard) nonetheless and also comes highly recommended. Some players may find the tracks and physics system too focused on hang times and less on speed, however, which is something to consider.On top of everything else, the title's got a great selection of mini-games, a fun multiplayer mode and a solid create-a-track feature (void of some terrain modification options), not to mention pretty graphics and a top selection of music tracks to take in. If there's to be any graphic complaints, it's that the game runs at 30 frames and not 60 (minor), there are sometimes odd rider animations, there is the occasional clipping and the very, very infrequent slow-down, but overall I'm happy with the look and motion of the title. A great buy for racing fans. Be sure to get the GCN version of the game and not the PS2 one -- it runs and looks noticeably better. Can't wait to see what PCP&L can do with next year's version.", "date": "Jun 13, 2002"}