{"name": "Frogger Advance: The Great Quest", "name_review": "Frogger Advance: The Great Quest", "ref": "https://www.ign.com/articles/2002/06/14/frogger-advance-the-great-quest", "text": "Konami has made an unlikely videogame mascot out of a simple 1980s concept...the frog from the classic arcade game Frogger has gone anthropomorphic, bipedal, and now has his own platform adventure. Vicarious Visions, the team responsible for GBA Crash Bandicoot and Spider-Man was given the task to move the character from his simple, basic ~icon~ status to a versatile gaming hero on the handheld...the result is a GBA platformer that doesn't really innovate, but at least everything it does is as solid as can be. Features Four worlds 16 levels Password save Only for Game Boy Advance  Frogger has a problem. He overhears some kids talking about the ol' fairy tale about the frog that turns into a prince after a kiss from a princess. Now he's an amphibian with a mission...off to get a little smooch from royalty so he, too, can become a prince. Frogger Advance: The Great Quest is almost as generic a platformer as they come, and bares absolutely no resemblance to the classic game bearing the same name. Our hero, Frogger, can jump, swim, climb ladders, and thwack enemies with his tongue...kind of an organic, slobbery version of the Castlevania whip. The task is to simply get to the end of the level...which can be done pretty easily. But the game encourages players to collect coins, hidden gems, and extra lives throughout the areas. These coins come in three flavors: gold, red and silver...each of these coin types are worth exactly the same amount, the colors just help players find the proper path. Follow a path of red coins, for example, and you're bound to find an extra life or a health fly at the end. Follow the silver trail and you'll locate one of the many large gems. The gold tokens line the path to the end of the level, so follow it in order to move onto the next part of the game. If you succeed in scoring a good majority of the coins and gems without losing lives, you'll gain access to a bonus round where the challenge is to get to the end of the level before time runs out...beat the clock and you'll earn a couple of extra ticks on your health meter.  Frogger's a bit of a pushover at the beginning of the game, but after every world you'll earn an extra move that will become an absolute necessity in the future challenges. His first ability is a double-jump and float combo, giving him access to high ledges as well as letting the guy float across long chasms. Second ability is a ~freezing~ stone. Normally, you can toss these useless rocks at enemies and stun them for a couple of seconds...the upgrade will actually freeze them in place, letting you stand on them to gain access to other platforms. Then comes the Super Tongue attack which pretty much destroys any object blocking access to hidden locations...though it comes in handy in the level you earn it in, you can backtrack to previous levels and find those annoying boulders that couldn't be passed with the standard lick.  Honestly, there isn't much about Frogger Advance to complain about, other than it being extremely generic as a platformer. Its design is very solid with no real awkward quirks...controls are tight, the graphics are well rendered with loads of color and frames of animation, and the music is of the familiar high quality expected of the Shin'en sound team. It's obviously made for the younger crowd, as boss battles are stupidly simple, and the overall adventure is only a short two-three hour playthrough. But if it's for kids, why did Konami opt for the yucky password system to save the progress...especially since this password saves the health points and lives earned? We've all heard that ~cost cutting~ reason before...password save is icky, folks, especially in handheld gaming.After the lousy 3D platfomer created on the PlayStation, I was ready to hate this game as well. But what I got was a solid, generic platformer with nothing terrible about it...except for maybe how short and easy the game is. The game looks great with large, well-animated characters, a decent soundtrack, and familiar, fun gameplay. The password save is a bit of a drag, but since you can get through the game in a short couple of hours, you might not need it. Don't pick this game up if you're expecting the old-school traffic-avoiding game design...but do pick it up for kids who can't quite win at the more complex platformers.", "date": "Jun 14, 2002"}