{"name": "E.T. The Extra-Terrestrial", "name_review": "E.T. The Extra Terrestrial", "ref": "https://www.ign.com/articles/2002/06/14/et-the-extra-terrestrial-2", "text": "Movie tie-ins have always been sort of hit and miss. While you'll  occasionally see games that do their film justice (the portable Spiderman games come to mind), more often you'll see boring, repetitive games without a glimpse of the magic that made their source material so enjoyable. Most of these games will sell more copies off their box art than from what's actually inside the cart. Not too surprisingly, NewKidCo's E.T. The Extra-Terrestrial not only fails to break this trend of shoddy tie-ins, it defines it. Developed by Fluid Studios, who gave us 2000's Ultimate Fighting  Championship and Army Men Air Combat for the Game Boy Color, E.T. seems to combine the flaws of both these titles to create one of the most frustrating and difficult kids' games in years. Features Play as E.T. and Elliot Three levels of difficulty Password save Only for Game Boy Advance E.T. The Extra-Terrestrial for the Game Boy Advance follows the film  loosely and gives young gamers the chance to relive choice moments from the film, like scurrying through the forest as E.T., or flying against a moonlit night as Elliot. There are five different modes of play which include wandering around as E.T. or Elliot, riding Elliot's bike, flying the bike, constructing E.T.'s communication device and piloting E.T.'s space craft. Each mode has a very distinct look and feel to it, though the wandering levels are the dullest of the bunch and take up half the game.  The problem is that for all the time the developers put into creating  different, interesting ways to play the game, everything is repeated so much it quickly becomes boring. Flying Elliot's bike, running around yelling as E.T. and even building the device to phone home are all fun and inventive, until you realize that you're essentially doing the same task over and over without variation for fifteen minutes. And level designs are so huge and repetitive, you'll probably spend more time lost than not -- Learn to love dead ends, because this game never runs out of them.  The graphics are the best part of the game, with faithful renderings of E.T. and Elliot, and you'll encounter many nifty effects like sprite rotation, scaling and parallax scrolling. Background objects are detailed and colorful. But everything is very limited here, from the amount of actual animation to the variation in enemies you encounter. It's as if the developers were happy with the six or seven sprites they made, and decided to repeat them over and over throughout the game. So around Elliot's house, you'll still be running into the same frogs you saw in the forest. The game is also just too plain dark, and even with decent lighting, you probably won't be able to tell your enemies from the background until they're already attacking you.   The sound in the game is decent but, like everything else, is incredibly repetitive. The music strums happily along from level to level, and isn't particularly good or bad. However, voice acting and sound effects are very sub-par. They don't always fit the situation, and none of the actors sound remotely like their movie counterparts. The game also loses big on control. For whatever inconceivable reason, the developers decided to make the characters start out slow, then build up speed. What you get is a sloppier version of the ice levels in Super Mario Bros. 2, with Elliot and E.T. struggling to both begin moving and to stop. This carries over into all modes, and almost renders the game unplayable, especially in earlier levels like the forest, where you'll find yourself constantly sliding into enemies.   The game is ruthlessly difficult, and the Easy setting is tougher than most games' set on Hard. Forget what it says on the package, this is NOT a kids' game. All levels have you playing against a ridiculously short timer, or E.T.'s decreasing energy (gauged by an unintelligible mini-E.T. in the corner who spins and shrinks -- what's up with that, Fluid Studios? Just give us a bar). You're never given the opportunity to explore the game, without being rushed to finish each level.   The game is also incredibly unfair. For example, when you touch an enemy, they flash with invincibility instead of E.T. or Elliot, which means that while one agent is 'capturing' E.T. (which oddly looks more like they're dancing), two more can come along and hurt him at the same time. And the bland introduction screens preceding each level are too vague, and are phrased to confuse kids (Level 1 instructs you to find 'samples' as the 'alien botanist' E.T., rather than stating 'find the flowers'). The passwords are short (a rarity in today's GBA games) but may still confuse, since their symbol for the up button ^ looks nearly identical to the A Button.    The key word here is: muddled. E.T. The Extra-Terrestrial was made by a development team who obviously has a lot of talent, but there's rarely a moment you're won't be unsure what to do next, or annoyed that it's so impossible to do. It's a shame, because several modes in the game look like they could've been quite fun. If more effort went into level design, menus, enemies and goals, the game would've been much more enjoyable. As it stands now, the game is far too difficult and unforgiving, and feels like another titled rushed to meet its deadline.", "date": "Jun 14, 2002"}