{"name": "Mega Man Battle Network 2", "name_review": "Mega Man Battle Network 2", "ref": "https://www.ign.com/articles/2002/06/17/mega-man-battle-network-2", "text": "I guess I shouldn't be surprised that Mega Man Battle Network 2 is virtually (har-har) identical to the original game Capcom released last year as a near-launch title for the Game Boy Advance. After all, back in the NES days, incremental Mega Man sequels weren't much of a step up from the previous one, simply building upon the established formula and adding cool new levels, weapons and enemies to the mix. Which is exactly what Capcom did with the sequel to its excellent Mega Man RPG spin-off for the GBA. Not that it's a bad thing, considering the original game was a clever, solid and fun design...the sequel doesn't advance the series beyond a few minor tweaks to the gameplay. It's still a fine RPG regardless, and a recommended adventure in the GBA library.FeaturesBrand new adventureOld and new characters, enemies, and battle chipsLink cable support for two player battle and tradingSupports connection with original Mega Man Battle NetworkCartridge save (one slot)Only for Game Boy AdvanceMega Man Battle Network 2 is set in the same virtual, Net-savvy world of the original, where humans interact with their PETs as if they were real people. Basically, PETs are personal electronic devices that house a NetNAVI personality...our hero, Lan, has one called Mega Man...these NetNAVI beings are the human's interface to the virtual, computer world...while we sit out here in the dull organic existance, Mega Man can roam free through inter-connected computer equipment, like videogame systems, picture frames and blenders. These little guys not only work for us on the net, they also eliminate hazards...viruses are all over the place, and only a truly skillful NetNavi can delete them all.In the sequel, Lan is off to summer vacation, but for whatever reason, he still has homework to do. Still, he puts it all off in order to get the licenses necessary to become the master net navigator or whatever they call it. But throughout the adventure, a new evil force bent upon world domination through the net is rearing its ugly head...and our hero, both Lan and Mega Man, have to do everything in their power to stop this force. It's an easy-to-follow storyline with some humorous conversations and super tongue-in-cheek references to the Internet and other Capcom items...you know what Zennies, are, right?Even though Mega Man Battle Network 2 takes place almost immediately after the happenings in the first game of the series, the designers realize that the gameplay is still pretty unique to what's usually offered in RPGs, so the first bit in the game is to teach players the mechanics. In the first game, the player, assuming the role of a young student named Lan, learned about the battle interface in class. In the sequel, he's ~retaught~ the mechanics by doing his homework after school. And since the battles haven't changed a whole lot from the first game, we'll just lift that text right out of the original game to explain it.At the beginning of a battle, players will choose battle chips that can be activated during battle. Normally, only one chip can be sent to the brawl, but using a little strategy (i.e. two of the same chips, or two of the same type chips) players can piggyback other chips into the list to give Mega Man extra firepower. In the battle sequence, players can move Mega Man over the red squares on the grid, utilizing his standard blaster to peck at the enemies in the fight. But it's the battle chips that really do the most damage, and the strategy is to pick the right chip for the right enemy and situation. Some enemies can remove grid squares from play, making it impossible for Mega Man to move to these sectors during the fight. Others can leap out of their area and into Mega Man's temporarily, so players must learn to keep their blue guy moving so he doesn't take too much damage in the battle.As players wander around the game's world, both ~real~ and ~virtual~, they'll stumble upon battle chips that can be collected and placed into the battle folder -- only a specific amount of chips can be accessed during fights, so it's another strategic element to know which chip does what, which are needed and which are not...sort of like how Pokmon freaks pick which Pokmon to use throughout their Pokmon adventure.Of course, the sequel adds brand new battle chips to the mix. And, like last year's game, players can transfer battle chips between each other, either by trading or by battling. The game even supports connection to the original game in the Retro Chip Trader. New additions to the gameplay include enhanced battle arenas modified with new elements like obstacles that relate to other players' NetNavi characters. Most importantly, your Mega Man character can evolve in look (basically changing his suit color) depending on your focus during the battle. It's not a major enhancement to the gameplay, but it will mean a bit more to the folks who have completed the first adventure and are looking to continue their Net-battling.The control, graphics, gameplay, and sound haven't changed much, at all, from the first game...which, again, is not a bad thing considering how clean and solid Capcom made the Mega Man Battle Network engine. There have been slight enhancements to it, though, including more puzzle elements to make the game less of a search-and-destroy...making the adventure more linear since the puzzle elements work with the story elements to point the player in the right direction.Like I said last year, the Mega Man Battle Network game structure is surprisingly good, and the sequel continues to move the series forward. It doesn't do anything to advance it, though...but there wasn't a whole lot wrong with the formula in the first place. I will make one suggestion that needs to get into the game in its next incarnation: Auto Map. The net is absolutely massive, and it'd be extremely helpful if the game kept track of where you've already been...especially since the platforms intertwine and teleport you to different areas of the network.For this sequel, don't expect anything more than a continuation of the first game...at least it makes it friendly for those who missed out on the original and refuse to get any ~old~ games, since the design makes it pick-up-and-play for folks new to the series. Mega Man Battle Network 2 is a great, solid RPG, no question.", "date": "Jun 17, 2002"}