{"name": "Morrowind", "name_review": "Elder Scrolls III: Morrowind Review", "ref": "https://www.ign.com/articles/2002/06/17/elder-scrolls-iii-morrowind-review", "text": "You can always enjoy a sitcom. You flip it on, there are a few jokes, a few laughs, and half an hour later you turn it off, already starting to forget what you just saw.   It takes more effort to get into a serious, high-quality dramatic series. It takes a few episodes just to get into the rhythm of the show, to pick up on the nuances and the characters. Then you have to buckle down and commit to watching every episode, season after season, to let the story arcs grow and characters change and progress. But in the end the reward is far more than what twenty minutes of laugh track can ever provide.    Guess where I'm going with this? Yeah, Morrowind is like that second kind of thing. The more you put into this game, the more you'll get out of it.   Of course if you want to be specific, Morrowind is a real-time, first-person, character-based roleplaying game set in a fantasy world. But that dry technical description -- as dry as the dust that blows through the haunted tombs of the Dunmer -- doesn't even begin to do this sprawling behemoth justice.    This is a tour-de-force, arguably the best Xbox game since Halo itself, and certainly one of the more interesting and important ones. More than four hundred quests. Thousands of NPCs. Hundreds of thousands of objects, magic items, weapons, and treasures -- all of which you can take, drop, leave wherever you want to. This game is vast. Perhaps the biggest videogame ever.   What a difference a hard drive makes.    That said, Morrowind does a superb job of bringing the player into its own sheer vastness gently and gradually. As it begins, you wake up in the hold of a prison ship, with no idea who you are or how you got there. You don't even know how to move your character around yet, either, but the basic controls are introduced one step at a time, even as your character is being created. You immediately start talking with NPCs who ask a short series of questions to get your name, your race, your gender, and your star sign. In essence, they help you create your customized character -- no pre-scripted, force-fed storyline here. During this process, you'll also figure out the controls for moving, looking, and using things, and gradually get a feel for the complex social reality of the game world.   This character creation process is about as flexible and customizable as you'd like, too. You can choose from twenty-one traditional classes, or you can answer a questionnaire that will choose a class for you. But the best way to go is to create your own character class. Using this method, you can select all the skills you really need. You might even go so far as to start several characters and through trial and error figure out which kind of character suits your style of play. This is probably a good idea, it will enhance your enjoyment of the game.   Having a well-rounded, capable character is important, since for the most part on your adventures, you're going to be strictly on your own. This is not a party-based RPG. True, there was one time this barbarian guy decided to follow me around, but shortly thereafter I went into a cave, dove to the bottom of a deep pool (there was a chest down there, you see), only to discover upon surfacing that the fool had dove in after me and drowned. It was an odd experience, but it's these kind of tasty little anecdotes that flesh out your own personal storyline -- and are the kind of thing that generally can't happen with the pre-scripted storylines of the traditional console RPG. Pity.      Personally, my best results were with a character who was a good warrior early on, with high strength and other physical ratings, and just a smattering of must-have spells and other skills -- healing, lockpicking, and at least one minor attack spell for the low-level creatures who can't be hurt by ordinary swords. Later when he made a lot of money, he was able to buy additional spells like 'Mark' and 'Recall' that helped speed the adventuring along.   But that's just me. There are probably half a dozen ways to play this game. You could choose to be nothing but a thief, never leaving civilization, spending all your time breaking and entering, fencing stolen goods and moving from town to town. You could also focus on the magical side of the game. There's an entire alchemy and magic-item building process incorporated into the rule set that my character basically ignores because he's a warrior first, a thief second, and mage a distant third. But if you want to create your own spells and magic items, the game's rules are robust enough to allow it. And once you do begin to use magic extensively, as even warriors and thieves will do at higher levels, you'll find it adds a whole new dimension of interest to what is otherwise something of a button-masher when it comes to the in-combat game.   Probably the most challenging way to play Morrowind would be as a self-defined Good character, someone who never draws their sword except when attacked, never steals anything, and avoids taking quests from dubious organizations like the Thieves' Guild and the Dark Elf houses. Instead you could be like Cain in Kung Fu, wandering the world, doing good deeds, righting wrongs, even specializing in unarmed combat, fighting without armor or weapons.    And for those of you who enjoy the Dark Side, you can be as evil as you want to be, a fantasy world drifter who goes from town to town, killing and stealing and leaving nothing but corpses and ghost towns in your wake. It's even possible to become afflicted with vampirism in this game, leaving your character a hopeless outcast who has to skulk around the edge of town, searching for victims to quench his unholy thirst.      But there are repercussions for your negative actions. The game tracks theft and murder, and if you're caught fencing stolen goods, or if someone sees you commit a crime, you'll be arrested and your stolen possessions confiscated. The Imperial legal system is notoriously corrupt and inefficient, though, so usually you can pay a small fine and be on your way, but it can really hurt to lose all of your high-quality equipment, particularly if you haven't saved your game in a while.    This system isn't flawless, however. Oftentimes you'll get busted for something that makes no sense. For example, one time my character tried to sleep in one of the beds at the Mage's Guild (he was a member, I figured what do they care -- and sleeping in beds is a quick, easy way to heal), but his nap was interpreted as a crime, and I was arrested and expelled from the Guild. And it seems a little harsh to have goods you stole on one side of the island somehow be recognized and seized by officers in some other town, whom you might think would have no idea where these things came from. Still, the inclusion of a wanted level and reputation that fluctuates depending on your deeds helps insure that there are consequences to your actions   It's not often that you talk about moral choices in a game. Usually you're presumed to be the hero, the good guy, and there's no question as to what you're going to do. Less frequently a game will cast as you as a bad guy, Thief: The Dark Project, for example, or Grand Theft Auto 3. But rare indeed are the games that not only allow you to make these choices, but are flexible enough to accommodate what you as part of the greater whole.   But that's because the world of Morrowind itself is morally ambiguous. As you begin to fan out and explore the towns and byways of the world, you'll begin to pick up on the local history and color. This is a distant corner of the Empire, and the local people (a race of dark elves who call themselves the Dunmer) aren't particularly happy being ruled by Humans from some distant land. Then again, these elves are no saints themselves, as some still practice slavery and get involved in strange and dangerous cults.  I ended up playing a Lizard Man as my main character, so when I found out that the Dunmer liked to take my people as slaves, I was a bit miffed, and any qualms Borot the Monitor previously had about robbing and stealing from the locals kind of fell by the wayside.    However there's more to the game than a medieval crime simulator. In fact, most of your combat is going to be done outside of town, against monsters and bandits and other traditional RPG foils. Your character could spend their whole career as a barbarian living out in the hills, fighting monsters and gathering herbs (although the lack of a hunger meter means this isn't challenging at all). Wandering monsters are common enough to be a challenge but not frequent enough to be a nuisance, a balance hard to find in a lot of roleplaying games. And even if you never go into town and sign on for a specific quest, it's possible to keep leveling up through random exploration, because after a while you're going to find the tombs, caves, and bandit lairs that dot the land and hold the best monsters and treasure.   But it is those quests that lie at the heart of Morrowind. By one reckoning, there are more than four hundred of them, and I seriously doubt you're going to play through them all with just one character.    Getting quests and learning about the overall storyline is a matter of joining guilds. You can pick up some bits and pieces by random conversations with NPCs, but most of the action takes place in your trade guilds (thieves, mages, or warriors), or in the Emperor's spy service, and later on, as part of one of the dark elf houses, if you choose to serve under them.      These quests aren't all linked, either. Sometimes you'll find yourself working at cross-purposes. For example, the Warriors' Guild may ask you to knock off a particularly pesky thief, but if you're also a member of the Thieves' Guild, that same pesky thief might have already asked you to retrieve some stolen gems for her. At some point, you're going to have to pick and chooseor simply ignore both sides, and move on to the next town.   If the social and cultural milieu of the game and its Byzantine web of clans, cults, and guilds is rich and intriguing, then the physical geography of the world itself is simply breathtaking. Sure, the actual screen resolution of the Xbox version isn't up to snuff with what you'll get on the PC, but that doesn't diminish the overall experience. Morrowind on the Xbox is a fine-looking game, in and of itself. And you can all have all the rendering power in the world, but if you don't know what to do with it, if your game looks like the same miserable gray techno-dungeon from one end to another, then you really haven't got much of a world at all.   So in that sense, the designers and artists behind Morrowind must be commended for creating a rich mix of alien architecture and spectacular natural vistas. Sure, the first town you'll see is your traditional medieval village, but as you explore further the island of Vvardenfall you'll find yourself constantly ooing and awing as you move from misty, mushroom-haunted coastlands to dust-choked desert trading towns, or stray suddenly from a vast, fungal fortress into an ash-choked volcanic wasteland, complete with howling winds and clouds of billowing dust. The sun rises and sets, the stars come out at night, thunderstorms break out at random and the rain comes down. The devil's in the details when it comes to world building, and with Morrowind we have perhaps the most fully realized, convincing 3D world to date.    Still it's not a perfect one, not by any means. I wish there were more kinds of monsters and animals, more types of creatures to fight and more innocuous beasts to hunt or ignore. We could've used some horses (or whatever the dark elf equivalent is), and it would've been fun even once to have a Silt Strider actually carry you across the landscape rather than sit there like a transporter tube, but those are the hard decisions the designers have to make.   The NPCs for example are extremely fixed in place. The stores never close up at night, and a lot of the shopkeepers never follow you upstairs to see why you're rooting through their drawers. Once you get the patterns of the NPCs down, it's almost impossible to be caught stealing. Conversations with them can also be repetitive, and after a while you start cycling through the same faces over and over again too.   So sometimes, Morrowind's sheer scope works against it. You'll pretty much get the basic pattern of the game down in the first few towns -- NPCs, monsters, ruins, quests, leveling up. And nothing dramatic ever really happens to change that basic setup. The world feels very alive sometimes, but it can also feel very static and staged too.        To be sure, the game also has technical issues, which must subtract from the final score. For example, there's an ~NPC drift,~ in which NPCs who are rooted to fixed locations gradually ~drift~ a few pixels at a time, which isn't a big deal except that eventually they can end up lost from the world altogether. Not good if that NPC happens to run the local Silt Strider transporter. Another problem is the mini-map going black, which can be fixed by clearing the Xbox's cache.    This is a huge world with lots of objects, sometimes put together a bit sloppily by the level designers. It's possible to jump yourself down into between some barriers that you can't climb out of, or otherwise get yourself stuck somewhere in the game. I've managed to do this twice, and I've heard of NPCs getting stuck too. Another problem I've encountered is more of a design issue. In order to complete certain quests, you must return a given item to a certain person. However if you leave the item in a monster's inventory and then don't come back before the monster's body ~evaporates,~ you might never see that item again. By the same token, if you sell or drop a needed item and then completely lose track of it, you can completely derail that quest tree.    What I expect will happen with bugs like these is that we'll get a patch, along with new content (additional magic items, books, and quests) down the road. This could be delivered either through the Xbox Live service or via an add-on disc, ala Dead or Alive 3. Hopefully both options will be available, because making people sign up for some online service just to get a patch would be an unprecedented breach of consumer trust. Let's hope Microsoft and Bethesda do the right thing with that. (Of course all this would be a non-issue if they'd built in an easy way for PCs to transfer files to the Xbox to begin with, but whatever.)   Still, try to look at the big picture when it comes to the bugs. Is the game playable? Absolutely. Is it fun? Heck yeah. Is the world going to end because you can't complete a couple quests? No. Or look at it this way. I played the PC game Daggerfall (Elder Scrolls II) when it came out back in the day, and that thing was a hundred times buggier and more unstable than this. That game could crash a couple times an hour. Morrowind has crashed my Xbox a grand total of once, and only after ten hours of straight play.   When you introduce a hard drive into the console gaming equation, you take the good with the bad. The good is you get better, more flexible games that allow more creativity and freedom for both developer and gamer. For example, I could gather up hundreds of the books lying around the towns of Morrowind and create my own little ~paper trail~ of books leading from one town to the next -- and the next time I played, the game would remember exactly where I left every single little thing. Try doing that on a console world saved primarily on a silver disc. The bad part of the equation is that when you're chucking that much data around, you're going to have little bugs and inconsistencies crop up. PlayStation 2 owners in Japan are also learning the same thing about the pluses and minuses of hard drive gaming with the Final Fantasy XI test, which sounds to me a lot like the early days of the EverQuest beta, where you were downloading huge patches regularly. Welcome to the future of console gaming, perhaps.     Finally, I'll admit Morrowind isn't for everyone. It's a huge, sprawling, megapolis of a game that can take a couple hours just to get into and a hundred hours to complete. In an industry where most games present clear, linear paths guiding you from one pre-defined problem (a jumping puzzle, a monster, or some other dexterity test) to the next, some gamers will find Morrowind's open-endedness unfamiliar, bewildering, even perplexing. They'll sit there, waiting for someone to come along and tell them what to do.But others will find it liberating. Freedom is intoxicating. If the purpose of games is to provide absolute escapism, to immerse us deeply in another world that never was, and then to give us the ability to go through it and do what we want to do, then Morrowind accomplishes that brilliantly.", "date": "Jun 17, 2002"}