{"name": "Pinball of the Dead", "name_review": "Pinball of the Dead", "ref": "https://www.ign.com/articles/2002/06/19/pinball-of-the-dead", "text": "It's not like you can successfully attach a lightgun to the Game Boy Advance or anything...so when Wow Entertainment and Sega set out to bring its Dreamcast and arcade zombie shooter, House of the Dead to the Game Boy Advance, the team opted for something a bit more untraditional to the horror genre: pinball. Pinball of the Dead brings the characters, locations, and themes of the past two House of the Dead games into an action-filled, top-down pinball challenge. The result is a fun game that doesn't exactly simulate the feel of pinball, but gives players a whole lot to do with that silver ball. Features Three full pinball tables Six boss battle tables Tutorial mode Cartridge save (four slots for midgame, and high score slots) Only for Game Boy Advance Pinball of the Dead features three giant tables of survival horror action, each based upon sequences and situations in the light gun series.  These tables expand more than three or four screens high, with several ramps, spinners, bumpers, and flippers in their layouts, all of which are styled in the gritty, gory House of the Dead style.  This isn't the first time pinball's gotten a bit on the demonic side...some folks might remember Devil's Crush on the TurboGrafx -16 system and Sega Genesis, and I'm sure that Wow Entertainment looked towards that game for inspiration.  The game doesn't confine players to these three boards, though...as you successfully wipe out the zombie threat that wander the playing field, you can shoot the ball into chambers that will send it into one of six different boss battles, each pulled out of the House of the Dead universe...and each with their own single screen playfield. Basically you just have to slam the ball into these guys until they explode into a pile of bloody goo, but there is a bit of challenge involved to destroying each of these bosses.  As far as pinball physics go, it's obvious that realistic ball motions were last on the list of priorities for the developer. They get the basics right, with the ball ricocheting off in different directions when thumping against powerful bumpers and objects. But the ball doesn't have too much ~weight~ to it, and this is made clear when the ball rolls up and down ramps and channels. It's also difficult to do trick shots such as flipper passes in this engine because the ball moves more ~floaty~ around the playfield than a real metal ball does. If all you're looking for is pinball realism, this game doesn't have it...Digital Eclipse's Muppets Pinball Mayhem is a better choice.  But it's the action, the table design, and the challenges that make Pinball of the Dead a slightly better pinball game than Muppet Pinball Mayhem. The playfields are never dull or stationary, continuously alive with moving zombies, flashing lights, and other side objects that animate when you nail 'em with the ball. The challenges of sending the ball to specific, required locations on the playfield aren't too complicated, but the developers included a Tutorial mode just in case new players need a refresher course.   The graphics are well rendered with muddy colors that don't come off too dark on the LCD screen, a la Castlevania: Circle of the Moon. Wow Entertainment pulled a lot of assets out of House of the Dead for each of these tables, including a handful of FMV clips that play before boss challenges. The only real issue with the graphics is a bit of slowdown that arises when tons of objects are moving on-screen. Sound effects are a mixed bag...tunes are enjoyably chaotic, but the horrible voice acting has been lifted out of the arcade game and converted into sound bites that play at strange times during the action.  Sega really knows how to pull out the quality Game Boy Advance products, as Pinball of the Dead is another decent title for the handheld. It's not a fantastic pinball simulation, but the game's table design aren't exactly simulating real pinball either...it's the continuous action, learning the specific places to shoot that makes Pinball of the Dead a solid GBA title. One strange omission: The design doesn't allow for multiplayer...not even hot seat fashion that most pinball games support. With all the half dozen other pinball titles set for release on the Game Boy Advance in the future, I'm sure that at least one or two of them will beat out Sega's attempt at the genre...but in the meantime, this game's a good one to get if you're looking for a more untraditional pinball game.", "date": "Jun 19, 2002"}