{"name": "Nicktoons Racing", "name_review": "Nicktoons Racing", "ref": "https://www.ign.com/articles/2002/06/20/nicktoons-racing", "text": "It's getting to the point where a collective grown is mentally heard every time a publisher announces or ships a licensed kart-racing title for the Game Boy Advance. Ever since Mario Kart hit the market years ago on the Super NES, it's almost as if every game designer in the industry has given the genre a go with whatever license a publisher hands them.  In the case of Nicktoons Racing on the Game Boy Advance, Crawfish was given the task of creating a fast-and-furious racer on the system...and surprisingly, the game succeeds. It's admittedly nothing more than a Mario Kart wanna-be, but the team's creation is an unexpectedly good design. But we can't forgive them for leaving out Rocko from Rocko's Modern Life in the line-up of racers. Boo! Features Three difficulty levels Fifteen tracks Thirteen racers from Nicktoons shows (no Rocko, though) Cartridge save (five best time slots per track Only for Game Boy Advance  So here's the deal: three difficulty levels, three cups of five different tracks. Like Mario Kart, players race to get first, second, or third, earning points for each of the races in the cup. Come in first, second or third at the end of the five races, and you can move onto the next cup. Finish all three cups in a specific difficulty, and you'll open up the next difficulty. Complete the medium difficulty and you'll unlock a hidden racer. Like most kart racers, it's not just about being the fastest and most skilled around the chicanes, it's also about picking up the power-ups in order to temporarily knock the opposing racers on their keesters...temporarily, of course. Though the game clones Mario Kart's design, the development team added one cool element: a turbo boost that can be filled and used at any point in the game...simply double-tapping up on the control pad will send your car flying down the track, if you've got the fuel to burn.  Each of the game's thirteen racers, fifteen tracks, and thirteen offensive weapons are from eight different cartoons airing on Nickelodeon. We've got Tommy and Angelica from Rugrats, Arnold and Helga from Hey Arnold!, Eliza and Darwin from The Wild Thornberrys, CatDog from CatDog, Dagget & Norbert from the Angry Beavers, SpongeBob and Patrick Star from SpongeBob Squarepants, Stimpy from Ren & Stimpy, and Ickis from Aaahh!!! Real Monsters. What we don't have is inexcusable: Rocko from Rocko's Modern Life.  C'mon...surely they could have left out that butt-ugly girl from The Wild Thornberrys to give the hawaiian shirted wallaby a chance at the cup.  Some programming teams that clone the Mario Kart game don't quite ~get it,~ what makes the genre so much fun to play...Shrek Kart Speedway, anyone? But Crawfish gets it. The team's design is not only fun to play, it's impressive to look at as well. The game engine is that familiar Mode 7 design, but the framerate is incredibly smooth and features a lot of trackside obstacles...some that even rotate correctly when you zoom past them. To give the gamer a real sense of speed, the programmers throw in a really clever effect that pulls at the background layer during the turbo boosts...it's an effect that needs to be seen to appreciate. Cars squash and stretch as they jump and bump on the track, giving the game that added bit of character.  It's admittedly a little on the easy side, as players familiar with the Mario Kart design can, and will, blow through all three cups in a good couple of hours. But considering the license, it's more aimed for the younger gamer not quite ready for the Mario classic. As easy as it is, though, the hard difficulty is a pretty challenging, and it will take a few tries to come in first place...unfortunately, the game doesn't reward players better for first place victories over second or third place standings. And though there's a good variety of weapons, the differences aren't very creative...four weapons, different in looks, perform nearly identical tasks.  Once players get through the single-player cup challenges, they can head to the time trial modes to beat their best times...but unlike most racing games nowadays, Nicktoons Racing doesn't have a ghost racer for the top time on the track. Players can also connect up to four systems together and race against each other, but they'll need an additional cartridge per system to take advantage of this mode. I'm definitely surprised how much I liked Nicktoons Racing...I was ready to slam this Yet Another Licensed Kart Racer, but instead, the game instantly impressed with solid controls, an excellent Mode 7 engine, and a really good sense of speed...especially in the higher difficulties. It has its own quirks that could have been ironed out...finishing a race is anticlimactic, since the game doesn't offer any sort of fanfare or change in music after your car crosses the line. And the choice of icons for the weapons is a little uncreative; they chose some obscure tree stump for an item that whacks players on the head...why not Log (tm)? It's big, it's heavy, and it's wood!And I won't let this go: A Nicktoons game without Rocko is like a Big Mac without the special sauce! Blasphemy!", "date": "Jun 20, 2002"}