{"name": "Romance of the Three Kingdoms VII", "name_review": "Romance of the Three Kingdoms VII", "ref": "https://www.ign.com/articles/2002/06/27/romance-of-the-three-kingdoms-vii", "text": "In my late teens, when my brother and I first moved away from California after High School, we found ourselves in a bit of a conundrum. Without friends or associates in our new state of Oregon, we didn't have much to do besides sit down and tackle our growing videogame collection. Backlogged, we really grew to appreciate the free time we had during that first summer and spent the entire season slaving away at our collection.   Eventually though, we managed to conquer just about everything we owned and continued to retailers and rental chains looking for new experiences to quench our thirst. One day while browsing through the usual mess of SNES and Genesis carts in the electronics section, we stumbled upon a clearance copy of Koei's Romance of Three Kingdoms III: Dragon of Destiny. Caught up in a massive RPG phase, we figured that the history-inspired, stat-heavy simulation could be just what the doctor ordered to keep us involved until the next big Squaresoft release. And what we found instead was a game we hadn't prepared for.   A rich text-based amalgamation of politics, military strategy, and Role-Playing, Romance of the Three Kingdoms III was a world unto itself. Not surprisingly we ended up spending years perfecting all the nuances, techniques, and approaches that the game had to offer as we eagerly anticipated the next version to sink our teeth into. And while the fourth installment did in fact make its way to our Super Nintendo when it debuted, the magic we discovered with the third title was never quite duplicated again.   Several years and many systems later, I find myself on the cusp of yet another Koei simulation as the oft delayed Romance of the Three Kingdoms VII has finally made it to North America. After plenty of roadblocks that's prevented its conversion in 2000, I'm happy to report that the latest game in the series has managed to fuse plenty of new elements with old-school basics; allowing me to recapture that same feeling I enjoyed with the SNES adventure all those summers ago.    Story  It's been told so many times and in so many forms, that pinpointing the true story behind the ~Three Kingdoms Era~ is quite difficult. Based on actual events and told through creative fiction and composite character descriptions, the Three Kingdoms legacy is a true example of historical fantasy.   Spanning nearly 100 years during second and third century China, Romance of the Three Kingdoms begins with the reign of Emperor Ling and tells of the cataclysmic battle between territorial warlords. Tearing Asia asunder in every imaginable way, the story watches as the Yellow Turban Rebellion triggers a continental split into three main factions: The Clans of Wu, Shu, and Wei. In the century of war that follows, figures like Sun Quan, Lu Bu, Zhao Yun, and Kong Ming are brought to the forefront of history before finally ending the tale with the eventual unification of China by Chin.   Your job in this play is to assume the role of one of the historical warlords and relive it. With 10 unique scenarios each taking place in a different decade of the Three Kingdoms era, finding a preferred story point shouldn't be a problem. If you prefer, you can decide to leave history in the dust, and create you own clan to write a new ending all together. As huge as the Three Kingdoms universe is, the possibilities are literally endless.    Gameplay  And that is what ROT3K7 is all about: the possibilities. An extremely flexible micromanagement simulation at its heart, Koei's oldest franchise hasn't changed much over the years. You still must cultivate your land for crops, develop new techniques for war, and entice merchants to do business in your cities -- while still finding the time to locate and develop new officers, train your army, increase your people's trust, and expand your dynasty into other cities.   It sounds overwhelming, and it is. With literally dozens of different commands to choose from in every round (represented by months), casual gamers will definitely be in over their heads. Aimed at the hardcore freaks and devoted genre fanatics, one of Three Kingdoms inherit gameplay challenges is just to figure it out. If you can get past that, then you're in for a treasure trove of rewards.   But going into detail about how to accomplish that feat would be pretty difficult, short of rewriting the super-thick manual. If I were to surmise how to do it in a nutshell, however, it would go a little something like this: Get officers and underlings with high statistics in politics, war, and other needed categories and then assign them to a specific task. After focusing on it month after month you'll eventually build a sufficient enough city so that you can move beyond it to pursue another town by which the process will be repeated all over again.   If it were that simple though, it wouldn't be much of a game and that's where Kingdoms hooks you. There's such a huge list of variables to consider when putting together a dynasty, that there's never a sure-fire path to success. If you don't keep your officers loyal to you, they can be recruited by other rulers and be used to turn against you. If you don't train your army, they won't be able to stand up to the opposing forces standing in your way you also must remember to continually draft so as to avoid being outnumbered.    Other factors, like learning new skills and improving on the ones you have through experience points or setting political traps for your rivals in nearby cities add even more depth to an already huge game. And the bonus of being able to create up to 100 of your own custom officers in any campaign is a big advantage as well. Especially considering that even on the easiest difficulty setting, your fellow rulers are ruthless expansionists bent on taking over your territory.   And that brings us to the combat aspect of Romance of the Three Kingdoms, which is probably its only sore spot. Maintaining the same depth and open-endedness that the city function has, the war simulation can oftentimes take far too long. Plagued by frequent but thankfully short loading screens and a meticulous turn-based tactics system, even the simplest of invasions could take hours. Naturally, focusing on a militaristic nation will probably speed you along in that process, but then you'd be leaving yourself open for espionage and political defeat. And since most players will spend the majority of their time in the former game mode as opposed to the latter, it's not an option that guarantees success.   Battle qualms aside the game is still effectively playable, and chimes in as a purveyor of the rare ~what time is it?~ mentality. A breed that fuels the type of session that can see a player waste an entire day on a single campaign, the sheer addictiveness of it all is mind-boggling. Once the text-heavy intimidation factor is out of the way, of course.    Graphics  The series has never been pretty, but has never tried to be either. Probably at its visual peak with the rendered sprites of the fourth game, this seventh version has gone back to the days of an even simpler inspiration. Choppy, slow, and incredibly reminiscent of the SNES, the artists aren't going to win any awards for their two-frame animations and detail-deprived citizens.   I also didn't care much for how the one-on-one duels were handled. A quick way to end a fracas if you're short on time, the duel option pits leader against leader in a balls-out battle for supremacy. The only problem is, that it doesn't even compare to the aforementioned 16-bit efforts in presentation. Close-ups of the faces, cinematic kill scenes, and interesting special moves have been nixed in favor of a placeholder back and forth jib with occasional dialogue. Bummer.   The strange part is, that the long-dead cartridge style that's used here actually turns out to fit the mood and atmosphere of the game rather well. And the collection of superbly painted stills that help move story points and city accomplishments along are easy to appreciate. But that's not to say that Romance of the Three Kingdoms still isn't in dire need of a visual overhaul. Sporting one of the most solid engines in console strategy history, Koei could really open up its audience even wider if it would find a way to make the game more appealing to less than tolerable graphic fiends (which fortunately/unfortunately make up a pretty good chunk of the buyers out there). Imagine only for a moment, that Koei had decided to upgrade its visuals to the same level of its first PS2 game Kessen. How much easier would it be to get those units moving off the shelves?   Sound  I absolutely love the musical score. Limited as it may be in track selection and variety, Koei's string-based orchestral creation is nothing short of a stellar piece of work. The best Chinese-style tunes I've heard since Crouching Tiger, Hidden Dragon, I'd often find myself stopping to do nothing other than close my eyes and listen.   Sound effects, though, are minimal with the only real need for them being during the battle sections. Made up primarily of clangs and rumbles, the ear candy (like the visuals) is strictly homage to the 16-bit philosophy. Curiously untouched since the days of the cartridge, I couldn't help but wonder why there was such a beautiful effort on the soundtrack while it's supporting audio was completely neglected.In the same league with its previous incarnations, Romance of the Three Kingdoms VII will definitely not appeal to everyone. Presenting outdated graphics, sparse sound support, and a list of commands and math equations a mile wide, it's lack of interest is pretty understandable.But if you can see past the facade and look directly into what really makes this game tick, you'll soon discover that there's a scant few with this much depth and functionality. A risk purchase for those looking for the next GTA 3 or Devil May Cry, Romance of the Three Kingdoms is a terrific experience that will sadly never get the exposure it truly deserves.", "date": "Jun 27, 2002"}