{"name": "LEGO Soccer Mania", "name_review": "LEGO Soccer Mania", "ref": "https://www.ign.com/articles/2002/07/01/lego-soccer-mania", "text": "If you're looking for proof that soccer is on the rise in the US, how about the flood of videogame soccer titles that have hit consoles this year? With all the big names in sports publishing trying to cash in on the 2002 World Cup, one wonders if there's actually a market hungry enough for all these different games Whether you're looking for deep soccer sims from EA or Konami or the over-the-top three-on-three action of Sega's Soccer Slam, there are plenty of choices out there for new and old soccer fans. But that hasn't stopped EA from readying its third footie game for PS2 owners: Soccer Mania. EA's latest foray into ~Assoc. Football~ is trying to stand out from the fray by targeting first and foremost the younger gamer. Using players from the LEGO universe and soccer fields inspired by LEGO's most popular themes, Soccer Mania tries to bring the popular toy license to life with simple, arcade-style gameplay, complete with power-ups usually at home in kart racing games.   Features  Customize your own LEGO soccer team, from standard soccer players to cowboys, pirates, and Martians 23 themed stadium environments, including snowy valleys, castles, pirate ships, cowboy forts, and outer space Skill Zone mode features training mini-games Team creation: assemble a custom six player team of your choice Use power-ups to gain shields, invincibility, steal the ball, or turn the ball into a rocket or a bomb Multitap support for four-player matches   Gameplay Soccer Mania takes the basic soccer rules, reduces the number of players on each team to six Lego guys, and dumps anything that could interrupt the game, such as offsides, throw-ins or free kicks. It's all very simple and easy to understand. The ball bounces off so-called ~plasma walls~ that surround the different fields, you can pass short and long, perform foot-in and slide tackles, two different skill moves, and determine the strength of your shots by holding down the button longer. Curving your shots is also made easy -- you simply move the control stick after you kick the ball. The simple controls make it easy to just jump into the game and play, and there are a number power-ups you can pick up to liven up the game. For example, the rocket power-up will rapidly catapult the ball at the goal from anywhere on the field, whereas the bomb power-up acts as a defensive maneuver that will knock over the player in possession of the ball. Sounds like all the elements are in place for a fun, fast arcade game that should appeal to gamers both old and young, right? Sadly, the pieces don't make for a well-balanced whole. The overall pace of the game is too slow and everything feels so generic, anyone above the age of 10 will quickly get bored.  What makes LEGOs so unique as far as toys go is the ability to be creative and build anything you can think up. While Soccer Mania features players and environments that mirror the different LEGO themes, creativity has no place in this game. Unless you consider assembling a team from pre-made LEGO players ~building~, then the only thing that makes Soccer Mania not a Smurfs soccer game is the fact that there are no Smurfs. What you're left with is generic arcade soccer that plays like every Japanese arcade soccer game from six years ago -- but with power-ups. The story mode is absolutely forgettable, the AI is basic, and the overall gameplay -- even when playing with four players -- rarely generates excitement. The only truly original element in Soccer Mania comes in form of its training mode. Players can hone their skills and unlock additional players by competing in fun little mini-game challenges. If only the main game was as much fun.   Graphics LEGO blocks have a unique look to them and I can see that it would be tough to create bump-mapped play fields on the PS2, but the designers could have at least tried to make the environments actually look more like LEGO. The different levels' themes are mostly confined to the backgrounds, with grass or cement fields (not made out of LEGO) for the players to play on. Why not have a patch-work LEGO floor? How about using the LEGO train as an obstacle that crosses the field once every minute or so? Anything to actually make playing a game against the medieval soccer team different from playing the pirates, for example. It's all so utterly generic one wonders whether the game was really designed from the ground up as a LEGO title, or whether the developers just added backgrounds and LEGO guys to a near finished kids soccer title. On the upside, Silicon Dreams did a great job animating the little plastic guys. The way the LEGO teams hop awkwardly across the fields in pursuit of the ball is one of the highlights of this otherwise graphically average game.  Sound Forgettable tunes are looped over and over again while you play -- even when you score a goal and your LEGO guys are falling over each other with joy saying ~hawhaaaw~ or ~yeehaaa~. The fact that the game's audio never changes makes scoring a goal so uneventful, beating the computer is no fun at all. You'll just hit the button to skip past the victory celebration, start over, and shoot another one. Goal after goal, accompanied by the same boring tunes. LEGO is made from plastic. How cool would it have been if the sound effects actually fit the license and didn't try to mimic real football? If you're looking for a simple soccer game for your 8-year-old kid, Soccer Mania delivers fun, if short-lived arcade soccer action, but anyone older than that will grow bored rather quickly. With its so-so graphics and sound, Soccer Mania also lacks the polish we've come to expect from EA-published titles over the years. To make things worse, the LEGO license adds virtually nothing to the title. How about a power-up that quickly builds a wall out of LEGO blocks in front of the attacker? What about the ability to build your own soccer field or backgrounds? Everything that makes LEGO so popular was ignored in favor of a quick and dirty -- and utterly generic -- soccer title that will be forgotten the very month it's released.", "date": "Jul 1, 2002"}