{"name": "Zoo Tycoon: Dinosaur Digs", "name_review": "Zoo Tycoon: Dinosaur Digs", "ref": "https://www.ign.com/articles/2002/07/08/zoo-tycoon-dinosaur-digs", "text": "Defiantly laughing in the face of all the knowledge that Michael Crichton bestowed upon the world with Jurassic Park, developer Blue Fang and publisher Microsoft were more than happy to let all of you have a chance to succeed where all of those wacky scientists in the book failed. Zoo Tycoon: Dinosaur Digs will certainly allow you the opportunity to raise your own dinosaurs without the worry of actually being eaten. It's no secret that Zoo Tycoon wasn't one of my favorite games of all time. I still hold firm with many of my gripes about the gameplay. Regardless of this, Dinosaur Digs adds plenty to the formula in the form of new props, buildings, and of course all manner of pre-historic creatures to please your guests. If you liked Zoo Tycoon chances are, you'll really get a kick out of this expansion. Hell, I even had a few laughs from it.   The premise behind the whole game is that you and your crack team of scientists have managed to clone creatures from the past to be used for the benefit of man, not only for scientific research and discovery, but also the fun and frolic of pointing at and taking pictures of wondrous and amazingly stupid creatures. It'll be your job though several new campaign scenarios and plenty more time with the freeform zoos to please your guests with expertly designed exhibits that best show off your prized possessions.   Your prized possessions come in all shapes and sizes. The smaller ones, for the most part, will take about as much care on your part as any of the other animals that you've gotten used to taking care of. The bigger creatures, particularly the very testy Tyrannosaurus Rex will require a bit more work on your part making their enclosure nice and comfy to ensure their happiness and your park goers' safety. It's especially interesting when they start running around knocking trees over and running into fences to show their displeasure. Until you get the T-Rex enclosure into good shape, chances are you're going to have to spend plenty of time there bulldozing rubble from broken trees and fixing trampled ground while getting the mixture just right.   Of course, in order to ensure that your evil carnivorous dinosaurs (anything from T-Rex to Velociraptor) don't make a meal of your guests, you'll have to have some security ready at all times. The first line of defense is the cage itself. For most of your peace loving herbivores, bigger fencing strong enough to keep them from trampling through it will be enough. But for your walking creatures of death, you'll need some extra protection in the form of a little electricity. That's right, plug in those fences and you'll give your dinos a little lesson in who's boss. You'll see them get a nice shock every now and again if they become unhappy and try to excuse themselves from your hospitality. But you'll also need to make sure that you have even more maintenance guys ready and walking around the park. All of your fencing needs repairing, even the electric kind. If you slack off, your fencing could give out. Of course, you'll know when it happens. Not only because of the notice that blips on screen saying Tyrannosaurus Bob has escaped! But also because of the screams coming from your park goers.   If your dinos do manage to escape from your clutches, there are a couple of options at your disposal. Option A is to just click on them and put them back in their enclosure inside of a giant metal crate (until you can fix your exhibit when they pop out). Option B is to be thankful that you built the Dinosaur Recovery Team building that sends out units to tranq them and stick them in a metal crate for transport back to the cellblock... I mean exhibit. Option C is to do nothing and watch the action unfold. Sure I'm sick, but it's interesting to watch the various reactions to the different types of dinosaurs that have managed to escape. Mostly there's a lot of running and screaming. But then with the T-Rex there's some stomping and some picking up of people and throwing them into the air only to get caught and swallowed like so much popcorn chicken. And with the Velociraptor there's the chase and the last ditch effort by the park guest to avoid an evisceratingly horrible death by squaring off and making a break for it. They never manage to get away.   All of your dinosaurs will need the help of a brand new employee type. The scientist takes the place of zookeepers when it comes to dinosaurs. They'll nurse them from egg form to old age giving them food and medicinal help when it's needed. Somehow, they also have anti-dino powers that keep them protected at all times. Don't worry about it if you see one wandering around cleaning up the gigantic piles of T-Rex poo with what amounts to a huge vacuum. Good old T-Rex knows the hand that feeds him. Apparently there are plenty of other hands to bite off. Keep in mind though that if you stick two different types of animals in the same cage (now that's fun to find what modern day animals and what prehistoric ones like each other) you'll have to assign a zookeeper and a scientist to the same cage.   Dinosaurs aren't the only new things on the menu though. There are a lot of new objects to play around with. You'll get new themed food shops like the Bronto Burger stands and Mammoth Ice Cream. There're also dino gift shops, brand new ~House of 'Insert Animal Type here'~ to keep your guests entertained (although they're still about as entertaining as eating cardboard to me). Some of these new buildings are giant sized to go along with your giant sized animals, which is kinda cool, but couldn't some moving parts or some more Disneyish touches been added to them? Oh well. You can also expect new trees and rocks, new shelters designed specifically for the prehistoric animals, and plenty of other new themed objects like stone benches and volcanoes to add some visual interest to your park.   Graphically Dinosaur Digs is pretty much the same as Zoo Tycoon. In its favor, the dinosaurs do look fairly cool if you're far enough away, but as before, when you zoom in to get a good look, the pixels jump out and slap you like a little bitch causing terror and general disinterest in ever zooming in again. While animations still tend to be a little chunky, some of them are kind of entertaining. Take for example the aforementioned dance of death between the Velociraptor and park guest. It's sad and funny all at the same time. Sort of like a romantic comedy starring Adam Sandler.    What did you think of Zoo Tycoon: Dinosaur Digs? Aside from the new concerns of keeping your more dangerous creatures inside their cages, gameplay is pretty much the same thing. You make a cage, stick a creature in it, and change everything to suit its needs without going too far into debt. Getting food stands and money making buildings up and running is as important as ever because dinosaurs will eat you out of house and home if you aren't careful. Some new tools will make some things a little easier, like the ability to hide foliage, guests and buildings, and a sorting feature to quickly sort between new and old objects and research groups. Unfortunately other options for enclosures haven't made their way into the equation yet. I was hoping for the ability to stick deep trenches around exhibits to eliminate the eyesore of so many cages, but alas, its not there.   Expansion packs are an interesting business to review. I still don't like Zoo Tycoon all that much. But this expansion adds plenty of new features and items. It didn't really fix a lot of the things that I thought were a problem, or add enough to attract new fans, but those die hards that liked Zoo Tycoon should find Dinosaur Digs to be well worth the time. It's a little more challenging than before and the chance to keep a zoo full of dinosaurs should appeal to many would be tycoons.", "date": "Jul 8, 2002"}