{"name": "Hey Arnold! The Movie", "name_review": "Hey Arnold: The Movie", "ref": "https://www.ign.com/articles/2002/07/17/hey-arnold-the-movie", "text": "We at IGN hate bad, bad kids' games, as do many of you readers (and we know you hate them from the constant stream of sometimes unintelligible Message Board posts and emails complaining about them.) But we hate them for a very different reason, and it's not just that we have to play them (compared to the web monkey who never touches a kids' game but writes in saying, ~Wy dey make stuped kiddie crap wen theys shood make GTA3 wit fatalities theis time!!!!!!!~) It doesn't even kill us that these kids' games score billions in profit with no effort put into them (although that does sting sometimes.) The reason we editors hate most kid's games is because we know lots of kids will end up playing them -- they're all based on their favorite characters -- and it sucks to think that little kids will spend time playing these poo-piles, sometimes as their first gaming experience, and will suffer the same frustrations and aggravation playing through these games that we do, only they will care because they wanted the game to be worth it. Kids deserve good games too.  Hey Arnold isn't completely a bad, bad kid's game, but it makes almost all the mistakes of one.  Features  Play as one of four characters: Arnold, Gerald, Grandpa and Grandma (plus one hidden character) 5 exciting areas including City Area, Indoor, Building, Underground and City Area (part II).  The first ever Hey Arnold! video game Only for Game Boy Advance   Altron, the same game makers who coded the swell racers Advance GT and Hot Wheels Extreme, has taken on the task of translating the Nickelodeon cartoon Hey Arnold for THQ here. At the very least, they have a very strong engine to show off. Huge characters trot across with convincing animation through colorful stages. The effects are nice -- one stage has glassy, mirrored ice that's a really neat trick on GBA -- and they put in a very cool physics engine for many of the game's effects (for example, balls thrown at enemies will bounce down steps.) It's certainly the basis for a simple, entertaining kids' platformer.  Unfortunately, the actual game doesn't show nearly as much polish as the graphics engine. The layout of the stages has you making all kinds of blind jumps -- the viewing angle won't adjust to show you where you're jumping, so often you'll be jumping over bottomless cliffs or even across tiny platforms without a clue where you're going. There's also cheap deaths in how enemies will be underfoot that you can't see when you're platform-hopping, or will respawn right outside a door you've just come through (leaving you less than a second to react, and usually not enough space to move out of the way even if you do try.)  There's even an instance where a graphic effect fades out a foreground object when you pass by -- great visual, until it fades in the enemies that are hidden behind it who are already in position attack while you're still waiting for the fade effect to show them.  Then there's the password. We've harped on this cheapie cop-out (companies put a password in when they won't pony up the small charge for a battery to save the game) many, many times, and you'll probably hear it many, many more times in the future. Myself, I can forgive the occasional password if it's short and simple, but the password on Hey Arnold is exactly what's so wrong about using a password save. It's 9 digits with upper and lower case letters, plus funky punctuation and screwy symbols that a kid could write down wrong (especially if trying to write while riding in the car or on a spare napkin while hurrying to get it down before your batteries run out.) The password for this game saves EVERYTHING -- your remaining coins and your extra lives and everything else. Most of this is unnecessary, and they could have cut the password by half or optimized it to be easy had they thought things out.That's the problem with most kids' games like these -- they're just not made right for kids. The floaty jumps, the blind leaps, the cheap hits, and the haggle of a password just aren't fair for the grade schoolers who will want to play this game. Hey Arnold has a lot of promise, and still has some enjoyable elements in it, but there's more frustration than fun in here for kids.", "date": "Jul 17, 2002"}