{"name": "GT Advance 2", "name_review": "GT Advance 2", "ref": "https://www.ign.com/articles/2002/07/19/gt-advance-2", "text": "Flash back a year ago when the Game Boy Advance just hit the shelves in the US. THQ scored the rights to bring out the stunning Advance GTA title shipped as a launch title in Japan. Plop the US localized version in a system and you got a near-direct version of the same game shipped overseas months before...with one horrifying difference: to cut costs/make more money, THQ yanked out the save RAM from the Japanese version, replacing it with an absurd password system that no GBA gamer should be subjected to. And the public let THQ know their distaste...the game was one of the top selling titles on the system at launch, but everyone and their brother brought up the lack of cartridge save as the biggest problem with an otherwise excellent game.  Never let it be said that THQ doesn't listen to the public, because the game's sequel, GT Advance Rally Racing, has been left 100% intact from the same design released last year in Japan (as Advance Rally)...THQ even offers the battery as a bullet point on the back of the box: ~Battery allows players to easily save games with no passwords!~  This release marks the first Game Boy Advance rally racing game on the system, and fans of the original GT Advance Championship Racing will find themselves right at home in this arcade racer. It's definitely one of the best racers for the Game Boy Advance so far, even if the game graphics aren't keeping up with the latest 3D trend on the system...it's all about the gameplay, and GT Advance 2 offers a lot of challenge and a whole lot of fun on the title's off-road tracks. Features 15 rally cars 14 stages, 42 different tracks Seven different gameplay modes Cartridge save Link cable support for two players Only for Game Boy Advance  ~The vehicles and parts in this game do not in any way reflect the design or physics of any of their real world counterparts.~ So says the disclaimer when powering up GT Advance 2 on the GBA system. Believe it. Neither MTO nor THQ are hiding the fact that this game is an arcade-style racing game...many gamers actually prefer the exaggerated action over simulation. And while GT Advance 2 offers a few sim elements such as car tuning between stages, the focus is on fast-paced racing with heavy emphasis on power-sliding.  The game's broken up into fourteen worldwide locations, each having three legs to each of the areas. If you don't come in at a certain position in each leg, you won't advance to the next race...so it's important to look ahead to see what type of surface each leg has. At the beginning of each race, you're told the track's condition, and it's up to you to alter your car's configuration for snow, mud, tarmac, or gravel conditions...if you don't put snow tires for snow tracks, for example, you're completely screwed. GT Advance 2 is extremely similar in design and feel as GT Advance, complete with the same car collection element after coming in first in each of the game's races. The game uses an upgraded version of GT Advance's graphics engine for the behind-the-car viewpoint. The original game used the Mode 7-style graphics technique to give the illusion of 3D...scaling and rotating the road texture in the same way that Mario Kart: Super Circuit and F-Zero: Maximum Velocity provided their viewpoint. Advance Rally goes one step further: through a nifty warping effect, the developers have been able to create hills and bumps in the normally flat road texture. It's not a perfect effect, but it does its job, offering a more realistic look to the game's 3D animation. The downside is that there's not a whole lot of objects on the road -- there are a handful of trackside obstacles that show up, but that's about it. But it's more friendly to the Rally racing design, since cars are realistically spaced out...they don't bunch up during any leg of the race.  To add a bit of variety to the game's design, MTO includes a few extra gameplay options, including a mode where players earn licenses by completing specific legs of races within a set amount of time. The hook: you cannot go off the road. When any of your tires leave the track, the challenge is over and it's time to restart. Early on, the challenges are a snap...but in the S class licenses, man, they're evil. Don't be surprised if you find yourself in this mode more than the actual races.  Because the game's using an updated version of the original GT Advance game engine, the music in GT Advance 2 is far from what you'd call ~impressive.~ The tunes are barely above what gamers got on the NES and Game Boy Color...because the developers are hitting the GBC soundchip on the GBA instead of dedicating precious processing power to the game's soundtrack. But, at least the sound effects are up there in quality...they're using the digital channel to some good use: engine noises, collisions and car crashes.  And yes, it's got cartridge save! Hallelujah! But for some strange reason it doesn't auto-save your progress...you have to remember to leave the race and go into the ~save~ option of the main menu. It's a bit clumsy, but it's better than the annoying password of the original GT Advance. There's no reason to import this game now...other than the fact that the Japanese version of this game hit shelves more than seven months ago. I'm definitely not oblivious to the fact that there are several other rally games heading to the Game Boy Advance, some of which really push the system hardware in directions it was never initially meant to go. Even with those titles in mind, I still recommend GT Advance 2 because it's an incredibly tight arcade-style racer. It's fast-paced with tight controls and a decent graphics engine...sure, it doesn't feature a nifty texture-mapped 3D engine that the future Rally games will offer. But what MTO created on the system is still pretty darn impressive, and a great game to get into.", "date": "Jul 19, 2002"}