{"name": "The Mark of Kri", "name_review": "The Mark of Kri Review", "ref": "https://www.ign.com/articles/2002/07/19/the-mark-of-kri-review", "text": "comes to gamers who, if they were diehard enough, have owned their PlayStation 2's for more than one and a half years (the PS2 launched in October 2000 in North America). It comes after one of the most unbelievable years of creative game output (2001), in which fans saw games such as Ico, Metal Gear Solid 2: Sons of Liberty, Halo, SSX: Tricky, Tony Hawk's Pro Skater 3, and Grand Theft Auto III, just to name a puny few. Introduced to the public this past spring, Sony Computer Entertainment America's The Mark of Kri, a homegrown beat-'em-up, combines elements that, to date, have been at odds with one another, and like the titles mentioned above, shares successful genre blending techniques. It's a relatively straightforward beat-'em-up, crafted in the lineage of games such as Final Fight and Golden Axe, yet it ascends the ideas first introduced in those great arcade titles by imagining a game deeply weaved with a story of good and evil, taking place in an imaginary world formed with ideas rooted in Polynesian, Aztec, New Zealand cultures. It incorporates numerous stealth, strategy, and fighting elements into a larger whole, and it's portrayed in an unrivaled hand-animated style by protges of Don Bluth and Walt Disney. With wonderfully adept production values and an eye for detail in both graphics and gameplay, The Mark of Kri is a genuinely, deceptively original creation thats deeper than it lets on to be. Perhaps the only problem with San Diego's baby is that it's missing a few basics that gamers have come to expect from this genre -- interactive backgrounds and most of all, bosses. Given the depth of and originality of this title for the most part, these factors don't detract from the genuine experience at all. But you never know how much you miss fighting bosses until there aren't any around.The Double TakeEver since his first visit to San Diego to see The Mark of Kri, my newest editor, Jeremy Dunham, has been slathering with extravagant adjectives and meaningful things to say about this game. As with any gamer who's been around the block a few times, I instantly recognized the symptoms of a man who'd been bitten by the hype bug (having been nipped a few times myself). His enthusiasm was too much -- too gooey -- for me. And so after a five-minute go with The Mark of Kri I decided he was nuts (actually, I decided that many moons before, but this reaffirmed my notions). Nice combo system, but where's the interactivity, the hidden secrets? Why is there only one path to follow? Pretty animated graphics can't make up for gameplay, I thought, and that was that. A few weeks later, I popped in The Mark of Kri to write the June Unplugged feature, and to my surprise, I realized I had played the game for too few minutes. I made a complete 180-degree reversal on my opinion of the game. I've told you this story is to illustrate one point: The Mark of Kri is deceptively brilliant. It's deeper than it lets on to be, but you have to give it a chance to show its depths. You need 10, maybe 15 minutes before things start really clicking. And then, once youre hooked, the game offers even more than you may have expected. You might surmise that once you've experienced a few three-man onslaughts, the rest of the game is exactly the same. Not so. The Mark of Kri slowly adds new elements of gameplay and depth in the most gradual of ways so that level after level you find something cool and new to do, some combination of stealth and fighting, or archery and strategy that you simply didn't think of before. And by that point, you're yet another level deeper into a game you once may have pegged as a simple, over-produced excuse for animators to go hog wild. I did, and it was my mistake.   GameplayThe Mark of Kri starts out as a beat-'em-up, offering gamers the ability to play as the giant, New Zealand-esque Conan-like warrior, Rau. Accompanying Rau is the familys sacred bird, Kuzo, a familiar who assists Rau by activating doors and ladders and reading ancient scripts throughout Rau's adventures. Kuzo is a strategic key, as he provides a bird's eye view, a first-person perspective, into upcoming dangers. But the game's main focus is its unique fighting system, enabling players to select a group of enemies by attributing face buttons to them (using R3), after which the player can then attack the encircling horde from any angle using various button combinations. Rau attacks enemies without having to face them, and the fighting system, which starts off by permitting three enemies to be selected, eventually enables players to select and fight off as many nine enemies at once. The combo system in the most interesting feature because it's primarily designed to create great group fighting experiences, while simultaneously eliminating the problem of camera orientation. It mostly succeeds. By using a targeting system for not one but multiple enemies, Sony's San Diego studio enables players to face forward but fight enemies behind, on the side, or in front of Rau. Designed to reward gamers for stealthy play, Sony's game enables Rau to sneak around enemy-filthy territories slicing off heads and piercing guards with arrows. Once your cover is blown, as it inevitably will be, and the swarm of thugs encircles you, Rau can block from any angle, and with a swing of his sword, Taiaha or axe, he can clear the location with a few swings to reorient his position.By all means, the fighting system is unique and innovative. Enemies can be selected in groups, or solitarily (press and swerve R3 to select enemies, or press R3 again to de-select them). It takes time to master, and honestly, it can be frustrating at times. It's not perfect. In between attempting to pull off combos, players must perform a healthy amount of button mashing to free up the possibility for one good combo. And, thwarting your slicing pleasure at all times, enemies try to block your attacks, so skill and timing must become a part of your ascent up the curve. It also requires a certain level of strategy. To get the system working really well, a healthy amount of time must be spent playing the The Mark of Kri. The combo system has some problems. The sword is a good sturdy weapon, but the damage it does grows old quickly. What's probably the most annoying and troublesome weapon in the game is also the most culturally significant one, the Taiaha (I know I'm going to some Polynesian hell for saying this, but). It's a limited weapon, and it should be more powerful. Great for clearing out big groups, it's slower and less effective against mid- to small-size enemies. As you wind up to swing it, smaller enemies quickly run in and jab, poke, and nibble at you. What makes using it less then desirable then is that switching from one weapon to another (like in most cases, the quicker sword) requires too much time in a fight, after which the animations must follow, too. Switching from weapon to weapon should have been implemented with a much faster scheme, such as using the shoulder buttons, the Dpad (to scroll through) or various other setups. There is nothing I can even find remotely wrong about the axe, my favorite weapon in the game, except for that it just comes too late. Once you get the axe, you'll never use the Taiaha or the sword again. The axe is an awesome, mighty tool that instantly butchers those creatures in its way. Enemies lose limbs, heads, and are quickly sliced in twain when this thing starts swinging.  It's so fun to use, it puts the other two weapons to shame. All in all weapon-wise, there should be more weapons in this game, and the ones in it, such as the Taiaha, should be more effective.The roaming camera, usually in the third-person perspective behind Rau, switches to a single-player view when using the bow, and in a group fight, it encircles the fight to provide the best possible view. On a few occasions the camera gets stuck to an object causing seconds of despair, but it happens rarely enough to avoid a bitter rant.  It's a better camera than in Spider-Man, but it's not perfect (and by the way, I have yet to find a camera system that is perfect in any game). After it shows you one side, this simple enough beat-'em-up becomes something else. A stealth game. The second level shows you how to take the brawny Conan-like brute, Rau, and transform him into the sleek, stealthy Solid Snake. Rau quickly learns single stealth kills, wall stealth kills, double stealth kills, and more. It's a brawler -- with stealth kills! Then, soon after learning these skills, Rau becomes a masterful archer. He learns to use a bow and arrow, which offers a game mechanic that works extremely well, perhaps better than any bow and arrow set up I've seen before. With the bow he can target an enemy's body or, with skill, the head, dusting him with a single deadly shot. After that, Rau learns to perform drop stealth kills, earns another weapon, the sacred Taiaha (a powerful spear), and later, perhaps too much later, he earns himself the all-powerful two-handed axe. With each new item and skill, The Mark of Kri grows deeper, almost entirely stripping itself of the simple premise of being a combo-heavy beat-'em-up. The Mark of Kri is weird at first because it seems like an action-adventure game that should pack bucketfuls of collectible items, secret paths, interactive backgrounds, and stuff of that nature. So, it may seem disappointing at first because there is little in the way of interactivity. But once it gets going, San Diego's Studios' intentions become clearer. Like a good stealth game, The Mark of Kri can be played at least a few ways, stealthily or haphazardly, or a little bit of both. But the more you pay attention to the strategic and stealth aspects of it, the more the game has to offer. In every level, there is at least one divergent path, subtly placed. In each, players can collect a handful of items, including a special scroll that rewards them at the game's end. I missed a few the first time through, later realizing their purposes. There are lots of items to unlock, too, ranging from additional outfits, bonus levels (mini fighting games), artwork, and well, more. The Time Challenge (kill nine enemies as fast as possible) and Body Count (slaughter as many enemies as possible within a set time) are good mini-games that open up as rewards, which indirectly build player skills.    GraphicsEven visually, The Mark of Kri is illusory. It looks like a Disney game, instantly feeding a person's internal perceptions with a kind of Trojan Horse code -- it looks cute, soft, harmless, thus entirely worth dismissing because it's for kids. But it's not. It's a slaughter house. How can a game that looks like a cartoon, a Disney cartoon, be cool? How can these two disparate sides of perception exist together? Like, I've been saying, this game is more than it seems. First, the design in influenced by artists who worked at Disney, but who also worked with Don Bluth, Warner, Dreamworks, Nickelodeon, Klasky-Csupo and other houses. As Jeff lead artist Merghart says, the style of animation comes from all sorts of places, as do the designs. It's hard to ignore the animation. Every single movement of the characters in The Mark of Kri was hand-done and the clean animation and the particular style is very eye-catching. The characters move with an extremely stylized, strangely bouncy behavior. It's great fun to see an enemy's armor smashed off, piece-by-piece by your axe, or when they show a different death animation, or when they crawl slowly across the landscape gasping for their last breath of air.The animation is the most noticeable aspect of the graphics. While simple, the textures are also elaborately designed and highly stylized. Each character close to Rau is tattooed with a set of Indonesian-style markings. What's more, these same kinds of markings permeate the entire game, sometimes reoccurring in the backgrounds, other times appearing in cut-scenes or loading screens. The characters are well textured, but simply so.Other aspects of the game are intriguing. The landscapes are beautiful, especially the first ones. The New Zealand-like jungles that appear first, followed by the tree forest, caught my eye with their structural layout and living atmosphere. There are also notable special effects such as huge fires, tons of blurring effects, the filter of Kuzo's eye through which players see, great smoke effects, and some nice particle effects, too. Perhaps the most unique aspect of the game's visuals, after the animation, is the artistic way in which each aspect of the story is told. Between missions, players watch as a blank parchment page is sketched in, as if stop-motion captured after every few strokes. The drawing unfolds before your eyes, filling with forms, faces, then details, filling, and finally color. Until the entire drawing is complete. Then as you wait for the final seconds of the next mission to load, the picture again transforms, this time from a 2D picture to a 3D scene, in which the drawing comes alive and you can then take control of it and play. This process is a masterful way of telling a story and useful way of filling in load times. In both regards, it provides a window into the artistry behind the game and the painstaking work that went into it.    SoundCasting a wide net for its graphic influences, the designers at Sony fished in a slightly smaller pond when they selected the music. What you'll hear is a combination of tribal drumbeats, accompanied by various flutes and horns, creating either two kinds of sounds: ethereal background sounds, or tense, high-powered drumming. What's cool about the music, like many games today, is that it's interactive with the gameplay. Whether you select a weapon, target an enemy, or are seen by an enemy, the game reacts with sound to your actions. The ambient sounds, especially the water and creature sounds, are notable, adding sufficient texture to the game's overall tone. One of the best aural aspects in  The Mark of Kri is the deep, resonant voice of the narrator, who explains the story, describes Rau's complex odyssey, and lends his wonderfully powerful baritone to the serious tone of the game. It's also a fun little game trying to find out who the narrator is in the game, a question answered at its end.As you can tell, I like The Mark of Kri. And in my humble opinion, it's the best beat-'em-up on the system. To be honest, there are few competitors. State of Emergency was a fun romp in the timed mode, but the mission mode was weak. Dynasty Warriors 2 and 3 are excellent, highly recommended beat-'em-ups, but I like the style and innovation of this puppy a little better, even if the game is a little shorter than those KOEI titles. Its designers are trying to do something better and different in the genre, and for the most part, they succeed. For that, they deserve a lot of credit. (*Hands designers golden credit statues*)Like so many games, The Mark of Kri isn't perfect. The camera isn't always where you want it, the weapon selection system could use some work, the weapon selection itself is small -- and could be much heftier with just one or two more weapons. And the weapons themselves all play second fiddle to the mighty axe, once you earn it. Also, Sony's game is a clear candidate for at least multiplayer combat. A co-op mode, a four-player session, and more mini-games would have greatly added to this already excellent game. Perhaps it could have been a little longer, and it certainly, definitely, most assurredly could have used bosses. Still, I have played through this twice, and I have loved it for much of June and July. That's saying a lot given the loads of games that come panting at my door. It's a great selection for your PS2 library, and it's got enough replay value in it to play it at least twice, perhaps even three times.", "date": "Jul 19, 2002"}