{"name": "Stuart Little 2", "name_review": "Stuart Little 2", "ref": "https://www.ign.com/articles/2002/07/22/stuart-little-2-4", "text": "You can't avoid the younger-skewing games on the GBA...parents want to make sure they have the option of buying a safe, non-violent title for their kids, and the Game Boy Advance will always have its fair share of these games...especially when they're based upon a family-friendly movie like Stuart Little 2. Activision's take on the film isn't for the die-hard gaming public by any means...but because of a few sloppy design implementations it might not be wise to put this in the hands of a youngster, either. Unless, of course, you want your system to end up in a few dozen pieces after it's hurled against the wall in a frustrated tantrum... Features Ten levels Four unique styles of levels Link cable support for two players (multi-cart) Password save Only for Game Boy Advance Stuart Little 2 is an action game based upon situations in the movie currently out in theaters. It was developed by Creations, a team that's not unfamiliar with children SKUs on the handheld format...these guys were responsible for several Rugrats games for THQ. It's obvious that they've learned from their past mistakes (making password saves as easy as possible, for one thing), but on the other hand, they're still making the same mistakes when toning down their game designs for who they assume are the ~target audience.~ I think what happens is that when developers work on a younger-skewing game, as they focus on making the game as simple as possible, they lose sight of the little elements that can and will throw frustration into the gaming experience. Stuart Little isn't a terrible kids game by any means, but it definitely has quite a few little hanging threads that unravel the game's enjoyment.  Case in point: the level where players must lower Stuart into a drain via a fishing wire. This challenge only requires the skill of shining a flashlight in eight directions in order to scare away creepy spiders before they touch Stuart. It's a simple challenge for the young crowd, but there's one real problem: the collision detection is absolutely horrendous. Some spiders don't react to the light at all for whatever reason, and since you're constantly on the move, there's no way to avoid getting hit. This little programming flaw makes a simple game a frustrating challenge, especially since the drainpipe seemingly goes on forever.   Flying around on the plane is a test of trial-and-error. The object is to simply zoom the plane around in a side-scrolling environment, flying through rings and avoiding objects...but players will have to dedicate their first life to judging how close they can fly near shrubbery and other obstacles that line the course.  And then there's the driving level. This is probably the coolest mini-game in the group, but it's still a bit too complex in its simplicity. One of the most irritating elements is how the game just stops and resets if you happen to drive in the wrong direction for longer than two seconds.  The other remaining levels utilize a simple platform design, where Stuart must run around collecting items by crawling, pushing blocks, zoom around on a skateboard, or walk through holes in the wall. These levels are the least hazardous on the frustration levels of the little kids, but there are points in the challenges where it's difficult to tell where you need to go or what you should do. After a bit of trial-and-error it becomes clear, but still...for a kids game it's not very cut and dry.  Creations' inclusion of a two-player link cable mode is definitely welcome, but even here it feels a bit half-assed. Players can either choose The Little Prix (snicker-snicker...I can't believe no one caught this little misnomer) and race three laps in the driving engine, or race as Stuart vs. Margalo in a simple platform level. These challenges are sloppily implemented, as they don't offer any sort of briefing before the challenge, and they just end abruptly when one player accomplishes the set task. No fanfare, no congratulations...no nothing. I fear reviewing these ~younger~ games because, in all honesty, I sometimes get more frustrated playing these games than the ~for everyone~ titles like Super Mario Advance. These games are meant to be easy, but I always manage to find little things that make the game not-so-fun to play. Stuart Little 2 has a decent set of engines that offer a lot of variety in the gameplay, but each of the levels in the game has some little quirk about them that makes you wonder if these guys even gave the game to a member of the age group they're aiming for. But one thing's for sure: if you're older than eight years old, you shouldn't even think of playing with this mouse.", "date": "Jul 22, 2002"}