{"name": "Rock Manager", "name_review": "Rock Manager", "ref": "https://www.ign.com/articles/2002/07/25/rock-manager", "text": "I'm mad as hell and I'm not going to take it anymore! It's time the games industry perked up and took notice. There's a plague of extreme proportion descending upon us, choking the very shelves that we look toward for fun, entertainment and merriment. I'll be blint...there are too many damn mediocre tycoon and manager games on the market, so stop it! You can't go two weeks without seeing something like Button Administrator or Boob Tycoon. Stop churning these second-rate titles out, slow down and make them good!   Now that I got that out of my system, I guess it's time that I tell you about the next in the long line of mediocre manager games...Rock Manager. As you've probably guessed from the title, Rock Manager put you in charge of a band, supervising their every move from formation to booking shows to promoting their albums. It's actually a pretty neat concept for a game, and like true rock, one that doesn't take itself too seriously.  The entire game is built in Shockwave, which as you hopefully already know just isn't the best engine for a videogame. It combines the three-Cs: clunky, choppy and chunky. Even though it's not a system-intensive game in the slightest, the numerous CD accesses mean that you'll have to deal with constant pauses and stutters. This problem is only compounded due to the wonky interface, which occassionally leaves you searching for the exact space on the building to click to access it. Sure, you get it down after a few minutes, but it's an annoyance that would have been easily overcome by making the entire building that you want to access (recording studio, design department, record shop, radio station, what have you) clickable.  The game itself plays out through a series of nine objective-based scenarios, but there's not much to any of them. The individual scenarios are very short, around 20-30 minutes each, and just when you're really getting into your band, it's time to move on to the next objective, which generally means you have to start all over again from scratch. This is a pity as I'd like to just create a band and stick with them throughout a career. Given the brief scenarios, the entire game can be beat in about three hours, and there's no real incentive to go back and play the game again since it's all mission-based and there's no real open-endedness to the experience.    What did you think of Rock Manager?  As limited as the game is, it does look pretty good. Everything is rendered in 2D, but it's a nicem clean cartoonish style. For the most part, the building interiors are static hi-res images, while the cityscape itself where you spend most of your time clicking from building to building is highlighted with a few animated touches. The characters look nice enough, and each has a lot of personality.   One thing that you would expect the game to have is good sound quality. Unfortunately, that's not the case. While the development team went to the trouble of making three tracks for each instrument that fit together to form a complete song (actually about 20 seconds of a full song), the sound quality itself is lacking. There are occasional pops and buzzes in the mix, and it's not based on the quality of the recording studio you use because it's there in all of the songs.  One thing that the game does have is a lot of style, which is especially evident in the voice acting, which is very well done, and it goes a long way in making the game interesting and shaping the personality since there's not much in the way of moving visuals to check out. The humor is actually funny, and a bit on the blue side, which is what rock 'n' roll is all about! Rock Manager is a good idea with a lot of character that ultimately ends up being enjoyable for only a few minutes. I liked the concept and I think the team could have done a lot with it, but it just doesn't rock like it should...it's more of a polka.", "date": "Jul 25, 2002"}