{"name": "Stuart Little 2", "name_review": "Stuart Little 2", "ref": "https://www.ign.com/articles/2002/07/30/stuart-little-2-3", "text": "Kids' games are bad news -- these are the games that should be the most fun since the target audience is so excitable and enthusiastic, but the end results are usually either so poor or so frustrating (and often both) that they give gaming in general a bad name. But it really doesn't have to be that way. In fact, kids are usually the easiest audience to please. The gameplay, graphics and design don't need to be mind-blowing or revolutionary -- they just need to work right. Stuart Little 2 is pretty much a spot-on example of how to do it right: not one platform in the game will be new to veteran gamers, but kids won't care about anything but how playable it is for them.  Gameplay  I'd be very surprised if there are still kids in America who haven't played a videogame before (or that their first gaming experience, in this day and age, would be a PS one game -- a big kid-friendly PS2 ad in the manual shows that even Sony knows kids need to be next-gen babies.) However, for the few novice gamers that may exist, Stuart Little 2  is all set to be their ~Teaching Game~. Even though much of the game is the same Mario 64 that we've been playing for five years now, there's still a training mission that even shows you how to jump. From there, you take baby steps into a platforming world that you'll never get lost in (since every stage is either one sort of boxy room that dead-ends your path or else features a loop that leads back to another portion of the stage), platform challenges that you can skip if you find them too hard at first (you'll be coming back once you don't have enough trinkets to continue on), and a challenge structure that encourages you to never quit.   Don't get me wrong -- the game is competent, but it's not exactly extraordinary (though nobody really expects a kids' game to be brilliant), and it's certainly not perfect. As is often a problem in a 3D game, the camera has big problems getting around walls and objects -- only a minor problem for the few times it matters. The control is usually tight, but it's sometimes awkward in grabbing stuff. The standard invincibility after a hit is too short, so you could get bopped again and lose all your life before you've had a chance to recover. And -- a big bummer -- respawning enemies become frustrating and cheap, especially when they respawn too close and too soon.  You could knock an baddie out on the way through a door, decide you didn't want to go that way, turn around and get thwomped by the enemy you just killed. Other times, you may rid yourself of an bug to start a platforming challenge, only to have him respawn right when you're in the middle of it all.   But for me, a lot can be forgiven in a kids' game if it's simply fun to play all the way through. Magenta Software may not have the crafty chops of some of the pros that Sony has turned to in the past for licensed kiddie games (the studio's most notable game before this was PSX Muppet Monster Adventure from a few years back), but those games usually ended up being over-designed. Stuart Little 2  is a kids' game, and makes no bones about it. The mini-games are tight and simple (although some are strangely unbalanced in early levels, but maybe that's to get kids to come back later) and the main game is tight and breezy. I wish games that take after Mario so obviously would learn a few other tricks in his bag -- Mario seems to be much easier to land on platforms or even high-wires than other gaming heroes -- but Stuart learned the basics pretty well, and he's eager to teach them to young gamers.  Graphics  While I'd never say that graphics in kids' games don't matter, all you really have to do is get a character and game world up on the screen that looks like their favorite character and you're more than halfway home. Flashy effects, infinite draw distances and crisp framerates aren't a big concern for kids (except, of course, if they bite into the playability), but Stuart Little 2 has them all. It's also got large, expansive, platform-packed game worlds that need only one load (and a zippy one at that). Outdoor spaces look cheap since the game engine is made for making rooms (Central Park looks like you're inside a big open-roofed room with tree pictures painted on the walls), but levels such as a kids' bedroom complete with bunk beds to scale make you feel like a really small hero inside a gigantic world. Even so, the visual style still can only be described as workmanlike at best. It's nothing stellar -- just very colorful. Stuart looks good, but the rest of the world is blocky and simply-textured. For the most part, not a problem as far as kids are concerned. It never looks great, but it looks right.   There are a few areas, however, that really seem uggie even for a kids' game. The biggest complaint would be a strange ~Disco Walls~ texture swapping problem. To get the long draw distance, the engine takes off the textures, then subs them in as you get closer with a strange algorithm that paints them in by tile unevenly across the surface. It looks just like that effect you see in old disco videos or mocks that fade the image in squares across the screen. It's a little funny to watch, but it certainly isn't very real. The engine does strange things with the PS one every now and again that make the system look 10 years older than it should -- the speedboat stage especially looks so much like a SNES game that it's frightening. There's also the FMV quality, which is terribly grainy and colorless. It looks like they compressed clips of the rough cut instead of the actual film. And, worse than the quality of the FMV is its arrangement -- what the heck is wrong with the knuckleheads at Sony that they can't get such simple things right, but the FMV clips play out of sequence from the film and don't at all go with the story. You see a clip 2/3s of the way through the game where you meet (for the first time) the little birdy who's been your friend since the beginning of the game.  Sound  As far as the FMV being off the workprint instead of getting taken directly from the film, there are some good things in this. Since the clips don't seem to have been taken directly from the film, the clips don't end abruptly when the scene ends. The clips also don't have music playing all over the dialog, so you can actually listen to what you're watching. That's been a bug in a good deal of the kiddie games I've played, and it's refreshing to enjoy the FMV clips here since you can pay attention, rather than just skip them because they're so horribly chopped up and senseless in most games. The only gripe is that the dialog seems temped as well, and often you can hardly hear characters.   In-game, the sound doesn't add a lot to the game besides a constant cartoon music soundtrack (repetitive, but it fits the colorful circus-like visuals) and pathetic yelping sounds from Stuart (some sound effects don't even sound like they're supposed to be in the game.) Again, nothing stellar or distracting on either side. The one thing I really was impressed with, however, was the voice actress for Stuart's bird-friend Margalo -- her voice is always encouraging and energetic, and even the awkward lines that give instructions for playing the game come off natural. Just a few weeks ago, Sony bummed out more than a few kids with Lilo & Stitch, an average kids' game that was frustrating. Now they've got Stuart Little 2  on shelves right next to it, an average kids' game that's not frustrating. For me, the choice is easy -- get your kids the game that's fun. Think little.", "date": "Jul 30, 2002"}