{"name": "NFL Fever 2003", "name_review": "NFL Fever 2003", "ref": "https://www.ign.com/articles/2002/08/02/nfl-fever-2003", "text": "It's hard to understand the thinking behind NFL Fever 2003. On the one hand, conventional wisdom says a powerful first party football game is a crucial part of a videogame console's launch. But then again, gamers want to know that first party game is going to continue to grow and improve over the years. Because it launched with the Xbox last November and took advantage of the hardware in ways EA's Madden 2002 and Sega Sports NFL 2K2couldn't,  NFL Fever 2002 gave the impression it could hang with those two established franchises and play with the big boys.   With Fever 2003, even with it's highly anticipated Xbox Live online multiplayer component, we have the perfect example of why the standard for football games has to be raised every year. In a nutshell, Fever 2003 still does everything well that it's predecessor did, while merely applying bandages and not true fixes to the things it's predecessor didn't do well.   Gameplay  It's a football game so you can do all of the tackling, running and passing any decent football should allow you to do. But when held up to its competitors, Fever is still lacking the synch between the animation, collision detection and overall football mechanics that it needs to have if hardcore football fans are going to take it seriously. There's the same kind of identity crisis that we saw in last year's game where Fever 2003 is uncomfortably straddling the line between football simulation and arcade football. There's nothing wrong with leaning towards the arcade side of the NFL experience, but you've to have a lot more nutty and wacky flavored fun in there if you're going to go that route. But then again, there's a reason why every attempt to tread on NFL Blitz' territory has failed.   The animations in Fever are well done from top to bottom, it's just that there's not enough of them to fully capture all of the action and intricacies of an NFL game. This leads to the same gameplay problems we saw in Fever 2002. Here's what we said in the review of that game: For example if you've got Kurt Warner, Isaac Bruce wide open near the sideline and your eyes and veins are bulging at the chance to stick it to the defense, you're thinking ~let me rifle this ball in there like a Randy Johnson heater.~ So you mash Bruce's button as hard as you can and Warner proceeds to lob a perfect spiral up into the stratosphere. You're thinking ~$%(@$, why the hell did he do that?! It's gonna be picked off now!~ The entire defensive backfield is converging on Bruce's position like honeybees to a Lifesaver as the ball takes what seems like 10 minutes to get there. Yet, even without you taking control of him, Bruce makes the catch with a crowd of defenders around him, and he's dropped to the turf immediately. A 33 yard gain with no yards after catch is good, but not what you had in mind.  It's the time it takes for the players to get into and out of different animations, say running to catching, that throws off all of the timing. Even when you see Isaac Bruce is going to be open and you time your throw accordingly to hit him stride there's a lot of other stuff that happens between the time the ball is released from Warner's hand and it arriving down field. It makes the whole sequence seem unrealistic enough that you're thinking ~okay, it's a videogame, not real life.~ But, and this is the most important point we can make about the game, overall, the football engine of  NFL Fever doesn't recreate the essence of NFL football as well as other football videogames available for the Xbox. If Fever were unlicensed or a CFL game or something like that, it would be a different story.   It doesn't help that for two-player animations, the collision detection fields are so large that blocks or tackling sequences seem to begin even before the guys are within range of each other. Too many times you'll have a ball carrier with what looks like plenty of space to make a move, only to have that juke or stiff arm or spin squelched by a defender who's suddenly all over him. Again this something gamers can adjust to, but all of these little graces you give Fever 2003 begin to add up. We got to a point where we were wondering ~well, what can we expect from an NFL game?~  The emphasis on the big play is alive and well in Fever 2003, juts like it was in its predecessor. By big play we mean nearly every passing play in the game can be considered a money play. Sticking with the same play throughout a game is the kiss of death at every level of organized football, from the NFL to pickup games in the park to finger football with a classmate. But in Fever 2003, it's no problem to have a receiver with a stat line that reads: 6 catches, 387 yards, 64.5 yards per catch and 4TD. While Al Davis probably wouldn't have a problem with this, it really isn't good football. This is because at any difficulty setting you can make any play successful when you put your mind to it. When you know you can complete 10 passes in a game and seven of them will be for touchdowns you skill is an option, not a necessity. On defense it's not uncommon to have 2-3 interceptions PER TEAM over the course of the game. Fumbles and tips that become interceptions can often happen on the same play as one of those interceptions.   The pass defense mechanism was improved but only slightly. The corners and safeties won't be caught out of position like they were in Fever 2002, but they do have a lot more closing speed so that if they within range, they'll be able to make a play a little more often on long passes. I say a little more often because if you're smart you'll easily be able to figure out pass plays that catch defenders hopelessly out of position with no chance of recovery.   The biggest enhancement to Fever's season mode is that the Dynamic Player Performance Model is featured more prominently. Your players will develop and change over the course of a season and the DPP system shows you from game to game how they're doing. Now, instead of digging through menus after or between season games the DPP chart pops up right after you finish a game so you get the immediate results.   Online Play  Be sure to check this space later this fall, when we'll have a more comprehensive write up on the Xbox Live component of NFL Fever 2003. Our limited experience with Fever's online multiplayer isn't enough for a full evaluation just yet. We've played it under controlled conditions but we have to try it the same way the game buying public will experience NFL Fever 2003 on Xbox Live.  Graphics  The players in Fever 2003 still look good with detailed faces, uniforms and brand new waist towels that flap in the wind. The stadiums are populated with some of the better crowds you'll see in a football game and the buildings themselves are still accurate down to the cheerleaders and wannabes milling around the sidelines. However, in terms of the Fever's evolution in graphics, what was very impressive last year is simply par for the course on Xbox this time around.  We touched on the problems with animation earlier and the problems they present in gameplay.  The limited animations mean that you'll see the same tackle over and over again.  You'll see the same receiver plays on the ball. You'll see the same trench fights between offensive and defensive linemen over and over again throughout the game. When a linebacker tackles a ball carrier it looks the same as when a lineman tackles a ball carrier: they're both running and then all of a sudden the defensive player is lying flat arms extended on top of the offensive player. You get the shoulder shrug move to break tackles but when the guy is eventually tackled, the defensive player is suddenly lying flat arms extended on top of the offensive player. There are two running animations for every single player: running and not running. A lineman runs the same as a wide receiver, he's just got a bigger belly.   The idle and celebration animations for the players in Fever is impressive enough that it only makes you wish more attention had been paid to the gameplay animations so that we'd see more variety game in and game out. When an offensive and defensive lineman are engaged and the O-lineman has the advantage this simply means the defensive lineman can't move. There's no handfighting or wrestling going on. If the defensive player is going to get to the quarterback it's basically going to be on a straight shot because the offensive line runs a scheme that doesn't block him. This is the case for both CPU and human controlled defensive players.  Again, what was impressive last year merely makes for a functional football game this year.      Sound  Kevin Colabro and Ron Pitts are your game announcers and their chemistry is noticeably better than what Pitts and Dick Stockton had last time around. This is because Colabro's comments flow at least 50% smoother than Stockton's, even though the two have extremely similar tones. There's no strange robotic inflection when Colabro mentions a player's name like ~LEVENS?up?the middle.~ Must be his training as a hoops announcer that makes his football announcing so much better. Ron Pitts on the other hand still has some pretty lame things to say as the color commentator, but at least this year his words are more relevant to what's happening on the field.   There's Dolby Digital Sound and the subwoofer and center channel are kicking so that means 5.1. The stadiums are alive with the sound of those colorful well coordinated crowds. You get the roar of the home fans and the public address announcer rumbling important information in the background complete with echo effect. The little music interludes between plays are a nice touch. The blocking tackling sound effects aren't as robust with bass as we'd like but they're adequate. Our Cambridge Soundworks DT3500 setup isn't much, but it would know how to reproduce the thump of a bonecrushing hit if it was there. NFL Fever 2003 comes up short because it's not making the leap from one year to the next that I expected. Yes its predecessor was the top selling football game on Xbox and it's the only game built specifically for the system, but the facts are the facts. EA's and Sega Sports' 2003 football offerings are both making bigger leaps over their 2002 counterparts and both deliver a more complete NFL experience than Microsoft's in-house developed football game. The only reason I'm so acutely aware of what Fever isn't doing is because I've seen what NFL 2K3 and Madden 2003 are doing in terms of gameplay. Fever has the visuals to compete with the big boys, but improvement is needed in every other area of the game.With that said, the online component will add tremendously to Fever's overall value even with all of its warts. For fans that don't mind the loose, semi-arcadey gameplay of this football sim, taking the next step with Xbox Live should be pure heaven.  Nothing promotes trash talking like football and with the Voice Communicator and a willing competitor far far away, Fever fans will be getting the ultimate multiplayer experience. But even in this area, Fever faces stiff competition from Sega's Xbox Live compatible NFL 2K3. Like the Cincinnati Bengals or some other downtrodden NFL franchise, Fever 2003 does very little that its competitors don't do better.", "date": "Aug 2, 2002"}