{"name": "Aggressive Inline", "name_review": "Aggressive Inline", "ref": "https://www.ign.com/articles/2002/08/05/aggressive-inline-2", "text": "When it comes to extreme sports freestyle videogames, there is Tony Hawk's Pro Skater and then there is everything else. Or at least that's the way it's always been. But development studio Z-Axis, which delivered a formidable entry into the genre with its Dave Mirra Freestyle BMX 2 has refused to be labeled second best and its latest effort may have finally succeeded in dethroning Activision's now-classic series.  Aggressive Inline, a game in which players stunt inline skaters through fantastically expansive 3D worlds, is an epic freestyle project complete with massive, skateable levels that change and react dynamically, addictive character enhancement functionality and tons of tricks and air possibilities, all brought together by an amazingly efficient engine with the ability to output some impressive visuals to boot.  It's not a game without flaws. There are traditional problems here, including a sometimes unpredictable camera and some initially hard to master control configurations, but it's certainly a big step in the right direction. The end result is a freestyle effort that no GCN owner should go without.  The Facts  Fast, freestyle-centric inline skating Seven gargantuan worlds 12 playable inline skating pros and seven hidden characters Expansive trick system Dynamic attribute system that reflects the skill of players in-game Multiple gameplay modes from Career to Freestyle Multiplayer mode Detailed level editor Impressive 3D engine draws huge worlds filled with activity Landscapes change on the fly depending on player interaction Runs in progressive-scan mode   Gameplay Aggressive Inline is very much an evolution of extreme sports skating games in general. The title is quite obviously influenced by the Tony Hawk series, just as it is the Dave Mirra one. That's okay. These are great franchises to reflect upon and Z-Axis has done so wisely, taking the best from both and injecting new additions on top of everything else for a remarkably well balanced, satisfying skating experience.  The premise of the title is simple enough -- there is no need for a storyline or any of that nonsense. This is a title about pure gameplay mechanics, modes, and options. The play is straightforward, following the traditional layouts of the genre with a few unexpected twists for good measure. Players pick from one of 12 initial pro inline skaters, and then go off into a Career Mode, which is basically the meat and potatoes of the game, or a Freestyle area, which enables trickers to explore levels and try out moves and combos. Freestyle mode is otherwise unchanged from Career, which gamers will no doubt spend the majority of their time.   All of the seven levels in the title are filled with different challenges, each worth a point value. For instance, players might be required to grind a series of rails or earn a certain amount of points in a restricted time limit. Some of these challenges are easier than others. Some also have a profound impact on the layouts of the worlds. Completing specific tasks in each area will trigger scripted events that dynamically transform the level. If a player shreds a group of wires holding up a steel ball in the Civic Center stage, for example, the structure will then fall apart and the ball will roll along the crowded city street, an accident that in turn causes a nearby bus to crash and splinter into a semi-half-pipe. It can then be skated as part of a new challenge. All sorts of other triggered events add another level of unpredictability and freshness to the game's already addictive mechanics and control setup. These scripted scenes, no spoilers from us, always seem to result in another challenge and a new skateable locale, and also make for a very entertaining break from the action. In addition, they click in a way that will make players say, ~Oh, I get it. That makes sense.~ Plus, because the areas are ever changing, presenting new challenges and areas, the worlds themselves never lose their draw and appeal. This is absolute top design. Very well done. Although some of the challenges are, excuse our limited French, a pain in the ass.    Transforming levels or not, the game would still fall flat on its face without some fun, intuitive control mechanics to boot. Luckily, it delivers. True enough, Aggressive Inline seems a combination of configurations from Tony Hawk and Mirra, but then again these are tried-and-true setups, so we can't really blame Z-Axis for capitalizing on them. Players control their skater of choice with the analog stick or the D-Pad. The GameCube's D-Pad is a miniscule thing, which works against the configuration. Gamers who insist on using it for movement and tricks are in for some initial frustration, but though not ideal, it can be mastered with some practice. In our experience, the analog stick, believe it or not, has worked just fine. With it, gamers can skate their character about the levels, pressing up and down, or vice versa, to perform and hold manuals. A jumps, B (in combination with the analog stick) performs various in-air tricks from grabs to spins, flips and more; X is used to grab onto poles, vault over objects or to skitch on the backs of vehicles; and Y, in combination with the stick, executes various grinds -- a very important part of the game's play style. Meanwhile R and L are used for sharp turns and the Z-trigger for cess slides, turns that can be used to link manuals off ramps and continue point combinations. The fact that the Z-trigger is used for such a primary function is at first a little daunting; indeed, many Cubists will probably not like the mapping, but again with enough practice one gets the hang of it and it becomes second nature. Similarly, we've encountered some problems attempting to successfully manual at all -- a problem more a fault of our own, as the adjustment process has not always been an easy one.       Overall the mechanics are a triumph. If players can dream it, they can probably do it. There is more freedom of control in Aggressive Inline than in any other freestyle game we've played, an absolute feat considering the competition. Just about every object, piece or obstacle in the levels has a place and a point, whether they are there for the grinding, the vaulting, the skitching, or just as a gap to connect combinations. Like so many other freestyle games, there is a massive, tangible learning curve. Even gamers seasoned in the play styles of Tony Hawk will have a challenge linking moves and amassing big-point combos, but after hours and hours they will be pulling off moves and links that they didn't think were possible in their early play experiences. It's these type of advancements that make the setup so appealing to both novices, for the sheer joy of tricking and exploring the levels, and pros, for completing all of the many challenges and nabbing the big, big points. Replay value, for this reason alone, is practically immeasurable.   But supposing all of that isn't enough for the hungry gamer, Z-Axis has also included a brilliantly unique character attribute system that will have the RPG fans in all of us playing into the wee hours of the night. Each skater features attributes for jump, speed, spin, grind, manual, fakie and wallride, all of them starting at level one of five. It's up to players to build their skater's abilities, which in turn then have a direct bearing on how they perform in-game. But it's a process that's not as simple as amassing a bunch of points and then buying attributes at the end of each level. Rather, attributes can only be increased by the skating performances players give. So, if a particular gamer grinds at every chance but is afraid to manual, his grind level will eventually go up, but his character will always be an underachiever in the manual department. Only by practicing in every area and trying to complete the goals will a player's attributes be fully balanced. The great part is that these attributes increase on the fly in-game, sometimes in the middle of combinations, and then slightly alter the way a skater behaves. It's very deep -- very addictive; indeed, players will really be drawn to try everything so that their player gains in abilities. If every freestyle game offered a similar attribute system, the world would truly be a better place.  There is a lot of variation to be had in Aggressive Inline. Just one of the seven levels in the game is enough to keep gamers busy for hours on end. From a Hollywood lot complete with a haunted house theme to an industrial plant with rolling belt and robotic arms, a cannery, and best of all a boardwalk filled with amusement park rides and more, there is so much to see and do it's amazing. The sprawling levels are complemented nicely by a host of animated objects and of course, dynamically changing layouts, as we detailed above. The package is very complete. That's not to say that it's perfect though. Some of the areas are better than others, with more scripted events and more graphic draw.  Rounding everything out on the gameplay side is a fun, well-designed two-player split-screen mode. Here, gamers can play against each other in several different modes, from a competition to see who can score more points in a select time to who can amass the most points for a single trick. There is a mode in which players skate to and collect cards, trying to score 21 without going over. There is an egg hunt mode. There is also, of course, an option to collect animals -- here skaters can be seen roaming about with hollering monkeys atop their backs, a fact that is surely worthy of the videogame equivalent to the Nobel Prize, so far as we are concerned.  Graphics Dave Mirra Freestyle BMX's 3D engine defecated all over the technology in Tony Hawk's Pro Skater 3 and Aggressive Inline stretches the gap even further. We're not exactly sure how the guys at Z-Axis manage it -- perhaps they never sleep or maybe they are related to the Germans at Factor 5 -- but they know how to make the most of hardware. To this end, each level in Aggressive Inline seems to stretch into the distance forever, and yet locales are still filled with geometry, from skyscraper buildings to trees, cars and busses, railways, people, plants, stairs and crates, industrial mechanisms, and much, much more. Z-Axis has also managed some fairly impressive particle effects, from the excessive blood splatters when a character bails to the grinding sparks that spray about as they tear up rails and other areas. There are even some basic character shadows that stick with the players and change across landscapes. There are similarly reflections, transparencies and more, all of which serve to highlight some of the window and water additions in the title.  The player models themselves aren't the prettiest things we've ever seen, though some of them are more impressive looking than others. They come across as decidedly low-polygon in nature, with acceptable but not superior texture work. The animation usually gets the job done. Grinding looks great and has a certain satisfaction to it, too. Some of the flips, spins and other tricks are very fluid and lifelike. Others still are less realistic, sometimes more awkward in nature than anything else. Perhaps this has something to do with keeping with the speed of the action, which would prove to be a forgivable, if not commendable sacrifice on behalf of the development team, but it's a noticeable shortcoming in parts all the same. That's not to suggest that any of these models or animations are ugly as this is also not the case.    There is a tangible style to the game for sure. The blue screen backdrops in the Hollywood Lot, the mechanical robot arms in the Industrial level, the giant purple octopus ride in the Boardwalk, the massive overhead railings in the Cannery, or the skateable dinosaur bones in the Museum -- it's all decidedly over the top and fantastical. It's colorful and slightly comical. It doesn't take itself too seriously and this works. For the most part, these levels look great.      There is some very good news for GameCube owners, too. From a visual standpoint, the GCN version of Aggressive Inline is far more defined and fluid than its PS2 predecessor. The title not only boasts crisper textures and more filtering, it runs at a constant -- absolute and without fail -- 60 frames per second. This is a feat made all the more remarkable given the size and complexity of the levels, not to mention the pace of the action being presented to the gamer at any given moment. Indeed, the GCN and Xbox versions of the title are identical from a graphic standpoint. Even better, the GameCube version features a progressive scan mode for gamers with capable display setups. Another big hats off to Z-Axis for caring.  Sound The audio portions of Aggressive Inline are a mix of popular punk and thrash music, realistic sound effects and humorous voice contributions from non-playable-characters. The music tracks featured include everything from Sublime to Reel Big Fish, Black Fish and P.O.D., all of the contributions fitting enough for the style of game, yet no cut particularly new or fresh. Many of the songs featured have in fact already come and gone as radio and video hits, but that's okay as they're still catchy enough to keep us humming in short bursts. The sound effects, particularly some of the skate and grind noises, are right on par and as a result very entertaining and satisfying. When a player grinds a wooden rail versus a metal one there is a noticeable audio difference and it's very rewarding.  Meanwhile, some of the voice acting, totally over the top, takes a cue from some of developer NeverSoft's contributions from past, attempting to be both funny and corny. Usually it succeeds, which in of itself lends a kind of cool, hip atmosphere to the game that lets the player know that the studio behind it has a sense of humor. All in all, not too shabby.I have long been a fan of extreme sports skating games and Aggressive Inline, for me, is the absolute best entry into the genre yet. The title just has it all. A deep, intuitive control scheme mingles wonderfully with gargantuan levels filled with challenges. As players advance, so do the levels, changing on the fly to reveal new challenges and more trick and air possibilities. On top of everything else, there is an amazingly inviting character attribute system that truly challenges gamers to keep playing -- to keep trying new and different tricks in order to build up their skater's abilities in each different area. It's fun -- pure and simple.That's not to say the game is flawless -- it's not. There are some visual shortcomings, from low-poly characters to some awkward animation and some out of control camera instances, but for the most part it performs quite well. Add in what is probably the most impressive 3D engine for any game of this type, enabling some very pretty graphics to boot and at a very fast 60 frames per second, and I don't think gamers will be able to resist falling in love.My highest recommendation. Every GameCube fan should check this game out at once.", "date": "Aug 5, 2002"}