{"name": "Smuggler's Run: Warzones", "name_review": "Smuggler's Run: Warzones", "ref": "https://www.ign.com/articles/2002/08/12/smugglers-run-warzones", "text": "With the advent of next-generation consoles, developers are able to continue to push the technical barriers forward. There's this industry mantra that goes: graphics don't matter. As noble of a philosophy as that is, we all know it's not true. In the broader sense, more advanced visuals mean you're able to do more in the gaming world, because everything you see is a part of the interactive experience.    With this in mind, California-based developer Angel Studios set out to develop a landscape engine that could draw huge, wide-open environments on the fly. The company began its work on the PlayStation 2 several years ago with the creation of the off-road driving franchise Smuggler's Run, and has since upgraded the technology for the sequel Smuggler's Run 2: Hostile Territory, also on PS2. Now, Rockstar, most famous for publishing Grand Theft Auto III, is bringing the improved semi-sequel Smuggler's Run: Warzones to GameCube. Featuring a new vehicle, more countermeasures, four-player support with all-new modes, and optimized visuals, this is undoubtedly the best in the series yet. Equally notable is that Warzones is the only of its kind on GameCube, delivering a mission-based off-road driving experience, complete with support for some frantic multiplayer. In short, it's worth a look by most every GameCube owner, and certainly by those who have never experienced the series.    FeaturesSeemingly endless off-road driving  Choose from several different modes including Smuggler's Missions, Turf Wars, Checkpoint Races, Joyriding, and Extras  Lengthy single-player mode provides 36 different story-driven missions  Story unfolds in a number of intentionally tacky cut-scenes, complete with real-life actors  Five huge maps to explore include N. America, Vietnam, Russia, and more  More than eight different vehicles to choose from ranging from the all-terrain Buggy to the sturdy, but quick, military trucks  Use a number of different countermeasures to take deter opponents  Enhanced enemy AI for a more realistic experience  Updated 3D engine customized for GameCube churns out gigantic landscapes at 60 frames per second  Advanced particle effects bring snow, rain, and fog into play  Licensed soundtrack includes songs from labels such as 430 West, KMS productions and BluePrint records  Two- and four-player support  High scores are saved to memory card  Supports progressive scan for HDTVGameplay  Smuggler's Run can be summed up very easily. It's the biggest, most wide-open driving out there. The creators built a game engine that brings a convincing real-world environment to gamer's fingertips. Considering that Angel Studios is most known for its work on the Midtown Madness franchise, it's not surprising that the company decided to make an action-racer that could take advantage of these huge worlds. Thus, Smuggler's Run was created.    The idea is to hop into tricked out vehicles to smuggle contraband across exotic locals. You're the bad guy, constantly being pursued by the authorities. It's as good excuse as any to send players racing all over huge maps. The main single-player mode, Smuggler's Missions, begins very simply by introducing players to the controls and general gameplay. Just jump into a vehicle and drive from point A to point B. Any player that can't successfully complete this objective might consider retiring from their videogame career.    Eventually, you'll migrate from these simple training missions to the bigger, more risky assignments. The objectives range from picking up and delivering contraband to several key points to chasing down an opponent to take them out. Surprisingly, the gameplay mechanics have been massaged to ensure the missions aren't completely mindless. Picking up and delivering contraband sounds boring, but you must consider that you're being pursued by up to 10 police vehicles at a time. To put the pressure on you more, there are other variables: a timer ticks down before the mission will be aborted and the plane dropping off contraband can only hold its position for a short time. You're constantly under pressure to perform well and outthink the police.      This isn't a completely easy task, though. The do-gooder fiends travel in packs and work to surround you. They'll often have someone just ahead of you that tries to cut you off by coming to a dead stop in your path. Meanwhile, if your vehicle isn't fast enough they will try to flip you over by ramming into you. It's truly a hot pursuit and the ability to roam free in the worlds makes it feel all the more dynamic. You'll have to hone in on your skills to shake them, using tactics such as the ~head fake~ -- quickly turn in one direction and then the opposite -- to throw them off. The artificial intelligence is nicely done to react to that kind of user input.     Fortunately, you are aided by countermeasures -- essentially a fancy term for offensive and defensive weaponry. If you checked out our feature coverage, you'll know all about the speed boost, acid drop, vertical boost, and host of others that become available to your vehicles. Each vehicle is capable of using two types of weapons that become assigned to it over the course of your missions. The first time you earn a new vehicle, it is barren of countermeasures. As you progress through the single-player mode, you will gain access to specific upgrades. At this point, more strategy is involved in successfully completing a mission because you have to choose what vehicle and possible countermeasures are best. Do you want something fast with weak armor, something slow and powerful, or something in between? Instead of making it too simple, you will only get small hints when you're debriefed.   There are just over 30 main missions, which equal several hours of gameplay if you're good enough to burn through it all without too much failure. Interestingly, it's all tied together with an intentionally (we think) poorly shot video story, complete with cheesy acting. To say the least, it's comical in a pathetic way. Depending on your tastes you may like it, but most will probably find it seems out of place. It does manage to bring the single-player missions into a more plausible light, though, so the objectives don't seem completely random and tedious.    When all is said and done, the Smuggler's Missions provide a moderately rewarding single-player experience. Some missions tend to feel a bit repetitive, but there are a few more eventful objectives to mix things up.    Multiplayer  We covered the multiplayer modes, known as Turf Wars, quite extensively previously, so we won't repeat how everything works. However, what you do need to know is that multiplayer is one of Warzones' strongest points. Beyond the previous PS2 versions, you are now able to saddle up with four friends for all-out, off-road mayhem. Some modes have you claiming checkpoints with your color in an almost Tony Hawk-type graffiti-style race while others are more like capture the flag. There's a good selection to choose from and the gaping environments graciously lend themselves to this. It's fun and it's fast. Two-player mode manages to keep the 60 frames per second framerate, while four-player drops down to 30 with only a little detail loss. Angel did a bang-up job, and if you have a group of friends that would be in to this type of title, multiplayer might make it worth your while.    Graphics and Technology  Warzones' most visually enticing feature is its fantastic landscape engine. It draws huge, organic environments that stretch as far as the eye can see. Not barren of life at all, the rolling hills and steep mountains are covered in varied, dense foliage. The texture sets for the five different real-world locations do well to immerse players in the foreign lands. Vietnam is verdant, thick with tall grass and swampy marshes, while Russia is snow-packed, littered sporadically with dead-leaved trees. Adding yet another layer of nature to the humongous landscapes, Angel Studios has hammered out a decent lighting and particle system. In the different missions, players will smuggle their contraband under the hot sun, the glow of dawn and dusk, and even in the cover of night, aided by the power of night vision. Additionally, different weather effects such as snow, fog, and, our favorite, rain add to the already convincing settings. All of this runs at a silky smooth 60 frames per second, even in two-player modes. Needless to say, we're very happy with Angel's studious efforts to bring a solid engine to Nintendo GameCube.   Of course, nothing's perfect and Warzones is by no means the prettiest GCN title you'll find. While we gawk at the yawning landscapes, we can't help but be a bit disappointed with some of the texture designs and car models. With the fast-running engine, it appears Angel wasn't able to pull some things off. It has basic specular light maps on all of the vehicles, which creates a subtle reflection effect, but the models themselves are very plain. The vehicles are intended to appear rusty and battered, but other than a flat reddish-orange texture you wouldn't know this. Dirt does not accumulate on the paint, nor are their dents and bangs in the vehicles. And, the hills and fields they roam on demonstrate some blurry visuals and repetition. In fact, due to stretching landscapes you're able to see a lot of the texture drawing in.    As a whole, though, Warzones is a nice looking title. It's jaw-dropping, go-anywhere environments are a first on the system, and little touches like real-time car damage and realistic particle effects, such as the billowing smoke, help add another layer of realism. Even better, HDTV owners will be able to enjoy the title in progressive scan. If a sequel ever makes its way back to the console, we hope to see a widescreen mode and more attention to the smaller details such as the aforementioned dirt accumulation.      Finally, we should make mention of the stellar physics engine. Angel Studios has really nailed the feeling of suspension and friction. Every vehicle in the game feels different and behaves differently thanks to proper weighting and friction values. Some of the vehicles, such as the ATV, are able to charge up a steep hill without losing traction, while another such as the Grenadier in the military line of trucks would tumble backwards halfway up. It's a great sensation to have these limits and rules. It means that whether you're joyriding or in the middle of a mission you must consider how your vehicle behaves. Considering that Warzones very being revolves around driving mechanics, Angel Studios has really crafted a nice core for it to exist around -- something more important than all the high-res textures in the world.    Sound  Rockstar and Angel went out and licensed techno tracks from labels such as 430 West, KMS productions and BluePrint records. Snobbish techno fans will probably find the selection of songs droning and fairly dull. Of course, in the world of videogames what Rockstar has put together for Warzones can definitely be considered a cut above the rest. In fact, most casual gamers will probably find the high energy beats and thumping bass quite suitable for driving. Redundancy is a big problem, though. Instead of a number of tracks being tied to the different environments, each mission is assigned one of the tracks. Due to the sometimes-lengthy missions and need to retry after a failure, the tunes can get old fast.    On the sound effects side of thing Angel Studios has done an acceptable job. The missions are driven forward with basic debriefing voiceovers. More helpful is that during the gameplay a mission commander will read off new objectives and give you tips. It's all pretty helpful and makes the experience all the more intuitive, but, not surprisingly, the witty one-liners injected into the mix will grow tiresome very fast.   Most importantly, it's missing really great atmospheric sound. From the rainstorms to the soggy races through marshlands the sound is flat and uninteresting. There's so much foliage it would have been awesome to hear the brush slapping up against the side of your vehicle as you charged through it. Little touches like these are not present, and it also lacks anything like Dolby Surround support to further the experience. Simple, one-dimensional stereo sound simply isn't enough in today's competitive industry.    Overall, though, Warzones' aural presentation is decent. It's nothing that will have gamers turning down their TVs, but it certainly didn't meet its high potential. I enjoyed the Smuggler's Run franchise when it first launched with the PlayStation 2. It's just plain fun to drive freely over the monstrous environments. Above all, this is what the game has going for it. If you like off-road exploration, you should pick up Warzones. It's fun just to joyride around the huge environments. Anything you see, you can drive to. Of course, there are boundries, but the size of the levels is absolutely impressive. If you're not so captivated by the idea of wide-open driving, the single-player missions may not be compelling enough to warrant a purchase. They're fun, for sure, but mostly for the fact that they take you over these huge maps. Look into a rental if that doesn't sound like your cup of tea.If you haven't played Smuggler's Run before, definitely check this out.", "date": "Aug 12, 2002"}