{"name": "Cutthroats", "name_review": "Cutthroats", "ref": "https://www.ign.com/articles/1999/10/05/cutthroats", "text": "Comparisons with Sid Meier's Pirates are inevitable. Not only that, they're even encouraged. When I first went to take a look at this game last month, I was very excited. After years and years of waiting, it looked like someone was finally doing a real homage to the old Microprose classic. In fact, the guys at Eidos admit to being inspired by Sid's classic game of freebooters and buccaneers. The thing that makes Cutthroats so great is that it truly adheres to the ~free roaming~ spirit of Pirates. The only goals you have here are those that you set for yourself. Sure, you have to keep your men happy and you have to get cash, but how you go about this and what you ultimately do with it all is entirely up to you.  But there is a difference. The game takes the arcade-like accessibility of Pirates and places it in a more complex type of simulation. In some cases this works brilliantly--land battles for instance. In other cases, the success of the new approach is mixed. For example, I felt the sea battles offered a lot more in terms of flexibility, but sacrificed a lot in terms of involvement and fun. While Cutthroats is a good game, my overall impression is that it tries to do too much in terms of realism. As a result, the fun of the game is sometimes lost in the shuffle.  Eidos has said that they wanted to give this game a ~realistic feel~ but readily admit that it ~isn't a naval simulation.~ Obviously you have to scale the realism of the game to match its scope. In a game that offers the chance to play 100 years worth of bloodthirsty pillaging and raping, you've got to cut some of the corners on realism. The problem is that there's too much realism in the game and not enough fun. Don't get me wrong, the realism of the game offers you all sorts of opportunities to fine-tune your play style but there's often too much to concentrate on.  One of the most intriguing aspects of this game (and of Pirates too) is that the game world is truly ~living, dynamic and reactive.~ Your actions resonate within this world and you'll soon find yourself caught in a web of consequence from which you may not escape. I love this. In most games, the morality of individual actions is considered only in a pre-scripted, narrative manner. This feature would be of little importance if your reputation didn't spread across the Caribbean so quickly. If you take a ship right outside of a town, it's more likely that witnesses will carry word of your deeds to nearby settlements. It's better to take ships out in open waters. And if a ship escapes from combat, they're likely to seek out nearby reinforcements and come looking for you.  In Cutthroats, you develop a reputation based on almost all of your actions. The game's Fame rating is a measure of your pirate's power, wealth and accomplishments. The Infamy rating on the other hand is the sum of all of the ~evil~ actions you have performed--killing prisoners, assaulting towns, etc. Better still, you're reputation varies from one nationality to the next. The French might regard you as a hero a la Jerry Lewis. The Dutch might regard you as a villain a la Shelly Long or Don Ho.  The game covers the period between 1625 and 1725, the heyday of men like Blackbeard and Sir Henry Morgan. The status and strength of towns is based on historical facts so you can expect a pirate's welcome in towns like Tortuga, Port Royal and Nassau. They've given you an amazingly detailed world in which to make your fortune, but I just didn't feel connected to it. The rumors, treasure maps and governor interactions are a little one-dimensional. Although you get the chance to get involved in all sorts of quests, really just ~errands,~ these are, as a rule, exceptionally unexciting. Ship to ship combat is your bread  and butter.  You start off with a small ship, a few sailors and very little in terms of supplies. Everyday your men consume what meager supplies you do have, so you've got to start finding food and rum immediately. After all, what fun is a group of starving, sober pirates? They tend to get a little edgy. Once you've got the supply situation sorted out, it's time to get more men and bigger ships. More men mean more supplies and the whole cycle starts over again.  I found that obtaining all my supplies in port was very tricky. Much of the Caribbean is apparently very poor. Supplies and men are hard to come by, even in the larger ports. Although Eidos has said that this game could be played from a trader-type perspective, the big money is in piracy. You'll attack enemy fleets and steal their men, supplies and ships. Since this is really the meat of the game, I was more than a little disappointed in the interface. To begin with, the mouse control is poor. It's much easier to control individual ships with the keyboard. Even then it's still a little glitchy. The real problem is that you'll be controlling up to 12 ships in the largest battles and you have to rely on mouse commands to have the slightest chance of success.  The control options are great, but the execution is sloppy. You can set all sorts of variables--shot type, targeting, sail state, etc. But sometimes the controls just don't work. I often had trouble reconfiguring my shot type and had a hell of a time getting my guns to fire when I wanted them to. What is initially sort of fun, quickly turns frustrating in the face of a messy control interface. Then when the boarding actions begin, you're totally thrown for a loop. The whole boarding interface is very flat, especially considering the depth and flexibility of the ship combat controls. All in all, it's a very unsatisfying experience.  When you do take another ship, you'll have to have enough sailors to manage it. This isn't much of a problem because you can take as many men as you can find. Same goes for cannons. There is no limit to the amount of guns or sailors that you can board. I thought that was pretty unconvincing. I mean, let's say that you have a sloop. You can put as many cannon on this ship as its 30 tonnage limit will allow. That's just not accurate. The best thing to do, I found, was to load up the ship with a hundred marines and a few sailors. Once you spot an enemy ship, make an attempt to board them. Then you can just sit back and watch your men overwhelm the enemy.  I mentioned that the land battle interface was much smoother and better implemented. You can divide up your marines into units with cannon, muskets and officers. Then you make a strike against specific targets within the town. Blow up the barracks and the town will be weakened for future attacks. Burn down the warehouse and you've destroyed the town's trade. Attacking enemy towns is not only fun, it's downright irresistible. The payoff in terms of loot is surprising. The downside is that town attacks are frowned upon by the major powers in the Caribbean, so you'll soon find yourself with lots more enemies.  When it comes right down to it, I was very excited about this game when I previewed it last month. There was some hope in my mind that the bugs would be ironed out. It turns out that the bugs are really just poorly implemented features. The idea behind the game is great, after all, Sid made a few bucks off of it, but the way it comes off in Cutthroats isn't very convincing. I love the added features, mostly in terms of ship combat, but the game fails to generate any sense of excitement. I'm glad to see that this genre is showing a slight resurgence, and Cutthroats is genuinely fun for the first few hours. After a while, playing it was unrewarding.  -- Stephen Butts", "date": "Oct 5, 1999"}