{"name": "NFL Blitz 2003", "name_review": "NFL Blitz 2003", "ref": "https://www.ign.com/articles/2002/08/13/nfl-blitz-2003", "text": "This has to be a joke. Really, they can't be serious. For the fifth year straight, the Blitz series has shown up on the Game Boy system, and for the fifth straight year, the game is absolutely the pits. And in the case of NFL Blitz 2003, the game is, quite honestly, the worst published game I've seen yet on the Game Boy Advance. Awful play mechanics, terrible artwork, pathetic character animation, and absolutely no attention paid to the actual, established Blitz presentation are just some of the highlights you can expect from this horrendous development. Features: All NFL Teams. Link cable support for two players Password save for season mode Only for Game Boy Advance  After last year's GBA Blitz crapfest from GBA developer Outlook Entertainment, why on earth did Midway hand the sequel to the exact same development team? Did these guys learn nothing from their original design? Because, to be honest, the 2003 edition is actually a lot worse in many ways than its 2002 counterpart. Yes, that's right...as bad as the game was last year, the team managed to muck things up further for the sequel.  Now, don't get me wrong, I'm one of the biggest Blitz fans out there...I've been playing the series since its arcade debut, and own the game in almost each year's incarnation on at least one console. I love the arcade football design...and NFL Blitz 2003 on the PlayStation 2, Xbox, and GameCube are great fun. This portable rendition, however, obviously didn't get the same attention that the console teams gave their product...and in fact, I'll be surprised if any member of the Blitz design group saw the GBA game while it was being developed. And if someone did...shame on you for letting this turd through.  The game engine has taken a serious turn for the worse...like last year's game, Blitz 2003 features an on-the-field perpective that utilizes the GBA's Mode 7-style and sprite-scaling abilities, but the framerate is horrendous and nearly unplayable, with chaotic animation of incredibly blocky, pixelated players scurrying around the field. Actually, calling this ~animation~ would be a compliment...They jitter more than run, making the game look like a poor simulation of Electric Football of the '70s. After each play the animation continues, and it's almost humorous watching these athletes slide around without even moving their legs. And Outlook must've been incredibly proud of their engine's ability to rotate around (a simple technique that's done in countless GBA and SNES kart-racers), because the camera pauses the action and swings around 180 degrees after nearly every play. It's annoying and obnoxious, and totally against the Blitz design.  The developers obviously tweaked the computer AI, because instead of completing every single play possible of the first GBA Blitz, you have to deal with spastic opponents that clump together and attack you from whichever side you're running. At least in last year's version you had the satisfaction of trouncing the computer with its terrible AI...now even that's gone. The developers even reduced the play selection from its more glitzy, 3D look of the 2002 edition to a basic, flat, undetailed interface. The only thing good that can be said about the presentation is the clear digitized audio from the console game...but even here there's not much to be heard. Players will constantly call out after a play: ~Ugh...I think it's broken.~ You got that right, Bubba...this game's beyond repair. I've always followed the belief that every game, even the truly pathetic, has enough merit for at least two points on our review score...I rarely, if ever, actually give the game a 1.0. But Blitz 2003 beats the odds...I honestly can find no likable features in this game, and the fact that the team had a whole year to fix last year's debacle alone reduces the review score to the near-absolute lowest. I'm downright tired of seeing the awesome Blitz design reduced to an unplayable mash of pixels on the handheld. The Game Boy Advance may not have the 3D horsepower, but I know for a fact that it has the ability to reproduce much of the Blitz design in its 2D hardware. It's only a matter of finding a team that has the passion for the series...Outlook obviously doesn't get it.", "date": "Aug 13, 2002"}