{"name": "Mat Hoffman's Pro BMX 2", "name_review": "Mat Hoffman Pro BMX 2", "ref": "https://www.ign.com/articles/2002/08/15/mat-hoffman-pro-bmx-2", "text": "Well, here we are again...another year, another incarnation of HotGen's extreme biking engine for the Game Boy market. Mat Hoffman's Pro BMX 2 marks the development team's four time with the side-scrolling game design, and with the new version comes a large list of advancements in the established gameplay. Even if you're learned on the controls from last year's version, you've still got a lot of new things to discover. The overall experience isn't quite as fulfilling as the Tony Hawk series, but it's still a lot of fun once you get over the intimidating interface.  Features Eleven riders Eight parks Cartridge save Link cable support for two players (multi-cartridge) Only for Game Boy Advance  On the surface Hoffman 2 doesn't look a whole lot different than last year's edition, but in reality the team went in and really loosened things up quite a bit. The 2D engine that the team uses for the game design doesn't allow for the same amount of park freedom that games like Tony Hawk enjoy on the GBA system, but with the enhancements that the development team added to its creation, the game feels a lot more open. Like past incarnations, all of the tricks still have to be performed from right to left...there are no ~into the camera~ moves, and the team still doesn't allow players to angle their bikes vertically to ride their bikes directly up or down the screen. But the designers free up the tightness in controls by giving players the ability to pretty much turn directions on a dime by simply holding the R button, pushing in the opposite direction and hitting either A or B; A pulls off a 180 powerslide, with B activating a G-Turn on the front wheel.   Also new to the series, but not to extreme sports games in general: Mat Hoffman 2 on the GBA finally allows for manuals...by hopping and pressing left-right or right-left, players can link their tricks off of vert pipes or grind rails for excessive combo numbers. The programmers were thankfully very lenient on the duration between tricks during a combo, which is very handy since the thumb can easily slip off the D-pad or buttons during the flurry of moves necessary to keep the chain alive. On the flipside, they tightened up the combo engine from last year...so players can no longer just roll on the same halfpipe and keep pulling off the same tricks for high-scores. Getting tons of points in last year's game was a cakewalk compared to Mat Hoffman 2...now you have to work for the top scores. This is a good thing.   Like the previous incarnations, the controls aren't super intuitive to pick up and play...especially if you're coming fresh off of the Tony Hawk games. To ween people into the complexities of the Mat Hoffman control scheme, the designers include an optional tutorial mode to learn how to manual, grind, fakie, and pull off special moves when the meter's full. The training levels really help players get the grasp of the game's controls, especially since they tell you all the necessary button commands right there in the checklist...a handy item since no one carries their instruction manuals with them. It's a damn shame that players cannot revisit any of the completed tutorial rounds...unless they want to restart the game with a brand new rider that has no save data attached to him. But in this case, you have to play through the training modes you might not want to waste time in. For example, if players forget how to pull off specials, they should be able to go back into the training mode to re-learn how to do it...especially if they've already completed the task in the past. This game doesn't allow you to do that...or rather, it's a bit of a chore to do it.  With all these new moves at the player's disposal, the design team was able to put together a nice laundry list of tasks to perform within each of the eight different bike parks. Some of them are simple ~collect X tokens~, but others require special moves...like manualling past fire alarms. Some tasks even require double-duty...in Vegas, for example, you have to locate a safe and manual near it...the money inside will spill out all over the park, and you'll need to collect them all before time runs out. To get a rider through all eight cities, you'll have to do a lot of fun, expert riding. The design team, unfortunately, forgot to give players the ability to pull up the task list while they're in the game...so players will have to memorize all the little tasks before they enter the park. And when players complete tasks, they can no longer see what was needed to accomplish it...I've accidentally, successfully crossed off tasks without knowing what was necessary, and when I highlight the task, it simply says ~Completed.~ I want to see that task's requirement, regardless if I finished it or not. It also would have been handy for the game to pause and scroll the ~camera~ to locations that unlock when triggering these areas...as it is, the game just assumes you know where to go after an area opens up.  The graphics honestly haven't changed a whole lot since last year's game, but the new stuff definitely gives the game more life compared to the original. The artists created new frames of animations to the rider's new moves, and tweaking the art for all the existing moves from the previous game. The parks themselves feature a newer style over the first GBA game, but the only real advancements over the backgrounds is its animations...lights blink, gates swing open, that sort of thing. But because of the perspective, it's difficult to see lines because of the limited view...like Tony Hawk's isometric perspective, Mat Hoffman's Pro BMX 2 has strange viewing issues because of the 2D art. It might have something to do with the fact that your bike doesn't cast a shadow...objects have shadows to tell players they're up in the air. But when your bike jumps off the concrete, you don't get that similar guideline.  Last year's multiplayer mode makes a return to the scene in the new edition, giving Mat Hoffman 2 a ton of replay value...it supports the link cable, which is awesome, but it also offers hotseat modes so that two players can take turns pulling off the best moves or combos in its Horse and Fast Play modes. Good times. I may have a few gripes with the game, but don't get me wrong...I still think that Mat Hoffman 2 on the GBA is great fun and is a recommended title for the system. Comparing this game to Tony Hawk is the old apples vs. oranges thing, and I think that it's the intention of Activision and HotGen to keep it that way. The engine, now in its fourth try, will never offer the freedom that the Vicarious Visions' Tony Hawk engine does...but HotGen's design keeps on evolving to include new elements, making each version drastically more fun than the last.", "date": "Aug 15, 2002"}