{"name": "Antz", "name_review": "Antz", "ref": "https://www.ign.com/articles/1999/10/05/antz", "text": "Ah, you gotta love the ~Generic Movie Licence Games~ that come out for game systems. These are titles are made simply to sell based on brand name only. This is the case for Antz from Infogrames -- it's not a bad game, just basic and average, and nothing that couldn't have been done with original, unlicensed characters. Features  19 action-packed levels. Play as Z and Princess Bala. Compatible with Game Boy and Game Boy Color.    I've seen the movie a zillion and a half times in the theater and on DVD, I thought it was one of the best films of 1998. But not once did think the film would translate well at all into videogame format. But what Infogrames has done is create a side-scrolling action game starring Z, the one-in-a-zillion ant set out to win the heart of Princess Bala. You'll collect hearts, powerups, and the ever-generic rings that'll get you an extra life after a hundred have been picked up.  Each of the game's 19 levels are based around a situation that happened in the movie. Level one starts out in the tunnel, where you set out to find the foreman -- essentially a point-a-to-b task. You hop on little bugs, climb ledges, and throw pick-axes at the bad guys. Once you find the foreman (end of level), it's on to level two where you have to find six ants to make a demolition ball. Again, point-a-to-b action. And once you finish this task, you don't really see this so-called ~demolition ball.~ Then, level three -- you have to find Princess Bala in the bar. Hey, look at that...another point-a-to-b leve. Only when you actually get to the boss levels does the game actually change -- in them, you battle with a giant magnifying glass or sneaker.  The controls are tight, and the action is simple enough to pick up and play. But the game just isn't interesting enough to hold attention. The one thing the game is not is an accurate representation of the movie's imagery. What the designers should have gone with is a rendered style like Donkey Kong Land to give the game a more CG look, just like the film. Instead, these graphics are hand-drawn sprites and bitmaps that could represent anything -- including generic, original characters.  This game is perfect for kids -- and I'm sure this game was aimed for that market: parents head to the store, see a name they recognize (Antz), pick up the game and give it to their Game Boy-playing child. The kid likes the game because it's easy to control and play. My problem is this: Antz really wasn't a kids' movie -- it was a Woody Allen flick. Hey, maybe they should make a game based on Sleeper or, better yet, Everything You Ever Wanted to Know About Sex...But Were Afraid to Ask. Antz isn't terrible, but it won't bowl you over with originality.", "date": "Oct 5, 1999"}