{"name": "Medieval: Total War", "name_review": "Medieval Total War", "ref": "https://www.ign.com/articles/2002/08/26/medieval-total-war-2", "text": "Despite the obviously unusual subject matter Shogun was a stellar real time strategy game which dared to innovate while most of its contemporaries were slavishly following tried and tested formulas. Shogun delivered massive armies and complex strategic action with elements like terrain, weather, morale, formations and troop types being vital factors. As such it was a revelation and it is a poor indictment of the competition that it is only now, with the sequel looming large, that we are being readied for a game which delivers similarly stunning gameplay.   Medieval is a logical step forward for the Total War system and you might wonder why it wasn't the first game in the series as the European feudal combat might have appealed to a wider audience than the Japanese milieu featured in Shogun.    Either way it is clear now that both games are absolute rippers which will hold you in a vice-like grip in front of your PC as you do your best to smite as many of the enemy as possible before bodily function breaks intercede and you are sent running for the toilet.   Upon returning you will find you are being treated to some of the best visuals, and most rousing soundtracks on offer.   Medieval lets you control any one of a dozen empires and each has their own historically unique military units and territories. This gives the game huge replay value as you wield power as the plucky Poms or the swift Saracens.   The game system will be immediately recognisable to anyone who has played Shogun and this is a good thing for the most part. Medieval is divided into two basic components. There is the map based strategy stuff, which still reminds us very much of the board game Risk, and then there are the real time 3D battles, which are the raison d'etre for having this CD Rom in your PC for they are, as you'd expect, totally absorbing.   For those who have never seen Shogun the system in Medieval is quite simple in appearance the first time you check it out too. Although the truth is that Medieval (and Shogun before it) deliver serious depth.    Medieval lets you oversee the economic management of a vast feudal empire, building fortresses, raising armies, improving the food production and wealth generating assets on the land while also trying to send spies out to check out enemy territory, inquisitors and assassins to hunt enemy generals and watching your borders nervously. This all happens in a turn based map mode which then snaps to a real time 3D combat mode once battle is joined.   This is when things get really exciting and you control literally thousands of troops in huge battles. The map based strategy stuff is important, and it has been very much improved in Medieval when compared to Shogun, but it is the 3D tactical combat which really keeps you interested.   However having mentioned the turn based Risk style stuff it warrants going into it a little further, as you won't win the game if you don't wisely manage this aspect of the action. Medieval can actually be played purely as a turn based affair without ever resorting to the 3D combat. Indeed there is still some decent gameplay on offer if you do go this way. The turn based map stuff is all about building up your territories' defences, getting the wheels of your economy turning faster and engaging in a little political intrigue. You can send out emissaries to negotiate pace with your neighbours, princesses to seek the hand of neighbouring princesses, and thus cement an alliance and religious leaders to stir up trouble in your neighbour's backyard. This aspect of the game has been suitably expanded with many more new characters at your disposal.    There are also many more military and economic structures and even the terrain now makes a difference when you are considering an invasion of neighbouring lands. Each territory has unique lands at the border which should make you think twice before just waltzing into the enemy's provinces with an under equipped force. Invading the nice flat accessible lands in southern France might not worry you much, but go charging the wrong way into the middle of Europe, where the mountainous Swiss Alps dominate the landscape, and you'll quickly find out how hard it is to fight an uphill battle where the enemy has a decent mountain to cling to, something which makes dislodging them far harder. This sort of stuff makes the turn based strategic game a real delight to play and make no mistake about it any success you have in the 3D battles is usually at least in part the result of well thought out planning in Medieval's strategic mode.   Speaking of which the 3D action is superb. The visuals have been tweaked when compared to Shogun and there are now more weather effects too with the climate playing a real role in the nature of each battle. There is everything from snow to sandstorms and the weather dynamically alters how well your troops fight.   The basic camera interface has been kept and some might find this annoying as the default camera options can feel quite constricting at first. That said you will soon settle down to get used to this, and there is an 'unbound view' option which is much more flexible for those who want to have a roaming eye which wanders the battlefield.    The card system which is a part of the HUD and helps you keep track of groups of troops is also still in place and this works with aplomb. Your troops now also have a much more advanced AI and it is pleasing to note that you are now able to read messages which partially explain why your troops are feeling confident or getting ready to turn tail and run.   Your troops' behaviour is now flagged by comments like 'happy because their flanks are protected' or 'worried about so many casualties' which helps you get a feel for their mood before they bolt and run.   One of the few criticisms you could legitimately make when looking at Shogun was that the units you used in the field of battle were for the most part too similar and as a result combat tended to pattern a lot. This has been very much redressed in Medieval, as there are now over one hundred different troop types and you will find that the battles are much more varied and the differences can even be keenly felt if you choose to command an army from a different region. The empires you can control are as diverse as the English with their archers and the Saracens with their nimble light horsemen. There are also camels, heavily armoured knights, siege equipment and even primitive guns should you choose to be fighting in the later historical periods.   There are three principal unit types, and each unit type is good at dispatching a particular enemy and susceptible to an attack from another unit type. Cavalry and especially Knights are great at mowing down archers, but are vulnerable to spearmen. Archers are superb at cutting down other slow moving footsloggers, but can be ripped to shreds by a fast moving cavalry charge. Then there are also siege troops which love smashing castle battlements into huge piles of rubble. Your siege units can help in a battle, but are very vulnerable to direct attack. The game lets you play with gizmos like catapults, massive bolt firing ballista, crude cannon and the battlefield dominating trebuchet.     What did you think of Medieval Total War?   Terrain and using the right unit for the right job matters enormously in this game. If you are unfortunate (like this sometimes tactically ill-prepared scribe) you can have as many as 600 English troops and still be wiped out by a mere 300 enemy soldiers if they are clever enough to hide in the forest atop a hill, shower you with arrows, and then send their footsloggers smashing into your ranks while the remaining archers hang back and keep whittling your reinforcements away with more arrow fire.    To add insult to injury just as the battle appeared to be heading in a more favourable direction, my general broke ranks and ran, to be followed by the bulk of the remaining troops. This pretty much sealed the fate of the plucky poms and again made it less likely I was to be declared Europe's sole regent in the near future.   Compared to Shogun there are quite a few improvements in the overall strategic goals too. There are also special goals for certain civilisations and five principal religious groups. You will even be given edicts by your religious leader, with Crusades for The Pope being a pretty common thing. There are also neutral countries ripe for the taking as long as you can defeat the rebel forces. Smashing the Scot William Wallace is one of the early challenges you must overcome if you play the English.   Morale, and the characteristics of your generals can really influence the tide of battle. Indeed keeping a reserve of fresh troops can be vital to maintaining morale for the rest of your forces.    The soundtrack is full of rousing context-sensitive orchestra moments which get you in the mood for bloody slaughter, which is a good thing as this game delivers body counts like no other. You can take part in battles where there are literally thousands of troops out there trying to rip each other to shreds. There is also no shortage of ketchup as your men valiantly fall to the ground amidst ever growing pools of liquid life.   You can also choose to capture prisoners, who can then be later ransomed off, or, if you want to be ruthless, you can kill your prisoners and this helps increase your 'dread' so your enemies will be more likely to be afraid of you when they meet you in battle.   The role that individuals plays in the outcomes of key events has also been expanded, with your Generals and other characters being often decisive in determining whether you are still the all conquering regent or a king in exile.  Medieval is a comprehensive game that has few flaws and delivers such an encompassing experience you'd wonder why there haven't been many other titles imitating its predecessor. If you want real time strategy with more teeth you cannot ignore this.", "date": "Aug 26, 2002"}