{"name": "Auto Destruct", "name_review": "Auto Destruct", "ref": "https://www.ign.com/articles/1998/01/21/auto-destruct-2", "text": "Imagine, if you will, that you are a      champion race car driver. You have a loving wife      and beautiful daughter. Life is great. And      then: tragedy. One fateful day, you witness      the brutal slaughter of your family at the      hands of a fanatical cult, the Disciples of      Lazarus. You drop out of your career,      vowing to do anything in your power to      avenge the deaths of your wife and child. A      mysterious organization, bent on destroying      the cult, takes you on board. And so begins      Auto Destruct...  A mission-based title from Electronic Arts, Auto Destruct is the latest in a long line of drive 'n' shoot games, going all the way back to the heady days of Spy Hunter. It's an interesting concept, shooting from your car, and one we've all thought about while stuck in traffic or after being cut-off by some jerk in a beat-up Trans Am. Perhaps that's why so many of these kinds of games get made -- because it's so damn satisfying.  Anyway, after being recruited, you're given a super car that's equipped to handle all sorts of powerful ammunition. Control of the car is excellent, being just loose enough for careening around corners and down city streets. Driving the vehicle is great fun (even if it does look like Tim Burton's Bat Mobile). Weapons are gained by picking them up around town, and you have to get repairs done and refuel occasionally as well.  As I said before, Auto Destruct is a mission-based game. These consist of finding and taking out the Disciples of Lazarus in their various vehicles, as well as rescuing policemen and other such things. You've got a handy navigation radar in the lower-left corner to show you where to go, and it's executed quite well. However, the missions themselves aren't all that spectacular, and you find your self driving back and forth over the same ground repeatedly.   Graphically, Auto Destruct is a bit disappointing. It fails to make use of the PlayStation's plethora of cool effects, and at this stage in the platform's career there's really no reason not to. OK, there is lens flare, I'll give you that, but other than that, it's not all that special.   In the end, Auto Destruct is a good, but lackluster game. It's not terribly original or exciting, but it gets the job done and is pretty entertaining to boot. If you're really into driving and shooting, give it a go. For anyone else, though, I'd suggest a rental session first.  Adam Douglas", "date": "Jan 21, 1998"}