{"name": "MechWarrior 4: Clan Mech Pak", "name_review": "MechWarrior 4: Clan Mech Pak Review", "ref": "https://www.ign.com/articles/2002/08/29/mechwarrior-4-clan-mech-pak-review", "text": "Forgive the redundant nature of this article (those who read my Inner Sphere Mech Pak review will find this one strangely familiar), but since both titles are identical in premise, presentation, graphics, sound and appeal, I felt it inappropriate and unnecessary to write out a completely new piece when all that needs to be commented on are the new additions. So...   When I purchase a title, I expect it to have a few things. When I purchase an expansion for a title I expect it to expand my gaming experience while having the same things of the original. Because of this, I've always found Microsoft's half expansions for MechWarrior 4 (the $13 Mech Paks) to be a little suspicious.   They say cheaper add-on. I say a patch in a box that still costs money. I'm right.  MechWarrior is a beautiful, deep, sci-fi action simulation. Everything about the series enthralls me. From premise to delivery, the games have never managed to disappoint. And now I get this, something I should have been able to download from the official website completely free of charge. Let's go over what's here in my shiny retail patch, shall we?  Masakari: An 85-ton fan favorite, the Masakari has a big head and little legs. Very accurate at ranges, this assault mech comes with ferro-fibrous armor, the new enhanced optics, and an armament consisting of PPCs, Ultra AC5s and LRMs.   It lacks jump jets, but can cruise at a brisk 83 KPH if taken care of. A middle of the road heavy hitter with devastating and dangerous to manage weapons, this is a mech that's clearly for the more patient and skilled pilot.  Kodiak: I believe the Kodiak first made its MechWarrior debut in Ghost Bear's Legacy, where it was as lethal as it was large.   A little slower than the pack, this brawler is designed to stay close, but not too close, as is evident by its no nonsense electronics free design, fully featured jump jets, and medium range everything (MRM, Clan ER Laser, Clan LBX AC20).   A little sluggish for my tastes, but nonetheless powerful, the Kodiak is a bit of nostalgia relived.  Arctic Wolf: Take a medium class chassis built to run at 115 KPH and then fill it with short range missiles and you have the Arctic Wolf. Its four banks of Clan Streak Short-Range Missiles allow it to shower and devastate the slower missile absorbent mechs.   Unless you're big on swooping around an opposing lance, and firing off missiles in the hopes that they don't blow up in your face or fly off target, then the Arctic Wolf may not be for you.   Cauldron-Born: Perhaps my favorite of the new mechs, the Cauldron-Born is a workhorse that can absorb an uncanny amount of punishment but still speed along at 92 KPH (it does weigh only 65 tons, after all).   The enhanced optics, LRMs, Clan LBX ACs, and Clan ER Medium Lasers round out its seemingly apelike but still effective design.  Streak MRM: Several iterations of a new homing medium range missile have been included in the Clan Mech Pak. Behold the Clan Streak Medium Range Missile. The new tracking technology makes the missile more effective than previous MRMs (it even has greater range), but comes at the cost of damage, which for the skilled pilot, is not an acceptable tradeoff since homing is of little use when you pinpoint every other shot anyway.   The missiles come in the 10, 20, 30, and 40 varieties and have varying strengths and weaknesses accordingly.   Enhanced Optics: This is a simplistic but effective component, depending on how you look at it. The enhanced optics essentially enlarges the zoom screen. For some that's great because it allows for more controlled sniping with far less confusion when spying on speedy baddies. For others it's not so good because it takes up more valuable screen space. It's a tradeoff and a personal preference, but nonetheless a kind of cool piece of technology that fits in to the whole fairly well.   Factory: A big, broken down factory on the competitive sporting planet of Solaris VII serves as the setting for this arena style multiplayer map.  New Gothem: Urban environments are some of my most favorite, so the New Gothem map was one I was particularly looking forward to trying out. And it's a fairly solid map, but still familiar to those who have played comparable levels in mechs long past.  And that's it! For the second time in my entire illustrious IGN career, I have been able to completely describe every single aspect of a game. Oh wait, I forgot again... The Clan Mech Pack also comes in a DVD case.   I'm not going to drone on about how good Vengeance looks or why its large, colorful landscapes, articulated and fluid mechs, and vibrant particle effects are any good. Nor am I going to blab on about how the sound is still decent and cite examples like the mech thump, the gyro buzz, and the whoosh of missiles. All of that can be saved for the MechWarrior 4 review, which says the same thing. Instead, I'll get right to the point, which also happens to be really close to the conclusion.   What's being boxed up here and released for some 10 - 15 dollars is normally included in a patch by other developers (IL-2, Soldier of Fortune, Unreal Tournament). In fact, some games don't even bother releasing the patch, they initially provide creation tools and then let the kids have at it themselves. Chew on this... Could id get away with releasing another expansion to Quake III that was just four models (I made the mistake of saying ~skins~ last time and was rightfully put in my place by FASA's own awesome Andrew), two maps, one weapon, and one item, and then go and charge $13 for it? Of course not!   It seems to me that at one point in time, the Mech Paks were to be some sort of larger multiplayer-centric expansion for Vengeance. But then somewhere along the way someone realized that such an expansion would not be profitable, so they were diced up and later reconstituted into these minor extensions. It must have been thought that the hardcore fan will buy all the packs, but the greater gaming populous would still be likely to buy at least one of them.   That's the best I can figure, anyway. I mean, the amazing Mercenaries, which I am greatly anticipating (I played it; it's awesome), is just on the horizon and looks fantastic, and yet we get these...why? To milk the license and the customer? Vengeance should be allowed to rest.   Like the Inner Sphere Pak before it, what is included here also isn't of exceptional quality. The mechs are better, but still aren't the awesome ones that you scream about when lost and swoon over when victorious. They don't come with perfect loadouts that make you content with the way they were born. They're just four more in the already large selection of walking tanks. Madcats and Thors will still no doubt be the name of the day, forcing the faceless but not hated new to take a backseat (even after both expansions I still use my custom Bushwacker almost exclusively, though I did really enjoy seeing the Kodiak and Cauldron Born).   The weapon and items are again similarly decent, but still nothing amazing. Would you pay to get a more advanced zoom and a new kind of medium range missile? Again, the answer is a resounding nope.   What did you think of the Clan Mech Pak?  And there's even a few problems with it all. Firstly, the price is atrocious. Adding up both Clan and Sphere Paks in terms of price ($26) and content (jack) wouldn't equal a normal expansion or quality budget title. Thankfully, unlike what happened with the Inner Sphere Pak, I've yet to see the two new maps available for free and legal download on prominent gaming websites. And finally, just like before, installing this newest Mech Pak on top of a version of Vengeance not yet patched or any kind of Black Knight, will most likely result in some kind of problem, I still experienced one on nearly every single system I installed it on.  I'll be honest (because everything else I say is a complete fabrication). When I began this review I had even less of an idea of what I was going to say than when I did the first Pak. Imagine that, an IGN editor most teased for his verbose and often pedantic writing not knowing what to say. See, I love MechWarrior. Every chance I get I boast the series as one of the best ever. I own all of the games (and even several iterations of each), am hotly anticipating Mercenaries and MW5, and I even picked up the PSX version simply because. Yet here I am, sorely disappointed and utterly confused as to how I could be in the position of rating a game that isn't even a game for the second time!Like its predecessor, this Mech Pack is just a small collection of things to attach to a bigger, livelier thing. Unfortunately, this collection does not add nearly enough to the whole to be worthwhile or to justify its price (any price). Furthermore, what little it does add is not anything of merit or greatness. I'm going to top this off with something I told Stephen back when I wrote the Inner Sphere review. ~For fifteen dollars I can buy Serious Sam. For twenty dollars I can buy a Starlancer, Crimson Skies, Metal Gear Action Pack. For free I can download hundreds of characters for Freedom Force, and just as many user created campaigns. Why would I want this?~ Saving this third son is the father. MechWarrior 4 is still a great, great game. But, only true Clanners who scorn free births at every turn need apply here, and then only if they are hardcore multiplayer pilots. Everyone else be like me and keep patiently waiting for the killer Mercenaries.", "date": "Aug 29, 2002"}