{"name": "Turok: Evolution", "name_review": "Turok: Evolution", "ref": "https://www.ign.com/articles/2002/09/03/turok-evolution", "text": "With the trend of bringing first-person shooters to the Game Boy Advance, it's kind of amazing that Acclaim didn't take the ambitious route and try their hands at the genre for the company's first Turok title for the GBA. Not that we're disappointed with what the company produced for the system...Acclaim commissioned European GBA developer RFX Interactive to produce the portable Turok: Evolution as an action-packed sidescroller, and the two companies succeeded really well. Don't expect the same style of action as the console games, but do expect a whole lot of stuff to blow up. And that's what Turok's all about, right? Features More than six different areas Two selectable characters Password save Link cable support for two players (multi-cartridge) Only for Game Boy Advance Turok Evolution for the GBA basically builds its design from two classic games. Most of the game takes place in a side-scrolling shooter that's very much like Konami's Contra series, putting players in the role of Tal'set (traditional Native American Turok) or Djunn (Beefy mercenary-type) to blast away the near endless wave of enemy soldiers, lizard-dudes, dinosaurs, and horrors of nature. The second, less frequent style of level uses the old arcade titles Nam 75 and Cabal to shake up the variety a bit...offering a fun ~into the screen~ shooter-style series of challenges. Both levels offer the traditional Turok weapons overkill; both characters are nearly identical in control other than their default weapons (Tal'set uses a tomahawk, Djunn weilds a strong grappler), so they both can pick up and utilize seriously powerful weapons such as machine guns, shotguns, flamethrowers, homing missiles, and more. If you like things that blow up in a puddle of goo, you'll definitely appreciate what the developers did in this GBA title.  The side-scrolling level designs are a healthy balance of exploration and simple run-left-to-right action, with only a basic use of platform hopping. The game's extremely tight controls make it incredibly easy to march forward with guns blazing, while still being able to turn around quickly to pop off a few shots at approaching enemies from the rear. This game isn't a mindless shooter; the way the levels are designed, players will definitely have to play it conservatively in many instances...lose all your health, and it's right back to the beginning of the level. If the going gets too rough, Turok Evolution even offers a great two player cooperative mode via the link cable...making it feel even more like the games it borrows its ideas from.  There are only two real issues with this game's design. First, of course, is its use of password save to record progress. The level password is only a mere four slots of 16 different characters, but you also have to record the ~weapons password,~ which is ten slots of these 16 characters. Honestly, if the password has to be this long...the best bet is to spend the extra dough and give the kids a break by offering cartridge save.   Number two is the game design's dependence on respawning characters, and its somewhat poor implementation of this ~feature.~ To make the game harder, the developers constantly teleport enemies into the area...which is admittedly kind of an unimaginative way to spice up the action. The issue here is, in several places you definitely have to stop and park to take out large doors, tanks, dinosaurs...and while you're sitting there, enemy characters suddenly warp in out of nowhere right on top of your player. Now, the game takes this into account and wipes them out if you're firing your weapon when they appear...but honestly, the programming should know better. If you must respawn characters, don't do it on top of the player.  But even with these problems, Turok Evolution on the GBA is a great, if a little short, action shooter on the handheld with excellent attention to detail in the graphical presentation. The pixel art is outstanding, with well-drawn backgrounds and extremely fluid animation; characters even have little blasts of light drawn on their fronts when they fire their weapons. Sprite effects are used sparingly but effectively...dead dinosaurs ~melt~ out of existence when you put enough bullets into them, for example. Areas even use an extra scrolling background to offer appropriate mood, like the slowly creeping, transparent mist in the second level. As unimaginative and average as the console versions of Turok Evolution are, it's great to see how well the Game Boy Advance title turned out. Sure, it's not exactly an original development either since it really lifts its game design from previously successful classics...but the developers built a game based on ideas that work, while including the Turok flair. The tight controls and constant action give this side-scroller the incredible rush that makes a successful shooter. It's a little on the short side, and that password save is a real drag...but other than those issues, Acclaim and developer RFX have a great GBA title under their belts.", "date": "Sep 3, 2002"}