{"name": "Pandemonium!", "name_review": "Pandemonium", "ref": "https://www.ign.com/articles/1996/12/14/pandemonium-2", "text": "With all the hype that the PlayStation is such a wonderful 3D machine and all that, you'd wonder why more games aren't in true 3D. I mean, if Tomb Raider can do it, and do it so beautifully (I'm talking about the game here, not just its heroine), why can't games like Crash Bandicoot, or for that matter, Pandemonium?   Developers will tell you time and time again that it's extremely difficult to program a game in 3D. Alright, I'll give you that. My favorite, though, is that gamers will have too much trouble if it's not on a track. Excuse me? Anyone out there confused by that pesky third dimension? We live in three dimensions for crissakes! It's not like we're all PaRappa or something.   Tirades aside, Pandemonium is a solid attempt at spicing up the old 2D platformer. Nikki the sorceress has accidentally summoned a huge monster, who is now going around being generally nasty. You and Fargus, the freaky court jester, must pass through 18 levels of wacky platforms and goofy enemies to get to the wish place, where you'll defeat the monster.   Two things separate Pandemonium from the other platformers currently making the rounds: two different characters to play as, and weird levels. Before you enter a level, you can choose either of the stars. Nikki has a double jump, and is the most useful, as a lot of the levels require you to leave the ground path and jump on bugs and such. Fargus has a rolling attack, like Crash's spin-dash, and isn't nearly as useful.   As for the levels, they are pretty cool. Crystal Dynamics have done a good job at putting a new spin on the standard jump on the monsters' heads and bounce up to the next platform thing. One of the more interesting levels features a stream of air constantly blowing around, requiring you to navigate through the current.   But you're still confined to a track. try as I could, I still couldn't get past that. Occasionally, the path will split, offering you a choice of tracks. But nowhere does it offer up that holiest of holy game options, the Z path. Oh, mighty zed, where are you? To Crystal Dynamic's credit, the PlayStation controller wasn't designed very well for 3D (hello? analog?), but at least Crash had some depth of field.   To break it down, Pandemonium is fun. It made me smile, it made me frustrated a few times like a good platformer should. You just can't help but feel it could've benefited from another plane. It's like finally getting to drive a car, and then being forced back on your bike. It's familiar, and you like it just fine, but it sure ain't no car!  Pandemonium has its shining moments when it comes to fun, reflex driven jumping and fun N-Gage Arena play, but is harbored by its limited field of vision. It takes advantage of the N-Gage's graphical capabilities with its array of colorful levels, but left us unsatisfied in the audio department. Pandemonium would be a good choice for hardcore platforming fanatics looking for a little mindless but fun jumping action, but warrants a trial-rent for others.", "date": "Dec 14, 1996"}