{"name": "Blade II", "name_review": "Blade II Review", "ref": "https://www.ign.com/articles/2002/09/04/blade-ii-review", "text": "was a little known Marvel comic until it was brought to the big screens several years ago with Wesley Snipes in the title role.  The sequel hit theaters earlier this year and has now hit DVD as well.  To coincide with the DVD release, Activision is bringing Blade II to Xbox and PS2.  While the game isn't the worst you'll ever play, it's certainly not one you'll want to buy.  Fans of the series (we'll assume there are plenty of you out there) won't find much beyond bad controls and repetitive gameplay.  We could stop there, but then this would be one heck of a short review.  Features  360 degree combat system Utilize powerful abilities, like Blade's sword and super-strength Use weapons like pistols, shotguns, and Blade's decapitating glaive Rated M 4-channel Surround Sound  The Story Born the son of a woman bitten by a vampire, Blade is half-human/half-vamp.  This gives him many of the gifts of a vampire (super strength, amazing agility, a bad attitude) and few of the drawbacks (he can walk in sunlight and he's not dead).  Not accepted as a human or a vampire, Blade lives as an outsider, one determined to put an end to the vampire scourge.  Blade II the game comes six months after the events of the movie sharing the same title.  It's a pretty simple premise -- bad guys want to do bad things and only Blade can stop them and save the world.  With the help of his mentor Whistler, Blade must face off against hordes of undead using a small variety of weapons and his super-human prowess and skills.    Gameplay Blade II makes an attempt at innovation with a fighting system meant to represent 360 degree versatility.  The right thumbstick's sole purpose is for pulling off martial arts maneuvers.  You will never press a face button to perform an act of hand-to hand violence.  There are eight positions with up, down, left, right, and diagonals.  You push the thumbstick in the direction you wish to attack and an attack is made.  This is difficult to get a hold of at first and will put many people off the game instantly.  But as strange as the concept seems, it isn't that bad once you get used to it.  However, that's not to say it works all that well.  In fact, the game would have done better to eschew innovation altogether and gone a more traditional (and enjoyable) route.  There are problems beyond the uncomfortable feeling of something very different.  You don't get to choose to punch one fellah and then kick another.  Instead, the direction of the attack determines what the attack is.  For example, pushing the thumbstick forward will always result in a punch.  The first push backwards, always a kick.  And it's the same kick and the same punch each time.  You can pull off combos, which require that you make thumbstick moves in a slow rhythm.  This is antithetical to what gamers are used to in an action game.  You're supposed to pull off button and direction movements in a flurry.  But here, to pull off combos (and their variation is quite limited) you have to actually show patience.  Pushing left, left, left quickly will only result in the same movement and not a combo.  Instead you must go left, (pause), left, (pause), left.  It may sound easy, and it is in practice, but breaking down your indoctrinated habits isn't nearly so simple (or pleasant).  That's not to say bringing something new to an old genre is bad.  But often the first try at anything is bound to have some flaws.  And here, Blade II has some pretty big shortcomings.  The combat system would seem like it was some robust beast with a ton of depth to discover.  In truth, once you train yourself to use the combo system, there's really not that much there.  Attacks get pretty standard and you don't really learn anything new as the game progresses, you merely grow your arsenal.        The combat system seems to be begging for more.  Chains, grabs, fluidity.  But those things are absent.  Because you have to use the thumbstick, and because the thumbstick represents the direction of an attack and the attack itself, combat seems very stilted.  The minute you begin fighting, you stop progressing forward.  There's no sense of what makes Blade cool in the movies and the comics. Blade doesn't just stand around letting himself be surrounded.  What's the point of speed and agility if you don't get to use it?  But every time you stop to beat someone up, you give about a half-dozen other vamps the opportunity to come and gang up on you.  Once surrounded, you really have no choice but to keep fighting.   Oddly enough, this is where the 360-degree fighting comes in handy, because you will often be surrounded and will need to use this system to fend for yourself.  And overall it's not a bad idea, but its implementation is lacking here.  There's not enough variety and certainly not enough freedom.  I felt trapped after just a few hours, like I was forever forced into an endless repetition.  Somehow that's not so offensive when you are pressing face buttons in a variety of patterns (as in standard action games), but using the thumbstick to do the same moves again and again seems trite.  Truth be told, the developers didn't go far enough.  If you are going to use the thumbstick for all attacks, then use it to its full capabilities.  A thumbstick can do a lot more than just up, or down, or left, or right.  Why not have projectile moves?  Or any of a variety of standard fighting moves?  Blade II stops short, and it pays for it.  The innovation could have been something for people to chitter-chatter about excitedly, but instead it will likely be a point of contention among those who purchase the game.  It certainly didn't make me shine to the game.      Another quibble before moving on.  Vampires, last I checked, required a beheading, dissolution in sunlight, or a stake through the heart to kill (or, in the case of the Blade movies, to the face or wherever).  But in Blade II the game, all it takes are a few punches from the title character to send the demons back to the afterlife.  What makes another vampire game, Buffy the Vampire Slayer, so good is that there is an added challenge to staking and killing a vampire.  Here, it's just a straight beat-em-up.  And honestly, those you are fighting could be militants, thugs, zombies, ghouls, Nintendo fans, or pirates just as much as they could be vampires.  You could easily (and maybe this is the point) slip in any other skin and still have valid deaths.  So fighting vampires now becomes a little less special, a little less unique to the vampire genre, and a bit too standard.  Rage Being half vampire has its advantages.  As Blade fights and pulls off combos, he increases his rage meter.  The more he satiates his bloodlust, the more powerful he becomes.  At first he gains the ability to use his sword.  Then, as the rage increases, he gains a shield of invulnerability, and finally increased strength.  The strength is great because punches and kicks send enemies flying.  It's almost too bad this wasn't the norm in the game.  The game really kicks in when you wield your sword.  When your rage is up enough, press B and you'll draw your sword.  The attacks then remain the same as with unarmed combat.  Pushing in a direction causes an attack.  The sword is a lot of fun.  The deaths are more gruesome and the combat becomes fluid.  What doesn't make sense is why your rage needs to be increased to use a sword.  I mean, it's a sword.  If there was something special about the sword (other than it being silver) that would make sense.  But it seems like a very forced gameplay limitation.  Weapons Blade has a small assortment of weapons, which increase as the game progresses.  At first, you'll only have an automatic pistol.  As your score increases, you'll unlock new weapons, such as a shotgun, a glaive (think decapitating Batarang), and spiky brass knuckles (actually, they're silver).  You only have a few weapon slots available for each mission, meaning that even if everything is unlocked, you can only take some of your goodies.  A shotgun takes up two slots, but is worth the power.  Even bullets take up a slot.  This is a nice touch and keeps you from being too overpowering in the later stages, even if everything is unlocked.      Weapons are selected with the D-Pad or the White button.  Just aim (by turning with the left thumbstick) and fire with the A button.  The selection of arms is very small, but keeps in line with the movies.  No obligatory flamethrower here (sorry).  But that's not so bad.  It's kind of cool that things are kept a bit more reasonable.  If the combat system were more robust and open, the weapons would make a perfect fit.  The only real problem with the weapons is that you can still do martial arts attacks with one in your hand.  Yeah, sure, you should be able to kick a guy even if you are holding a pistol, but you shouldn't be punching him with your pistol hand as if nothing were in it.  It looks strange and feels cheap.  You can basically keep your pistol out all the time, fight hand-to-hand when you want and pull the trigger at your will.    Your mission, should you choose to accept it... Missions are pretty basic and are mainly the same throughout the game.  You need to kill every vampire in sight and destroy or find the requisite number of objects.  Those items change each mission, but that doesn't change the basis of the mission.  And that gets old pretty fast.  The only thing new in Blade II is how combat works.  But everything else lacks any sense of ingenuity or freshness.  It's basically run and gun stuff.  And that would work fine if either the running or the gunning were consistently enjoyable.  But these things get stale too fast.  There are patches of Blade II that are good.  Times where I play and think, ~This ain't half bad.~  The rest of the time, though, I am struggling to get to the next ain't-half-bad portion.  And those bits are too far apart to make the game stand up as anything more than a momentary distraction in video game life.  AI anyone? Blade II has a frustrating habit of mish-mosh AI.  It's almost bipolar.  Sometimes the AI is ramped up.  You kill a few vamps and their surviving buddy runs away.  Makes sense.  Other times, you waste six vampires in a crowd and the three blokes next to him stand still as if nothings happening.  They don't run, they don't attack.  They just stand and wait for death.  Not like a deer in headlights, but more like a character stuck in their routine animation.  If the AI were consistent, it would be a dandy addition.  But there are too many times where I found myself yelling at the vampires to stop standing around like dead people and do something.  Graphics Blade II isn't a stunning example of the Xbox at work.  The character models are decent, but the animations are repetitive and there isn't enough variety to keep the game visual stimulating.  Levels have some variety, though parking garages are boring, there's nothing wrong with battling at a vampire Disco Tech.  The lighting leaves much to be desired.  There have been much better examples of how good lighting can really make an Xbox game shine.  Here, it just keeps it feeling flat.  The colors are a bit drab, though I suppose that's what you get with the undead.  The game gets a little choppy, especially when Blade gets frisky with a dozen vamps at once, but it's not enough to hurt the gameplay.  There are some jaggies too in some areas.  Nothing will wow you in Blade II.  Not the lighting, the animations, the textures, or the framerate.  No chances were taken on doing something unique visually.  And that, again, seems strange when considering the big risk taken with the fighting game.  If you're going to roll the dice on your combat system, might as well get ballsy with the rest of the production.    Sound A big strike right off the bat for not having 5.1 Dolby Digital.  Instead, Blade II goes for a rather meek 4.0 mix, with some mild surround effects.  You will hear things like cars behind you and such, but for the most part, the game will sound like it's merely in stereo.  The music is repetitive and seems derivative of your standard action titles and the sound effects leave a bit to be desired.  The weapon fire seems piddling and Blade manages just a small stock of quips to keep you entertained.  The voice acting is pretty good, though.  Even without Wesley Snipes, Blade comes off convincingly as a bad ass.  The supporting cast does a good job as well and the voice acting is certainly the strong point of the sound. The results are not mixed.  It's pretty much all bad.  To put it quite succinctly -- the game bites.  It's not a horrible game.  In fact, it's pretty average.  The fighting convention hurts a lot, because it's a bit too weak to pull off the desired innovation.  And then the rest of the game feels pretty much like your typical action stuff with nothing standing out beyond the frustration of the controls.  A valiant effort, but one that falls far short of excellence or even solid success.  It's probably not a bad choice for a rental, but definitely not one to buy without trying out first.", "date": "Sep 4, 2002"}