{"name": "Animal Crossing", "name_review": "Animal Crossing Review", "ref": "https://www.ign.com/articles/2002/09/05/animal-crossing-review", "text": "Leave it to Nintendo to take life's most mundane tasks and turn them into something fun. Best described as a mixture between Harvest Moon, The Sims, and a classic game compilation, Animal Crossing arrives on GameCube with all the trimmings that usually make games flop: an unknown license, so-so graphics, mediocre sound, and game mechanics that sound more like chores than fun. And yet, this game will certainly not be a flop -- not if Nintendo's legions of fans have anything to say about it. Play this game for a few days and you'll be hooked, and by the very design of the title, you'll tell your friends about it. Because having a friend who plays Animal Crossing is what makes this game so great. It's an essential part of what the game is all about. Call it an online game without actually being online. It's a communication game both inside and outside the actual gameplay experience. Get into it, and this will become one of the most important links you'll ever click on.Features Utilizes GameCube's real-time clock that parallels the real 24/7 world Four seasons: Winter, Spring, Summer, Fall Make friends in the forest, help them run chores, and write them letters Wear numerous outfits, use tools, work, buy your own house Transfer your character to your friends' Animal Crossing and explore their towns Play classic NES games in various houses Collect insects, fish, dig, chop down trees and more! Up to four players -- friends, family, or both -- can exist in the world you create Animal Crossing Memory Card (with special NES gift data) included Link up with the Game Boy Advance for data trading, e-Reader connectivity, and mini-games New password feature enables item trading over the InternetGameplayJust to give you a little bit of background info on the game, Animal Crossing is the brainchild of NCL's Takashi Tezuka, Shigeru Miyamoto's right-hand man. Released in Japan early last year on N64 as Animal Forest and later on GameCube as Animal Forest +, Animal Crossing is an every-day life game set in a small forest community populated by talking animals. As the only human in the village (although your character looks more like a rag doll), you buy a small house and slowly start to figure out what Animal Crossing is all about. This game is not about exploring sprawling levels or pushing about blocks to open up doors. Animal Crossing lets you become part of a quiet little community, with all its relationships, daily chores, tons of collectible stuff, and occasional excitements. Animals will ask you to retrieve or deliver items for them, you will write letters to them via a simple typing interface, you'll dig for fossils and donate them to a local museum, you'll try to earn money by selling fish, insects, shells and pretty much everything else you can find in the town, which in turn you'll use to upgrade your house and decorate it with furniture. As a matter of fact, some of the things you can do in Animal Crossing wouldn't be considered fun at all were they to take place in real life. But that's the beauty of the game. You don't have to do them. Don't want to be nice to the talking duck and help him find his lost glasses? Fine, don't do it. Not interested in catching fish? Sell your fishing rod and never use it again. Or better yet, sell it to your little brother. Intrigued? Read on.That Mario picture on Peer's house's door was transfered into the game from a trading card via the GBA e-Reader. The Shine on the sign to the right was home-made, as were the lovely ghost duds. Like the N64 original, Animal Crossing takes a hint from the trading frenzy sparked by Nintendo's own Pokemon games, then expands on it to stress communication both inside and outside of the game. A family member who plays the game when you're not home enriches the gameplay experience as much as a friend who owns another copy of the game. Up to four players can move into one village (you can't play at the same time, though, only successively). When player #1 is playing, he or she can check out the other players' houses, send them letters or gifts, or leave them messages on a bulletin board. This creates an interesting dynamic that makes it feel like you're living in a village with real people. It's really a perfect game for families as the parents can hide treasures and leave tips for their kids on how to find them. Siblings on the other hand will enjoy the rivalry of what items they have collected and how they can tease their brother or sister by setting traps, teaching the animals ~catch phrases~ (see picture on the next page), and the like.But multiple players sharing one memory card (which is included with the game, by the way) is only the beginning. If your friend has a copy of the game, he can stick his memory card into the second card slot and you can depart your village to go and visit his. Since the villages are randomized when your first play the game, you will see completely different animals, items unique to the other village, and even fruit trees that don't grow in yours. For example, your village may be limited to cherry trees. Bring back a pear from your friend's village and plant it to grow pear trees (and later get pears) in your own town. Any fruit not indigenous to your village will fetch a higher market value when sold. But there's more. Once you talk to the animals in your friend's village, they will know you and start referring to you. Send them letters while you're visiting and they may even show your letters to your friend from time to time. And if they like you or they're not completely happy with the village they live in, they will actually move away from your friend's village -- and into yours. Although this sounds like something only possible in an online game, Nintendo pulls the illusion of connectivity off masterfully. The secret lies in the real-time clock.In a stroke of genius, Nintendo endowed Animal Crossing with a clock and calendar that mimics the real world. If your GameCube clock and date are set correctly, it will be September 16 in the real world and in the game. This data is used to synch gameplay events to actual goings-on in the real world. Deal with trick-or-treaters on Halloween or get gifts on the non-denominational ~Toy Day~ on the 23rd of December. An in-game calendar will tell you when all these special events take place, but there's far more going on in Animal Crossing than just holiday celebrations. Build a snowman in winter, enter a fishing competition in fall, work out at 6:00 AM in the morning (IGNpocket editor Craig Harris has been known to do this to strengthen his thumb muscles after long, sleepless nights...), meet traveling salesmen, catch salmon when they're spawning, and much more. Certain insects and fish will only appear in certain months, enticing you to replay Animal Crossing again and again. Curious to see what goes on in town after midnight? The game rewards your curiosity more often than not -- and the more you play Animal Forest, the more you realize that this game is deeper than you may have thought.There are lots of different layers of gameplay, some of which may be forever hidden from the player. At the very heart of the game is a sense that adventure can be found in your very own backyard. You don't need to travel to far-away lands and rescue a princess. The game definitely seeks to teach players that doing everyday things can be fun and interesting, too. And nature and communication are at the center of it all. Some animals will not like you because you don't talk to them much. Your luck can be affected by how you arrange your furniture in your house (yes, you read correctly. The game uses Feng-shui!). Your house is graded based on how well you decorate your living room. Some animals may move away because the natural balance of your town is upset by too few or too many trees. Don't like your wallpaper? Design your own using a built-in design tool that lets you create patterns for use on signs, clothes, umbrellas, or in your house. Heck, there's even a mini-stock market of sorts where you buy turnips at the current market price and sell them high to make money.No, this bear named Tutu didn't originally talk like this. Peer taught him. Like Peer taught Fran's animals to say a lot of things... Then there are the hidden NES games. While other companies release classic compilations, Nintendo took many of its beloved classic NES games and hid them in Animal Crossing. High profile titles like Donkey Kong, Excitebike, Pinball, and Balloon Fight are all perfectly emulated and playable whenever you want once you've collected them. Even better, Animal Crossing saves your personal records in all the NES titles -- and, at the risk of sounding like a broken record -- there's still more. Japanese gamers were able to unlock blockbuster NES games like The Legend of Zelda and Super Mario Bros. through special Nintendo promotions, so chances are that they will be included in the US version as well. There is just so much in Animal Crossing, it's tough to include it all in our short little review. Nor would we want to, because playing Animal Crossing is all about discovering new things. Trust us, you'll try to play every day just to see what's going to happen next.There is so much room for creativity, from designing your own clothes (dig our custom shirts on the left) to a simple village tune. Bonus points if you can figure out what the music is on the right.But as great and addictive as the gameplay is, there are some problems as well. Animal Crossing is a communication game, not an adventure like Zelda despite the graphical resemblances to games like A Link to the Past. While one can't fault a game for not being something that it's not supposed to be Animal Crossing didn't have to feel as confined as it does. Mind you, this is not something that will come up during your first month of gameplay, but since the idea is to sustain your interest in Animal Crossing for as much as a year or more, there should have been at least a hint of life outside the village for all those gamers who don't have siblings or friends to trade items with all the time. The different festivals, diverse collectibles, and clever gameplay options ensure that you will come back often, but how cool would it have been if Nintendo had implemented small side quests like a hidden cave that you stumble upon by digging in a random place, a secret island, a train trip to an unknown store, Majora's Mask-style storylines that play out between certain characters... One of the great things about other Nintendo games is that there are always hints of future adventures that keep you going and excited about things to come. It can be as simple as a locked door, a pipe you can't reach yet, an invisible block, or something sparkling at the bottom of a lake. Even though Animal Crossing has tools that enable you to cut down trees, catch fish, or dig holes, you get your hands on all of them very early on. There is no hammer to let you advance to a secret area by smashing a rock. The promise of being able to play more NES games in the future is a big incentive, but ultimately, the little teasers to entice you to return to Animal Crossing every day after you've upgraded your house to its maximum size may not be enough for some. However, since this is likely to occur after having played the game for more than a month -- which is about 29 days more than you'd spend on most other console games -- this is really a minor quibble. Add to that a new password system unique to the US version that allows you to easily trade items with gamers over the web, the phone, or by e-mail, and you've got a game that easily overcomes its limited playfield and has the potential to last forever.What is a problem and will definitely start to annoy you after some time, though, is the interface. Donating an item to the museum will often force you to wade through tons and tons of text you've seen a million times before, as will buying stuff, or taking a trip to the GBA island (more about this below). That's not to say Nintendo hasn't improved the GameCube version over its N64 predecessor. You can now sell multiple items at once and easily store old letters for safekeeping, but actually writing a letter is still a pain in the butt. Without the ability to hook up a keyboard, writing the animals one-letter-at-the-time isn't fun. A system that let you identify often-used words and map them to specific letters on the virtual keyboard would have gone a long way. And considering the major role communication plays in the game, a better word recognition system would also have been in order. It's not like there's not enough space on the disk to include a large dictionary. We've seen way too many ~Huh, I couldn't understand your letter!~ responses after sending the simplest and most meticulously crafted baby letters, like: ~Hello! I ate a cherry today. I like you. Here is a cherry for you as a present.~But interface issues aside, Animal Crossing remains one of the most unique and entertaining titles so far this year. The US release in particular once again shows Nintendo's desire to constantly improve its games as there's tons of stuff here that didn't make it into the Japanese version, like campers that visit your town, new NES games, new furniture, the password system, and new GBA connectivity options. The English translation is smart and often witty, filled with puns and lots of references for Japan buffs (the Kappa's name is Kapp'n, for example; the Tanuki's name is Tom Nook). Hats off to the folks who worked hard on localizing this no doubt problematic title.ConnectivityShow your friends the stuff you can do in Animal Crossing and we guarantee you they will shake their heads in disbelief. Hook up a Game Boy Advance to your GameCube and transfer Excitebike to your handheld and play it there. Design clothes on the go, then upload them to the GCN and put them up for display. Travel to a GBA-only island, then feed an animal on your GBA and reap the benefits once you return on GameCube. Trade an island with a friend. Scan an Animal Crossing trading card and receive a letter, song, or classic Nintendo pattern. With so much going on around the game, we're surprised Animal Crossing wasn't Nintendo's first-ever online title to promote the release of the broadband adapter and modem. Still, the GameCube to GBA connectivity and inclusion of trading cards may sound gimmicky, but it all adds even more enjoyment to an already great game.Thank Dog for the basement! All the stuff you want to keep but don't want in your living room can safely be stashed here without affecting your HRA rating. GraphicsAnimal Forest looked simple when it arrived on N64, but now in the days of Star Fox Adventures and Metroid it looks very outdated. Nintendo added some lighting effects to the flat look of the N64 original, but other than that the game's graphical style and presentation is very basic. The overall look is akin to a picture book, with geometric shapes and stylized design elements instead of realistic grass or wood textures, all presented from a classic top down perspective. But despite the low-res textures (some of the objects and faces look terrible when viewed close up), Animal Crossing is actually a very pleasant game to look at. The vibrant colors and the cute and often humorous animal designs really make the game come to life. Sadly, the main character is a bit of an odd choice. Considering that one of Nintendo's biggest strengths lies in the creation of memorable characters, it's disappointing when the protagonist of a game is so vastly overshadowed by the other inhabitants of the world. To us, being able to like a main character and identify with him or her makes a game instantly more enjoyable. The Animal Forest main character is just too generic and forgettable to be endearing. If the idea was to move the much more memorable supporting cast into the foreground, such as the singing dog K. K. Totakeke Slider or shop owner Tom Nook, then Nintendo should have given players the ability to design their character's face as well.SoundAnimal Crossing sounds exactly like the N64 game it was based on -- which in turn sounded a bit like a SNES game. The instrument samples are just so outdated one wonders when Nintendo will finally updated its libraries. In stark contrast to the quality of the audio comes the quality of the compositions. Nintendo's composers must have worked overtime to come up with the many different melodies you will hear when playing this game. Not only does the music change every hour of the day, Totakeke will sing a different song every Saturday -- which you can collect and play back on your in-game home stereo (the better your stereo, the better it will sound). Totakeke's repertoire is extensive and ranges from country to techno. The background music you hear while playing most of the game is low key and doesn't get old quickly, but nothing compares to Totakeke's riotous unplugged delivery of the different musical genres. Playing his guitar while ~singing~ the songs with robot-like voice synthesis (he only sings the notes, not actual words), it's hard not to laugh at Totakeke wailing ~do-reeeeeeeeeee-miiiiiiiiiii doooo!~ before howling like the dog that he is. The voice samples are incredibly cheesy, but it's deliberately funny and unforgettable. As a matter of fact, many editors at IGN have MP3 versions of some of Totakeke's music on their computers and will blast them at the most inopportune moments.Other than the often tinny instrument samples for most of the music, the sound effects are good all around, with realistic foot steps and tool noises, as well as pseudo speech synthesis for the animals' language (=Animalese). Basically, the words the animals say are played back letter by letter at high speeds, which leads to the occasional chuckle when you hear a high pitched ~OK?~ from one of your virtual buddies.How do you review a game that can stretch over the course of a year? Luckily, I've literally played both the N64 original and the Japanese GameCube version for months -- and I'm happy to report that I'm just as addicted to the US version. All I have to say is thank you, Nintendo, for finally bringing this little gem stateside. Animal Crossing is a charming game for players of all ages that's proof that Nintendo hasn't run out of ideas. Sure, you'll find a mixture of many familiar gameplay styles that we've seen in other games before, but combined they really come together to create a very unique and original game. That's not to say the game's appeal is universal. Hardcore gamers who are used to playing videogames for hours on end alone every day will quickly find that Animal Crossing isn't that kind of game. Unless you start to cheat and change your clock settings (the temptation to advance your clock will be there every day, but the game lasts much longer if you play by the rules), you can only play it for a few hours or so each day until you run out of things to do or you get bored with running errands that you've completed before. And even though you can enjoy the game by yourself, Animal Crossing really comes into its own when you're sharing the game with a few friends or siblings -- or you join an active message board like our own.I'm glad Nintendo is courageous enough to bring a game like Animal Crossing to an international audience. The last time the company did something like this, we ended up with Pokemon. While Animal Crossing may have a harder time appealing to older gamers because of the recent rise in popularity by M-rated games, it's most likely going to be word of mouth that will make this game a success. I hope my word helps out at the start of it all: Get this game. If you're all about action and exploration games, then Animal Crossing may be an acquired taste at first. Just like turn-based RPGs were considered too niche and tedious on Game Boy before Pokemon, Animal Crossing will hook you once you get past its quirky presentation and slower-paced gameplay. But if you're the kind of person who is willing to take chances and explore new game genres, this could turn into one of the most rewarding titles you've ever picked up. And if you're a Nintendo fan, there's just no way around it -- you simply have to play this game for the inclusion of the NES classics alone.Parents who are looking for the perfect game to play with their kids, take note. It doesn't get better than this. It's rare that a game comes along that's so well-designed that it breaks down age differences and can be enjoyed by kids and grown-ups alike. Buy it! One of my favorite games this year.", "date": "Sep 5, 2002"}