{"name": "Farscape", "name_review": "Farscape: The Game", "ref": "https://www.ign.com/articles/2002/09/09/farscape-the-game", "text": "It seems that there are fundamental problems with basing a computer game on a television franchise. First off, the development team will need years (most likely) to finish the game, so they will be basing the design on the show plot that will be incredibly outdated by the time the game comes out. Secondly, the people making it often have the opinion that the franchise itself is strong enough to sell the title, and gameplay be damned.   Sadly, Simon and Schuster and Red Lemon studios have done this to Farscape: The Game. The show is currently in Season 4, and the game takes place during Season 1. The crew is still concerned about Moya's baby, while current plotlines have...well, in case you don't want to be spoiled, I will just say the whole ~baby~ thread has moved on and is no longer a big plot point.    Moreover, yes, it does fall into the pit of, ~Hey, it's Farscape, so Farscape fans will buy it no matter how bad it is!~ Clever of them to release the game right when SciFi Network takes the show on one of its unexplained off-air times until it starts up again in January, so maybe fans will be jonesing for a new Farscape plot and buy the game out of withdrawal. (SciFi has this interesting habit of taking their #1 original show and refusing to show reruns of it...so once the new episodes are done, it goes off the air for a little while...but I digress.) [ed. They've just announced the cancellation of the show which pretty much puts the kibosh on syndication.]   You are playing John Crichton, of course, the Earthman who was shot through a wormhole and joined the renegade crew of Moya, a living spaceship. Through no fault of his own, he becomes hunted alongside the other renegades by the Peacekeepers, soldiers of a race that look exactly like Humans. Now, the Peacekeepers have attacked Moya and boarded her. Some of the crew are captured, some escape, and some hide aboard Moya. You begin the game controlling Crichton and Chiana, the unpredictable thief, who have crash-landed on a local planet.    What begins here is a third person 3D adventure game that is mostly devoid of fun.   You control either character, with the other one following behind or staying put, as you command them. The game warns you that the other people do have minds of their own, though, and proclaim this as if it is a fun feature. To stop them from wasting ammo and firing at every plant that tries to attack them, you must take away their weapon or tell them to hold their fire. Then, when they need to defend themselves, you must go back in and re-arm them.    The AI of the game is perplexing: flying bogies will follow you and attack even if you didn't do anything to them (again with the saving ammo intention). However, when you are playing tiny alien Rygel and trying to sneak around Moya in your little hover-throne, Peacekeepers you encounter will shoot at you, but not follow you. This leads me to believe that flying bogies are more intelligent than Peacekeepers -- which makes for a good Farscape in-joke but probably untrue. These guys are the most feared soldiers of the galaxy, and tactical thinking and chasing around little floating guys is very much in their job description.   Another puzzling feature of the game is the radar/map. It shows you not only every possible path you can take, but also where the bad guys are. No fog of war, no thrill of uncovering a hidden enemy, no surprises at all. The only challenge is that the map is tilted at an odd angle that makes it difficult to read at times.    The plot itself is a motley grouping of meaningless quests. People send you on quests to clear out Raiders, kill pests, or set an ambush. When you return to them, they most likely will tell you good job and not give you anything or advance the plot in a conceivable way. Maybe I'm too used to other quest-centered games, but if I'm going out there and putting my characters' butts on the line since the assigner of the quest ~doesn't have the manpower to protect the town AND set an ambush~ I expect more than a pat on my back for my trouble. Credits, weapons, ammo, health packs, something.... Sometimes I got in a loop of run out, kill beasties and plants, run back, sell the hides I got, use the money to replace the ammo I used on the beasties, and run back out. At least the monsters don't respawn.   The sound is one of the better aspects of the game. I'm guessing most of the budget for this game came in hiring Ben Browder, Claudia Black and the rest of the cast to do the voices, which are very well done. Plot points and dialogue are well acted and clearly spoken (except for obvious times when they are speaking over communicators), but the pat responses (like them warning you that enemies are ahead  not that you needed their notice with the radar telling you where all the enemies are) are fuzzy and muted.    What did you think of Farscape: The Game?   The graphics are hit and miss. The landscapes are attractive, indicating alien worlds or the inside of Moya with nice detail, although I don't remember Moya being that steamy on the show. The main character designs are also nice, faithful to the show and the characters. Some of the NPC character designs are poorly done, the sad folk looking fuzzy and distorted. Many of the levels have incomprehensible lighting, as if giants were wandering around moving flashlights around the ground.Farscape: The Game clearly falls into the trap of ~fun franchise, mediocre game.~ There is much they could have done to make this a fun adventure game, but alas, the franchise remains one to encounter on the television instead of on the computer.", "date": "Sep 9, 2002"}