{"name": "Dynasty Tactics", "name_review": "Dynasty Tactics", "ref": "https://www.ign.com/articles/2002/09/12/dynasty-tactics", "text": ", according to the folks we've talked to at Koei about it, is meant to bridge the gap somewhat between the company's two other major strategy series of the moment, Kessen and Romance of the Three Kingdoms.  As far as the type of gamers it will appeal to, it probably leans more in the latter direction than the former, but on the other hand, it shares Kessen's central motivation -- it's another attempt to strip down the sprawling Romance game design into something a little more focused.   In this case, the result is a grid-based skirmish-scale strategy game, at least visually reminiscent of Ogre Battle and its ilk.  Looks can be deceiving, though -- Dynasty Tactics is actually built around some very specific strategic elements, the challenge being to set them up and execute them in the exactly proper fashion.  One can play this like an ordinary skirmish game, walking around and trying to attack the other guy from behind, but the game's combination and link systems are far more complicated than that, albeit in a very specific way.   It's hard to find the appropriate analogy to explain this to someone who hasn't played the game.  Perhaps you could compare it to a chess endgame -- mate in six moves, and so on -- especially since a similar aptitude for forward thinking is required to set up different strategies appropriately.  Just for reference, I'm absolutely terrible at the endgame in chess, although I'm not so bad at openings, and the same trouble plagues me in Dynasty Tactics.  Even if I'm not very good at it, though, there's a certain breed of strategy fiend that should get a kick out of this game, and they'll be able to enjoy a sharp visual presentation along the way.   Gameplay  Dynasty Tactics includes three separate campaigns, one for each of the Three Kingdoms, each composed of a lengthy set of missions.  The objectives generally boil down to the usual for this type of genre -- assassinating a certain general, capturing a bit of territory, or simply destroying the entire enemy force -- but the mission settings do evolve substantially as the game goes on, with the addition of more complex geographical features like water, swamps, forests, fortresses, and so on.    Those are simply variables in the main equation, however, which is setting up your units in the proper configuration to execute big combination attacks.  Each general and army has different Tactics, special attacks it can perform given the appropriate positioning.  These Tactics have special effects of all sorts -- they move the attacking army in a certain way, push the target army around, deal extra damage under the right circumstances, and so on.  And they can work in concert, providing two armies set up their Tactics together.  One army can execute a Tactic that pushes an opponent within range of another's, and major fireworks result.   Learning how to set these sorts of attacks up properly can be a terrible headache for people like me, who just don't have the sort of mind that can get around this type of strategy.  Beginning players are likely to go through many disappointing episodes where enemies move out of range of carefully-laid combination Tactics, to the point where the effort isn't worth the frustration.  That's perfectly understandable -- this is not a game for everyone, as strategy games tend to be.  But there's also a class of strategy fan that could find this quite addicting.   The selection of Tactics is what makes the game work on its particularly narrow level.  Between regular Tactics and special skills particular to certain generals, there are dozens of different special attacks, on top of the basic variations in troop types, providing a huge breadth of potential strategies for players who possess the knack for setting them up.  That's the source of a peculiar contrast -- the potential for different strategies is vast, but putting them into effect requires dedicated precision.    Playing this game without paying attention to the combination tactics might be possible, but it would probably be a very unsatisfying experience, and more complex strategies become a must later on in the campaigns.  There are various odds and ends of ancillary strategy surrounding the core combat system -- developing a corps of generals and armies involves building their experience in combat, and there are special maneuvers for capturing enemy generals -- but this is a combat simulation first and foremost, rather than a total historical strategy simulation like the Sangokushi series.   Graphics  Tactics' visuals are an interesting blend of the very basic and the very detailed.  The main battle map looks just like the board for a simple tabletop wargame, with iconic 3D representations of armies and terrain features laid out over a simple grid.  There are some very pretty bits of 3D animation thrown in as well, though, seemingly for their own sake.  The execution of certain Tactics is occasionally accompanied by a realtime cutscene, similar to the ones in Kessen, showing an army executing some particularly dashing maneuver.   This is not a game that demands an exceptionally detailed graphical presentation, though.  The cutscenes are used sparingly, which is a wise decision -- they don't break up gameplay or grow too repetitive.  The fun of Dynasty Tactics isn't any particular sight or sound, but the satisfaction of managing to pull off a particularly elegant strategy.   Sound  Which is not to say it doesn't have quite the epic soundtrack in the Kessen mold, with effects neatly laid over the music to give the music an extra touch of realism.  There are some cool dynamic music adjustments, too, keeping a slow undercurrent during most of the battle, while picking up during key moments.  The English voices don't mesh exceptionally well, but this aspect of Koei's localizations does seem to be improving a bit since Kessen II.  If nothing else, Zhang Fei is a hoot...This is not a game with broad appeal.  In fact, this is a game that most people will roundly detest.  It will probably even drive players of other skirmish strategy games, Ogre Battle and the like, up the wall, because while it looks like those games, it doesn't play like them much at all.Dynasty Tactics is a game with very specific appeal, to players who can enjoy its exacting strategy gameplay.  I rather like Penny Arcade's take on the subject: ~This sort of game appeals to my most basic need, to arrange objects in a manner that maximizes harmony and minimizes discord.~  If that sounds like one of your basic needs as well, give it a go.", "date": "Sep 12, 2002"}