{"name": "Taz: Wanted", "name_review": "Taz: Wanted", "ref": "https://www.ign.com/articles/2002/09/17/taz-wanted-3", "text": "Infogrames is delivering interesting packages of joy with its Warner Brothers Looney Tunes licenses. Honestly, they aren't much to look at and they're designed to appeal to the lowest common denominator in gamers, but hidden within them are little treasure chests of atypically good design and unusually good gameplay.    After the simple yet innovative Looney Tunes Sheep Raider fell quietly into the drained PlayStation market, the harmless Looney Tunes Space Race followed on PS2 with little fanfare. Each offered visuals that closely resembled the Saturday morning cartoons, with flat shading and simple textures, and the sense of humor that made Warner Brothers' age-old cartoons so famous bridged the gap from TV to videogame.    Now we have the very familiar-looking platformer, Taz: Wanted. On the surface it's a straight-forward, by-the-numbers platformer using all of familiar ploys. Little is new. But after playing through a few levels and having goofed around with Taz's controls a bit, one can indeed see some creative, truly Loony Tunes-inspired work going on behind the scenes. If only more of it was able to shine through, Taz: Wanted would be a more highly desirable game.   Story  Taz is trouble no matter where he goes. He's a rough-and-tumble wild beast that either eats or destroys everything in his path. Plus, his breath is bad and he's got terrible teeth. In short, he's a problem waiting to happen. The introduction movie shows Taz ripping apart everybody's day, from Sylvester to Daffy Duck to Yosemite Sam himself, who's lucky numbers on a slot machine are slightly altered by Taz, infuriating Mr. Yosemite to take action.    In response, Yosemite Sam nabs Taz' girlfriend, referred to as the She-Devil, and h'e created a huge theme park in which Taz and his brethren are harbored. No doubt Yosemite Sam was nothing but a harmless old coot in the old Looney Tunes serials, but the man's always had ambition. So, when Sam catches Taz, we see he's been tossed into the Sam Francisco Zoo... Escape is easy for the whirling Taz, but staying free is the trick (and where the gameplay comes in). Sam has placed wanted posters of Taz all over the world. Only by destroying the signs can Taz hope to make his way to Tasmania to save hishoney.   Gameplay  As with nearly all platform games, the story is pretty much un-important, serving only as some kind of backdrop for the game's progression. Laid out much like the Crash Bandicoot series in structural design, Taz: Wanted is designed around the theme of a strange Yosemite Sam zoo, featuring all sorts of wild parts, from icy frozen mountains to jungles, swamps, hilly portions, and more. SAnd of course, animals of all kinds. The game breaks down into three small arenas within four larger worlds, and each smaller portion takes just about an hour or less to beat, not counting the bosses.    A complete 3D roaming platformer, Taz: Wanted shows off an interesting assortment of levels that may look initially like a slew of others, but after playing through numerous sections, I found that the missions and level designs are actually quite intriguing, and different enough to warrant a look at. Just in the first several missions, players find that the organic, flowing worlds are well tied together, providing a good map indicating where you should most likely find the Taz Wanted posters, and a nice, large landscape with high peaks from which to grab an overview of the entire level.    For instance, Taz must push strangely placed cars from high ridges over cliffs or outsmart bears to get at their honey. These objectives sound rather obvious, but in the context of the game, these simple missions form a giant whole that flows and plays well. What's smart about the game's design is that, just like in Looney Tunes Sheep Raider, the missions are based around the kinds of goofy, weird things that Taz would do in the cartoon. So, instead of plopping Taz into an unimaginative and generic world, the world around Taz is essentially one that looks and feels like the landscape he's encounter in a regular Taz cartoon.    Part of what works so well is that Taz: Wanted has a unique set of skills. He can perform the basic walk, run and jumps moves, but his special moves, such as the spin attack, the roar (which is him just trying to speak), and his chomp set him slightly off from the regular platformers. These sound pretty familiar I admit, but they're executed uniquely. The spin move has its own set of physics once initiated. There is no limit nor gauge, it's just Taz getting crazy. Press Square and the Dpad and you'll find yourself buzzing like a spinning top with its own set of physics. It's a wild, nearly out-of-control experience that's surprisingly sophisticated. The chomp is neat, too. It enables you to eat nearly anything, but Taz can spit the items out, using the masticated item as a projectile.   The game offers the perfunctory platform essentials, from collectibles to cash incentives and extra special items to collect. And in a likeable move, instead of too many things to collect, Taz must destroy a certain level of Yosemite Sam's theme park for an added bonus. He must avoid net-toting rangers as well as a strange, living punching box that hammers him with a giant boxing glove. Taz gets to change costumes quite often, too, via a Superman-inspired telephone booth; the costumes ranging from simple antlers to female clothing to other poor, unconvincing outfits. But the point isn't to convince anyone of Taz's slick wardrobe, it's for pure fun, and it helps to fool the rangers, too. Taz also must collect sandwiches for a bonus.   The point system works on a strict monetary basis. Taz earns money for destroying Sam's stuff, collecting goods, and getting the Taz Wanted posters, which total about even per level. In fact, as he collects more posters, Taz's bounty grows higher. If he's caught, he's put in a cage and you're charged with $500. But it's easy to simply spin out of the trap and move on, it just costs money. The bosses are standard, too, but just as with the rest of the game, they somehow fit into the bigger Loony Tunes universe, and for the most part he gameplay, bosses, and unqiue environments work relatively convincingly.    The biggest problems I encountered with Taz: Wanted appear are strangely small, but they add up quite heavily. While there are memorable parts in the game, there are some many little niggling points, along with a basic already-been-there look and feel that makes it hard to recommend this game to everyone. For instance, the skateboarding additions are barely passable. We are all well aware that skateboarding is cool -- Konami's Disney Skateboarding  points to the worldwide acceptance of the sport -- but nearly every one has played Tony Hawk's Pro Skater in one form or another, and anything less tight or well designed comes off as rubbish. Not to mention that the animations actually get in your way.   The mini-games are more tedious than fun, such as the, well, skateboarding games, for instance. The game is also well produced for the most part, but often times there is aggravating slowdown, and oddly placed cutscenes that seem out of place, or worse, badly edited. The camera work is quite excellent, so I have no qualms there. But with regard to some of Taz's basic moves, there is no double jump, and objects that Taz lands on, such as smaller logs, to be very specific, are annoying if not impossible, to gauge. Some other things kinda bugged me, but they weren't as bad. In the very first level, if you walk on the grass near the water, a wily alligator leaps out of the water and hammers you. It's shocking because it comes out of nowhere to bash you, and it's a little harsh, since there simply is now warning whatsoever.   Graphics  With a game like this, the visuals require little review. The game is designed with the most basic and simple of graphics styles. With a cel-shaded style that I'm not convinced is cel-shading, Taz: Wanted uses simple lines to define the characters and even, flat-shaded textures to fill them in with color, letting their shape form in your imagination. The idea is less equals more. These lines, however, are drawn with a thin pen, giving the character a weaker visual effect than heavier darker stroke's would produce.   The various levels are slightly more visually pleasing to the eye than the characters. And the game gives players a small range of special effects, such as reflections and particles, with silly animations, and lots of cutscenes thrown in for good measure. The cutscenes are weird: they don't feel as if they were edited well. They seem to happen after an odd amount of seconds, like an out-of-sync conversation or a badly edited movie.    Sound  On that same topic, the sound is also off. Just like the cutscenes, the sound is just enough of whack that it has an undesirable affect. And the voices are very much a matter of taste. I grew up with Mel Blanc's unmatchable voice antics, and I have yet to warm to his son's pretty good imitations. These sound like they're done by Mel's son, and from the top to the bottom, the voices of Sylvester, Yosemite Sam, Tweedy Bird, etc., etc., are mere shades of the original character's voices. Taz's voice is the closest, but his is also probably the easiest, since he really doesn't talk per say.Taz: Wanted is a game that's better than the average platformer in many ways, and in most aspects of its production, it's poorly executed. The mish-mash effect of the occasional gems of hidden gameplay in between long lengths of average play, which is then poorly complemented by less than stellar graphics and weaker than desired voice samples and sound effects, creates a disturbing out of kilter feeling. I wasn't sure whether the next level would bring fun or misery...or bad editing. And while I'm always up for being thrown off balance, it better be by design, not mistake, and I'm not sure whether Blitz Games knew one way or the other. Overall, Taz: Wanted is a decent game worth about 8-10 hours of your time, given your level of interest in Looney Tunes' Taz the Tasmanian devil. In short, rent this before you buy it.", "date": "Sep 17, 2002"}