{"name": "The Scorpion King: Rise of the Akkadian", "name_review": "The Scorpion King: Rise of the Akkadian", "ref": "https://www.ign.com/articles/2002/09/18/the-scorpion-king-rise-of-the-akkadian", "text": "One of the better performing action movies of this past season, The Scorpion King was similar to the genre films of the 1980s -- an unabashed roller coaster thrill ride with little substance. Nothing more than a vehicle to show off its main stars, the Mummy-based prequel asked the viewer to sit down and forget about their troubles while the onscreen special effects and fight sequences took them on a 90-minute journey for the senses. And while the critics were split as to how enjoyable the film actually was, audiences took to it like flies at a picnic.Only weeks away from the DVD release of the Universal-produced film, the Interactive branch of the motion picture studio will release The Scorpion King: Rise of the Akkadian the videogame. Taking place before the events of the film, Akkadian is heralded by Universal as a terrific companion piece to the movie, and younger fans of the fantasy adventure will surely get a kick out of it. But for grizzled old veterans of the action game realm, the Point of View developed movie piece leaves a lot to be desired.FeaturesNon-stop hand-to-hand and weapon-based fightingCombo system lets you perform a number of different movesEach weapon can be powered up in multiple waysCrush evil as you travel through 12 different environments including The Island of Crete and the NetherworldFeatures the voice of The RockGameplaySet quite sometime before the motion picture, Rise of the Akkadiantells the story of a young Mathayus (Dwayne ~The Rock~ Johnson) and hisdesire to become a great warrior. Starting from his initial ambition tobecome a member of an elite assassins guild known as the Akkadians, all theway to his rise as a prominent monarchial bad ass, the videogame is about asplot oriented as the movie itself.After a quick tutorial in his hometown, the story begins in the market townon of Khemet. The lord of that village has murdered one of the king'sconcubines, and her sisters are angry for revenge. To quench their thirst,Mathayus is commissioned to invade the area single handedly and eliminatethe corrupt lord. From there, the story shifts elsewhere and eventuallyleads into the tried and true  clichs of betrayal, conquest, and redemption.In short, it's nothing you haven't seen before.Rise of the Akkadian is very much about star appeal, just like the movies. Fans of the WWE and action movies under the age of 14will probably love The Scorpion King. With an abundance of different environments, lots of swarming enemies and a simplistic fighting engine, it'll be easy to pick up and even easier to get into. But for the older set of gamers or players who demand more for their $50 bucks, you'll probably share our opinion: the game is too simplistic for its own good.The combo system is broken down into only a few button pushes with additional blocks, jumps, special maneuvers and throws. Though it sounds like a complicated set of tasks, their purposes are actually quite basic and you'll find yourself performing the same three motions over and over again. While other more recent titles, such as the PS2's Mark of Kri have used the same philosophy, they have used a wide variety of tricks and distractions to break up the monotony brought about by similar button pushes.  For instance in the aforementioned Mark of Kri, gamers were treated to over 40 different death animations and alternate ways to kill an opponent based on your positioning to them. Here in The Scorpion King, it's the same ~knockdown/disappear~ elimination every time, and it doesn't matter where your character is in relation to the enemy -- it's all rehashed mayhem. And though Rise of the Akkadian isn't trying to be a clone of Sony's excellent hack and slasher, it may have done Point of View a service to take the lessons learned in that game for appliance to philosophies behind The Scorpion King.   A couple of design choices we really liked were the inclusion of an RPG-like experience structure (that allows Mathayus to improve his strength and endurance, as well as his arsenal) and the inclusion of special hidden rubies. Numbering in the hundreds, the amount of gems you find affects your Bonus tab in the main menu and will unlock all sorts of neat little goodies. From concept art to commercials to the official E3 gameplay trailer, there's no shortage of secrets for you to stumble across. It made searching for the jewels certifiably entertaining and added a lot to a rather monotonous journey.Ultimately, the game ends up being way to easy for its own good. Since the fighting system is so basic, you can overpower your foes without breaking too much of a sweat. Regardless of what kind of weapon you're using, special attack you employ, or levels you ascend, eventually conquering everything in your path is a mere weeknight or two away. It would have been a far better choice to pump up the difficulty and make the weapons and shields you acquire a more important factor in your battles. With little advantages over your bare hands, they serve as nothing more than an extra thing to carry, rather than an upgrade.GraphicsPlain is the best way to describe Rise of the Akkadian. As thecharacter models themselves are decent, but the textures painted on top of them are pretty bland. Overall, it's just basic art and implementation.The animations in particular suffer from a very robotic look, and withrespect to the Mathayus character, give the appearance of almost no weight at all. In reality, The Rock is about 280 lbs. and the video game should reflect that. Instead, the animations are far too quick and aloof and add no believability to the fact that your character is a 6'5~ killing machine.Not to mention the annoying graphical glitches and collision problems that rears their ugly heads throughout the adventure. While sometimes limited to only an occasional on-screen stutter or flash, there are other instances where Mathayus will walk completely through another object or creature like it wasn't even there. Additionally, characters will mysteriously face you (even if their back was turned) when you grab or attack them without any fluidity whatsoever. So while you may think that you've got the drop on an unsuspecting foe looking the opposite direction, the minute you slice they will instantly be facing your direction. It's an extremely odd sight to be sure.SoundThe Scorpion King's high point by far is the audio.Good sound positioning. And, when coupled with a Mediterranean-flavored soundtrack and truly pleasant individual songs, your ears will be big winners. Well, in terms of quality of presentation anyway.There are problems here, though. The sheer repetitiveness of the samples is frustrating. Identical clanking and thudding noises make up the primary set of noises for the entire game, and it doesn't take long before you'll start to crave a change of pace. But, there's more good to offset the bad. Especially in terms of voice acting, as the producers have managed to not only score the pipes of Dwayne ~The Rock~ Johnson, but also the great Jedi master himself Mark Hamill and Futurama's Billy West. The Scorpion King: Rise of the Akkadian is yet another tragic victim of the hurried movie license. With too much emphasis on the names behind the production and not enough balance to make the mechanics worthwhile, gamers who want more than just a digital rehash of a movie that they've experienced in a hundred forms before have no reason to pick it up.Recommended perhaps as a quick weekend rental for your pre-pubescent little brother, Rise of the Akkadian doesn't ~stand alone~ as the theme song proclaims it to -- it just stands.", "date": "Sep 18, 2002"}