{"name": "4x4 Evo 2", "name_review": "4x4 Evo 2", "ref": "https://www.ign.com/articles/2002/09/18/4x4-evo-2", "text": "Sport Utility Vehicles (SUVs) have been all the rage, especially over the last decade. Offering up tons of legroom, trunk space, safety features, and raw horsepower they seem the perfect design for busy mothers, professional, yet instinctively rugged men, or anyone looking to cause some havoc on the road. All of the commercials advertise their ability to head off the claustrophobic highways and onto the open road and mountainous terrain. Of course, anyone who invest $20,000+ into one of these vehicles is not going to recklessly engage in this kind of activity. With this in mind, Terminal Reality set out to develop a new racing franchise that brings all the thrill of an off road 4x4-meets-SUV racing circuit to gamers.   Called 4x4 Evo, the franchise originally debuted on the Dreamcast, and now its sequel 4x4 Evo 2, which has already been released for Xbox, has landed on Nintendo GameCube. It brings for a jaw-dropping amount of licensed vehicles, parts, and options, and even four exclusive GameCube track designs on top of the original 30. However, like some of the beefy, oversized vehicles in the game, for all its content and extras, it's the raw performance that means most and this is where Evo 2 doesn't stack up.   Features Multiple game modes including Quick Race, Free Roam, Time Attack, and Career racing Hundreds of vehicles from multiple manufacturers including Lexus, Dodge, Toyota, and more Hundreds of generic and brand name parts to customize your vehicle Be recruited by and race for a professional team 30 planet spanning racing areas Four GameCube exclusive tracks to race on Four different weather conditions and the choice to race at different times of day Face off against a second player in head to head action  Gameplay 4x4 Evo 2 is designed to let gamers participate in circuit-style SUV off-road racing. You can choose from Quick Race, Free Roam, or Time Attack, but the real reason to play the game is for its incredibly detailed Career mode. You begin with nothing but $100,000 in your pocket and a little ambition. The cash will let you choose from a wide range of vehicles and have plenty left over for parts. This is where you get a sense for the goals behind Evo 2. There is a massive selection of vehicles from big brand names; the Dodge Durango, Toyota 4Runner, and pretty much every SUV out there is available for purchase. All of them can be upgraded in multiple ways; improve your drive train, buy new tires, heighten your suspension, change the appearance, etc, etc. It lets you do everything you wish you had the money to do in real life. Well, if you're a fan of SUVs and 4x4 trucks, that is.  After you spend a little cash to get started, you must of course spend a little more to enter in qualifying races and competitions. The reward, of course, is more cash to improve your vehicle. Eventually, you'll be able to join a team and, more importantly, earn enough money to buy the really highly modifiable SUVs, which are very exotic and very expensive. These could be described as ~boss.~ You've never seen such decked out 4x4s, we'll assure you that. This is probably your only chance to hop behind the wheel of one.   However, for all the options, the huge selection of vehicles and parts, and diverse track list of over 30, there is a far more important issue to consider. 4x4 Evo 2, as a racing game, needed to bring a very tight, balanced, and rewarding experience to the table if it hoped to capitalize on all these features. Sadly, this all too important core of the game is sloppily executed. Track design, computer AI, and the overall sense of being immersed in these dirty, off-road races are uneven and tedious. Once you start your career, you can't help but be bored by the lengthy, relatively dull races. So, regardless of how excited we were to see all the detail put into the structure, the end value of the whole package is low; simply because it's just not fun to play in our opinion. You can attribute part of that to the fact that we're not exactly fanatical 4x4 owners, but mostly our disappointment with the game lies solely in the racing mechanics. It seems much more time was spent chocking the game full of all these options. Like the stereotypical muscle-head, 4x4 Evo 2 is all brawn and no brains.   Graphics Visually, 4x4 Evo 2's is as muddy and unrefined as the tracks you race on. The tracks are pretty massive, which is great, but the team's vision is blundered by draw-in, low-res textures, and a lack of lighting. The most graphically pleasing element in the game are the models of all the different vehicles. You'll have no trouble recognizing all the different SUVs and trucks if you're a 4x4 fan. When you select your vehicle for Career mode, you can even choose from a number of different colors and see them displayed on the fly. When you head out on to the course, you'll see that your vehicle reflects everything around you. It's not the most high-res effect, but if you're in the right camera mode you can catch your opponents speeding up behind you by looking for them in the reflection on the back of your vehicle.    That said, it's not completely devoid of detail. You'll find a nice variation on time of day settings, weather effects, and little environmental details like flying dust or blowing leaves. It's the overall presentation and a jittery framerate to boot that doesn't quite add up for something impressive.  Sound Very much like the rest of the game, the aural effects are unbalanced and even frustrating. The sound of your vehicle's engine is unnoticeably unique and totally overpowers any other effects that try to get through. There is also a small selection of music beats to accompany your races, but the developers have balanced them out as if they are turned down on the interior radio. It just sounds very odd and almost awkward. With a lack of any sort of surround as well, we can't say we even recommend playing with the sound on in 4x4 Evo 2.  I wouldn't call myself a dedicated fan to the sport, but I do appreciate good simulations and arcadey takes on racing. From Gran Turismo to Burnout, I often find I can't pull myself away from the TV. Even as a kid, I remember I fell in love with a game called Ivan Stewart's Super Off Road, which I'm reminded of when playing 4x4 Evo 2. It used to have a similar setup where you earn all this cash to buy yourself better parts for your big, bad 4x4.So, naturally, I was pretty excited by the sheer volume of cars and parts you could buy in 4x4 Evo 2. Setting up my vehicle was pretty entertaining, but as soon as I began racing in my career I just found the races to be generally boring. The only reason I wanted to press on was to earn more cash to upgrade my vehicle. Since the core of the game is racing, after all, and not purchasing cars and parts, I can't say I recommend investing in 4x4 Evo 2. Only the most mouth-frothingly fantatical 4x4 devotee would be rewarded by what it has to offer.", "date": "Sep 18, 2002"}