{"name": "Spring Break", "name_review": "Spring Break", "ref": "https://www.ign.com/articles/2002/09/23/spring-break", "text": "Ah spring break, the happiest of vacations. The drunkest and most fun of breaks! The sunniest and raunchiest of them all! The best time for the buxom young ladies and horny young men to gather together in celebration of life and love. Glory hallelujah! And let us not forget the messily drunken stupors most commonly followed by a quick dash to the door in the morning. Oh spring break, where have you been hiding these past few years? Probably on the beach having a drink with my bloated liver. I'd all but forgotten your charms and hilarious hijinks you brought with you. Lucky for us Eidos and Deep Red are following behind to pick up the bits and hand us Spring Break. A journey into hedonism and debauchery from the ~grown-up~ perspective of managing a beach resort. I place that in quotes because I certainly don't feel that grown-up after playing the game, but I don't exactly have the nasty hangovers I remember so fondly (or the stale stink of alcohol and puke to wake my senses in the morning) from my glorious and idiotic college years.   What I do have is the distinct feeling that I've played something like this game before. It's a tycoon game. It's a tycoon game with some personality and a bit of style. It's a tycoon game that covers a subject matter not quite hit on in the past. At its base it's a fairly simple tycoon game as well, albeit a relatively fun simple tycoon game. It works like you might expect. You'll be given an island, or a part of an island, to shape up into a thriving body fluid exchange and mecca of drunken belligerence in order to make yourself a hefty piece of cash. Everything that you expect to see on a beach resort will find itself in the game. Gambling, food, sand, surf, sex, and plenty of booze (always the precursor to the sex part, apparently) will keep all of your island visitors happy.   Each scenario will give you a different challenge as you try to build your chain of islands up to the best it can be. You'll have to get certain numbers of people onto your island in some, drunk in others, and hooking up on the beach in others yet, while keeping them out of danger and trouble, and into your stores, restaurants and clubs. All of this in the attempt to keep your pockets lined with cash.   In order to do this, you'll have to keep all of your guests happy so they'll bring the good word back to their friends who will then come out and spend all of their money on your beautiful island paradise. And these people can be a finicky bunch. Not only do you have to worry about their basic needs, such as sunscreen, food, and lodging, but also their most basic needs like members of the opposite sex. Each of the buildings has a different rating as far as attractiveness to each gender goes. You'll need to balance out your island with attractions so that both men and women will want to make the trip.   You'll also have to worry about maintaining the island as well. Maintenance men and cleaning crews will have to be hired to keep your island up and running smoothly. Even though these college kids can be messy, they don't like having to wade through empty beer cups and half-eaten hamburgers to get to the beach. And don't forget about the power. Every building needs power. Even the lifeguard towers and equipment rental places for some odd reason, which really bugs me. Worker management is actually pretty easy, even if the interface for it is a little annoying. There's no such thing as setting paths for your workers. They just wander and do what's necessary. Luckily, they seem to be efficient enough and smart enough to get the job done for the most part. If you have to, and there will be some times where you have to, you can tell them to clean a certain area of the map. It just means opening up more damn windows, when it easily could have been done without them. The interface in general could have been a lot easier. It looks quite nice with a The Sims or SimGolf style of art, but isn't organized in the best way.   Really, the only thing keeping Spring Break from being a breeze is your difficulty in figuring out exactly why people aren't getting drunk and hooking up on the beach or some such thing. This is all thanks to the lack of a good manual, good tutorial, and the fact that you get no suggestions or feedback after being told that people are complaining. Muddling through the beginning stages while trying to figure out why sharks keep eating my visitors doesn't make me entirely happy, even if the animation is twisted and fun to watch. I'm not sure why they decided the tutorial missions wouldn't have any ~tutorial~ in them, but they didn't. No instruction, no help, no love. Just, ~here's some easy objectives, hope you can finish them~. Why bother saying something is a tutorial when there's no tutelage happening? The developers of the game just assumed that everything would be so intuitive that we could figure it out for ourselves. As so many of you like to point out, I'm an idiot, and I consider myself at least of average intelligence, meaning that there are other people out there that will have the same problems as I did. I am not a gaming psychic. I need help when I get into games like this to give me hints towards grasping some of the finer points of the game. Apparently you have to close down the beaches yourself at the lifeguard station in the event of a shark infestation, but they never once said that. They say, ~make your beaches safer.~ Only after you lose do they give you the hint telling you close down the beach at your lifeguard station in the event of sharks.    I suppose what really gets me about things like that is the fact that my lifeguards are stupid enough that they can't figure out how to close the damn beach themselves. That's why I hired the damn guys, so I wouldn't have to worry about it, but they're sitting there looking at all of the babes in bikinis not really worrying about the big bubbling splotch or red surrounding the screaming kid out in the ocean. This should be automatic. It also couldn't have hurt to mention that each of the beer types is a different strength. Sure on closer inspection, you can tell by the names, but once again, not everybody is just going to get this right away.   After you've figured out how to play the game through reading the manual and digging through the game to find the right tab or menu to push to get you what you want, you'll find yourself playing a cute and fun game. What other game actually tells you to get a certain number of people drunk and hooking up on the beach in a small time frame. Beer goggles for sale! Everybody comes out for the fun and frolic of daytime activities, but the nightlife is where you really make your cash and also when the fun really starts. All over the island you'll see vacationers stumbling around mumbling incoherent things. You'll see guys fighting and girls fighting. You'll see guys trying to get women to get it on only to get a resounding NO with a kick to the nuts leaving one member of your island paradise out of commission for a little bit. And of course, you'll see some couples rolling around on the beach having some fun. Sorry kiddies, no nudity for you. Buildings are nicely created with bright and colorful art. Animations are pretty well done as your visitors beg to be watched for little bits at a time.   Like every tycoon game out there, things can get a little slow at times. When you have no cash and can't build anything else, you'll find yourself using the handy-dandy fast forward feature to speed the time though the night cycle where your cash flows in so that you can start building things during the day again. Unfortunately, most of the scenarios will have you doing this more often than you might want to, because the time limit on them is so short you'll only have time and money to put up buildings without a whole lot of extras in the way of scenery.   But for those that just want to build your dream vacation without the constraints of objectives, there is a sandbox mode. Although you'll only have the scenario maps to do this on. While the sandbox mode is a good idea, there should have been a random map generator, or a map editor included to keep things fresh and create new challenges. As it is, the 12 scenarios won't keep most people occupied for an incredibly long time.Spring Break certainly isn't the completely idiotic Panty Raider type game that I had originally thought I would be playing. It actually is a pretty enjoyable little game. Unfortunately the few flaws that I can't totally forgive and the lack of the long play time that you normally get from tycoon games means I can't totally recommend this game to everyone. Those just looking to have some fun with a little bit of challenge and thought involved will probably find this pretty entertaining. Serious economic simmers who don't like to par-tay should stay away.", "date": "Sep 23, 2002"}