{"name": "The Italian Job", "name_review": "The Italian Job", "ref": "https://www.ign.com/articles/2002/09/23/the-italian-job", "text": "When the PlayStation version of SCi's The Italian Job arrived (distributed by Rockstar Games), it was extravagantly, astonishingly celebrated. Regular PlayStation gamers had been starved for anything but kiddie tripe for months, and suddenly, they had a new driving game from the 'makers' of GTA3. I'm not sure if it even registered for PC gamers, but for the console crowd, this was the next game from Rockstar. Somehow, even though Rockstar didn't make the game, wasn't involved in publishing the game anywhere else but the United States, and hardly even got its name on the dang thing (the PC game doesn't have the Rockstar logo in the start-up crawl or game manual,) the name Rockstar was still news, and so also was The Italian Job.  Luckily, the company managed to pick up the right lorry on this one -- The Italian Job was fast, goofy fun on the PlayStation. But if you read the 9's and A+'s slid this game's way, you'd almost get the feeling that somebody was on the take. Enjoyable, yes -- but how much of the praise was from hard-up PlayStation gamers dying for anything that even vaguely resembled Grand Theft Auto?  The PC version is now out in more sensible times. The Italian Job can finally be reviewed for what it is -- an enjoyable whiff of swinging '60s history made interactive. If that's your bag, The Italian Job is a gas ... but just that. It's works better as a collector's item than a hot, must-have game -- almost like it should be a really, really, really special DVD bonus feature. On the PlayStation, that was plenty and then some; on a PC, especially with the simple graphics and lackluster port job, you can take it or leave it.  Most of the problems with The Italian Job on PC come from the surprisingly dated presentation. Well, maybe not so unexpected since the game was released long before Rockstar even had its GTA3 bank on the table, but I only expected the game's PlayStation roots to show through in the graphics. Instead, it's the PC conversion (of a game that was released and assumedly designed at the same time) that leaves dents this ride. Online play would be expecting too much (although that is tough to say in this day and age -- and there is a free-ride that should have worked just fine online), but proper joystick control in a driving game should be a no-brainer. It feels a little silly having to quit out of the game completely in order to adjust the non-analog default controls for a wheel or game pad for what is exclusively a driving game. Another thing that probably should have been obvious would be a multi-tasked loading engine for getting in and out of the game's menus. After suffering through literally a collective hour of loading in the PlayStation game, I was expecting to cruise right into the PC game. Nope -- the game purges the memory to get out to the menu (of a linear game) for the stage introduction (which could easily have been done in-engine to save you the load and keep you in the game, instead of with the Bink videos taking up your time and RAM here.)  If you're starting to think that hanging on for the PC version instead of just tossing a couple quid for the PlayStation version wasn't the way to go, you can be sure of that when you take a look at the PC game's presentation. This baby isn't the monster poly pusher on the shared streets of Mafia and GTA3, and the PlayStation textures smeared across their surface don't smooth things out -- they actually make the visuals worse, since the jarring seams between building textures and road textures clash harshly. Still, graphic tarts get their due every day in the PC arena, and there would some good things about a lesser engine such as this. The game's system requirements are refreshingly modest (hurray -- a game I can run on my stock Vaio which won't even smoothly run the demos it came with,) and even though the cars and characters are blocky, it's the feeling of being in the movie, being part of that scene that makes the game a hummer. But the developer Pixelogic left some glitches in the 3D engine that really drag the PC game. For some reason, the engine chugs in framerate when you're going slow. It makes no sense -- it doesn't chop up at all when there's a ton of cars on-screen, with juggling boxes and other debris skittering down the road, and when you're fully floored, the game whips along like the engine is unsafe at any speed. But accelerate in the beginning of a mission or try to recover from a crash and suddenly the game is a slide show. I can't tell you why. It happened like that a bit on the PlayStation game, but it was even less frequent, and it mattered a lot less on a TV.    Otherwise, the game is the game. You cruise around a long-lost world where Michael Caine isn't just a supporting actor and the Mini-Cooper is the car of choice -- gotta' love that place. Much of the humor of the film is kept intact, from the wise-ass voice-over from a great Caine-alike down to the special appearance of the beloved Benny Hill (and I think Benny's ~voluptuous~ twin peaches may be the first instance of realistically-proportioned women in a videogame in history.) London isn't quite the swinging town you'd expect it to be -- the square layout isn't much fun to drive in -- but when you make your jaunt down to Turin and start getting some air under your tires from the wild hills and hairpin curves, things pick up. I'd also have to say that it's a lot more fun outrunning the mob than it is a few coppers. Plus, driving on the wrong side of the road for a good portion of the game is a buzz -- especially when you've just committed some criminal chicanery and need to drive on the wrong side of the wrong side of the road. Then there's the upbeat, bluesy Quincy Jones soundtrack, which is its own steal.I could give you one really good reason to get the game, The Italian Job -- that is the movie, The Italian Job. All of the breezy spirit and zany thrills of the flick are packed in. Unfortunately, I could give you a lot more reasons against it due to the bad PC job. On the PlayStation, anybody who dug the style had no reason not to pack up this cat. But even though the resolution is better, the PC version hits some bumps (not to mention that it's tough to play a game this dated on the same machine you were just playing Mafia on.) You might even be better off running an emulator of the PlayStation game. The light charms of the game makes it nearly irresistible, but if you want on this Job, stick with the smaller horsepower ride.", "date": "Sep 23, 2002"}