{"name": "Links 2003: Championship Courses", "name_review": "Links 2003 Review", "ref": "https://www.ign.com/articles/2002/09/24/links-2003-review", "text": "You know it. It's what more sophisticated friends and relatives play and discuss at Thanksgiving in those conversations and trips you're either first in line for or last asked to be a part of. It's what confounds, bores, or engrosses you. It's golf. It's the sport of kings and guys who wear apparel so absurd that even they snicker at themselves and lower their heads in shame when normal people pass.  Microsoft and EA have for some time been busy battling one another in vies to craft the definitive effort -- that one golf game to find them all and in the darkness bind them. EA's poster boy, Tiger, may be young, successful and virile (thank you for your expert analyses on that last one, Dan), but Microsoft's Links is the established PC veteran here. Like all old folks, it's also the one slowest to change. Can tradition beat youth? Well, both have ups and downs, so the fight rages on.  Pure simulation play is Links' motto. It puts physics and a desire to cater to the hardcore above all else. Strangely, in keeping it real, it seems the development team has neglected to keep it real. Like a hundred golf games of days long past, Links plays out on a static environment. Links looks bad. Links looks good.   The problem: everything except for you, the ball, and the terribly modeled and textured flag is completely static. It's like playing in an episode of the Twilight Zone where nothing is alive -- where you're running around some kind thousand foot tall alien girl's dollhouse. No? Well it's a crappy virtual reality machine powered by blue light and magic that, according to Hollywood, people apparently used in the early 90's to simulate what real computing was like. No? Then it's surely like watching a poorly done cartoon where everything in the background is a different tone and color from that one moving character, who, however fluid, seems completely out of place. Pick one. The shadows that drape from players and conform to the environment are all that keep it together.   Having static environments means having rendering pauses, oddly enough. Even tapping your ball a clean inch will initiate another rendering change. The same goes for rotating a player and opening an extra map (such as the tee map). If an older, abused, and antiquated machine powers your pastime, the underachieving RAM and horribly fragmented hard drive you sport will surely slow things down, considerably.   A clean mesh between texture sets keeps the courses seamless and higher resolution graphics keep them clean and crisp, but no flying birds, moving clouds, drizzling rain, dynamic lighting, water that waves, galleries that clap, or caddies that move will disappoint, a lot.  Jesper and his cohorts fair much better. They have been spared an awkward FMV return and now emerge as fully polygonal models. The switch was a correct one. They all move very, very well and no longer exhibit the more nasty traits of their fully motioned and filmed counterparts, a technique the Links team has long been masters of mastering. Things like slopes aren't deathtraps. Water can't be walked on. Players can't levitate. Even though they aren't nearly as detailed as Tiger's, you'll never know it because they stay at fixed distances from the camera. The date that looks good from a far is always pretty if you never let him/her get close.   Starkly contrasting the dull and eerily still Night of the Comet environments (naturally minus the ~freaked out zombies~ Chakotay spoke of), player animation is blessedly smooth. Why Jesper, you move so sexily. Surprising how that's still an issue in games, huh? I'm not just speaking of the many mo-capped idle animations either, but also swings, Real Time Swings, read: Microsoft does EA's TrueSwing which Sierra actually did a long time ago).   It's vital that players look good when stepping up to bat to punt that field goal. A problem I had with Tiger 2002 was the unresponsive animations of the players. Blasting one down field for a touchdown wouldn't feel right at times because youthful Tiger struggled to keep up with the movements and deliver a smooth swing. EA seems to have remedied this problem in this year's outing, their second attempt, but Links gets it right the first time out.   Whatever the motion of Jesper's ball-clubbing ocean, the Real Time Swing stays fluid and fresh, keeping movement responsive believable. Above Tiger, it also adds a little left and right sway to the mix. Moving the mouse back and then forward approximates a swing because speed, fluidity and direction are all translated by the computer and applied to the player's form and club. Tiger relied on forward and back play. In this game, however, keeping the mouse straight is of vital importance, because it will ruin your swing if you do not.       At first I hated this, a lot. It seemed any optical mouse I used was so sensitive that it always veered one way or another, planting my noble attempt at the green deep in the water or deeper in the sand. My direction was set, but a stagger to the left mid-swing would change the position of the club and thus the path of the ball. After only a couple hours of play I came to grips with the control and its apparent difficulty in getting along with the most touchy of touch driven devices. Soon I found myself breezing through matches and turning old Jesper upside down on his head. ~Batting for par, are ya? Well, my club to hole ratio equals two per course, bitch. Beat them homeruns.~ I can't even play Classic Three-Click anymore, though the game still allows it. I can still handle Easy, though, since that involves pointing and screaming ~Yay,~ when you sink a goal-in-one.   A new dynamic camera system moves from tee to ball landing after the swing, but it doesn't work with the Real Time Swing. Weird. I can already see the new Fox special... When Two Goods Cancel Each Other Out and are Attacked by Animals.   In addition to making Real Time Swing possible, the new triangle driven models allow for a bit of customization.  I made and liked the model that looked like me. Being a white male, age 18-25 with medium build, medium height, and medium features, the digital clone wasn't hard to craft. People whom are ~individuals~ and insist on having their own ~unique~ style and look will have a much more difficult time at it.    A modified Russell with the palest white boy skin around, a black shirt, and gray pants makes me, the crazy Croat, but this is where character creation ends. Where's my Stephen ~I only shave on Christmas~ Butts? My lanky Dan ~Legs to brittle to stand~ Adams? My Tal ~Hairy goat troll who humps your desk~ Blevins? What about the stubby-legged kid with a giant head and ape arms? I've seen these creatures make appearances in football, basketball, hockey, boxing, and wrestling games. Heck, provided memory serves, I recall creating some truly amazing and horrific models in 4D Boxing, which wasn't all that technologically revolutionary with its characters made out of about 26 giant, flat-shaded polygons. But if you want to change shirts, pants, and skin color (assuming you're not taking an existing, real golfer) than this is keen. Me? I'm the picture of Laura (because she's cute), the voice of Female 1 (because I love infuriating my coworkers with constant girlish quips), and the body of Russell (all dashing and muscular and whatnot). It's an exact replica of yours truly. A little femme, totally out of place, and very strange. Self-deprecators have the most confidence, you know.  Mixing and matching personas is nice, as is the ability to import a placeholder photograph of one's own head and even accompanying WAV files, set up to play with the script editor. But, the opportunity to have a picture of a giant bunny and a character that yelps out obscenities even when he wins doesn't help the lacking nature of the game in this respect. Since golf is about one character, we should be able to build that one character from scratch and hone his or her skills over time, improving some traits and worsening others with training and play (think career meets RPG).   Tiger 2003 is doing this to some extent, but all titles, Links especially, are neglecting the fundamentals. I think I speak for a lot of people when I say I don't want to play as Jesper, I want to play against Jesper as myself and brutalize him in each and every game. Let me make me down to the smallest detail (height, weight, color, hair, shoes, hats, eyes, etcetera) and then give me the ability to attach photos and sounds like what is present. Then, throw me into a global ranking system for online play and a singleplayer lifetime career for offline. That is the complete package that no golf game is.  Not many players and courses are present in Links (nine and six respectively, with the former having five generic players and the latter having one generic course). It's another problem. To my knowledge, there is no equivalent of the NHLPA or NHL for golf, where licensing from a single unified body grants immediate access to all of the players and courses associated with that entity. No, it's rather all taken on a person-by-person, course-by-course basis. Couple this with always lacking budgets that don't approach the more widely visible football titles and you have consistently average games when compared to the best of the sports genre.   Golf games are never as encompassing as anything else. It's a niche audience and thus one not likely to spend an awful lot of money. See the loop? More people don't buy 'em because more features and functions aren't present. More features and functions aren't present because no one buys 'em.   My last gripe is more of a request. As an option (big emphasis on the word that rhymes with goption), we should be able to render an entire 360-degree scene, so at least rotation wouldn't incur a load time wrath.       On to more positives... One thing that Links does extremely, extremely well without contest is presentation. The in-game help system is phenomenally awesome and remarkably comprehensive with hundreds of entries (I dare not waste my time counting them all and risk contending with brain strain from running out of toes and fingers). Pro tips on each hole, which feel like they're voiced by a chipper Bull from Nightcourt, give advice and a quick, golfer lingo jived rundown of what you're playing on. A shot analyzer and pre-shot information tell all and the interface makes everything work. It's easy to get needed info without much or any obstruction. Clicking on the map or anywhere in the viewable area is a great way to setup initial direction. The grid, in putts, helps keep the action manageable and even provides a gradually colored line indicating the most likely run of the ball when hit appropriately. Coupled with the Real Time Swing and its automatic metering system that determines the best force to hit a ball with, it can be a pretty killer experience.    Physics. Links knows physics. And this is where the game dominates. Tiger 2002 had a few problems in this regard. Balls would land in such a way that roll would be favorable, but the game would mysteriously send the little white wonders other ways, or force drops when one was not necessary. That, and trees that acted like impassable barriers, really hurt. Not so here. Balls, except for a very odd and extremely rare instance when one would bound forward and then leap back as if it were being pulled by a string, act almost exactly as you would expect them to, especially in the bush, where punching through trees will slow movement, but not prevent it.  What good is physics without game? The MOP (modes of play) and MOP designer offer an incredible amount of diversity to the game, and players can create all kinds of stuff including; tourneys with rules, matches that are crazy and backwards, and so forth. Ever play poker? There's five card draw and stud. But then there's draw limits, different antes, seven card, whiskey, Texas hold 'em, and about a billion other variations. The analogy works. It's possible to create and play the creations of others that are so tweaked, refined, and downright strange that they become entirely different games... Cool.   Still, I long for more of the Virtua Tennis / Madden 2003-esque mini games with a direct impact on solo play (advancing characters, unlocking more stuff, whatever).   Email tourneys, full online play via the zone, and direct connect are all possible. The email tourneys are a breezy kind of easy, because when one is sent to you, a simple double-click of the attachment will initiate the game and bring you right to where you need to be. It's not nearly as ambitious and complete as EA's EASO service, but it's a perfect diversion from normal play.   What did you think of Links 2003?  And the new but familiar types of career modes (made for those with vested interests) pulls quick start, multiplayer, and exhibition matches together, but still begs for more of the RPG touch, of course fueled by the above mentioned desire for mini-games.   Sound, no segue needed, is palatable for titles of the type. Typically, galleries applaud, cheer, and so forth, and players make their usual pleas for divine intervention that come interspersed by screams of extreme dissatisfaction. It feels like a few of them are a bit forced, but none are truly bad. I fail to recognize the supposed new amazingness, but I was never bothered by anything that went bump or chirp.  Finally, I didn't notice the compatibility and stability problems I've read about in other publications and I've run the game on two very different machines (one being a Windows XP powered, Radeon 9700 sporting, 768MB RAM using, P4 2.0GHz processing beast and the other being built with Windows 2000, a stock GeForce 3, 384MB RAM, and an Athlon 1.2GHz). She's as stable as stable can be as far as I can figure.Contrary to the childish and ill thought out whines and musings of other industry ~veterans~ employed by other industry rags and mags, I believe it's ridiculously easy to improve golf games. ~What more can you do?~ They pitifully moan and wail as they sift through endless substandard FPS mods, praising mediocrity. ~You hit balls and stuff. Golf is the same all the time.~ Is it no surprise I vocally brand them fools every single day of my life?The singular, pervasive problem of golf gone digital is not with the sport, but rather with the approach taken when transmogrifying it over to our platform. Both Microsoft and EA are making great strides to improve the experience and bring it up to football/hockey/basketball/soccer/wrestling levels, but this has not yet happened. EA's handling online play and graphics with a kind of finesse and strength that would make an all-legs ballerina cry in shameful inadequacy. And Microsoft, not to be outdone, has physics and straight golfing gameplay with a meticulous attention to the player's needs down in spades. But, all titles still significantly lack across the board. Where's the life? Animals? Better skies? Dynamic weather and light? Better galleries? Better announcing? Where is the classic simulation/seasonal play bundled with that of optional fantasy courses? Consoles get castles, sea monsters and Scottish brutes. Who says the fun can't be included on our end as an option augmenting the standard? And why don't the caddies speak? Where is the full-featured unlimited player editor? Why are the games always limited to a dozen or less courses and players? Truly, I can think of a thousand ways on which to improve the genre (being paid to see does help).Every golf game played comes plagued by these problems, but when all exhibit the same shortcomings, the shortcomings become normal; then, the best of the normal becomes good. It's what we call ~getting used to it.~ There is no better metric by which to judge these games because they all are limited. If everyone looked like a pig, then pigs would be beautiful. Links is a killer offering of the normal. It fails to do a lot, leaving the genre's wish list neglected, but it does do enough. Golfers and gamers should pay it attention and buy it if not only to expand the genre and lend it more credibility. How it stands against Tiger 2003 is undetermined, but from what I've seen of that beta and this final, either or both would be excellent choices for those captivated by balls and poles and the need to combine the two into a competitive sport... Dan?", "date": "Sep 24, 2002"}