{"name": "NBA ShootOut '03", "name_review": "NBA ShootOut 2003", "ref": "https://www.ign.com/articles/2002/09/24/nba-shootout-2003", "text": "Bouncing back over last year's football game with NFL GameDay 2003, 989 Sports has already begun reestablishing itself as a player in the videogame sports world. While not on the same competitive level as the award-winning Madden 2003 and NFL 2K3, the latest gridiron edition from a team we thought fell off the radar not only offered a much more realistic version of football, but also one of the better online experiences of the year (server crashes, lag, and other such nonsense are a thing of rarity).Just over a month removed for that release, the company has returned once again; this time flaunting its own rendition of the height-enabled sport of basketball. And though the final product isn't as visually appealing as the majority of other sports titles on the market, the solid physics engine and excellent career option push this effort well beyond GameDay and into the direction it needs to be a contender again.FeaturesDespite what you may hear elsewhere, NBA ShootOut offers up some serious depth; the majority of which lies within its fabulous career feature. The first multi-season scenario that follows the career of only one player, its this mode in particular that initially captured our imaginations and raised our expectations. Delivering in most aspects, its the best mode we've seen added to a basketball game in years.Asking you to create an all-new player from scratch, you start your career in the Summer League before eventually graduating to the more difficult farm-system for the NBA, the NBDL. Officially licensed by both minor league divisions, your upstart player will find himself among real players on real teams in real locations. And though you're not going to see guys like Kobe or Washburn lacing them up in the minors, other benchwarmers that see little time in the show will end up as star players for the short pre-season games.This is where you have your chance to shine. Getting better only through practice, consistency, and a little bit of luck, your average-skilled player will slowly improve his abilities and make his way to the NBA through a series of excellent performances. After finally receiving that invite however, don't expect to be matching up with guys like Webber or Bibby. You have to earn your spot on the team like everyone else. Falter in too many performances and you may find yourself riding the pine, back in the minors, or traded all together. The system works pretty well and its this standout option that makes that $40 you spent worthwhile.Not that there arent a couple of nagging problems that remove some of the realism from what could be an end all/be-all feature. The most bothersome of which is the automatic age realignment of anyone over the age of 22. Input your birthday (like mine for instance, which is September 14, 1976) and the CPU automatically changes it to July of 1980. While I can understand that there are very few guys who come into the NBA over the age of 22, the lack of support for us older guys was pretty disheartening.The statistical number crunching is off too, as your performances are gauged in actual real-time minutes instead of simulated minutes. What this means is, you could play a real time 45 minute game and score in upwards of 150-200 points per player and it will count towards your player average and quickly turn your player into some kind of super god with the coaches even if he's terrible. On the flipside, great players can be punished if you're playing five-minute quarters and producing 20-point games from guys who should be averaging 30. It's all a bit unbalanced and 989 should have simply forbid the elongated time limits in career play and converted the stats to some kind of virtual 45-minute scale. As it is now, there's a small hole that allows your player to pad his own stats and it takes the effort of actually trying to do well out of the equation.That said Career mode is still incredibly fun should you choose to play it straight. With career numbers, all-star appearances, and even inductions to the Hall of Fame a possibility for excelling characters. In conjunction with the game's other little goodies like ~Create a Dunk~, 8-player simultaneous games, and an extensive create a character option, I was extremely pleased with what ShootOut had to offer.GameplayThe gameplay engine does a good job of matching the feature list and pulls of its game of B-Ball surprisingly well. Lifelike bouncing, ball physics, and team strategies are a big part of what makes ShootOut better than last year and can make for some pretty intense sessions of hoops. What I like specifically is how well the game rates a player's stats in relation to his ability on the court. If you have a three-point master on the rubber he'll still perform, but he won't sink the rock each and every time. A problem that the last version of ShootOut and Sega's NBA 2K2 both shared, scores end up pretty much the way you'd expect them to in the real sport (with the most accurate numbers jiving around the 6-minute quarter mark).Other admirable elements, like missed jams, assisted free throw dunks, and right-analog ball taunts are very much appreciated and lend themselves well to strategy-oriented players. Taking a cue from other basketball titles this year, you can switch your defensive formations on the fly via the shoulder button/right analog stick as well, and the CPU-controlled substitutions are intelligently handled and make sense 90% of the time.The only two aspects of the game that really keep ShootOut from rising above its competition is its defensive execution and free throw system. This is especially noticeable when playing with run and gun teams like Sacramento and Los Angeles. Although I'm happy to report that ShootOut is one of the first games to truly understand the frequency and importance of blocked shots, it's turnover ratio is sorely underrated.    What this translates into is an incredibly difficult system by which to steal the ball (be it via reach-in or interception), so taking control of a defensive player is almost useless. Since he has little purpose other than to try and act as a mild obstacle to the team's offensive mirror, assuming the role of your CPU teammate does more harm than good. As the moment you press ~X~ and grab that circle, your opponent's A.I. will read you and drive on you like a madman. It should be fun to play both offense and defense, but ShootOut only comes through in one of those categories unfortunately.As for the free throw system, 989 has adopted its own style of the total control bit that Sega has going in its 2K series, and I'm definitely not a fan. Requiring you to pull downwards and sideways on both analog sticks at the same time until matching both arrows to the color green, tossing a free point is far too challenging for its own good. Professional basketball players practice these throws every day vigorously and should easily be one of the most simplistic scoring techniques in the game. Next to the lay up can you even think of a more basic shot? EA Sports has the right idea with its bouncing ball timer, and I wish that other companies would follow suit. Being different just to be different isn't always a good thing.Despite those issues mentioned above (and a tendency to weigh in a bit heavily on the fouls), ShootOut is still pretty fun to play. An adjustment from some of the faster-paced offerings we've seen from other companies, the believable ball physics and excellent display of team work (that I failed to speak of earlier) in conjunction with accurate player ratings and strategies helps build a damn fine session of basketball.GraphicsDespite having one of the most realistic basketball engines in 989's history, NBA ShootOut is hideous, quite frankly. Though the character models are reasonably put together, the level by which they are presented is reminiscent of the late PlayStation One days. Jagged, low-resolution characters aren't that fun to watch and the slowly animated mo-capped movements don't help much either. It's all really sad actually, as the public at large is typically graphics-hungry and will often judge a game's playability based on that factor alone. We may not like how the system works folks, but that's the way it is.Speaking of animations, they're partially to blame for one of the previously mentioned gameplay problems. So poor are the stealing motions that you can rarely tell whether or not you're in a good position to take the rock. You may be standing in front of a player tapping the living hell out of the square key only to be mysteriously waiving through your opponent's frame. This move in particular should have been tightened-up as turnovers are unrealistically low. One average you're looking at maybe one to three turnovers per game -- not very lifelike at all.At least the crowds and replays are pretty respectable. A step above the usual flat-sprite onlookers, the diverse collection of onlookers are among the elite in terms of digitized sports fans and the Matrix-like slow-motion reenactments are good stuff. It's just a shame that the artists didn't spend as much time making the rest of the game look as brilliant as those aspects.SoundThere isn't too much to talk about in this department except to say that it gets the job done. Moderately realistic crowd cheers and the classic squeak of tennis shoes against the floor make for some standard audio distraction, and the bounce of the ball itself never gets too bothersome (which is great news for those of us who dislike repetitive noise).The announcers too are pretty run of the mill, with Bill Walton and Ian Eagle providing the play by play with a couple of genuinely funny anecdotes and well-timed commentary. Strangely, the pair of announcers use the same complaints a little too often, so  don't  be surprised to hear them go on about your ~friends and families~ if you hit a losing streak. To our pleasant surprise, all of this is brought to us in quality Dolby Surround.The best basketball effort from 989 in eons and definitely the company's most valuable player for 2002, NBA ShootOut 2003 is a huge improvement. While the various gameplay hindrances and dreadful visuals could end up hurting its chances by the time its competition hits the store shelves, true fans of the sport may want to give this one another look. It may not be pretty or fast, but it's realistic and most definitely sports the best career mode we've seen in a long, long time. Take a chance and give it a rental, it just may end up being your cup of tea.", "date": "Sep 24, 2002"}