{"name": "Tekken 4", "name_review": "Tekken 4", "ref": "https://www.ign.com/articles/2002/09/24/tekken-4", "text": "Things change; attitudes, philosophies, perspectives, and other such notions that can shape and mold a person's ideal of what something is, was, or could be. Constantly evolving and transforming into something slightly different than before, inevitablitiy of change is one of Nature's true absolutes. This rule not only applies to existence and human beings, but also to videogames; and what better subject to illustrate this point, than Tekken 4?   The once mighty king among all PlayStation fighters, the slick Namco fighter has been sitting triumphantly on its roost for years. Consistently improving in all aspects, the journey from Tekken 1 to Tekken Tag Tournament has been the perfect example of digital evolution. Humbly planting its roots as ~that other~ 3D fighter in the wake of Virtua Fighter and Battle Arena Toshinden, and then rising to prominence with the follow-up (still considered by many an old-school masher to be the greatest ~3D~ fighter of all time), Tekken has always raised the bar a notch higher than what the rest of the world was expecting. Implementing the 'sidestep' and tag features for the third installment and Tekken Tag respectfully, the designers at Namco continued to wow us with their innovation and dedication to improvement and left us to imagine what Tekken 4 would bring.   And eventually we found out. A near-drastic change from the previous four games, Tekken 4 has made more alterations to its fighting engine than we have previously seen. An admitted fan boy, I had mixed emotions about the differences on several levels: Though I loved the fact that you could now fight within enclosed arenas instead of infinitely open areas, I was dismayed when I learned that tagging a partner had been nixed.   When we received our import copies in May, I was the first one to rip into the cellophane and pound the buttons until I could pound them no more. Impressed with the translation from arcade to console, I found myself caught up in the hype of playing a brand new Tekken adventure and reveled in the glory of all the extra features and modes. This installment was the best in the series I thought, it had to be. But then again, things change.   Gameplay  The most drastic change this year is the inclusion of walls and confined spaces. No longer free to roam the field in a never-ending parallel line, players are now required to fight within the spaces given to them and use the obstacles around them as part of their strategy. Probably Namco's wisest decision, the tighter fighting arenas discourage the run and gun tactics we found in Tag and Tekken 3. In the past, one player could back up until the camera pans into a far view before dashing at their opponent full speed. It was a technique used primarily by arcade scrubs who couldn't memorize their ten-strings or cheap hits, and more times than I like to remember I'd watch many a Tekken newbie get picked apart by some crazy Jin and Ogre slide action. That ability has still made it into the forth edition, but it's practicality and commonality has been greatly reduced and the emphasis on straight-ahead fighting is encouraged because of the room-based stages.    Guardrails, concrete pillars, jungle tree stumps, and even automobiles are but a few of the many objects blocking the path to the enemy. And unlike other obstacle-based fighters like Power Stone or Barbarian, the items that get in your way don't appear at ridiculous levels (then again, you can't pick up and use items against another player like you could in those games either). There's even some multi-plane sectioning in certain stages that will elevate one character above another for additional food for thought. One of the keys to more advanced combat in Virtua Fighter 3 and to a lesser extent DOA 3, the Tekken 4 philosophy falls somewhere in the middle. So while pummeling your opponent down a ramp can swing the momentum in your favor, it won't tilt the balance to your advantage as drastically as VF3.   That's not to say that the enclosed arenas don't pose a certain problem. In the smaller less roomy levels, it's very easy to get caught against a wall in a combo, and because hitting the wall temporarily stuns your fighter and then bounces him back towards the attacking opponent, matches can end far too quickly. While there are certainly a couple ways out of these wall traps, its a technique that comes best through experience with no right or wrong way to escape via simple button presses. The best advice really, is to try and not get pinned against anything in the jungle and laboratory stages, but that's easier said than done.     On the whole however, gameplay is more balanced as it has ever been. With the exception of the powerful (and sometimes cheap) Jin Kazuya, skilled and not-so skilled players should be able to hang with each other rather effectively and the days of dominating Ogre/True Ogre combinations are long gone. Similarly, counters have become much more important than in previous installments. So while Tekken Tag may have let King, Armor King, Jin, and Paul dominate the playing field with their anti-tactics, everyone can defend themselves in such a manner here. Though some characters can do so more effectively than others (and you Jaguar fans know of whom I speak), it's no longer a one-sided issue. Tag may have made you fear throwing kicks and punches toward the Mexican wrestlers, but Tekken 4 instills that same fear with all opponents. Another good move by Namco.   The rest of the motions I don't have to tell you about: This still plays like Tekken. A lot more mathematical than most games in the genre, the tappy-tap maneuvers and perfectly timed combos are the prevalent fighting form. A big complaint among some of the more fluidly-buttoned controller jocks, the sequential fighting engine may not be the most natural in the world, but it's bona fide entertainment. Although I did find it strange that the developers decided to change the left-throw to a push away move but the addition of a low-parry feature more than made up for it.   To be honest though, I do long for the interchangeable characters from Tekken Tag and wished that the option had returned this time around. Sure we have a team battle feature (first one to lose all their characters is out), and Tekken Force Mode is a pleasant diversion (an action game starring Tekken characters? Cool!), but the dynamic that was had with Tournament is one that should have stayed and its sorely missed. At least Namco fixed some of the various bugs and glitches that were present in the Japanese version.   Graphics  The first PlayStation 2 game in Japan to support progressive scan (second here in the U.S with the release of Robotech: Battlecry appearing in front by a single day), the visual clarity is unrivaled for fighting titles. Appreciated most on a high-definition HDTV, the crisp character models are damn near beautiful. Almost identical to those found in Tekken Tag, the slightly improved fighters and well-designed backgrounds rank as the series' best graphical performer.   Especially impressive are the water effects. Rippling exactly when they're supposed to, the shimmering, reaction-based puddles of H2O nearly reach the splendor of Virtua Fighter 4's like-minded ponds. Trees, cars, and other such background objects are well rendered too, and run the gamut of colors, types, and sizes. Having so many cleverly designed stages like the mall and octagon levels helps as well.   Best of all, the character animations are almost perfect with only occasional stutter and rare clipping regardless of pose, location, and move. Smooth, realistic, and definitely worth checking out, the lifelike models are not only built like they're from our dimension, they move like it too.   Sound  The super-jazzy audio is overflowing with horns and piano keys, and reminds me heavily of the original Tekken. Honestly though, I wish the tunes would have been something a little more hardcore or even Asian-sounding as I've always had trouble excepting a jazz riff in the middle of major league ass-kicking. Taken for what it is though, the score is pleasantly diverse and ranges from the low-key variety to fast paced finger snappers.   Vocals are almost non-existent during the actual match-ups but play a significant role during the before and after cut scenes. Identical to its Japanese counterpart, the Japanese and English voices used for the bookends are pretty well done and Namco has done a good job of matching speech with its characters.Some of you may wonder why I have scored Tekken 4 lower than the import version when I was the author responsible for both pieces. What it all boils down to is that in the four-plus months between reviews I have come to realize more and more how much more entertaining 2000's Tekken Tag truly was. While it may not be as technically balanced or dazzling as Tekken 4, the loss of a partner has really hurt the replay experience for me. I've played both titles extensively, and despite how many cool new gameplay tweaks that I discover in the latest build, my beloved TTT is still the game that keeps calling me back.Don't let my personal preferences discourage you though as Tekken 4 is a solid fighter in every sense of the word (and easily in the upper echelon of current generation genre titles). Mechanically superior and definitely oriented to the expert crowd, Namco's brand of four-limbed combat is comparable to just about anything out there. Things change yes, but tag partners or not, grizzled fighting fans shouldn't deny themselves another go in the King of Iron Fist Tournament.", "date": "Sep 24, 2002"}