{"name": "Egg Mania: Eggstreme Madness", "name_review": "Egg Mania: Eggstreme Madness", "ref": "https://www.ign.com/articles/2002/09/25/egg-mania-eggstreme-madness", "text": "The days of wild puzzle game madness are seemingly at an end. With big production numbers such as Halo and Grand Theft Auto III taking center stage the art of the puzzle game appears to have been lost like a salty relic or an ancient scroll. Is it just us? Or has the puzzle genre slowly died off as games continue to hasten their transition from toward 3D realism?    Well, while the likes of Mr. Driller may have sparked some folks imagination on PlayStation, Egg Mania: Eggstreme Madness, the fun little puzzle game from Kemco seems to have nailed the formula down perfect, only here its with eggs. Lots of and lots of eggs.   Developed by HotGen Studios, Kemco's puzzler offers a novel take on the foundation that Tetris laid down more than a decade ago, and for those who enjoy lighte-hearted puzzle goodness, this game has it in light, sporadic bits. It's rather slim in the single-player mode, but as with any puzzle game worth its shapes, the two-player game is where it's at, and this one works that solid, addictive madness to get a real competitive heat going full on.   Gameplay  Egg Mania is Tetris in reverse. Instead of laying down the usual variation of shapes to create full rows to eliminate them from your screen, the concept of a full row is far more valuable because you must use it to build a tower of puzzle pieces that reach far upward. Essentially, Egg Mania combines the ideas set forth by the forever-classic Tetris with rudimentary platform elements. As your choice of eight unlockable, egg-shaped characters (you can unlock more), you will physically grab the traditional and not so traditional shaped pieces as they fall from above. Simply tapping a button will send it slamming down in place below. You're able to rotate it with the shoulder triggers, of course, and a ghost image of it will display below to indicate where it will drop.     Very much unlike Tetris, though, you are able to fill gaps in your building if you have the correct piece. You are never unable to go back to an area and fill a gap. The difficulty comes into play because there are multiple pieces falling from the sky at once, which forces you to jump upon the structure you've built to reach the correct ones before they pass you by and plummet into the water below. If you can't fill your gaps, and have a number of them, the structure of your building becomes unstable. The ~wobble meter~ at the bottom of the screen will gauge how much risk there is that the unstable portions of the tower will crumble. If that happens, it will send several rows of work crumbling into smithereens below you. As your goal is to reach a hot air balloon high above you, you can't risk these kinds of setbacks.    Essentially, this is the whole game. There are other elements: Bombs, cement power-ups to fill gaps, ability to upgrade your jump power, but the core gameplay is as described above. Having had our fill of the games many modes including Bomb, Solo, Tournament, and even the nicely done tutorial mode, which teaches you how to play, we found any initial excitement we had wore off quickly. The game's ~Over Easy~ mode, clearly for beginners, can be completed in less than 30 minutes. If you return to play more difficult modes like ~Hard Boiled~ there's certainly more challenge and more nerve-racking gameplay, but Egg Mania just loses its flavor very quickly. There is little sense of urgency, and if you look at some of the best puzzle formats out there -- Tetris, Puyo-Puyo, Tetris Attack, Devil Dice or Super Bust-A-Move -- urgency is one of the most important elements. With Egg Mania, you have to worry about water rising from below, which fills your gaps and causes that row to crumble, but above all the biggest fear you will have is how fast your opponent is at building.    Overall, Egg Mania is just too basic for its own good, at least in the single-player mode. It's a novel idea with a decent amount of options, but there's little depth to it, especially in the area of forming complicated combos, which is also a very important element of puzzle games. As for the two-player game, well, that's an all-out descent into massive warfare. Get another player in the room and the fight begins.   Graphics  Egg Mania's visuals are simple, bright with color, and somewhat cutesy. The egg-shaped character designs come in a number of forms that remind us of the versatility in smiley-faces. You have your punk-rocker, mohawk-wearing Spike, metal-encased mechanical Robo, and a number of other likeable, yet somewhat generic characters. However, as a whole, there's nothing visually impressive about Egg Mania. It's a 2D puzzle game after all, and where detailed, lavishly backgrounds usually play the biggest role, there is none of that. The graphics are utilitarian and perhaps uninspiring to some, but they're undoubtedly cute, and you may find yourself charmed without knowing it.    Sound  The soundtrack plays the biggest role in your audio experience in Egg Mania. Each of the themed stages, ranging from spooky Halloween to circus tents, comes with its own tune. All of the songs, as with the visuals, get the job done, but we wouldn't exactly call them moving compositions. They're meant to overlay the blatantly lighthearted action with something just as fitting, and they do just that. It's all around average sound design and definitely not a major function of the game. You can just as easily play your own music over top of it on your home stereo.I first played Egg Mania for five to 10 minutes at E3 2002. At the time, I found the lighthearted attempt to create ~Tetris in reverse~ was pretty novel and amusing. However, when we got a playable version in the office, and I spent some real time with it, I found that I didn't enjoy it nearly as I did with my first experience. It's just a game concept that wears off quickly. Having said that, it seems we're still in search of a long-lasting, truly addictive puzzler for GameCube.", "date": "Sep 25, 2002"}