{"name": "Empire Earth: The Art of Conquest", "name_review": "Empire Earth: The Art of Conquest", "ref": "https://www.ign.com/articles/2002/09/26/empire-earth-the-art-of-conquest", "text": "Last year Rick Goodman wowed us all with the original Empire Earth. Based on the concepts shaped and refined by Ensemble's superlative Age of Empires series, Empire Earth combined loads of detail and interest on one of the most massive scales yet seen in a strategy game. Players could fight through all ages of history, from the tribal wars of cavemen to the high-tech, long-range warfare of gigantic, futuristic battledroids.   The Age of Empires core is still one of the most solid approaches to this particular brand of real-time strategy and thankfully The Art of Conquest changes none of the fundamentals that made Empire Earth so engaging to begin with. But that's not to say that the expansion (developed by MadDoc rather than Stainless Steel this time around) doesn't differ in a few particulars.   The campaigns this time around are a bit more localized in time and place. For me, that's a bit of a shame. While it allows for a much tighter story, the point of Empire Earth was never to replicate a single campaign in detail. Rather, the first game allowed you to get a taste of the breadth of a particular civilization's accomplishments. Moving from the Trojan War to Alexander's victory over the Persians, or from Hastings to Waterloo, really gave the first game an epic sweep that's less apparent here.   I, for one, didn't mind the fact that the first game generalized a bit. By painting with a broad stroke, the developers we freed up to simulate over three millennia of warfare with admirable consistency. This approach was as visible in the overall arc of the campaigns as well as in the individual missions. The missions aren't meant to simulate the reality of historical battles in terms of geography and story but rather to convey the impression of these fights and the land around.   The epic scope of the game is supported by the huge maps, most of which challenge you to defeat several opponents at once. Being an expansion, I can completely agree with the developers' decision to let you hit the ground running in the campaigns. There are no easy, over-the-plate missions to ease you in, which means that those of us who are good at the game get that much more of a challenge.   First up is the Roman campaign, so sorely missed in the original game. You'll finally get the chance to lead legions against some of Rome's greatest enemies (including other Romans). Again, this campaign seems too narrow in focus, running merely from Marius' reforms to Caesar's seizure of power. It's an endlessly interesting century (and my main concentration in college) but it's unfortunate that the team didn't broaden the scope a bit to include such empire-defining conflicts as Scipio's conflict with Hannibal in the Punic War or battles like those of the Milvian Bridge or Adrianople.   After the Roman campaign, comes the Pacific campaign. (You can play the campaigns in any order; they're listed here in chronological order merely for convenience.) You'll take on the part of the Allied forces as they hop from island to island pushing the Japanese back towards their homeland. These missions, beginning with Midway are predictably sea-oriented, with transport ships ferrying your ground forces from one island to the next. This one is the most compacted in time, covering just the few years of fighting in the Pacific. At least in the German campaign from the original Empire Earth you went from World War I to World War II, experiencing and adapting to changes in technology. Here things are too static to be as engaging.   Finally there's the new Asian Space campaign wherein the player pushes his civilization on to Mars. A slightly ambiguous Asian force is tasked with getting their civilization to the stars, an objective that the competing civilizations share. While this campaign seems to focus on a war between competing colonies in space, only the last three missions bother to include space as a terrain feature and, of these, only the last one features any significant space combat.   The Space epoch opens up new units and allows use of the game's new space terrain. Unfortunately the concept of space merely replaces the concept of water, with the vast void between planets merely standing in for the oceans that separate land masses on other maps. The star map underlying the space terrain doesn't shift along with your view of the map which can make scrolling through the vast distances between ships and planets a hateful and confusing affair.   Likewise, the three space units -- carriers, corvettes and capital ships -- follow the same ~rock, paper, scissors~ approach of galleys, frigates and battleships. The carriers are distinct in being able to build and launch fighters but more centralized command of the fighters would have gone a long way to making the new unit a lot more useful. Instead, it can take too long to locate and reorder each of your fighters. Still, as the fighters themselves are the only unit that can travel both in space and over land, they have a tactical versatility that's hard to beat. Too bad they don't seem to know how to hit moving targets.   While the three new campaigns are each fun in their own way there are still several directions I'd rather have seen the series go. Instead of adding yet another World War Two conflict, how about giving us something new? An American campaign running from colonization to independence would be ideal. But even that shares a timeline with the English campaign from the original game. If you truly wanted to offer gamers something new, then why not pick something from the 1000 years of history between the fall of the Roman Republic and the Battle of Hastings?    If it really irks you all that much, you can always use the game's excellent scenario design tool to craft your missions and then link them together into a full campaign. The tools here are quite solid and even many of the randomly generated maps are interesting and varied enough to serve as the basis for one-shot skirmishes.   A lot of people have taken a shot at the game's graphics and, while the score below indicates that there are better looking games, there are few that try to do as much. What really gets me about this game is that it captures a sense of toy soldiers and tabletop wargaming and incorporates it almost flawlessly into a standard real-time format. The environments are significant in terms of tactics and the visuals really help drive that point home. Watching the units in extreme close-up won't strain your video card but it sure helps to get you involved in the action. Cheers to MadDoc and Stainless Steel for allowing the camera to zoom in tight on the action; jeers for continuing to omit any method of camera rotation.   There are still other some basic presentation problems, some old, some new. To begin with, the timing and camera work of the game's pre-scripted cutscenes continue to be a source of frustration for me. The scripted cutscenes are triggered by particular actions (moving a unit into a certain area, for instance) and can often leave you helplessly watching a short scene while your troops are still engaged in battle. Worse still, if the battle happens to be going on at the cutscenes location, the sound of battle can almost drown out the dialogue.   What did you think of Empire Earth The Art of Conquest?   The sound is convincing enough with realistic battle noises throughout the game's various ages. Each type of attack makes a particular sound and, after a while, you can develop a good sense of the scope of a given battle just by listening to it. It's sort of like knowing when to shift gears without needing to check the tachometer.   The unit acknowledgements, while quite personable, can get out of hand as large groups of units result in echoing or delayed acknowledgements. When the centurion is selected for instance, he says ~vini, vidi, vici.~ But if you select a group of them, they all say this with a weird delay that sounds a bit like ~vidividividividividi vici~ and reminds me of nothing so much as that gay robot from Buck Rogers.   Your unit AI occasionally behaves a bit erratically. When assaulting a town for instance, I frequently had to reorder my cavalry to explore the surrounding area. They'd move a few feet and turn around and then turn back to rejoin the attack on the town. Formation controls seem a bit tighter this time around but not by much. There are also still a few lingering path-finding issues, which is a particular problem with the big, slow units and especially when combined with rally points.   Beyond these changes, there's not much to else to say about the game. It does come with a new civilization designer (and two new civs -- the Koreans and Japanese) so you can craft your own unique civs. Look out for the Phoenicians! There are also a few extra civ-specific abilities, some of which are genuinely useful while others seem to be mere novelties. Bablyon's priest tower is in the former category, converting enemy units who get too close. The improved line-of-sight possessed by English town centers belongs in the latter category.COMMENTSI like Art of Conquest enough but it just falls short of being worth the $30 price tag. Rather than being a full-fledged expansion, this one seems like little more than a mission pack with a few extra novelties thrown in to sweeten the deal. While it's a solid game, there's just not enough here to compel me to reawaken the substantial addiction the first game generated.Whether or not it's worth it for you to pick this one up depends almost entirely on how much you enjoyed the original game. With so few significant changes it plays almost exactly the same. For those who couldn't get enough of Empire Earth, the expansion should be a perfect fit. Just don't expect the breadth and scope of the first game.", "date": "Sep 26, 2002"}