{"name": "Blinx", "name_review": "Blinx: The Time Sweeper Review", "ref": "https://www.ign.com/articles/2002/09/27/blinx-the-time-sweeper-review", "text": "When word first hit about Artoon's Blinx: The TimeSweeper at E3, everyone's jaw dropped.  No one had thought the Xbox hard drive would be used as anything but a storage unit.  But Blinx takes advantage of Xbox' hardware.  Acting like a TiVo, the hard drive records all of your gameplay.  Blinx, our feline hero, can then manipulate time with a variety of time-control devices.  The idea is novel and creates a unique puzzle-solving experience, as players must think beyond three dimensions to get past barriers and bad guys.  But beyond the interesting time gimmick, is Blinx a good game?  How does it stand up to classics like Mario and Crash Bandicoot?  This much is certain, Blinx ushers in a new era of Xbox gaming and that alone makes it worthy of applause.  Features  10 unique worlds and 40 levels filled with colorful creatures and challenging puzzles Uses the Xbox hard drive to record and manipulate game time - Pause, rewind, fast forward, slow-mo, and record! Challenging gameplay that will test anyone's mettle Upgrade at your leisure, whenever you have the cash It's a spunky cat with a vacuum cleaner, how can you resist?  Story Blinx is one of many time-janitors.  His job, and the job of his fellow feline janitors, is clearing out the time monsters created from inequities in the time fabric.  They guard over all worlds, using TimeSweepers (a fancy vacuum cleaner) to take out the trash.  Things are going along dandy until the Tom-Tom Gang, a crowd of hover-bike riding pigs, starts stealing time crystals from various worlds.  They even nab themselves a princess.  All of this backfires as their meddling creates large-scale monster problems in world B1Q64 (~Earth~ and ~Venus~ were already taken).    Turns out the majority of these time-janitors are scaredy cats, as they all flee when the fit hits the shan.  You know Blinx hasn't been neutered, 'cause he's got balls.  He heads off fearless to save world B1Q64 (hey, at least it's not world B1Q63, that place sucks!).  He'll have to explore a variety of unique locales and clear out every last time monster if he hopes to save the Princess.    Gameplay A princess in need of rescuing, a cute mascot, big goofy monsters, and a vacuum cleaner?  Don't call this a Mario clone, because Blinx and the plumber-twins don't have nearly as much in common as you may think.  Blinx is a tough game to judge because the concept is revolutionary for the Xbox, and that can cloud someone's view of the true game.  Of course the time-control abilities are an important part of the game and should be included when looking at the gameplay, but none of that should overshadow the other aspects.  It's easy to rush out and want to give Blinx a high score just based on inventiveness, but when you break down the game, some problems begin to show.  It's not a bad game by any means (it's actually great) and it's certainly the best platformer on Xbox, but it isn't the greatest game of all time, as hype would want to make it.    This baby's got a hard drive! Your every gameplay move is recorded onto the hard drive.  Proof of this comes in full replays at the end of each level.  That's up to ten minutes of gameplay recorded for your viewing pleasure.  Of course, if the game just made long replays it would hardly be hailed as revolutionary.  Blinx' real innovation comes in the ability to manipulate time.  The environment can always be manipulated by Blinx' time-control techniques.  Blinx, himelf, is never affected, allowing him to run around when the world is paused or move at a regular speed when time is slowed down.  Deaths come with one hit from an enemy or a fall onto hazardous ground (cats and spikes don't mix).  When you die, should you have a retry available (represented by a heart at the top of the screen), the game will rewind about ten seconds of gameplay so that your death is erased and you can avoid a hazardous ending.  It may seem like this could be done on a PS2 or GameCube, but the truth is it cannot.  An event can occur one minute into the game and then be rewound eight minutes later.  That means the game has to remember everything that has happened and is happening in order to maintain the time-control aspects.  And for that, you need a hard drive.  Being the first Xbox game to do something interesting with the hard drive, Blinx will surely open the door for other developers to get inventive.  But they could have actually done more, and we'll get into that a little later.  So, there's like levels and stuff... Blinx takes place over ten unique locales.  Each one is broken up into three levels and one boss battle.  The levels are relatively small, but they need to be.  You have only ten minutes to complete a level.  That may seem like a lot of time, but as the levels become more complex, with difficult platform puzzles and over a dozen enemies to defeat, those ten minutes won't seem nearly long enough.  And in fact, that ten minutes of gameplay will actually feel like a good hour sometimes.  Blinx manages to effectively alter your own perception of time.  Blinx uses his TimeSweeper (don't call it a vacuum cleaner, he'll scratch you) to take out the various monsters.  To complete a level you must defeat all the monsters and get to the Time Goal before time expires.  Each level is populated with trash -- garbage cans, logs, sprockets, former IGN employees -- which Blinx sucks up with the TimeSweeper and then shoots at his enemies.  Some monsters take more than one shot to defeat.  Some take quite a lot.  But you can't just go around sucking up everything in sight.  Your TimeSweeper can only hold a limited amount of trash.  Once you reach that limit, any further trash you suck up will replace trash already in your hold.  A potted plant does less damage than a log, so you need to manage what you suck properly.  If you know there's a big monster up ahead, suck up a giant barrel last, so it's the first thing you shoot out at your big buddy.  And here begins the strategy, because even outside of the time-control elements, you will have to be thinking a lot when playing Blinx.  You can't proceed to the next level until the previous one is completed.  This means that you must go Level 1A, 1B, 1C, and then 1D.  You can't mix and match at your leisure.  However, once a level is passed, you can replay it whenever you want and as many times as you want.  There are only two endings for every level (even when you replay them) -- you either pass it or die trying.      Time, time, tickin' in my head. Blinx is known for the time control and you will certainly control time.  By collecting time crystals, scattered about each level, Blinx can earn time control powers.  There are five powers: Rewind, fast-forward, pause, record, and slow-motion.  Each power is represented by a different colored crystal (each crystal also has a different shape).  But you can't just go running around grabbing crystals where you see them.  You have four slots for time crystals.  Filling those slots with either three or four of the same crystal gives you that crystal power.  If it's three (i.e. three record crystals and a pause), you get one unit of that power.  If it's all four, you get two.  So Blinx becomes a game of figuring out which time powers you need for a certain area and avoiding unnecessary crystals.  You can also collect hearts in the same manner to earn extra replays.  Like his TimeSweeper, Blinx' time-control storage has a limited number of slots.  This means you can only have a few time powers in hand at any time.  You can upgrade to allow more control slots at the shop, which I'll get to a little later.  Here's a breakdown of all of Blinx' wonderful powers:  Rewind: This rewinds events that have occurred in the view area.  So, if a statue had fallen, you can rewind and rebuild it.  You can also jump on a crate that's fallen off a roof, rewind, and ride the crate to the top of the roof. Fast forward: Rarely used, this one makes everything go faster.  Sometimes helpful when you're running low on time or when you're on a moving object that needs to get somewhere in a hurry. Pause: Stop the entire environment.  Enemies, platforms, switches, deadly axes and bombs, all of them are frozen while Blinx is free to move about. Record: Record about ten seconds of Blinx' actions.  While recording, Blinx is invulnerable.  When the record time ends, the game rewinds those recorded seconds and then a green 'ghost' Blinx proceeds to do the actions you just recorded.  This basically gives you two Blinx at once and is a great way to take out multiple enemies or activate two switches at once. Slow-mo: Slows the environment down.  Really great for taking out a lot of enemies in a room or getting through a closing door.  To activate powers, you need to hold down the B button.  This pauses the game, meaning that you don't have to have quick hands to select a power in an instant, since the game's not going anywhere while you decide.  Move the cursor over the desired power and release B.  The name of the power flashes in the corner and the screens takes on a different hue (green for record, grey for pause).  You'll also see a countdown letting you know how soon the power will run out.  When time's up, the game pauses again and counts down from three so you can be prepared for the changing speed of the world as things return to normal.    What exactly can a cat do? Blinx has the always-standard platform double-jump, which helps immensely when avoiding enemies, aiming at flying targets, and getting to higher platforms.  With a tap of the left thumbstick and the A button, you can jump to either side or summersault backwards.  These ones, however, don't offer a double-tap function.  Aiming the vacuum cleaner is a problem, and probably the biggest pain in the game.  Unlike another vacuum-cleaner game, Luigi's Mansion, there is no second thumbstick function that allows you to independently aim the TimeSweeper.  This is the biggest mistake in the game, something that hurts the gameplay.   Blinx has somewhat of an auto-target system in that, if you aim him in a certain direction he'll shoot towards a nearby target.  But without being able to aim up, Blinx must jump to hit flying targets.  This is incredibly frustrating at times.    But here's the strange thing.  Playing the game myself and watching others play, I've noticed your gameplay evolves over time in Blinx.  At first, everyone runs in, sees a baddie, tries to aim for them, fires once, waits, turns to look for another baddies, aims, fires, and waits.  You'll likely share this tactic too for a while.  But when you hit around the fourth area, where you go paw-to-claw with a half dozen enemies at once, those methods change.  And that's when Blinx really opens up.  The game feels much faster and much more enjoyable when you bounce into a room, meow with no fear at the six enemies around you in a cramped area, and then proceed to jump, fire, and destroy everyone in under twenty seconds.  And the game itself changes around this time.  The first dozen of so levels seem meant to ease you into the game.  Your main concern is beating bad guys.  But as the game progresses, the focus is much less on the difficulty of taking out five guys surrounding you (though that is challenging) and more on platforming elements.    Welcome to the Temple of Lost Time, where you get to play Indiana Blinx.  Here you must hop rising platforms, traverse crumbling walkways, leap past swinging axes, and avoid giant rolling boulders.  From here on out, the toughest challenges become keeping Blinx alive in the environment.  Where you could get away with not using your time powers for the majority of a level, now you have no choice but to use pause, slow-mo, and rewind to make it through the game.    Time management Time-control management becomes important later on.  In the first few levels, there will always be the needed time crystals lying around certain obstacles.  For instance, if you come upon a teeter-totter, you need to record yourself jumping up and down on one end.  Then, while your recorded self hops around, you go to the other end and get launched into the air.  In the first few areas, you'll find plenty of record crystals lying around.  Don't expect that luxury in the second half of the game.  This can be a problem sometimes when you get stuck in a spot because you don't have the right time controls.  You'll have to restart the level and make certain you have the necessary controls to get on by.  Though that seems like an unfair thing to do to gamers, it's actually not so bad.  I never said, ~Screw this.~  I always went back and got what I needed.  You'll get to know each small level on a detailed basis, where creatures are, when you need certain time powers for certain areas, and even what time crystals you can expect along the way.  Muh-muh-muh-monsters! The object of Blinx' TimeSweeping animosity are a variety of strange time creatures.  Created from left over time crystals (didn't your mother tell you not to leave your time crystals laying around?) these time monsters want nothing more than to rain chaos on the world and poor little Blinx.  Some monsters throw garbage, others roll, fly, and run at Blinx.  If the garbage or the monster touches Blinx (or he accidentally runs into one of them), it's curtains for the kitty.    Each area brings in new monsters.  You tend to see one or two new monster types added per area.  Learning their tendencies, how they attack, and their weaknesses are all trial and error.  You will die.  You will have to start levels over.  You will die some more.  It's all a learning process.  This is definitely a game that will have you swearing out-loud.  Not because it cheats you, but because you didn't see that one guy in the corner who popped you with a trash can or you tried to leap out of the way of a rolling, spikey bad guy only to fall off the platform and land on a bed of spikes (not exactly the best way to get a better night's sleep).  And it's fine for a game to frustrate as long as it seems fair.  And Blinx definitely feels fair in terms of how the monsters react.    Because of the time control aspect, there are a lot of ways to tackle any monster situation.  Of course, conserving your time powers may help you later, but if you don't use that slow-mo now, there may not be a later for Blinx.     While in the beginning, monsters are just blobs with eyes and balloons with snouts, they get more interesting as the game progresses.  One monster forms itself from items in the room, and if you're quick enough (or pause) you can suck up potential limbs before the thing forms.  This gives you a monster missing a leg or an arm.  Kind of a cool effect.  And there are fire demons and gigantic see-through blob beasts to come as well.  The deeper you go, the better the enemies look.  And that's the way a game should be, rewarding you with visuals and gameplay enhancements as the game progresses.    The Tom-Tom Gang Not only must you clear out those pesky time monsters, but Tom-Tom Gang members can be found in every level.  Sometimes they appear popping out of the floor or walls.  You don't have to take them out to pass the level, but you will be rewarded if you do.  And should you come across a large stash of gold, one of the Tom-Tom's will come out, riding on their hover-hog, sucking up the gold you're trying to claim for yourself.  At that point, it's all about launching some timber at them.  I thought cats were fast? Aside from poor aiming, Blinx suffers from slowness.  Not the game itself, but the cat.  He's the hero of World B1Q64 (see, Microsoft is creative!) and he runs slower than my grandmother hobbles.  Blinx is truly a slow moving cat.  This is really evident in the earlier levels because they are more open, so there's a lot more time to notice how long it takes Blinx to get his tail anywhere.  Later on, when you're confronted by puzzles, platforms, and enemies constantly, you won't really notice the slow movement.  Pray you never have to backtrack, because watching this kitty waddle is extremely aggravating.  Especially if you are running out of time and trying to get him to the goal gate.  Couldn't there be a run button?  Or heck, just make him move a bit quicker.  That vacuum can't become a jet pack or something?  Anything?  Beyond running slowly, Blinx has a couple of cool falling animations.  When falling down the side of a wall, he tries slowing himself with his paws and goes, ~merrrrooooow.~  And falling a long distance, the kitty will put out his arms and say what sounds like ~I'm falling!~ but surely isn't that, as he's a Japanese cat.    Value shopping You don't have to stay the same ol' cat the whole game.  By collecting gold in levels and collecting trash (you sell whatever's left in your TimeSweeper at the end of a level), you can go to shops in each area and buy new outfits, TimeSweepers and extend your replay and time control counters.   There are a lot of different TimeSweeper uprgrade options.  Some Sweepers can suck up sand, others can suck fire, and many include strength upgrades.  The very first level of Blinx has a 16-ton weight which can only be moved by one of the stronger Sweepers available for purchase later in the game.    And this brings us to an important aspect of Blinx -- replaying levels.  Gonna go back in time Going back to earlier levels is absolutely necessary.  You'll not only want to grab all the secrets (in the form of cat-head icons), but it's a great way to refill your time controls and replay hearts.  Plus you can score extra gold here that can be used at the shops to by fancy things.  If you don't replay levels, you likely can't pass Blinx.  If you aren't interested in finding the secrets, you will still need to replay levels.  Restocking is vital before playing any boss (and there is a boss for each of the ten areas).  At the end of each level, you'll see your time (which is given a letter-grade) displayed, a replay of the entire level, and your gold will be tallied.  Collecting secrets will unlock odd little cut-scenes.  The humor is very bizarre, almost Python-esque, but hey, if you're a completist you'll wanna see all of these odd little moments for yourself.  Who was in charge of cinematography, Stevie Wonder?! The camera in Blinx is garbage.  You'll find yourself constantly having to adjust it with the right thumbstick.  Even then, it's difficult to manage.  The game is filled with compact spaces, where lots of enemies roam.  The camera is too close to the action, meaning you can't see the entire room.  So there is almost always an enemy you can't see.  You develop a sixth sense for their movements though (don't ask me how, but you will be Luke Skywalker on these fools by the time you reach the Temple of Lost Time).  Still, it's unfortunate that you have to rely on luck and this cat-sense to avoid attacks.  And even that's not always possible.    The camera won't alway co-operate, even when you try and manipulate it manually.  This isn't always about seeing enemies.  Sometimes you'll want to get the camera at a good angle to view a couple of parallel platforms.  But when you let go of the right thumbstick, the camera decides to readjust itself, returning you to your poor view.  Terrible.  Cutting room floor Something all platformers have is a continuing story.  There are cut-scenes in-between worlds to keep players motivated to continue.  For this, Blinx is an unfortunate genre-breaker.  Aside from the opening and closing cut-scenes, there is nothing between areas to connect them.  You just keep on moving on.  Adding cut-scenes would have added some depth to the story and probably encouraged a few more gamers to continue on with the game.  Though it's still compelling thanks to its incredible difficulty, Blinx misses out on platform-greatness by leaving any hint of a story on the cutting room floor.  Cut-scenes seem to be missing all-around.  When you run out of retries, you get a ~game over~ screen and nothing else.  I suppose that's fine, if uninspired.  The problem comes when you run out of time.  The screen fades to black for a second and then the message ~Time over~ appears.  That's it.  No animation. No clock alarm.  Just an ending.  If you're going to try and create a mascot for a system, people have to be able to identify with them outside of gameplay context.  And that's where cut-scenes come in.  But Blinx remains a kitty without a proper prom.  Yeah, the school gymnasium's nice, but if there's no context for all the people dancing, then you never feel the importance of the event.    But is it fun Yes and no.  Blinx isn't fun the way a Mario game is fun.  It isn't fun in the sense of the traditional platformer, which makes sense since it is anything but traditional.  The game is a challenge, a real challenge.    It's enjoyable from start to finish, even though it can frustrate at times.  Don't be fooled by the first dozen levels.  That's nothing compared to how tough the game will get later on.  And chances are you will want to replay and get all of the secrets.  Some are hard to even find, almost all of them require that you use a time-control power to get them.  I can't say that I was giddy over the game or that I was gushing over it to friends, but I didn't want to stop playing.  Mainly because I refused to let the game beat me and I wanted to see the next area or the next boss.  And the bosses, by the way, get really interesting.  One of the best is a dude who constantly changes the environment by making different spots raise or lower.  A real challenge.  So, uh, that's not enough for you?? As I said earlier, more could have been done.  Commands like rewind affect predetermined events.  Certain bridge will always collapse, for example, and always when triggered by something (usually your entrance in an area).  But you can rewind that bridge that instant or five minutes later.  Either way, the event rewinds.  What would have been more impressive?  How about if things you do in the world are like chain reactions.  So doing one thing affects something else in the environment.  This means that you have to be careful about how you use your powers, because rewinding one event may affect another.  Instead the environments are static towards each other.  Each even is regarded separately.  Of course, this is a first run at this and I fully expect a sequel will do much more with time control than what we have here.  Graphics Blinx is one of the prettiest games on Xbox.  With stunning lighting, rich color, and amazing details, Blinx can buy me dinner anytime.  Not only are the worlds attractive, but all of them seem unique to the game.  The entire look and feel of Blinx comes off as original.    Blinx, himself, is a cute little cat with some funny animations and a great design.  And the monsters have fantastic variety and get really interesting later in the game.  But the real winner here is the environments, which have incredible detail.  Just look at all the cracks in the pavement and walls.  You get falling snow and rain, reflective water, and statues that look full of age and weight.  Truly stunning sights here.  On an artistic level, it was a great choice to place a cartoon kitten in such a realistic world.  The contrast makes the worlds look even more real.  You could almost reach out and touch them.  Fantastic art design and small worlds that you'll never forget.  But here's a gripe.  You can purchase cool new costumes in the various shops, but despite having an Indiana Jones-inspired world, there's no Indy get-up to purchase.  That would have been the cat's meow.  If anything, the only real problem with Blinx visually is the slowdown.  Though he runs fast and fluid for a while, later levels, when Blinx takes on five and six baddies at a time, the game noticeably slows down.  And no, I wasn't using a time power when it happened.  This slowdown is too often and too noticeable to let slide.  It's a flaw and one that needs mentioning.  Otherwise, Blinx is in the running for best-looking game of the year on Xbox.    Sound Each level has its own score, which is cool.  Most of the soundtrack isn't bad, but some of the music gets grating after a while.  As cool as it is to have a wide variety of music to separate each level, all of it should be pleasing to the ear.  And that's not so here.  Sound effects are very minor here as Blinx only says two things through all the gameplay.  The monsters barely ever make nose, though most give an auditory clue before attacking.  It's all just a little bit too small and too boring.  The rewind and time-effects sound cool, but how can you really mess up the sound of a tape rewinding?  Not bad sound effects, but nothing that will knock your socks off.  It is nice to see that the game supports 5.1 Dolby Digital.  The music plays off the front speakers and most of the sound from the rear is a bit too soft.  Still, you will definitely hear enemies behind you, which is a benefit to those who have 5.1, as they'll be able to rely on sound to help them avoid attacks from off-camera. Blinx isn't the perfect game, but it's certainly the best platformer on Xbox.  Calling it a platformer is misleading though, because this is hardly one set in traditional platform values.  Blinx gets incredibly difficult, so much so that it probably won't please some folks.  This isn't a Crash Bandicoot game where you die a few times on a boss, figure it out, and move on.  This one will take time and a real investment to master.There's no way to make it all the way through Blinx without having to go back to previous levels.  You need more money and time powers too often to make it through in one shot.  And it's designed this way.  And for as difficult as it is, I can't really say that it's so much fun as it is very enjoyable.  Blinx doesn't hit you the same way Mario does.  Instead, it becomes more of a game of ~You are not going to beat me, game~ than it does ~Oh, my God I love this little cat!~  Granted Blinx is a cute and a well-designed (if almost completely silent) character.  And he is more than a potential mascot for Xbox (though somehow I think Master Chief will remain synonymous with the 'box more than Blinx ever will), he is the future of Xbox games.  This is the first significant use of the hard drive.  The first real sampling of what makes the Xbox unique from the other consoles.  Developers will begin to get creative with the hard drive.  Maybe not so much next year, but certainly by 2004 we will see a lot more uses of the hard drive than just having the power of TiVo.  And for that, Blinx deserves a spot in anyone's video game library.  Not only is it a solid, challenging, and beautiful game, but it's also a significant step in the direction of the Xbox.  And while not the best game on Xbox, it may very well be the most important one yet.", "date": "Sep 27, 2002"}