{"name": "Skullmonkeys", "name_review": "Skullmonkeys", "ref": "https://www.ign.com/articles/1998/02/04/skullmonkeys-2", "text": "There was a time when there were only a few basic types of games made for consoles. You either had shooters, hack and slash (or shoot) action games, sports games, or platform games. Of course, they were all 2D because, well, there was no 3D. And that was fine because you didn't know what you were missing.  Now it's the late 90s (man, time goes fast) and we're squarely ensconced in 3D games. Yeah, I know there are some of you out there who just love 2D games. ~Eh, 2D games are better because they focus on gameplay, eh, whine, whine.~ Whatever. My whole deal is if a game is going to be lazy and be 2D, it better have some pretty damn amazing gameplay. Skullmonkeys, the new platformer from the same folks who brought you the PC game The Neverhood, is a 2D game. It does do some cool things, particularly with the claymation-style animation made popular in the first game. But does it have that brilliantly amazing gameplay that makes up for the fact that it's 2D? Frankly, no.  This isn't to say it's an entirely bad game. You control Klayman, who has returned from the PC title to        save his home world from the evil monster, Kogg.        Kogg has recruited the help of the        Skullmonkeys, gorilla-like beasts with skulls        for heads from the planet Idznak, to aid him        in his conquest. The game is set up in typical floating platform style, with the monkeys waggling back and forth across them in tight little patterns.   Control in the game is top-notch, with a basic, intuitive interface that's remarkably easy to learn. Along with the obligatory jumping, Klayman has a variety of power-ups to help him. He can shoot green orbs at his enemies, launch homing missile birds, or release a decoy Klayman to distract the tougher baddies.  The main problem with the game is it all looks so alike. There are enemies beyond just the basic Skullmonkeys, but most of these consist of jumping Skullmonkeys, flaming Skullmonkeys, Skullmonkeys that walk back and forth really quickly, etc. The levels are remarkably similar as well. After you pass the jungle level, with its floating platforms and Skullmonkeys, you proceed to the factory level, with its remarkably similar floating levels and Skullmonkeys. And with 120 of these, it gets old fast. Plus there just aren't that many new gameplay elements being introduced here. It's all standard jump-on-enemies' heads stuff, with little in-between.   There are tons of platform games coming out now that are helping to change the genre, such as Crystal Dynamics' Gex: Enter the Gecko and Namco's Klonoa. With games like these on the horizon, Skullmonkeys seems too dry. If this game had come out six years ago, it would've been the bomb. Today it's more of a dud.  Adam Douglas", "date": "Feb 4, 1998"}