{"name": "SEGA Bass Fishing Duel", "name_review": "Sega Bass Fishing Duel", "ref": "https://www.ign.com/articles/2002/09/30/sega-bass-fishing-duel", "text": "Ah, the lovely past time of fishingvideogame fishing. It's not an action game, nor does it ever provide a deep story; there are no cool cars involved or hot chicks hanging around looking for a good time. Fishing games traditionally have been average looking at best, and they're aimed at one thing and one thing only. Scaly, lipless creatures with neither feet nor hands. Water-based organisms that often breed without touching, that eat worms, or worse, crickets or grub.    But what a wonderful feeling it is to catch a fish. It's an unrivaled, distinct sensation that I became addicted to by this very fishing game despite my clear lack of interest or desire to be, for lack of a better word, hooked. It's not really fair. I mean, what's the world coming to? Must I fall in love with a fishing game despite my best efforts not to? Must a man like fishing games? Is there any end to the constant manufacturing of fishing games? Must a man have to catch a 15 .lb Bass before he goes home from work? or to feel that he is a man? Is the world not crazy enough already? So many questions, so little time, many more bass to catch.    Gameplay  You want to fish. You need to fish. You love fishing more than life itself, and you are driven to buy fishing games. It's as if you and fish are one. The feeling comes deep from a part of you (though you're unsure where), and from that section in your spleen, kidney or buttocks, you are propelled into the world to buy a fishing videogame. Another fishing game. Not satisfied with the real sport, or perhaps lusting for a different sensation altogether, the small wiggle of the bait, the desire for the struggle of a poor, dumb animal struggling against the sharp hook that pierced its face confronts you, and you are dumbfounded. Stricken. Stripped of all sense. You must go fishing, and so you run to the store and buy the PS2 game that's newest and it is Sega Bass Fishing Duel.    It is unbelievably filled with fish and lures and more than six different places to fish. God bless Sega! Beaver Docks! Deer Creek! Anderson Bridge! Eagle Dam! Cormorant Cove! All part of the luscious Lake Eagle! you are on a mission to catch the greatest Bass there ever was, but wait...Glory be! Sega Bass Fishing Duel is filled with gameplay modes, too? There is a God, afterall! You can select from Free Fishing (perhaps a ticket to heaven?), Tournament (you face other fishing enthusiasts, what a great idea!), Character (select from the greatest fishing nobodies ever), Training (another heavenly opportunity to fish! Ah ha!!), and two-player Free Fishing or Two-player Tournament. Mercy, mercy. Oh great god of fishing, have mercy on us all, and all that involve hooks and bait.    And is the fishing good? Is there but one answer, my friend? (There is. It's pretty good fishing. Players can catch Crappy, Blue Gill, and various size Bass in the six various areas of Eagle Lake. Using a boat to find the best location, you can skipper it fast or slow, being careful not to disturb the peaceful tranquility of the finned ones.)    And what's more, the Duel Fishing bit is pretty fun stuff. Once you get good enough, you enter challenges to see if other fishermen will join your club. If you win, they join, and you go in search for another possible member. If you lose, they walk. In this mode, the screen vertically splits and you compete in a head-to-head fishing ~duel.~ It definitely adds to the excitement and tension of fishing, which is always in need of a little angler (oohhh).    The game offers as many as 102 lures, which doesn't mean 102 actual lures. It means there is often five or more lures within a classification (such as top water, crank bait, lipless cranks, jerk baits, etc.) with various colorings, for instance. There are various places to fish -- amongst reeds, logs, near dams, or among shallow creek entrances -- and Sega Bass Fishing Duel offers both deep and shallow choices.    It offers an easy fishing mechanic. Casting is done by pressing the L1 button. By using the dual analogs, you can change up you casting style, be it side-armed, over-hand or variations therein. Once a fish is caught, press L2 to snag it, and then reel it in with the right analog stick. The game offers a meter showing tension, direction and whether you should reel or loosen the line. Then, once the fish is close, the camera changes from an underwater cam to a third-person perspective cam, and a new meter appears. This one shows when you need to pluck the fish out of the water. When the little horizontal sliding bar reaches the expanding and contracting centerpiece, you press a button, and voila! You have caught a fish!    Naturally, catching larger fish is much harder to do, and players need to learn how to imitate bait patterns to attract the bigger ones. Players can break lines or lose fish by not snagging them properly. But once you do get the hang of it, you'll be looking for that 15 pound Bass fish all frickin' day. Just like I did. The only things that bring down Sega Bass Fishing Duel are the visuals, which I'll talk about later. This game treads carefully between arcade and sim styles, leaning toward a more sim-style of play with the bigger fish. But it's still wrapped up in a nice arcade package -- the rules and lessons are easy to follow, the gauges and indicators all make sense, and the game is easy enough to get into that you can catch a few relatively easily in the first five or 10 minutes.    Graphics  The big letdown with this game is its graphics. Well, let's restate that: Most fishing games aren't very good looking, and this one is no exception. The characters, boats and environments look very much like they have come from an arcade machine, and the menus are boxy, blunt, and at the very least, functional. In other words, the game looks clean but dreadfully bland.    The character models are extremely awkward and clumsy looking and unfortunately un-realistic. They're great characters to MST. In fact, since their dialog is so silly, it's worth listening to. It's not that interesting, but since you're playing this fishing game, they're definitely worth seeing and hearing.    The water itself is the best part of the visuals, which is re-assuring, since this is a fishing game. With shafts of light striking the water and bits of dirt swirling about and minnows circling around dock posts, the water is pretty decent stuff. There is a fair bit of underwater fogging, but that's intentional and realistic.    Unfortunately, fish do ~pop~ out of the picture when you pull your reel in, rather than gradually disappearing. And your hook often drags through rocks and other normally solid objects when in reality it shouldn't. Unfortunately there is also a lot of aliasing, shimmering and textures seam ripping, which definitely distracts from the otherwise decent looking environments.    Sound  Poor, imitation elevator disco is the best way to describe the music in Sega Bass Fishing Duel. You basically don't want to listen to this music at all. As for the sound effects, well, hmm... there is a lot of swishing and splashing and...what am I saying? The sound is almost entirely unnecessary -- and useless -- in this game.    Perhaps the best way to handle sound in a game of this nature is to simply deliver the sounds of nature itself, instead of filling in the background silence with cheap, electronic music. Chirping birds, lapping water on the beach, and quiet would have been pleasant. At least the one sound effect -- led by the announcer -- makes things right. He sounds like a bad AM radio DJ and he yells at you when time is up. Mean AM radio DJ!So, if you like fishing games, this is a decent one. It doesn't look all that good (I would say the Dreamcast fishing games offered better textures, less aliasing and seam ripping), but then again, fishing games have never really impressed with their visuals. It's fairly sim like later on when the going gets tough, but in the beginning it's easy to get into and play. All in all, it's not a bad...catch (ouch).", "date": "Sep 30, 2002"}