{"name": "Nagano Winter Olympics 1998", "name_review": "Nagano Winter Olympics '98 Review", "ref": "https://www.ign.com/articles/1998/02/05/nagano-winter-olympics-98", "text": "When I first heard that Konami was creating a winter sports title for the N64, I was convinced that we would again be treated to a Konami masterpiece the likes of International Superstar Soccer. Remember those sleepless nights in front of your C64 or Atari playing the Epyx classic Winter Games? Well, hold on to those memories, because Nagano Winter Olympics '98 won't bring that experience back.The N64 Nagano '98 (which is an improvement over the ugly PSX version) has two basic modes, Olympic Mode (select any event) and Championship Mode. Four players can go head-to-head (consecutively) and take part in 12 events, ranging from bobsled to snowboarding.Gameplay: Many companies have struggled with multi-event games in the past. How do you make an interesting title with different play-styles without losing consistency and balance? Shadows of the Empire walked a fine line when it mixed awesome snowspeeder battles with mediocre Doom-style shooting, but it was the Star Wars license that saved the game in the end -- not the variety. Nagano Winter Olympics has no such ~star~ license to fall back upon and inevitably trips over its diversity and falls head-on into the snow.The most obvious problem is a lack of balance. Good events are mixed in with long, boring ones -- making the competition mode virtually unplayable.Let's take a quick look at the 12 different events:Alpine Skiing/ Giant SlalomThis is the first event you will play in the game, and it's truly horrible. You ski downhill, slowly gaining speed as you go around the markers. As a matter of fact, things are so slow, you really start to wonder why Konami didn't just leave the event out of the game. I'm not kidding. Even if you don't ski in real life, this just doesn't feel right.Alpine Skiing / DownhillSteer with the analog stick and use the A-Button for edging. Apart from a nice sense of speed and cool sound effects, there's not much going on. Although you use the analog stick, the control is only semi-analog. The key to fast speeds is to steer as little as possible (the less friction, the better). Not an exciting premise for a videogame.Ski Jumping / K=90 and K=120These two events are generally enjoyable and should hold your attention for a while. The controls here are good and it is clear that Konami tried to do something different by giving you more control about angle, jump, posture, and landing.Freestyle Skiing / AerialsSelect from a list of tricks, punch the power button and watch what happens. A perfect landing (press the button again) earns you more points. Dull -- despite the stunts.Snowboard / HalfpipeSounds exciting, doesn't it? Alas, the gameplay is like PaRappa the Rapper -- just without PaRappa and the rapping... You create a list of tricks you want to perform, then you watch your boarder shred (for lack of a better verb) through a halfpipe. The computer then displays button commands and you scramble to enter them a quickly as possible. It's a cool idea, but the whole event runs at sluggish speeds, making the stunts look dull and unexciting.Snowboard / Giant SlalomThis is essentially Alpine Slalom with a board. Same control, same feel, same awful speed problems. Mediocre semi-analog control.Speed Skating 500m and 1500mControl the speed via the L/R Buttons (left/right leg). In an attempt to do away with senseless button-mashing, Konami tried something different and makes you observe a certain rhythm while watching over your skater's stamina. Imagine watching someone run while pressing left, right, left, right, left, right, left, right, left, right, left, right, left, right, left, right, left, right, as the camera slowly follows the runner. The reason why many of the old track and field and olympics games were exciting is because you had to use all your power to do a quick sprint while keeping an eye on your opponent. In Nagano '98, you can only play one player at the time against the computer. As you can imagine, this makes for long, boring waits.Bobsled / Four-manOne of the most popular events at the office, the four-man bobsled enables you to lead four characters to push the sled, then jump on, one after the other. As your sleigh picks up speed in the ice tunnel, you have to keep it from flying off the track. Nice speeds (at choppy framerates) and cool sounds top off this enjoyable event.Luge / SingleThis is very similar to the Bobsled, but the luge is much lighter and it's easy to fall off.CurlingGet as close as possible to the target and try to knock your opponent's stones out of the way. Arguably the best event in the game, this slowpaced ~ice shuffleboard~ succeeds because it lets two human players directly compete with each other. Okay, so the funny ice-scrubbing helps, too... But if you play with three or more players, the waiting players will die of boredom.Multiplayer: At the heart of any sports title is multi-player competition. Nagano '98 pits up to four players against each other, but unlike other sports games this does little to heighten the gameplay experience. With the exception of Curling, players play consecutively -- not at the same time -- which makes for a whole lot of waiting. If you have to stare at three players slowly ~slaloming~ their way down a gently sloped hill for minutes, even the most hardened players will eventually lose interest and cry for GoldenEye.Graphics: Nagano '98 is full of impressive visuals. The graphics are extremely colorful, with good-looking winter environments and accurate ramps and stadiums. The ice events stand out with excellent reflections, but overall, it looks like the game lacks a final layer of polish. A bit of fogging (seriously) and some lighting/shading effects would have helped make the look a little less flat. Player animation is generally good, but can be a bit twitchy at times. The different locales look very authentic, with mountain backdrops, plenty of track detail, trees, advertising boards, and lots of people.Sound: The crowd noises and sound effects are fantastic -- a clear step above ISS64. Apart from cheers, shouts, and whistles, the audience also reacts to whatever you do (for example, if you stumble in the skiing events). To top it all off, there is a lot of dynamic track-side murmur and cheering and a great-sounding announcer. In the downhill event, if you ski past a stretch of trees or a tribune, you will actually hear a difference in sound. The music is pretty good, too, with nice bass tracks in the half pipe event and a decent intro tune. But what ever happened to national anthems, Konami?The sound effects are as good as they get, with accurate stereo separation, surround effects, and clear samples. The bob sleigh and ski noises are especially convincing. Without a doubt, Nagano Winter Olympics is one of the best sounding games on the N64 yet. Too bad the gameplay lags behind.Options: Data management, ranking and an awards screen. No Rumble Pak support. You need a memory pak to save your scores.Nagano Winter Olympics '98 is a flawed game with a few highlights that has ~hurry and get it out in time for the Olympics~ written all over it. There is virtually nothing here that even comes close to Sega's Winter Heat, or Epyx's classic Winter Games. If the TV-coverage of the Games isn't enough for you, you will probably want to rent Nagano for a day or two -- but be warned that this is not a good multiplayer title. Konami has shown what it can do with International Superstar Soccer (programmed by its in-house team ~Major A~), but Diamond Dusts's first 64-bit effort will leave you out in the cold. This one won't win any medals. Okay, I'll stop with the puns, but please don't buy this game.", "date": "Feb 5, 1998"}