{"name": "NIRA Intense Import Drag Racing", "name_review": "NIRA Intense Import Drag Racing", "ref": "https://www.ign.com/articles/1999/08/11/nira-intense-import-drag-racing", "text": "Drag racing simulators have always been kind of a mystery to me.  I mean, who the hell wants to race down a  mile long track with no curves?  It just didn't seem that challenging or interesting to me ... until last year.  That's when I first wrapped my driving gloves around Burnout: Championship Drag Racing from Bethesda Softworks.  I learned a lot about drag racing from Burnout, and a lot about the strategies involved.  It's not just about having the fastest car, but about knowing exactly what your machine is capable of.  So when Bethesda's latest drag racing sim -- NIRA Intense Import Drag Racing -- showed up at the office, I was eager to see what the design team had done to improve on their previous drag racer ... and I was pleasantly surprised again to find a drag racing sim that actually kept me entertained.  The first thing you'll notice about Intense Import is, like Burnout, these aren't the big, long cars you're used to seeing at drag racing competitions.  Instead, these are modified vehicles you can find on any city street, just heavily modified for racing competition.  While you don't have as many chassis options in Intense Import as there were in Burnout, there are ten basic chassis to choose from:   '97 Mitsubishi Eclipse  '97 Toyota Supra  '74 Datsun 240ZX  '94 Acura Integra  '93 BMW M3  '97 Porsche 911  Papadakis Honda Civic  Jun Hyper Lemon Silvia  Apex VMAX Pro Skyline  '84 Honda CRX   You can either choose to stick with a stock selection or customize the hell out of your car in the garage.  This is the real meat and potatoes of the game because every little change will have some effect on the performance of your vehicle.  Hardcore mechanic freaks are going to do a backflip when they see all of the available options.  Of course, this is also where the casual gamer may lose interest in the game because it's definitely a daunting task trying to determine exactly what each little modification will do to your car if you're not already at least partially familiar with auto mechanics.  The manual explains the basics, but doesn't go into great detail.    You can tweak just about any aspect of your car, including the engine, transmission, wing, tires, suspension, and turbo boost just to name a few.  There are over 85 engines to choose from alone, not to mention a custom engine option which lets you start from scratch and build your own unique motor, and you can literally spend hours in the garage screwing with your four-wheeled babe magnet.  And, although the paint utility is rather difficult to use, you can give your fire belching fire beast a custom paint job before you show up for the big race.   Once you're satisfied with your souped-up machine, it's off to the drag strip to show off your custom street car and maybe even for a little racing action.  Players can jump into a quick race, single race, a multi-race event, or go for a full drag season.  There are over 20 tracks in the game, even though all of them look pretty much the same.  They are all drag strips after all.  And while the cars and tracks look nice enough, the off-the-track graphics leave much to be desired, and detract somewhat from the overall racing experience.  However, your main focus is going to be on that little white line a  mile ahead of you.    There are two basic race types, straight and simple drag racing where two competitors start at the same time with the first racer to cross the finish line declared the winner, and handicapped racing, which evens out the field a bit.  Handicapped racing is actually sort of a weird concept, and it's where most of the strategy in drag racing comes into play.  At the beginning of the race, you have to dial-in the time you expect to cross the finish line.  Dialing-in the appropriate time takes a lot of practice and it changes depending on your car and the weather characteristics (such as humidity, wind speed, and temperature) of the location where you're racing.  Your dial-in time determines when the green light flashes on your 'Christmas tree', allowing you to start your run down the drag strip.  If your competitor has a higher dial-in time, his green light will flash before yours and he'll be able to start his run.  For example, he dials in 11 seconds and you dial-in 9 seconds, your opponent will have a 2 second lead off the line.  Now here's where the real strategy comes in.  The winner of the race is still determined by who crosses the finish line first so, if you have a faster car than your competitor, you can raise your dial-in time to start off the line earlier.  You'll just have to watch your acceleration because, if you cross the finish line before your dial-in time, you're disqualified.  This type of drag racing makes knowing your machine and what it can do even more important than building the fastest car possible.  The actual game physics feel really good, and you get a real sensation of the incredible high speeds involved in drag racing. Before you race your car, you can analyze your creation using 32 telemetry and data card time points which will give you detailed insight into how it's likely to perform.  Drag racing isn't just about putting the pedal to the metal.  You'll actually have to steer a bit as you race down the strip or you'll end up in the wall or in your opponent's lane ... which isn't necessarily a bad thing, at least if you want to see some spectacular crashes on the instant replay.  The game supports up to 32 human players via a LAN or the Web, but good luck finding any competition.  On numerous searches on kali.net (an online service that supposedly supports Intense Import), I was never able to find anyone to race against.  I did get to try out a few LAN games, though and I am the grand drag racing champion around the office, beating out Vinny, Steve, Trent, Mr. Robot, Evil Tal, and even Bobo.  Stupid monkey, drag racing is for humans!   Overall, the game designers did a good job with NIRA Intense Import Drag Racing.  I didn't like it quite as much as Burnout: Championship Drag Racing, but it was fun and it did keep me coming back for more, at least for a while.  The only big problem with the game is the graphics and sound aren't up to par with other modern racers, and that it's a niche title that appeals to hardcore drag racing fans and may alienate the average gamer who's just looking for some quick fun.  Intense Import does have a high learning curve, so expect to spend some time exploring all of the aspects of the game.  But if you do have the patience for it, you'll be rewarded with a drag racing game that's surprisingly fun and entertaining.  -- Tal Blevins", "date": "Aug 11, 1999"}