{"name": "NBA 2K3", "name_review": "NBA 2K3", "ref": "https://www.ign.com/articles/2002/10/07/nba-2k3", "text": "Sega brought NBA 2K2 to the next-gen console dance a little late last season. Getting somewhat of a stagnant jump to the market because of the death of the Dreamcast, the 2002 edition of Visual Concept's hoopster was really nothing more than a rushed port job. It was a solid game yes, but one that perhaps didn't get to fully utilize the power of the newer consoles. That's not the case as we head into the new NBA season. This is the first Visual Concepts basketball game specifically made for next-gen consoles.   Having been top b-ball dog for the past few years, VC could have sat on their duffs and just updated the rosters.  Instead, they worked to make the game even more realistic with several new moves, a beefed up Franchise Mode, and full use of their newly acquired ESPN-style presentation.  Though Sega's baller still has some nagging problems, it's certainly improved over last season's version.   Gameplay  The problem sometimes with looking at basketball games is that many of them are trying for different things. The other hoops titles coming out this year are all geared towards a more loose, arcade experience. --And there's nothing wrong with that, because it can certainly be a good thing. However, NBA 2K3, as with all Sega Sports games, looks to bring realistic gameplay to the table. When it's examined and judged, we may be a bit more critical, because Visual Concepts is trying to make the best sim possible. And a sim can often have more nagging issues than its arcadeier counterpart. With that said, we delve into NBA 2K3, a game that had some problems last year in terms of offering a realistic experience. I won't leave you in suspense, many of those issues have been resolved and 2K3 is definitely on the right track to sim supremacy.   Last year's problems  Shot percentage - NBA 2K2's biggest issue was the ridiculously high shot percentage by the computer AI. It wasn't uncommon for the computer to shoot 70% from the floor, which for a sim game is terribly inaccurate. In the NBA, shooting 60% is outstanding, and maintaining that average is phenomenal.   Solved: Having played scores of games with NBA 2K3, I can assure you this is no longer a problem. Though teams may shoot a bit higher percentage than normal, it's rarely beyond the 50s and you will even see percentages in the 40s and, yes, even the 30s. Best of all, NBA 2K3 now has sliders, which allow you to adjust a slew of game attributes so the game plays the way you want it to.   Goaltending - Way too often you'd get incorrect goaltending calls. Sometimes the ball would be well off the rim and you'd get tagged. There were easily a half-dozen, if not more, goaltending calls each game.   Solved: This was solved in two ways. First, the rim has more realistic physics so the ball will react to the rim properly and the game will actually interpret where the ball is in relation to the rim. And second, there is a lack of a goaltending animation where far too often a defensive player jumps up aggressively but pulls his hands back rather than grab the ball and get called. You will still see one or two goal tends a game, but nothing as gross as 2K2.   Trouble under the basket - Sometimes you'd go for a shot but your angle was weird and you'd shoot underneath the backboard, causing the ball to bounce out of bounds.   Solved: There are new animations and a more solid offensive AI around the basket. Basically, if you are at an odd position, one where you would obviously be shooting under the rim or backboard, the player will take a step out to make a more clear shot. This doesn't mean the shot will fall, but I've yet to see a player shooting some of those terrible shots against the wrong end of the backboard.    New Additions  Along with these fixes, Visual Concepts has added several new things to the game to improve on last season's solid title.  Not all of these additions, however, are implemented in the fullest, making them kind of cool to have but not really as effective as intended.   Among the most notable new moves is the ability to dive after loose balls. Anytime the ball is loose and headed out of bounds, you can press jump and your player will dive and try and swat the ball to keep it inbounds. This looks incredibly cool, but is unfortunately not all that when it comes to gameplay. There really aren't that many times in the game where a ball is loose and headed out of bounds, and even then you have to have someone close by to dive for it. More often than not it won't be you but one of the computer-controlled players (on your side or the opposing side) diving after a loose ball. The real let down is that you can't dive for loose balls not going out of bounds.  In other words, if the Diesel swats away an Iverson lay-up and it's bouncing towards half court, you can't dive and go after it. In fact, if you do try, you'll just jump straight up, which makes your player the laughing stock of the entire league; a good idea, but one that needs to be there in all facets of gameplay to be truly worthwhile.   Another nice one is the double crossover. When Kobe takes it to the lane, pulls off some sweet crossover and blows past a defender, he would have been screwed in 2K2 if a second defender stepped out to clog the lane. But now you can get better flow in the game by quickly pressing the crossover button again. This way you can adjust and blow by the secondary defender as well. This is great for anybody who loves driving the lane (and that's really what you'll end up doing most games anyway).   The post game has seen some tweaks, particularly with fighting for position. Last season you really couldn't contest for position in a proper manner, but now when two players back each other down, you can push up and down on the analogue stick to try and move ahead or get behind the other player. If you're playing offense away from the ball, you can try and get behind the defender for an easier path to the basket and a defender can choose to keep the opponent away from the basket or try and position himself in front to steal an incoming pass. This adds dimension to a post game that was already solid last year. For me personally this is the best, because I'm a big fan of playing the big men down low. And if you have good perimeter shooters it's helpful to draw the defense and then pass out to an open shooter.    There are now new types of passes including chest high and bounce passes.  These are accomplished by pressing harder on the pass button.  The one thing you have to know (and how would you know to do this) is to go into the menu system and turn on maximum passing.  This is often a great way to get the ball around, but other times it seems you do the wrong type of pass.   There's a problem with the passing game at times however. When trying to run the fast break, you can often pass the ball up the court and the baller you're passing to will stop in his tracks to catch the pass. This is exactly what you don't want. There's a very tenuous balance based on pressure. Sometimes you need to tap the pass button to lob the ball and keep your man moving, other times you need a bullet, and other times it just doesn't seem to matter. Over time, after many games, you will learn to adjust properly and pulling off long passes will become possible.  But it's likely going to frustrate you initially.   The best of the additions and the best implements is the ability to change your shot midair. This only goes for lay-ups and dunks, but it's a great way to avoid a block. When you go up for a dunk or lay-up and you see a defender closing, press the shot button again and you'll alter your shot to try and avoid the block. You're more likely to miss a shot when you do this, but then again, if you don't it could be swatted back in your face. And that would shame you.   Added also is the ability to do advanced pivot moves. These can be done with a live or dead dribble and the moves change depending on that fact. Just hold down the button and swing the left thumb stick in various directions. You can jab step, hold the ball away from the defender, or swing it side to side. This is a great taunt, but also a good way to get spacing for a shot or to blow past your defender. The problem is, the ball is very, very vulnerable in this situation. And as such you will have it stolen more often than not. And what's really annoying is that when it's stolen, you always enter the same animation of spinning around, looking confused. This gives your opponent an extra step on you and no chance to recover. This is unfair and worse yet, adjusting the sliders cannot stop this from happening. Trust me, I've tried everything. A cool idea but one ruined by making it far too easy pickings for the defense.   The weird thing about these new moves is that anyone who's played previous versions in the 2K series may not fully use and enjoy these new features. That's because  2K3 plays very much like the previous iterations and it's very, very easy to fall into your old gameplay patterns. You can certainly play the game without using these new features, but somehow it will feel even less effective than last year. Once you begin utilizing the double crossover, shot changes, and bounced passes, you'll open it up a lot.  The real trick is teaching yourself how to use them regularly.   Control  Anyone who's played previous versions will not have any trouble picking things up. The controls, though a new pivot move has been added and you can now pass with the right thumb stick, are the same over all. Everything feels good and it's a breeze to pull off any of the moves. Crossovers, shots, backing defenders down, and going to the hole are simple to manage.   Where you may have trouble, especially if you're new to the series, is the flow of the game.  It seems like it should be a quick contest filled with endless drives to the hole.  But as I said earlier, this is a simulation and as such it's not always easy to make endless dunks (except in rookie mode). You need to actually play the game the way it's supposed to be played, by passing the ball around and trying to find holes in the defense. This year in particular, it's vital to get open shots.     It's much harder to hit shots with defenders in your face, part of what makes the shot percentages more down-to-earth than in the past. That doesn't mean open shots automatically go or that crazy leaners don't fall, but it's much more likely you'll nail the open jumper than one with Shaq up in your face.   NBA 2K3 is an exercise in both love and frustration. As a whole, I love the game.  I will spend the winter playing a decade of basketball with it. However, there are a lot of times where I can't buy myself a shot. And that's going to anger some low patience gamers (though it's still a solid attempt at realism). You can brick dunks and screw up open lay-ups too and it is hard to do a leaning shot towards the basket with two big men so close on you. It's hard to accept, I know that sounds weird but it's true. The game is as real as it can be. But that will piss some people off, and it's pissed me many a session. Stepping back and looking at the situation when I was bricking a shot, I can see the logic in the miss. But in the heat of play, it makes me mad. And if that sounds like a problem for you, then you may be more geared for a less realistic experience offered by EA or Konami because this one takes it real.   The play-calling is the thing (except here, where it sucks)  The 2K series has always used the same play-calling system. Each team has a set of offensive plays. You can watch the plays run out for you so you can see how they should be done. To be honest, does anyone even use this? For most it's probably confusing. It's one thing to be a sim, but this is where NBA 2K3 takes it too far.  You don't need X's and O plays. There are only a few plays really run in the NBA and only those few generic plays that need to be in the game.    You don't need a bunch of different isolation plays or shots to set up the three either. It would be better if the D-Pad were used to call one of four loosely scripted plays. Up to get it inside, down to hit outside, and left and right for the pick and roll and isolation play. And the problem is that if you don't use the plays I mentioned, the offense often just stands around doing nothing. This kills the flow of the game and is the reason why you will more than likely keep trying to drive the lane or throw it deep into the post.   The post points for your team will likely be two-thirds of your total score, which is quite high. Some of this may be player mindset, but I think a lot of it comes from how stagnant the offensive game can become if you don't play along with VC's game plan. It's about time something fresh came out of the play-calling system, so perhaps next year Visual Concepts will step up to the plate and bring us something new.    Another problem, again, is the passing. It's hard sometimes to pass to the right guy. You can use icon passing for accuracy, but this is a two-button process, as you have to first bring up the icons and then select one to pass to. Using the stick or just aiming and passing the normal way will often get you to throw to someone you didn't intend to give the ball to. This happens most when you have a man deeper inside the arc than another player. You try to pass to the man in deep, but instead the game gives it to the man closer to you. Something better has to come along because it's not easy to do give and goes. This is another thing that hurts offensive game flow, because it's harder to pass quickly, meaning you're more likely to play a one-man break-em-down type game. And that works in arcade-type games, but it isn't going to work forever in a sim.   ESPN, the worldwide leader in sports  Added this year is the new presentation style seen in NFL 2K3. Sega bought the ESPN license and has used it well. The friendlier menus are just the beginning as you get some really cool post-game stuff. Actually, in-game you get half-time break downs and a player named ~Hot at the Half~. And after each day of play you can see a Nightly Wrap-up that breaks down every game and chooses a hot and cold player for each day. Anyone who had reservations about Sega buying the ESPN license needs to cancel them, because it's all good here.   Game Modes  Street Mode lets you do 2-on-2 up to full 5-player squads against friends of the computer. Rather than play in the normal arenas, you get to enjoy several famous street parks, all of them accurately represented. This is the arcade-style of 2K3 and though Sega doesn't yet offer any kind of Franchise Mode for street (and they should), it's a nice break from the sim-action found in the rest of the game, and is great for picking up and taking on a friend.   Tournament lets you set up your own tournaments so you can take on friends or the CPU. It's similar to Playoff Mode, but Playoff Mode is the actually NBA playoffs.  See, if you don't want to play a season go straight to the playoffs, this is the way to go.  Only one problem here - the game actually sims the entire season first, meaning if the team your chose doesn't make the playoffs, you are crap out of luck. Ridiculous. Who would want to start a playoff mode if they weren't going to be in the playoffs? It's these little inconsistencies that continue to hold the series back.   And yes, the Franchise Mode --You'll spend most of your time here. Borrowing a lot from the excellent NFL 2K3 Franchise feature, NBA 2K3 takes career hooping to a new level of excellence. I'll tell you the main problem right now so we can concentrate on the goodness -- this is not intuitive at all. Sure, you can figure out how to pull off trades and make it through a season, but the off-season is really confusing. It's not that you can't figure out what to do, but it seems like after each step there is something missing.   For example, when you run training camp and choose for what you want each player to work on, you'd think the game would then tell you about his progress. Instead, you press start and are immediately taken to the next step without any knowledge about how training camp has gone. It all seems a bit rushed.   New this year is coaches, which are rated in three skill categories - Defense, offense, and teaching. They will be rated as poor, average, good, and master. The better they are, the more they can help improve the team in certain categories. But a coach is only useful on younger players, as older ones are more set in their ways. For this, a good teaching skill is best as he will have an easier time getting through to the youngsters and improving their game. You can fire your coach at any time during the season and hire another from a free agent pool. Exactly what I've always wanted.     You can also import your class from NCAA College Basketball 2K3, which comes out this winter. But even if you don't play the college game you can get plenty of enjoyment from the off-season options in Franchise Mode.   Before we get into that, let me give a major applause to Visual Concepts for including plenty of seasonal and post season awards. The awards include: League MVP, Rookie of the Year, Sixth Man, Defensive Player of the Year, Most Improved Player, All-NBA First Team, Second Team, and Third Team, All-Defensive Team, Playoff MVP, and Finals MVP.   The off-season, like the rest of Franchise Mode, is graphical. Rather than just using menus, you'll have the draft in an actual auditorium. You'll even watch the lottery, though it's basically just a revealing of the draft order through flipping cards with team logos on them. When scouting for the draft, you assign a number of workouts to a player, but those workouts cost money, which counts against the amount of cash in your team's till. So with smart budgeting you can scout more players and get more info.  --Very smart.   There are even foreign players in the draft and after about five or so years in the Franchise Mode, you'll see many more foreign players coming in. Everything about the scouting and draft set-up is great, but again it's not too intuitive, especially the draft day. If you didn't know to press down on the right thumb stick on the middle computer screen to get to look at your PDA, how would you ever know it's there? Answer: You wouldn't.   One problem with Franchise Mode I noticed was that the All-Star game never changed venue. You will always play in Atlanta, even ten years down the line. That's a bit sloppy for a company making such a fine game, and yet another aspect that holds this back from being something truly great. VC puts a lot into certain aspects, but then seems to ignore another areas that need some attention.   Despite some nagging issues though, the Franchise Mode is fantastic and the best of any basketball game to date.  Just get used to playing the mid-winter classic in Atlanta every year.    Online  Featuring downloadable content including updated rosters, NBA 2K3 joins NBA Live in the online basketball market. Unfortunately, the only choice so far is a straight exhibition game, with few other features to speak of. Then again, NBA 2K3 is fantastic online with few moments of slowdown and almost no latency at all.  It's hard to believe a basketball game can make it online and actually be playable, but there are times when you won't even realize you're online at all it's so smooth.   Keep in mind that we have not jumped into the real online experience, where thousands and thousands of gamers will be floating around the internet playing games on Sega's servers. There's no telling how that may affect performance (and it may not affect it at all), but so far the online performance of NBA 2K3 couldn't be better.   Graphics  Wow.  The best-looking b-ball game I've ever seen! The game is packed with great models that show off the right muscle tone and size for just about every player, and the faces are amazingly accurate and animated. You can actually see Jordan jawing as he goes for a dunk. And the new guys like Mike Dunleavy Jr. are picture perfect as well. To add extra sweetness, many players have multiple hairstyles too, and it's not just going from fro to cornrows, but it gets into the nit-picky details. Allen Iverson has multiple types of cornrows -- one straight, one crosshatched. That's attention like I've never seen.   Each stadium is accurate and individually lighted. The Oakland Arena, for example, is much darker than most and that now shows in the game. This also means that the lighting on players changes. It's subtle, but if you look you can see the difference in stadiums.  This year also includes specular highlighting. You know the fighters in Knockout Kings get sweaty and full of shine?  It's just like that! As the game goes on, players start to sweat, and that sweat now shows. You can even see sweat on some brows in the replays. Awesome.   The animations are great and plenty of new motion-captures were added for all aspects of the game. Over 200 dunks and lay-ups were added too and there are a ton of new goodies to enjoy. You won't see a lot of repetition, which makes for an enjoyable ride to the basket.   Sound  This is a case of the good, the bad, and the ugly. To start with the good, a new system was implemented to help make the play-by-play sound smoother. Basically, all the commentary was cut up into tiny fragments so that they could be pieced together more quickly and coherently. Most of the in-game commentary is accurate and happens in time with the player, rather than while another play is going on. There are occasional mishaps, but overall it's very solid.   Well, the bad is like that Michael Jackson song. Players give off tons of chatter, as does the crowd. All of the ambient sounds are well done, but most of your jabber will be coming from you.   The ugly is really ugly.  You know all that color commentary that seems to be in every version of NBA 2K? Well, it's back. There's some new flavor, but most of it is the same. And that makes the game feel old instantly. This junk has got to go, because if I have to hear these repetitive comments for another year, I'll tear all my hair out, which will really hurt.NBA 2K3 is the game to get if you want as realistic an NBA experience as possible. This is by far one of the best sports simulations out there. However, if you are looking for an experience closer to old-school b-ball games like NBA Jams, then you don't want to come here. There are other solid basketball games that offer a more arcade experience. There's nothing wrong with any of those games, but none of them manage the intelligent AI, the amazingly realistic graphics, or as real a hoops experience as NBA 2K3.Yes, there are nagging problems and I think next year the flow of gameplay needs to be addressed, but this is about as good as basketball games get. The Franchise Mode is improved and will be even better once NCAA College Basketball 2K3 is out and the senior class can be imported into the draft.If you've always been with Sega's hoop title, don't stop now, it's been fixed and made even better. If you're new and looking for a really solid sim that does basketball intelligently and realistically, this is your game. And if you want a more run-and-gun fun style, then maybe try one of the other offerings this year, because NBA 2K3 don't mess and if you're not prepared, it will aggravate you.", "date": "Oct 7, 2002"}