{"name": "Prisoner of War", "name_review": "Prisoner of War", "ref": "https://www.ign.com/articles/2002/10/08/prisoner-of-war", "text": "Please note: Prisoner of War is a cross-platform title. In the interests of saving time and avoiding needless rewrites that would essentially restate the same thing, only in a different font, a bulk of this text has been graciously provided by Aaron Boulding and his own fair and rather exhaustive review of the game for his Xbox channel. Rest assured, this decision to was made only after extensive play of the PC version and a realization that many (nearly all) of the same positives and negatives remained intact.   Naturally, where appropriate, text has been altered, removed, and PC-ified to fit this version and the personal opinions of this reviewer (little old Ivan). I've detailed some of the switches below, but for the most part, the games are comparable in nearly every single way. A forthcoming head-to-head feature will specifically detail which iteration is best and why, until then...  Hitting the Nazi prison camps of World War II for a little super stealth action was one of the more novel game ideas to come along in a while. The developers at Wide Games have brought that vision home with Prisoner of War, which should have been subtitled: As Close You'll Get to Walking the Yards of a Pleasant Stalag Luft and Colditz Castle. Even though it was originally conceived as a PC title, the game saw early console release on the PS2 and Xbox only a short month or so ago (if I cared about those systems, I'd be able to provide you with a more accurate date). Now it's finally home and retaining the minuses you were hoping would be ironed out. Still, the bad comes with the good.  Prisoner of War is the ultimate stealth game because you'll be using your mind and cunning, not guns and grenades, to succeed. But after a few successful escapes of our own with the game's main character, Captain Lewis Stone, it's clear that for all of its brilliant gameplay ideas (comprehensive camp A.I. routines), Prisoner of War perhaps demands too much patience from gamers who like a modicum of spice with their sugar.  The prison camps in POW are living environments full of suspicious guards on patrol, barbed wire fences, fellow POWs going about their business and time sensitive events. The daily routine, in order, includes morning roll call, breakfast, morning exercise, lunch, afternoon free time, dinner, evening roll call and lights out. They happen at the same time everyday and provide the structure for your activities since you'll be ditching meals and whatnot to accomplish tasks around the different prison camps. Miss a roll call however, and you'd better be prepared for some serious sneaking since it puts the entire camp on alert. The in-game clock always lets you know where you should be at that moment and what your next ~appointment~ is going to be.   The guards have vision cones and keeping track of these on your radar is imperative to your success (unrealistic but thankfully in place). As long as you're where you're supposed to be and doing what you're supposed to be doing there's no problem with the guards seeing you. If you're outside of your barracks after lights out or stand too close to the barbed wire fence surrounding the camp, they'll shoot and/or arrest you. I like the arrest then shoot combo, it reminds me of life in Russia. Bulky items like crowbars or disguises that can't be stuffed in a pocket and have to be held in plain sight will also set the guards off if they see you.   Each of the four missions in the game has several sub-missions or objectives to complete and often one leads into the other. For example, upon your arrival in Stalag Luft, you have to earn the respect of the other prisoners -- each of whom has a distinct personality and purpose in the game -- so you're given a mission to sneak into the camp's administrative building and play the national anthem over the camp loudspeakers. This objective, like many of the others, borrows from the cannon of great prison films like The Shawshank Redemption and The Great Escape. It's only after that you find out your prank was also meant as a diversion so the other POWs, lead by the camp's Escape Committee (now there's an inauguration meeting I'd like to attend), could steal some secret plans elsewhere in the prison. There are no problems with the basic set up of real time play and unlocking a story-driving cutscene.   The frustration sets in when you realize that very little is laid out for you in Prisoner of War. The developers encourage interaction with the dozen or more inmates, not to mention crooked guards, to gain valuable information about your current objective. It usually works where after completing the previous mission, you'll be given the next objective, but it's totally up to you to figure out how to go about it. The different prisoners have different dialects, angles and interacting with them can open up a menu of 2-4 phrases you can say to each of them. It takes a pretty comprehensive survey of guys to get the bits and pieces of info you need to come up with an idea of how to accomplish the task at hand. It will feel familiar to RPG fans but there's very little item collection or leveling up to make the chatter immediately worth it. Furthermore, the game more revolves around listening than talking. Sometimes it's necessary to sit for great lengths of time in a conversation.  Each prisoner has his own look with a distinctive uniform, insignia and face, but it's still extremely difficult to tell the difference between two similar characters at a glance. Since the game's clock is always ticking away, time is of the essence and it's really irritating to be talking to the wrong guy knowing time is running out. You eventually realize who the truly helpful prisoners are but knowing where and how to find them in a timely manner is an expert level skill that you probably won't develop until you're 75% through the game.   Then you have the real time gameplay itself. Those times when you actually have to start climbing fences, hiding under trucks and throwing rocks for distraction purposes can be a bit frustrating as well, because Wide Games' third person action-adventure engine has a camera that will betray you at the most inopportune times. Classic mouse look with keyboard movement, this is not. The mouse swings the camera around the character as well as acts as turning (without any verticality) and the keys move. It's odd and takes a bit to get used to, especially when indoors. Including the first-person mode as a secret option is just wrong, as is switching briefly to the first-person whenever an action is carried out (opening doors).       This is a stealth game, so knowing your immediate surroundings is imperative in a game where you're constantly forced to sneak extremely close to and just out of the vision of guards. You have controls to duck, switch to a temporary first-person view and stand flat against walls and whatnot. With the twitchy, manually adjusted camera, you'll end up with a lot of extreme close-ups of dirt, the sky, or the back of Captain Stone's head. Even though you have control, you don't want your reaction times slowed because you can't see what's going on around you. It's a case of the dreaded third-person camera done wrong.  The guards have multiple stages of alert that range from normal to suspicious to pissed off. When their vision turns red it means they know what you're up to and are actively looking to arrest you. Here's when you can unfortunately always rely on the ever cheesy ~run and hide until they forget~ method that has worked ever since Solid Snake first donned a headband. They close in pretty fast so you have to stay mobile since all they have to do to arrest you is get within a few feet. If you're really somewhere you shouldn't be, like the Kommandant house, they're just going to shoot to kill in which case you're headed for the infirmary. When you're arrested or injured you often lose valuable items, currency (contraband you can use for favors and bribes) and time. The game continues for you even when you're thrown in ~the cooler~ (solitary confinement) and the developers have provided ways for you to buy back or otherwise re-acquire any items that you've lost. However, at no point did we find it necessary to go through this whole process. It's much easier to save your game after a crucial point such as finding an important item or receiving a new mission, and simply reloading from that point when you're sent to the infirmary or the cooler. The game even gives you the option of continuing or loading your last save game from that menu. These two cheese-laden shortcuts are simply too much to resist in a game that doesn't move very fast to begin with and that can get even more bogged down when you're sitting in sick bay or in the hole. If you don't load, moving back through the process is naturally a bit dull.  It's single player only and the story of the game is very well written and presented. There's even a strong dose of humor brought to you by the various personalities of the prison camps. You've got Polish Majors, French Privates and American Sergeants all in one place and a ton of jokes waiting in the wings when you talk to them. We would've liked more prison humor, but this game wants to be taken more seriously than that.   Another roadblock for Prisoner of War are the graphics. Even with all of the sophisticated AI pushing everybody around the prison camps, this game should have looked a tad better than it does. Detail in characters and camp buildings is lacking (don't start with the UT 2003 comparison) and overall the game looks rather flat and bland, partly due to locale, partly due to limited technology under the hood.  The animation of the guards and prisoners is extremely stiff and unnatural as well. They walk, they run and some of the aim and shoot, but nobody looks very realistic. Arms and legs simulate movements but there's no sensation of mass or real physiology where all the body parts are connected. It's a bunch of disjointed polygonal assemblages scurrying about and turning in noticeable increments.  The lack of detail and textures ends up making everything look bland and all of this is emphasized during conversations between Stone and the prisoners when the camera zooms in nice and tight. Mouths move when characters talk (not at NOLF 2 levels, mind you), but at the same time most of the guards all look alike. Not sure what that's saying about the German people but, whatever.   The soundtrack and the application of music is truly outstanding.   What did you think about Prisoner of War?  POW helps set the pace for dynamic, interactive music in videogames. There are only a handful of instrumental background pieces but they're implemented and attached to events that you initiate in the game. Sneaking around at night will have a rich forbidden theme to it that will have you sitting on edge the whole time. In times when you're trying to figure out a way through a problem, the game almost seems to know it and plays, for lack of a better term, a thinking song. Very well done.   Nice sound effects like cans being knocked over or bumping into a chair will produce a startling enough sound that you'll swear the guards are going to hear it. A thumping heartbeat kicks in whenever you start doing something that you shouldn't be doing. It gets louder and faster the closer you get to being caught. When the heart stops pounding it's a great indication that the guards aren't on alert for you anymore. Drawn out, trial and error driven missions, sloppy control, twitchy camerawork, and somewhat lax artistic polish prevent Prisoner of War from ever becoming what it aspired to be. The scope was grand, but the final draft, a bit unpolished. However, in terms of pure atmosphere, originality, and novel ideas, the game is a success, taking an action/stealth driven genre and making it into more of an adventure title in much the same way Project Eden propelled the puzzler/adventure to new heights (on the PC anyway). Everything is a problem waiting to be solved, every character a potential clue or touch of immersion. It's important to look at the game from this angle and not the one propped above the ninja who's waiting to lop off an opponent's head. When taken as an adventure (a substitute for a wrongly thought dead point and click genre), Prisoner of War succeeds admirably, but not perfectly. Since its puzzles are logically driven and its conversations engaging, there is enough to warrant interest, but not enough content to maintain it. During much of the brief singleplayer, which should have been accentuated by multiplayer and skirmish additions like Soldier of Fortune II's random mission generator or even a race to see who could escape first, too much time is spent dilly dallying or, oddly enough, worrying about time. A more defined objective-based system with multiple approaches and solutions would have significantly benefited the product (above mentioned problems aside). Don't go in seeking Metal Gear: 1942 or the next step in 3D RPG. But, if you like a challenge that needs solving and you like an engaging backdrop, then go ahead and surrender to the enemy. Prisoner of War is a solid, conversational, puzzle laden adventure bound by general logic.", "date": "Oct 8, 2002"}