{"name": "Driver", "name_review": "Driver", "ref": "https://www.ign.com/articles/1999/10/09/driver-5", "text": "Those of us who spent far too much time in the warming glow of TV and the movie screen know, love and embrace the car chase.  It's the best way to catch the bad guys, the easiest path to avoiding a traffic ticket, and the chief method for getting things solved in life. Where would Gene Hackman be if he hadn't raced under the railway in French Connection? How many fans would Steve McQueen still have if he hadn't flopped over San Francisco hill and dale in Bullit? And could Meryl Streep ever have won an Oscar if it weren't for that unforgettable, 30-car smash up that climaxed Sophie's Choice?  Looking to build on the Streep tradition, Driver taps into our deep-rooted love of speed, cars, cops and polygonal damage, and the boys at Reflections have really outdone themselves. Leave it to the team that brought you the first two PlayStation Destruction Derby titles to offer the first game that accurately nails the looks, feels and sounds of being smack in the middle of a 1970s chase. With your hulking American car swaying on every turn, the cops bumping right on your tail lights, and trash cans and street signs flying, we were ready to start filming that script we've been working on for so long -- Smokey and the Bandit 5: The Wrath of Fred.  The game adopts four race-friendly cities: Miami, San Francisco, L.A., and New York, putting you in the role of an undercover cop who must  imagine this  work as a driver for the mob. Your name: Tanner, a former racecar driver turned policeman. You're hired to investigate the Castaldi mob family by working as their wheelman, but first you'll have to past their double-secret initiation.  To even be eligible for your criminal career, you must complete what seems like an incredibly difficult driving test inside a parking garage. Imagine your 16-year-old visit to the DMV, only Joe Pesci and Robert DeNiro are your instructors. In a set amount of time, you must complete various and sundry maneuvers, from a 360 and reverse 180, to a slalom around the cement pillars. Once you finish this task, you'll be asked by your new ~family~ to take on a few jobs.  The work is the meat of the mission-based game, where you'll have to do everything from tooling around as a getaway driver after a bank job, to picking someone up or dropping a ~package~ off (we're sure it's candy for the orphanage) within a set amount of time. You'll even be asked at one point to smash repeatedly into a fleeing car until it's disabled  exactly the kind of stuff they never bothered teaching you in driving school.  A small map in the corner of the screen helps you navigate your way around the well-drawn city streets, which is extremely helpful since it is easy to get lost in the maze of buildings, trees and fleeing pedestrians that all seem to run together. Despite the sometimes repeating textures, the game does offer mostly realistic representations of the cities you'll be terrorizing, even if they are somewhat shrunken Readers' Digest versions of the four metropolises.  The game's look is what will get many players hooked right from the beginning. Though the PC version of Driver is a fairly straight port from the PlayStation title released in July, graphic improvements are apparent, especially at resolutions of 800x600 and over with the details cranked. Though this requires a fairly fast computer, the effect is worth it. Smooth framerates reveal nice textures for the buildings and surroundings, translucent water in areas of Miami, and of course, lens flare. Graphic damage is done mostly through flinging hubcaps and a spew of triangular mini-polygons, which seems disconcerting and a bit unrealistic at first, but seems to fit the game's graphic style. And while the in-game graphics are well done, the cutscenes are less than stellar and not very interesting. Maybe we're just itching to get back to drivin'.  Control is very smooth, even with the keyboard, and the bouncy physics help support the game's all-around 1970s aura. Some players may find the jumps a bit too Dukes-of-Hazzard-esque and the vehicles' fishtailing turns much too Starsky and Hutch (maybe a little more Starsky than that stuffed shirt Hutch), but it adds to the fun and feel of driving in this atmosphere. After all, who wants to fly through San Francisco if you're not going to be catching air and scraping bottom?  The sound and music also help put you in the mood of a Gerald Ford presidency and Saturday Night Fever box-office run, with a decent 70s funky soundtrack (though still not as good as Interstate 76) that puts you in the mood for doing donuts in your 3-mile-per-gallon monster. In-game sounds are also excellent, and trust us when we say, we had plenty of chances to hear the crash sounds.  And while the graphics, sound and atmosphere will get you into the game, it'll be the ingenious mini-games that keep you coming back. Escape mode tests your escape-the-cops mettle, with you trying to see how fast you can lose the fuzz. Survival is one of the most enjoyable mini-games, as players try to elude the cops as long as they can  a feat that sounds much easier than it is with this game's kamikaze driving squad cars. And for the discerning car chase fanatic, Driver also offers the chance to film your own action sequence. Gamers can drop cameras anywhere they like within a track in replay mode, then edit the chase together and save it for posterity  or for the resume tape you'll be sending to Cannonball Run director Hal Needham.  For all this glowing talk, Driver isn't perfect. At times, missions seem next to impossible with civilian cars that exist just to cut you off on your way to the hideout, and police cars that apparently are controlled directly by God's dispatcher. Police roadblocks will appear from nowhere, and if you don't have the driving skills of Burt Reynolds, the perfect-driving squad cars put some missions at key-pounding frustration levels. And while your eyes will be rolling back in your head with anger at the difficulty level, they'll just be rolling at some of the less-than-stellar cutscenes. It's a shame that the clever ideas Reflections hatched for the game's narrative falls victim to amateurish intermissions with bad voice acting.  We'd also be remiss if we didn't whine about the lack of multiplayer in the game, a disheartening oversight for such an atmospheric game with realistic worlds. After a few hours of single player, we were itching to challenge co-workers and friends to online or LAN play in San Francisco. But Reflections chose not to include any multiplayer, probably to tweak the one-player game to perfection. It's a strategy that worked, for sure, but we were still left wanting more. Guess we'll just have to use our own cars on the real streets of San Francisco.  Still, we almost feel guilty for nitpicking when we enjoyed the single-player game so thoroughly. Driver is one of those thrice-a-year titles that inject surprising life and flavor into a genre that we thought was fully explored. Count Reflections among the Lewis and Clark of driving game developers  they've successfully journeyed past the tried-and-true, beyond the known, and returned with an American treasure: A 1970s car chase movie you can control. Thanks to them, your Burt Reynolds/Steve McQueen/Gene Hackman fantasies all are within the reach of your keyboard.  -- Mike Morrissey", "date": "Oct 9, 1999"}