{"name": "Evolution Skateboarding", "name_review": "Evolution Skateboarding Review", "ref": "https://www.ign.com/articles/2002/10/10/evolution-skateboarding-review", "text": "Evolution Skateboarding is not aptly named.  The title denotes a step beyond what is presently known, but the game to which it is attached is in fact at least two generations behind the competition.  Tony Hawk's Pro Skater 4 and Aggressive Inline move the genre forward in many different ways, with more flexible goals, more complex progression, and more expansive level design.  In comparison, once you strip away a couple of gimmicks, Evolution Skateboarding is something like Tony Hawk 1.5 as far as game design is concerned.  It also fails to correct some of the basic control flaws present in its predecessor, ESPN X-Games Skateboarding.  The trick control is still unresponsive, with none of the buffering features that have been present in Tony Hawk since the very beginning.  Rail detection is suspect, and simply controlling your skater's movements after an ollie is difficult at times.  The level design doesn't help matters, with short lines, confusing visual layouts that are easy to get lost in, and architecture that will frequently get you stuck in corners.  In conclusion, this is not the game you want to buy, what with Tony Hawk 4 right around the corner.  But you probably already knew that.  Gameplay Progression in Evolution Skateboarding is handled as in the earlier Tony Hawk games, with five or six goals to a level, two or so of which are specific to that level.  The rest are generic -- grind so far, score so much, link together so many tricks, and so on.  Some of the level-specific goals are clever in concept, like a pizza-delivery mission in the Tokyo level, but they still simply boil down to ~go here, here, and here within the time limit.~  The addition of ~boss~ confrontations at certain stages in the career mode feels very much like one of those ideas that only seemed like a good idea at the time.  Take, for example, a duel with an armored tank (yes, a tank).  It looks nice enough, but there's no challenge to it.  Simply grind along the same edge a certain number of times and the goal is complete.  The special tasks presented, then, are not that much fun, and Evolution's basic trick controls offer little to fall back on.  Grab and flip tricks are slow to execute, and it's difficult to buffer in subsequent trick inputs -- you have to wait for the first trick animation to play before sending in the next command.  Lateral movement is also difficult, the game preferring to keep you on a straight line in the air.  Thus, it's more difficult to transfer from rail to rail or across gaps.  Perhaps the biggest problem with Evolution Skateboarding, however, is that it could serve as a textbook on poor level design in this genre.  Its lines are short and simple, offering little opportunity for complex combos.  It has flatland tricks to theoretically extend combos, but you have to hold down the triangle button to keep a manual going, so it's hard to ollie up into another trick or grind.  Quarterpipes and kickers are placed in the middle of empty areas, giving them no purpose as part of trick combinations.  There are even lines that bonk straight into a wall, violating one of the cardinal rules of skating level design -- you never send the player into a situation where it's inevitable that their line end.  Compared to the improvements found in the latest games from Z-Axis and Neversoft, Konami is far, far behind with this game.  This wouldn't have cut any ice three years ago, and it certainly doesn't now.    Graphics This looks a little better than ESPN X-Games, but it still suffers from the same basic problems.  Its animation is stiff and limited, with a relatively small selection of tricks.  The character models are out of proportion to their boards and the levels around them -- they occupy too much space on the screen, and dwarf the decks underneath them.  Though the framerate is consistent, everything on the screen, characters and environments alike, is heavily aliased.  The amount of texture detail varies from level to level.  Some are relatively complex and colorful, but others feature such drab, repetitive architecture that it actually affects navigation -- if one direction looks exactly the same as another, it's pretty hard to find your way around.  Philadelphia is a prime offender in this regard, particularly since it's already afflicted by nonsensical path designs.   Sound There's an interesting comment on this game's level of hipness to be found when listening to the running announcer commentary.  Hop into a rail and press the triangle button in conjunction with down on the D-pad.  You should hear the announcer praise you for performing a ~Five-Zero Grind!~  Aside from the fact that he exposes exactly how much the developers really know about skateboarding, the announcer should have been canned simply because he's a pain in the neck to listen to.  He does not ever have anything interesting or useful to say -- he merely repeats the names of the tricks you perform, with a little generic color commentary in between.  Was he included for the benefit of players who can't read, perhaps?  The soundtrack, meanwhile, consists of a uniformly bland mix of rock and hip-hop beats, none of which stand out to any significant degree.  Considering that I'll be able to skate to Iron Maiden once Tony Hawk ships in a week, this doesn't amount to much of a selling point.Evolution Skateboarding has none of those.  It is well behind the curve of the skating genre, and Konami would be wise to can the series entirely and direct these development resources in a more profitable direction.  In particular, whoever designed this game's interface should be put to work on a more talented team -- like the ESPN games past, the menu design and creation systems are excellent.  The sticker editor is a peach of an idea, although it fails in practice on account of you can never get a good look at the underside of your deck.In conclusion, wait for Tony Hawk.  I wish I didn't have to write another review that ends this way, but as long as Konami continues making skateboarding games, it may remain an unavoidable necessity.", "date": "Oct 10, 2002"}