{"name": "Syberia", "name_review": "Syberia Review", "ref": "https://www.ign.com/articles/2002/10/10/syberia-review-2", "text": "comes to us from the new division of publisher Dreamcatcher Games, the Adventure Company.  They partnered with developer Microids for this latest pure adventure game to hit the market.  Adventure games are few and far between.  Good adventure games are even rarer.  Unfortunately, Syberia doesn't fall into this category.  The story, written by graphic novelist Benoit Sokol, lacks that certain something that makes you fall in love with the characters.  The game is extremely boring and the puzzles never become challenging or interesting at any point.  The main character can also get annoying as you learn about her personal life.  Even with stunning graphics and a good soundtrack, Syberia falls far short of the high caliber adventure games of old, or even fairly good recent titles like Beyond Atlantis II.   You are cast as Kate Walker, an American lawyer who travels to Europe to finalize the contract signing for the purchase of a luxury toy and automaton company.  Universal Toy Company has hired her firm to handle the legal issues associated with the takeover.  It does not go as smoothly as it should.  The day Kate Walker arrives in Valadilene, in the French Alps, she finds that Anna Voralberg, the owner of the automaton company, is being buried.  To further complicate things, a previously assumed dead heir is now revealed to be alive and possibly living in Siberia.  So, as Kate Walker, you must track down this heir, Hans Voralberg, in order to complete the deal.     Hans had an accident when he was a young that left him like a child.  He left Valadilene to discover more about Mammoths, his obsession, which greatly angered his father.  His father staged a funeral for him, so everyone but his sister thinks he is dead.  Through the years, Anna has kept in contact with Hans, and before her death, she revealed that Hans was indeed alive and the heir to the automaton factory.   Along the way in the search for Hans, you will encounter a variety of automatons.  Hans Voralberg, though simple, is apparently a genius at creating automatons and has been sending his designs to his sister for years, as well as leaving behind various forms of automatons in the cities you will encounter.  His most impressive creation is the wind-up train and the automaton train engineer named Oscar.  Much of the game involves trying to wind the train at each stop along the way in your search for Hans and interacting with other automatons.   The most amusing and interesting thing about Syberia is the train engineer.  Oscar often insists he cannot leave the train to aid you for one reason or another, for example, the air is too dry or an engineer never leaves his train.  He also forces you to obtain tickets and proper visas before moving forward on the journey, sticking to the letter of the law.  Oscar is a breath of fresh air in a cast of dry or annoying characters, such as her best friend, who you never meet but hear over the phone and who has an important role to play in the lives of Kate, and the Director at Komkolzgrad, a man who is obsessed with a singer and has converted the entire abandoned city into a musical playground in the hopes of luring her back to the city.   Kate Walker, unlike Oscar, is not very interesting.  Through a variety of phone conversations with her best friend, boyfriend and mother, you learn about her personal life, an aspect of the game that can honestly be done without.  She comes across as weak and her relationships seem silly.  Through the game, she experiences an evolution of character that might be interesting if it wasn't so contrived.  It becomes clear that she is eventually going to shed the trappings of her life in New York with her self-absorbed boyfriend, disloyal friend and gruff boss and become something more.  How much more is yet to be seen, as the poorly done ending leaves the game hanging.  The possibility of a sequel seems obvious.   The puzzles are not challenging, though they can sometimes be obtuse as you would expect in an adventure game.  Most are logical, though.  The cosmonaut, a character you encounter in Komkolzgrad, a post-industrial waste, wants to fly a rocket booster created by Hans during his stay in the city.  No one knows how the rocket booster functions though, and Hans left Komkolzgrad before launch.  In order to progress in the game, you must launch the rocket.  First you obtain a blood sample from the cosmonaut.  When his blood sample comes back with a blood alcohol level too high, you then substitute your own blood and, voila, it is accepted and the cosmonaut is shot into space.  Also, most of the puzzles are easily solved by running your mouse across each screen to find out what can be interacted with.  Very few items in the environments can actually be used or picked up, so the few that can be used are necessary to progress the game.  You are unable to interact with anything that is not immediately necessary or has already served its function, so there is no trying to repeat the same thing over and over and getting frustrated when nothing works.   The interface is simplistic.  It is a standard point-and-click game.  Running your mouse across any given screen will reveal what can be interacted with in the game, by changing the cursor.  The cursor's shape indicates if an item can be picked up, used or another item can be used with it.  Right clicking on the mouse will bring up Kate's inventory and menu, where you can save or exit the game.  There is another type of inventory where documents are held, which can be accessed by clicking on a button on the standard inventory.  To use items, you click on them in your inventory and then click where you would like to utilize it.  To converse with a character in the game, simply click on the character when the conversation icon appears over them and then select the topic you would like to know about from your nifty notebook.   The graphics are the one thing in this game that truly does stand out.  The character animations are well done and when Kate Walker walks or runs, it's realistic.  The environments are breathtaking, although it is clear in each town that they are run-down.  This doesn't stop the different locations from being attractive.  The water ripples nicely and every town is rendered with a great amount of detail.  As far as adventure games go, this is perhaps one of the best looking on the market today.   The sound is also nicely done.  Voice acting is, for the most part, interesting.  The telephone conversations Kate has with her mother and best friend, though, could be removed and this might add value to the game.  Kate's mother has an annoying voice and the way that her best friend talks to Kate in a pleading tone for the most part is just too much.  The sound effects are appropriate to each environment, with the sound of water hitting the shore in beach scenes or Kate's feet hitting the ground when she runs.  The music supports the game and never becomes grating.  Overall, the sound enhances the visual beauty of the game.Syberia had the makings of a great game.  Spectacular graphics, somewhat decent voice acting, a nice musical score and sound effects and a plot that might have been interesting are all present in the game.  It falls far short of being a great game because of its much too simplistic puzzles, boring story, characters you dont fall in love with and a really bad ending.  Syberia is a must-buy for anyone who loves eye candy and doesnt care about an immersive story, but for hard-core adventure gamers seeking the latest in puzzling thrills, this is a pass.", "date": "Oct 10, 2002"}