{"name": "Antz Extreme Racing", "name_review": "Antz Extreme Racing", "ref": "https://www.ign.com/articles/2002/10/11/antz-extreme-racing", "text": "Remember that movie Antz? Well, neither do we. But the good folks at Empire Interactive are nonetheless bringing out an Antz game, despite the fact that the movie came out four years ago and was quickly forgotten, except for that one part when the big soldier ant got ripped apart by the evil termites and then said he couldn't feel his legs, which were no longer there. And, sadly, this game will also be quickly forgotten, unless it has the big soldier guy who gets ripped apart by termites and then can't feel his legs, which are no longer there. It has that guy, right? Wrong.   Antz Extreme Racing really isn't extreme at all; in fact, it's ridiculously mild. Though the game is intended for a younger audience, that doesn't give developers an excuse to completely bland-down the cart racing genre. Diddy Kong Racing, the famed Mario Kart, and even other cartoonish racers like Looney Tunes: Space Race and Lego Racers 2 have all shown us that a game geared toward children can still have the breadth and depth to appeal to a more adult audience. This one has no such scope. I hate bugs and I hate bugs that try and slalom.    As one of your favorite (you do have a favorite don't you?) Antz characters, you'll drive on the backs of larger bugs, run on the power of your own little feet, fly on the backs of stupider bugs, and leaf-board your way around a variety of tiny tracks, hoping to become king (or queen) of the anthill. Each character has eight unique races to contend with. How you finish determines how many points you receive. You can go back to any race you've already completed and try and get a better score. This way even if you suck eggs as well as lay them, you can still work at being the big ant on campus.    The races are boring but the controls differ somewhat depending on what type of race is chosen. Would a footrace be more interesting if it had Track & Field-style tapping? Instead you hold forward and run at a fixed speed only worrying about power-ups and jumping. Speaking of power-ups, there are about a half dozen here, ranging from shields, to the coveted ~throw you into the wall~ speed boost, to missiles. The power-ups, along with the game, are anemic.    The controls are pretty simple. You can speed up, jump and fire. That's it. The aforementioned power-ups, designed to enhance the game, are probably the weakest I've ever seen in a cart racer. Okay, so the game is for kids, but you know what, kids love Mario Kart and that game is fast, fun, and challenging. Where are the shortcuts that are actually shortcuts? Where are the cool power-ups? Where is the speed? Probably hanging out with the fun somewhere else.    And if you play with a digital device, it gets worse. Analog control is bad, but anything digital is infinitely less playable. Small taps to the left or right send the little bugger careening to the sidelines, and the slalom is especially difficult to manage, as it seems the tracks were designed in such a way to purposefully force your character away from the prongs.   Antz Extreme Racing has minimal sounds. And I mean minimal. There's some creepy, moody music that plays through the menu and some equally bizarre beats that hit each track. Add to that the sub-par graphics and some rather bad environmental textures and you have a game worthy of a big raspberry, which is oddly enough sort of like the cloud of mist that appears whenever you fly off track or hit a pool of water.Easily beaten in an hour or tour, Antz Extreme Racing offers virtually no replay value, aside from a four player split-screen mode. Don't buy it, don't download it. Fans of the movie (come on now, let's be real here) will like that it has the characters, but it's completely lacking any personality or ingenuity. Not even the neurotic New Yorker can save this one. A waste of a license that was already a waste.These ants are also tyrants. What kind of lesson are we teaching our kids when we make them play a game that has smarter bugs abusing larger ones for the sake of their own personalized sports entertainment? I don't think me riding on the back of another human down a racetrack is very funny. I'm all for enslaving other people and species, but shouldn't we wait until the teen years before we instill those values into our children?", "date": "Oct 11, 2002"}