{"name": "Motocross Maniacs 2", "name_review": "Motocross Maniacs 2", "ref": "https://www.ign.com/articles/1999/10/13/motocross-maniacs-2", "text": "Motocross Maniacs was one of the first Game Boy games out on the system nearly a decade ago. The title filled the void Nintendo was leaving when it refused to release a portable rendition of its awesome Excitebike game. Konami's offering is certainly its own type of game, but you can obviously see the parallels between Motocross Maniacs and Excitebike. And Konami's original makes a comeback this year as it rereleases the game in full-color as Motocross Maniacs 2. Features Time attack or Championship mode Ghost mode Jumps and 360 loops Link cable support for two player action Only for Game Boy Color  In all honesty, not much has changed from the original game. Other than the full color arenas, the two games are nearly identical in design. Like Excitebike, in Motocross Maniacs 2 you take control of a bike and drive across a two-dimensional, sidescrolling motocross course, leaping over jumps, cruise through exaggerated loops, and fly through the air grabbing icons that will enable you to go faster and survive falls. The idea is to go through the course and make it to the finish in the least amount of time  problem is, your fuel is limited. As you cruise through the course, you have to grab fuel and nitro icons that will let you beat the clock and come in ahead of the pack.  Unlike Excitebike, you never see your opponents, nor do you ever interact with them. The track is completely two dimensional  you're stuck on a plane. That's okay, since you don't have anything to avoid (in Excitebike, you had traffic to deal with).  As you coast through the air with the greatest of ease, you can perform flips that, if done in the appropriate place, will net you hidden power-ups. One is the mini-racer. It literally took me all day to figure out what these little bikers do  and the manual tells you nothing about what they do. Here's what they do: when you grab abilities such as better shocks or a jet pack (which gives you the ability to fly when combined with a nitro boost), you'll lose the special ability if you crash. When you have a mini-rider following you, you'll lose the mini-rider  not any special abilities  when you crash. It's the game's version of extra lives, so to speak.  The link-up version is a near waste of effort, since you can only watch him win or lose  you can't interact with him in any way. Would be nice if you could screw him up somehow, but that's just not the way the game has been designed.  However, where the two player lacks, the other mode rocks: course design. This powerful utility lets you create your own course from scratch, using the existing tiles in the game, from little hills to full-on loops. The only downside here is the interface just stinks  it's almost a chore making a course since you have to cycle through all the pieces just to find the one you're looking for. But once you create your course, you can save it right to the cartridge for future play.  The game feels a bit like Excitebike, looks a hell of a lot like Excitebike  but you know what? I want Excitebike. I think it's time Nintendo got a development team on converting the original NES game to the Game Boy Color. But in the interim, Motocross Maniacs 2 is a great game that starts out a little on the boring side, but gets much better with the more complex courses. It's no Excitebike...but it's close.", "date": "Oct 13, 1999"}