{"name": "Barbie: Gotta Have Games", "name_review": "Barbie Groovy Games", "ref": "https://www.ign.com/articles/2002/10/11/barbie-groovy-games", "text": "I'd like to begin by saying that I am not a girl. Also, I would not say that I understand girls, at any point of their existence, at any single moment of my life so far, and I don't expect this to change in the future. However, if I was a girl, I believe I'd be pretty ticked off if the only videogame grandma ever gave me year in and year out was some Game Boy version of Tic-Tac-Toe, simply because that's the only game made for especially for girls on the shelves. Even if the game did have lot of pink in it, or had a famous figure on the box cover, or sold a lot of copies and had a sticker on it saying that it's a best-seller, I think I'd be a mad little girl whether I liked Tic-Tac-Toe or not.  After well over 20 years of designing games, after a terrific upsurge in the number of female videogamers, after a period of significant maturing in the art form of game making ... after all of this, videogame makers still seem to believe that girls are very, very stupid and very, very simple. Sure, female gamers are welcome to (and increasingly do) play any game on the market, but when it comes to the games that are made specifically for females, the games that may be a girl's first videogame, nobody even tries to make good games. It's like every development team who gets one of these girl's games projects on their contracts say in their first development meeting, ~Dude, I don't know ... do you think chicks like Tic-Tac-Toe?~   No, Steve. They wouldn't like that.  Features  A whole collection of mini-games based on other games Only for Game Boy Advance   And so, yet again, girls get another Game Boy version of Tic-Tac-Toe with a lot of pink in it (as well as a few other cheesy stand-bys) with Barbie Groovy Games. The box cover exclaims that a total of ~9 great games!~ are playable in this latest quickly-packaged girl's game. We'll grant them maybe a third of them as pretty good (and that's being very generous), but even at that, there's not much value or fun here.  Here's a run-down of the games in the package...  --DJ Booth: A game of skill and memory where players must find as many matching CDs as possible! --Four Scoops: Challenge another player or the computer to connect four scoops of ice cream in a row! --Bubble Machine: Girls will have to bust a move if they want to pop all the bubbles on the screen! --Conga Line: Barbie and all her gal pals snake their groovin' bodies all over the dance floor! --Daisy Derby: Challenge your word skills as well as your equestrian adoration when you try to hang, man, on a racing game board! --Groove & Move: My friend Simon says this one is his favorite mode because he gets to see Barbie dance! --Checkers: If you don't know how to this game is played, just look across to your opponent's side of the beach-side game board and check hers! --Tic-Tac-Toe: See if you enjoy this game of Tic-Tac-Toe! --Gems & Jewels: We have no idea what this game is, much less have any witty double entendre for it! It's some wacky puzzle with gems!  Go ahead and pick out your faves from that list. Hopefully, it's not a very long list -- all of these games are fun, simple diversions, but they'd hardly occupy more than 2 minutes of any sensible person's time played alone, and possibly just a bit longer if they had a friend interested in playing the game with them via pass-the-system multiplayer (sorry gals, no Link Play.) Except for the Bust a Move clone (or is it Snood?) and the game of Snake (some may know it better as Nibbles -- it's the game where you lead a growing snake along until it gets too big), none of them have ever-lasting challenge that you'd keep playing for a long time -- beat the computer once and you've had all the fun to be had.   ~But this game is for girls. Girls like simple games, don't they?~ Maybe very young girls, but even then, these are pretty basic, and there's not a lot here to do once they get bored of those. There's no main game or adventure to play, no battery to save their scores, (and no scoring system to keep track of win/loss records in multiplayer mode ... I guess girls don't get competitive with each other until they've grown out of liking Barbie?) and too few games overall to be much fun. There's also not a lot of personality to the game modes and simple menu screens -- I thought it was cute when all the girls fell down one by one in the Conga Line, but then the game-over screens are all the same instead of showing Barbie in different poses (they're her Groovy Games, why is she hardly in any of them?) Even the gameplay feels like this project was a quicky  -- not that it matters, since the games are too simple to be ruined, but the way that the ~Your Turn~ screen in-between rounds of play stays up too long and can't be skipped makes it seem that the designers didn't play their own game much. You go, girl -- go play a game that's worth your time and that you'll really enjoy.", "date": "Oct 11, 2002"}