{"name": "Jeopardy!", "name_review": "Jeopardy!", "ref": "https://www.ign.com/articles/1998/02/26/jeopardy-7", "text": "Jeopardy marks the second game released for Nintendo 64 by developer Gametek, the first being Wheel of Fortune. Both titles have been designed to mimic the popular television gameshows of the same names as closely as possible, but whereas Wheel of Fortune nearly accomplishes the task, Jeopardy only manages to leave a dry, stale taste in the mouths of gamers.  Reviewing a game of this type is difficult because the same set of rules and standards don't necessarily apply to it. The big questions here are: what does the game set out to do? The game sets out to recreate the best, most realistic version of Jeopardy possible utilizing Nintendo 64's power. Does it accomplish what it sets out to do and, is it enough? Now here's the kicker; the game does deliver the Jeopardy ~experience,~ but it has no extras, no details and no life. It doesn't capitalize on Nintendo 64's hardware and really, there is nothing about it that couldn't have been equaled or bettered by less powerful game consoles. Watching the television show is more interactive and more satisfying, yet Nintendo 64 owners are expected to shell out $60 for the game? We don't think so.  The facts  Jeopardy offers players more than 4,000 answer/question puzzles Short, digitized video clips of Alex Trebek Digitized Jeopardy theme music Loads of gameplay options and settings Three-player support Five playable in-game characters   Gameplay After selecting a character players have the option of configuring their computer opponent's skill setting, question difficulty level and the way responses are handled. The only alternative left is to play the game.  Upon beginning a round of Jeopardy players are greeted with an FMV opening by Alex Trebek, the game's host. Of course, because the cartridge format limits storage space, the data-consuming sequence is just as it was in Wheel of Fortune: a small square in the upper left-hand corner of the screen. The whole thing lasts only a few seconds, but it does adequately kick off the opening of a new game.  Immediately afterwards players are supplied with five categories, each with five unique puzzle-answers. The object of the game, just like the gameshow on television, is to supply the question to the answers. For example, if the answer was: ~This actor/director flopped out with a movie based on a mail-carrier in the future.~ the correct question would be: ~Kevin Costner~. Puzzles fall under a countless amount of subjects; looking at the television right now, here are just a few: Business and industrial animals, Astronomy and Space, Middle Ages, World Cities, December 3, Gems and Jewelry. Gametek has compiled questions taken from the actual gameshow for a grand total of more than 4,000 puzzles in all.  Once a player has chosen a category and selected a puzzle there is a lockout period of ten seconds. This is so that players have time to read the question and prepare to buzz in. When playing against a computer player, buzzing isn't usually a problem. But playing against friends is a different story because it's very easy to simply mash the button continuously and win the buzzer. Unfortunately, there is no way to really get around this, except for luck.   Gametek has developed an intuitive puzzle answering system which works efficiently at times and not so good other times. In past games of Jeopardy, players were forced to enter the entire answer to a question in its exact form. Entering ~Arnold Schwarzenegger~, a long name to input in itself, could easily be marked wrong because of a misspelling. Challenging? Sure. Annoying? Definitely. Gametek's system is made more convenient because it recognizes similar spellings and accepts them.  Not only that, but players can enable an option that helps to keep the game moving at a faster pace. Instead of entering the entire word players can input a couple of letters and press the R button. This brings up the possible answer in its entirety, where upon players can simply select it and move on. For example, instead of inputting the whole word ~California~ players could enter ~Cal~, hit the R button and the computer would fill in the rest of the word. On the other hand, this helps to make the game easier because players can guess at a possible answer and then hit the R button to see if the word shows up.  So players go through the first round answering puzzles, along with two Daily Doubles, and progress to the next. Alex Trebek occasionally jumps in with a quick FMV if a player guesses incorrectly at a puzzle (~Gosh, that's wrong~) and there is even the final round. It's just what Nintendo 64 owners are expecting from Jeopardy, right? Not quite...  Graphics The idea here is to take advantage of Nintendo 64's power and create the most realistic Jeopardy experience on a home console. Unfortunately, Gametek had other plans in mind. Instead of animated characters that react to correct or incorrect answers, the game offers cardboard cut-outs of smiling, dithered people. They never animate or even blink -- they just stare into space. In fact, nothing moves in this game except for the FMV of Alex Trebek and the Daily Double opening.   OK, so we're playing a frozen game, but how does it look? Well, if bland colors, dithered backgrounds and horrible textures are your thing then it looks great. Otherwise, we recommend a blindfold. Why wasn't this game in hi-res mode? Acclaim managed a beautiful hi-res mode for NFL Quarterback Club, a game that requires much more processing power than Jeopardy. Everything looks smeared, right down to the puzzle categories, which have been intentionally blurred out. The Nintendo 64 is capable of so much more.  Sound Evidently full stereo-sound is also beyond Gametek's capabilities because Jeopardy is in mono. But that really won't matter because the only music in the game is its digitized opening theme music and the similar Final Jeopardy version. You won't hear the crowd cheering, players, or any other sound that adds mood.  Jeopardy for Nintendo 64 does deliver the core of Jeopardy, which is puzzle based questions and answers. But, Nintendo 64 owners should expect something extra, something that shows what the hardware can do or at least attempts to, and Gametek hasn't even tried with this game. If you don't care about anything but supplying the answers to puzzles (which do get repetitive after a few games) then you may enjoy this title, but if you're looking for a true next-generation Jeopardy game then keep looking because this isn't it.", "date": "Feb 26, 1998"}