{"name": "Ty the Tasmanian Tiger", "name_review": "Ty the Tasmanian Tiger Review", "ref": "https://www.ign.com/articles/2002/10/16/ty-the-tasmanian-tiger-review", "text": "You are Ty, one of the last Tasmanian Tigers.  You find out your family is trapped in the Dreamtime Realm, and the only way to rescue them is to find the magic Talismans.  The bad news is that Boss Cass is also after the Talismans and will stop at nothing to prevent you from getting them. Original, heh?  Beats cleaning up a dirty island though...   Published by EA and developed by Krome Studios, Ty the Tasmanian Tiger looks to fill in the void of 3D platformers for Xbox.  Does the game deliver, or end up being just another generic 3D platforming game?  Um, do you like Mario?   Gameplay  Ty the Tasmanian Tiger is a 3D adventure-platformer that borrows heavily from the Mario series.  You start in Rainbow Cliffs, the main hub world from which you can access other levels. You can't go everywhere at once, and there is a general path to take, but to complete the levels you must come back later after you have acquired more skills.     There are four portals that are broken down into 3 levels (the fourth has only 2), not including a boss battle.  The portals are Bli Bli Station, Pippy Beach, Lake Burril, and Gate Zone.  The first three portals levels are composed of a variation of rainforest, fire, snow, and beach themes, but things do change a bit later on.  Every level has eight goals to complete, though three of the goals are always the same.  You always have to collect 300 opals, find and rescue five Bilbies, and complete a timed race of some sort.  Completing these goals will result in a Thunder Egg, which is used to help recover the Talismans, as well as give you new boomerangs.     The other five level goals vary, and require you to figure out what it is you must accomplish, much like in Mario Sunshine.  The name of the mission gives you a hint about what you're supposed to do and the map screen will show you a question mark where uncompleted goals are.  Figuring out what to do at which location is usually self-explanatory, though some of the some are a little more cryptic.  Also, almost every level has some type of objective that involves finding eight objects, whether it be lost children buried under the snow, or lighting eight pilot lights for a heater.  These missions in particular can be a little frustrating since you the levels are quite large and finding what you want can be chore, but the objects tend to stay in a certain area of the level.     Along with eight Thunder Eggs, there are also golden cogs placed throughout the level that, after collecting fifteen of them, you can use to get new boomerangs.  There are twelve boomerangs in all, ranging from the Aquarang (for underwater use) to the Doomarang, which you can guide using remote control.  The rangs are used not only as your primary weapon, but also for destroying barriers, creating platforms, and even charging up machinery.  There is a generous auto-aim implemented, so you never really have a problem hitting enemies.     Besides the rangs, Ty can also take a large bite out of an enemy, and some enemies require this method of attack.  Biting can also be used for destroying crates, working your way up certain ledges, and also as a jump attack much like Mario's butt stomp which also doubles as diving.  Other than that, Ty has your standard set of platforming moves like jumping, ledge hanging, gliding, and swimming.     If you've played any other 3D platformer, you'll be right at home controlling Ty.  Everything feels quick and responsive, and you never have to think about what you're doing.  The game is possibly a little too responsive at times though.  You move so quickly the camera spins and turns at speeds that will make any sober person dizzy.  You do grow accustomed to it, but sometimes you have to slow down and reorient yourself.  Also, the camera has trouble keeping up with your turns, so get used to swinging the camera as you move.  If you had no problems with the camera in Mario Sunshine, then you should have no problems here.   One of the irritating things about the game is that every time you start your game and begin a level, the game insists on showing you the same cutscene and voiceover.  Another point of irritation is that some goals require you to complete a different objective prior to it every time you attempt it.  Let me give you an example.  One level has you lighting the path for a character so he can get home.  After doing this, he asks you to light some fires for him.  If you leave the level, you have to light his way home again in order to have him ask you to light the fires.  Not good.   A feature I would've liked to have seen in the game is an onscreen map.  The levels are quite large and finding your way to specific locations would be much less time consuming if you could see where you were going.  You can view a map by pressing start, but constantly having to switch back and forth between the map screen get old fast.  Also, due to the size of the levels, there are many checkpoints strewn throughout the level.  These checkpoints are not flags, or signs, or any other checkpoint staple we've seen in other games.  They are in fact outhouses that magically appear at predetermined spots.  When you die and respawn at the checkpoint, you hear Ty let out a sigh of relief and hop out of the toilet.  Is this some strange Australian custom I haven't heard about?     Ty the Tasmanian Tiger has lots to like about it.  There are some really clever puzzles, and the levels have a good variety to them.  Rarely does the game seem old.  The short game time is probably a contributing factor.  Most skilled gamers can finish this game in 10-15 hours, while younger gamers may actually have some difficulty finishing it, especially with the boss battles, and also figuring out what to do.  The game is definitely more challenging than it seems.    Graphics  Ty the Tasmanian Tiger is a great looking game.  Bright, colorful graphics are abound with lots of little details that you may not notice at first.  It wasn't until several hours in the game that I noticed Ty's real-time reflection in the water.  Or how you only see his toe prints in the ground when Ty tiptoes, yet you see his whole paw print when he's walking.  Other notable moments include the great ice distortion and the underwater movement when standing still.   But it seems for every little detail that was put it, one was left out.  For example, when Ty is holding his flaming Flamerangs, the soft glow created on Ty looks great.  The problem is that only Ty, and not the environment or other characters, is dynamically lit by the flames.  This creates an odd lighting effect that is immediately noticeable.  The same goes for the real-time water reflections.  You see Ty, but that's all you see.    Speaking of Ty, he is the character I found least appealing.  I know he looks just like Penny's dog from Inspector Gadget, but he doesn't cry out mascot.  All the character designs have a similar feeling.  Cute and cuddly, but to an extent, generic.  Having a real standout character design could've helped this game stand out a bit more, but in the end, it's just average.        While some of the character models have low poly counts, and the textures can be blurry at times, it doesn't detract from the overall visual experience.  The game is going for a particular look and succeeds.  That's not to say it couldn't look better (it could), just that it serves it purpose and does it well.  This is definitely one of those games where the sum of the graphics is greater than the details.         Sound  Ty is a great aural experience.  The background music is full of catchy bass lines and pleasant tunes.  The game also supports 5.1 Dolby Digital, but don't expect a life-changing surround experience.  While the music is great, the sound effects are rather plain.  Spatial positioning is also relatively accurate, but it lacks the oomph of other game soundtracks, like say Lord of the Rings.   The voices in the game are a nice highlight in the game.  A definite cut above most games.  That may have to do with the humorous nature of the game, as dramatic voice acting can prove more difficult, but who cares.  It sounds great.  Most of the characters speak a strong, friendly Australian accent that reminds me of ol' Steve Irwin.  Whether that's a blessing or a curse is up to you, but I sorta like the chap.  There's also more Australian lingo in the game than you can shake a brown-eyed mullet at!  Ty the Tasmanian Tiger makes no effort in hiding its influences.  This is a Mario clone through and through, just done really well.  There's item collecting, a hub world connecting several elemental mini-worlds, and lots of characters full of..er..character.  For those owning only an Xbox and wanting a Mario-style adventure, this is as good as it gets.  For now.  While not quite Rare quality, one or two sequels later (c'mon, you KNOW there's going to be one), Krome Studios may just have a hit on their hands.  Its just too bad Microsoft now owns Rare...", "date": "Oct 16, 2002"}