{"name": "The Lord of the Rings: The Fellowship of the Ring", "name_review": "The Lord of the Rings: Fellowship of the Ring", "ref": "https://www.ign.com/articles/2002/10/17/the-lord-of-the-rings-fellowship-of-the-ring", "text": "Ages after J.R.R. Tolkien's Lord of the Rings books became legendary, few media re-creations have captured the temper, flair or chivalry of the writer's works with the right combination of passion, dedication or vision. Director Peter Jackson and his team, however, accomplished such a feat, and with their success, Tolkien, whose works originally grew to massive heights in the 1960s, have resurfaced like few literary works have in the past. Re-publishing books, creating enormous DVDs, and making videogames are all natural extensions of today's Tolkien enterprise. PresentationReleased from Universal Interactive's Black Label Games, Lord of the Rings: The Fellowship of the Ring is based on the written works of J.R.R. Tolkien, and with this rich literary resource, the publisher, on the back of developer Surreal Software, has created a unique action-adventure game in the style of The Legend of Zelda: Ocarina of Time. Strong in some areas and weak in others, LOTR: The Fellowship of the Ring should satisfy most of your strong Tolkien needs. It authentically presents various chapters of the book that were edited from the movie (or that never made it in) such as the Ancient Forest and the Barrow Downs, and it includes particularly memorable hobbits, characters such as Tom Bombadil, and other secondary but likeable characters. It also spends a good amount of time thoroughly covering major parts of the chapters, without feeling rushed or overly edited. Though it shares basic fundamental development design with the Xbox version of the same name, the PS2 version looks entirely different and in many ways is a better game. Non-player characters assist in combat, they take part in various events in the game, and at various times, players will have one follow or lead him through a level. The puzzles are different, though it appears the first two or so levels are almost exactly alike, and players take on the roles of the same group of characters.Unlike the Electronic Arts game based on the movie, LOTR: The Fellowship of the Ring delivers a mixed bag of visuals and audio aspects, ranging all over the board. Everything is based on Surreal's imaginary manifestations of the characters, environments and monsters from the book. The voice acting careens from excellent to humorous and embarrassing, while the graphics stutter from decent to technically weak to occasionally pretty and surprising. But I'll explain more on these areas later on. Other things just whittle away at the game's generally likeable appeal, such as the outdated, manual save/load function, the lack of menu options or gameplay rewards, and the strangely less than powerful Surreal PS2 engine, which looks weaker than when it debuted in Drakan: The Ancients' Gates. Needles to say, the game's presentation is not its strength.GameplayOther strengths, however, continue to buoy the game again and again. And what, pray tell, are its best assets? Frankly, that you get to play Gandalf is excellent, the inclusion of chapters from the book skipped over in the movie, and the general variety of missions, spread out over the large landscapes work to its favor. That, and the moderate amount of adventure elements help to create a sense of exploration and wonder, which goes a long way in a Tolkien-based game.The game begins in the Shire with a conversation between Gandalf and Frodo, setting up the importance of the ring and Frodo's relationship with it, and quickly afterward it sets the table for players to take on the furry feet of Frodo Baggins, Bilbo's young nephew. Throughout the game players also take on the roles of Frodo Baggins, the hobbit, Strider (Aragorn), the warrior, and Gandalf the Grey, the wizard; the game automatically decides which character you play, the choice dependent on the style of mission, be it sword swinging, ring bearing or spell casting. For instance, the game starts out with gamers playing as Frodo, as he takes care of Bag End and then escapes from the Shire. You continue to play as Frodo until the Bree levels, switching to Aragorn, and then switching back and forth between Frodo and Aragorn. Later on, after the party arrives at Rivendell, players take on the role of Gandalf the wizard. After that, the game switches between all three. Characters don't level up, but rather they find food for health (the Elven food Hemas, Cram, and Frodo also eats mushrooms), while Gandalf uses Elven Lembas and Miruvor for increasing health and magic powers, respectively.Each character offers different abilities. Frodo is weaker than the others and can't use magic of course, but he can throw rocks, smack enemies with a walking stick and use the ring to disappear. Using the ring is interesting, because it will kill Frodo if used for too long. As he builds up experience and ~purity~ (or something like that) points by fighting and meeting objectives, he can wear it for longer periods of time. A meter on the upper-right hand side of the screen indicates Frodo's danger level, too. This aspect of the game isn't as upfront or as played out as it could be, and  they're seems to never be enough time to build it up enough to make excellent use of, which is a disappointment.Aragorn, however, requires no such ring to fight. He's already well experienced in the ways of combat, tracking and diplomacy. With the ability to wield the re-forged sword Anduril and an infinite amount of arrows in his quiver, Aragorn is well equipped to fight. Aragorn has a few attacks, some combos and he can block, but none of the fighting is all that exciting, which is a complaint I have about all of the characters -- the combat system is so basic and repetitive that it takes a lot of fun out of fighting.     The archery aspect is interesting, at best. Instantly shifting to a first-person perspective, players aim and shoot arrows. The mechanic is smooth, but  they're is so little aid, style or presentation to the deed that it's relatively useless for most of the battles. It's difficult to track or to sense the arch and length of the arrow's flight, especially after playing games such as The Mark of Kri, which has an excellent archery mechanic. Both the fighting and archery systems are exactly like those in Drakan: The Ancients' Gates, only they haven't been improved or altered a bit, and since this is an action-heavy title, a more honed or at least a modified system would have been appreciated.In my humble opinion, fighting as Gandalf is the most fun, since he can attack in hand-to-hand combat and cast spells. Gandalf attacks with various magic spells, including Fiery Blast (fireball), Staff Strike (a ring-like that affects many enemies simultaneously), Heal (to heal himself), Lighting (lightning), and Attract (which briefly causes enemies to attack one another); and each costs some form of mana, be it large or small. Gandalf wields Glamdring with good effect, and later in the game, when he fights the Balrog, he must fight in close to weaken it. Set up as a linear 3D action-adventure game with a smidgeon of RPG elements, LOTR: The Fellowship of the Ring offers games a handful of various missions. The early Frodo missions are closest to Drakan, with lots of primary objectives and a growing list of optional secondaries. Later on the Ancient Forest, Frodo loses his hobbit buddies and must find them (a mission that repeats itself a few more times), though the extra touch of moving backgrounds and shifting trails is quite eye opening. Frodo also does a good amount of collecting, including find lilies for Tom Bombadil, who happily appears in a few missions. While the Strider missions are usually straightforward beat-em-ups, he performs his own collection level in Bree, finding objects that look like hobbits for the Ring Wraiths. The Gandalf levels are also a mixture of fighting and traveling, and each character gets the chance to confront bosses.The missions are the stuff of status quo adventure titles; they're occasionally interesting but often repetitive. With few exceptions, you have played many missions like these, only this time you're playing as Tolkien characters -- which, to be honest, makes the biggest difference in my opinion. If this were some generic adventure game, like Super Elf 4, I wouldn't be half as interested. Instead, I'm excited by seeing how the game plays out the story, which enemies I see and what part of the story is included or isn't. Technically, the game serves up some bad problems, from pop-in textures to awkward collision detection (as in the fighting with Strider against the final dragon boss) and sloppy character control (like walking as Frodo in the Mines of Moria). The few physical puzzles, mostly found in the mines of Moria, are easy; in fact, they easier than the Xbox version -- enjoyable, but not terribly challenging.As for the enemy monsters, while the spec sheet says  they're are 28 monsters, I don't remember seeing half that many. Off the top of my head the list includes Ring Wraiths (on horseback and on foot), warrior and archer Orcs, spiders, warrior and archer Goblins, Ancient trees, Barrow Down spirits, Trolls (sometimes two at a time), Wargs, evil humans, the Balrog, a flying Ring Wraith, and more. Surely,  they're are more (I think), but those are pretty much the ones you'll see repeatedly.   GraphicsSurreal's 3D engine is capable of creating huge environments and a good amount of detailed landscapes -- but only up close. What's lucky or nice or coincidental or something about Surreal's 3D engine is that the fogging effects -- that hide undrawable distances -- work perfectly in LOTR: The Fellowship of the Ring, since the land is supposed to be misty and magical anyway. In other words, it works by default, but it works. Two perfect examples of Surreal's engine working at its best are the Ancient Forest and the Mines of Moria levels. With an enclosed forest canopy above, the engine is capable of drawing all sorts of organic shapes with great detail. Patches of wild flowers are beautiful to the eye, and well-textured trees, rivers, and forests are also pretty. The water animations are the exact opposite, with a single level of animated textures moving across the top, and looking simplistic and unbelievable. Still, facing Old Man Willow, the boss, for the first time is excellent fun, both in gameplay and in graphics. The moving branches, chomping tree mouth (with hobbits inside), and the team's general attention to the details of organic design quickly catch one's attention. The character models and textures, however, fail to capture the imagination. The problem is two-fold. With the release of the movie of the same name, the look of these characters, Aragorn, Frodo, Gandalf and others, has been indelibly forged in most people's minds. They're dirty, grim looking, filled with sincere emotion, and most of all, human. We know that they can look simultaneously cool and serious, without any of the, excuse the phrase, but fairy-like look of Tolkien characters past. I mean, with the exception of the Peter Jackson movie characters, Tolkien characters to date have looked like unimposing Keebler characters -- the very last kind of characters you'd want in a stealthy group of warriors. These characters fall into the old Tolkien trap, manifesting into stiff, inhuman cardboard cutouts. Aragorn and Legolas are so feebly re-created, so femininely modeled, so uncool it hurts. Frodo and his buddies look like walking footballs, perfect for kicking across the field, with generic faces and plain expressions. Galadriel, Elron and numerous other character models just don't pass muster. It's not that the character models are horrible, it's just that they?re so ordinary, so old school in design, so mundane that they hurt. The only one who holds his own is Gimli: His facial model is excellent, his textures are likeable, and his hunkering, overly burly shoulders cast him perfectly, or at least how I would imagine him best. The monsters, on the other hand, fare far better. The trolls, Wargs, Old Man Willow, the excellent looking Balrog, and the flying Nazgul are far more imaginatively modeled and textured. The final boss, a flying Nazgul looks like he's flying a dragon -- very much like Arokh from Drakan. Technically, the game does a better than average job of lighting, it shows off a better than average set of particles -- particularly with Gandalf's magic effects, and especially in the fight against the Balrog -- and does a good enough job most of the time to keep the criticisms under control. I mean, this game is not great looking, and certainly doesn't look any better than Drakan, but it's far from being the worst game I have seen.SoundSurreal did an excellent job of creating an e they'real and dramatic set of songs to capture the mood of Middle-earth well. The levels are filled with songs that capture that particular area's sound, even if it leans toward some rather homely songs in the Shire. The music is substantial and likeable for the most part.The sound effects are great. Spell casting, roaring monsters, howling Wargs -- they all sound very much like I would have imagined them.But just like most of the character models, 90% of the voice acting is poorly done. The characters are either overly heroic or just plain goofy. And unlike in Drakan, where it seemed that Surreal was trying to be ironic or geeky on purpose, here it's unclear, since the Tolkien's book is generally pretty serious. And just like the character models, the only character who escapes unscathed in Gimli. I don't know why he had all the luck, but it's clear somebody liked the dwarf -- A LOT.Lord of the Rings: The Fellowship of the Ring is a better than average 3D action-adventure game, backed up by one of the greatest licenses of all time. I like this game despite its many flaws and annoyances, its often outdated technologies, graphics, laughable character models and voice acting. Why did I put up with this stuff? Because I have read the books a few times, I love the story, and I desperately wanted to re-create the feelings of fear, excitement and joy I discovered in them. This game brings back those feelings better than the average game with some great moments and some incredibly weak ones, too. It's a truly mixed bag. What this game has that the EA game doesn't have -- chapters, characters and events from the book -- is important to a Tolkien fan, and it warrants playtime -- whether you rent it or buy it. The levels with Tom Bombadil in the first, the Barrow Downs, and the various areas that EA's game misses are great. I highly recommend this game for true, dedicated fans, and I hesitantly recommend it for other folks. It's hard to imagine this game without the license, and it might be unfair to do so, but without this license, this game is very, very average.", "date": "Oct 17, 2002"}