{"name": "Colin McRae Rally 2.0", "name_review": "Colin McRae Rally 2.0", "ref": "https://www.ign.com/articles/2002/10/23/colin-mcrae-rally-20", "text": "The Game Boy Advance is definitely seeing its fair share of rally racing games this year, with versions from the big publishers like THQ, Sega, and Infogrames. Don't count out the one from Ubi Soft, though. Colin McRae Rally 2.0 may not win any awards in the Game Boy Advance beauty pageant, but where it fails to impress visually, it excels in overall playability. The game offers a racing game where the car actually ~feels~ substantial, an element that's a bit rare in the GBA racing genre. The entire racing experience is enhanced because of this, since the game focuses almost entirely on how the car reacts to all the different environments thrown at it. Colin 2.0 isn't one of those pedal-to-the-metal designs...its emphasis on physics and handling makes the game come alive with exciting and responsive action that's pretty unique to the GBA market. And that's a really good thing. Features Five licensed vehicles Six different world-based locations Rally and Arcade modes Link cable support for four players (single cartridge) Cartridge save (two slots) Only for Game Boy Advance Colin McRae 2.0 for the Game Boy Advance is a liberal, but accurate take on rally racing, putting players in control of five different licensed rally vehicles (Ford Focus, Mitsubishi Lancer, Toyota Corolla, Subaru Impreza, and Ford Puma) and challenging them to race through hundreds of miles of track in six different locations around the world. In rally racing, the driver's essentially challenged by the course, not by other racers... But there are 15 other vehicles to beat, and the task is to go through the eight different checkpoints along the way and finish the stretch of road in the shortest amount of time. It won't be easy, since each section of track has its own different terrain, and you'll need to anticipate the condition of the road before you head out there by altering the many different settings of your vehicle...you have control over elements such as tire type, steering, suspension, and brake tightness, and after a race you'll need to repair the wear and tear put on your vehicle. Players will also have to keep an ear out for informative direct: Colin 2.0 features authentic speech from an unseen copilot calling out the upcoming turns so that the driver isn't caught surprised by hairpin turns or bumps in the road that might flip the vehicle.  But Rally Racing might not be your thing, and that's where Colin 2.0's arcade mode comes into play. It's a four-car racing game on a closed-circuit track, using the same graphics and physics model of the rally mode. Here, players can just go all out and try to out-race the other opponents without the need to adjust their car's attributes. Colin 2.0 even supports single-cartridge multiplayer for this mode, which works like a champ; to get the game to fit on systems without a game in their system, this mode is limited to the same vehicle per person, and the excellent sound effects and music scale back to basic FM-synthesis pushed by the GBC chipset. But because only one copy of the game is needed to take on three of your friends, these little elements are more than forgivable.  And to say that this game is ugly is being a bit unfair. Sure, the developers of Colin 2.0 employed an engine that seems to be a bit low resolution and blocky, but to focus on that and not mention the outstanding and successful mixture of 2D and 3D elements would be pretty disrespectful. The game's terrain is constructed of the typical Mode 7 type that other racers such as Mario Kart: Super Circuit and F-Zero: Maximum Velocity...Spellbound's engine, however, allows for a lot more objects to appear on screen, and the track designers take advantage of this by lining the road with tons of sprites to create fences, cliff sides, and lines of hazardous trees. The developers also had a second feature to their Mode 7-style engine: as the cars skid across the terrain, the tires actually create marks in the surface. The skidmarks don't stay permanently, but it's a cool feature to see, especially in the arcade mode where you can watch the opponents create grooves in the track.  But what really makes this game shine is its employment of 3D, texture-mapped cars. To save on processor power, most GBA developers use sprites for their racing vehicles...they may look nicer in the long run, but sprites cannot convey the same amount of motion that 3D models can, simply because the car's animations are limited to the number of frames that have been stored on the cartridge. With Colin 2.0's 3D engine for the vehicles, the programmers not only have a lot of freedom of motion in the cars, but they can also include realistic physics. During the race, the car will slide and sway with incredible attention to the vehicle's suspension and weight...and it can even lose balance and ride up on two wheels, or worse, flip over during a particularly nasty turn. The handling of the vehicles change dramatically on the different terrain in the game...it's like driving a completely different car when it gets on smooth pavement. And watch closely: the car actually gets progressively dirtier as the race continues, depending on the condition of the tracks. It's a neat inclusion that just adds to the overall experience.  But even with the attention to detail to the gameplay and graphic engine, the developer failed in one area: interface. The menu system is absolutely the pits...it's difficult to tell where you are in the game, or where you need to be after a race, simply because the user interface was designed so sloppily. It's going to be heated competition with all the rally games out or coming out for the Game Boy Advance this year, but you honestly will not be disappointed with the gameplay in Colin McRae Rally 2.0 on the GBA. Yes, the graphics on the surface are a bit on the low-quality side, but you just have to see it in action to appreciate everything that's going on in the game. The pros (gameplay modes, physics model, single cartridge multiplayer) definitely outweight the cons (bad menu, low-res textures), and to sneer at the game because of some low-quality screenshots would be doing an injustice to both the game itself, and your potential (and inevitable) enjoyment.", "date": "Oct 23, 2002"}