{"name": "Tony Hawk 4", "name_review": "Tony Hawk's Pro Skater 4", "ref": "https://www.ign.com/articles/2002/10/23/tony-hawks-pro-skater-4-3", "text": "is easily the best game in the series, and a bigger leap over its predecessor than any of the previous games were.  Hawk 2 introduced the manual and substantially expanded level design, but Hawk 4 features a complete revision of the series' goal and progression system, a huge spike in the longevity of the single-player game, and online play for the masses on top of a host of smaller changes.  Thus, it's a little curious to see such a dip in anticipation for this sequel.    After all, the day has finally come when this franchise is not completely unchallenged in its genre.  We would have never predicted such an occurrence, say, a year ago, when it seemed like nobody could produce anything near as good as what Neversoft had done. Today, though, Tony Hawk has genuine critical competition, even if the name remains unchallenged in terms of mainstream popularity.  Perhaps we're just paranoid, though.  After all, this game has AC/DC in it, and as such the author is more or less perfectly happy.  He would be just plain perfectly happy if it were ~Thunderstruck~ instead of ~TNT~ (and perhaps even ecstatic if it were ~The Jack~), but you take what you can get.  Gameplay Tony Hawk 4, like Aggressive Inline, discards the concept of timed level runs that was previously integral to the genre.  This isn't a bad idea, since as you may have been able to tell from our reviews of games like Mat Hoffman's Pro BMX 2 and Evolution Skateboarding, the traditional two-minutes-and-out pacing of other career-mode challenges was getting a little stale.  Recognizing that players want to explore the levels as much as they want to clear goals, the designers of this new career mode decided to let them do both at once.  Career Mode in Hawk 4 now defaults to a free-skate mode, where you wander around and pick up goals at your leisure.  Each is tied to a particular NPC inhabitant of the level -- talking to them triggers the goal, and only then does a time limit appear.  Complete a goal if you like, wander off to find another one, or just skate around until the urge to complete a task returns.  The pace of the career mode is much more relaxed in comparison to earlier games, where there was always the pressure to finish as much as possible within the two minutes provided.  That slower pace helps stretch out what is also a much larger array of challenges.  Each of the nine levels has 16 goals, and the difficulty curve ramps up far beyond what was presented in Hawk 3.  After one or two trips through the career to learn the levels, a decent player could finish that game in a single sitting -- not so in the case of its successor.  The familiar score and combo goals are harder, and new goals incorporating racing and platforming challenges are plenty tough as well.  There aren't any new skaters outside the unlockable ranks, but clearing the single-player game will still take much, much longer than before.  And never mind how easy it is to get sidetracked in this game.  Tony Hawk 4's levels stretch farther than before along every axis -- length, breadth, and height.  The first couple of levels don't have a substantial vertical element, but once you get to Alcatraz, the lines suddenly stretch up and down the hills and sides of buildings.  It's similar to the multi-layered design in Hawk 3's Tokyo level, but larger and less confined.  That's also the same level where the game introduces its warp portals, which let you jump across to another part of the stage and continue a line in an entirely different area.  So much praise has been heaped on this series' level design in the past that one wonders whether it's even worth mentioning anymore.  The lines are many and varied, the architecture is complex, the gaps and hidden areas offer all kinds of challenges for completists.  It's Neversoft.  You know the drill, don't you?  The new goal system also does an excellent job of showing off different aspects of the level design -- different goals are designed to take advantage of specific areas and features.    There are no changes to the basic control mechanics on the level of the manual or revert, but the new spine transfer maneuver makes for a small twist in certain situations, and the repertoire of flatland tricks continues to expand.  The selection of tools required to stretch a combo forever is about as complete as it needs to be at this point, and the addition of a skitching control (a la Aggressive Inline or Jet Set Radio)makes it a little easier to get around the larger levels.    Online multiplayer was a relatively minor feature in Hawk 3, at least in comparison to what's available now.  Hawk 4 doubles the player limit, offers more multiplayer games, adds team competition, and introduces new community features.  There's a ~homie list~ for tracking friends online, and levels created in the create-a-park mode can be uploaded or downloaded to share or try out.  Online play runs with very little lag -- there's a blip when new players join a game, and some framerate problems when a large area contains five or six players, but for the most part, the pace of gameplay is quick and smooth.  It's a little disappointing to see the H-O-R-S-E game left out of the online mode, but it would admittedly be hard to implement that with so many players involved.      While the new career mode in Tony Hawk 4 has many fine qualities going for it, the most encouraging to see is the ramped-up difficulty.  Hawk 3 was a great game, certainly, but in retrospect it could have been a bit harder, offering more and tougher challenges.  Hawk 4 removes any possible complaints anyone could have in that regard.  Its goals get very tough towards the later stages, but their progression is designed to gradually teach the new skills players need to complete future tasks.  The tasks are far more imaginative than what we've seen before, too.  They're creative and fun, rather than simple variations on ~score so much~ or ~collect five of these.~  Some could still use some clearer explanation -- like a few goals in Mat Hoffman 2, their fulfillment conditions are very vague -- but those are relatively few in number, and the level progression is designed such that it's easy to go find something else to do and come back to a difficult sticking point later.  This is, then, the best single-player Tony Hawk yet, and with the online mode finally come into its own it's certainly the best for multiplayer gaming as well.  The arrival of genuine competition has obviously been good for this series, and hopefully we'll continue to see it grow and develop at this same pace in future years.  Graphics You could take a screenshot of Hawk 4, place it next to one from Hawk 3, and think that the game hadn't changed much visually.  In a way, that's true -- the amount of detail in the character models and particular aspects of the backgrounds hasn't increased a great deal.  Where the series has improved in the interim, though, is its scale.  In other words, the picture isn't necessarily prettier, but it's gotten an awful lot bigger.  Where Hawk 3 presented comparatively small, confined levels, Hawk 4 has absolutely huge areas.  Kona skatepark dwarfs the Skater Island competition level in the last game -- I'm not sure how many of the one you could fit into the other, but it would be more than a few -- and the framerate blips that occasionally popped up in the last game don't seem to appear here, even when a particularly large vista fills the screen.  The level designs are also impressively true to life in many instances.  Speaking as a resident of the bay area, the San Francisco and Alcatraz levels replicate the layout and feel of their inspiration along with the famous landmarks.  The skaters themselves have seen the least improvement in terms of texture and model detail, but as usual, Neversoft's animation library continues to grow.  The selection of basic and special tricks is bigger, with some wonderfully ridiculous additions in the latter category, and there are better transition animations for combinations and those unavoidable bails.  Some of the levels still have the odd glitchy spot, where cause doesn't seem to match up with effect when it comes to selecting a bail animation, but that's an aspect of the series that will probably never quite go away.  Sound We've mentioned before that this is the best licensed soundtrack ever compiled for a videogame, but it bears repeating -- this is the best licensed soundtrack ever compiled for a videogame.  It would be nice to have a feature like the Xbox version's custom playlist, but to be perfectly honest, I doubt I'd bother to make use of it.  The music here is just that good.  Like Hawk 3, it's an eclectic mix of old and new across several genres, but the list is far larger now, with 35 tracks altogether.  AC/DC sits next to Aesop Rock, while De La Soul rubs elbows with Iron Maiden.  The only problem is Activision's curious editing of the tunes in order to conform to some demented standard of decency.  Case in point: in N.W.A's ~Express Yourself,~ Dr. Dre has a line that goes ~I don't smoke weed or a sess.~  Now, this does sound pretty silly in retrospect, considering The Chronic was recorded just a few years later, but there's nothing offensive about the line, is there?  Nevertheless, it's blanked out, presumably to avoid any potential reference to marijuana use -- even a reference which discourages it.  And yet, at the same time, Iron Maiden's ~The Number of the Beast~ appears to have gone unedited.  If we start from the appropriately cynical first principle and assume that Activision's motivation is to avoid complaints from parents, this still doesn't make any sense.  I dunno about your mom, but mine would be far more bothered by overtly Satanic subject matter than someone saying the word ~weed.~  It's a small point, and the whole matter can probably just be chalked up to the vagaries of the ESRB standards, but it would be nice to see some more logical thinking in evidence here.  Now that the nitpickmobile is out of gas, back to more pertinent issues.  Along with the killer music comes strong sound design, on top of an already effective base established in Hawk 3.  The surround effects are easier to appreciate in this sequel, because there are more pedestrians and other bits of interactive noise in each level.  The background noise includes a substantial variety of quips and comments, as well as engine noises, squawking seagulls, the odd seal barking -- you get the idea, yes?  Online games are even more interesting, with all the activity surrounding you.  Paying attention to the directional sound can even yield a bit of an advantage in a capture-the-flag game, if you're very good.Easily the best Tony Hawk game yet, and online multiplayer makes it the best complete package in the genre.  Even the silliness of the edited soundtrack isn't as bad as what happened to ~Police Truck~ in the original game, or the empty chorus to ~Guerilla Radio~ in Hawk 2.  The score would make a little more sense had we not gotten so carried away last fall with Hawk 3, but some things you can't do anything about.Unless you consider yourself completely burnt out on the skating genre, this comes highly recommended, and even the jaded may find that Hawk 4's expanded career mode breathes new life into the series.  We still wonder when this series will eventually run out of gas, but it won't be happening this year.", "date": "Oct 23, 2002"}