{"name": "Combat Flight Simulator 3", "name_review": "Combat Flight Simulator 3", "ref": "https://www.ign.com/articles/2002/10/28/combat-flight-simulator-3", "text": "I've followed this series from the start and have been as anxious for this release as I can be in this busy season. This time around the Combat Flight Sim franchise wings its way west to return to the European skies which it first flew back in 1998. Since then the series has made a few expected changes and even thrown in a few surprises as well. This time around is no different, with some predictable upgrades and some shifts in some new directions. And like previous years, these shifts can be both good and bad.   The Planes  As we've come to expect from the series, this one rates very high in terms of plane modeling, both in terms of visuals and performance. Performance differences for the various planes are easily felt (provided the flight modeling is turned up) and you'll really have to adjust your tactics based on whether you're fighting the Hun from the cramped office of your Spit or from the robust interior of your Thunderbolt. These performance differences are quantified in the game, making it easy to see the degree of difference between one plane and another.   The range of planes you can fly is also quite impressive, especially for this series. For the RAF you can fly the Mosquito, Spitfire, Tempest, and Typhoon and American Mitchell. The RAF also get the Vampire, Britain's second jet fighter. The USAAF fliers can rely on the holy trinity of Lightning, Mustang and Thunderbolt while also getting bombing support from the Marauder, taking to the skies in the experimental P 55 Ascender or the jet known as the Shooting Star. German aces can pick from the FW 190 or the Bf 109 or the experimental Do 335 Pfeil. The German bomber arm relies on the Ju 88. Germany trumps the two Allied nations producing not one, but two jets, the Gotha 229 and Me 262.   While the developers have finally consented to let us fly more planes, this new freedom comes at a great price. The Microsoft team has given us exactly what we've always wanted -- the chance to fly all the planes in the simulation. But as is often the case with most magic genies and monkey paws, the team has found a loophole in our wish -- only the flyable planes are present in the game. If it's not one of those 18 basic types, it's not anywhere in the game. As a result, you won't find yourself facing Heinkel 111s or Hurricanes or even B-17s.   Instead of these standards, we have a new batch of jets and experimental models. Things like the Shooting Star and Vampire are cool in their own right, but they belong to a new era of jet aircraft that have no real place in Combat Flight Simulator 3. Likewise, prop-driver planes like the Ascender had no operational impact on the war, so there inclusion here is somewhat suspect, especially given the absence of other significant, non-flyable craft. Better to spend the effort it took to fully model the Do 335 on planes that don't seem so out of place. What's a European war without the B-17?   But you do get to fly level-bombers for the first time in the series and that's a definite plus. Taking the fight to the enemy from the cockpit of Marauders, Mitchells and Ju 88s is a real thrill and one that's not been replicated in many other games. And after the complete absence of bombers and torpedo planes in CFS2, it's good to see some new effort in that direction.   You'll need to switch between the pilot, bomber and gunners' positions throughout the flight. While not in the pilot or bomber's seat, the AI takes over control of the plane letting you shoot down enemy interceptors. While I can deal with cycling through the stations individually (rather than accessing them specifically through unique hot keys) some of the gunnery stations have odd sighting problems; the actual projectile from some of the guns seems to lag behind the crosshair, much more so than might be accounted for given the speed and direction of the plane.   The Campaign  The dynamic campaign is the biggest change for the series and the one feature that I'm most divided on in terms of value. It begins in '43 and lets the player jump right in as squadron leader. (No more carefully waiting until attrition sees you promoted due to pronounced manpower shortages.) You'll also get the cream of the prop almost right away, German and British campaigns give you the greatest fighters right up front, leaving little for you to look forward to. When you start flying Spits and 190s by the second mission, you don't feel like you have much to look forward to. The American campaign fares a bit better in this category sticking you with the P-47 for a while before you can get the really choice planes. You do eventually progress to the late model jets but, as I said already, this transition really kills the mood of the game -- especially when you're called on for ground attack missions.   Like franchise or season mode in sports games, the campaign here is more geared towards those with lots of interest and a helluva lot of patience. The European Theater of Operations is rendered on a grid. A frontline separating the forces runs across the map and your pilot is eligible to undertake missions in whatever squares the frontline passes through. The features of the particular sector you've chosen will determine the range of mission types.   You can attack factories, convoys and bridges; escort or intercept bombers; fly reconnaissance and, yes, even mix it up with opposing fighters. The point of it all is in pushing your side's front line past the victory locations held by the enemy. This is accomplished through successive victories in aerial and ground-based engagements in a particular sector. You can spend prestige points, earned through mission play, to commit your ground forces and supplies to an attack in a particular sector. These are replenished each turn by factories and supply centers that you must protect. Seizing (or bombing) the factories and production centers of the enemy reduces the amount of troops and supplies they can commit to further offenses.   While it sounds okay in practice, there are a few problems with this system. First, the ground offensives necessary to move the front forward cost so much prestige that you'll see very little movement of the front lines. Second, by basing the missions solely on sectors, you'll have to hunt around for exactly the kind of mission you'd want. It would make more sense to include filters or summary lists so you could instantly see which bomber intercept or convoy attack runs were available. As it is, you can learn to read the map well enough to anticipate where some of these missions will spring up, but it would be much easier to click a button and see a pip (or star or whatever) in every sector that has such a mission available.    Fighting a la Carte  If the whole campaign seems like too much of a commitment for you, then there's always the quick mission generator and a few pre-scripted historical and speculative missions to fly. The generator allows for only the most basic options in terms of friendly and enemy planes. You can set up ground attacks, intercept and dogfight missions but, for some stupid reason, there's no shipping strike option. If you want to blast boats, you have to run across such missions during the course of the campaign.   The historical missions are pretty limited. In all there are only a handful and, while they cover a good range (including one shipping strike), there's not much interest or story in them. The game also has some decent multiplayer features including a form of team-based deathmatch. The real seller here would be the co-operative play except that it only applies to single one-off missions and not to the larger campaign.   In most instances you'll have to rely on the friendly AI to help you out. While it might not be smarter than the people you would play with otherwise. The friendly AI responds to your commands fairly well (if they're in a great position to carry them out), but the range of tactical options is limited to ~Attack~ and ~Defend.~ The enemy AI is a bit tougher all around but still too predictable in some ways. Turning fights are rarely refused especially towards then end of scrambles when there are fewer planes left.   When you're trying to get around on one of these enemy planes, you'll rely on the handy directional indicator at the center of the HUD. While this feature is quite useful, it can be a real pain in the ass having to cycle through each and every target in the ground and air to come around to the one that's in front of you. A set of filters to only cycle through air targets, or a button to select the enemy closest to you or directly under your gun sights would make things a lot less confusing in the air.   Taking Her Up  As I said under the section about planes, I've always loved the look of the planes here. Seeing those rivets and joinings all with convincing weather effects and real workable control surfaces, still puts the CFS series right at the top of the list for graphic details. The cockpits are all a bit flat, but they are rendered in 3D with workable instruments and switches. Damage modeling is likewise detailed with various parts deformable in various ways. Imagine looking out and seeing the top of your rudder shot off. Weapon effects and explosions are rendered well. The tracer effect is much improved over last year and the smoke and explosions are quite convincing.   The sound effects that accompany battle are also suitably thrilling. There's a real metallic weight to the fire which adds a lot to the experience of fighting. Likewise there's the entirely separate (and completely unsettling) sound of bullets ripping through your plane.    Perhaps the best sound is the gentle creaking of your plane as it moves through the air. It's not entirely accurate but it serves as a really nice cue for stalls and helps to bring home the stress of whipping your plane about in the air.   In the air there's a great deal to see as well. The sun flares perfectly and does an excellent job of seeming to be constantly moving without being too overt. Rays of light radiate out and waver back and forth ever so slightly. The cloud model is probably the best we've ever seen with real huge masses of clouds serving not only as eye candy, but also as a unique strategic resource. Weather effects are also thrilling with snow and rain flying past your canopy and lightning flashing off in the distance.   The view of the ground is a mix of good and bad. The snow textures seem to be the worst offenders here, particularly when viewed from high altitudes. The regular temperate terrain comes and goes at the higher altitudes, sometimes looking quite real, other times looking as though someone's smeared Vaseline over your screen.   There are lots of objects on the ground, which is a big plus. Flying low down, you really get a sense of speed when you're racing past trees and just clearing the tops of buildings. It's too bad really that there's not a hard collision model. Some trees and houses let you pass right through while others end your flight in a fiery crash.   What did you think of CFS3?   All this graphical goodness comes at some price however. We've run the game across a few systems to get a good indication of the performance and, overall, the game runs really well. On a simple 500MHZ with 512MB of RAM and a 32MB 3D card, we saw frame rates hovering around 20fps at 800x600 16-bit. We could get in excess of 40fps by moving up to a 1.4GHz machine with a GeForce 4 -- even if we increased the display to 1024x768 and moved up to 32-bit textures. Above those specs the game performed even better.  As good as it is, CFS3 is not the ultimate word in World War II flight sims. IL-2 Sturmovik is better in many technical areas but is somewhat less approachable than CFS3. If it's a matter of theater that interests you and you don't care about having the greatest graphics, you may find it more rewarding to dig out an old copy of Microprose's European Air War.If there were no other compelling alternatives and if this wasn't the third title in the series, I'd be tempted to give CFS3 a higher score. As it is the title adds little to the series in the way of improvements and some of the design decisions seem a tad off. It's easy to criticize a game for what it doesn't do but in the case of CFS3, there's a lot of effort put in to features that seem like more novelty than real innovation.The experimental planes that are included take the series in the wrong direction. Instead of using a WWII game as a possible springboard for a Korean War game, focus on adding more historical planes, perhaps even part of the Italian air arm. Or throw in the Battle of Britain or a Condor Legion campaign even. At the very least, give the German players the chance to take on B-17s.I don't see how you can have a war without them.", "date": "Oct 28, 2002"}