{"name": "Shenmue II", "name_review": "Shenmue II Review", "ref": "https://www.ign.com/articles/2002/10/29/shenmue-ii-review", "text": "Yu Suzuki is one of console gaming's most famed creators.  Having been responsible for such classics as Space Harrier and the Virtua Fighter series, Suzuki has always strived to make original games.  Shenmue II is the second installment of what was originally planned to be four games.  The original Shenmue debuted on Dreamcast two years ago, with the sequel shipping only to Europe and Japan.  Shenmue II was never released in America until now with Microsoft shelling out some hefty cash to pick the title up from Sega.  Shenmue II was dusted off, given a few Xbox refurbishments, including some graphical upgrades, a new ~photo~ feature, and English dubbing.  The results aren't bad.  While Shenmue II is not the greatest game ever made (as some may have wished, hoped, believed), it's a solid RPG with strong fighting and action elements that do well to compliment the heavy adventure aspects.    Features  Free-roaming action/adventure/fighting game that melds several genres into one Fighting engine based off Virtua Fighter Deep storyline filled with interesting twists that will keep gamers glued to their TVs Includes the Shenmue Movie chronicling the first episode in the series 5.1 Dolby Digital cut-scenes, 4-channel in-game   Originally called a FREE (Full Reactive Eyes Entertainment) game, which did little to actually define what the game was, the Shenmue series has been hard to categorize.  With a heavy amount of adventure and a smattering of fighting and action mixed in, Shemue II offers a variety of game types all in one package.  You'll do some item collecting in Shenmue II, much of it optional, and you will level up a variety of fighting moves while learning new ones along the way.  Add in a deeply involving story (in fact, the story takes center stage throughout the game) and Shenmue II seems best categorized as an RPG.  While the fighting, QTEs (don't worry, I'll explain later), and adventure aspects are all important, unlike your typical action-adventure game, these service the story and not the other way around.  It's the story that matters here and what will take you from start to finish isn't the clever (and occassionally boring) mini-games or the free-style beat-em-ups, but learning more about our hero, Ryo Hazuki's, plight to avenge his father's murder.  Story Planned as a sixteen-chapter epic spanning several games, the original Shenmue was released on Dreamcast two years ago.  Representing only the first chapter of the Shenmue saga, the original introduced gamers to a world where every cupboard could be open, every door knocked on, every stranger spoken to.  It was an attempt at a living world.  Shenmue began with Ryo Hazuki returning home to find his father being assaulted by a mysterious man.  Having witnessed this man, Lan Di, murder his father, Ryo sets out on a path for vengeance.  This quest for Lan Di uncovers a deeper mystery, one involving two mystical mirrors the Chinese underlord is searching for.  At the end of the first Shenmue, Ryo leaves his native homeland of Japan for Hong Kong, hot on the trail of Lan Di.  Many questions from the original title are left unanswered, but it's clear this first entry in the Shenmue saga is merely meant as an introduction to the character and gameplay.  Much is hinted at, but little is learned.    Shenmue II picks up right where the original left off.  There is nothing in the gameplay to set up the new adventure.  All this is taken care of with the Shenmue Digest, a ten minute recapping of the events of Shenmue and the inclusion of Shenmue: The Movie, which takes many cut-scenes from the original and pieces them into one long narrative.  If you've never played Shenmue, you'll want to watch these, because there's a lot of important facts and happenings you'll have missed otherwise.    The game begins in early 1987 as Ryo's ship pulls into port in Hong Kong.  From here, you'll begin searching for both clues to Lan Di's whereabouts and to the secret meanings behind the two mirrors he so desperately seeks.  But unlike the first Shenmue, where Ryo must mainly rely upon himself, Shenmue II sees Ryo befriending a number of others who aid him in his quest of vengeance.  Shenmue II is rich with story.  For all of its faults and for whatever gameplay merits mentioned below, the story is king here.  As with any good RPG, a compelling tale is necessary to make a game memorable, and Shenmue II is certainly that.  The overall plot features several twists and hooks and answers several questions raised in the original.  You'll learn more about Lan Di and why he killed Ryo's father, much more on the meaning of the Phoenix and Dragon mirrors, and you'll actually find out what the word Shenmue refers to.  But be warned, there are no announced plans for a third installment, which means you could be left wondering over the remainder of the story for the rest of your life.  Shenmue II ends on a bit of a cliffhanger, raising a slew of new questions in the final hour of gameplay.  Where the original ended with the true beginning of Ryo's journey, Shenmue II ends, essentially, in the middle of the story.  So it's a risk you need to consider, because your reward for over 20 hours of gameplay is an uncertain franchise future.  That said, Shenmue II is a well-crafted story -- one of the better and more comprehensive RPGs out there.  Ryo's journey isn't just one of revenge.  It's also about a boy growing into manhood.  Ryo shows both compassion and a reserved anger that speak perfectly to his role as a troubled and confused youth.  Though the translation isn't the best, and the English dubbing is pretty awful, it's still clear that a lot of thought went into making each of the major characters an individual, with their own thoughts, desires, fears, and needs.  If anything, Shenmue II presents itself as a sort of living novel with a story told from a more personal perspective than most console RPGs.    Gameplay Part of the Shenmue saga is collecting junk.  You can buy little toys from vending machines in an attempt to catch 'em all.  There are quite a lot of toys, but obsessives won't stop till they have every last one.  Part of the promise of the original Shenmue was that everything you collected would carry over into the next addition.  Since Shenmue II is coming out on Xbox and not Dreamcast, that just isn't possible.  To solve this problem, you begin the game with the majority of toys from Shenmue in your collection and almost every fighting move (these can be learned from NPCs or scrolls teaching the moves can be bought) in your repertoire.  But there are plenty of new toys to buy and new moves to be mastered.  Microsoft made several additions to Shenmue II in an attempt to offer something extra from what was given in the original Japanese and European versions.  Here's a quick list:  Photo shop -- You can snap pics at almost any time during the game and view them in your scrapbook Filters -- Change the camera filter and play the game in black & white or any number of other odd color shadings English dubbing -- No Japanese dubbing available, so you're stuck with the newly recorded English dub Kung Fu fighting -- Updated fighting engine to include some of the Virtua Fighter 4 upgrades Improved graphics -- Brighter colors and greatly improved lighting effects, plus much of the slow down from the Dreamcast version was minimized Shenmue Movie -- Comes with the Shenmue Movie New sound -- 5.1 Dolby Digital cut-scenes  One thing that makes Shenmue II different from most RPGs and adventure games is the sense of time.  Though time passes quickly, with minutes of game time equaling seconds of real time, you experience every waking moment of Ryo Hazuki's life.  But what makes this unique is that every character in Shenmue II has their own living life.  People come to work in the morning, take breaks, and head home at night.  But unlike the original, there is a lot less waiting around.   You will have a series of main objectives making up the main story.  These generally need to be resolved in the order presented.  However, you'll also have a series of side quests that can be made at your leisure or ignored.  Add to this a slew of mini-games and it's quite easy to waste time in Shenmue II.  This dawdle effect seems most evident in the first few hours, where Ryo, new to Hong Kong, must work to earn some money or starve on the streets.  It's at this time that the story slows too much.   Shenmue II feels slightly unbalanced as there are times when you will be compelled to move along, finish a quest, fight a group of baddies, or what have you.  But at other times you will be left to wander the streets, looking for important people to aid you, but also trying to earn cash and get tips on places to gamble and find jobs.  This will interest some, because it makes Ryo about as human as you can be.  Aside from never going to the bathroom, eating often, or changing his clothes, Ryo lives a life right in front of your eyes.  Though it sounds cool, some gamers may not have the patience for this.  Shenmue II has a tendency towards a slow pace and with over twenty hours of gameplay, things are revealed in very tiny pieces.  If Shenmue II hurts from anything, it's the pacing.  There's only so much wandering you can do before wanting to get on with the story.    The problem with Shenmue II is that not everything you do has an importance to the central storyline.  For example, when you get a job it's because you need cash, it has no real bearing on finding Lan Di.  This wasn't the case in the original, where you took a job at the docks in order to flush out a gang of hoodlums in business with Lan Di.  While spending part of your time each day trying to earn cash may be interesting to some, it can be an annoyance.  The story is compelling and I'd much rather spend my time doing something to bring me closer to the truth about Lan Di and the two mirrors than have to spend time moving boxes.  The one positive here is that you are pretty free to go wherever you want in the city and earn money however you can -- work a legitimate job, gamble, or even fight for cash.  Shenmue II certainly offers a lot of freedom, but there are enough reasons to continue on the quest that they never become too distracting.  It's not like PS2's GTA where the side quests are as satisfying as the main objectives.  Progressing the story of Shenmue always takes center stage, which is a good thing.    And for those who might be concerned, Shenmue II doesn't require nearly as much drawer searching and random door openings as the original.  That's not to say they aren't gonna happen, but it's not nearly as prevalent as in the first Shenmue.  Much of your time in Shenmue II is taken up with exploring.  Hong Kong is all new to Ryo, so you'll need to learn the city and its denizens first and foremost.  You can buy maps of each area, which is a great help, but you'll learn the lay of the land simply by moving from task to task.  Most of these tasks won't have any direct relation to Lan Di.  There is more to the story than simple revenge and that's reflected in the nature of the variety of quests set upon Ryo.  For one thing, Ryo is young and not nearly as strong as Lan Di.  If he's to confront his father's killer, he'll need to be much more skilled in martial arts.  A strong portion, therefore, of Shenmue II is dedicated to Ryo's training and learning of martial arts skills and philosophies.  And he'll need them, because there are plenty of fights in the game.    Everybody was Kung Fu fighting... Based off the Virtua Fighter engine (the series was originally planned to be a VF RPG), the fighting is excellent.  Ryo is often getting into fights and these battles are rarely ever one-on-one, but thanks to over fifty moves in his repertoire, the fights never get stale.  Dodging and moving about in combat is easy and important.  Grabs, punches, and kicks are there as well as a variety of combos.  The fighting is at a slower pace than a standard fighting game to help add a realistic feel.  Oddly enough, going one-on-one is usually more difficult than facing a roomful of baddies.  When surrounded (as is often the case), you must keep moving to avoid leaving your back exposed to an enemy.    The fighting mechanics are simple in nature, but becoming an excellent Shenmue fighter will take some practice.  Each move is leveled up individually, so the more you practice a move, the more powerful it becomes.  This is a great RPG element and gives reason enough to practice your martial arts.  There are a lot of bosses to overcome (and no, there's no grand showdown between Ryo and Lan Di here, sorry) and plenty of underlings to pummel.  There are very few fights at the start of Shenmue II.  In fact, the first few hours are almost barren of combat, but as the game progresses you'll encounter more foes, with the penultimate hour of gameplay dedicated to a series of battles.  And though nameless thugs seem to offer just a brute force type of combat, bosses have distinct fighting styles including Jeet Kune Do and Jujitsu.  If there can be any gripe against the fighting (aside from the fact that there could always have been more of it), it would have to be the camera.  Outdoors the camera usually behaves, but in enclosed spaces, the camera can be a problem.  For one, Ryo will go transparent in tight spaces, which draws away from the feeling of a real fight.  But worse is when Ryo will seem to just wander away from the spotlight and you'll have to fight against someone without the camera centered on Ryo.  The camera should pull back through walls, making them transparent rather than trying to crowd against the back wall and show off six people fighting in a tight space.  But, overall, a very nice fighting system indeed.    QTEs or When did Ryo become Dirk the Daring? QTEs, or Quick Time Events, are scripted incidents that happen throughout gameplay.  When a QTE occurs, you lose control of Ryo and must play a game of Simon Says.  If a right arrow appears on the screen, you need to press right on the D-Pad immediately.  This goes for all face buttons as well.  QTEs typically involve either chases or fights, though there are a few other occurrences (like trying to walk across a beam).  These commands pop up quickly and aren't limited to single-button presses.  You may need to hit down-right-up and Y to avoid an attack or left and X to kick an object.    If you're too slow, you'll hear a resounding negative buzz.  This will either change the course of the QTE or end the QTE right then and there.  For example, in a chase you may need to avoid a crate of apples.  Failing to hit the corresponding button in time will cause you to crash into the crate, slowing you down.  But you will often continue on after whomever you're chasing (or run from whoever is chasing you).  On the other end, you could fail to avoid a punch in a QTE scripted fight and get knocked out.   With almost every QTE or fight, if you fail, you simply retry it again.  This is what keeps Shenmue II from being as revolutionary as it wants to be.  If this is a living, breathing world, then there should be consequences for failure.  Why not create alternate events?  You screw up a QTE and you have to track down the guy you just lost, for example.  The ability to endlessly repeat QTEs and fights turns the game a little false, which isn't the intention at all.  Nonetheless, QTEs are great.  If you forgot why you loved Dragon's Lair as a kid, this will remind you.  With more QTEs, most of which are much longer and more complex, than the original Shenmue your reactions will be tested throughout your 20 + hours playing through the game.  Love the QTEs, just wish they meant something more than just a reaction test.  You have heard of Xbox Live, haven't you? Sadly, for all the things Microsoft wanted to add to Shenmue II, one thing taken out was the Shenmue Passport.  This allowed you to go online through the game and post stats for comparison against others.  You could also see some information on parts of the game you had passed and characters you'd met.  With Xbox Live set to launch in just a couple of weeks it doesn't make much sense why this simple feature was left out.    Graphics Though Microsoft and AM2 made some graphical enhancements, they were still working from a Dreamcast base and that's evident.  Side-by-side, the game looks much better than its Dreamcast sibling, but it's still not up to Xbox standards.  The animations remain a bit stiff (just watch Ryo running) and some of the character models look terrible (beware the arm wrestler).  The lens flare, rich colors, and improved lighting aren't enough to cover up a game that's graphically outdated.  That's not to say Shenmue II will hurt your eyes (except for that arm wrestler... yeesh), especially some of the nicely rendered cut-scenes, but had it been developed specifically for Xbox, it would have looked a lot better.  One of the best things about Shenmue II is the art design, which helps make each area of Hong Kong appear unique, despite being one large cohesive city.  There are well over a hundred characters in Shenmue II and many of them look very distinct from one another.  It's not like your standard RPG where Townsfolk #1 and Townsfolk #2 are the same guy with different colored hair.  Here, most of Hong Kong's denizens are unattractive people, with distinct faces, a variety of different facial hairs, different head and body shapes, and different clothes.  There are clones out there, but these mainly comprise the low-end NPCs who matter little in terms of progressing the story in any way.  Kudos for that, but unfortunately, the overall appearance of the game isn't quite up to current Xbox standards.  And though the slowdown from the Dreamcast version has been lessened, the game still drops frames in crowded areas.    Sound The score is fantastic and the voice acting is terrible.  That's Shenmue II's sound in a nutshell.  The standard in-game sound is four-channel and it's decent enough.  The ambient sounds are good, but unfortunately, the English dubbing is pretty awful.  The translation in general seems a bit stilted and often sounds unnatural and many of Ryo's phrases can get repetitive quickly.  Though there was a Japanese dub (English subtitles are already included) from the original Dreamcast version, Microsoft made the decision to only include the new English dubbing.  The results are pretty bad.  And there's one giant plot hole sitting there.  The first Shenmue makes quite a big deal over the fact that Ryo can't speak any Chinese (Cantonese or Mandarin).  He has to search his native Japan for others who can translate for him.  He comes to Hong Kong, a country that mainly speaks English and Chinese dialects but suddenly he can talk and understand everything that's going on.  Uh, how'd that happen?  But where the dialogue fails, the score picks up wonderfully.  Featuring melodies that feel both mystical and deeply oriental, the score sets the perfect mood for the game.  Great use of strings and flutes to add emotional weight to many important cut-scenes.  If it weren't for the terrible dubbing, the sound would get higher marks.  Though Shenmue II uses four-channel for the standard segments of gameplay, 5.1 Dolby Digital has been added to the cut-scenes.  A nice touch, but it would have been nicer to see the entire game converted to 5.1.   Shenmue was one of my favorite Dreamcast games, one I had trouble putting down.  The sequel, while new to the US, feels almost outdated.  The voice-acting is bad, the graphics are not on the level of other Xbox games, and Shenmue II never involved me as much as the original.  In fact, a lot of the things set up in the original don't come to bear in Shenmue II until several hours into the game, leaving an odd disconnection from the first game for the first couple of hours. There's very little back story offered in the game itself, so anyone who hasn't played the original and doesn't watch the included Shenmue Movie may find themselves wondering what the big deal is.  There's been no additional set-up added to the game.  Where the original eased you into the fighting system, explaining moves to you, showing you you needed to practice regularly, and letting you get your feet wet before diving into serious battles, Shenmue II assumes that you've played the original.  If you haven't, it may come off as a bit confusing, or more likely, a bit frustrating.  Though some new graphical tweaks and cosmetic features have been added, the game is a relatively straight port from the Dreamcast version.  Even though there's a lot more fighting and QTEs than in the original, Shenmue II suffers from a bit too much meandering.  It would have been nice to see the story take off a bit quicker, because in all honesty, I really just wanted to learn more about Lan Di and the Phoenix Mirror.  While you had to work at the docks driving forklifts in the original, it had a purpose -- you were trying to ferret out some baddies.  But here, you work because you need the cash.  To make a story strong and compelling, though, everything needs to be more directly tied into the main focus.  Otherwise, it feels a bit pointless.  Shenmue II is a good game and a definite pick-up for RPG fans, but more should have been done with this sequel to make it more accessible to those who never played the original.  It has its faults, for sure, but it is a unique experience.  It's certainly a love or hate type of game, which means that you should only buy it if slightly open-ended RPGs appeal to you.  The only real bummer is that there seem to be no plans for a third installment, which could make this one heck of a long cliffhanger.", "date": "Oct 29, 2002"}