{"name": "Iron Storm", "name_review": "Iron Storm", "ref": "https://www.ign.com/articles/2002/10/29/iron-storm", "text": "Imagine a world that has been ravaged by war for nearly over 50 years. Now imagine that everyone has gotten so used to the war that the largest corporations, and the most invested in corporations, are the weapons manufacturers. This is the world of Iron Storm, Dreamcatcher and 4X's new first person shooter set in an alternate history where World War I, that ~war to end all wars~, never actually ended. The gloomy atmosphere and constant action in the game are heavy and gritty, filling out the hopeless war torn nature of this Earth. And while the gameplay doesn't really hold much in the way of new invention, it was exciting, fast paced, and challenging enough to keep me moving all the way through. Iron Storm is a pretty basic shooter, but if you're looking for a little bit of mindless fun you'll find a game that, despite some problems, will satisfy your that itchy trigger finger you've been needing to unleash.   My curiosity in the game originally came from the fact that unlike many games that we've seen in the last couple of years, it was focusing on the First World War and not the Second, which is quickly becoming quite overused. When I found out that the storyline would take us down a path of alternate history, my interest was piqued. I mean, World War I was one of the nastiest and bloodiest wars on the planet! The meat grinder along the fronts in WWI was based around terrible trench warfare where infantry charging headlong into nests of the new machine guns and the fear of instant and horrific death were an everyday reality. Now take that war and make it stretch out thanks to a new megalomaniac named Baron Ugenberg, the leader of the Russo-Mongol empire that has managed to take nearly all of Asia and Europe into Germany and France where the front lines are.    What you're left with is a world used to war and soldiers raised on a healthy diet of bullets for breakfast. One of these lifelong instruments of death is Second Lieutenant James Anderson. From the age of 19, in 1924, he's been in the trenches fighting and has become a legend in his own right having survived for nearly 40 years of intense fighting making him a certified badass. As the most cunning and knowledgeable soldier on the field, he's been called up for a final assignment that could help end the war. He's been assigned to find and capture a weapon of mass destruction in the Russo-Mongol research labs and to take a shot at Ugenberg if given the opportunity.   The story progresses the way of Half-Life, with few cutscenes and most information being given through enemy dialogue and small TVs scattered throughout the battlefield near troop emplacements. While it didn't work quite as well as it did in that classic, it does manage to firmly implant you in this chaotic and violent world. Often these TVs will give you information on weapons and situations as a hint of things to come. Most of these are given cleverly in the form of financial reports of the various weapons manufacturers from around the world giving both needed information and a glimpse into the way of the world.   War has been dehumanized and turned into a means to make a tidy profit. It's depressingly dark and fits well with the art style and sound in the game. However, there's virtually no character building placing Anderson as a nearly unfeeling and uncaring tool of death only there to follow orders and complete missions at all costs. Only once, in a short cutscene with a shot of Anderson's eyes widening, did I ever get the feeling that there was any kind of emotion under his scarred exterior and even then it's fleeting. Meanwhile Ugenberg stays a nearly faceless enemy that must be found and destroyed having little to no hand in things until the very end. The only main speaking part is that of Cecile Newcastel, Anderson's CO. She seems to be fairly attached to Anderson, which actually feels fairly out of place since you never hear a peep from Anderson and only actually see her on one occasion.   While the story may not be character driven, Iron Storm has plenty of style and atmosphere that rings perfectly to the subject matter. From the early levels that take place on both sides of the front line in the trenches of a hard fought war to the heavily armored trains and wrecked Reichstag, this is a deeply screwed up world. Everything is dark and rusty and more than a little ruined. You get the feeling like the whole thing could just fall apart and on top of your head at a moment's notice. Much of this is due to the fantastic texture work that went into the environments of the various levels. Things are just not nice and fancy in this world. Everything is made from the earth. Metal, wood, and dirt. The brown and gray color scheme brings this depressing reality to life and the construction of the ruined towns, steel fortresses, and war torn battlefields add to the flavor. It looks as though there is nothing left of Europe but a charred and bloody crater.   Equipment and weapon design also helped bring the game to life as well fusing more modern engineering with a 20's and 30's feel to it. Many of the weapons look like massive and solid pieces of metal. There's none of this pansy plastic added. It's all iron and you had better be strong to carry it. Of course not all of the weapons are so severe, but even those that are lighter weight and look more like modern fighting utensils have the stark design of utility without comfort.   Whereas some games nowadays hold the promise of many more polygons and buildings with curves, Iron Storm will have none of this. Of course, this is partly due to the engine, which runs well, that just doesn't seem to support it. But its technical inferiority to some of the new engines doesn't detract from the game or the look. The only thing that really brings the look of the game down is the character models. While animated fairly well, the models themselves aren't going to blow anyone away. They're decent but not really noteworthy except for the fact that they all have to carry weapons that the pick up. Every weapon you and your enemies hold will be shown on the model. If you switch your viewpoint into third person, you'll be able to see all of the holding points for each of the different weapon types. Of course, this also means you can only carry one of each weapon grade. So if you want to use a grenade launcher, you'll need to drop your machine gun to get it. It certainly adds some flair and punch to the visual when you decide to run around in the third person view.    You can choose between the third person and first person view at any point in the game. But aside from the few times when it made sneaking and running on beams easier, I only switched to third person for fun. It isn't an easy way to play the game, and for a game that isn't easy in the first place, it's almost an unviable course. You'll need to be in that first person view for quick reactions and precision aiming because there's a lot to aim at.   For the most part, the game is a pretty basic shooter. Most of the levels revolve around you running through an area destroying everybody and everything that gets in your way. There are some moments where I thought the game would be taken beyond these basic concepts and into a more Medal of Honor type of play, but it never quite reached that same epic level. Near the beginning and middle of the game, you'll be fighting along side some other of the allied forces. But these guys usually die so fast that you never really have a chance to feel like you're part of a concerted effort as in the case of the Arzew and Omaha missions in MoH. Of course, much of this game is about the lone wolf aspect, but in these certain areas, it could have been played up to a pretty effective end. It seems like a missed opportunity to me.   This is certainly a man against all odds type of game. And sometimes it really feels like that the odds are really not stacked in your favor. Iron Storm can be hard at points. Of course, this mostly thanks to some good AI that'll dodge, hide, and surround you when you aren't paying attention. The only problem is that it seems almost too good half of the time. The quicksave is a must have in this one with rocket and grenade happy soldiers around many corners. You'll need to approach battle carefully and even then you'll be hurting half of the time.   This isn't to say that the AI isn't without its problems however. There were more than a few occasions where I came across enemies running headlong into walls and others where shooting an enemy would illicit no response from another only two feet away. But for the most part, the enemy brings fairly smart use of groups, weapons, and cover providing for some interesting and challenging firefights. My main problem with these is that while the enemies had to reload, they never seemed to run out of ammunition meaning rocket troops could fire at you forever if they wanted to. The weapons provided in the game are actually fairly well balanced for all of that.   The levels you'll be running through are also designed fairly well for the most part. Many of the early levels are actually strung together into what is almost one giant level through the use of points you'll run across where a short loading point will appear to start AI and sound. Graphically, it's acts as a nearly seamless experience, which means you'll be able to move from the western trenches to the eastern ones and on into cramped indoor environments and complex structures.   While most of the action will involve you running and gunning, some of the levels were designed for a different type of gaming. There are points where you'll actually have to discard many, or all, or your weapons. Some sneaking is most definitely required in certain points in the game, which was interesting. One level in particular called for you to escape from a prison with nothing but a saber. This meant you had to keep out of sight of the automated turrets and the pesky scientists that always wanted to pull the alarm while I was stabbing them for some reason.   Of course, this is also where I started to have a little bit of a problem with the direction in the game. This level gives you a couple of options of which way you want to run first. But really, there is a pretty linear course of action you need to take to be successful. I didn't realize this until I encountered some indestructible guards that were drawn because of an alarm I had tripped earlier in a place I shouldn't have been yet. I eventually had to think about it and restart the entire mission (which thankfully I still had saved). It was pretty freakin lame and something that should have been solved with some direction from Cecile (who's always in radio contact) or some kind of roadblock in the direction I went first until I finished a certain portion.    There are a couple of occasions as well where you'll have to destroy some things to move on in the level. It's not always very clear and caused me a bit of frustration at points. Take for instance a section where a thick iron door needed to be destroyed. After throwing a couple of grenades at it with no effect, I took off and looked elsewhere only to come back and throw a few more grenades at the door in frustration with the last one finally unhinging the thing. Here I thought the door was indestructable and as far as I could remember, there was never a hint to say otherwise.   While I appreciate the size, complexity, and not so linear path some of these levels (especially the final one) take, it can be pretty damn confusing while trying to figure out where you've been and where you haven't been. In most cases I didn't mind so much, although I did miss some objective points that somehow blended into the background with so much of that gray and brown. Still, the overall level design mixed with some different (if not overly imaginative) objectives was pretty nice.   Iron Storm also ships with multiplayer for those that want to get online and duke it out with some real humans. There isn't a whole lot here that is very new either missing out on some good opportunities for some creative objective based team play in this great alternative universe.Iron Storm isn't a game that's going to blow you away in its creativity in terms of gameplay, but it certainly is a nice subject change and has tons of style and grit. Sound and lighting are fantastic in certain areas (the train level when it goes dark comes to mind) and action is always in your face.If you want challenging shooter that doesn't ask too much more than fingers that work and some good reflexes. You'll find plenty of things to shoot at in Iron Storm and have plenty of fun with it as long as you aren't looking for something deep.", "date": "Oct 29, 2002"}