{"name": "Fatal Frame", "name_review": "Fatal Frame Review", "ref": "https://www.ign.com/articles/2002/10/29/fatal-frame-review", "text": "When Tecmo's Fatal Frame debuted on PS2 earlier in 2002, it was recognized as an innovative twist on the survival horror genre with it's ~Pokemon Snap meets Resident Evil~ gameplay. Now that it's made its way to Xbox, Fatal Frame seems even scarier with even sharper visuals and frighteningly clear sound effects that make Himuro Mansion the game's most compelling character. However, the wispy, transparent ghosts and their chilling howls can't make up for the fact that this game was widely available, on other console, seven months ago.  Gameplay  Resident Evil Snap isn't just a catchy marketing phrase to describe FF, it's all too accurate. Without giving away too much of the story, you've taken possession of your mother's old camera, which has always had the supernatural ability to see things that aren't necessary visible to the human eye. An added bonus --especially since we find the main character Miku deep in a haunted mansion-- is that it can drain the energy of any evil spirits you can lineup in the viewfinder. These two camera abilities will occupy most of your time in Fatal Frame since you will often need to expose hidden rooms and areas with the camera and then fight wicked spirits at some point soon thereafter. But you'll have a sharply tuned ~ghost sense~ and plenty of camera upgrades, both physical and supernatural to help you along the way.  The story in Fatal Frame is a mixture of real life legends and ghosts stories re-purposed for the game. Your motivation as Miku is finding out what they heck happened to your brother, who also wandered into the haunted mansion recently. But along the way you're literally gathering scraps of information about what has happened to most anybody that has ventured into the mansion and disappeared. You're learning bits and pieces of the overall story of the grounds and actually reading them this time can not only help you get through those wonderful puzzles but you'll be able to see what's coming next for our heroine.     Really, the gameplay mechanic is engaging and becomes quite intuitive once you get over the fact that this silly little girl has ventured into a haunted mansion with nothing more lethal than a flashlight, a camera and an adorable schoolgirl outfit. You get used to exploring and looking for doors and shiny objects that usually turn out to be herbal medicine (health), film or some other fantastic goody that you need. The puzzles are nothing you haven't seen before in survival horror games with the standard assortment of ~find the brass key for the brass door~ and ~enter the right combination of stones/numbers to open this next area~ challenges. The truly engaging part is how you'll have to be on your guard throughout the game because you never know when you'll need to quickly take a shot of a wandering (read: non-threatening for now) ghost that suddenly appears from around a corner or slips out of a room that you were just in. Those quick snaps earn you precious points you can use for upgrading your camera and the better the shot, the more you earn.   One annoying part is how the control scheme switches when you engage the camera's viewfinder mode. The left analog stick moves Miku around the environments, but once you hit B to bring the viewfinder (first person) up, left analog stick is aim and right analog becomes move, like some alternate control scheme from Halo or something. It's great that you can still move her around to avoid danger while you're looking through the viewfinder but switching stick functions like that is not intuitive. In the heat of a battle with a ghost bearing down on you, it's easy to end up moving the viewfinder instead of Miku, who will have to suffer for you poor evasion tactics.   New to the Xbox version is Fatal Mode, but you'll have to shoot your way through the main game (as seen on the PS2) and nightmare (aka far tougher) mode and earn a high enough ranking to open it up. Once you do, your reward is the bonanza of new, more powerful ghosts --some would say Xbox quality ghosts, but you can be the judge of this. And you get the ~true~ Fatal Frame ending as the masters at Tecmo had always planned it to be. In the end, forcing gamers to push through the old game multiple times to get to the newness of the Xbox version seems a little cheap, but I guess it's one of those things where you'll appreciate that new stuff more once you've played the original. What better way to make sure you've played the original than to put it on the Xbox DVD?  Graphics  This is one of the game's strengths. As impressive as Konami's port of Silent Hill 2 was on Xbox, Fatal Frame's transition to Microsoft's console was even smoother with the ghosts showing up with even more detail and a stronger sense of smoky ~otherworldliness.~ FF is a relatively dark game but the pre-rendered environments, when you can see them, are very well done and on par with anything you might have seen in the ~Resident Evil~ remake that appeared on GameCube earlier this year.   Animation wise, there is not a lot of action going on with the exception of a few super aggressive ghosts in the mansion. Miku herself doesn't do to much besides jog, walk, move her flashlight within a very limited range of motion and cower in pain from attacking ghosts. They're only slightly stiff but for a slower paced game like Fatal Frame it all works. The animation on the ghosts themselves is appropriately creepy since they all have their own problems and dispositions that determine their ~haunting style.~ In fact the nonthreatening ghosts end up with the most frightening animations since they follow the classic Lon Chaney style of slow, lumbering stiffs whose knee and elbow joints apparently stopped working in the afterlife. But the mean nasty ghosts move in patterns that can include elaborate side-to-side, and back-and-forth movements before lunging at Miku for an attack. Quickly recognizing these unique patterns is a key to defeating them quickly.   Sound  Players will be able to hear the obvious sounds of haunting (disembodied moans and screams and rattling objects), but apparently no human characters in the mansion have this luxury. That's a shame too because Tecmo's proprietary sound technology simulates surround sound well enough to immerse even the most skeptical ghost chaser deep into Fatal Frame.   The background noise in FF is frightening mix of voices layered on top of each other and other frightening sounds that change as you move from room to room. When you actually hear directly from a ghost that has something to say, or when you listen to any voice, for that matter, they all have just the right amount of echo and hollowness to them. Even listening to a soon-to-be-dead guy's voice on an old cassette tape sounds authentic, as far as we know that is.   If the visuals are the heart of Fatal Frame, then the sound is the soul, because this game requires a quiet room and a decent sound system with the volume turned way up to get the full effect. Even with the lights on, the combination of subtle sound effects and ambient noise will have you constantly checking your undergarments for cleanliness.  Fatal Frame makes a nice addition to the Xbox library because the horror genre is severely underrepresented. It's a game that will knock your knickers off with great sound and impressive graphics, but with such a short main game, there's a chance the puzzle-solving and shutterbugging will end up leave you feeling hollow, even if you do play through it multiple times to get the Xbox exclusive bonus mode. If you played it on PS2, the only thing to draw you back into Himuro Mansion will be the Fatal Mode, but it means playing a game you're already intimately familiar with even if it does have polished visuals. If you skipped the PS2 game and have been waiting all this time for a new horror experience on your Xbox, then Fatal Frame is definitely for you.", "date": "Oct 29, 2002"}