{"name": "Taz: Wanted", "name_review": "Taz: Wanted", "ref": "https://www.ign.com/articles/2002/10/30/taz-wanted", "text": "With Infogrames' investment in the Looney Tunes license, it was only a matter of time before a game was crafted around everyone's favorite Tasmanian devil. He's one of the most exaggerated, out-of-control characters under the franchise, which made him a perfect fit for a videogame. In Taz: Wanted, the first Looney Tunes title for GameCube, players will assume the role of the crazy devil in a platform-based adventure. Aimed at the younger audience, the title is home to relatively straightforward design, a few cool control mechanics, but an overall generic feel. It's a game best suited for kids, who will enjoy spinning around uncontrollably smashing things and solving the rudimentary puzzles.    FeaturesSpin, sneak, burp and bounce through more than 15 destructible levels Eat Hiccup Soda and Chili Peppers to power-up Interactive environments with tons of destructible objects Wear disguises to evade the ~Taz police~ Mutliplayer support Replay value increased with high score system Cel-shaded visuals produce a cartoon look   Gameplay The premise behind Taz: Wanted is that he has caused a lot of trouble -- it's in his nature, after all, but Yosemite Sam, Daffy Duck, Sylvester and others are affected by this mayhem. Namely it's Sam who takes action, because Taz ruined a game of slots for him when he nearly hit the jackpot. The result is a hunt for the Tasmanian Devil. That's where you come in to save the day.  Taz: Wanted is a platformer inspired by the likes of its predecessors. It has the specific puzzle-based objectives in the style of Super Mario and some of the linear, box-bashing and spinning from the Crash Bandicoot series. Gameplay begins with a basic tutorial, which requires players to read though a few pages in several books in the hub world. After you learn the basic techniques, which allow you jump, spin, eat, spit, and even dress up in disguises, you can unlock the gates to the first two of the five main worlds, which contain three sublevels.   Each level is setup with a specific set of goals, all of which are displayed to the player before he/she enters the world. An example of a puzzle in the first world has Taz latching on to monkeys that hang from trees. The player must use the analog stick to swing their way up a set of increasingly high ledges. Puzzles become more difficult as the game moves forward, but they can often be confusing, too. To remedy this, gamers can access the menu and get reminder fly-bys of the objectives, and even a hint. On the whole, it works pretty well, but then there's the issue of making it past the rangers who are out to catch Taz. They're placed sporadically around the levels, and getting by them can prove quite frustrating if you don't have on a disguise, which you have to pick up in phone booths you find in the world.   In addition to that, Taz also runs into a good number of mini-game style objectives; skateboarding, snowboarding, and knocking opponents around in sphere cages is featured. These help to mix up the gameplay and vary the pacing, but can't help but seem a big gimmicky.   Overall, there's little that is unique about Taz. It's best served as a kids game, and doesn't intend to be complicated or push any envelopes. For this purpose, it serves itself pretty well. On the other hand, it has its fair share of problems, too. For instance, the addition of Taz's out of control spin is great -- there would be no point to a Taz game without it. However, the use of it is limited, and you often have to worry about running off of ledges, getting caught by rangers, and the camera can pose quite a few problems, as well. It would have been nice to see it executed in a more Sonic-style fashion where the focus was more on speed and destruction, than only rudimentary platforming.   Graphics Taz: Wanted draws upon the growingly popular trend of cel-shaded (or toon-shaded) visuals. Naturally, since Taz is based on the Looney Tunes cartoons this fits pretty well. Worlds are incredibly colorful, full of very flat, but vivid textures. Polygon-wise, though, the character models are about the only objects that show complexity. It works much better than a more realistically styled graphics system, but it also must face the fact that it won't live up to the 2D hand-animated classics.     As well, the GameCube version looks particularly rough around the edges. It runs at 60 frames per second at various moments, but very often it stutters, detracting from the experience. It's nothing that will hinder gameplay, but certainly noticeable.   Sound The main draw here is the voices; some of which are done well and others that aren't. It's all a matter of preference, and if your child isn't as picky a Looney Tunes critic as yourself, most of the voices are quite believable. Additionally, the music is pretty odd in terms of style. The composer must have envisioned Taz to be the hippest of the Looney Tunes bunch, because there is a lot of rock guitar in addition to the usual bells and horns you may remember from the series. It works for the game, but it definitely would have seemed out of place in the cartoon.   For sound effects, the quality is pretty low, and compressed to the point of being tinny and even agitating. The thing is, we can't exactly figure out why the developer needed to compress the sound samples. It's not as if Taz is filled with hours of FMV cut-scenes or redbook music.There's little question that Taz is aimed at a younger audience. In that regard, it's can be considered a nicely crafted platformer with some good ideas and a respectable gameplay structure; the varying puzzle-based objectives, the mini-games, and the bonuses are all there. However, it has its fair share of frustrations such as camera disorientation while spinning wildly around, and an overall sort of generic feel. Additionally, the presentation of the Looney Tunes world isn't as great as it could have been.I would more recommend this for a rental than a buy, even for kids. Some of the creative goals can be fun while they last, but it's not the kind of title that will pull most back to it time and time again.As for adult fans of platforming, it isn't likely you'll enjoy title much at all. Only rent if you're a hopeless Taz fan.", "date": "Oct 30, 2002"}