{"name": "FIFA 2003", "name_review": "FIFA Soccer 2003 Review", "ref": "https://www.ign.com/articles/2002/10/31/fifa-soccer-2003-review", "text": "After capitalizing on this summer's World Cup fever with 2002 FIFA World Cup, EA is once again back on GameCube with the true sequel to last year's FIFA 2002. More than just a graphical and roster update, EA's third GameCube soccer game arrives with more modes, more leagues, and completely ~remixed~ controls. Along with better ball physics and a new C Stick control system, FIFA Soccer 2003 brings with it thousands of real players and hundreds of international and club teams -- but there a few issues here and there that left us wishing a regular FIFA game and the World Cup edition could somehow merge into one, all-powerful soccer title.  Features  More than 175 licensed entitites, including 16 leagues, 450 teams, and 10,000 players Club Championship Mode: play as one of Europe's 18 greatest teams, complete with matching stadiums and chants New Set Piece Control: expanded controls for dead ball situations New physics and control engine make for more realistic ball behavior Four-player multiplayer Progressive Scan 480p and 16x9 widescreen support for HDTVs and DTVs Dolby Pro-Logic II support   Gameplay EA Canada is continuing the company's right analog stick revolution by introducing Freestyle Control to FIFA after successful debuts in NBA Live and NHL 2003. Soccer, like hockey, is the very definition of an analog sport and seems like a natural fit for mapping special moves to the right stick, but there's just not the same payoff in FIFA as there was in NBA Live.   The only move that can be used consistently is the knock ahead  where your player kicks the ball a few feet ahead of himself (by leaning the right stick in the direction he's facing) on the dribble so you can quickly catch up to it using turbo without breaking stride. Simply squeezing the R button to turbo while the ball is on your feet won't give you anywhere near the advantage that the sprint/knock ahead mechanism will. This is how the stars of the game have to do it in real life, so it's yet another bit of realism brought into another EA game that we didn't know we wanted until it was dropped in our laps. However, step-overs and other fancy footwork supposedly available on the C Stick are extremely unreliable because they're dependent on the defensive pressure and position of the ball relative to the player. In soccer videogames the camera has to be positioned far away enough to show a decent sized portion of the field, so that you won't be able to recognize whether the ball is on his left or right foot or which way the defender is leaning, no matter what camera perspective you choose. It makes it seem like the Freestyle Control in FIFA was an afterthought or just wasn't fully developed by the time the game was due to ship. It's easy to imagine however, how the system could be applied to a FIFA game, so here's hoping EA will develop the system more for the next game to come up with something that works intuitively and makes the player feel like he's in control.   The two biggest differences longtime FIFA fans will notice from the previous edition are better physics all around and new player animation/control setup. The do-it-yourself through passes we enjoyed so much in World Cup 2002 have been replaced by a true through ball (open pass) button (Y) that's intended to be used in conjunction with the ~make a run~ control on the L Button. The Y pass is more of a direct pass that's supposed to be aimed at a specific player of your choosing so making it a through pass is optional. But the standard A Button pass simply kicks the ball in whatever direction you wish with no specific player in mind. Getting the hang of these two new controls is a key to unlocking the fun in FIFA 2003 , but should be second nature after half a dozen games or so. The bumping physical play where two sprinting players would jostle and shove each other going for the ball has been replaced with a kinder gentler system where steals and timing are everything and protecting the ball through superior turbo button tapping is no more. The physics between the players and between the ball and the players are once again very good, but the no elbow-throwing on the run along with the furious turbo button tapping make them a little less apparent.   The A.I. is super aggressive at going for the ball and this along with the new sprinting system make one-on-one play even more difficult. Smart manipulation of the left analog stick can perform basic fakes that the defense will react to, but going coast-to-coast like Maradona even with great players like Ronaldo will be extremely difficult. I think moreso than any other FIFA game before it, this 2003 edition compels players to learn and apply the fundamentals of the sport with smart passing and precise timing rather than raw speed and overwhelming firepower.   Another new system in place is the set piece. For free kicks and corners you're given a circular meter with an indicator constantly swinging back and forth with a tiny green area somewhere along that circle. Your chances of successfully passing or shooting the ball depend on how close you come to that green area when you hit the shoot or pass button to initiate the play. Furthermore, the new ball striking indicator let's you choose which side of the soccer ball you want to hit as you kick, thereby allowing for some wonderful ballspin. Talented shooters like Roberto Carlos can bend-in goals with 50% accuracy on the lower difficulty levels on free kicks near the area. One major oversight in this new set piece system is the inability to use ballspin on corner kicks. It should be there, but it just isn't.       The variety of match types can be a bit misleading with multiple tournament, season and friendly games with the only difference being some are limited to Club Championship teams and some are open to any team in the game. FIFA Soccer 2003 is wisely meant to appeal to soccer fans outside of North America so this division makes sense because the Club Championship teams are simply 18 of the very best squads in Europe. From Juventus to Real Madrid to Liverpool, the most famous teams with the most famous and skilled players are all in one convenient location so you can quickly and easily access the most competitive squads in FIFA 2003 rather than sifting through the 400+ total teams in the game, most of which are the soccer equivalents of the Cincinnati Bengals.   Once again there's no definitive World Cup Mode since EA makes an entirely separate game for that little tournament every four years. Instead you get your own International Cup where the teams that qualified for the 2002 World Cup can face off against each other. This is actually a knock against the game since not every national team is represented, but rather the exact same lineup of teams found in 2002 FIFA World Cup, but this time there's no World Cup branding and pageantry. Senegal and Tunisia are there, but no Holland or Bulgaria. While those latter two nations may be burying their heads in the sand for not qualifying for the world tournament, we're pretty sure their national soccer programs haven't been disbanded and therefore should be among the selectable international teams. If European videogame fans are going to be happy that Pasching from the Austrian Bundesliga was included in the game, then surely they'll be livid that such world soccer powers have been omitted. But if you simply can't wait to see what happens when the Dallas Burn of the MLS (the US league is fully represented with real players and everything) takes on Argentina's national team you can set up a friendly or even your own tournament that puts those two teams on a collision course with destiny.   The game's main menu concerns itself with the various match types in FIFA 2003 since there's no desperately needed practice or Freestyle Control tutorial mode to get in the way.   While there are thousands of players and hundreds of teams in the game, the focus is most definitely on the 18 Club Championship squads. Which means that fans of Manchester United, Olympique Lyonnais, Paris Saint-Germain, RC Lens, RSC Anderlecht, Real Madrid, Valencia CF, AS Roma, Ajax, Arsenal, Bayer Leverkusen, Bayern Munich, Borussia Dortmund, FC Barcelona, Galatasaray, Inter, Juventus and Liverpool will be extremely happy but Columbus Crew fans will just have to be satisfied that their team is represented at all. Through the Club Championship analysis you can look up all kinds of interesting facts about the team and actually get a rundown of career stats (imagine that!) for each player on the team. It's a nice touch to finally see heights, weights, birthplaces, goals scored last season and jersey numbers for players. Sadly, the player creation center from FIFA 2002 is inexplicably missing from this game.  Graphics The players, stadiums and crowds look even better than they did in World Cup 2002 and the game runs at a smoother framerate than both previous GameCube soccer games. There are a few framerate drops here and there (mostly during corner kicks and if you have the optional radar feature switched on), but for the most part the GameCube version looks stunning and runs smooth as silk. HDTV owners will also be thrilled to hear that FIFA 2003 supports both 16x9 and 480p progressive scan. The fact that there are 25 stadiums, most of them real and handful of them are generic, is an accomplishment in itself considering that FIFA 2002 only had a handful of locations. But with national flags, color coordinated fans, unique signage and even bonfires in the bleachers (a detail left out of the GameCube version of World Cup), these soccer houses rock.   The focus on star players in World Cup has carried over to this edition of FIFA with the biggest names in the game easily recognizable. From Edgar Davids' trademark orange goggles to Ronaldinho's wild mane of hair, you'll know who is who without checking their shirt numbers. The fact that the player models now have different heights also helps you recognize when you need to get some more giants on that back line of defense during substitutions.   With all of the club teams, accurate uniforms are imperative and FIFA 2003, does not disappoint here either. With championship stars, sponsors, patches and captain's armbands all well drawn and easy to discern, you get the feeling you're watching a weekend match every time.   Sound The commentary is as sharp and enjoyable as can be in a sports game. Motson's excitability and wacky Britishisms always get you into the game and once again can offer you some insight into what you're doing wrong and what you're doing right. World Cup's Andy Gray has been replaced with Ally McCoist, who supplies equally reliable color commentary.  As great as the commentary can be, it's just as enjoyable to play FIFA 2003 with no announcers. This way you can hear the crowd chants and songs, the player chatter in foreign languages no less and other cool sound effects.   The GameCube version of FIFA 2003 runs in Dolby Pro-Logic II, so you'll hear the crowd noise panning all around you and the announcers consistently spilling out of the center channel. Add to that a slew of tunes courtesy of EA Trax, and you've got a great sounding package. In my opinion FIFA 2003 fixed things in 2002 World Cup that weren't necessarily problems. Nonetheless FIFA 2003 is a fine soccer game and should grab everybody's attention on its own merits because it does capture even more of what makes pro soccer so appealing. That's every sports videogame's job. If you didn't fall for the World Cup edition this past summer or if you can put that game's feel and control out of your mind, then you'll find FIFA 2003 to be worth the trouble of leaning a new system. There are still major holes like an underutilized Freestyle Control system, no non-competitive game modes and a lack of customization features (no create-an-anything or weather/time of day control) holding FIFA back from being the definitive soccer game.With virtually no competition, until one of Konami's fine soccer games makes it to GameCube in North America I have to recommend this soccer game for sports gamers looking for another non-stop end to end game.", "date": "Oct 31, 2002"}