{"name": "FIFA 2003", "name_review": "FIFA 2003", "ref": "https://www.ign.com/articles/2002/11/01/fifa-2003-2", "text": "Wow, this has been a busy year for PC Footy fans, with three versions of FIFA hitting the streets in the last 11 months. If you haven't read the reviews of the last two FIFA's that grace this wonderful site, then do it NOW!    OK? Back? Read those impassioned words? Realized that FIFA 2002 sucked the proverbial big one and that FIFA World Cup 2002 was a huge (but slimmed down) improvement? Good stuff, Grasshopper, let us move on.          For all its gooey loveliness, the problem with FIFA World Cup 2002 was that is was just that...the 2002 World Cup. No qualifying, no club teams, no nothing that occurred outside Japan and Korea earlier this year. Now FIFA returns to its roots with what appears to be a more well endowed FIFA 2003.   The game features16 leagues, 450 teams and 10,000 different players. In addition there are over 40 'Superstar' players with their own signature moves. You can build your own tournaments, participate in the MLS, Series 'A', EPL or whichever league takes your fancy.  As usual for a FIFA title, if you complete various tournaments, you get to unlock special bonus features that will remain nameless here.    You can also visit the hall of kits, or find out who was your teams top scorer last season etc. The CD also comes with a bunch of cool music tracks that make for a pleasant listening diversion. Lots of cosmetics that make for a nice fluffy package.   The first thing you will notice is that EA have redesigned the interface. The predominantly white interface of the last few years has made way for a new slicker gray and orange combo that adds nothing to the gameplay, but it sho' looks purdy.   Aurally FIFA 2003 is the best yet, the commentary is better than ever with John Motson again taking center stage, with former Scottish International Ally McCoist as his sidekick. McCoist has replaced Scot Andy Gray in the virtual hot seat this year, and does a bang up job. As expected, the pair combine well, praising or damning the players on the pitch depending on the performance. Motty gives the play-by-play coverage, while Ally chips in with interesting and accurate tidbits that give you a little info about the team or the player. Indeed, this version of the game seems to carry far more player specific comments than ever before, and hearing that El-Hadji Diouf is the reigning African player of the year after he has just scored for Liverpool really adds to the feeling of watching a live match.    Crowd chants are no longer just the boos, jeers or cheers of the previous versions. If you are hammering (or being hammered!) 3-0, the crowd launches into a taunting chorus of 'Three -- Nil, Three -- Nil, Threeee Niiiill' etc. It is a sound that can be inspiring or humiliating, depending on which end of the score sheet your team is occupying!   Additionally, EA have added team specific crowd chants this year, and hearing 'You'll never walk alone' roar round the virtual Anfield really got the hairs on the back of my neck tingling. Play with or against a French or Spanish team and you get the supporters chants for those teams. In fact there are at least 16 different teams with their own chants, a really neat touch that true footy fans will really appreciate.    This neatly leads me onto another cool new feature that get the pulse of every knowledgeable football fan racing, the virtual stadiums.   For the first time, 16 major club stadia have been accurately recreated in the game.   These include Old Trafford, Santiago Bernabeau, Olympiastadion, Stadio San Siro, Camp Nou, Highbury, Parc des Princes, Amsterdam Arena and my own personal favorite... Anfield. The home of the original Mighty Reds -- Liverpool FC.   This may sound like nothing more than a piece of eye candy, but it can actually have an effect on gameplay. Each of the venues are unique with attributes that can work to your advantage or disadvantage depending on your team. Highbury for example, is a smaller ground that is ideally suited to quick short passing movements, while the cavernous Camp Nou in Barcelona is a huge wide open stadium that is allows the teams to play longer passes into its wide open spaces.   The player control system works really well, although long passes are still something of a lottery; despite the pressing of the correct keys at the appropriate time, my players seem to decide by themselves if they want to contest the ball or not. The short passing game however is great, once you have mastered this facet, there is nothing more enjoyable than watching the opposition chase shadows as you ping the ball around, playing 'give-and-go', waiting for the right pass to open up before delivering the killer ball that leads to the sweetest of goals.   The player graphics are as good as ever, with the players moving, passing and looking like real football players, although some player's virtual counterparts look so ugly in this game they may want to consider a defamation lawsuit.    Another new addition is the choice of playing the game in 'Action' or 'Simulation' settings, unfortunately neither mode seemed that different and as the manual did not explain the difference, it seems like a waste of an option.    So far everything in the garden sounds rosy...the new enhancements work well and add to the atmosphere of the game, but into every life some rain must fall, so get your umbrella's ready, because there are a few downers in this game, and boy are they doozeys!   First up is the lack of full tactical control. There is still no true tactical control of the teams. I want to be able to give my players more instruction than the basic 'Select formation, select lineups etc' I want to create my own formations, I want to be able to tell certain players to push forward, some to hold back and if I want my 'keeper to come up for a corner kick at the end of the game then let me do it dammit!!!! When I see the amount of plays that get put into games like Madden, it really pisses me off to see EA so disrespectful to fans of a sport that is played by vastly more people. Football is a game that can be as simple as you like or as complex as you like -- I want to be able to make that choice!    It also seems that the infamous 'wrong player  - wrong position' bug from FIFA 2002 has reared its unwelcome head again. If you have a player injured or suspended, instead of just picking the next available player WHO IS SUITED TO THAT POSITION, the computer picks the highest rated player, regardless of position. There is nothing more disconcerting than starting a game and finding out that your Left Back slot is filled by a striker who cant tackle to save his life! This is stupid and can only lead me to imagine that the dev and research teams did not actually talk much -- or worse, they did not know much about football.   Following on from that, where did the Dutch go? Why doesn't the game have ALL the international teams? What the hell happened to Holland? European champs a decade or so ago and the original creators of 'Total Football', they now suffer the ignominy of not making into a video game because they didn't make it to the last World Cup??? And for that matter where is Wales? The same team that recently beat Italy 2-1 in a Euro qualifier also misses out. Perhaps EA don't think that the game is really going to do well in the Netherlands or in sections of the UK, so they decided not to bother with the teams from those regions.   Despite the fact that you select the game requires you to select your team before entering a tournament, you still have to select which team you want to control before playing the actual match. This is a nonsensical option to me. If I choose my team for a tourney, why on earth would I want to then select to play as the opposition?    The Auto Advance a Skill level option -- Nothing more annoying than selecting a skill level prior to a game, only to have the computer interrupt me half way into the game to tell me that I am either too good or too bad for that skill level. It spoils the flow of the game, if I want to play on a tougher level while I am learning, and am happy with taking a few beatings while I get used to the nuances of World Class Level, then let me do it without interruption!   What did you think of FIFA 2003?   Now some of the above bugbears annoy me because I am a football nut and may not raise the hackles of a non-footy loving Joe, but I think some will piss most people off. It's like EA thought 'How can we make this cooler' when they needed to be thinking 'How can we make FIFA better?'Glitches aside, FIFA 2003 is a fun footy game. Most of the changes from the last version are cosmetic, so if you are happy with the World Cup version then stick with that. Maybe one day EA will bite the bullet and realize that if they combine everything into one killer game once a year (World Cup, Club sides, European Tourneys etc) they will have a bunch of very happy customers.", "date": "Nov 1, 2002"}