{"name": "NHL FaceOff '03", "name_review": "NHL FaceOff 2003", "ref": "https://www.ign.com/articles/2002/11/05/nhl-faceoff-2003", "text": "Along with football, hockey is generally one of the sports that translate best into a videogame. The games are usually fast, intense and easy to pick up. Hockey games also provide some of the best multiplayer fun to be had with a couple of buddies on a Saturday afternoon while lounging on the living room couch. As with practically every other major sports genre, there are quite a few hockey titles that vie for gamers' attention each year. Once again, 989 Sports has put a new coat of paint on its hockey series and offers up NHL FaceOff 2003.   NHL FaceOff 2003 has a slew of new changes this year, some for the better, and some that are just different. The game boasts entirely new player models, which is a very welcome change from last year's outing. The game also has a Career mode now, which is a nice addition for those who like to play multiple seasons with a team. Players will retire when they're too old, rookies will be drafted, and free agents can be signed. It's a mostly simplistic approach to a franchise mode, but it's welcome nonetheless.   Gameplay  Individual player movement around the rink is generally decent, as long as you're alone. Momentum and turning feel like they should, and skating around the ice is easy and realistic. The game plays pretty fast, and there's a slider to adjust the overall game speed. Moving the slider all the way up makes the game so fast that it's practically unplayable, so there's enough adjustment for the speed setting that just about anyone should be able to find a comfortable speed to fit their liking.   While movement is fast and responds well from a singular player standpoint, NHL FaceOff 2003's main problem is that the game just doesn't play smooth once everything gets underway. The game plays very jerky, and it doesn't feel much like hockey. This includes the animation, but player-to-player interaction and puck movement is where it really counts, and the game has a fair amount of problems in these areas.    The puck constantly gets sucked into player possession, especially in regard to the goalies. It would be easy to live with the ~magic puck~ if it was only noticeable during replays, but it's very evident during normal play as well. It's almost as if players have their own gravity wells, and the puck is just naturally pulled towards it. Players will sometimes gain control of a puck even if it was passing behind them. The puck will just wrap around them to their stick, and off they go. Gaining possession is more a matter of being close enough rather than actually being in position. Another annoyance is that hard shots don't ricochet off players like they should. Instead, the player will just sort of catch the puck and be in immediate control of it. This includes shots that should knock into the back of someone's head.   As easy as it usually is for a player to absorb the puck, they have a hard time holding on to it, as the slightest tap from another player will usually knock the puck loose. The puck comes loose so easily that it's hard to hold on to it for more than a few seconds at a time with any one player. Player shots will also be halted by the smallest touch, so attempting to shoot while other players are around can induce a controller-tossing rage during a close game.   It's almost necessary to mash on the shoot button after taking the first shot until the puck is out of scoring position, just in order to stay competitive. The computer seems to do this, as its players will often one-time practically any rebound from the goalie, even if it's completely impossible for any human being to have reflexes that fast. Scoring also seems like a random event, since goalies will sometimes block sure-fire goals and impossible to reach shots, and other times miss shots that they should see coming from a mile away.   The goalies have some movement issues, as they slide from side to side in an unanimated fashion and block the goal like a wall. They jump from block pose to block pose in such an unrealistic manner that it becomes obvious that scoring is based on randomness, and not really whether the goalie was actually in position to catch a shot. Other times they'll ~block~ shots by having the puck get sucked into their gloves, as opposed to reaching properly for it.   The player AI doesn't seem to have improved much since last year, although it does things a little differently now. Players on your team will often try and be overly offensive by breaking for the goal, even if they're off-screen and you can't see them. This causes an insane amount of offside penalties, so the only way to prevent it is by constantly passing on your way up the ice. This forced passing is fine, as it makes the game seem more realistic than putting on a one-man show. The problem with it is that in order to curb the abundance of offside calls, you'll have to pass to someone off-screen and just assume they're there, and sometimes you'll just end up passing to nobody.   The main thing that's noticeable about the AI this year is that the computer has gotten a lot more aggressive. The computer's defense will do everything in its power to stop you from scoring, but your team mostly relies on you to do all the work. Your players don't do much on their own except for move into position and cause penalties. The game seems highly unbalanced since it usually feels like it's 5 on 1.   The computer will also perform some completely unrealistic passing and scoring maneuvers. There's the issue where it'll one-time every deflection from goal, but the computer can also pass from player to player at an ungodly rate. Three passes in less than one second can happen from time to time in this game.    Aside from the overpowering issues, the AI hasn't made many improvements in the strategy and general thinking department. They'll still be caught completely out of position many times, letting the other team make quite a few breakaways at goal. The AI also seems to suffer from lapses of reasoning on occasion, as they'll do things like skate past the puck without trying to pick it up. I've even caught them standing around a couple times, only to snap back into reality after a few seconds and begin playing again.   During one game, I tested the AI by not picking up the puck, and waited to see how long it would be before another player came over and took possession. Of course, none of my other players came to snag it, but two of the computer's players stared at it from within spitting distance for nearly 10 seconds until one of its other players came and picked it up.   The difficulty levels don't scale properly this year at all. Rookie mode is easy as should be, where goals come as often as you can dish them. But pumping the difficulty up to Veteran opens up a whole new can. This is where the computer starts using its overpowering advantage, and it's also where the game starts feeling cheap.   There are still a few things from last year that don't seem fleshed out or finished. For example, there aren't any stats shown when the stars of the game are announced. It would be nice to see why they were voted one of the three best players for the game. Also, after breaking a record, you still have to travel back to the main menu to see exactly which record(s) you've broken.   The game also has more than its share of bugs. Goalies will sometimes get ~stuck~ on their route to grabbing the puck, and even if they miss it, they'll just keep going, heading away from the net. Usually this results in a quick and frustrating goal. During one game, my goalie made it past center ice and was running relentlessly into the boards before the other team scored.   On more than one occasion, a shot at goal that should have missed wide by a few inches somehow wrapped around the pole, past the goalie, and into the net. But then, instead of ever crediting my team with a goal, the puck would pass through the back of the net and back out onto the ice where play would commence. Outstanding.   Graphics  Graphically, the game is a big step up from last year's edition, but it still doesn't look nearly as good as it should. First off, the player models are far better than they were last year, and it finally looks like the game is actually making use of some of the PS2 hardware. Player faces are reasonably detailed, and players have facial movements, like when they talk or growl at the camera.   While the players look a lot better overall than in last year's offering, texturing is a real problem, as jerseys look very drab and washed out. There aren't many details to them, like wrinkles or stitches, which make them look drab and unrealistic.    Player animations severely lack in move transitions, and only look worse once the replay kicks in. They'll jump almost immediately from a puck-handling pose to a slapshot setup, or go from skating to checking just as fast. The animations for most of these actions are pretty substandard also. Most of the animations are as simplistic as possible, and there isn't really any variety in any of the moves.   Controlling the replay camera is a tedious task unto its own. Replays have some sort of momentum, both when moving the camera around and rewinding or playing. For example, when trying to pan the camera to the left a bit, the camera will continue to move for some distance as it slows to a stop, well past where you may have intended to move it to. The same happens when trying to zoom, but to an often worse outcome; the camera will continue zooming after you release the stick, sometimes shooting right over the camera's focus, and wind up zooming out on the opposite side of the arena. The replay camera control is bad enough that it's difficult to set up the camera exactly where you'd like to see it, and almost impossible to move the camera as the replay is playing. Rewinding and fast-forwarding the replays have the same momentum problem, though it's not quite as bad as the camera control.   Sound  The game's commentary is one of its strongest points. The commentary seems to generally make correct and timely calls about everything, and it flows together pretty well. The commentators work well together and they sound like they work off each other. They do, however, call many normal passes one-timers, even during face-offs. Aside from this little problem, the commentary is generally decent.   The rest of the sound is pretty well done, also. Hard shots provide a nice crack, with just the right amount of reverb and other effects to make it sound like it's coming from an arena. The crowd noise could be a little better, but most of the action on the ice causes the correct audible feedback.  NHL FaceOff 2003 is still lacking in many areas. The visuals have been improved a good deal since last year, but that's not really saying much. Player models are much better, but the animations are still terrible. The player moves are all simplistic, and they have almost no transition time between them, resulting in a very jerky looking game.The game also plays very jerky, which in the end, is really the most important part. Players lose control of the puck far too easily, but then it gets absorbed by someone else just as fast, in just as ridiculous of a manner. Goalies are unpredictable as to what shots they can or cannot block, and the AI is too unbalanced to keep you wanting to play it for long.", "date": "Nov 5, 2002"}