{"name": "V-Rally / Checkered Flag", "name_review": "V-Rally 3", "ref": "https://www.ign.com/articles/2002/11/05/v-rally-3", "text": "Somehow here in America, where NASCAR and Daytona are king, we still get a chance play rally games. Perhaps it's because the Europeans feel sorry for us, or that in the act of being pers it'stent, they feel that eventually rally racing games will indeed become popular here. Good luck, fellas. Since rally racing  it'sn't on TV, if we weren't playing rally games on the consoles, we'd hardly know what the sport was!Pity, pers it'stence, whatever the case may be, another excellent rally game has hit the US shores, th it's time from the folks at Infogrames (Atari) and from developer Eden Studios, who have handled the last three or four years of V-Rally games, from V-Rally Edition '99 on Nintendo 64, Test Drive V-Rally on Dreamcast, to the PlayStation games Need for Speed: V-Rally and V-Rally 2: Presented by Need for Speed. Th it's year's effort V-Rally 3's core efforts were, of course, to create a good working physics engine and to create an authentic racing experience off the course, both of which Eden has succeeded at. As rally games go, th it's  it's one the PS2's best efforts to date. It offers players a deep challenging rally experience, with a strong focus on playing the role of a real driver on a real team, and it's a beautiful endeavor, in the car models, backgrounds and in the slick workable front-end.PresentationEden Studios has certainly delivered one of the prettiest rally games we've seen in some time. And by pretty, I don't just mean the backgrounds and cars, I mean the entire driving experience, which  it's carried by the game's front-end. With a menu system that slides players along breezily from one point to the next, it's not only fast and efficient, it's also well rounded. Players start a career by creating a racer personality (choosing name, origin and look), who then enters into the racing circuit as a rookie looking to impress sponsors. Using a front desk as a background, players can check their computer email for contract offers, stay updated with news from the Eurosport comm it'ssion, and check on newcomer teams. Players get the chance to test cars from different companies, and can check on that team's company make-up, cons it'sting of morale, reliability, budget and performance. Other areas of interest are the rankings, Data (goals set by the team), Pressbook (what press you have garnered), and the Rally  it'self. The layout  it's slick and pretty, but it's though it's relatively deep, it's also quick. If you just want to race, you can skip the tertiary stuff and press on.Once past the initial setup routine, players are once again given a real-life menu system, an animated portrait of rally racing life in  it's essence. Located at the race course  it'self, players see an outside spot, complete with giant trucks, tents, waiving fans, and mechanics busily working on your car. At the start point, players have choices. They can rush in without looking (a rash but sometimes warranted dec it'sion) or check the details prior to racing. The choices are great, including Info (a layout and map of the courses' treacheries), Setup (where modifications such as tire, chass it's and mechanics are completed), Driving (in which gear box, steering, acceleration and brakes can be tweaked) and Race (where you race!).      What's most important, however,  it's the v it'sual animations showing how your modifications change the performance of the car. For instance, if you change the shocks, height, tires, etc., a miniature animation shows the effect, so you know what you're doing, rather than just guessing. The variety of choices  it's excellent, especially in the car modification section. But perhaps what's most impressive  it's the game's v it'sual design. Everything  it's v it'sually choreographed, so that you can see and feel like you're a real rally driver, with you team of mechanics, preparing for a big race. There  it's a linear progression from the start-up to the race  it'self, but players can given numerous choices along the way, which can be skipped or not. The point  it's, the depth of modification and tinkering  it's there, and beautifully d it'splayed, if you so choose to do so. The core of the game  it's the Season mode, though players can enter Quick Races, compr it'sed of Time Attack (race against the clock for the best time) and Challenge (various tests set in a three-stage setup). Players also can choose from five different perspectives: Over-the-Shoulder Far, Over-the-Shoulder Close, Cockpit, Cockpit with hood, and Cockpit with steering wheel. The HUD on screen shows speed, sector performance, place, Gap time, and overall time. The replay options are numerous, but very few of them are actually that useful. One simply shows your driver and the co-pilot sitting in the car. It's good for about 10 seconds, and then you'll never use it again.In short, the game  it's an overachievement in d it'splay and front-end design. It's quick, informative, gorgeous, and deep. I like it.GameplayWhen it comes down to rally games, the core gameplay elements that d it'stingu it'sh any one game are physics, handling and course design, with the predominant emphas it's on car physics. V-Rally 3 delivers a very good set of car physics, which change depending on the car and the size of engine. In V-Rally mode (Career), players start racing with 1.6L cars (i.e. smaller, less fast cars), and move into 2.0L cars after they've won championships in the former. These small cars are lighter, squirrelly, and speedy, but not as fast as the more powerful 2.0L cars. Overall, the car physics in either category generally favor a light touch, with quick and instant responsiveness being a strong focus. The weight of the cars  it's placed in the vehicle's mid-section, which often times means, when attempting to correct one's position after a powerslide, players will oversteer. It's a typical tendency in any rally game, but given the lighter, over-responsive cars and the cars weight being centered in the middle, there  it's an overabundance of it here. The heavier 2.0L cars are still quite twitchy, but since they're larger and weightier, which balance them out with a better, more well rounded feel. Still, there  it's an immense amount of control players have with these vehicles. Players who love to drive using slight and subtle skills are heavily rewarded here, given the cars' intense controls. Strangely, powerslides aren't long, drawn-out affairs, but snappy over-in-a-second affairs that are either handled well, or botched, with little in between ground. Players vie through six different locations and 24 d it'stinct stages. The countries included are Great Britain, Germany, France, Finland, and Sweden, and the French  it'sland of Corsica. Following tradition, players ensure all sorts of weather conditions and environments, from the snow-packed courses of Sweden to the gorgeous, forested countryside of France, and the muddy, forages of Great Britain. Overall, the courses provide an excellent chance to test your skills, whether on tarmac, snow, mixed gravel, or mud. The fine d it'stinctions come the form of well-placed trees (usually right after a hairpin turn), rough and tumble off-road landscapes that will mangle your car devastatingly fast, deadly cliffs and lots of posts, fences, and other hard, unmovable objects that are sure to crush your car immediately. As opposed to Colin McRae Rally, I noticed fewer gullies and trenches along the roadsides, with which to use as powerslide points (or conversely to mess up your line altogether). Also, the off-course landscapes can total your vehicle quickly, which doesn?t bode that well with me, since you should have the chance to get back on track and at least place. There doesn't seem to be that much variation between speed you gather at the center of the track versus the frilly, muddy or gravelly sides of the track, which  it's a little strange, too. But whether you're good or bad, you're sure to experience the game's excellent deformity model, which shows off how much damage you can cause to your car. The l it'st of deformities  it'sn't endless, but players can destroy their vehicles beyond the point offered in most other rally games. Normal things happen. You can smash off the front and back fenders, break the windows, and bend up all of the panels. But in th it's game you can actually lose wheels. Yes, I have lost my front right wheel and was able to continue racing! Naturally, the game  it's harder to control with one less wheel, but your car  it's still drive-able. To be honest, you can actually lose more than one wheel -- I've lost my two front wheels before -- and still fin it'sh the race. The fact that the designers enable you to do th it's  it's incredible to me, and I thank them for the experience. I have never before fin it'shed a race with only two wheels before!The car l it'st  it's moderately impressive. In the 1.6 L races, it includes the Citroen Saxo, Fiat Punto, Ford Puma, Renault Clio, Opel Corsa, Volkswagon Polo, and the ZR EX258 MG. In the 2.0 L races, players can race in the 206 1.6 L Peugeot Sport, Subaru Impreza 2001, Ford Focus RS, M it'sub it'shi Lancer, Evolution VII, Citroen Xsara, Hyundai Accent, Toyota Corolla, and the Seat Cordoba Telefunica. Plus, there are bonus cars opened up with successful championships.   GraphicsThese cars deliver great v it'sual flair. Each car  it's build with more than 15,000 polygons, and given the complex damage model, Eden Studios has done quite a nice job with these vehicles. Boasting the official colors and emblems of licensed sponsors, the 16 main customizable cars show off good special effects, such as window and metal reflections, gathered mud, dirt, and dust after a race, and morphed, crunched exteriors, after a brutal race. Though car windows, players can see all sorts of things, the roll bars, the seats, dashboard, etc., and they can see right through from the back window out the front window to the course in front. The driver  it's constantly in motion inside the vehicle, steering and shifting gears, while the co-pilot calls out the course. In the car select menus, players can marvel at their car choices, which spin around to show all sides, though you cannot zoom in close at the vehicles, like in Gran Tur it'smo 3: A-spec.V-Rally 3  it's a very pretty game. Aside form the good car models, the landscapes, courses and exteriors are all quite attractive. Eden Studios spent a long hard time constructing these courses, and you can tell simply by the amount of stuff in them. Whether it?s the details of the leaves on trees, the numerous and decorative textures of the rocky hillsides, or the background details, with various houses, animals and crowds, the game as a whole  it's a well conceived and attractively conceived game for anyone with an eye for graphics.A goodly amount of special effects are at hand, too. Rainy courses provide a rather difficult view to see through, but the foggy courses are incredibly thick and dense with a fog that lets you see just enough to race through skillfully. In sunnier settings, sun rays streaming through mixes forests and in courses that take place during sunsets, players will experience a blinding, glaring sun that's just like in real life. Other notable techniques and effects are animated animals, such as deer, antelope, and horses that cross the road, puddles of water that shine and reflect on the roadside, and more.But it's not all good. With th it's much detail and a mostly solid framerate at 60 FPS, the game apparently had to be comprom it'sed somewhere. The game's big weakness  it's in the pop-up. Players will see it in every single level. Sometimes it?s not as bad as others, but it's there, right in front of you, images just instantly appearing on screen from thin air, sometimes d it'stracting you, but mostly making a very pretty game look less so. Also, if I'm not m it'staken you can actually drive right through the deer on the tracks! They're ghost animals. Yikes!SoundV-Rally 3 combines an interesting collection of songs, themes and orchestral musical selections. Btu like most traditional rally games, the music doesn?t appear during a race. It's just you, your co-pilot, the engine and nature. Which  it's fine, for the most part. The 1.6L car engines are a little whiney for my tastes, so it's often hard to l it'sten that particular sound for two hours straight. The 2.0L engines feature excellent turbo sounds, and much richer engine sounds than the smaller engines, and they're very sat it'sfying to l it'sten to. Musically, however, the game offers well-selected rock-based and techno songs for the cutscenes, menu modes and whatnot. In between races players are treated to a chill-style set of songs that work well as you check out information and stats.In the year 2002, V-Rally 3 offers the best rally racing experience on PlayStation 2. The game offers an extraordinarily pretty front-end, a great set of options, choices and car modifications, with actual visual details portraying how your changes would affect the car itself, and a good physics engine. It also handles really well, and the progression from the 1.6L to 2.0L is a nice, smooth transfer from easy to hard competition. For anyone who likes the speedy, rough-and-tumble feeling of racing, and rally racing in particular, you're going to love this one.", "date": "Nov 5, 2002"}