{"name": "Kakuto Chojin", "name_review": "Kakuto Chojin Review", "ref": "https://www.ign.com/articles/2002/11/05/kakuto-chojin-review", "text": ", Microsoft's rarely spoken of and scarcely seen fighter, was originally a tech demo.  Showing off the power of Xbox with fast-as-lightning fights that hold a consistent 60 fps, offer specular lighting, and feature colorful particles floating about (you can even see a fighter's breath in cold arenas), there's no doubting Kakuto Chojin is visually proficient.  However, in the transition from tech demo to full game, someone forgot to add vital elements of presentation, leaving the game feeling empty and soulless.    Features  13 fighters to take to 13 arenas in a fight to the finish Take on three friends at once in two different multiplayer modes (also includes one-on-one Versus Mode) Each fighter has two different sets of moves Fast action fights at 60 fps 5.1 Dolby Digital support  Gameplay Kakuto Chojin tells the typical fight game story about an underground tournament sponsored by a wealthy ne'er-do-well offering to give the winner the one thing they most want.  The world's best ass-kickers gather on Drasuka Island to duke it out in a Fight Club-like atmosphere.  Each character is there for their own reasons with hopes for their own prize.  In fact, some characters even have a history with one another.  But you'd never know that from the game presentation.  There's no intro saying ~Hey, there's this tournament at Drasuka Island, blah blah blah,~ no cut-scenes between fights showing one fighter's dislike for another or to set up story elements, and no ending cinematic.  Beat all twelve contestants, win the tournament, and you get some scrolling text telling you how things ended.  This is Dream Publishing's idea of a Story Mode.  You shouldn't call something story mode if there is no story.  Arcade mode would have done fine.  But here's the dumb part.  These players entered the tournament, promised a prize from the host.  But some of the endings don't even have them getting a prize.  Like Rena, for example.  She wins and Roxy, another contestant, tells her the truth about her father.  She then turns the dad in (all text... fun!).  So, uh, what about the prize?    This is Kakuto's biggest issue.  Not just a weak and almost non-existent Story Mode, but almost non-existent presentation.  Options are extremely limited, the menus are about as simple as can be, and the only extra is one unlockable character/stage.  A fighting game can overcome such shortcomings with a solid fight engine.  On the surface, Kakuto seems to have this.  The moment you hop into the game, you are pulling off a string of fluid combos.  But the longer you play, the more evident the shallowness becomes.  Rather than using the now more standard punch, kick, and grab buttons, Kakuto Chojin goes old school with the Y as high attack, X as middle attack, and A as low attack.  The B button is the special attack button and acts as pressing all three buttons at once.  The left trigger offers free movement (you can truly run around the arena freely if you want) and the right trigger guards and also acts as an attack modifier.    Moves are rather simplistic.  You won't find fireball moves or anything that requires a great deal of rhythm.  Most moves are just button combos with the occasional single-direction press.  A few moves require left-right plus a button or down right, but not many.  The only real complexity comes with some of the modified moves.  You may need to attack high, then hold down the right trigger and attack middle-middle.  But even this becomes simple after a little bit of practice.  The special button is useful in two ways.  You can do a special attack, signified by green fire around your feet and hands, or you can gain a speed boost.  This boost will actually help perform certain combos and you may need to even speed boost in the middle of a combo.  Those are the only really tricky combos.  Add to this the fact that your special meter must refresh before you can speed boost again and you can see that several combos simply won't be available because you won't have any special meter available.  This means you have to be accurate with your speed boost combos the first time out, since you'll have to wait for a recharge before you can try one again.  Blocking is simple enough.  Right trigger guards and you can crouch to block low shots and duck high attacks or stand and guard for mid-range blows.  There are some attacks which can't be blocked, which you'll find out on your own.  Guarding isn't hard at all, but it's vital on the hardest difficulties.  One nice thing is that every battle ends with a slow-motion finish.  The final blow comes out super-slow with surprisingly dramatic effect.  You'll see some clipping here most of the time, but that's an acceptable trade off for a good ~ooh~ and ~ahh~ moment.  On the surface, the combat system seems good.  But that quickly fades.  However, each character in Kakuto Chojin has two fighting style sets, Dream Publishing's only real offer of replay value for the single-player mode.  At first only the Kakuto style is available, but beat the Story mode with a character and their Chojin style unlocks.  This is a completely different set of moves.  The catch is you have to choose one style or the other before a match.  So you can't mix Kakuto and Chojin styles, which would have been far more interesting.  Each style set has about 50 moves, so there is quite a lot to learn for each character, but none of it will take even a moderate fighting veteran long to master.  While it's cool to have an extra set of moves opened, it seems to be only half a reward, since you can't mix and match the two styles.  Why not allow a true extension of the character and not just a separate set of skills?  Fights on Normal difficulty are short and to the point.  The AI is pretty limited here and it's incredibly easy to just button-mash your way through the game.  However, kicking the game up to Very Hard or Extreme difficulty provides more of a challenge.  The AI simply blocks 80% of what you throw at it, but hey, fights last longer and it is more of a challenge.  Many fights tend to be under thirty seconds a round.  And though the arenas are enclosed, there are a few spots where you can ring out an opponent.  But these instances are rare.  That's a good thing, because ring outs look awful.  You ring someone out and they fall into nothingness for a few seconds.  ~You win,~ the announcer says drolly.  Well, of course they should say that, though it'd be nice to see a ~Ring Out~ indication of some kind.  And the falling into a black void looks more like a bug than a design decision, which is a bad thing (in case you weren't sure).    Multiplayer Multiplayer is where fighters live and die, though.  With good multiplayer, you'll still be playing a fighting game two years down the line.  I don't think many people will be playing Kakuto Chojin into the new year.  There are three modes of play in multiplayer:  Versus - Take a friend on one-on-one in any arena Battle Royale - Take up to four characters into an open arena for a last man standing contest Capture the Crown - Fight to see who can wear the crown when time runs out  Problems are evident from the start here.  Fights are, as I've stated early, very short.  Most fighters let you increase the health meter of each player so fights can be longer.  But not Kakuto Chojin.  You're stuck with what you've got.  That also means there's no handicapping, so if one friend is a master, there's no way to balance the game so that it's a fair fight.  Versus Mode is just dandy.  There's no slowdown and you get all of the cool little particle effects from Story Mode.  It's standard fight stuff here and it works fine.  Fighting your friend is actually much more enjoyable than working through story mode, but you have to be careful of the cheese factor.  You can get lots of cheap hits in Kakuto so be ready to be abused if your friend catches on.  Battle Royale is what we've been wanting in a fighter.  It's four players going head-to-head all at once.  The camera is pulled back 3/4 view, but that's fine.  There's no slowdown at all and the fights can get hectic.  However, all of these battles take place on flat, uninspired arenas that simply change ground textures.  A bit weak and almost feels like the mode is an afterthought.  Also, a team mode where you can go two-on-two would have been great, but then a lot of things would have been great were they included.  Finally the Capture the Crown is a flawed idea from the get-go.  See, there's a crown and the idea is to be wearing it when time runs out.  However, it doesn't matter who has the crown until the very last second.  So the strategy is to wait, let everyone fight, and then get a quick attack in on the crown-wearer and pick it up at the last second.  What makes more sense is what just about every other version on this mode does -- whoever wears the crown longest is king.  Crown goes against the presentation of KC.  Kakuto Chojin is meant to be a gritty Fight Club.  Why not have multiplayer games more representative of this?  Instead, you get a sort of cutesy multiplayer game more fitting Kung Fu Chaos than a down and dirty fighter.  Maybe King of the Hill would have been a better choice.  In any event, it's a fun game a few times through but it gets old quite fast.  Graphics There's no denying that Kakuto Chojin is a gorgeous fighter.  The design was right on with the decision to make the game distinctly underground.  Character's are not glamorous, they are dark, dirty, and sweaty.  The girls aren't swimsuit models, they're total skanks.  Sure, they may still be hot with their bobbling boobies and their big green eyes, but these are hoes, not divas.  The arenas are small but highly detailed with some great textures, reflective floors, and various particle effects.  One area has snow and you can even see each fighter's breath as they battle it out.  Hair sways, snow falls, and everything moves at a consistent 60 frames per second.    While the fight animations flow together well, some of the idle animations look a bit too fast and too hyper.  Still, characters generally look realistic and the overall appearance is one of ~wow.~  Dynamic and specular lighting are in effect, so character bodies take on the hue of surrounding colored lights and are shiny from sweat.  As cool as this is, the color palette mixed with shiny bodies makes players sometimes look like their made of plastic.  Perhaps a bit too heavy on the lighting effects here.  There's self-shadowing in the victory animations but not during a fight.  That's okay, because 60 fps does more for than game than some self-shadowing.    A good looking game worthy of it's original ~tech demo~ status.  Oh, and gotta love the fact that they put Brad Pitt in the game.    Sound For a game wanting to be an underground skin-to-skin fighting experience, the sound effects in Kakuto Chojin make no sense whatsoever.  Kicks and punches offer cartoon sounds.  Um.  Yeah.  Instead of having loud skin smacks and brutal hits, you get things worthy of a Capcom 2D fighter.  That's great for Capcom Vs. SNK but it's totally out of place here.  Yes, the game does feature 5.1 Dolby Digital, but it's hardly worth the time.  The music is standard fighting fare and nothing memorable.  And there's no customizable soundtrack, which makes no sense for a first-party game.  You make a first-party game, it better utilize as many features you hype to the public as possible.  That's just lazy.  On the plus side, each character speaks in their native tongue, though everyone has only two or three lines of dialogue. I'll say this for Kaukuto Chojin, it's fun on the surface.  However, the fun wears off quickly once you realize that's all the game has to offer.   Microsoft has made a fighter that will hold your attention for a few minutes, but that's about it.  The fighting system is too shallow and the multiplayer could have been better.  The lack of options is disappointing, but nothing kills this game more than the absolutely piss-poor Story mode.  No cut-scenes at all, no interaction between fighters that has any meaning.  The game has no set-up and no knockout punch.  It seems more a fighter made simply to have a fighting game out there.  Kakuto Chojin will please some, but any real fight fan will find it far too easy and get bored with it far too fast.  Technically solid, but Kakuto Chojin lacks the spark of a great fighter.  It has no soul.", "date": "Nov 5, 2002"}