{"name": "The Flintstones: Big Trouble in Bedrock", "name_review": "The Flintstones", "ref": "https://www.ign.com/articles/2002/11/06/the-flintstones", "text": "As the sequel to an obscure SNES game, or as a port of that game, or as an entirely new game unrelated to that old game ... honestly, I have no idea what this game's lineage is or what brought it to being to kill me with frustration, but as THAT game, this one doesn't have a lot of expectation or anticipation behind it. An unfavorable review may not be fair to a game that, with a 30-year-old license that doesn't really have cool dinosaurs in it (maybe if it had dinos, kids'd love it, but this game doesn't really even do much cool with Dino, much less dinos), doesn't need much said about it. If, however, you are choosing a present of either Flinstones bedsheets, Flintstones Underoos, or The Flintstones: Big Trouble in Bedrock, I'd have to guess that this wearying and corny game may give them the least comfortable sleep. It depends on what size Underoos you get...  Features  Dr. SinisterTM returns to battle Fred Flintsone Traipse through 4 Flintstones worlds  Only for Game Boy Advance   As told in the game's cinematic screens (the first few of which are screen grabs from the show ... literally -- they have the washed-out NSCT colors and fuzzy quality of a screen grab in desperate need of some PhotoShop care), the sinister Dr. Sinister did not die when his base exploded the last time he faced Fred Flintstone. Of course, if you're wondering who this Dr. Sinister is, you should probably remember him from the last time I mentioned his name in this paragraph ... oh, and in the feature list before that. Otherwise, I can't imagine that you'd remember this Dr. Sinister character from whatever the heck he was first in -- the previous Flintstones game, or the TV show, or maybe the direct-to-video The Jetsons Meet The Flintstones? I haven't a clue. If it's any hint, the game features The Great Gazoo -- the preppy green imp that made you stop watching The Flintstones, so perhaps this Dr. Sinister is from the same never-watched, never-enjoyed era? Anyway, he's back (as the manual puts it, ~Contrary to popular belief, Dr. Sinister didn't die when his base exploded~, so you figure it out from there) and has kidnapped Barney Rubble to destroy the Flintstones. To save him, Fred will have to butt-bounce and platform-hop to collect clams in 12 stages. Oh, and he'll also have to save Barney. But mostly, the clam collecting.  The platforming control of The Flintsones: Big Trouble in Bedrock actually isn't too bad, although it does have that stiff and heavy kind of control that seems to be a standard in prehistoric games. Fred moves around pretty well and can bound about when he needs to. It's the stages that they set these platforming challenges in that's no fun, as the game is filled with cheap hits and blind jumps that, while rarely dropping you into a bottomless pit, do leave you stuck in the pit of despair. The game's myriad floating platforms wind all over the stages, meaning that if you fall once, you'll often have to run the entire stage over (it's just as well that you didn't die -- respawning after losing a life also takes you back to the very beginning of the stage every time.) You're constantly getting nailed by enemies you couldn't see or finding yourself missing platforms because they don't follow the normal ~logic~ of floating platforms (stages have so many floating platforms and spinning platforms and sliding platforms on top of one another as if there's supposed to be two stages in one).  The graphics have that blocky, single-color look of the show -- except for some pretty bad edges on tile textures that fit together at odd angles, the game does it's job in the vusual department with little fanfare but also few complaints. (That is, except for the blind leaps, but it looks as if the developers at H2O actually tried to deal with the problem, since the viewpoint will often shift a little bit down or back to help you figure out some gaps. It's just never enough -- they probably gave up when they realized how silly the project was turning out to be.) It does have a bit of an identity crisis, however -- the first level is filled with dinos to stomp on and rocks and other Flintsones staples, but the second Wild West stage doesn't seem to fit with the show (and neither do the spindly cowboys or even the prehistoric pigs). But that's nothing compared to the audio, which isn't even in the same Stone Age as the original Flintsones music and sound effects! The score is somewhere between music from Rugrats and grade school jazz band -- there's not even a MIDI version of the theme. And though the game is packed full of cartoon sound effects that come off pretty well, it's obvious that they didn't have the rights to get the actual Hanna-Barbera sound effects, since the noises don't have that canned quality that sat naturally on top of the show's laugh track.   There's aspects of this game that actually make me question whether they intended this game to be fun. For instance, the weapons you collect in the game can only be used for about 10-20 seconds, then they go away. They're almost never in your hands when you want to use them -- of course, you can just butt-bounce a baddie, but what's the point of having keen prehistoric head-whackers like clubs and bowling balls if you hardly get to use them? Also, there's no save. It's always great to see a kids' game without a password ... but not when there's also no battery. Trust me, if you didn't enjoy the opening stage on your first play through, you won't like it any more on the many more times you'll have to play it whenever your batteries die or you turn off the game in aggravation. There's also no way to quit out of an already-played stage -- not a big detail usually, but that means you'll have to play the entire dang stage if you end up going back for items you missed or for some extra lives. (Unless you do what I did and choose ~QUIT~, assuming it'd quit out of the stage and instead find that it quits all the way out to the main menu without letting you continue ... in that case, you won't have to worry about that stage ever again, because you'll quit playing.)", "date": "Nov 6, 2002"}