{"name": "Snowboard Kids", "name_review": "Snowboard Kids", "ref": "https://www.ign.com/articles/1998/03/17/snowboard-kids", "text": "Before reading any further be warned: if you're looking for the most realistic snowboarding game on the market this isn't it (see our preview of Nintendo's 1080 Snowboarding). Snowboard Kids (dubbed Snobo Kids in Japan) is, however, a solid title that incorporates the graphic and gameplay styles of Mario Kart into a snowboarding environment.  The result is a satisfyingly cute snow racer that's sure to please gamers more interested in a simplistic shreddin' experience than a realistic one. If you like Mario Kart and co. -- this game is for you. The facts   64 Megabit cartridge (8 Megs) A total of 9 racing courses, plus a half-pipe stunt track One to four players simultaneously (split-screen mode) Five selectable characters plus one hidden Multiple gameplay modes, including time attack and tricks The ability to earn new snowboards   This game can be described in five words: Mario Kart in the snow. It's that simple. With cute, kiddie characters, overly colorful worlds and an emphasis on racing and sabotaging the competition (rather than competing for stunts and air) it's the perfect alternative to 1080 Degrees Snowboarding.   Like Nintendo's shredder, Snowboard Kids offers players a variety of selectable characters, each with their own strengths and weaknesses. Where the two games differ, though, is in the graphics department; whereas the characters in 1080 are modeled to be as realistic as possible, Atlus' crew of kid boarders takes the opposite route; sporting huge, almost obscene noses and super-deformed bodies, they eclipse even Diddy Kong racing's disgusting cast of mutants as most nauseating characters yet seen for the console. On the other hand, each boarder is well balanced in relation to the rest of the bunch. One might be fat and slow, but able to take corners easily and another might be super quick and totally out of control. It works out evenly.  Graphics: Like Diddy Kong Racing, the levels in Snowboard Kids are extremely colorful and smooth. We're not sure if developer Racdym is using Rare's patented RDA (real dynamic animation) technology to enhance Snowboard Kids' graphics, as we're not sure if RDA does anything at all, but something has definitely been executed right. In single player mode there is absolutely no slow-down and the courses, which vary from snow-filled mountains to grassy hills, watersides and even city streets, look almost as good as Rare's kart racer. Colored textures give the impression of illuminated caves and snow that reflects the sunset -- the same technique used in Midway's Quake.  Gameplay: Take a guess how the game plays. Go ahead, take a stab at it. We'll give you a hint. It plays like  -- only with snowboarders. Still haven't gotten it? OK, the game we're referring to begins with ~M,~ ends with ~T,~ and has ~ario Kar~ in the middle. And just like Mario Kart, Snowboard kids moves at medium-paced rate -- not too fast, but not too slow. Only instead of racing through mazed tracks, snowboarder shred down snowy mountains while attempting to knock the competition out of place with various weapons. There are frying pans that can be thrown into the air, smashing down on all opponents for a time loss; ghosts can be deployed ahead of the pack, slowing down whoever happens to be in first place; the competition can be turned into snowmen, which spin to a stop; and there is even which will entangle the opposition in a parachute and then send them flying into the air. Simplistic stunts can be performed off jumps for added points while racing, too. The object of the game, of course, is to finish first.   Control, on the other hand, is very different from Nintendo's racer (and Rare's clone). Instead of accelerating with a button, you naturally gain speed and edge around turns by pulling down on the stick. You use the buttons on the pad to jump and pull off tricks, or use the defensive and offensive items to win the races.  But Atlus has also included options for those who don't care about who wins the race, but rather how it's played. There are racing modes for points, a half-pipe stunt track which rewards tricks, and even a mode that lets players shoot targets while racing.   Sound: There are a number of memorable midi tunes (in stereo), and the overall music fits the nature of the game. The game won't be remembered for its sound effects or music, but it's never inappropriate or annoying.  Multiplayer: Up to four players can race simultaneously and this is where the real fun begins. Believe it or not, the four player mode is actually better than the two-player game -- we're not sure why. Framerates suffer a bit here and there, but all is forgotten after successfully sending a friend head-first into the snow with a frying pan. The four-player mode still isn't as good as the likes of Mario Kart, but it is satisfying and fun all the same.There is a thick line separating 1080 Snowboarding from Snowboard Kids. The Atlus published title does have a few problems in the originality department, particularly its Mario Kart-esque gameplay and graphics as well as its occasionally lackluster multiplayer mode, but we recommend it all the same. You own Mario Kart and Diddy and want a similar gameplay experience with a twist? Get this game. If cute snowboarding sounds appealing to you then you won't find any better than Snowboard Kids. A solid entry from first-time N64 publisher Atlus.", "date": "Mar 17, 1998"}