{"name": "Game & Watch Gallery 4", "name_review": "Game & Watch Gallery 4", "ref": "https://www.ign.com/articles/2002/11/11/game-watch-gallery-4", "text": "Years before the Game Boy Advance, the Game Boy Color, and the original Game Boy, Nintendo flooded the marketplace with one-shot handheld games in what was called the ~Game & Watch~ series. Nintendo released dozens of these generically titled things, most of which were released a few years before the company struck it big with the NES system. Game & Watch Gallery 4 is the first compilation of these games for the GBA system, bringing to life many of the ports and remakes that were previously available on the Game Boy and Game Boy Color. The package is deceptively thorough, filled with tons of extras that must be unlocked by expertly playing these simplistic games. But only a couple of these titles in this compilation are of the ~addictive~ quality; most of the games in Game & Watch offer just a slight tickle of nostalgia before becoming old and tedious a couple of minutes in.  Six unlocked games More than a dozen hidden games Extensive gallery with music tests, museum, and message boards Link cable support for two players (single and multiple cartridge support) Cartridge save (one slot, save anywhere) Only for Game Boy Advance Game & Watch Gallery 4 starts out as a compilation of six games that were originally released as one-off LCD titles in the early 80s. Each of the six games (Fire, Boxing, Rainshower, Mario's Cement Factory, Donkey Kong Jr. and Donkey Kong 3) are accurately represented in their original form on the Game Boy Advance, right down to the clever representation of the old-school stencil layout peeking through the glass. Boxing is a simple task of dodging and counter punching the computer-controlled boxer until he's knocked down. Fire is a ~Breakout~ game where players juggle plummetting victims to the safety of the firetruck. Rainshower challenges players to shift four clotheslines so their shirts don't get a drop of rain splashed on them. Donkey Kong Jr. (my favorite) is a romp through a one-screen level, where players leap over Mario's hazards to unlock the caged monkey dad. Donkey Kong 3 is loosely based upon the arcade game, where Mario and Donkey Kong duke it out with bug spray, trying to push bees towards each other with the blast. And in Mario's Cement Factory, players will have to make sure the cement doesn't overflow in the four different bins along the sides of the screen.  Like the previous Game & Watch Gallery series on the Game Boy Color system, the six games are also recreated in a more contemporary fashion using Mario universe characters in the place of the generic Game & Watch graphics, all while keeping the same gameplay feel of the original. The graphics are a definite step up from the Game Boy recreations used in the past Gallery games, but the gameplay is not much more than basic mini-games without any real goal than to score as many points as possible.  Nintendo's advertising of ~Six games in one~ is far from the truth. In fact, there are way more than six games hidden in this package. There are actually 11 classic/remake Game & Watch games, as well as nine different stand-alone Game & Watch games to discover. It's just a matter of you, the gamer, willing to endure the slow-paced nature of these games to earn stars that will unlock the hidden trinkets. Every 200 points you score in a game will net you a star...but to earn all five stars in a game you'll need a whopping 1000 points in a single sitting. That's a real exercise in endurance, since many of these games are extremely slow-paced and take a good five minutes to actually get challenging. By that time there's a good chance you're ready to move onto the next game or quit altogether. Thank god for the instant save feature.   As much hidden stuff Nintendo jammed into this cartridge, it would have been much more interesting had the designers actually included a bit of history detailing each of these games in the pack. Instead, the ~museum~ in Game & Watch Gallery 4 is just nine basic games without any information that gaming purists would actually find interesting. To its credit, two games, Donkey Kong 3 and Boxing, offer single cartridge multiplayer that take almost no time to upload to the cartridge-less Game Boy Advance system...which definitely shows just how ~mini~ these mini-games are. I'm scoring Game & Watch Gallery 4 in the ~good~ category mainly because this is a package jammed near bursting with a lot of stuff to unlock and play. You definitely get your money's worth, just as long as you know exactly what you're getting into. Old-school gamers will probably adore just how accurate the classic Game & Watch games look on the GBA system. The original series of games aren't deep by any stretch of the imagination, nor can the remakes really stand the test of time with the standard Game Boy Advance games. But just as long as you're not looking for anything deep or engrossing, Game & Watch Gallery 4 offers a huge array of simplistic games to discover.", "date": "Nov 11, 2002"}