{"name": "Sonic Mega Collection", "name_review": "Sonic Mega Collection", "ref": "https://www.ign.com/articles/2002/11/12/sonic-mega-collection", "text": "Only via Sonic Jam and Sega Smash Pack Vol. 1 has Sega compiled some of its greatest hits into one complete package. Of course, with Sonic Adventure 2: Battle becoming a million-seller on GameCube, it didn't take long for Sega to announce it would give all those Sonic fans a little more to love. Sonic Mega Collection was revealed earlier this year and now it's arriving just in time for the holiday season. The main draw is the inclusion of seven perfectly emulated, and sometimes improved, Sonic-themed games. Additionally, fanatics can unlock five bonus games, a few of which are fairly eccentric. It's a wonderful little collection that, while not perfect, is a great value.   The Facts  Seven of your favorite Sonic games, perfectly emulated: Sonic the Hedgehog 1, 2, and 3, Sonic & Knuckles, Sonic Spinball, Dr. Robotnik's Mean Bean Machine, and Sonic 3D Blast Five unlockable bonus games including more Knuckles action and some oddities such as Ristar Perfect emulation with a few minor improvements Read a full Sonic comic, and check out over 100 of the covers in high-res Tons of extras: high-res art, Sonic CD intro and outro, as well as a history of Sonic Some drawbacks to video compression Retails for $39.99 MSRP   Gameplay The collection that Sega has put together here is certainly the best compilation to grace GameCube yet. It's chock full of some of the best Sonic games as well as a number of odd bonus Sonic-related titles you can unlock. It's no secret that the lighting quick action offered up in Sonic the Hedgehog is still irresistible to this day. In fact some even prefer the originals to Sega's recent 3D attempts. So, Sega has included all three of the originals. And, in addition to those, we have Sonic & Knuckles, which is as good as its brethren. They're all perfectly emulated, and the two-player mode in Sonic the Hedgehog 2 has even been cleaned up to run at a more full resolution.   However, up to that point, you can basically get the same package with Sonic Jam on the Saturn. Where Sega adds to that is Sonic Spinball, Sonic 3D Blast, and Dr. Robotnik's Mean Bean Machine. Sonic Spinball is basically pinball, Sega-ized. You knock Sonic around decked out, multi-tiered pinball machines to earn points. It runs basically how it did on the Genesis -- choppy and slow. There've been no improvements there, which feels a bit nostalgic, but it's nothing we can commend them for.  As for Sonic 3D Blast, if you've never played it before, it draws inspiration from what was accomplished in Marble Madness and tosses Sonic onto a prerendered 3D background. There's a bigger sense of movement and you're not limited to linear paths, but it's also a pretty large departure from the Sonic style. This makes it a perfect fit for the collection, however. The same goes for Dr. Robotnik's Mean Bean Machine. Sega spun off the evil character into his own Puyo Puyo inspired puzzle game, and it adds a little diversity to the collection here.   We were disappointed that Sonic CD didn't make the cut, but you can see remnants of it in the extras list. Available in the movie clips section, you'll be able to access the full-screen introduction and ending to Sonic CD. There's also a Sonic Adventure 2: Battle and Sonic Advance 2 video -- kind of filler inclusions. Additionally, you can view the History of Sonic, which documents many of the mascot's big appearances. We were happy to see the various footage, but the compression was not handled well. In the History of Sonic, for example, it's very difficult to read the text scrolling across the bottom of the screen because it suffers from artifacting. Furthermore, the history only covers the main titles in the franchise, and rolls by a list of the fringe Sonic games at the very end. On a more positive note, Sega has gone ahead and eaten up a ton of space on the GCN disc to include a full high-res comic, which is crisp and readable if you zoom in, as well as over 100 covers from the Archie published series. It's all good fun to look at, but our only gripe is that you can't get rid of the navigation instructions (Zoom, Page, Etc.) on the left side. It kind of hinders the experience.  Despite any of the lacking areas of the compilation, though, Sonic Mega Collection is easily one of the best anthologies Sega has ever done, and better than other collected works on GameCube. If you enjoyed the old Sonic titles, this is a must-have if you can scrounge up the funds. You'll have them all in one place, you can drool over hundreds of pages of art, and the bonus games are pretty rare finds.   Graphics and Sound Considering that a huge part of reviewing a compilation is picking apart how well the emulation is, there's not much to say about Sonic Mega Collection that hasn't been mentioned. With the emulation spot-on and a few improved elements to boot, we're pretty pleased. However, unlike Sonic Jam, Sonic Mega Collection is lacking in presentation. Sonic Jam featured an awesome front-end that exploited the Saturn hardware to offer up a pretty 3D engine and some mini-games to go along with it. There's nothing of the sort on GameCube, other than some basic menus and 3-5 second load times between various options.  Regarding sound, there is no jukebox option where you can kick back to the classics, but naturally all of the retro music blares wonderfully during gameplay. Like so many compilations, there's always something missing. There are a ton of Sonic games out there, and basically Sega has decided to start with the basic stuff it did with Sonic Jam and add to it with a few eccentric bonus titles like Ristar. I'm all too happy to see these extras, especially in addition to all the high-res art, but I think Sega could have done more. For $39.99 I think we deserved a few more Sonic games. And where's the cool 3D interface and mini-games we saw in Sonic Jam? However, I must admit, despite all of those complaints, Sonic Mega Collection is still pretty cool. If you can envision playing back through all these old classics, it's worth the buy. Especially if you don't own them in the first place, or want to avoid going through the hassle of dusting off the older consoles.", "date": "Nov 12, 2002"}