{"name": "ATV Offroad Fury 2", "name_review": "ATV Offroad Fury 2", "ref": "https://www.ign.com/articles/2002/11/12/atv-offroad-fury-2", "text": "could be exactly the same as its predecessor and still offer a pretty good time.  The original Offroad Fury has aged surprisingly well -- it was a sleeper when it arrived relatively early in the PS2's lifespan, and developed into a cult hit over the months since then.  It looked good, running on a typically solid Rainbow Studios terrain engine, but its physics model was its best aspect.  Offroad Fury managed to create vehicles that behaved realistically while also remaining terrifically fun to drive, bouncing off of every feature of the track.   The sequel is, for the most part, more of the same.  This is not really a problem, however, because it's more of a good thing, and what new features have been added are much appreciated.  Online play, for instance.  That just makes a superior multiplayer game even better.  The graphics engine has also improved somewhat, adding many different details that add up to a substantially stronger visual presentation.  Offroad Fury 2 is recommended for new and old fans alike -- it's a worthy improvement on the original, and the perfect introduction if you missed that one.   Gameplay  I have never personally driven one of these things, and likely never will given their grim effect on the surrounding terrain, so I can't testify from experience as to the realism of the game's handling model.  Realism aside, however, it is certainly fun.  As before, all four wheels of each vehicle react in detail to shifts in the player's input and the smallest features of the track, and there's a surprisingly strong sensation of feedback as you play.  You can see and feel the vehicle reacting and alter input accordingly, all through a race.   Besides simple steering and throttle, the key control mechanic is the suspension preload, which affects the amount of air a rider gets after hitting a jump.  Pulling back on the analog stick loads up the suspension, and flicking it forward helps launch the rider further -- there's a little meter in the GUI to help you get the timing down.  Getting extra air can mean pulling ahead of other riders, but there's a little more to it than that.   See, ATV has some very smart track design elements, particularly rhythm sections.  A rhythm section, in motocross or BMX or what-have-you, is a series of jumps that's best negotiated in a certain rhythm.  Attacking the first jump at a certain speed with a certain height can let you flow easily through the subsequent jumps, while landing over or under the optimum spot for that first jump can lead to casing several subsequent jumps.  The most important aspect of reading the tracks is judging how fast and how far to jump at the beginning of each section, because it's not always a good idea to just haul back on the preload and jump as far as possible.  Some sections demand a defter touch to land properly and continue smoothly through the section.    This makes ATV sound like an exacting racer, and it is in some ways, but it allows just as much room for chaotic bar-banging.  The courses are always very wide, so there's plenty of room to swerve around trying to bump an opponent, cut off their line, cut through open corners, or land on another rider's head.  Yes, as in the first game, it's possible to judge a landing just right and head-stomp a leading opponent.  The opposing racers behave in a pleasantly realistic fashion as they react to your moves.  They're not inhumanly fast or nimble, but instead use realistic racing tactics and respond appropriately in turn.  It's possible for an AI racer to screw up and crash, just like you might.  Crowding and shoving also work to defend or take over a racing line, which is very important.  The tracks are wide enough that taking the inside line through a course, particularly an outdoor course, can make a big difference in the lead.   ATV 2 offers the same race modes as before -- circuits, waypoint races, and indoor supercross races -- but the track selection is substantially increased, and there are four great new mini-games.  ATV soccer is absolutely hilarious, and it's not that hard to control, either.  Split-screen races now run at a better framerate (not that they needed much help in that regard, anyway), and network play offers options for i.Link, LAN, and Internet competition.   It's a damn shame the online mode doesn't allow competition at ATV soccer -- there are only race and freestyle modes, for four players.  That ~only~ is delivered with tongue firmly in cheek, though.  This is a great racer for online competition, and while we encountered some occasional problems joining games from the office here, that's likely the fault of the mutant firewall around our office.  We could create games just fine, and while it would be nice if there were an option for more players and game modes, it's enough to just be able to race online.  Here's hoping Sony can keep the servers in more stable condition than those for SOCOM...   Dovetailing nicely with the chance to show off on the net, ATV 2 also adds a substantial variety of customization options.  There are more licensed ATVs (hopefully, the manual won't promise any fictitious rides this time), and a huge selection of different colors and labels for a rider's gear.  Everything from boots to goggles is customizable, with unlockable items for those who persist through the championship mode, and developing a unique style is naturally great fun.    ATV 2 is definitely a worthy sequel, and it's turned out far better than some cynics predicted -- this is, after all, Rainbow's contractual-obligation project before going completely exclusive with THQ.  There are enough variations on the solo game to keep it fresh, and online multiplayer is a huge improvement.   Graphics  At first glance, this doesn't look a whole lot better than its predecessor.  It's the little things that stand out, though -- after playing for a while, a preponderance of details show up that give this a leg up on the original ATV.   While the terrain engine is similar, and the draw distance equally strong, there's a little more detail to the backgrounds.  Trees look better, for example, with a little more body to their polygon models and more varied, vibrant colors.  There are also more distinct bits of random architecture in the levels, from ruined buildings to wrecked bridges to railroad crossings and more.  Water has been added to many levels, and while it doesn't compare to the surfaces Rainbow created for Splashdown, the textures and particles are certainly serviceable.   The riders look very similar to the first game until you get a good look up close.  The lighting has improved, especially on ATV bodies, and there's more polygonal detail fleshing out their interior structure.  The riders themselves have sharper textures, on top of the greater variation provided by the selection of outfit parts, and while the game's trick system still isn't integral to gameplay, the stunt animations do look very nice.  It goes without saying, of course, that Rainbow can still craft some gorgeous bail animations, and their artists still have a good grip on the body language of an off-road rider.   Glitches in the engine are few.  You'll see an occasional clip through a bit of trackside detail, but for the most part the collision detection is very solid, which is helpful for planning strategic corner-cuts.  The framerate also drops on rare occasions, when there are five or six ATVs on screen -- that can make crowded starts a little bit hectic.  On balance, however, this is the kind of solid engine we've come to expect from Rainbow.  It's not exceptionally flashy, but it gets the job done admirably.   Sound  The original ATV Offroad Fury demonstrated the value of a unifying theme in a licensed soundtrack.  In case you missed it, it was wall-to-wall grunge -- Soundgarden, Alice in Chains, Stone Temple Pilots, and various other relics of the period when I was about 14 years old.  True, tastes vary, but I happened to get a kick out of flashing back to my early teenage years, especially when ~Spoonman~ came on.   Like it or not, ATV 2 kicks the unified-theme idea in the head, instead presenting the hip-hop/nu-metal melange that seems so popular these days.  If you've started wondering whether every new gaming coming out recently has the same soundtrack, well, we have too.  There are a few standout tracks, mainly in the hip-hop segment -- Jurassic 5 delivers an offbeat piece -- but I could die happy having never heard anything by the Utah Saints again, and I maintain that this ~Shinobi vs. Dragon Ninja~ nonsense is an insult to the memory of two of the finest action games ever created.   Why pick all this random music, when you could come up with something that had a bit of a theme to it?  Perhaps I'm influenced by stereotyping, but ATVs say metal to me -- get together a dozen relics of the '80s and you could have something pretty entertaining.  A little Slayer, a little Iron Maiden, some Quiet Riot, maybe Van Halen to soften it up a bit.  Sure, I'm just throwing ideas around, but it can't be any less logical than the thought process that led someone to believe licensing the Utah Saints was a good idea.   The engine noise makes a fine soundtrack, though, with the high, throaty sound common to small engines like these.  That and the other basic effects from the first game remain, joined by some more interesting environmental sounds here and there in the outdoor levels.  Water adds its own occasional sounds, and it's fun to hear as well as see animating elements like the train that occasionally rumbles by.Don't mind me, I've just got my mind set on Iron Maiden for some reason.  It's probably Tony Hawk's fault.If you've been looking for another game to play online with your PS2, ATV Offroad Fury 2 is a no-brainer choice.  It's a good racer, and the only racer with network play until Automodellista shows up.  Players of the original game may have had their fill, but if you do ever feel a need to go back to the first game, the extra tracks and modes here may be worth your time.  And if you've never tried out Rainbow's off-road racers before, this is the perfect time to start.", "date": "Nov 12, 2002"}