{"name": "BMX XXX", "name_review": "BMX XXX", "ref": "https://www.ign.com/articles/2002/11/13/bmx-xxx-2", "text": "Just mentioning the title of Acclaim's latest, BMX XXX, conjures up images of pedal-powered hedonism, protesting parents and tongue wagging from hormone-driven adolescents. In preparation for this review I went out of my way to peruse some of the finer adult movie review sites on the net for clues on how to cleverly refer to naughty things without using naughty words. But after poring over well-written reviews for flicks like Midsummer Night's Ream, Backside to the Future, and Breakfast is Tiffany, I quickly realized that there's not nearly enough smut in BMX XXX to warrant a special vocabulary.  This is a BMX extreme sports game first and foremost and not the daring new take on the genre it would have you believe.   Indeed the basic ingredients for serious debauchery -- you know, pimps, hoes, fire trucks and balloons -- are well represented, but they don't come together in a way to enhance the game's basic premise of freestyle tricking for points. Especially when you consider the fact that the PlayStation 2 version of the game has been toned down in a multitude of ways compared to its GameCube and Xbox brethren. In a curious move, the X-rated content that hyped and fueled BMX XXX since it's surprise unveiling at E3 has since been crippled by Sony of America. Which in turn focuses our ever-critical eye even more sharply on the depth and quality of the gameplay. Can Z-Axis' last effort for Acclaim match the other versions even after it's been semi-cleansed?   Unfortunately, the answer is not really. As BMX XXX faces several problems that cannot be masked by the game's sense of humor and semi-nudity.   Gameplay  BMX XXX turns out to be too linear a game for its own good. Though the flat-land tricks have been greatly improved (they're both easier to pull off and more in number and type), and the physics engine a more air-generous beast in comparison to its predecessor Dave Mirra BMX 2, the game's step-by-step nature doesn't really allow you to take advantage of these additions. Other than a few point-based missions and an isolated list of trick-specific challenges, there's truly little need to use that new stuff at all. But here, let me explain the whole thing from the beginning:   In the main Hardcore Tour career mode there is no timer to worry about, but your character has a health meter that can run out if you bail too often. Accomplishing a minimum number of goals in each level opens up new levels, and the infamous stripper videos featuring dancers from the world famous strip club franchise, Scores, are the prime unlockables. The real appeal of BMX XXX however, comes through in its humor. Whenever you encounter one of the few character interaction cinemas in each level, the raunchy jokes, vulgarities, and loony explanations as to why you need to complete a challenge starts flowing like a river. Helping someone who is having trouble doing his business in a portable toilet by mounting it on your handlebars and shaking things up, is even funnier than when the nut ball explains it to you. These types of scenes are genuinely entertaining and will yank a few chuckles and guffaws out of even the most hardened of gamers. The downside is that the NPCs aren't always as helpful as they should be; in fact, the goal system itself isn't very user friendly to begin with.    Where Aggressive Inline spoiled us by giving us a shot of the area or object in question, BMX XXX leaves us scrambling to figure out just what a challenge requires more often than not. The clock starts counting down immediately while the player is just sitting trying to figure out which wall or switch we're supposed to wall tap or where the hell that bungee jumper is so we can push him over and this can be extremely frustrating early on. Like for instance, remember the ladder challenge in Dave Mirra 2? It was a simple ladder quest, but the levels were so large and the ladders so far apart, the task was ridiculously frustrating, on the first level, no less. There's a good amount of that in BMX XXX.    Challenges where you have to find or collect certain objects are different because you're prepared to be a little disoriented as you search. Furthermore, when you do fail a challenge, again we've been spoiled by other extreme sports games; there's no way to quickly re-try that challenge. If it's a challenge from a character you have to pedal your ass back to where you found them and initiate another cinema to start all over again.    The levels of BMX XXX aren't any larger or more creative than the levels Aggressive Inline or Dave Mirra 2 either. In fact the overall feeling is that within these giant levels there seems to be more ~dead space~ with no ramps, rails or other obstacles to use for tricks. Compare this with the levels of Aggressive Inline where you always seemed to have options in front of you, and you'll notice the weakness of the stage design immediately. Too often in BMX XXX you'll find yourself just driving to a potentially fun area with plenty of trick equipment instead of grinding there and earning points like you could in A.I.. The reason? --Because something to grind on is nowhere to be found on that path. And you can ask any lap-dancer folks, grinding is always better.   At least there's some type of goal-oriented enforcement in there. Since health is your only limitation in BMX XXX, accomplishing goals is the only way to receive a health boost. This sort of reinforces the idea that the developers want you to go after the toughest challenges, since once a challenge is done, it's off your list and you can't get any more health for it. There are exceptions to this since some challenges are always available to you even after you've cleared them, just so you can get replenish your health. Also, bike parts upgrade your bike/rider so that you'll have boosted attributes for speed, manuals, air, etc.   Each level has its own set of challenges made difficult by that level's particular layout. The problem here is most of the challenges have the same basic premise from level to level. Collecting five clowns, Godzilla monsters or flatulent construction workers and delivering them to a specific location ultimately becomes repetitive. The same can be said for collecting 45 coins, beer bottles or donuts seen floating about the Bronx, Syracuse or Mall levels. Naturally, collecting those 45 items though is how you'll unlock the fine ladies of Scores from deep within the FMV confines of the disc.    The stripper videos in the game may be an important step for videogames, but it's not as big a deal as Acclaim, the mainstream media, or your knucklehead buddy down the street would have you think. There are Scores facilities in the Bronx and Las Vegas levels, where it actually makes sense to have those strip clubs, but accomplishing certain goals in each level unlocks new video clips regardless of where you're racing. Unlocking stripper videos is certainly a huge departure from merely unlocking a new rider, or new bike or new shoes, but the novelty wears off faster than you'd expect.   This is due mainly to the fact that the dancers are only grooving for about 25 seconds, and that they're strippers, not porn stars plying their trade. The topless nudity (well almost topless, PS2 gamers get little XXX symbols over the naughtier parts) is in the context of a dance routine, so teasing and titillating the videogaming audience isn't exactly a sure thing. It would have taken a lot more exposure, fluids and other acts for this R-rated content to earn an X rating. Three Xs? That would require farm animals from other planets I think. Within the context of the game however, pulling tricks on a bike while interacting with colorful characters that happen to curse expose the strippers for what they really are. A gimmick that's been tacked on as an important piece of this equation: Videogames + dirty words + naked chicks = fun for males ages 18-34.    The developers did a good job of giving gamers a little payoff early on by making the first video extremely easy to unlock too. I say this is a good thing, because from there on out, you're going to be hard pressed to earn every other skin snippet locked up in the game. Unlocking movies comes down to collecting all 45 items of a particular level, clearing all 20 gaps and winning both competitions with gold medals. That's a slick way to get some value out of the game, since there's no point in playing XXX if you're not going for the stripper videos.   Graphics  For PS2 game, BMX XXX looks a lot like a third or fourth generation PlayStation title and this proves to be one of the game's greatest weaknesses. The characters look far too blocky to convince me that this is the evolution of the Dave Mirra BMX engine and the animation is a mixed bag of good and bad --Where the rider moves well but the other characters and objects in the environment are awkward and stiff.   Not that past BMX games from Acclaim were known for their spectacular character models, but it's clear that Z-Axis didn't attempt to push the envelope here in XXX. Since most PS2 owners are going to create near-nude female characters complete with exposed nether regions, it would've made sense to have, uh, smoother skinned, more authentic looking physiques. After all, players will be unlocking video clips of real exotic dancers for immediate comparison. Staring down the barrel of a colored splotch of fabric wedged between two blocky cheeks for 20 hours can't be healthy for anybody, even people who are into that sort of thing. The characters you meet in the game don't look much better with maybe a few dozen polygons used to ~flesh out~ their forms.   At least the tricks are animated very well with the rider and bike interacting naturally. It's easy to recognize the difference between an X-Up and an X-Down or a Decade and a Tailwhip with your rider seamlessly transitioning into and out of a trick while in midair and getting full extension   in the move.     There's a wobbly bike animation where your character will lose a little speed as he or she tries to regain their balance after barely landing a sketchy move. A helpful animation like this, though, doesn't explain some of the inexplicable bails and crashes you'll encounter from time to time when you approach certain ramps and rails.    Alhough there can still be awkward moments, usually on the ground and near rails, Z-Axis has changed the way rails are handled from Dave Mirra BMX Freestyle 2 to BMX XXX. Technically, rails are handled more like the Tony Hawk's Pro Skater series, meaning they're not interpolated, but they snap on, which provides a different feel than the previous games.   The video of the stripper videos is done up with professional quality lighting and filters and might convince you that you're watching an episode of ~G-String Divas~ but without any talking, emoting, or backstabbing that the HBO series offers.   Sound  The voice acting is surprisingly strong even though it was easy for us to recognize that a few of the characters in the game used the same actor. The accents and dialects are all done perfectly from the disembodied voice of a construction worker stinking up a portable toilet to a Winona Ryder-like shoplifter with an annoying California valley girl whine. Many of the potty mouth jokes are subtle so the crisp delivery of the lines was imperative.    The soundtrack, like those of most extreme sports games, is all over the place with a smattering of rock, punk and hip hop tracks. The majority of the cuts is from the '90s and '80s and includes songs from De La Soul, Motley Crue and The Neptunes. In fact, once you get to unlocking stripper videos, song titles like ~The Magic Number~, ~Girls, Girls, Girls~ and ~Lapdance~ are ~cleverly~ (as in not really) repurposed for the video at hand.   Sound effects are extremely mediocre. There's a slight rattling sound from your bike whenever you land a trick cleanly on flatland and a metal-on-metal ping when you hit stalls and begin grinds. The characters you can interact with will usually have something funny to say as you pass them by on your way somewhere else and you'll get the panning and proper directional sound.BMX XXX didn't live up to my expectation because, like many people, I was expecting an evolution of the Mirra franchise with the welcome addition of potty mouth humor and nude women. The women and humor are there, but the evolution just isn't. I think BMX XXX got caught up in a different kind of identity crisis than we've seen before. But looking at it for what it is, either the game needed to have more XXX or a more refined BMX side, but leaving it caught up in the middle where it is now won't be very satisfying for hardcore gamers.Whether or not XXX is a turning point for mature-themed videogames remains to be seen but popularity is a key element for controversy and XXX has plenty of spotlight on it.", "date": "Nov 13, 2002"}