{"name": "Disney Sports Soccer", "name_review": "Disney Sports Soccer Review", "ref": "https://www.ign.com/articles/2002/11/13/disney-sports-soccer-review", "text": "What do you get when you take Konami's soccer hit Winning Eleven and replace the players with Disney characters? Not an arcade soccer game, that's for sure. While  Disney Sports Soccer looks and sounds like a sports game targeted at kids, it manages to feel and play like a simulation soccer game. Yes, you read correctly. This game is every bit as complex as, say, FIFA 2003, but it stars Disney characters -- which raises the question: whom exactly is this game targeted at?Earlier this year, Sega threw down the gauntlet to set the benchmark for action soccer games with Sega Soccer Slam, a cartoony and enjoyable four-player button-masher that was quick and flashy, but also a tad on the shallow side. Midway, the company that defined arcade football with NFL Blitz wasn't far behind. RedCard Soccer 20-03 hit shelves in time for the soccer World Cup and tried to tackle both arcade and simulation gameplay at once -- but ultimately delivered neither particularly well. Disney Sports Soccer suffers from a similar dichotomy. On one hand, it skews very young with its visuals and kid-friendly presentation, on the other it retains the flow and strategic pace of real-life soccer.Features Three gameplay modes, including exhibition and tournament play Deep control system, allowing for shot curving, one-twos, and keeper charges. Player customization (name and stats change) feature Win magic special moves and assign them to players Link up to the GBA version and trade items Four-player multiplayerGameplayTalk about niche gameplay! Disney Sports Soccer takes Konami's tried and true soccer gameplay from such titles as ISS and Winning Eleven and attempts to wrap it up in a kid-friendly wrapping. Ironically, Konami actually improved the control system over the GameCube version of ISS. Using popular Disney characters like Mickey, Donald, Minnie, Goofy, and co., players battle the computer (or human opponents) in standard 11-on-11 soccer matches, complete with formation editing, fouls, off-sides, team radar, player substitutions, and an intelligent, full-fledged soccer control system with more depth than most competing simulation games. Though the game relies more heavily on the turbo button, the feel of it is very much that of a classic Konami soccer game. You can pass and shoot with the X Button, activate magic and special moves with Y, Dash, center and change sides (L+A), perform a through pass (L+B), a one-two (L+Y), slide, head, or volley with A, shoulder charge (B), send out the keeper (L+X), determine the shooting height with R, and even curve the ball when shooting at the goal with the control stick. The latter is a great addition that solves one of the problems that have plagued GameCube soccer: how do you set up shot height controls on a controller that doesn't have pressure sensitive face buttons? Using the analog R trigger in conjunction with the face buttons is a bit of a departure from conventional soccer games, but it actually works!Stadiums range from the standard grassy greens to this slick indoors arena with reflective floors. Disney Sports Soccer also fixes one of the problems with the GameCube version of ISS: player switching. In addition to automatic player switching that's less twitchy than in ISS, the game lets you manually switch to the player closest to the ball with X -- and do a directional player switch by pressing X and a direction on the control stick. It's a trip. A deep control system like this would work like a charm for Konami's mainstream soccer franchises, but it doesn't quite match the presentation in this title. Disney Sports Soccer is an odd beast. On one hand, you are encouraged to sprint around the field like crazy, play rough, and use magic to help you get ahead, on the other, you are competing with an 11-man team on a full-size soccer field, using your radar to set up strategic plays. Unlike Sega's Soccer Slam, which keeps the action non-stop by shrinking the field and using smaller teams, Disney Sports Soccer relies on slower paced passing play, which is very much like soccer, but not at all like ~Disney~.There are three different gameplay modes, but they all pretty much amount to the same thing. Exhibition lets you play a single game, Dream Cup is your standard tournament (versus eight teams), and Challenge Cup lets the player pick an opposing team of their choice and defeat one team after the other. There are of course multiple difficulty and match length settings, although it should be noted that the game might be too hard for young kids, even on the easiest setting (when playing against the computer). But that's of course not a problem when playing with two players or more.  A Custom feature also lets you change your players' names, and edit your formation and player stats. The latter is surprisingly deep, allowing you to upgrade your players' power, speed, technique, agility, acceleration, and stamina. Playing in the cup modes will also unlock special items that you can equip to your team captain and use during the game. For example, the Sure Shot will kick the ball towards the goal, no matter where it's aimed at, Boom Shot will create an electric ball that gives shocks to those who touch its streak, Re-Pass brings back the ball to the player who kicked it, Slick Trick fires magic bullets that cause other players to lose balance, and many more. There are also counter effects, such as Deflect and Protect to ward off an opponent's magic.While all these options are available in single-player, it's in the game's solid multiplayer mode that they really shine. If Mario Kart has taught us anything, then it's that it's much more satisfying to use a special attack against a buddy who's sitting in the same room, than against the AI players.If you're a soccer fan, Disney Sports Soccer offers rewarding gameplay and well-crafted controls that make you wonder why most other soccer games can't come up with something nearly as good. But know that the presentation does clash with what this game is all about. Despite the young presentation, it's not a kiddie game at heart -- and it's not an easy-pick-up-and-have-fun game like Soccer Slam. While it's possible for kids to play the game with just the face buttons for passing, shooting, magic, and tackling, the large size of the field and overall pace are more appealing for older gamers.GraphicsDisney Sports Soccer impresses with clean, fluid graphics, well-animated character models and vibrant soccer stadiums. The models and backgrounds aren't quite as detailed as what you would find in a game like Kingdom Hearts (or other GameCube soccer games, for that matter), but the game also runs at 60 frames per second, complete with animated crowds, lighting effects and camera blur features (for that TV-like appearance). The overall presentation is slick, with funny goal celebrations and even mock player interviews after matches, but the game should probably be better known as Mickey and Donald Soccer. The number of recognizable stars is surprisingly low, and the roster doesn't represent the full breadth of Disney content. Each team is made up of one star captain (Donald, Mickey, Goofy, Minnie, Daisy, Pete, Mortimer, or the Big Bad Wolf), 10 generic secondary players that all look the same, and one goalie. Sure, this makes the star player all the more special, but it also makes you want to ignore (and not really care about) the secondary players. Given the richness of the Disney universe, a game with five-player teams made up of unique players would have really pushed the title over the top. Imagine a team of different gorillas led by Tarzan, a duck team made up of Donald, Daisy and the nephews, or the Jungle Book crew, for example. Instead, Konami opted to use Huey, Dewey and Louie as linesmen -- a nice touch, but not as cool as letting us control them.As you would expect from a game based on Disney characters, animations are smooth and quite humorous. For example, Donald will turn his butt towards his opponent to defend against a free kick -- and jump into the air with a loud ~quack~ when the ball hits his behind. Similarly, victory celebrations stay true to the characters, although the fact that you're most likely to score with the team captain means you'll see that animation over and over again. Overall, the graphics are simple, but smooth and competently done. Kids will love the look and there are plenty of nice touches that older players will enjoy as well.SoundThe audio isn't as impressive as the rest of the game. The tunes are generic, but the sound effects and voices sound like what you'd expect to hear in a Disney cartoon. Unfortunately, the abundance of ~nameless players~ (they do in fact have names, but they're of no consequence) also means boring and nonspecific commentary. As a matter of fact, the commentator sounds like the Wave Race 64 guy. Imagine him saying ~?and kicks it to player 8!~ a lot and you know what the game sounds like.This game took me by complete surprise. It may not be the game realization of Disney's classic Bedknobs and Broomsticks animal soccer match, but it's a fine playing soccer game in its own right. Where I was expecting a shallow, easy to play kid's game, I got a complex, well-controlling soccer game that just happens to star Disney characters. Where I was expecting fast arcade fun, I found something more akin to Konami's other soccer titles: strategic passing play and deep controls. While I can appreciate the gameplay, the presentation skews this game towards a younger audience -- one that can't possibly appreciate the control scheme and upgrade structure. Points off for the ~identity crisis~ approach and the slim roster of characters, but the game plays well, feels like soccer, and looks polished enough, making it easy to forgive the lack of variety in the character and game mode departments. If you're a soccer fan and you're not ~too cool~ to be caught dribbling a soccer ball past Minnie Mouse and a horde of pink rabbits, give this game a look. It's as close to Winning Eleven as US soccer fans will get for a long time.", "date": "Nov 13, 2002"}