{"name": "Silent Hill Origins", "name_review": "Silent Hill: 0rigins Review", "ref": "https://www.ign.com/articles/2008/03/17/silent-hill-0rigins-review", "text": "By now, gamers have become well aware that if any character mentions Silent Hill, they're in for a world of pain.  Full of insanity, skinned monstrosities, alternate dimensions and a freakish cult hellbent on destroying the world, this supposedly sleepy town has ensnared its visitors with a unique brand of survival horror.  Over the course of four console games and a feature length movie, fans have descended its depths and explored its buildings, looking to escape from its fog-enshrouded streets.  While it first infected the PSP, Silent Hill 0rigins has finally returned to the consoles with its recent release on the PS2.  Unfortunately, while it explains what made the town so twisted, it barely manages to take advantage of the PS2, and feels like a weak port of the title.   Players are introduced to Travis Grady, a truck driver with insomnia and other issues.  With a past that he doesn't like to talk about and even has trouble remembering, Travis is alone in the world, and likes things that way.  Unfortunately for him, he finds himself driving his freight towards the town of Brahms on a stormy night, and decides to take a shortcut past Silent Hill to save himself some time.  What unfolds, however, is much more than a simple detour, as Travis slams on the brakes when he sees a small child in the road.  The trucker finds himself dragged into Silent Hill, where, unbeknownst to him, his fate is intertwined with that of Alessa, Dahlia and the Order.   That just put nursing back 100 years. Unlike some of the previous protagonists of the Silent Hill titles, Travis is pretty capable in battle, particularly with his fists.  By holding the R1 button, Travis enters his combat stance, where he can perform light or strong attacks to weaken monsters.  You can also acquire a number of melee weapons, such as tire irons, jagged pieces of wood and poles, and even projectiles, such as alcohol bottles or filing cabinets.  Much of this, and other item collection is done as you explore the town, and Travis will indicate items that you can collect or interact with by a subtle turn of his head. However, you aren't able to rely upon the same weapon constantly to see your way through the town, because all of them will break after a certain amount of time.  Projectiles, while powerful, can only be used once against a monster before they shatter.  As a result, you'll need to weigh whether or not you're going to get into a fight or run away to save a particular item with a long reach.   Or do you?  Unfortunately, while the concepts behind combat in 0rigins are cool, the implementation is somewhat skewed.  Sure, your melee weapons break, but there are so many items that you can acquire to replace them that you never feel like you're in danger of relying solely upon your fists to survive.  I killed a number of creatures and broke plenty of drip stands, spears and crowbars, but there were always plenty of objects to replace them.  In fact, by the time I got to the final boss, I found that I still had at least twenty or thirty melee weapons of various conditions in my inventory.   Another strike against combat is that your projectile weapons quickly become useless against many of the monsters you face off against.  It's pretty easy to toss a television into a nurse because she's pretty slow and weak, but later enemies can frequently shrug off some of these one hit kills.  What's more, hefting and throwing these items takes a long time, which can easily open Travis up to injury against some of the faster enemies or monsters that spit viscous liquid at you.  Additionally, the quick time events that you'll find yourself engaging in if monsters get too close don't have the same impact that they do in other games.  You don't gain additional damage on monsters, but instead push them away, which feels like a bit of a letdown compared to the other battle elements.   What the hell is that thing? Now, you can avoid some of this by using firearms when you get your hands on them, but that raises a few series questions.  The first is that there's a ton of firearms and ammunition in 0rigins.  From handguns and shotguns to rifles and assault rifles, players have a lot of ways to eliminate monsters.  While you don't want to waste rounds on every single creature, you'll most likely find that you'll have more than enough to inflict significant damage on monsters and bosses as you're going through.  Plus, since Travis is a pretty decent shot (thanks to the enemy lock-on function), you feel a bit more confident with your shooting skills than any other Silent Hill game to date, which feels a bit uncharacteristic of the franchise.   Another issue that crops up is the problem of the camera, which is designed to highlight dramatic angles or impart a sense of claustrophobia.  While it does this rather well, it fails during battle, as you will frequently find yourself struggling to see what is attacking you from off-screen.  What's more, you may find that as you swing or move forward in battle, the camera angle will change and you'll accidentally move in the wrong direction or run into danger rather than away from it.  Even trying to remedy this is hampered, because centering the camera doesn't work as well as it should, which is very unfortunate.   What's truly unfortunate with the camera system is that 0rigins really doesn't take advantage of the PS2, which highlights just how weak a port this is from the PSP.  Instead of taking advantage of the second analog stick and refining the camera, the game remains locked to its poorly managed camera angles, which made sense on the handheld, but doesn't work on the PS2.  What's more, you almost feel as though you're fighting some controls, primarily because it was designed more for the analog nub than the analog stick, so instead of sensitively maneuvering through environments, Travis seems to control a bit more tanklike.    Of course, combat and camera controls aren't the only facets within 0rigins -- Players will find themselves exploring the town, collecting objects and using them to gain access to new areas.  Frequently, this will take you across both the foggy ~normal world~ and the industrialized ~other world~ that has become synonymous with Silent Hill.  However, 0rigins has a rather unique twist that makes exploration a bit more flexible, but is possibly controversial as far as the series is concerned.  Instead of being dragged into the other world kicking and screaming, feeling as if your grip on reality is being stripped away from you, you pick and choose when you're going to travel between both worlds with the use of mirrors that have been scattered across the town.  Since you can control these at will, the sense of dread or foreboding is sometimes stripped out of venturing into the other dimensions in favor of searching for a door to unlock or a new item to collect.  The mental institution, in particular, is guilty of this, because that section drags on for way too long.   Never trust children trapped in demon world mirrors. However, once you're past this situation, you'll find a number of elements to like, particularly in the standard Silent Hill formula of puzzles, which take on the familiar sense of off-kilter and strange that only this franchise can impart.  Puzzles such as putting together a surgery mannequin, only to find that same dummy skinned in the other world, or feeding medication to doll's heads is odd, but feels completely in keeping with the funky nature of the franchise.   Also in keeping with the franchise standards are the inclusion of multiple endings, although there's a bit of a twist in the form of accolades and extra options.  Once you've beaten the game, your performance is evaluated over multiple criteria, such as the number of items collected or the number of enemies you killed with your bare hands.  These unlock different items for you, such as outfits, flashlight skins or other options.  Imagine taking on the skinned creatures of Silent Hill dressed as a Mexican wrestler with a flashlight that projects a smiley face -- thanks to some creative awards, Travis can explore the town in brand new ways. The one downside with the PS2 version is that there really aren't any new elements added to the title, which means that if you own it on the PSP, you're not gaining anything new or improved with the game.  That, coupled with the controls, doesn't make a strong argument for the title if you already bought it before.   What's more, while it was pretty stunning on the PSP screen, it's definitely weaker on the PS2.  This is particularly true if you compare the two games side by side with a PSP that can project the game onscreen; the PS2 version is blown up and looks much more pixilated and rougher edged.  While there are some sequences that look a bit cleaner, particularly during cutscenes, the overall presentation of the game is much uglier than the portable. What's more, it highlights some of the flaws from the PSP series that simply haven't been fixed.  For example, some finishing move animations will completely miss an enemy, but you'll still be credited with the kill.  This was somewhat forgivable on the PSP, but on the PS2, this is simply ridiculous.   Even with these problems, Climax and Konami have managed to capture the disturbing nature of the series.  From the cluttered and junk strewn locations to the rusty, chaos filled doppelgangers of the alternate dimensions, everything feels like it fits into this twisted universe.   If you see monsters like this, swing for the fences. Aurally, however, 0rigins truly delivers, with a soundtrack by Akira Yamaoka anchoring the sound for the game.  There are unnerving clangs and sharp effects that pierce the silence of moments, which contrast with ethereal songs and lightly voiced whispers that call out to Travis.  Voice acting is pretty good as well, so you won't feel as though you're being taken out of the game by horrendous line delivery.  Telling the origin story of a well established franchise can be an extremely hazardous thing to do, but Silent Hill: 0rigins manages to wrap both the mythology of the movie and games together quite well.  With a good storyline, intriguing gameplay elements and excellent production and replay value, 0rigins is definitely worthy of a Silent Hill fan's attention.  While the combat and camera system is pretty weak, and the manual control over shifting between dimensions removes the feeling of dread, 0rigins does justice to the series as a whole. However, the port over to the PS2 just feels really basic and uninspired, with weaker textures and controls that could've been improved, but simply weren't.  If you're looking to truly do justice to the horror of the game, you probably want to track down the PSP version if you have the chance.", "date": "Mar 17, 2008"}