{"name": "Galidor: Defenders of the Outer Dimension", "name_review": "Galidor", "ref": "https://www.ign.com/articles/2002/11/18/galidor", "text": "Welcome to Christmas, kids. 'Tis the season when shovelware blight the shelves and even well-intended projects are sent out with the ill tidings of being unfinished product. Such is the humbug of Galidor, a licensed LEGO action game that could easily have been something if it weren't for the flaw-la-la-la-lawed control and game engine.  Features  Transform the hero into six different powered-up forms 2D platforming and 3D racing action Interacts with the LEGO's Kek Powerizer toy figures Only for Game Boy Advance   As fun as it seemed to play as a kid who's able to become Duckboy or Frogboy (check the screenshots) at the touch of a button, Galidor: Defenders of the Outer Dimension  loses its legs in an awful engine that wasn't nearly ready for a game. Developer Tiertex was able to put plenty of effects and cool animation into the game, but the base gameplay engine goes from super-clean and fast to chunky and slow then back again like an irregular heartbeat. While you're jumping, there's nearly a bullet-time effect in the animation somewhere near halfway through every leap -- it makes for every jump to be an entirely new guess as to what the game will do next. It's pure luck whether or not you make one of the many blind leaps in the game, but when the game engine suddenly goes wonky while you're trying to get yourself into position and chunks up at the critical moment to send you falling to your death, the pain is so much more.  Mind you, the slowdown and chop has absolutely nothing to do with what's on-screen. The game will go choppy whether there's a lot of action going on (enemies and special effects and motion blurs) or nothing at all (when Frog-Legs is just jumping on static platforms). It can run smooth when lots of things are going on, and it can drop to a slideshow when you're alone and hardly even touching the control. This isn't the case of an over-ambitious dev -- there's just something wrong with the game.  Bad code is one thing, but that's just the start of the problems. The unresponsive controls mean that attacks and jumps don't always work when you hit the button. Even worse, there are occasions where you're not sure if it's the control or you who's going wrong -- unless you happen upon the timing and control for jumping out of water (hint -- it's not the jump button), you may never get out of the second stage. The herky-jerky control slips when you're positioning yourself to jump at the end of a ledge, and you're more likely to step right off instead of getting in the spot you need to be in. Then there's the parallax backgrounds that usually aren't set against a foreground or regular background, so the wrong motion behind you makes it near impossible to tell if you're coming or going on a moving platform even if you were in complete control of what you were doing. Also, unless you hit the corner perfectly, you're more likely to pass right through a ledge than to grab the edge (and that slowdown in jumping means you could really have used those close calls.)  I realize that this game probably wasn't destined for greatness, but the GBA is in desperate need of some good action games. And, to its credit, there's a few good design in the rushed mix. By switching between different powers in the middle of moves, Duckboy can get through different obstacles (of course, with the control-less control, you'll miss almost every time you try ... but hey, it's the thought that would have counted.) They also added a simple Iridion-esque 3D racing engine to give some variety (alas, not much excitement in the bland mini-game.) Then there's the multiplayer time trials (a total afterthought, since you're just jumping through the same stages of the main game, and since the scoring system doesn't do anything with the power-ups that needlessly litter the stage, and since there's absolutely no reason why they couldn't have a toggle for more players to trudge through the simple set-up, and since there's not even a Link Play option), which are at least something. Sort of.  Oh, and the game talks to your Galidor Kek Powerizer toys. If you have Galidor toys, maybe that's enough to sucker you into buying the game. It's probably the only reason this game exists.    I knew from the first time I saw the goofy death animation where bats fly in and take apart the web-toed kid's body ala Kenny from South Park (seriously -- the only thing funnier is the corny opening where all of your buddies are kidnapped by flies ... apparently, you are the only Defender of the Outer Dimension who can crouch) that this game was screwed up. What I didn't know was that it wasn't me that had caused that goofball death show -- it was a really bad gameplay engine, one that led to many, many more of those deaths. With framey enemy animation that looks like still pictures drifting across the screen and choppy gameplay that can't be trusted to work when you need it, Galidor is yet another licensed title rushed before anything good could be created.", "date": "Nov 18, 2002"}