{"name": "Metropolismania", "name_review": "Metropolismania", "ref": "https://www.ign.com/articles/2002/11/18/metropolismania", "text": "As the letters over the last couple of weeks have proven, Americans have a strange need to play quirky Japanese simulations. Quietly released with almost no fanfare whatsoever, the hard to pronounce Metropolismania (I've heard Doug humorously call it Metroppo-poppo by mistake) weaseled its way into retailers without so much of a word. Temptingly priced at $19.99, the Media Factory-developed town builder has already made its way into plenty of private collections -- for those of us who can find it that is. And whether it's been word of mouth, or the discovery of a rare copy at their local Toys R Us, our readers in particular have been curious as to what makes Metropolismania tick.   Needless to say, this particular piece of inexpensive software is rife with technical issues, control problems, and a graphical presentation that puts the genre light years behind. Yet surprisingly, the more I play through the game's multiple missions and collection of friendly towns, I can't help but to grow a little attached to it. And as much as it pains me to admit -- I kind of like it.   Gameplay  Best described as a cross between SimCity and Nintendo's Animal Crossing, Metropolismania prides itself on the importance of creating friendships with the residents of your town. Laid out across five large areas, the game puts you in command of the Metropolis Maker; a yellow-suited top hat wearing overachiever who was chosen out of a billion other candidates to save the planet from destruction. That's right, I said save the planet. Bogged down by the greatest enemy of all time (which actually turns out to be ~convenience~), the world is no longer communicating with each other and is on course with disaster. Luckily, you and your friends at the Secret Mission Headquarters have the answer to the world's plight -- build new cities full of close friends and happy relationships. If accomplished, all of mankind will be saved and find itself in debt to your fantastic collection social skills. I swear I'm not making this up!   Quirky as the plot may sound, the game itself is pretty straightforward. Though it may appear a bit daunting at first, getting the hang of everything only takes about an hour or so; especially when you realize how Metropolismania's cause-and-effect system really works. Broken into two different mechanics, managing your city effectively is all a matter of building placement, people collection skills, and cell phone abuse. If that doesn't make any sense to you yet, don't worry... it will.    To build your city, you'll need two specific items: Your Resident Applications list and the Magic Chalk. Used to designate what area of the map you'd like your roads to appear in, the chalk is used like a standard third-person paint program as you press X and move in the direction of your choice to lay the path of the pavement. Unfortunately, this is one of the game's biggest drawbacks -- as there's no way to correct a mistake if you make one. Draw your line in a spot you didn't mean too, and that's all she wrote; the road will appear there no matter what with no way for you to delete it. It's a poor design choice for a game of this type to be sure, and the single greatest detriment in the whole shebang.   Assuming you've planned your roads exactly as you like however, you must then quickly find the residents on your application list and build their houses as soon as possible. Handled in the identical way that laying a road is, standing in the area you'd like their home to appear and pressing X is all it takes. Just like that, the topsoil will be zoned and in a matter of minutes your new tenants house will be built. The difference between a good neighborhood and a bad one, carefully planning your area is more than simple zoning. You can only build the road you require for your new residents to reach their homes and no more. Should you build more streets than needed, people who are not on your list will show up and reside wherever they want. It's not conducive to a harmonious neighborhood.   While you must also lay the groundwork for commercial buildings, industrial areas, playgrounds, and the like, your success is just as reliant on your communication skills with the townspeople. Represented by a quaint little bar graph that shows how close of a relationship you have with a particular person, speaking with a resident often (via your cell phone) and conforming to their needs ups your status with them and in turn raises your town approval rating. Get in good enough with one character and they're refer another character to your town as well, which of course means that you'll have an additional tenant for your city, and you can meet your victory requirements to put together a winning neighborhood. Simply following those rules and keeping the pattern moving is all it will take to beat the game. Though it's not that simple.    To throw another challenge at you, certain events will take place all over town that require you to use quite a bit of detective work to solve them. Whether it's the rash of burglaries infesting one area in particular or a pack of confused cult members looking to reunite, your palette will most definitely be full. And while I admire the attempt at making Metropolismania a more difficult game, I'm not such a big fan of how vague some of your tasks turn out to be (or the poorly translated text by which they are delivered). Left completely on your own, it's hard to figure how a particular problem is supposed to be solved. The result is many half-hours of wandering around your town in confusion before finally getting lucky enough to catch the break you're looking for. Clues and a natural progression of challenges would have been great.   So would a less stiff control scheme for that matter. Allowed to travel in only four directions, getting around town and into the buildings you'd like to visit without your cell phone is extremely difficult, and acts as a huge contributing factor when making the pavement mistakes I mentioned earlier. With analog stick technology so many years old by now, you have to wonder why the developers didn't use it. I mean come on; we're within a 3D space here!   Despite all my gripes however, Metropolismania still manages to do its job pretty well. Involving, personable, and encouraging for us creative types, overcoming the game's technical problems to build a city worth bragging about is definite fun. Though it doesn't reach the same level of satisfaction as the aforementioned SimCity or Animal Crossing, the sense of accomplishment I had when overcoming the sometimes impossibly hard objectives was something to smile about.   Graphics  Who are we kidding? No matter which of the four camera angles you use, the visuals in Metropolismania are horrendous. On par with a first-generation 3DO game, the poorly conceived models and block-like structures are about as ugly as they come. With the exception of a few notably bad racing games in the early life of the PlayStation 2, Media Factory's city-builder may have the distinction of being the worst looking game on the system.   Pop-up, draw-in, clipping, camera hang, and every other three dimensional graphical problem you could think of over the last decade or so has found a way to work itself into the visual mix. Walk between two blocks of buildings for proof -- we're almost positive you'll lose yourself and the activity taking place around you. And while the game has plenty of bright colors and cartoon personality in terms of art direction, the execution of that direction should have been reconsidered. At least the entertainment value of the game itself makes up for this shortcoming.   Sound  Unfortunately, the audio finds itself in a similar boat as the visuals. Synthesized in what sounds like the old Genesis sound processor, the 16-bit inspired musical score and poppy sound effects are about 10 years past their prime. There's not much to say about it really, except that the effects are sparse, the music dated, and the quality low. In fact, other than the nicely structured introductory song, there'd be no need to keep your speakers on at all. Except for that pesky need to hear your cell phone when your citizens need something. Drat!Metropolismania is a true anomaly. Technically flawed and painfully ugly in comparison to just about every other PlayStation 2 videogame, its distinct personality and interesting city-building techniques have a strange way of growing on you. Certainly not for everyone, the ultra-dedicated simulation fans would probably do well to spend a few hours alone with this one, despite its obvious problems. Though it definitely wouldn't be their best experience in the history of the genre, it would most assuredly provide one of the most unique. Recommended for two groups of people only (the hardcore simulator set and quirky Japanese import nuts), Metropolismania is one strange proposition.", "date": "Nov 18, 2002"}