{"name": "Blast Chamber", "name_review": "Blast Chamber Review", "ref": "https://www.ign.com/articles/1996/12/15/blast-chamber-review", "text": "Blast Chamber takes the Bomberman idea and goes one step further: you're wearing the bomb, and you need to keep it from detonating. The games take place in arenas that can rotate 90 degrees; walls become floors, and floors and ceilings become the walls. There's also hazards to watch out for, like spikes and trap doors.There are three modes to Blast Chamber: Solo Survival, Free-for-all, and Elimination. Each mode utilizes the same gameplay elements, but the multiplayer Free-for-all and Elimination options also introduce the competition factor.Blast Chamber's star is without a doubt its Solo Survival mode. In each of the forty increasingly difficult chambers, there's a power crystal and a goal. You have a certain amount of time to figure out how to grab that crystal and take it to the goal. Power-ups will help or hinder you, and you'll need to figure out how to navigate the dangers on the four sides of the chamber. If you can't figure out the It's a lot like an action-packed puzzle game.The multi-player free-for-all mode, however, doesn't work. The idea is to grab the power crystal and take it to a goal. Sticking the orb into your own goal will net you added seconds to your bomb's timer, and putting it into an opponent's goal will subtract time from his bomb. Rotating the screen will cause the player carrying the orb to fumble, and picking up certain powerups will help you or hurt others. Every time your bomb goes off, it counts as a point against you. The player with the least amount of deaths wins.Now, in a full game of four computer and/or human-controlled players running around the chamber floor, there's too much chaos forced onto such a small playing field. The gameplay's reduced to nothing more than characters bumping and pushing into each other, trying to dislodge the orb. It gets worse when the extra hazard and power-up elements appear in the harder chambers.On the other hand, the Bomberman-style Elimination game is pretty decent. Even though it starts out exactly like the free-for-all mode, any death to your opponents removes them from the game. This leaves the playing field more open, giving more room to move and more time to score. The player standing is the winner.This game is an idea that's too dependent on the graphics style, and it's here where Blast Chamber falls short. The camera never seems to pitch or zoom in enough to get a better view of the playing field. If the depth perspective was a little more defined and if the graphic elements images were larger, we'd have ourselves a better game. Not to mention once you've finished the single player mode, the multi-player tournaments really aren't enough to hold your interest.Still, if you judge Blast Chamber solely by its single-player modes, it's not a bad game. It's a neat solitare puzzle, and it's pretty unique. The four-player modes are enough to give them a go, but don't expect them to dethrone Bomberman. They're not even close.", "date": "Dec 15, 1996"}