{"name": "James Cameron's Dark Angel", "name_review": "James Cameron's Dark Angel", "ref": "https://www.ign.com/articles/2002/11/19/james-camerons-dark-angel", "text": "When I first saw James Cameron's Dark Angel I was surprised at the flurry of action possibilities laying there right on the surface. I was taken aback by a game based on a cancelled TV show that showed this much vitality and potential. I was genuinely surprised -- most of all because being surprised doesn't happen too often.   But just as so many games end up showing that glimmer of hope, that shining idea of possibility, there are a dozen that never reach that point of crystallization. They never get over the hump; never quite make it. Somewhere in development, the creators lose team members, are rushed to completion, or they lose sight of the initial goal; a million things can happen.    And with Dark Angel, well, something like that did happen, though I'm not sure what exactly it was. Somewhere along the line the potentially interesting and dynamic action elements careened downhill into a muddy bog of repetition, lack of vision and general malaise, leaving gamers with a dummed-down, half-baked game that doesn't take them anywhere.   Gameplay  James Cameron's Dark Angel is a game that starts well. Following a premise similar to the show, gamers follow the story of Max, a genetically engineered female youth lost in a world of corporate conspiracies and scientific riddles left for her to unravel. In this game, she fights the giant corporation that created her to solve the unending riddle of her creation by progressing through a myriad of soldiers, repetitive and redundant bosses and unbelievably stale mission objectives. (She's comprised of one scared woman's genetics, things that scientists fed or implanted in her and cat DNA, she explains. Yes, the ultimate in fighting DNA, CAT DNA.)   What's clear right away with Dark Angel is that the game has potential. As Max, you're capable of pulling off numerous attacks and combinations, in addition to displaying a nice set of throws, wall jumps and Rage attacks. Shown from an isometric perspective that keeps the characters rather small in size and distant from the player, Dark Angel enables players to take on three, four, sometimes five or six enemy characters and kick their butts. A simple smash of the hit button rips off a good combo, as does a tap-tap-tap of the kick button. Mixing up the bunch, players find a healthy quantity of attacks under their belts without thinking too hard about it. And it seems that from the start the game may very well indeed go somewhere interesting.    Max builds up a Rage meter by performing various moves and by unleashing it she pulls off devastating combos far too quick for her enemies to match. Her repertoire of moves also includes a nifty wall jump, which like action movie actors Chow Young Fat or Jet Li shows her back flipping over her enemies to surprise them from behind. She's got a running-jumping kick move, a leaping fist attack and a few others in the quiver that are fun to experiment with. And naturally, Max can pull off Matrix-style moves, which randomly appear -- from what I can tell -- just to show off some chops.    And that's pretty much where the fun stops. While Max performs all of these cool moves, the game essentially provides little variation on the theme. In the beginning she fights a group of guys, in the middle she fights a throng of thugs and at the end she battles it out with a gang of baddies. You've basically played the entire game by level three. What happens is the levels are designed in a redundant loop, repeating the same mission over and over until you realize that regardless of how cool her moves once felt, they feel hackneyed, tired and worthless because they never take you anywhere else. The game never elevates above simple button masher. The mission objectives are blase, the puzzles aren't intelligent, and the game design is based on the most elemental of ideas, keys and switches, and more keys and switches. It's as if you can see the developers running out of ideas right in front of your eyes.       True, Max attains weapons, uses stealth and fights bosses. But in each and every case, these aspects are mere distractions from the drudgery of the main premise, which is to smash buttons. Also, they're all problematic. Max finds weapons but they evaporate in her hands after an untold time limit. One minute she holds a Tongfa in her hand, the next it disappears. Poof! Why did that solid object vanish? And where to? Perhaps the better question is: Why did she get it in the first place? The radio item is the best example of something working moderately well, since it moves AI characters out of their ordinary patterns and creates a bit of tension, but it's a black sheep.   Sneaking through the game is a moderate good time too, but it becomes quickly and painfully simplistic and the AI is unquestionably dull-witted. AI enemies walk right by you, look nearly directly at you, and clumsily stare into corners, or turn their backs on the very corridors they're supposed to guard. Using a stealth move to sneak up on guards, Max can then employ a Solid Snake-like neck-breaker that's just too close for comfort to Konami's own Metal Gear Solid to give it much feel or depth.    Then there are the bosses. Pretty much every one of them is built around the first one in the game. It's pretty pathetic. It's also the first time I've seen different boss characters that follow the EXACT same pattern. The first boss you meet is a slimy toad-like thing that creeps up from the sewers. He darts and runs you over if you're not careful, he blasts you with energy beams and rebuilds his strength, and then repeats that same pattern until either you or he dies. Right after his ramming attack is when he's most vulnerable. What's bothersome about the bosses can be chalked up to simplistic implementation and dull vision. All of a sudden the weapons and items you collected during the level cannot be accessed. Health can't be accessed. It's just you and the boss, and nothing else. Fair enough, but what happens to that good stuff I collected? And why can't I use it? Little things like this, handled far too simplistically, insult gamers' intelligence.    Graphics  Visually, there is nothing particularly wrong with Dark Angel, but then again, there isn't anything in particular that ascends it above the most average 3DO game either, which isn't saying much. The camera is set quite far away, which gives players a decent look at the areas, but shows off a small set of characters which in turn show off very little in the way of particular details.    Max herself is decent looking and resembles in the vaguest ways Jennifer Alba, and she often changes outfits, giving a little root to that feminine need to dress well and with style, but like the rest of the game's ordinary graphics and very basic texture work, she doesn't stand out with any real unique visual qualities.    Sound  Jessica Alba recorded her own voice for the game as did a few other cast members, and for what it's worth the voice actors lend a strong sense of genuine quality to the game, especially for those fans of the TV series.    But she does partake in some foolish, jibber-jabber speak that ends up making her and her buddies sound like they're trying too hard to be cool, too hard to sound tight, and too hard for their own good. It's not really that big a distraction though, cause she hardly speaks that much at all.   Musically, the game mixes in high-action rock and techno with mellower tunes when the action simmers down. The music doesn't get in the way, which is good, but it's neither memorable nor original.If it's not already abundantly clear, James Cameron's Dark Angel is a game with a good premise and some early indications of decent gameplay, but it also succumbs to a repetitious flow of generic levels, brainless fights and even less intelligent boss battles, all of which become so repetitious and boring it's hurtful to play them. In a time when games of such high production values and great intelligence are hitting the market (Grand Theft Auto: Vice City, Metroid Prime and Tom Clancy's Splinter Cell) showing what's genuinely in store for the next generation of games, Dark Angel displays all of the charm and intelligence of Fighting Force 2, Frogger or Tomb Raider Chronicles. It's a game you'll quickly forget without much regret.", "date": "Nov 19, 2002"}