{"name": "Jedi Knight: Jedi Outcast", "name_review": "Star Wars Jedi Knight II: Jedi Outcast Review", "ref": "https://www.ign.com/articles/2002/11/19/star-wars-jedi-knight-ii-jedi-outcast-review", "text": "Nintendo fans are spoiled when it comes to Star Wars games. From Super Star Wars over Rogue Squadron all the way to Clone Wars, most of the Super NES, N64, and GameCube Star Wars games impressed with visuals and gameplay that really brought George Lucas' famous universe to life. PC owners weren't as fortunate, as many of the Star Wars titles lagged behind their console brethren -- with the notable exception of the Jedi Knight franchise. Released in May of this year, the PC version of  Star Wars Jedi Knight II: Jedi Outcast impressed our PC team enough to earn an editors' choice award, and the Xbox port is garnering similar accolades from our friends over at IGN Xbox.   Sadly, the game didn't transition as well to GameCube. While the Star Wars look and feel as well as many of the game's great gameplay elements remain intact, the game falls graphically well below the other versions and lacks the fine-tuned controls of the PC original.  The Facts  First-person and third-person gameplay Expanded and enhanced use of the lightsaber features a slew of attack and defense moves Tap into the powers of the Force including Jump, Push, Jedi Mind Tricks and more Employ combat or stealth, depending on the situation Battle with an arsenal of weapons: stun baton, Bryar blast pistol, blaster rifle and more Explore authentic Star Wars locales -- Cloud City, the Jedi Academy on Yavin 4, Nar Shaddaa, the smugglers' moon, plus never-before-seen locations Two-player multiplayer modes include Jedi training and team-based play Developed in conjunction with the critically acclaimed Raven Software using Quake III engine   Gameplay  The main story puts players in the role of Kyle Katarn, the sometimes Jedi Knight who has to get reacquainted in the ways of The Force if you're going to see him through this latest adventure. This part of the game has you blasting your way through new and familiar locales throughout the classic Star Wars Universe that everybody likes and even has you running into icons like Lando Calrissian and some Skywalker guy. Jedi Knight's main appeal lies in the assortment of weapons and force abilities you'll acquire from mission to mission. As Kyle, you're developing into a Jedi with all sorts of skills and abilities at your disposal that you will need as the game presses on.  What works for a third-person viewpoint doesn't necessarily work for first-person shooting. Once you get the lightsaber, the controls work out much better.  The game takes off when you finally get your hands on your lightsaber (on Yavin IV, say about 35% through the game). Before that you're merely playing a first-person shooter. Granted it's an FPS with Imperial stormtroopers, blaster rifles and thermal detonators, but taking hold of a Jedi's weapon of peace and justice literally changes everything about Jedi Knight II. Developer Raven's greatest accomplishment with this engine is the seamless transitions it makes between first-person and third-person perspectives just to accommodate the lightsaber combat system. The lightsaber control mechanism itself can take some getting used to since you simply use the same buttons for primary and secondary attacks just like you do every other weapon and unleashing automated saber swings like this doesn't feel natural initially.        Using the lightsaber in Jedi Knight II reproduces the same strengths, weaknesses and techniques of using lightsabers that we've been shown in the Star Wars movies. So deflecting blaster fire works automatically as long as you're squared up to the attacker. Hurling your spinning lightsaber boomerang-style at an enemy can be devastating but leaves you vulnerable, especially if you get it caught up around a corner. Even in that situation, the developers stayed true to what we know of Star Wars since a lost lightsaber will return to its wielder's hand once it's within line of sight. Jedi Knight II doesn't make kick ass conventional blasters like the Wookie bowcaster and missile launcher obsolete when you acquire the lightsaber, but they might as well. Once you have it, lightsaber mode will become your main approach to the game and you'll make only occasional forays into conventional weapons.    If the lightsaber is the cake, then surely using The Force is the cream filling of Jedi Knight II, because it completes the equation of making players feel like Jedi. Powers like Force Push, Super Speed and the Mind Trick are great, but look pretty weak next to decidedly Dark Side abilities like Lightning (killed Vader right?) and Grip (as in ~I find your lack of faith disturbing.~). But there are at least two handfuls of additional Force Powers like Healing and Force Draining that can tickle your fancy as well, especially when you get to the multiplayer games of Jedi Arena and we're not even counting passive abilities like wall running or enhanced Jedi leaping. They all drain your reserve of Force energy but this replenishes automatically over time and even faster as you become one with the Force. But at a glance, being able to slice through legions of stormtroopers while force pushing groups of them off of ledges after doing a super Jedi powered double front flip is the stuff console dreams are made of and Jedi Outcast gives it to you.    Even though we love the pacing of the game in terms of gaining new items and abilities, there are times when you're just wandering around not sure what or where your next move is supposed to be. Better mission objectives or a hint system could have helped correct this flaw already prevalent in the PC original. Of course getting lost in a Star Wars Universe level is a little different because in JKII you're getting to see areas of Star Destroyers (the TIE Fighter Hangar is fascinating) and the rebel base on Yavin IV (That room where Leia and that old guy with the white hair were hangin' during Luke's trench run? It's in there.) that you've always wanted to check out. But bewildered is bewildered and not being able to advance because you can't recognize that all elevators now have orange on them instead of green isn't so cool.  Given the low detail in the environments, why does this game chop up so much? Is it the midiclorians? It's the midiclorians, isn't it!  The control scheme utilizes every part of the GameCube controller, so you will feel the mastery over your abilities grow as you get more comfortable on the sticks. Sadly, Vicarious Visions, the developer in charge of porting the game over to GameCube messed up the aiming controls pretty badly for the first-person portion of the game. Vertical stick sensitivity is set so low, you'll start to wonder whether your Wavebird has run out of batteries. Luckily, you can adjust the stick sensitivity to your liking -- but anyone who has ever played the PC version of Jedi Knight II will be disappointed with how little effort was put into adapting the control scheme to the GameCube controller. After aiming your gun in games like Time Splitters 2, Nightfire or Metroid Prime, Jedi Knight II's aiming controls just feel sluggish, imprecise and plain clunky. Cycling through all of your Force abilities with multiple presses up on the D-pad  (down goes through your item inventory) is a bit cumbersome as well -- but you can chalk that one up to the lack of buttons on the GameCube controller. While the Xbox version allows you to map your favorite moves to the black and white buttons for quick access, GameCube owners are out of luck and will have to fumble around with the D-Pad in the heat of battle.   In addition to the solid single-player quest, Jedi Knight II offers a two-player split-screen mode where you can go head to head against a buddy or simply spar with some bots in a variety of multiplayer matches, including team games. You get Free For All, Capture the Flag, Jedi Master, Team Free For All, Duel and Holocron Free For All. The three FFA games are deathmatches with different rule sets so that Holocron FFA means all force powers have to picked up from icons in the level. The ability to use bots and customize each one of them and your own character down to the specific abilities every character will carry into a fight is very well done. Not only can you make up some cool games against your buddy where you each take teams of lightsaber-wielding Jedi Masters against one another, but you can create quite a sparring match for yourself as well. It's basically a snap to create armies of Jedis to recreate your own fantastic Star Wars battle scene. Plus once you play through the main game unlocking new characters for use in Jedi Arena all sorts of potential battles between Lando, Mon Mothma, anonymous Jedi Knights and Luke Skywalker, himself will be at your fingertips. Alas, the fun is for two players only and not exactly smooth. The multiplayer mode is a nice addition, but Star Wars fans looking for intense battle action are still better off playing Clone Wars.    Graphics Whatever the developers did to adapt the PC game's 3D engine to the GameCube's architecture, it didn't work. Jedi Knight II features decent looking environments and character models, but delivers it all at irregular framerates that make aiming tougher than it should be. Like in the PC original, there is no dynamic lighting whatsoever. Couple that with the fact that the gamma is strangely low in some of the missions, and you'll understand why the GameCube version has earned the nickname Dark Forces in our office. The cinemas used to advance the story look grainy and low budget like they were sifted through a screen door on the way to the GameCube from the PC. The blurriness is especially noticeable when you go from a movie to gameplay with no loading time in between. The game keeps you feeling like you're in a Star Wars movie, but the cinemas don't look like they belong to anything you want to be a part of. We'd chalk it up to the GameCube's lack of disk space, but the Xbox cinemas look exactly the same.    The animation on Kyle during the third person segments is above average. The majority of his actions are crisp and well defined especially during acrobatic moves. A lot of the lightsaber attacks can be hard to appreciate because they're unique depending on your combat settings and the targets' proximity. When you're constantly using the left analog stick to stay in motion while he's hacking and slashing, Kyle can end up looking like an extremely clumsy and awkward Jedi. Sure this is your fault and it's just as easy to make him look like a smooth badass, but this is the one area where the first/third person combo shows its weakness. The enemies in Jedi Outcast aren't always so fluid. In fact, stormtroopers often behave as if their feet are nailed to the ground they're standing on when you're laying the firepower on them. It just doesn't feel right when you're showering someone with laser blasts and the other person just pretends like it doesn't hurt.   This game takes the environments that we're familiar with from the original trilogy of Star Wars movies and re-creates them in fitting detail. Sure, we're spoiled by Factor 5's textures in Rogue Leader, but Jedi Knight II does a good enough job at making the environment look like stuff you'd expect to see in the movies. The lack of a lighting engine is a downer given the multitude of lights Imperial designers like to line their hallways with, but the insides of a Star Destroyer nevertheless look like the real deal. Plus there are plenty of those old-school 1970s flavored computer terminals with the big buttons and blinking lights that couldn't possibly do anything useful. But it's Star Wars and that's what we expect.  Sound Given the quality of the sound in the Star Wars movies, it's no surprise that this is one area that's always been strong in LucasArts games. Jedi Knight II doesn't exactly do anything that's impressive in the technical sense, but the audio gets the job done. The Skywalker sound effects database was well stocked with good stuff well before Jedi Knight II came along and every weapon and explosion sound is appropriate down to the particular aftertaste of each blaster.   The voice acting is superior thanks mainly to the legendary, but still readily available, Billy Dee Williams. We'd love to tell you he carried the whole game, but he merely reprises his role as Lando Calrissian, who pretty much steals the show in Jedi Outcast. You'd be amazed at what 20 years of Colt 45 has done to the pipes of everybody's favorite scoundrel. Unlike Williams, Mark Hamill was too busy doing whatever it is he does these days to lend vocal credibility to Luke Skywalker, but he probably would've ended up whining about something anyway, so who cares.   The sound coming from the R2 units and stormtroopers in the game is well done. In fact, you can hear some pretty interesting conversations -- for a bunch of clones anyway -- if you ever sneak up and eavesdrop on a group of stormtroopers. But all of the C3PO-type droids in the game sound like anything but the annoying butler-bot from the films. It's one of the easiest impressions in the world to pull of, yet we get nothing from the Anthony Daniels fan club.   The music is all Star Wars through and through with familiar themes and original background music flowing together very well.  Jedi Knight II is a problem-ridden port of a good PC game. It's obvious that no work at all went into trying to get this game to properly run on GameCube. The framerate is erratic and constantly alternates between smooth and choppy, further complicating the already clunky control system. If you're a huge Star Wars fan and you're looking for a well-paced action game that focuses on on-foot battles, give JKII a try. But be aware that it's tough to go back to Jedi Knight II after playing games like TimeSplitters 2, Bond, or Metroid Prime. Whereas these games offer smooth experiences even with multiple enemies on screen (and the last two deliver it with dynamic lighting to boot), Jedi Knight chops up even in small rooms with no enemies in sight. It's baffling, really. The great level design and authentic Star Wars feel are just enough to save this game from slipping from fun to merely average status, but one can't help wonder what a more experienced developer could have done with the port. Give it a look, but only after you've played the two other Star Wars games on GameCube -- or any of the currently available first-person shooters for that matter. If you're a multi-console owner, get the superior Xbox version to see a better realized port.", "date": "Nov 19, 2002"}