{"name": "Defender", "name_review": "Defender [GBA Version Review]", "ref": "https://www.ign.com/articles/2002/11/19/defender-2", "text": "Midway's pride and joy is the company's sheer number of strong classic game names in its extensive videogame history, so it's not surprising that the company's capitalizing on the strengths of these titles for its current library of titles. Defender was a true classic back in the 80s, and 7 Studios just-released remake on the X-Box and PS2 is a solid, contemporary design. The Game Boy Advance game, however, is a downright travesty. Sure, it has a somewhat accurate (though glitchy) conversion of the original 80s classic, but the remake looks and plays worse than most amateur-developed PC shareware games.FeaturesThree gameplay modes Link cable support for two player co-op (multi-cartridge) Only for Game Boy Advance So, the way Defender is supposed to work, players fly a ship around a side-scrolling environment, blasting the invading alien army before they can scoop up your planetary party off the surface and transform into mutated beasts. If all of the humanoids get wiped out...well, let's just say that it's not a good thing to let that happen. For this GBA classic remake, Midway went with Outlook Entertainment. After what this developer did with the last two conversions of NFL Blitz on the handheld, I honestly can't see how the publisher could willingly fork over another strong brand to these guys. And after ending up with this horrid Defender title, I can't imagine Midway would go back to them for another project. And if the company does, then it's clear to the GBA market that Midway doesn't care for quality products on the handheld. Outlook Entertainment put together three games for this Defender package. Classic mode is a close recreation of the classic arcade game released more than two decades ago, complete with the retro 4-bit graphics and particle-style explosions. It's not perfect, as any Defender junkie will point out the strange enemy behavior flaws and the wonky ship controls. This port isn't exactly necessary, considering that the classic Defender was already released on another poor Midway GBA package: Midway's Arcade Classics, another title to stay away from. But it would have been a shame had the classic not been included in the remake of Defender, since the original game is way better than the original design that Outlook cooked up for this package. But before we go there, we'll hit the second gameplay option in Defender: XG mode. This is, essentially, the same exact programming code that's in Classic mode, but instead of the basic, retro sprites and simple mountain background, the development team swap those out with ~updated~ sprites that barely animate, and a photo background that looks like it was lifted from a college textbook picture of the Great Wall of China, and inputted through a 10 year old scanner purchased on eBay. Enemy behavior and controls are essentially the same, other than the change of thrusting and reverse-direction commands. This gameplay mode must have taken the programmers a night to implement. And it shows. But the real ~charm~ is XGP mode. And instead of taking the time and coming up with something clever for that acronym, I'll just tell it like it is: this mode is absolute crap. The game takes the Defender idea and thrusts it into a terrible mish-mosh of horrid graphics, animation that would make Terry Gilliam's eyes water, and gameplay that's essentially reduced to watching the radar screen and rapidly pressing the fire button before the enemy even has time to show up on-screen. Players can't instantly turn around and fire; the ship has to rotate around in a clumsy four-frame animation before they can blast away again. It just looks awkward and plays even worse. Bonus levels are interspersed between the main game, but they're just downright silly and thoughtless in their design; players have to weave their ship back and forth, avoiding incoming asteroids while picking up humanoids. But because the asteroids are zipping so fast and in a pattern that's near impossible to read right from the start, players end up dying two seconds after the level begins...with no chance to restart. There is absolutely nothing redeeming about this mode whatsoever, unless you count the ~co-op~ mode that utilizes the link cable, but that would require the purchase of a second copy of Defender, when nobody should even bother buying it a first time. Defender has been remade a few times, officially: Jeff Minter's Defender 2000 for the Atari Jaguar would have been a much better choice than what Outlook created here. Or, Midway's own Strike Force, the Defender revisit produced for arcades in the early 90s. With these options potentially available, it's just mind-boggling to see the shovelware created for the Game Boy Advance that simply capitalizes on the Defender name.  I haven't seen a worse classic remake since Atari botched Pac-Man on the 2600 more than two decades ago. I honestly cannot believe that the developers are patting themselves on the back after completing this awful Game Boy Advance project. They've pretty much ruined another established franchise with some of the worst programming and graphics ever seen on the handheld system. Retrogamers deserve much more than this, and it's obvious that Midway needs to stop handing projects to Outlook, because they obviously don't have the right stuff.", "date": "Nov 19, 2002"}