{"name": "Speed Racer", "name_review": "Speed Racer", "ref": "https://www.ign.com/articles/1998/03/28/speed-racer", "text": "Speed Racer is one of those games where you've got to wonder if the designers actually understood the attraction behind their source material. You've got a classic 70s cartoon where the main attraction is a racer that drives the Mach V, a super car with more gadgets than KITT ever had, in exotic racing competitions with villanous cars armed with everything from giant buzz saws to flamethrowers. If you know all that, don't go designing a straightforward racing game!  What you have in this game is a decent generic racing game. Players get to drive one of three models of the Mach V (Manual, Automatic, or Super), with differing acceleration and handling characterstics, and race on one course, with three different variations. Other cars are available, but you can only get to them with codes.  The race itself is fun, but nothing to be proud of. Framerates are fast, control is nice and tight, but everything else is blah. There's no reverse on the Mach V, and getting stuck in a corner is frustrating, but the race is so bland, you might not care. Graphically, the textures are bland, taken straight out of the developer's kit and unaltered. One player mode only doesn't help its appeal, either. If you're looking for a more distinctive and controller racer, Ridge Racer or even Ray Tracers does a better job of making standard material look original.  The action is  strictly arcade and restricted to racing. None of the Mach V's devices (auto jack, grip tires, homing robot, periscope, cutting saws, special lights) work on the other cars, and are useless for a standard race. The only time you'll need to use them is one the shortcuts, and really, only the auto jacks are required to reach the best ones. Computer AI is unintelligent, and once you know the shortcuts, it becomes more of a time trial than anything else.  Besides the name, there isn't much Speed Racer can offer. If you're a big Speed fan, then you won't be disappointed. Otherwise, the game one you can rent and forget forever. If you're looking for something with a bit more weight and depth, Need for Speed 3 is a much better buy.", "date": "Mar 28, 1998"}