{"name": "AMA Superbike", "name_review": "AMA Superbike", "ref": "https://www.ign.com/articles/1999/10/19/ama-superbike", "text": "Most developers nowadays are looking to the Internet for the future of gaming, but through the same pair of glasses, it seems. EverQuest has proven that online RPGs are here to stay, while Quake III: Arena has already shown, even in its current early stages, that multiplayer fragging is at least as satisfying as actually leaving the house and seeing what the sun looks like; if you were to believe the publishers at large, that's all there is out there for multiplayer sustenance. Every game has an online component nowadays, but few other genres are reaching out to create a growing community and competitive tournament atmosphere -- save for MotorSims, who have released AMA Superbike as the first of a series of games that hope to put online racing into the same sort of atmosphere as its spell and bullet hurling counterparts.  If Quake Arena and EverQuest can involve users in long-term online gaming, then why can't other genres? So the UNO online network didn't explode as much as expected, and Cosmopolitan Makeover Arena flopped. There are certainly bigger cash cows to be milked. Like racing, for instance. Racing is all about competition and long-term skill development, and Motorsims is capitalizing on that fact by creating a community filled with tournaments and competitions. It sounds like the perfect idea to fill the world's road rash needs, with one problem: the actual game itself. Though AMA Superbike may pitch like a hit, the end product has too many frays and flaws to warrant the extended gaming (and monthly access fees) it demands.  Superstar Superbike  AMA Superbike was touted from the start as a game crafted with the support of the AMA. With the final product, you wouldn't just be taking on a series of simple races -- you'd be able to adjust every nut and bolt on your bike, customize it, race it, and then compete it against other real gamers around the world. In the final version, you're able to select from a series of high-end bikes such as the Suzuki GSX-R750 and the Kawasaki ZX-7RR and squeal their tires on famous tracks like Daytona and Sears Point Raceway. Once you've selected a bike, you can then customize your transmission and suspension, and test out the settings on the tracks. It's clear that the designers wanted to give simulation fans all the customizability of a real race. Being able to tweak your suspension down to custom ~rebound damping~ settings may seem like more work than fun for arcade-style race fanatics like me, but it's essential in today's ~more is more~ world of simulation gaming. Once you feel comfortable with your bike, then you can try out a race against computer opponents, before finally taking the game online and testing out your skills against real players.  The documentation provides you with some tips on how to tackle the courses included with the game, written with the help of real racers. The instructions are clear and fun, and keep the game from getting to bogged down in the intricate details of fine tuning. The manual provides some basic information, but leaves advanced options like what each suspension and transmission option does to the experts. I would have like the comprehensive detail of a manual such as NASCAR Racing 3, but Motorsims does a good job of getting you out on the road with some idea of how to take on some of the nastier turns and curves you'll come across.  Like most simulation games, you won't find any music here -- the sounds are sparse, but nice, if not a little tinny. The tracks are rendered with a good amount of crisp detail, bikes supply you with great detail, and some good animations as you lean through corners and take off from a standing start. The first-person mode is even more impressive: a polygonal steering column is rendered in nice detail, though oddly enough, without hands actually grasping the bars, and turns give you the true feeling of leaning down to ground level. Slow down, and you'll rise up off of the bike, and slam into a turn and the bike will almost disappear from view. All of this is done in a smooth animation, as long as you can get a controller to work, and respond correctly. Which is exactly where this entire game begins to crumble.  Bug Country  Trying to eke out a normal online (or offline for that matter) gaming experience is like trying to run through a minefield armed with nothing but a magnet and a keen sense of smell. All of the initial beauty you'll notice as you begin playing is sunk by the lead weight of overweight, surly bugs. And we're not just talking about small glitches, either.  Have a SideWinder game pad? Good. You won't be able to use it in this game, but it's good that you own a gamepad. Have a keyboard? Bad. Seems the current version of AMA Superbike doesn't get along too well with keyboards (something to do with AMA's mother and keyboard's rowdy bachelor party), and even though the manual gives you the keyboard hotkeys, and provides you with the option in the settings, it still won't work correctly. In fact, the only controller that I could get to interact correctly with AMA Superbike was our Logitech Formula Force wheel, which worked smoothly, but with some lag -- and that was in the one player mode.   Like I said, the animations are smooth, at least when you're actually on the bike. Crashing becomes an event in itself, especially if you've seen the Exorcist. It seems that the little ~pre-race ceremony~ that the pit-crew has been making you recite is some sort of Satanic ritual, because when you crash, you'll notice some very supernatural occurrences -- riders flying through the air like toys, bikes sputtering and spinning on the pavement like tops, and bikers flying off the handlebars of a bike only to hit the ground and ricochet back like bungee jumpers (if you don't believe me, check out our movies documenting the good and bad side of Superbike racing). At the very least, you'll notice riders that spin around on the ground like action figures in stiff positions. And that's on a good day. The physics are very, very off, but again, it's not enough to bring down an entire game. That's where the online experience comes in.  First off, you may find that you can't ever find a game up and running when you want to play, even though you've registered, copied the needed files into your folder by hand like the instruction have told you to, and clicked the ~online~ option. After searching the chat boards of the Motorsims site, you'll find that you forgot to click the ~save password~ option, which Motorsims currently has to have to recognize your name on the network. Once you finally get into a game, you're taken into a world of stop-and-start bikes that will stall, then suddenly rocket to 50 feet in front of you in a matter of seconds, with no consistency. It's impossible to judge where the other bikes are in relation to you on the track, and even harder to take on a serious competition without becoming exasperated at the very process.  Keep in mind that all of these problems come after downloading the update patch, which makes me shudder to think what the game played like before. The forum boards at the Motorsims networks are filled with users complaining, pleading, or screaming about the problems with the game at this stage, and with good reason. A program this buggy just shouldn't have been released until it was completely finished. The inability to recognize controllers, the sketchy online gaming component, and odd bugs all add up to a frustrating experience that's likely to leave you much angrier than the average rush hour traffic jam.  The moral to all of this? If you're going to involve the world in an extended beta, then at least don't charge us for it. AMA Superbike may turn out to be a good game in a few months, but at this stage, the only challenge you'll find yourself taking on is the challenge of getting it to run.  -- Vincent Lopez", "date": "Oct 19, 1999"}