{"name": "No One Lives Forever", "name_review": "No One Lives Forever GOTY Edition", "ref": "https://www.ign.com/articles/2002/11/21/no-one-lives-forever-goty-edition", "text": "Sure, No One Lives Forever may be a few years old. And sure, the sequel to the game has already been released on the PC. To that, all I have to say is WHO CARES! No One Lives Forever (NOLF) combines a first-rate plot, grandiose explosions, superb dialogue, and plenty of trigger-happy action to make for one of the best gaming experiences I've had this year.     In NOLF, you play as Cate Archer, 60s super-sexy spy supreme who's job it is to help Unity prevail over the evil organization H.A.R.M.  The comparisons to Austin Powers are obvious (although if I hear one more person say ~It's groovy, baby!  Yeah baby, yeah!,~ I'm going to punch them in the face).  Cate and Austin are both gaudily-clad, smart-mouthed, British secret agents in the vein of James Bond, only Cate looks a little sexier in a skin-tight red and white pleather jumpsuit.  As a matter of fact, NOLF is chock full of scenes directly out of memorable Bond movies, especially the worst one of them all: Moonraker.  Not only does NOLF include an obligatory stint on a space station orbiting the earth, but also an extremely cool ~jump out of a burning plane and catch the guy with the only parachute~ level which fits in perfectly with the campiness of the game.  Because of the quality cinematic feel of NOLF, you really feel like you're playing the lead role in a spy thriller.  The designers and writers did a great job of using the story to give you plenty of character background, so you don't feel like you're just playing a floating hand with a gun attached.  The humor in NOLF is actually really funny, a rarity for video games, and the cinematics are filled with one-liners, like Archer's partner assuring her, ~I can be subtle,~ and Cate replying, ~Then explain that shirt.~  There's also a running code phrase gag throughout the entire game.  The writers were obviously inspired by the stereotype of the typical game programmer, because when you meet your secret contacts for the first time you invariably go through a conversation similar to this one:    Contact: Hello there.  Do you sleep with strangers? Cate: No. Contact: Then let me introduce myself. Cate: And let me introduce you to the local law enforcement agency. Contact: Why do they make us say this juvenile dribble?  Don't they ever get out?   Excellent voice talent helps the humor and story along, as do the in-game cutscenes, which has always been an inherent strength of the LithTech engine.    The graphical quality falls somewhere between Quake III and Unreal Tournament.  It's not quite as pretty as QIII, but the tight high-quality textures look absolutely beautiful, and we certainly know now that LithTech 2.5 can do gaudy 60s patterns with the best of them.  The lighting effects and character animations are unmatched.  Models roll, duck, and dodge, and when characters run, their torsos and fly threads bend with each footstep.  Character models are enhanced with blinking eyes and 3D eyebrows, making them look extremely realistic...well, as realistic as formulaic full-bodied German Operatic singers and drunken Scottish thugs can be.  All of this graphical power doesn't seem to tax the system all that much either, as the game ran smoothly on a G4 733 with a Radeon 8500 -- a pretty middle-of-the-road to low end system by today's standards -- with full detail in 800x600.  Like the graphics, the sound in NOLF is superb.  The sound techs have really gone all out with high-quality 3D sound effects and surround sound, and the spot-on 60s soundtrack adds the perfect ambiance to the game.   Okay, so enough with the feel and look of the game, what about the game itself?  It rocks!  The game is a mix of Thief, Half-Life, and Unreal, and there's a little something for every type of action lover out there.  You're a secret agent, so you can opt to be sneaky and make your way around each level avoiding cameras and taking out any opposition silently, or you can turn it up a notch and go with a full-blown bullet fest. While you're given commendations for taking a non-direct approach, you're not really penalized from going in with guns blazing, so if that's the way you want to play, by all means grind down the safety switch and never let go of the trigger.  Cate has access to a wide and varied arsenal as the game progresses, everything from your standard pistols, machine guns, and sniper rifles, to the more peculiar laser gun and briefcase rocket launcher.    Speaking of enemies, the bad guys (and girls) in NOLF sport some pretty nifty AI, and rarely left me feeling like I was taking down lifeless dummies. Enemies jump out of the way of fire and actively seek cover (or make it themselves by knocking over tables and the like), peaking their heads out only to send a small burst of bullets your way before hiding again.  They will also sense you through sight and sound, so you'll definitely want to slink around corners and use silenced weapons if you're the type who doesn't like a full frontal attack. This game really is a challenge, and you'll often find the best route is to avoid the enemies altogether, whether you're a silent killer or a gun-toting badass.   Guns are nice and all, but since Cate's a spy, she has a multitude of neat little gadgets at her disposal as well.  NOLF is a world where hair barrettes are useful for picking locks and sunglasses serve as miniature cameras.  Exploding lipstick comes in handy when you want to clear a room, and sleep-inducing perfume is a great way to sneak past a pesky guard without creating too much of a ruckus.    Objectives vary from level to level.  In some missions you may have to protect civilians while taking out a contingent of H.A.R.M. agents, while in another you may be encouraged to avoid enemy contact altogether while taking pictures of important secret documents or saving an important scientist.  There are some puzzle elements in NOLF, but this game is all about atmosphere and action, so they're easy to figure out and hardly slow you down at all.     Of course, what would a spy thriller be without a myriad of fabulous foreign locales?  In NOLF you'll find yourself in Germany, the Caribbean, Morocco, undersea in full S.C.U.B.A. gear, and, as mentioned earlier, even outer space, as well as a multitude of other locations.  The level design is excellent and, although the levels are completely linear and it's nearly impossible to get lost, Monolith employs some neat trick in NOLF -- like traversing the sewer to avoid a large group of guards.  In addition to your mission objectives, you'll find ~Intelligence items~ of various forms scattered around each level -- from dossiers to maps, rolls of film to suitcases with handcuffs attached.  These sometimes provide helpful information to help you progress through the level, but more often contain jokes, some of which are very obscure, but leave you laughing aloud once they hit you.    While NOLF is primarily a single-player game, multiplayer is a spot of fun, but it's nothing special.  There are two ways to play: deathmatch and an objective and team-based mode entitled H.A.R.M. vs. Unity.  There are only four deathmatch and six H.A.R.M. vs. Unity maps included with the game.  Network code is decent, although not as good as Quake III or Unreal Tournament, and lag was definitely a bit of a problem over a modem.  Even on a DSL line, lag was still a problem, with enemies jumping around the screen on some servers...but I'm going to blame that on the servers I was connecting to since it didn't always happen.  A lean button would have been a nice addition since you'll often ~peak~ around a corner only to leave your entire body open to attack, but that's just a minor quibble in light of how great the overall game played.   NOLF is a shooter with a brain and a sense of humor...let's just hope more developers will jump on the bandwagon and give us a shooter experience like this.  It's stylish, it's smart, it's witty, it's campy, and it's a whole lot of fun.  What more could you ask for?  As much as I'm going to cringe by impersonating Austin Powers, ~It's groovy, baby!  Yeah baby, yeah!~  Feel free punch me in the face now.  -- Tal Blevins  About the Mac Version The port by Mumbo Jumbo is just about as good as it gets. I've been playing for untold hours since opening the box and haven't really encountered any glitches. The game has surprisingly low requirements and looks great running on our test machine, a 733 with a Radeon 8500. The PC version had a number of problems with graphic card compatibility, especially on NVIDEA MX2 cards, but I didn't encounter any of those problems running it on our NVIDEA card.  The Mac version of the game is the ~Game of the Year~ edition and comes with four extra levels and a music CD as nice extras.   NOLF is also multiplayer compatible with the PC version of the game so you can go online immediately and start putting the hurt on our computing friends who have gone to the dark side. The game is definitely more laggy than some other recent FPS titles we've received, however.  Overall, a fabulous Mac version of this top notch game.No One Lives Forever is not a tight game. It's not a game that controls very well, and it looks old and dated. But the game's design, storyline, hilarious characters, and witty dialog are all so consistent and healthy that Monolith's game somehow survives its production problems intact. The game offers an immense variety of missions, and because of its focus on stealth, I enjoyed it, despite its flaws. It's also a huge game, providing a minimum of 15 hours of gameplay. As a strict single-player game for PS2 owners, it's worth playing, primarily as a rental -- Definitely as a rental. Anyone who enjoys PC FPS games on a regular basis won't even want to look at it.", "date": "Nov 21, 2002"}