{"name": "Star Wars Bounty Hunter", "name_review": "Star Wars Bounty Hunter", "ref": "https://www.ign.com/articles/2002/11/22/star-wars-bounty-hunter-2", "text": "LucasArts has been hit and miss with their Star Wars games for the last couple of years. Never quite capturing the same level of excellence that it achieved with the PC legend, TIE Fighter Collector's CD-ROM, the demand for a near-perfect Skywalker title continues to increase. And though the company has had success in that field (Super Star Wars and Jedi Outcast in particular spring to mind), it's also had quite a few failures (re: Rebel Assault, Masters of Terras Kasi). Even the most of devoted of Star Wars fans have come to recognize their franchise's spotty track record, and in the case of anything other than First-Person Shooters and Space Combat, don't expect much at all.   George and company's latest endeavor however, is fortunate enough to find itself among the better games in the series. A third-person action/adventure with plenty of personality, Star Wars Bounty Hunter has come a long way since we first saw it in Los Angeles at E3 2002. Still plagued with some of the same technical issues and A.I. hiccups that the demo version had, the retail copy of Bounty Hunter has managed to transform itself into something far more appealing than first thought. And in one of the more unique moments of this holiday season, surpassed our expectations by quite a bit.   Story  Taking place immediately after the events of The Phantom Menace and telling the story of how Jango Fett was chosen as the prototype for the Clone Army, Bounty Hunter is an intricately woven tale overflowing with characters and places that are both familiar and foreign simultaneously. Centered on the mysterious and deadly cult known as the Bando Gora, the game begins with the Sith Lord, Darth Sidious commanding his new apprentice Darth Tyranus to do away with the Bando Gora and their rogue Jedi leader. A scourge of both good and evil inhabitants of the galaxy, the Bando Gora have been sabotaging various industrial facilities around the universe. It's decided by both Tyranus and Sidious that a tough as nails bounty hunter should be employed to take out the cult's leader and put an end to their meddling forever. And that's where Jango Fett comes in.   Of course, there are other bounty hunters who want the job too; Jango's brutal rival Montross and the up and coming student Zam Wesell to name but a few of them. It's your job as the alter ego of Jango Fett to meet the missions laid out in front of you, collect on the extra bounties throughout the universe, and prove your worthiness to Tyranus to win the contract. Naturally, there's more to the secretive plot than this, but giving that away would be criminal. Trust us when we say this though, the story is put together extremely well and follows the Star Wars vein near perfectly.    Gameplay  For a third-person action title, Bounty Hunter is a little on the complicated side. Or so you would first think when growing accustomed to all the different weapons at Jango's disposal. Given all manner of items and guns, your lead character is one bad man. Twin Blasters, Gauntlet Whipcords, Flamethrowers, Thermal Grenades, Sniper Rifles, Missiles, Heavy Blasters, and Grenade Launchers are some (but not all) of the weapons that Jango has access too from the onset of the game, and he only gets more powerful from there. Oh and let us not forget our anti-hero's trusty (but limited) jetpack!   One of our biggest concerns initially was that since Jango begins the adventure with so many goodies at his disposal that there wouldn't be much to do as the game went on. LucasArts was worried about that too, and as a result has limited your ammunition on everything but your Twin Blasters and Whipcord. While you may begin some levels with certain weapons already available, you'll have to use them sparingly. If you don't, you may find yourself in one heck of a bind later on when you're facing that stage's more difficult opponents.    Another way they addressed the issue of finding things to do was to add secondary and tertiary sub-missions to your main goal. So while your primary chore may consist of bagging a wanted mob boss, your lower-end goals would be to pick up on wanted criminals throughout the galaxy as you go along. Of course, you can't just shoot random people (that works against your score for the running stats that the game keeps track of for you), so you have to identify the wanted men and women. To do so, a simple flick of the directional pad or circle button cycles you through the various items in your inventory. Once you come upon the picture of Jango's helmet, press the R2 button and the POV switches towards a first-person mode that's overlaid with futuristic-looking grid. This tool will help you identify your targets, tell you who they are, and how much will be paid for them. And while it would have been easier to let the developers just let you shoot them and be done with it, you must instead use quite a bit of skill to get credit. As not only do you have to mark them with the Square button to signify your intention of collecting them, you must also pay attention to their bounty status: some of these guys need to stay alive instead of being killed. Screw that up and kill them accidentally, and you lose the bounty all together. Though it can be remedied by replaying the level once you've beaten it, it could save you time and repetition to get it right the first time.   The system doesn't work quite as effectively as it should though, as once you've gone into the scan mode, you have to track your target, mark them, and attack or bind them with your chord right there. After you've accomplished that, you must then move out of the first-person view, walk up to the bounty, and press triangle to claim your prize. The whole process is pretty clunky, and there should have been a way to streamline this to make it more fluid --especially in the heat of a battle when your mark is mixed in with four or five other opponents. It works the way it is for sure, but it certainly could have been fixed to be more intuitive than it currently is.   Another qualm we had was that of the enemy A.I. It takes awhile before your opponents truly become difficult, as the early beasts and aliens you encounter lean towards the long end of stupid. Standing there with their blasters and axes drawn, the uneducated creatures do little to hit you with their attacks if at all. An easy accomplishment to take out five or six guys in the early going, your truly intelligent enemies don't start making appearances until the Entertainment District, which is a sizeable chunk of time throughout the game. Even then, the tough boss monsters and difficult minion dudes have a habit of staring at you for a while to make their patterns and intentions easily decipherable. It's not that bad really, but we've seen smarter opponents who have similar roles in games like The Mark of Kriand Hitman.    The game is still incredibly fun too play though, and makes good use of its true 3D stature. Packed with more puzzles than it lets on, you have to use a sizeable amount of brainpower to successfully navigate the well-designed stages. In one example, Jango must begin the stage fighting against a giant Borhek inside an enclosed arena before escaping and using his cutting torch to create a door for himself near the elevator. After traveling up the elevator and activating a control room switch that opens a secret pit inside the arena, Jango must then travel back down the elevator and head into the pit to a lower level. Once there, he must crawl through a side gutter, cut open another door in the sewage system, jump over a couple of hanging platforms, and finally face his first group of humanoid enemies. And this is just in the first third of the very beginning level! Just imagine that type of setup across 18 levels and six different worlds, and you'll quickly realize how big (and how entertaining) the game really is.   Graphics  From the moment we ever laid eyes on Star Wars Bounty Hunter, we knew that this was going to be plagued with framerate issues. Extremely choppy and sometimes unplayable in its early form, the final code is still a tad on the robotic side. The level of improvement that they've made however is phenomenal and is easily one of the biggest FPS turnarounds we've seen in ages. Generally holding somewhere between the 30 and 40 mark, with the biggest drop occurring in the outdoor areas, Bounty Hunter looks pretty good --even if it's not the most fluid beast in the world.    The framerate's biggest enemies obviously, are all the details and particle effects that litter every stage. Rarely using the same texture twice, the intricate maps and superb artistry capture the look and feel of the Star Wars universe perfectly. Used in conjunction with the multiple laser blasts, explosions, flames, and other foreground object reactions at nearly every turn, Bounty Hunter easily creates one of the busiest and most atmospheric games in the recent history of Star Wars games. Not an accomplishment to be taken likely considering its present company.   Our biggest visual problem with Bounty Hunter however, wasn't its speed of animation but its camera instead. Controlled to a limited extent with the right stick, the angle of your adventuring is primarily made up of the CPUs idea of what's a good vantage point. And while the camera is in the correct place the majority of the time, it made enough mistakes to get us to notice. Particularly when we were traveling back and forth between closely positioned doors. If Jango isn't constantly moving through a tunnel and stops to do nothing just after the entrance for example, the camera will start to argue with itself (bouncing back and forth between near and far angles until you decide to move Jango again). It happens only a smidgen of the time in all truthfulness, but it was definitely enough to warrant a mention.   Something else that should be mentioned while we're on the subject, are the fabulous CGI cut scenes used for intermissions. Put together by the same team that does the special effects on all of Lucasfilm's motion pictures (Industrial Light and Magic) and shown generously throughout the experience, the high-quality mini-movies are worth every penny the price of admission. The ILM guys know their Star Wars folks, and it really shows through here. Especially when you fire the game up in the 480p progressive scan it supports -- it's awesome.   Sound  As everybody knows by now, Star Wars games don't mess around when it comes to the quality of the audio, and Bounty Hunter is no exception. Encoded by the guys at Skywalker Sound, the surround sound-enabled track borrows heavily from John Williams' Episode II score, with a few original tunes composed specifically for the game by videogame music legend Jeremy Soule. The best soundtrack since The Empire Strikes Back, the Attack of the Clones score is a great addition for Bounty Hunter and adds extra pizzazz to the already well-represented visuals.   The voices too are just as powerful, with Jango Fett and Zam Wesell being voiced by the same actors that portrayed them in the last film: Temuera Morrison and Leana Walsman. To add further credibility to the cast, former Highlander bad guy and Minority Report star, Clancy Brown has also been brought in as Jango's chief rival Montross. Professional voice actors and eerie sound-alikes have made the cut as well, and provide an excellent backup to the already strong vocal talent.   Just as expected, the usual round of Star Wars sound effects are in there too. From the classic slap of a laser blast to the ominous buzz of a lightsaber, the authentic Lucasfilm sound samples have rarely sounded better in a videogame. LucasArts went all out with the production values of Star Wars Bounty Hunter, and the sound in particular could be its strongest performer. Even without a high-end receiver and collection of speakers it sounds great, we just wish that a true 5.1 or DTS track had been included for good measure. The programmers included progressive after all, so why not the high-end audio support as well?Star Wars Bounty Hunter is a solid, if not technically challenged third-person action/adventure. Successfully combining our favorite aspects of the Star Wars universe with a clever stage design and a fantastic presentation, LucasArts has done a great job in suppressing the myth that games based on the Skywalker universe aren't any fun. A definite recommendation for Star Wars fans, Bounty Hunter isn't necessarily built for everyone, but for those of you out there who just can't get enough of this stuff, it's one of your better choices for this or any holiday season.", "date": "Nov 22, 2002"}