{"name": "Masters of the Universe", "name_review": "Masters of the Universe: He-Man Power of Grayskull", "ref": "https://www.ign.com/articles/2002/11/22/masters-of-the-universe-he-man-power-of-grayskull", "text": "One of the staples of 80s toonage has made the return to the airwaves (and toy store shelves): He-Man and the Masters of the Universe. Old-school fans shouldn't immediately leap for joy after discovering the Game Boy Advance game; TDK's title, He-Man: The Power of Grayskull is based off the brand-new series airing on Cartoon Network, not the uber-cheesy Filmation production of almost two decades ago. The GBA title isn't an overwhelmingly cool or clever design by any means, but it's got enough merit to be considered a solid action title. It's just a little quirky in its level structure and the adventures a bit on the short side. Features 13 levels Password Save Only for Game Boy Advance  Just as the new cartoon bases its formula on the original 80s show, He-Man: Power of Grayskull borrows from a couple of classic games for its design; namely Golden Axe and Gauntlet, with a little Viewpoint shooting action thrown in for a little more variety. Basically, you're playing as the Most Powerful Man in the Universe (tm) in a 13 level isometric action game, out to kick a little Skeletor booty. Each level has a ~mission~ of sorts, like rescuing Man at Arms or Cringer...but they mostly end up being the destroy-all-enemies/collect all tokens fare.   He-Man doesn't have a whole lot of technique to his combat skills; he's got a slash and a hold-down-the-action-button Super Slash attack, so all players really need to do is rapidly hit the attack button at an enemy, occasionally tapping the trigger button to block an attack from the opponents, if necessary. Enemies will keep marching into the area unless you eliminate the warp mirror-type thing that they're walking through. Unfortunately, it takes He-Man a good dozen swings to take these things out. Most Powerful Man in the Universe, huh? There are some platform jumping challenges, but these are the most unfair elements in the game; He-Man cannot walk off the edge of a platform due to an invisible wall of sorts, but the programming doesn't restrict him from jumping off...and if the collision detection senses that any part of He-Man leapt and landed beyond the edge of a ledge-- even his little toe -- it counts as a lost life.  The designers try to add a little variety to the hack-and-slash gameplay by sprinkling item pick-ups like keys to open gates, but there's no real hard puzzle solving in this game. At the end of each of the hack and slash levels, the game challenges players to go through the level quickly, picking up all the icons before the clock runs out for an extra life. The only change in action comes from the ~vehicular~ shooter levels (like riding Battlecat, for example), but these levels are extremely simple in design. Taniko, the developers of He-Man: Power of Grayskull, at least put together a nice looking GBA title. He-Man himself is rendered with several dozen frames of animation at different angles, and the backgrounds are nicely drawn at the isometric perspective, with no ~Escher~ effect that screws up the eyes. The developers lift a few stills from the cartoon, but don't expect any elaborate animated sequences. That's pretty much all she wrote for He-Man: Power of Grayskull; if you're looking for an extensive adventure, you're not going to get it here. Nice graphics, solid action...but the challenge is barely there.", "date": "Nov 22, 2002"}