{"name": "O.R.B.", "name_review": "O.R.B.", "ref": "https://www.ign.com/articles/2002/11/25/orb", "text": "Pretty. Organized. Frustrating. Uninteresting. These are all words that describe O.R.B., the new fully 3D space RTS from Strategy First that's been in development for going on 50 years now I think. After tons of delays I had expected to receive a nicely polished, well balanced, and interesting strategy game. Instead I found a game that is presented well and looks pretty good, but lags in the gameplay areas due to some frustrating AI, slow developing scenarios, and sometimes confusing movement system. After desperately wanting another Homeworld calibur game I can't help by feel let down by O.R.B. even if it isn't the worst game I've ever played.   O.R.B. takes place a hell of a long way away from Earth with beings not human. It's a tale of religious fervor and the epic struggle between two ancient and powerful races. You will get the chance to control two other races that aren't as powerful and get caught up in the middle of the mess because of some misunderstandings and refusal to rethink religious philosophy. These two races, the militaristic Malus and peace-wanting Alyssians are both the progeny of one of the ancient races, they just don't know it at first. They also both happen to live in the same solar system and have pieces of the same religious text called the Torumin. Unfortunately for universal peace and harmony, the two races interpret the same text in different ways. Soon the Malus under the belief that the Alyssians are the ~Great Betrayer~ that destroyed their creators, declare war and move to destroy the peaceful race for good.    The first campaign follows these Malus and their genocidal hunger while the second gives way to the survivors of the culling that took place in the Aldus system where the two races lived. I actually like the story itself and the fact that humans are nowhere to be seen. Just as in Homeworld it adds a sense of alien conflict and a universe much bigger than us. High tech, space faring religious nuts are just kind of weird, but a good kind of weird that leans toward the interesting. The name of the O.R.B. means Off-world Resource Base, which you'll be building a lot of, but they have so little to do with the story, it's a little strange they picked this title.    Also like Homeworld, the score and style follows the ambient sounds that bring on visions of vast areas of nothing. The echoing and hollow void that begs for something otherworldly and spacey. Finishing out the ambience are the unit acknowledgements that are given in the languages of the two races. They have a translation for them in the manual, but it's still a little hard to distinguish between them. The voice work for the cutscenes is spoken in English so that we can understand the story. In this case, I actually wish that they had spoken the scenes in the alien tongue as well with subtitles, but I think I may be in the minority about that. The thing that really annoyed me was that after all of these long years in development, they didn't bother doing voiceovers for the in-mission information when objectives changed. Instead it's all in subtitles that disappear from the screen too fast to be seen sometimes. When you don't feel like speed-reading though announcements and parts of the story, it can be a drag.     O.R.B. comes in with some beautiful visuals to help the atmosphere. You'll notice that space in this game is a little cloudy, which I'll just put up to the system residing in the middle of a nebula or some such thing, as space can be dull visually when all you see is black and stars. Ships are likewise nicely done opting to go with functional instead of incredibly flashy design in most cases. You can definitely see some Star Trek influence in the Alyssian destroyer. The problem I had with the game visually wasn't really in the overall look, but with the details. Where'd they go? Take for instance the bases that you build on giant asteroids. All they consist of is an entrance sticking out of a rock. There are no flashing lights or any kind of activity, only a portal where ships just fly in and out collecting resources. And when you attack one of these things, instead of attacking the only structure visible on the asteroid, ships will fire at the center of the asteroid itself. Destroying the structure has no impact on the asteroid itself and the hole merely closes up neatly after the attack is over. It just plain doesn't look right. Especially when all you get for destroying the thing is a tiny explosion where the entrance blows up. Lame. One thing I did like about the bases after you upgrade them is that you can zoom all the way in and check out the ships docked inside.   But where I really had problems with O.R.B. was in the gameplay. They took everything that Homeworld did right and twisted it in the wrong direction. Navigation is harder, AI is annoying and odd, objectives are drawn out with stupid objectives that are annoying and boring as hell in many of the missions, and have little strategic value.    Navigation is very important in a game like this. Being able to move your units along three axes is crucial to your success. Movement seems simple enough to begin with. All you need to do to give commands is hold down the ctrl key. Wherever you click on the map, the units will move. If an enemy is in the vicinity, you can click on it and your units will attack. The problem isn't really with the horizontal movement; it's with the vertical movement. The solution to the problem was to stick a side bar over objects in space that tells depth. While I appreciate what they're trying to do with it, it wasn't accurate enough for my tastes. If you decide to move on the Z-axis without the help of the little bar, it's a lot tougher. Perhaps the main problem is that using the right mouse button raises and lowers the destination point, but the right mouse button also rotates the camera making it very hard to see what's going where. Of course, there's the pause feature that will allow you to take as long as you need to make your adjustments, but if I used it as often as I needed to, levels would have taken twice as long to complete.   One thing I liked about the movement feature is that every time you enter into command mode, a grid shows up as well as a representation of every unit visible on the map so you can tell what and where they are easier (because half of the time they're tiny little red dots). In fact, the interface aside from moving was pretty slick. The build and research features were good, selecting between bases was quick, and finding units was easy. And all of it was presented and organized well. Unfortunately the grid, which I wanted to always stay at height zero, changed with whatever unit you were focused on confusing the issue quite often when giving orders to units that you weren't focused on. Half the time I would accidentally move units far along the Z-axis when all I wanted to do was move horizontally.    In order to ease the burden of selecting targets, friendly AI has been implemented that will pick targets for you. Unfortunately, units are not very smart about picking their battles. The AI is governed by doctrines that you can give your units that will tell them how far they should be willing to run to a base for rearming, how aggressive they should be when the enemy is spotted, what formation to adopt and so on. Unfortunately, there isn't enough gray area for setting up custom doctrines and half the time the default settings don't work the way they're supposed to so units you've set not to attack will suddenly be running off to attack a base while you aren't looking.     I have to say though, I only had the problem of units refusing to attack when set in aggressive mode a couple of times. Aggressive mode is really the only way to manage your units in the middle of a skirmish. Picking out individual targets for groups of units yourself only seems to confuse them. It's better to set them on aggressive so that they'll automatically switch units after the one they are after is destroyed. Unfortunately their skills at picking targets is a sad sack sometimes. The smallest units that sport the equivalent of a high velocity spitwad will turn and try to single-handedly take down a capital ship about 100 times its size and firepower. You'll also be chasing them down to give them orders after they decide taking a base, that's out of resources and posing no threat, is a higher priority than the ships that are actively firing at them. This means you'll have to focus your attacks. Engaging in two battles across the maps can be a bad idea when your AI decides to make some stupid decisions.   Even when you're posting all of your attention on one battle, you may have to fight with the AI. Sometimes, they will, no matter what you tell them, focus their attention wholeheartedly on one target. It doesn't matter how many times you tell them to attack something else, they'll disregard you and keep on doing what they want. I can just imagine the little bastards in the cockpits giving me the finger as they run head on into a fiery death.    Fighter class ships also seem to be incapable of matching speeds with enemy units. It makes chasing down and destroying resource freighters and recon vessels a pain in the ass. Instead of just pulling up behind the things and firing away, they'll swoop in for a round and then back off and then swoop in for another round. All of the sudden, you'll have run into a pack of enemy fighters, won't get the easy kill and will lose some of your units because they can't find the button that says ~match speed~. Homeworld had this. Hell you could even set them in a sphere formation so that they would surround ships in formation and fire on them constantly.    Formations themselves actually gave me a little pause as well. Whenever you attack units, formations would automatically switch into smaller groups. So if you have a group of 12 fighters that you were hoping to stay together to concentrate firepower, too bad for you. They'll split into two groups of five and one group of two that will follow their own vectors. Splitting the bigger group takes time and slows the extra groups down as they reorganize themselves for attack so one of the five groups will be flying far ahead of the others so fire is barely concentrated at all.   Two other problems with unit AI gave me a huge problem on more than one occasion making this game suddenly become one of those ~save early and save often titles~. First, I had more than a few of my capital ships straight run into asteroids. The first time it happened, I wasn't paying any attention. But all the sudden three of my destroyers were gone. That's a lot of money and resources that I'm greedy enough not to give up without a fight. After reloading a save and playing to the same point, I kept my eye on them and watched two of them choose to attack a base and then smack themselves on the side of an asteroid. Death wasn't instantaneous, but I couldn't get them to move away in time. The other problem was with capital ships moving in the opposite direction of the orders given. This mainly happened when telling them to attack or move close to bases or asteroids. They'll suddenly decide that the line point from their ship to the target is actually straight behind them. No matter how much encouragement you give them, they'll continue backing up unless you give them a new order. Once again, I'm forced to imagine the entire crew of 50 on my assault carrier flipping me off from the bridge. Assholes.    Maybe they were just annoyed at having to play some of the scenarios like I was. Some of them were just plain bad. Whoever had the bright idea of having to clear an entire sector of enemy units and bases was crazy. And boring. Boringly crazy. Not only does it take a long damn time to fly your ships across the map (you can only speed up 3x the normal which just isn't fast enough) but then you have to search out the entire map looking for that last base, which often turned out to be the last place I looked. Wandering a map devoid of any enemies for a half hour is terrible.      Hell, flying across a map in general is hell. Some of these maps are huge. And some of these huge maps have huge distances between the resource nodes. Add to that carriers that are slow as crap. And to that the need to have a carrier near the resources or your freighters will have to fly all the way back to the nearest base. Wait now, freighters are also slow! Now me mad! Me bash! Or at least I would if I wasn't so tired and bored. It's not like you can just leave some of these resources untapped either. If you even want to get close to researching all of the techs over the course of the game, you'll have to fight for every last drop, not to mention your unit cap only gets raised with each base you add to your collection.    What did you think of O.R.B.? The last thing that annoys me annoyed me in Homeworld as well. Both the Alyssians and the Malus have near identical technology. On top of that, fighters become nearly useless when capital ships are introduced. The only reason to even consider them is to chase down ships that are attacking your recon vessels or to help search the map for stray units at the end of a scenario. Destroyers and carriers can fire in any and all directions so flanking an enemy with torpedo fighters is just as disastrous as flying in head on. It's better just to sink all of your money into large capital ships or steal some that you don't want to pay for.After so long in development, I really expected more. O.R.B. isn't the worst game I ever played but after playing a much better version of it back in 1999 when it was called Homeworld I'm a bit disappointed. While I had my issues with the movement controls, it was really the lack of creativity and focus in the objectives that got me. Battles weren't big enough or really difficult enough (minus the errant AI) and resources weren't nearly plentiful enough. This type of game begs for an epic scale. Yet conflicts were almost always small and fleets were never ever big. I wanted a bigger fleet!If you really need to play a space RTS and have already played Homeworld and Homeworld: Cataclysm, then this might quench your thirst. I'd recommend waiting a little to see how Hegemonia turns out since it's also just been released. It's too bad because I was really hoping for another incredible journey into the depths of space.", "date": "Nov 25, 2002"}