{"name": "Defender", "name_review": "Defender", "ref": "https://www.ign.com/articles/2002/11/27/defender", "text": "Midway's modern update to Defender is identical across all three next-generation consoles, sans for slight visual differences. With that in mind, the following review was written for all of the IGN channels by freelancer Chris Roper. It has been checked for consistency by the IGNcube editors, and is aligned with their opinions. You'll, of course, find one of the site-specific editor's opinions available in the closing comments. The original Defender is one of those games that practically every old-school gamer has played, and the mention of its name usually brings a grin to their faces as a bit of nostalgia starts running through their head. The original game is a classic, and the new version aims to stay true to its predecessor more than completely revamping it. Defender's story is pretty basic, but it's a standard setup for a shooter. In the distant future, human civilization has been forced to colonize various parts of the galaxy after Earth had become a barren wasteland. The Manti, an aggressive alien race, are attempting to destroy mankind. The Manti and humans have been fighting it out across the galaxy for some time, but the Manti have recently started trying to wipe out mankind once and for all. The game pits players in control of Kyoto, a young pilot fresh out of flight school and ready for combat. Midway and 7 Studios have done a fine job at giving Defender a 21st century update. The game resembles the original arcade classic enough that it doesn't feel like they've only kept the name, but at the same time the game has been given enough of a facelift that they've added a few new twists to keep it interesting. For those that have played the original Defender, things should feel right at home as soon as the first swarm of Manti attack. The Landers are back, and move in pretty much the same fashion as they did two decades ago. Saving colonists from the Landers is also still a big part of the game, as is not getting killed from five directions at once.  THE FACTS:Fend off aliens and advance through a number of planets including Venus, Mars, and EarthMultiple gameplay modes include single-player and cooperative CampaignSix ship types with varying attributesEarn cash points and upgrade your ships with new armor, weapons, and moreAdvanced flight maneuvers such as barrel rolls and 360-degree loopsUse your ship to physically pick up and carry ground unitsStrategy comes in to play when you must position ground units such as tanks and missile launchersGAMEPLAYFor the most part, Defender is a straight-up shooter. Manti come in swarms from all directions, and it's your job to shoot them down as fast as possible without eating too many phaser blasts. Those are pretty much the basics, but there are a few more details that mix things up and make the game fairly interesting. The game is played in the third person, as players control Kyoto in her spaceship of choice. The controls are pretty simple and easy to learn. You can move forward, backward, turn, switch weapons, and fire. Flips and rolls are performed using the C-stick. Pressing left or right on the stick will barrel roll the ship in that direction. Pressing the stick up will cause the ship to perform a loop, and pressing down will cause a half-loop, ending with the ship flying in the opposite direction. The first two missions in the game are quick training missions to learn the controls, and after finishing those, piloting the ship should feel like second nature. The ship moves in a very fluid manner and it's quite responsive. The flip moves are easy to pull off, and help with trying to dodge the multiple shots that may be heading toward your ship at any time. Our only gripe about the controls is that moving in reverse is pretty useless, as it's extremely slow, and you'll just get pelted with enemy fire when trying to move backwards. Aside from that, everything is on the money. Players have the choice of two spaceships to take on missions at the game's start, with six ships becoming available by the game's end. Each spaceship's abilities are based around speed, armor, agility and strength, and each ship has its own set of weapons and upgrades. The spaceships are varied and balanced enough that there isn't really a dominant ship; it actually comes down to a preference of playing style rather than picking the ship with the highest stats. For example, I wound up using the second ship I unlocked for the remainder of the game, rather than switching to the third and then fourth as they became available, since I liked its weapon layout better.  Each ship can have up to five weapons, and usually come equipped with a basic gun, some sort of missile attack, and a special weapon. Between missions, other weapons can be purchased with money that you've earned, which is rewarded for killing Manti, saving colonists, and completing mission objectives. For example, the Defender comes equipped with a Pulse Cannon, some Fast-Lock Missiles, and an Energy Shield as its special weapon. A Railgun and Firebolt can be purchased to bring the weapon total up to five, but Volley Missiles can be bought to replace the Fast-Lock Missiles, and a Plasma Bomb can then be picked up to replace the Firebolt. Colonel Adams is your commanding officer and usually gives out the mission briefings, which range from saving colonists to destroying a fleet of Manti Landers. Most missions have multiple objectives, such as clearing a path for a convoy while also defending a mining rig. Sometimes multiple missions will be available to choose from, and some can be skipped. Each planet usually has at least two missions available at a time, so you can choose which you'd rather do first. After completing one of the missions, it's usually possible to just skip the rest and move on to the next planet. The downside to this is that you'll lose out on any money that could have been made in those missions, so your ship may not be fully upgraded by the end of the game. Most of the missions take place on some planet's surface. They're usually based around a friendly outpost, which normally requires you to keep it from being blown to smithereens. There are a couple missions that take place in outer space, though, and they are favorites of ours, due to the insane amount of Manti that attack at once. There are probably 50 or so Manti flying around at once in these battles, and it makes for quite a bit of trigger-happy fun. While Defender is essentially an arcade shooter, it also has the slight aftertaste of a real-time strategy game. Picking up colonists and dropping them off at a hanger can provide you with some health pickups, but they can also be used to create weapons with which to defend against the Manti. For every three colonists that are dropped off at certain buildings, they'll create special ground units like tanks and missile launchers, which can then be picked up by your ship and placed anywhere in the battlefield. Managing your time between fighting the Manti forces and placing tanks can make the difference in the mission outcome. Some missions are set up so that proper positioning of tanks and other ground units is necessary to keep things from turning into complete chaos. While it's important, manipulating tanks and whatnot is still a relatively small portion of the game. There's just enough to make RTS lovers feel a little at home, but not enough to alienate the gamers who are just there to blow things up. It's possible to complete missions without positioning ground units at all, but they do help a great deal. Most of the story is told through the mission briefings, which practically mirrors that of Starship Troopers. If you've seen the movie, you'll pretty much know what's coming. The Manti are referred to as bugs, there are references to some sort of ~brain bug,~ and the list just goes on. Colonel Adams is pretty much an amalgamation of all the high-ranking officer characters in Starship Troopers. The fact is, though, that this is a remake of an early 1980's arcade shooter, and we doubt that anybody expects the story to rival Shakespeare. The story sets up the mission locations and objectives well enough that they don't seem entirely random, which is all that's really important here. One slight weakness of the game is that while the story and RTS elements attempt to make it seem like the missions are an important part of a large war, the ship you pilot is the only friendly air unit in the game aside from drop-ships, which don't do anything aside from pick up and drop off colonists and ground units. The game wouldn't really resemble the original Defender at all if there were 50 other ships attacking the Manti with you, but certain parts of the game design make the lack of any friendly air force a bit apparent, and it actually feels a bit lonely in the sky at times. Another downside of the game is that it's just too short. Most people could beat the game in around 8 hours or so, even if they complete every mission. The game is fun enough that you might want to pick it up and play through it again on a lazy weekend, but once may be enough for most people. The game does include some multiplayer action, however, which may lengthen its overall value for some. There's a deathmatch mode, but it's so basic that you'll likely grow tired of it after a match or two. The other multiplayer mode is co-op, and that's where some extended fun may be had. The game's roots are in its arcade ancestor, so it's basic and action oriented enough that playing co-op a couple times with some friends may provide a bit of mindless and fun entertainment. GRAPHICSDefender's graphics aren't anything that you'd want to pimp your new 60~ HDTV with, but at least they're better than the original. Actually, the game's graphical charm is just how well it hints at the look of the original game, while updating it with passable graphics. Most of the missions are on planet surfaces, and the game does a good job of keeping the feel of the original rocky surfaces from the original version. Hills aren't nearly as jagged as before, since the original game used about 10 lines on-screen to display the surface, but they look almost as uninhabitable. The Manti look about as close as you can get to the original without reverting to Atari quality graphics, and move in almost the exact same way they did the first time around, quickly jerking in fast-motion. The outposts that many missions are based around are of similar, average quality. Texture usage is a bit bland, and the overall polygon count doesn't really allow for extremely complex models. The nice thing about these outposts is that they are fully destructible. If the Manti shoot down a tower, you'll be able to see it come tumbling down. The outposts are usually made up of quite a few different buildings, and since most of them don't need to be saved, a few of them may come down before the mission is over. The best part of the game, graphically, is the spaceships themselves. The craft designs are all excellent and fairly original. The ships look worn down and war-torn, if not sleek and stylish. You usually only see the backs of the ships during gameplay, but what detail can be made out during turns and rolls is quite nice. The other graphical standouts are the game's effects. Friends and foe alike will be highlighted in a fog of color in order to distinguish everything from a distance. Ships streak with exhaust and flame from their engines, and missiles leave a nice trail of flame as they cruise to eventually become the end of either yourself or your enemy. Explosions, gunfire and everything else imaginable look equally nice. Overall, Defender looks better than expected. It capture the feel of the originals while inserting plenty of modern graphical effects. While the story is a pretty weak rip-off, the cutscenes that help tell it are very well done. Most of the cutscenes just show quick clips of battles or something similar, and don't really contain any major plot points, but their quality is excellent nonetheless.SOUNDDefender's sound is basic, but in a fairly good way. The game uses many of the original's sounds, although everything sounds better than before, thanks to the fact that it's not running on a 1-bit sound card anymore. If you close your eyes and just listen to the game, the original will almost start playing in your head. Gunfire and explosions will remind you of little helpless men being snatched up by Landers, just as a little white pellet hits your ship and cause you to explode in a pixilated death. The only problem with the sound is that you might not appreciate it if you weren't around during the early days of gaming. In that case, the sound will probably come off as being pretty weak. Some of the voice acting is good, if somewhat contrived and a bit cheesy. The sound mix in all of the cutscenes is excellent, though. Defender is a fairly fun game, especially considering it's an update of a game that's about 20 years old now. It's pretty short, but it's also a fast, mostly mindless shooter, with a hint of some RTS elements thrown in, just to mix things up. The people who will appreciate this game most will likely have played the original Defender some, or at least will be those who enjoy a good throwback to the old days from time to time.", "date": "Nov 27, 2002"}