{"name": "The Powerpuff Girls: Relish Rampage", "name_review": "The Powerpuff Girls: Relish Rampage", "ref": "https://www.ign.com/articles/2002/11/27/the-powerpuff-girls-relish-rampage", "text": "They may look cute and innocent, but don't let that fool you. When evil lurks nearby, the Powerpuff Girls are sure to show up and kick some serious booty. The show's been quite a popular hit on Cartoon Network for some time now, and it even managed to spawn its own movie recently. Now, after a less than stellar history as videogame characters and a pretty bad showing in their last PSOne game, Blossom, Buttercup and Bubbles have finally made their way to PS2.   The Powerpuff Girls are in quite a pickle this time! Mojo Jojo, in his bid to become mayor, accidentally summons a race of mutated pickles to Townsville, and they plan to pickle the entire population. Can the Powerpuff Girls help the Mayor retain his seat in city hall? Can they stop a race of pickles from taking over the city? Will the Mayor ever be able to reach his cookies?   The Powerpuff Girls: Relish Rampage is a 3D action game where players take control over Blossom, Buttercup and Bubbles and fight against the likes of Mojo Jojo, the Gangreen Gang, Princess Morebucks and others, including those nasty pickles.   Gameplay  Players essentially control the three Powerpuff Girls as a whole, with one of the girls in the lead, while the other two fly close at her side. The lead girl is swappable at any time by pressing L3, where she'll move to the side and one of her cohorts will step up. The lead girl is the one who will do the most fighting, though many of the special moves in the game have all three girls team up to lay the smack down. For the most part, though, it doesn't really matter who you put up front. Each girl can acquire a couple of her own individual special attacks, but you're likely to primarily use group attacks or the standard Laser Eyes Attack throughout the game. Also, the girls share one pool of health rather than each having her own health bar. If one girl is dying, switching to another won't really help.   From the beginning, flying the girls around town seems to work fairly well. The left analog stick controls their horizontal movement, while L1 and L2 control their height. They pretty much only have three levels of height, though: their regular flying level, low, and high. At points, the girls can climb over top of small buildings, though they generally stay pretty low to the ground. Pressing R2 will provide a boost in speed, which makes getting around town much faster.   While the game seems to control perfectly fine during the first few missions, things start going downhill fast. For starters, the targeting in the game is absolutely atrocious. In fact, this game could be a frontrunner in the voting for ~Worst Targeting System Ever.~ The targeting system is extraordinarily flaky, as sometimes it won't let you target anything unless you're pointed directly at it, even if there's only one object around. Since the camera is fairly passive and you'll end up facing to the side or towards the camera at times, it can make locking onto your intended target very frustrating during fights where there are multiple enemies around.    The targeting system will also sometimes lock onto something other than what you're pointed at, which can be even more frustrating than refusing to lock onto anything at all. There are some spots in the game where there will be a dozen or so peons around a main target. The peons don't really do much damage if you keep moving, and you're sometimes under a strict time limit to kill the main object, so you need to be able to target it as fast as possible. You're forced to repeatedly target things in its vicinity until you finally lock onto your main target, and that sometimes takes forever. It doesn't help that many of these enemies move around quite a bit, and that only adds to the targeting frustration.   Flying around the city will also provide you with its own reason to yank out your hair. Everything seems to work fine while you're just flying down the open city streets, but numerous problems occur when attempting to maneuver around in tight spaces or where there are multiple objects or enemies. One problem is that the girls will sometimes get stuck on things when you're moving through tight areas. Normally, if one of the two girls flying on either side runs into a building, she'll sort of pop back into the group a second or two later, and it won't impede your movement. Occasionally, though, this doesn't happen, and you'll find that the girls won't maneuver around objects like you'd expect that they would. The other movement problem is that you'll sometimes get stuck between a couple objects, enemies or citizens while trying to fight something. You often won't even be able to fly upward at these points, and your only hope is to finish off whatever you were fighting before five enemies tear you a new one.    Most of the game's missions are based around a few different goal types, which include fighting, item collection, and protecting someone or something. The item collection goals are of the simple find-and-retrieve type, where each item must be found and taken somewhere before you collect the next. They're generally time based, and are usually easy if you know what you're looking for and where you're going. The problem with these is that the city is laid out in a less-than-normal fashion, and you might find yourself running into plenty of dead-ends before your time finally runs out. It'll usually only take a few runs at most until you finish these missions, but the city layout can be cause for words to be emitted that can't be printed here. The protection missions are pretty self-explanatory. You have to follow someone or something to their destination point and make sure they arrive safely.   The fighting missions make up the greater part of the game and successfully tie in everything that's wrong with the game into one giant pile of suck. The problems with targeting and getting stuck between objects make the fighting missions annoying, and it doesn't help that they're just not any fun. Your basic fighting consists of just punches and kicks, but most of the damage is done with special moves. Some of them are sort of neat, but you don't ever really need to use anything except for the Laser Eyes Attack. Practically every fight requires the same technique, so there's not much of a strategic difference in any of the battles.    Another of the game's various problems is that the missions don't seem balanced correctly. The first protection mission seemed to be the hardest, while the other two are pieces of cake. Some of the collection missions are way off in how much time they give you. Some of the collection missions early on will end with you barely finishing on time, while during one of the later missions, you're likely to only need half of the time they give you. Also, many of the game's bosses are also much easier to beat than some of the other big fights. If you circle-strafe around the first two bosses they won't be able to hit you, and all you need to do is shoot them with your laser eyes a few times. You could theoretically circle around them until the Sun collapses in a few billion years or so and never get hit.    The overall problem with the game's missions, though, can be summed up by a comment from one of the girls from early in the game: ~Is it just me, or does this seem a little too familiar?~ There are really only a couple different missions, and everything else is just a copy of those. Collect a bunch of kids and return them to the bus? Did the same thing, except with gems and the bank. Protect the professor on his way somewhere? Did that with the bus. Fight the Pickloids and take out random pods? You only have to do that a half-dozen times.   Finally, the game is extremely short, which is either good or bad, depending on how you look at it. It'll probably take around six hours or so to get through the whole game, though there are a few items you can go back to pick up. You're able to collect toys and photos during the missions, though they aren't really worth spending much time to search for them. The game is broken up into four chapters, but the last chapter is only a couple missions long. The game claims to have over 30 missions total, and while this may be true, most of them are beaten in only a few minutes.     Graphics  The game's graphics work for the most part. All of the characters from the show are represented almost perfectly in 3D. A shot of the girls from practically any angle will look like a cell from the show. Their animation matches up fairly well also, though they're small enough and usually far enough away from the camera that it's a bit subtle.    Some of the other characters' animations, though, aren't as complete as they could have been. The boss characters really lack in their variety of movement, and are probably the most noticeable in regards to limited animation. Aside from the fact that they're boring to fight since they hardly move or change styles, it's also not very entertaining to the eye to watch them mostly stand around. They don't convey a lot of character as they just stand around and shoot at you.   Townsville is represented decently, though it doesn't make the transition to 3D as well as the Powerpuff Girls' characters do. Although it looks fine if you stand still for a bit, Townsville looks pretty flat while you're flying around it. There's a fine line between keeping the look of the show and making a few adjustments to ensure it makes a nice transition to 3D, but skewing towards the latter would have probably suited the game better here. There's plenty of traffic and pedestrians roaming around, though, so the city does look pretty lively.   Sound  The sound is a mixed bag, and brings with it some of the game's biggest disappointments. As bad as the game is, it could have at least been somewhat fun to play had the dialog been written as well as it is on the show. Unfortunately, there are only a couple lines in the whole game that incite even the minutest chuckle. Most of the intended jokes fall very flat, and a decent portion of the game seems to have given up on even trying to write something funny, and instead lets the characters attempt to convey comedy simply by being there.   On the plus side, the game is voiced by the same people who work on the show, so every line is delivered as perfectly can be, though that still doesn't help the writing at all. On the down side, many of the one-liners become extremely repetitive. During some missions, will say a few different versions of the same thing, though they're essentially still the same lines. It sounds almost like multiple takes were used to try and add variety, instead of recording different lines altogether.  The Powerpuff Girls: Relish Rampage is a bad use of a good license. The writing is bad, the game's controls are exceedingly flawed, and the missions are extremely repetitive. There's not really much to like about this game, and unless you're such a fan of the Powerpuff Girls that even the sight of them makes you giddy, this is one game that should be pickled.Sadly, that last joke is about as funny as most of the game.", "date": "Nov 27, 2002"}