{"name": "Judge Dredd", "name_review": "Judge Dredd", "ref": "https://www.ign.com/articles/1998/04/01/judge-dredd-2", "text": "Shooting games 'draw' on that nearly indescribable quality that dwells deep in the hearts of men. It's that pure desire to shoot everything that moves. In the arcades light-gun shooters found immense success because of their ease of 'pickupability' (a new word), and tease that you can pick off every target thrown your way. So, what better game to make than Judge Dredd, the shooter? Saddle a great, violent comic book hero with the urgent shooter, and boom, success. Well, no, not really.  Judge Dredd the shooter has risen its helmeted head and is a disappointment to both Judge Dredd and regular old light-gun fans who just want to blast the heck out of their opponents. Yes, it's not just a shame that this game was permitted to appear, it's a sad, sad day for the entire shooting genre. Because even though a game like this will quickly slip into the deadly, boiling black vat of terrible games prior to it, Judge Dredd isn't even as good as the most average, mediocre, middle of the road shooters. It sucks.  Here are just a few major gripes... 1. In what should be a fast-action, reflex-style game, your character Dredd is exposed to an imbalance of opponents swarming the floor and vacuous periods of waiting for something or someone to appear. At least in games like Area 51 there are interesting patterns of baddies who also appear in contrast to their backgrounds. In Dredd, the camera moves while you're playing and the players shift out of synch across the floor. And they beam in to the game out of nowhere -- not a bad idea, just a dull one.  2. The opponents too often are indistinguishable from the background and the bonuses are even more obscured than the baddies. Giving an innocent who shouldn't be shot a different colored shirt -- which is done here -- is a good idea, but because each character is made up of so few animations and is so crudely displayed, it's nearly impossible to determine the good from the bad (and the ugly just keeps going as far as the eye can see). 3. Judge Dredd never would have made it in the arcades, period. The ultimate testing grounds for the most finicky players should be mandatory for developers who believe they can foist this crap upon the gaming public. After playing Judge Dredd side by side with Area 51, and then Time Crisis, it's clear that even Area 51 -- not a real killer home port -- is a far superior game. And Time Crisis is in a league stratospheres above even Area 51. 4. Many levels pit you against baddies who look amazingly similar to one another. They also take more than one shot to knock down. What's worse, however, is that automatic machine guns need shooting, too. What's the attraction, or the notion here? Is shooting immobile machine guns en masse more fun than knocking off humans?  5. The bosses are just plain stupid. OK, that was even true in a completely different game genre such as Sonic the Hedgehog, but at least they were fun to fight over and over again. Here, the first boss is a space ship that flies around and shoots at you. Again, what's the appeal? Where exactly are you supposed to shoot? Why don't we see a human getting knocked off after smashing through the window, or something close to innovation? I am trying to at least hate the bad guys, but even that's a stretch. 6. Judge Dredd enables gamers to shoot bad guys, and in between levels, gamers get to passively watch good FMV, of which we watched a lot. It's a strong testament to the FMV, which is better than the gameplay.   7. Response time is sluggish. Add to that the slow light-gun tracking, and you're already not just frustrated, but bored on top of it.  Now, let's count up the reasons why you should buy Judge Dredd.... 1. Decent FMV.  2. You can blow up most immobile objects in the background. 3. You can pretend you're Judge Dredd. But you'll have really try hard -- not a real sales pitch for any form of entertainment meant to immerse you.  Well, that's it, folks. I could write a lot more on why the game blows, but I think you probably have the idea loud and clear by now. We can only hope and pray that no companies will approach either Judge Dredd movies or videogames anymore. The comic book, which is still great, simply doesn't need other media bastardizing the heck out of it.  Douglass Perry", "date": "Apr 1, 1998"}