{"name": "South Park", "name_review": "South Park", "ref": "https://www.ign.com/articles/1999/10/20/south-park", "text": "After the stupidity of Political Correctness in the early '90s it was only a matter of time before we saw a backlash. Leading the charge was the wickedly naughty South Park featuring foul mouth grade school children. The irony, which was lost on the PC crowd, was that without their initial rantings we would never have seen a show like South Park. More than most social or economic groupings, South Park found much favor with those in the game business. Therefore it was little surprise when Acclaim snapped up the video and computer game rights.  Gameplay There are two game modes, Story and head to head. The Story mode has a back-story that includes a comet visiting the earth and all kinds of strange happenings occur as a result. Gameplay revolves around various levels and sub-stages as you control one of the kids in a standard first-person view firing at anything that comes your way. Can you battle your way to discover the source of the ultimate evil?   Well, the only things you can interact with are the enemies while all the town buildings, vehicles etc. are impervious to any snowballs or other weapons that you throw at it. This is a game that cried out for an active world that could provide numerous sight gags and one liners. Instead the static work just provides areas to walk through and obstacles to overcome.   Each of the four main South Park characters, Cartman, Stan, Kenny and Kyle can be selected and initially on each stage you must then track down the other three. This enables you to switch from one character to the next using various weapons. Enemies come in two varieties, Minions and Tanks. Tanks are a sort of pseudo boss  there can be more than one per level  while the Minions are your standard attack drones.   In the first level, Operation Turkey Butt, Cartman is off to the local Renaissance Faire and must fend off marauding turkeys. Whether that was a deliberate inside joke is unknown but at most West Coast Renaissance Faires the actors refer to the customers as turkeys. Inside joke or not, it gets very laborious very quickly just firing at rampaging turkeys who run headlong at you. Gameplay is literally follow the arrows, see something, fire at it, see the exact same enemy, fire at it. Repeat.   This is not to say that there aren't some good design features. A Transformer like figure as the ultimate evil or the dive bombing airplanes are both good ideas but you've got to play a long time to get to them.  Various weapons or gadgets are available including the snowball, dodge ball, toilet plunger and cow launcher. Cow launcher sounds funny doesn't it? And sure, the first time or two, it's mildly amusing but it becomes extremely monotonous. In a regular game, you expect a bazooka or a grenade launcher to act a certain way. However with humorous and/or silly weapons their continued sameness is repeating the same joke over and over. Only Mel Brooks in The History of the World Part One has shown an ability to take the same joke, ~It's good to be the King~ and make it funnier each time it is told. Moreover the enemies all die the same way. A toilet plunger or super sniper chicken interacting with different enemy deaths at least has the potential for some laughs.   In fact the forced and unfunny humor is the trademark of this game. I smiled three times when playing this game and I find South Park outlandishly funny. One smile was when I first found the Cow Launcher and then Cartman has two funny lines in cut scenes when talking about the Aliens. That's it. It is almost inconceivable that a show that has produced such classic set ups as the amazon forest loggers saving the kids from environmental extremists, natives and animals should then proceed to have a videogame that has less laughs than a bad episode of Suddenly Susan.   One of the few positive areas within South Park is the head to head multiplayer mode. Here in various locales you get to battle as either Cartman, Stan, Kyle and Kenny in classic death match mode. In fact the only reason to play the story mode is to get the cheat codes at the end of each level that give you new characters to play in the head to head mode.  Graphics and Sound An entertaining 3D rendering of the opening South Park credits is one of the few graphic niceties in the game. There also are decent cut scenes between levels that have Chef letting the kids know what the latest terror is that they will have to face. But really all you have are so-so graphics and excessive fog combined with weird looking enemies. Sure you can argue that South Park's cartoon graphics are lame to start off with and that's part of the charm but such graphics are part of the overall silliness and humor of the show. When you remove the silliness and humor all you are left with are the graphics.   The opening theme of South Park is a catchy little number and smartly this was kept. It sets up the game well. The background music is uninspiring but the occasional wise crack from one of the kids is reasonably entertaining. However each character only seems to have a half a dozen comments that get constantly recycled and it is annoying to have the same phrase repeated multiple times when you hit a character in head to head mode. However it is these comments that add much of the gameplay value to the head to head mode. Sneaking up behind Cartman and nailing his fat butt, with the resulting stream of expletives deleted, is fun for a few minutes. South Park is by far the most frustrating game experience I have ever had. Not because of the quality of the game but because it combines a phenomenal license, a respected publisher and one of the world's best developers. That should have been more than enough to create a brilliant game. Instead we have utter proof that everyone is capable of having a bad day.", "date": "Oct 20, 1999"}