{"name": "Silent Hill 2", "name_review": "Silent Hill 2 Review", "ref": "https://www.ign.com/articles/2002/12/03/silent-hill-2-review", "text": "Videogames that make you unhappy usually have significant problems and missing parts, and you end up frustrated because you paid good money for it. Konami's Silent Hill 2 will make you unhappy, but in this case it's because the designers are so successful at creeping you out and exposing gamers to the darker side of humanity. It's the side with creepy zombie things whose limbs are melted together. Silent Hill 2 doesn't stray very far from the versions that appeared on the PlayStation 2 and Xbox, but faithful porting and small upgrades make it comparable, competitive, and worthwhile.   Few genres rely on presentation (not in the menu/box sense) as heavily as the survival horror. Capcom set the standard with the Resident Evil series years ago, and Silent Hill has risen above all the other RE clones by sticking to the script. And that script says keep the gamers spooked from beginning to end with a combination of creepy audio and visual elements. With a set of unstable, untrustworthy characters, incredible atmosphere, and a slow, creepy haunt of a story that grows on you like an evil mold, Silent Hill 2 is just the ticket for gamers ready to get good and scared.   Still, the game doesn't break any molds or revolutionize the survival-horror genre in any particular way, but it tells a hard to figure, surreal story that's strangely heartbreaking and even a tad depressing. The control scheme doesn't get in the way of the fun, and the gritty, claustrophobic, visual style is enticing and effective. The fog? Well, it's thick as pea soup, there's lots of it, and now it's purposely there, rather than merely to hide the draw-in (it also hides crappy textures). Take that Turok your perpetual barbeque mist has been stylized!   James Sunderland gets a letter from his wife Mary asking him to meet her in their special place in the town of Silent Hill. That may not sound very creepy to you, but Mary's been dead for three years because of ~that damned disease.~ Our man Jimmy hasn't had much of a life since Mary died, so he ends up risking it while making his way through the suddenly deserted and zombie-infested town of Silent Hill. Zombies, life in jeopardy, dead people who write stuff? Sounds a lot like the IGN offices.  Naturally, a letter from the dead can only mean one thing, trouble. And James is headed straight for it. It's kind of subtle when you pass through the first major area, a cemetery where the fog is so thick you can barely see which way you're going. But, the point slowly seeps in, you're on a long, wild goose chase and the few people who are around can barely help you, let alone help themselves. For me to tell the rest of the story would be to spoil the game, so I'll just leave it there. Hint, hint... Bad stuff happens.  In Born from a Wish, the extra scenario tacked onto the singleplayer whole, players get to play as Maria, one of the characters James meets in his travels through the town. Her adventure in Silent Hill is very much a side story in that it feels like something that would have been left on the cutting room floor of a movie. It's too interesting to peacefully coexist alongside the main story and not interesting enough to make a full game. It's a nice bit of extra survival horror that you're getting for free if you make Silent Hill 2 PC your first Silent Hill 2 experience.   Within the survival-horror genre, cinematic camera angles have become a fixture of sorts that serve to create a genuine mood or feeling. Konami's developers have endeavored to create fixed camera angles complemented by moving, roving cameras that provide the player with a respectable level of control over what they're looking at. But that doesn't mean it's not without its problems. Manual control is provided for, but stumbling out of a narrow doorway into a narrow hallway always means trouble. Thankfully, even blindly running headlong into a foe isn't disastrous, so the often twitchy setup is forgivable. I guess because I'm a PC player by nature, I'm wondering why the whole damn thing wasn't just in first-person or fixed over the shoulder, a la Max Payne or any FPS. The twitch isn't all bad because the camera more rolls than jerks. It takes a bit longer to get the thing into position, but a rolling, smooth camera is far preferable to an erratic, jerky one.   The best example of how this scheme doesn't work is found in aerial enemy fights. In Resident Evil bats, crows, and other winged things would have at you. In Silent Hill 2, creepy, caged, humanoid freaks hang from the ceiling and try and choke James with their feet. It doesn't matter. Far more damage is taken than is necessary when engaging in fights of the sort. The best way to aim is by looking down the barrel of a gun, not off to the side from some gorgeous, mood-setting viewpoint.          Cameras, zombies, weird stories... They're called survival horror games, but the truth is you spend more time solving puzzles than Columbo in Silent Hill 2. You'd think the only problems to be solved would be all of the monsters roaming around town, but finding items and unlocking doors is the order of the day. It ends up as a very linear game even though the town is huge and you have to walk everywhere. When you don't know what you're supposed to do next, SH2 can be very frustrating, but then again, if you're playing, you're probably familiar with general survival horror and a bit of frustration does come with the territory.   Still, the fetch this, go here, fetch this some more style of game shouldn't be a design necessity. I don't see why we can't get a bit more logic included, why all the doors have to be locked, and why I need to put the juice where I need to put the juice.  Between the fetching, the variety of puzzles keeps players involved. One time it may be placing plaques in the right order on a statue, another time it's simply a matter of recognizing an item that you've had in your inventory for the last half hour. The puzzles serve as an additional stimulus so that you're not just creeped out all of the time while running around looking for keys. Things like disseminating scratches on a wall to unlock a clock puzzle, Rubic's Cube style problems, and even an interesting radio quiz show spice it up.  For those who had a hard time with the puzzles in Silent Hill 1, the puzzles here can be adjusted independently of the game difficulty in the options menu. Playing on the medium difficulty, I found that the puzzles are all do-able, neither too easy nor too hard.   You end up doing a lot of running through the buildings and streets of Silent Hill. In fact, you do more running than anything in SH2 because you're either looking for clues, backtracking to use some key or special item you just found, or simply trying to figure out where you're supposed to go next. But the running around is how you experience the game's most important element: the creepiness. You're running around dark and dingy hallways through thick layers of fog that seems to cling to the ground. It's when you're shuttling back and forth that you'll hear all of the scary sounds of creatures far off in the distance. And this is when you realize that you're not just running in circles for no good reason. Silent Hill relentlessly messes with your sense of well being.   Just like Konami achieved in its first Silent Hill on PlayStation, Silent Hill 2 is a study in surrealism and eerie, psychological fright. The game gets setup from the start, slowly drawing players in with loads of atmosphere, unsettling environments, and unstable characters. As James learns about the town and what he's up against, the sense of creepiness doesn't subside a bit. Strangely, every little thing in the game works to create a chilly feeling. Footsteps on grass, cement, broken glass or water, all sound differently. The clanging metallic music and sound effects are more than effective. The radio even works to scare me. Just like in the first game, the radio volume grows louder with static as nearby monsters approach, signaling what's coming up next. But instead of lessening my fright, it did just the opposite. Whenever that radio static grows, I grow anxious, and my bladder starts sending me signals (~run!~).   The same mellow and unemotional ramblings of the typical confused hero that may or may not have sounded good in Japanese are present. It's all lifeless and tends to put one to sleep faster than an episode of Drawing with Paul Ringler or a Bob Ross seminar. But now there's the option for 7.1!?! Now, I'm not the best reviewer in the world, so I do not have a 7.1 system hooked up around my computer, but even without it, the creepy clangs, thumps, thuds, and small beats wrapped around the whole of Silent Hill 2 help further startling its victims -- its players.     The sheets and sheets of volumetric fog, truly the thickest I've ever seen in a videogame, create a claustrophobic feeling that destabilized me like never before. It's so thick that you can't see more than 10 feet. But inside buildings, players have different visuals to deal with. Once inside any building, players usually are placed in dark hallways and the chest-high flashlight helps to create an additional effect, where shadows drape and things in the player's path truly illuminate. It's truly an amazing sight.  But beyond that you get exquisitely detailed characters and environments that will fool many grandparents and other non-hardcore gaming types into thinking you're watching a big time Hollywood movie. But Kevin Costner couldn't hang in Silent Hill the way James Sunderland does with you at the controls. The animation isn't very elaborate or very quick for any characters in the game, but they look damn good standing still. And smaller movements like mouths opening and eyes blinking all work very well.       Typical to the genre, characters exhibit a stiff and almost lifeless, disjointed kind of animation. It's the one that portrays people running endlessly into walls and moving as if they were preprogrammed puppets, which they are. The in-game cutscenes are a bit more fluid though, since they are done the way the designers wanted them to be. As an interesting note, the nearly perfect CG of the Xbox version has been compressed significantly and now looks noticeably more like video than real-time magnificence.   The monsters are extremely original and do an excellent job continuing the creepiness. Most of the early enemies looked like shiny haunted mannequins with anatomically incorrect physiques. Take a look for yourself and see what they remind you of. More often than not, it's their appearance that creeps you out, not their random flailing animations, but that's the way things are in Silent Hill.   One of the key additions to the Xbox version, and again to this one, is the option to turn off the grainy Noise Filter implemented in the PS2 game that almost made the whole thing look like a WWII newsreel. If you do turn the filter off, you'll be able to appreciate all of the visual elements that much more, plus it's a great way to feel like you're getting something the PS2 gamers missed, since their hardware is so sorely lacking.   Keyboard play is possible, but not advised. This game is meant to be romped with a solid controller. The Firestorm from Thrustmaster, or any PS2 adapter works wonders and comes with the highest recommendation.   Eternal Darkness has this beat hands down when it comes to combat. Even though I wanted more from that game in this regard, I'd settle for its melee and ballistic system over this one any day of the week. At least SH2 comes with the thoughtful inclusion of directional and pivot control. Directional is good for normal navigation (hitting a direction moves the character in that direction), while the pivoting mode is good for combat, where backing up can sometimes be a bit essential. The latter is more akin to Resident Evil, while the former is more akin to Eternal Darkness.   More key bindings means less need to move in and out of intermediary screens. Still, the lack of a mini map is an egregious offense that requires someone get a serious beating. There's nothing I hate more than having to constantly pause the action to open up my map just so I can see which damn direction I'm facing and where the hell I'm supposed to be going. Even if it does come with plenty of helpful writing to indicate passable doors, locked ones, points of interests, impassable barriers, and save zones (even if they are now obsolete thanks to the handy, if somewhat cheapening quick save feature that I'll not debate or really praise), loading in and out of it is an annoyance.    What did you think of Silent Hill 2  Despite the inherent dilemmas in the control system, what makes Silent Hill 2 so enjoyable is that it frightened me in so many ways, and it also compelled me to ~know~ the full story. Not once in Resident Evil Code: Veronica was I scared, and the brother and sister bad guys were mere caricatures. In SH2, gamers are constantly being thrown off balance with such a huge array of variables, causing nervousness, anxiousness and pure fear, but it's the characters that remain strangely, uncomfortably real. Each time Maria speaks she becomes creepier and creepier. The whole game is like this, creepy, eerie, and always creating lingering doubts in your mind about your character, and what you believe has happened to you. Internal, psychological fear. Not the fear caused by shocks or jolts, like from dogs crashing through a window. No, Silent Hill 2's fear is a steady, unsettling one, induced by claustrophobia, and unnerving silences occasionally pierced by metallic, harsh sound effects. Finally, no matter how settled you might feel, you still feel so incredibly lost and rudderless, that it's almost uncanny that you're merely playing a videogame.  With Silent Hill 2, Konami has delivered a deep, if confusing and somewhat tiresome adventure that's scary in a disturbing, eerie fashion. Saturated with repulsive imagery and unsettling locales, the game's mechanics show an attempt to improve the genre's general failings, and more importantly don't get in the way of the game or the story itself, but never truly perfect or vastly improve upon the basic design. It's the old, except artistically retooled and still not completely broke.James' trek into zombie land is not worth grabbing if you've already got the Xbox game, and perhaps only worth checking out if you've only got the PS2 iteration. But, if you're without any version of Silent Hill 2, the visually impressive, albeit aging title is still a delightfully terrifying, if straightforward walk around the block. A good scavenger hunt can still be worth the price of admission.", "date": "Dec 3, 2002"}