{"name": "NBA Live '03", "name_review": "NBA Live 2003", "ref": "https://www.ign.com/articles/2002/12/03/nba-live-2003", "text": "Around IGN you'll find a wide variety of gaming tastes, particularly between the two opposing camps of sim and arcade sports games. We even covered the topic in a recent roundtable on Insider. Myself, I've always leaned a bit more towards the arcade side of the argument, as my awesome 800-game winning streak on the office's NBA Showtime machine bears out.   But the risk of creating a game that caters solely to one crowd is that you're sure to tick off everyone else who prefers a different style of gameplay. Few are the games that can give us the best of both worlds -- arcade-like accessibility with simulation-like depth. Such a game is NBA Live 2003. And while it's an easy recommendation as the only current pro basketball game on the PC, it has enough virtues of its own to make it stand out against some of the other big names in other sports franchises.   Imagine watching a game in which every player was playing their best game. Now imagine playing in the game and you've got a good idea of whether or not this one's for you. A quicker speed means this is a game often ruled by the fast break and you can sometimes find yourself wondering where the ball went while your opponent has already stuffed it in the basket. Loads of new, player-initiated moves can make an entire game look like one long highlight reel.   It also means that a good player trumps a good team six days out of seven. I'm amazed at all the control available in the game, and a player who knows what he's doing can add lots of nuance and personality to his play. It's even more impressive considering how much I discovered without even opening the manual. You'll definitely want a nice dual analog stick to take advantage of all that the game has to offer.   First up are the new Freestyle controls. Back in the olden days each controller button corresponded to a range of different moves that varied according to circumstance. In a fighting game, for instance, a character might have several different punches all tied to one button but all varying based on the timing of the fight and the position of the fighters. The new Freestyle control takes all of those context-sensitive moves and allows players to access them specifically at any moment during a game.   So instead of just pressing ~fake~ or ~steal~ and hoping that you time it right, you can now use a specific move for a particular moment. Want to do a basic crossover? That's totally possible. Want to set up a drive after a rebound? Yeah, you can do that too. And you can even link these moves together in a pretty highlight-worthy set of animations. So there's the opportunity to spin 180 degrees and cross the ball over behind your back On defense, the Freestyle controls let you swipe with either hand for steals, raise your hands to block a shot or face-up a player who's threatening to drive. You can even take a charge if you want; just remember to shield your...well, you know.   On the keyboard, you have to use a shift key basically with a corresponding movement key. Since the moves are all pulled off pretty quickly, switching back and forth doesn't impede your mobility much. It's better experienced with a gamepad that has a second analog stick. There, you'll simply point the right stick in the appropriate direction or push it through a quarter rotation. You can even get a fair number of surprises just by trying new things. Be wary of overusing the system as more than a few moves in tight coverage means a sure steal for a skilled opponent.   But while it's an excellent system, the folks at EA could give you a better idea of how to use it. I'm not saying that they'd need to disclose all of the moves right away. In fact, the joy of playing game after game and suddenly discovering a move by yourself is one of the real bright spots in this game. But the tutorial that introduces you to the concepts isn't interactive enough for you to get in some decent practice. There is a separate practice mode so why weren't the two linked?   The AI in the game definitely helps make the game strategies a bit more effective. Even so, you still feel like you're always playing the crucial role in whatever's going on. While that definitely contributes to the excitement of the game, it does tend to make you more focused on the ball than on the positions. If you call for a double team, you'll be one of the guys covering the ball. Likewise, if you call for a pick and roll, you'll have to create your own opportunities yourself.   It's the same thing with scoring. If you don't make the opportunities yourself, you're simply not going to get as many baskets. The shooting percentage seems about 70-75% which is a bit more realistic than the 80% I've been getting on the Xbox version. Players can occasionally miss dunks even when there's no pressure on them whatsoever. Getting your players to stick tight against the opposition is the key to shutting down their offense. But it's actually getting your hands on the ball through blocks and steals that is guaranteed to shut them down. (For the record, I think the goaltending calls are a little extreme here but I often feel that way about real basketball too. Go figure.)   Playing the game for some time now, I'm convinced that EA's picked the worst possible camera angle as the default view for the game. If you truly hate the sideline and center court cameras, which you so totally will, it's pretty easy to switch over to a more natural baseline camera. High and low angles and variable zoom levels help you get just the right view you want. The camera's quick 180-degree rotation for turnovers in this mode is seamless.   Regardless of the view chosen, it's clear that this is a great looking game. The player models are all faithful to the real life players right down to headbands and tattoos. Sure, it can be a little tricky sometimes telling one from another but the uniforms and an optional little name overlay keeps you oriented. The models animate quite realistically as well, passing through a series of blended motions. And the fact that there are so many different animations for things like dunks means the game will still be showing you something new even after you've played it for a few weeks.    The cutscenes are nice at first and brimming with personality. But after about the third game you'll start to realize just how repetitive they are. You'll laugh the first time you see a player catch grief from the coach for stopping to sign autographs on the way to the locker room. You won't be laughing when you realize that the same cutscene repeats itself every game. Ditto for the pre-game shenanigans.   The sounds are almost all top-notch. Calvin Murphy's commentary is pretty specific and, although it can get repetitive in parts, serves as a nice compliment to the action. Better still are the effects themselves. The sound of the sneakers and ball on the court works well here and is backed up by pretty convincing crowd sounds. Hearing the crowd respond to the action on the court makes the game much more exciting and believable. The occasional taunts that are thrown out are just the icing on the cake.   As has been said here before, it's only a matter of time before EA opens up their own recording label. Having obtained existing songs and some brand new tracks by the likes of Snoop Dogg and Busta Rhymes (including an absolutely bitching B. Rich song that samples The Jeffersons theme), EA's definitely got a lot of credibility here. Regardless of whether you like the style of music, it's a good fit for the sport (much better than say, the horribly out-of-place tunes in the recent Tiger Woods game).   There are as many layers of multiplayer options here as you'd want. If you just want to jump in for a quick instant match or if you want to run a whole franchise, there are options here for you. EA's to be commended for keeping everything inside the shell of the game. Simply click on multiplayer and you're on EA Sports' online service before you know it. Profile set up and management is really easy but a few of the rooms require a bit of acclimation before you can use them with ease.   Multiplayer is a definite treat but you can get some serious game-ruining stuttering from time to time. Even on our high-speed connection at IGN up against opponents with pings below 100, we still got consistently noticeable jerks and skips. The delay in lining up your free throw shots made it effectively impossible for us to nail any free throws at all. One of our opponents even picked up on this and started fouling us every time we went us for a shot. Also, if you're reviewing your stats at the end of a multiplayer game and the other guy quits out, the session ends and all the stats for that game are lost to you forever. That's dumb.   Apart from finding a player who doesn't want to play the Lakers, there aren't too many other problems in multiplayer. At any given time we've seen anywhere from a dozen to a few dozen opponents ready to take you on. The 1-on-1 nature of most of the matches means you could sit out for a few minutes, but sooner or later, someone will come along to join you.   What did you think of NBA Live 2003?   Once you've exhausted the single game options, there's a whole new batch of fun waiting in the game's franchise modes as well. You'll be able to change your rosters in the off season through recruiting and signing free agents. To help balance out the processes involved players all have point values indicating their quality. The online franchise mode allows you to track stats for your players.   The General Manager side of the game includes options more tied to business than sport, at least on the surface, but it makes for a nice change of perspective. Still, it's not the meat of the game. Finally, if you're really in to the whole grouping thing, you can form fantasy clubs with other players and compare your own stats as a team against groups of other players.If you're a fan of basketball, then you'll like this game. Even if you're not a fan of basketball, you'll still find something enjoyable about this game. After the problems of last year's version (problems so severe that a PC version wasn't even released), it's good to see the series is back on track and available to the PC crowd. It's even more exciting because of the wonderfully implemented Freestyle controls. It's a risk that's definitely paid off for the EA team and I'm anxious to see how it makes its way to the football franchises.Although it's the only game in town, whether you love or merely like it depends on your tastes. Myself, I really like the approach of setting the game in the world of unforgiving basketball rules and then making sure the players are always on fire. It certainly makes for a much more interesting game to say the least. It also means that your own skills are more important than those of your players. Those looking for a more simulation-oriented approach are simply out of luck, at least on the PC, but that doesn't mean they won't find something to love in this game.", "date": "Dec 3, 2002"}