{"name": "Metal Dungeon", "name_review": "Metal Dungeon", "ref": "https://www.ign.com/articles/2002/12/05/metal-dungeon", "text": "Xbox is in desperate need of RPGs.  With only Baldur's Gate and Morrowind offering any serious enjoyment for RPG fans, it seems just about any RPG would be a welcome addition to the Xbox library.  Well, be careful what you wish for.  Metal Dungeon is the latest Xbox RPG and while it offers up a few promising ideas, it's one of the least appealing RPGs I can remember playing.  That's saying something, since I'm an RPG lover.  I've played plenty of good, from Chrono Trigger to Suikoden to Final Fantasy III to Skies of Arcadia.  And I've certainly had my share of bad RPGs.  But while many were bad because they had terrible storylines or flawed gameplay, Metal Dungeon goes a step beyond with scarcely any story or presentation whatsoever and some of the most uninspired gameplay imaginable.  RPG fans, avert your eyes.  Features Five character classes to choose from, with more that can be unlocked Ten massive levels to explore Randomly generated dungeons, so you never experience the same map twice Upgrade your characters with ability-enhancing chips Revive dead heroes and add to your party Only on Xbox  Presentation & Story Things start off great with Metal Dungeon.  The pre-game FMV is fantastic, showing a heated, beautifully rendered battle in the bowels of the Metal Dungeon.  That's where the slick presentation pretty much ends.  All the money, it seems, was blown on that minute-long teaser.  Because what remains is a game absent of any driving or interesting story, character interaction, or story-progressing cut-scenes.    The actual game begins with a long intro to the story of how the Metal Dungeon came to be.  This is all scrolling text read by a droll narrator.  No cut-scenes, not even interesting background stills.  Just text and voice and one anonymous looking piece of scenery.  If I were playing Zork, I'd be amazed.  But instead I'm playing in the modern era where presentation should always have a presence in an RPG.  The story boils down to this -- experiment gone wrong, shape-shifting dungeon flooded with evil monsters, keeping humans from true peace and safety.  It's a good premise delivered poorly.  The Metal Dungeon is ten levels of monster-packed mayhem.  Designed with the military advantage of always changing its shape each time you enter (no really, it's an advantage), this should be a dungeon crawler's dream.  With each new level you get a voice recording from a fellow explorer warning you about the level.  Panther Software could have added something here, perhaps a holographic projection of the party members detailing the level, but instead it's just your main character standing in place, not moving and just listening to a disembodied voice.  Further to this, Metal Dungeon really isn't much of an RPG in terms of story.  While gameplay mechanics, leveling up, and dungeon crawling are all RPG aspects, there is no character interaction whatsoever.  That's not entirely necessary to have a good RPG, especially since this is focused on dungeon crawling, but the total lack of story, solid presentation, and character interaction puts all of the weight of success on the merits of the dungeon crawling aspects.  And Metal Dungeon's not a very good dungeon crawler.  So what's left that could make this worthy of purchase?  Nothing.    Gameplay Like I said, Metal Dungeon is strictly a dungeon crawler.  So to start your crawling, you'll need to create your party.  Up to five characters can be assembled at any time, but you can always enter the dungeon with less.  Though a series of menus, you can choose to enter a training battle, trade goods, upgrade your characters with computer chips or by spending skill points earned through combat, revive party members, or enter any opened levels of the Metal Dungeon.  At the start of play there are five separate character classes.  However, by finding and reviving the bodies of fallen heroes new classes can be discovered.  Character creation is relatively straight-forward as each class has predetermined starting stats, but once you have earned some skill points to spend, you can raise up any of the specific stats (over a dozen) that you want.    Dungeon crawl is a perfect description for this metal monstrosity.  Each level is randomly generated and monsters randomly placed.  Rather than showing monsters running around the dungeon, though, floating orbs travel the corridors.  Run into one and you'll be drawn into a battle where monsters will be revealed.  Kind of cheap since you never know exactly what to expect when purposely entering combat.  You will also get random encounters when you open doors, which is pleasantly annoying.  And yes, there is an end boss for each level.  Combat itself is where things go to pieces.  I can get into a good dungeon crawl.  I'm down with random level generators and surprise monster battles.  But the combat has to be entertaining.  And here combat is so anemic, so boring, so poorly crafted and engineered, that it may take a place next to Kevourkian's suicide machine in the annals of history.        Technically, everything happens in real-time.  A battle starts, monsters and heroes attack continuously, with more agile characters and creatures able to attack more often, and eventually one side kills off the other.  However, you're not in direct control of anyone.  You sit back and watch as your five party members do their basic attacks.  Battles are in the old school line-in-the-sand format, with enemies on one side, heroes on the other.  You can command any character to do very simple functions (attack, guard, cast spell, use item).  If not directed, characters do pre-scripted commands (attack for all classes except casters who guard until you tell them to cast spells).  While this may not sound all that different from, say, a Square turn-based set-up, it is quite a different experience.  For one thing, in most turn-based RPGs, you have different types of attacks you can do.  Maybe a partial attack, a full attack, weapon switches, summon creatures to aid you, and so on.  Sure, it's not an endless buffet of options but, honestly, it's that variety and the constant direction you give your characters that keep you involved in the combat.  Here, you have no choices.  Attack is just a single type, a single option, a single animation.    Every class has a unique special maneuver.  A caster, for example, can sometimes nullify an incoming enemy spell. But you can't choose when these maneuvers are used, so they just show up at random, and sometimes useless, moments.  Combat, then, is exactly like the Metal Dungeon you explore -- completely random and out of your control.  As for spells, you'll have limited options for the first few hours, until you've found enough spell chips and leveled up your caster high enough to get some variety.  And even then, your caster often moves so slow they won't get a chance to use more than one or (if you're fortunate) two spells in a combat.  And there are no grand and gorgeous spells that most RPGs have the sense to include.  Instead, spells offer a brief moment of attractive lighting and particle effects, but nothing more than a momentary sparkle.  There's nothing that will dazzle, amaze, or even interest you.  Each weapon type (gun, sword, glove, hammer) offers a different animation, but it's the same animation each time.  So when your fencer raisers her sword and takes a swipe at an enemy, that's the same thing you'll be seeing every single frickin' time you attack.  And though you can adjust the speed of combat, even at the fastest speed, things move far too slow.  The spell effects are weak, the attack animations get old incredibly fast, and the monsters aren't all that interesting either.  In a nutshell, Metal Dungeon is what a dungeon crawler can never be -- downright boring.    I've never been against random dungeon creation, but no game I can remember points out its flaws more than Metal Dugeon.  Random dungeons may offer some sort of variety (though honestly, I don't see the big difference between all the endless corridors) but none of it is laid out properly.  Far too often you will head down a series of hallways and rooms only to come to a dead end.  And not a dead end with some treasure or monster to fight.  Merely a useless dead end.  Why?  Because none of these levels have been designed with any care.  They can't be, because they're random.  Give me a dungeon that was crafted with some thought, with some ingenuity, and twists and turns that make sense over endless randomizations.  This is supposed to be a great creative feature, but it honestly seems cheap and lazy and reminds me of rolling up random dungeons while playing tabletop AD&D when I was twelve.  Difference is, that was fun and this is not.  Oh, and did I mention that without constantly leveling up, you'll easily get your ass handed to you on a silver platter?  It's very, very, very, very easy to see your whole party wiped out before completing a level.  All the more frustrating since you can't directly control anyone.  Now if that's not fun, I dunno what is!  Graphics Yeesh.  The FMV trailer when you load the game is misleading.  There's nothing that cool in the game.  While the dungeon looks nice when walking around looking for trouble, it's nothing to commend.  Considering every level essentially is the same thing with a different texture scheme (an X pattern on the walls in one level, a T design in the next) and that all levels follow the old AD&D ~everything is 10x10 and symmetrical~ rule, it would be tough for the game not to have good lighting.  It's not doing anything to push the boundaries of Xbox.  It's not even getting out of the shallow end of the graphics pool.  Your party animations are very nice and fluid.  But, again, since they only have one animation each, how hard can it be to maintain that fluidity?  The creatures, on the other hand, look, for the most part, atrocious.  Many of them seem to be made of too many edges.  You can see arms that look almost like rectangles with textures thrown on.  Some, like the undead, look really good, though.  But the bad far outweighs the good.  Add to it some poor, poor, (and poor) spell effects for a touch of additional ~bleh.~      Sound The score rarely changes and it's seriously the kind of music you always hear in bad games.  Guess it's fitting to hear some of it in Metal Dungeon.  The score does change pace at times, like when fighting a boss.  But that change is a bad thing.  For example, when fighting the first boss the music changes to a very slow, melodic, and sparse track.  This is totally opposite of the tense mood you need when fighting a tough boss.  It sounds like elevator music and in a way it fits Dungeon perfectly.  Both the game and the music will put you to sleep before your bedtime.  Sound effects are weak and I swear some things, like a bat's sonic attack, sound like they were ripped straight from old Hanna-Barbara cartoons.  I love those old cartoons too, but man, that's not what you want in your hard-hitting dungeon crawler.  On a positive note, what little voice over is in the game is done nicely.  But there really should have been a lot more of that going on.Every time I get in an RPG in the office, I have high hopes.  I watch as the PS2 gets endless streams of them (good and bad).  For Xbox, so far, it's barely a trickle.  Metal Dungeon had the right premise, but poor execution.  How cool would this have been if there were an actual story and a combat system here?  Imagine walking around your little underground human town talking to folks, then learning there's something horribly wrong in the Metal Dungeon that was sealed off decades ago.  If you don't solve the mystery of the dungeon, your town, and the very human race, will be lost.  Sounds cool?  Too bad that's not this game at all.  Instead it's just a mindless and pointless and boring dungeon crawl.  In fact, it's a bit of an insult to other great dungeon crawlers like Diablo and Baldur's Gate to even call this a crawler at all.  Stay clear of the Metal Dungeon, unless you've played every other Xbox game (yup, all 200 of them) already.", "date": "Dec 5, 2002"}