{"name": "King of Fighters EX: Neoblood", "name_review": "King of Fighters EX Neoblood", "ref": "https://www.ign.com/articles/2002/12/05/king-of-fighters-ex-neoblood", "text": "In the 2D fighting genre, there are two main companies that dominate the market: Capcom and SNK.  Although Capcom is single-handedly responsible for making the genre what it is with its always-reusable Street Fighter license, SNK has always been lurking in the shadows, dishing out (for the most part) quality 2D fighters left and right: Samurai Showdown, Art of Fighting, Fatal Fury; heck, even the first World Heroes was good fun.  With so many fertile licenses to use, SNK did what every fighting fan dreamed of - they combined fighters from all of their different games (even Ikari Warriors!) and created the King of Fighters series.      Features  27 fighters to choose from Nine different modes of play Link cable support for two players Only for Gameboy Advance  The King of Fighters series is a 2D fighting game, but what made it unique (besides the fact that it was one of the earlier games to feature a giant crossover using different characters from a common universe) was its team-based play.  No longer were you confined to only using one character.  You now you had the ability to build and fight against other teams.  At the time, and even now, there are very few fighting games where you could choose a multitude of characters to do battle with.  Now, almost ten years after its initial release, Gameboy users have the chance to take their favorite SNK characters on the road (or toilet) with the release of The King of Fighters EX NeoBlood.  The question is, is it any good?  The King of Fighters EX NeoBlood contains plenty of modes to keep any fighting game enthusiast busy.  First, there are team battles in which you choose three characters and one striker to fight against another team of the same setup.  The first team to KO the three fighters of the opposing team wins.  Then there are the more traditional single battles where you choose one character and one Striker in an effort to take out an opposing opponent.  Both of these modes have corresponding modes that are VS for two players, as well as corresponding story-based modes that, rather than cutting straight to the action, try to make some sense out of what is happening, but the story aspect is relatively weak.  There are a few times when the characters will speak to each other through text boxes, but that is the extent of it.  Not a big though; this is a fighting game, and the fighting is where the meat is - and thankfully, KOF EX NeoBlood is a pretty juicy sirloin steak.           One of the features in KOF EX NeoBlood is the Striker system.  A striker is a character you choose to help you out in time of need - a super bomb if you will.  So let's say you're getting your booty wooped by an opponent and can't seem to do anything about it.  Call in your Striker and he/she will magically hop in from off the screen and deal some damage to your opponent.  You can only do this a set number of time per match (usually three), but the number of Striker Bombs can be adjusted in the options.  While the Striker attacks can sometimes be useless (the attacks can be blocked), if you use them at the right time - when your opponent is least expecting it - they can often deal the final, and crucial last blow in a match.  Of the initial 24 selectable characters, six of them are sanctioned off as Striker-only characters, though you can use any of the 24 characters as a Striker.  There are also three extra Strikers that you can unlock, effectively bringing the character total to 27.    Also included in the game are Counter and Armor modes.  These are not gameplay modes, but rather in-game modes that our character can go into, giving them temporary powers.  For example, activating Counter mode will make your character red and give you unlimited use of their Super Special attacks, canceling from a Super move will let you use a Super Special move, and canceling from a Moving attack will let you use Special moves as well as Super Special moves.  The Armor mode is the defensive equivalent of Counter mode.  When activated, your character's life will not decrease when blocking Special moves, they will not be knocked off guard when attacked, and you'll also be able to blow back opponents using a Moving attack.  Confused yet?  Don't worry.  You can always use the games practice or survival modes (endless and time attack) to hone your skills.  Also, like most fighting games, the single-player experience is fun, but the whole purpose of fighting games is to battle a buddy.  Those of you who have fighting game buddies, you'll be glad to know that KOF EX NeoBlood supports VS mode using the link cable.    One of the limiting hardware factors of the Game Boy Advance, especially when considering fighting games, is that it only has four buttons.  This causes a little bit of trouble when trying to play games that were originally made for use with more than four buttons, particularly Street Fighter II.  SNK must've thought far ahead into the future when designing the NeoGeo because, thankfully, the system was designed around a four-button layout.  Four buttons on NeoGeo and four buttons on Gameboy Advance: perfect, right?  Well, sort of.  Trying to use the left trigger button, while simultaneously performing a somewhat complicated move on the directional pad can be a little more than a chore.  It just feels unnatural.  But, if you're one of those people that don't have a problem with it, more power to you.  For the rest of us, a three-button mode was implemented that uses a combination of a direction (left or right) and the right trigger to execute a strong punch or kick, normally assigned to the right and left triggers.  While not perfect, this mode is more than adequate (I use it exclusively), not too mention a lot easier to use.                     Graphically, KOF EX NeoBlood looks great.  It's strange to think that after years of playing SNK games at the arcade, I can pop in a matchbook-sized cart into my Gameboy Advance and witness the same sort of graphical quality I was seeing from a $700 console/arcade machine.  The characters are large, crisp, and colorful, not too mention animated well and accurately - an almost arcade-perfect look.  The game also moves at a quick pace, never slowing down even with four characters onscreen at once.  Only the most critical could complain about the (few) missing frames of animation and static backgrounds.  Oh, and in case you were wondering, Mai's still as ~animated~ as ever.  Fighting games in general are not known to have epic scores or atmospheric sounds, and KOF EX NeoBlood is not one to break that tradition.  This is a fighting  game, remember?  The music is not horrible, but nothing special either - just typical fighting-game fare, with a mix of synthesized beats and sounds.  I can't remember well enough to know if these are remixes of old KOF tracks, but they do get the job done.  Also included in the game are most, if not all of the digitized speech samples used when the characters perform special moves.  These, while sounding a tiny bit compressed, sound great overall, and each character's voice was faithfully recreated to be instantly recognizable upon first hearing them.   For fighting fans, the King of Fighters EX NeoBlood will not disappoint. It's easily one of the best fighting games available for the system.  Sure, there's Street Fighter II, but as most you already know, both games are really different in execution and style.  If you're a fan of the series, there's nothing left to say; get it.  If you're a Street Fighter II fan, what can I say but to keep on playing Street Fighter and then think about trying something new.  If you're new to the fighting game genre and need a good game to get you oriented, KOF EX NeoBlood definitely fits the bill.  Regardless of your gaming background and preferences, KOF EX NeoBlood is an excellent fighting game and is definitely worth your time.", "date": "Dec 5, 2002"}