{"name": "Guilty Gear X", "name_review": "Guilty Gear X Advance Edition", "ref": "https://www.ign.com/articles/2002/12/06/guilty-gear-x-advance-edition", "text": "2D fighters seem to slowly be making their way onto the Gameboy Advance.  Conversions of most of the major fighting franchises have either already arrived, or are on their way in the near future (i.e. Street Fighter, Mortal Kombat, King of Fighters).  But there's one fighting franchise that always seemed to be missing - Guilty Gear.  Sammy has heard the cries from 2D fighting fans everywhere and has released a Gameboy Advance conversion of Guilty Gear in the form of Guilty Gear X Advance Edition.    Features  Over 14 characters to choose from Seven modes of play including 3-on-3 mode 2 player VS mode using the link cable Only for Gameboy Advance  Guilty Gear X Advance Edition is a pretty standard 2D fighter with a few extra moves and techniques thrown in for good measure.  The special moves are mostly performed by your typical quarter/half circle movements made popular by the Street Fighter series and every character also has their share of Super moves.  Along with those, you can also perform Active Changes, Dual Combinations, Dead-Angle Attacks, Dust Attacks, Gatling Combinations, Overdrive Attacks, and Instant Kills.  While that is a lot moves to perform, what's really great about them is that they are not simple moves that are added for the sake of having more moves.  They actually have a significant affect on the gameplay.  For example, when performing an Active Change (only in the Tag Match mode of course), your partner will jump in while you jump out.  The catch is that you can perform this move while in the middle of a combo and, with good timing, you can continue a combo with two different characters.  Very cool.    The Dead-Angle attacks are counterattacks that are performed in a similar way that parries are carried out in Street Fighter III, but are a little difficult to pull off.  Whether that is the fault of the tiny controls on the GBA or just my bad timing is hard to tell.  Also difficult to perform are the Instant Kills.  These attacks are, obviously, moves that can kill you in one hit.  While not the easiest moves to perform even on a console, I could only perform them on the rarest of occasions.  I guess that's how it should be considering their power, but regardless, they are hard to pull off.  Just when you think there couldn't be any more moves, there are also Faultless Defenses, Roman Cancels, Jump Cancels, Counter Hits, and Recoveries.  All of these moves have a pretty big impact on the gameplay, and do a good job of making this game a little more interesting, and when you include the numerous ~regular~ special moves that each character has, you'll find that there is a lot to learn, and a lot of technique involved in the game.      Guilty Gear X AE has a pretty good selection of characters and modes.  There are 14 characters initially available, with one unlockable, and six different gameplay modes.  If you're a fan of the series, then you'll definitely recognize all the faces in the game.  From the odd, but irresistibly cute pirate May, to the lanky and just bizarre Faust, all the characters are classic Guilty Gear.  The gameplay modes include your standard arcade and versus mode, as well as a tag match mode, a 3-on-3 mode, a training mode, and a survival mode.  The most interesting of these modes are the tag match mode and the 3-on-3 mode because of the added moves that you can pull off when fighting.  Overall, Guilty Gear X AE has a decent fighting system that, while not as balanced or fun as say Street Fighter II or KOF, can still be enjoyed in short spurts.        Now, the first thing anyone notices about a Guilty Gear game, even before playing them, is the graphics.  The series really took 2D fighting games to the next level visually with their high-res character sprites.  After years of looking (and might I add, still looking) at low-res, recycled 2D character sprites on almost every Capcom and SNK fighter with the exception of Street Fighter III, Guilty Gear's graphics left us in awe.  The large, incredibly fluid, high-res characters were a sight to behold.  In fact, underneath its visual cloak, Guilty Gear was just an average fighter due to its slightly unbalanced gameplay and cheap hits.  Still, the graphics were, and still are, compelling enough to make the game more fun to play.  This is where one of the problems with the GBA version is.  First off, say goodbye to those large, high-res characters.  The character sprites in Guilty Gear X Advance Edition are quite small: a good deal smaller than those of KOF and SFII.  Not only are they small, but after seeing them so well animated on consoles/arcade, it's really obvious that there are tons of missing animation frames.  Not to put such an emphasis on graphics, but the series brought it upon itself by one-upping everyone in the visual department in the first place.  As one of the game's main attractions, not having those lush, colorful graphics makes the game seem a little drab.  Also, some the characters and backgrounds share similar dark colors, making them difficult to see, especially when not in optimal lighting conditions.  The other big complaint I have is the slowdown.  While not incredibly frequent, whenever there is a lot of action onscreen (multiple special moves being performed, lots of explosions, etc) things move a sluggish pace - but only for a brief moment.    Sound is not one of Guilty Gear X AE's strong points.  The original games were heavy on the cheesy Japanese guitar rock that you hear every so often in Japanese fighters - the perfect stuff for this game.  The GBA version tries to retain those classic guitar tracks, but they end up sounding like MIDI versions of the original songs.  The quality of the songs, both technically and artistically, aren't that bad, but the songs aren't that memorable either.  The sound effects are also a little weak and generic, as well sounding a little too tinny.  Oh well.  At least the music is not the main focus in a fighting game.    Guilty Gear X Advance Edition is not the best fighting game you can get on the GBA, but it's also not the worst.  It almost sits right in the middle.  It looks decent, sounds OK, and plays almost as well as any other good fighter on the GBA.  If you've already got Street Fighter II and KOF EX, and you're still looking for something more, Guilty Gear should be next on your list.", "date": "Dec 6, 2002"}