{"name": "Tempest X3: An Inter-Galactic Battle Zone", "name_review": "Tempest X3", "ref": "https://www.ign.com/articles/1996/12/17/tempest-x3", "text": "If you're a child of the eighties and remember when Asteroids, Robotron and Pac Man where cool before they were retro-cool, then you probably remember the slick vector graphics of Tempest.  Released by Atari in 1981, Tempest was the most advanced looking game around and the first to feature color vector graphics.  The game's premise was simple -- you move your ~ship~ around the outside edge of varying ~webs~ and shoot everything that tries to come up.  Sounds simple, huh?  Just like Tetris, Tempest is elementary, yet highly addictive.   While Dave Theurer was the originator and programmer for the arcade Tempest, Jeff Minter brought the game to the console-gaming masses when he wrote Tempest 2000 for the Jaguar.  Minter's Pixel-Shatter and Melt-O-Vision graphics, combined with a techno soundtrack, brought Tempest into the 21st century.  However, with the Jaguar pretty much dead, Interplay picked-up the rights and added a little 32bit flash to come up with Tempest X3.   This game should be illegal.  Heck, it probably is in some states.  Tracers, blurring, color separation, and jumpy pixels make this game both fun and highly suspicious.  As usual, you maneuver your ~claw~ around the lip of the web and shoot down the lanes at the abstract  enemies that come up from the core.  Grab power-ups to get particle lasers, the ability to jump off the lip, superzappers (destroy everything) and even a helpful A.I. Droid while avoiding pulsars, fuseballs, flippers and more.  The techno soundtrack pumps this game to go even faster and the amount of moving objects on the screen is enough to burn your eyes out.  At points the screen is so full of effects all you can do is grab a fistful of buttons and hope for the best -- this is gaming at its most frantic.  Fans of Tempest will find the original ~classic~ version on the disk (an almost perfect copy) as well as cooperative and competitive two player modes.  Tempest 2000 players will find improved speed, visual effects and a remixed soundtrack.  This game gets better with each update.  Interplay has successfully morphed Tempest into a brilliant rollercoaster ride of sensory overload.", "date": "Dec 17, 1996"}