{"name": "Extreme Wintersports", "name_review": "Extreme Wintersports", "ref": "https://www.ign.com/articles/1999/10/21/extreme-wintersports", "text": "Yes, we've finally gotten around to reviewing Extreme Wintersports, another in the long and appalling Head Game's Extreme series.  So what did we think?  Well, I can honestly say this is the best Extreme game to date, beating out the powerhouse that is known as Extreme Mountainbiking.  So I've finally found an Extreme title that stole Extreme Mountainbiking's King of Crap crown.  Oh, the humanity.  Like many of the other Extreme titles -- most notably Extreme Tennis and Extreme Paintbrawl -- you'll start off your misadventures in the Pro Shop, pawing through authentic sponsored merchandise.  The Pro Shop is loaded with gear that would be useful to anyone hitting the slopes for a day of winter fun.  There's a wide assortment of backpacks, gloves, jackets, skis, helmets, snowboards, and even snowmobile speedometers, all sponsored by big names like Arctic Cat and K2.  The only problem is, if you want to buy any of this flashy merchandise, you're SOL.  The pretty pictures and brief descriptions of each of the items are only in the game to pay the development bills.  The Pro Shop is nothing but a glorified billboard, trying to hock you products before you get to the actual meat of the game (well, more like gristle). If only there were a ~cover it with gasoline and set it on fire~ option in the game, the Pro Shop would be kindling.  Extreme Wintersports covers three events: downhill skiing, snowmobile racing, and snowboarding. Unfortunately, all of these events are shallower than a kiddie pool in the Arizona desert at high noon. The only event that's any fun at all is snowboarding, and even that won't hold your attention for longer than 20 minutes. The control system for the individual events is abysmal and inconsistent.  Some of the events -- like skiing and snowmobile -- would be boring for a two-year-old, or even your neighbor's dog (thanks Neil).  I can sum it up in two words: arrow keys.  While snowboarding becomes a tricky exercise similar to playing Twister with your fingers.  To perform tricks you have to hold down the shift key, then hit ctrl and an arrow key togther, and then release the shift key to land the trick.  While this aspect of the game sounds like it would be more fun with a gamepad, we couldn't get Extreme Wintersports to recognize any of the ones we tried.  Well poo.   If the controls sound bad, then imagine this -- the sound is even worse.  Apparently Bob the sound guy was sick the day Extreme Wintersports was created (from what we hear, the entire game was actually programmed over lunch at Burger King), because there are no sound effects in the game whatsoever.  Perhaps we are to believe that all of the competitors in the Extreme Wintersports are deaf mutes and we are living the game through their eyes and mouths.  Or perhaps your ears are just packed so tightly with snow that no sound waves get through.  Of course, this would be a blessing in some senses, since at least it would block out the horribly repetitive soundtrack.  If you want a taste of what you're missing, be sure to check out the music clip from the game below.  Just download the Extreme mp3, set your player to continuous, and you'll have a chance to experience the same aural badness that made my co-workers stand behind me and poke me with pointy sticks every time I loaded up the game.   Surprisingly enough, Extreme Wintersports actually looks pretty good.  And for the first time in a Head Games product, the game supports high resolution modes.  Of course, as every real gamer knows, a title can't rely on graphics alone.  Sure, a game may look pretty, but if it controls like crap then let's not fool ourselves ... it's crap.  And as you can tell from my previous statement, obviously all of those people who bought Myst aren't real gamers.   Supposedly the game has four player multiplay over the Internet but, as hard as we tried, we could never get a game up and running.  We could compete in 'hot seat' games where we each take a chance playing an event and compare our times and scores at the end of each race, but where's the fun in that?  Why don't I just write down my score and a post card and send it in the mail if I can't go head-to-head at the same time.  Head Games once again shows gamers what they're all about -- product placement.  And we all know what you gamers out there want to spend $20 on an advertisement for skiing, snowboarding, and snowmobile gear, right?  The games in the Extreme series never cease to amazing me, and it's obvious that the marketing team at Head Games works hard at getting big licenses, only to give small developers next to no time to create a game that's nothing more than a glorified commercial.  To be perfectly honest, I'd rather be stranded under an avalanche than play this game anymore.  -- Extreme Tal", "date": "Oct 21, 1999"}