{"name": "Earth 2150: Lost Souls", "name_review": "Earth 2150: Lost Souls Review", "ref": "https://www.ign.com/articles/2003/01/06/earth-2150-lost-souls-review", "text": "I don't know about you, but as an older gamer, I remember living under the threat of nuclear annihilation.  Aside from the continual worry of uneasy U.S./Soviet peace breaking down into armed conflict, there was the overriding fear of World War III, one whose end could result in widespread destruction by nuclear weapons.  The ensuing destruction and fallout would devastate the planet for numerous years, forcing a radical change to civilization as we know it.  Now, imagine that a nuclear war did break out, but instead of nuclear winter, the sheer power of the nukes knocked Earth out of it's natural alignment, putting it on an inevitable crash course with the Sun.  Topware and SSI posed this scenario with Earth 2150, a Real-Time Strategy title that challenged players not to conquer the world by defeating your enemies, but to escape from it, saving humanity in the process.  Two years and two titles later, Strategy First and Reality Pump have taken up the reigns, presenting the third game in the series with Earth 2150: Lost Souls.   So, without further ado, here's a very, very quick plot summary of the first two games for those of you who haven't played them.  In the near future, Earth has descended into political and economic chaos.  Seeking to escape the turmoil on the planet, a company called the Lunar Corporation (LC) takes over NASA's functions and establishes orbiting cities, as well as bases on the moon.  Focusing their attention upon research and development, the LC makes strides in technology, becoming a scientifically advanced group.  Recreating society in these extreme regions proves difficult, but possible, and shortly thereafter, the LC cuts its ties with Earth, becoming wholly self-sufficient.    While the LC practices its techno-isolationism in space, anarchy reigns on the planet, tumbling governments and financial institutions.  Out of the rubble come two global factions: the United Civilized States (UCS) in the West and the Eurasian Dynasty (ED) in the East.  The UCS relies on computers and robots to do its work, ranging from day to day life to the highest forms of government.  Consequently, the citizens of the UCS quickly become decadent and lazy.  Running counter to this lethargic lifestyle is the working proletariat of the ED, whose deep-seated roots in the masses has fostered a massive work ethic. Inevitably, these two political ideologies came into conflict, leading to nuclear deployment of weapons in a massive world war.  Shortly after a massive atomic battle near the North Pole, LC scientists discovered that the UCS and ED's skirmish managed to negatively affect the Earth's natural orbit, putting it in a direct crash course with the sun.   Obviously, this sends the governments of the three factions into a panic, as the leaders realize that Earth will be burned to ash, and the moon will be dragged with it, captive by the planet's gravity.  The most immediate solution to the problem seems rather obvious: spaceships will have to be built, and Mars, our closest neighbor, will have to be forcibly colonized.  However, this undertaking would require a massive amount of resources, one that would seem to be almost a global effort in the making.  Rather than work together as a species, the three factions descended into petty squabbling and eventual open warfare as time quickly ticked away.   In Lost Souls, the end of the world is nigh, with a rather tragic end in sight.  Spaceships have indeed been launched to Mars, and a colonization of the Red Planet has taken effect.  However, due to government officials seeking to save their own skins, a large number of the population has been left behind on Earth, condemned to die.  These ~Lost Souls,~ as they're known, come from all three factions, but feel a certain amount of understandable hatred towards their brethren for leaving them to suffer.  Hastily, each side attempts to gather enough materials for a second wave of spaceships before the world is destroyed as well as create an army to not only destroy their enemies on Earth, but also take revenge on their former comrades for deserting them.   A typical facet of RTS games, army creation and resource gathering is expected for players to progress and survive through each level.  However, Lost Souls's most touted features actually revitalizes these concepts.  For example, most strategy titles provide you with units that serve specific functions.  Tanks attack ground units, planes attack air units, and harvesters continually need protection.  Like other strategy titles, each faction has units that reflect its personal ideologies and equipment.  The ED, with its industrial approach, has a very definite Eastern European military feel to its units.  As a team, they still field tanks modeled after 20th century weapons.  The UCS' dependence upon robots and machines provides them with a robotic army.  Featuring bipedal and spider-like tanks, the sheer size of their armies tower over their opponents.  Finally, the LC's technological advantage provides most of their units with antigravity capability, allowing them more maneuverability and evasion to attacks.  Plus, their weapons are some of the most unconventional of the three sides.     However, Lost Souls gives you the opportunity to change this stale formula by giving you the ability to design your own units, thereby circumventing traditional pre-established troops.  To start the process, you choose a chassis from a land, sea or air unit and then attach additional weapons and equipment.  Fully designing a unit only takes a few button presses, yet it gives you the ability to tailor your troops to your specific attack style.  For example, mechanics or other repair units in most games are weakened and non-aggressive, often requiring shepherding in the field of battle.  In Lost Souls, you can equip your mechanics with machine guns, shields, or other offensive and defensive capabilities to protect them against enemy attack.  If you discover a design that you like or is particularly effective, you can save that specification for mass production in a factory.  Additionally, you'll have the option to improve upon these components by performing research into a specific field.     With Lost Souls, you're no longer confined to predetermined research trees or prerequisites.  As soon as you've gained access to a specific technology or piece of equipment, you can begin studying and improving your new gear immediately.  Depending upon the enemies you'll face, you'll need to do this quite often.  The majority of weapons break down into one of two categories: energy and ballistics.  Energy weapons include lasers and beam weapons, and pack quite a punch against most materials.  However, they can be deflected by equipped or powered shields, greatly decreasing their damage.  To penetrate this protection, ballistic weapons such as machine guns or rockets can be fired, which pack significantly less power but are unaffected by any safeguards except very strong armor.  Needless to say, discovering exactly what kind of weapon your opponent favors and preparing a sufficient response is a necessary tactic for survival.   Speaking of tactics, the game allows you to perform quite a few unorthodox attack strategies.  You can capture enemy units with your mechanics, turning them against their former comrades.  Of course, this is always a dangerous maneuver, one that can quite easily get your troops killed.  A safer means of deception is painting your units with the colors of the enemy in an attempt to have them infiltrate your opponent's ranks unnoticed.  A successful attempt will allow you the ability to wreak havoc through their ranks.    For some players, a sneak attack is the way to go.  Well, you can take advantage of this in one of two ways.  The first way is by utilizing the changing elements and time of day.  The steadily advancing movement towards the Sun creates chaotic weather patterns on Earth, causing massive storms, blizzards, or other conditions during the day and night.  This weather can obscure vision on the field of battle, for both the player and the computer, but can be used in sneak attacks.  For example, most units automatically turn their lights on at night.  By turning an advancing platoon's lights off and slowly approaching a base during a heavy rainfall, you can strike the enemy and inflict a lot of damage before being detected.  If this direct approach over land seems too direct and obvious, you can tunnel into an enemy base, establishing a subterranean entrance right behind their defenses to cause destruction on vital structures.  In fact, a breach of any kind can be catastrophic, because buildings can sustain incidental damage from stray bullets, rockets or lasers.  If properly planned, an invading force can place their foe's structures in front of any incoming attacks, acting as impromptu shields as they press their attack.    Inevitably, whether it's attacking enemies or repelling invaders, Lost Souls will force even the most battle-hardened veteran of RTS titles to completely rethink their tactics.  The largest and most important way is by ammunition constraints.  In most RTS games, units have an unlimited supply of ammo with which to assault and destroy your rivals.  Obviously, this is an unrealistic facet of warfare.  Lost Souls forces you to recognize this by placing an ammo limit on each weapon.  Once exhausted, your units will have to be re-supplied by friendly units or face becoming a smoking pile of rubble.   The other massive change to the genre is the restricted number of resources for each level.  Each mission has a finite number of exploitable assets that players can use for base construction and unit production.  This correlates to the plundering of natural products for the first wave of spaceships and the steadily decreasing distance from the sun.  In effect, it enforces a certain amount of conservation upon the player, because you can (and in some cases, need to) transfer credits and units from base to base to have a fighting chance within some missions.  See, once expended, the player has to either make do with what they have, acquire the enemy's resources, or perish.  Obviously, the preservation of credits restricts the number of en masse strike forces that you'll launch, forcing you to strategically plan out the best way to assault a position.   Regardless of these innovations on the RTS formula, Lost Souls comes across more like an expansion pack than a completely new game.  There are no new units to be found within the game, no new factions to fight, no graphical improvements or sound augmentations.  In fact, with the exception of the new set of missions for each group, you'd swear you were playing The Moon Project or the original Earth 2150.  Maybe this is the reason why a majority of the competition you'll face online prefers to play the Moon Project instead of Lost Souls. They're not missing anything, and they know it.   While the game does feature the solid camera controls from the previous two games, it also features the clunky control panels and pathfinding issues from its predecessors.  This can be a major problem when dealing with a large-scale attack from the computer.  Enemy AI within the game is quite good, and the difficulty of Lost Souls is rather high.  Many times, you'll find units driving past targets, getting confused and attacking enemies they deem more important, or following enemies into rather blatant death traps without a second thought.  Computer controlled enemies, on the other hand, perform concerted attacks with ruthless efficiency.     It doesn't help that the same old intro movies and tutorials have been included, meaning that if you've been playing this game for a while, you're not really missing anything.  On second thought, it's a plus that the tutorial has been included, because the written documentation for this game really sucks.  Weighing in at a paltry 26 pages that describe the barest basics for the game without describing units or other aspects of the game, it simply isn't enough information for the game, especially for newcomers to the series.  Even experienced players may be forced to re-examine the tutorial to jog their memory of what units are and what buildings perform what functions, because you won't receive any explicit ideas with Lost Souls.   Veterans of Earth 2150 will probably be disappointed in the lack of pressure associated with the inevitable end of the world as well.  In the original, there was a set time limit of 180 days to complete all of your missions before the world came to an end.  If you consider that The Moon Project ran essentially parallel to the time period of the first game, there should be an even greater pressure to escape the planet before it burned.  However, there's no timer and no immediate threat to destruction save mission imposed limits, making the eventual goal of escaping the planet seem more lackadaisical than frantic.  Plus, you'll frequently discover that you're not entirely sure how to proceed in a mission because of a lack of information.  No information equals quickly mounting frustration.   Graphically, Lost Souls still looks rather nice, but the engine is quickly becoming outdated.  This is immediately noticeable if you zoom in on units, as you'll detect the aliasing flaws and sharp, blocky polygonal shapes of the units.  3D landscapes are decently represented, with plenty of mountains, valleys, and bodies of water within the environment.  As I said before, the weather plays a major role within gameplay and strategy, and the weather effects manage to pull of a major graphical coup with their detail and depth.  Rainfall will obscure your view of units and buildings, making it very hard to see what's going on.  Similarly, everyone who's played an RTS has gotten used to the concept of ~fog of war,~ but this is one of the few games where the fog is so thick that it can be used as an additional weapon.  However, one of the coolest aspects from the first title was that the landscape and the weather changed as the game progressed, displaying the impending disaster.  Somehow, in the transition from the first title to the third, this exhibition of pandemonium on the planet has been lost.   You'll also be able to discern the direction of the wind by blown smoke, which billows and floats naturally from power plants.  Buildings and vehicles are nicely animated as well, with individual articulation amongst different parts.  Doors slide open, siphons pump up and down and turrets swivel.  Lighting is also well handled, as turning vehicle lights on or off can have a dramatic tactical effect on play.  Combat is nicely done, with great reflections displayed from shields reflecting laser beams.  Individual rockets are also tracked as they streak across the screen towards their intended target.  In fact, the engine does an amazing job of tracking every laser, every rocket, and every attacking unit without a hint of visible slowdown.  Even better are the explosions and scattering of flaming debris from buildings and eliminated enemies.    What did you think of Earth 2150: Lost Souls? Music is still as dynamic as it has been in the two previous games.  As a matter of fact, it's the exact same soundtrack, without any new arrangements or pieces of music.  However, it does feature a shifting score, moving from fast paced techno to hard-edged guitar solos to sweeping orchestral arrangements, one that sets a nice backdrop for in-game action.  Sound effects, such as the building of bridges or tunneling of passageways come across with a mechanized, industrial tone, while explosions and weapons fire sounds appropriate.  The largest fault found within the game, one that has plagued the Earth 2150 series since its inception, are the voices, which come across in a very cheesy delivery.  Whether it's the canned production of the robots of the UCS, the overenthusiastic voices of the LC or the heavily accented sound of the ED, they could've been produced better with more variations to unit speech and text delivery.  If you noticed, I didn't really speak too much about the online component of Lost Souls.  Earth 2150 has long had a thriving online community, ever since the original game launched Earthnet and it's subsequent successor, Moonnet for The Moon Project.  I've been doing a lot of talking to players online and in messages about Lost Souls, trying to gauge their opinion as to why so few of them play the latest game in the series.  Quite a few of them simply haven't purchased the title, but a majority of them didn't see a difference in the two games and prefer the older title to the newer.You know something, in many ways, they're right.  While Lost Souls does add to the storyline of the series, attempting to extend the premise of the Earth's last days, there's absolutely no innovation or new features to truly make this game stand out.  Like I said earlier, the game comes across more as an expansion pack than a standalone game, and probably works better in conception as such than the third title in the series.  Hardcore players will probably pick this title up as a matter of course, but those new to the game might want to pick up the original or The Moon Project, primarily because there's more documentation and information explaining how to play in those two games than Lost Souls.Don't get me wrong, though.  While it's starting to show its age, it still manages to deliver a thoroughly enjoyable playing experience.  Lost Souls still has a lot of merits.  It still features the classic gameplay that Earth 2150 founded, that of a genuine strategic experience with an interesting premise and a rock-solid gaming engine.  It also introduces creative spins on the RTS genre, many of which will hopefully be taken and built upon by following games.", "date": "Jan 6, 2003"}