{"name": "War of the Monsters", "name_review": "War of the Monsters", "ref": "https://www.ign.com/articles/2003/01/09/war-of-the-monsters", "text": "With a vast development lineage that rivals many of the top companies, the Salt Lake City-based programming house Incog. Inc has quite a legacy behind it. Superstar fathers to the excellent car combat title Twisted Metal: Black and its network counterpart Twisted Metal: Black Online, the team responsible has already established itself years earlier when select members of the group were part of the now-defunct team Singletrac. Games such as Warhawk, Jet Moto, and the first two Twisted Metal titles were a driving force behind Sony's PlayStation second-party muscle, and to this day are still considered among the top developers for that system. Needless to say, expectations for Incog's next game were incredibly high, and in a move that surprised no one, they leapt at the chance to meet them.   With that, they presented War of the Monsters. A high-action, city-destroying fighting game that runs on the very same (albeit altered and improved) engine that powers Sweet Tooth and his compatriots. Created as an ode to the science fiction and horror flicks of the 1950s and '60s, War of the Monsters isn't exactly the most original idea for sure -- We've been playing titles like Rampage and King of the Monsters for years now. But let's face it, other than the recently released GameCube Godzilla game, there hasn't been a decent 100-foot creature entry in eons. Luckily for us, Incog has stepped up to the plate just as it said it would and delivered the genre-busting all-action funfest we were hoping for; or at least, most of it.   Attack of the Burly Beasts  Since the game draws its inspiration from movies like The Beast From 20,000 Fathoms, King Kong, and the aforementioned Godzilla, the characters immediately appear to be offshoots from the great Ray Harryhausen. Resembling the cinematic legends we're familiar with while sporting enough differences to save them from Takara copyright laws, each of the game's 10 gigantic beasts are as fun to play as they are to look at. And while they may seem to be the same creature in terms of handling and ability at first glance, the truth is they're more different than you think.    Preytor the giant mantis for instance is the quickest little baddie in game. Incredibly fast and maneuverable, the giant attitudinal insect is a terrific opener for beginning players as is his furry buddy and polar opposite Congar. Inspired by Joe Young and the like, Congar is a mighty gorilla that not only climbs buildings like nobody's business, but also packs a wallop as powerfully as anything else in the game. It's these two mighty beasts that we see battling in the carefully crafted cinematic intro, and are without a doubt the two most versatile and useful creatures in the game.   What those two beasts make up for in usefulness, however, they lack in creativity. Praying mantises and giant apes are awesome yes, but how much more interesting is it to assume the role of the Godzilla clone Togera? Or the giant Robo-47 droid and homage to Mazinger Z known as Ultra V? They may not be as novice-friendly or familiar as the first two stars, but there's something about the charisma of these characters that draws you in and forces you to play as each and every one of them. They're all designed incredibly well, and their personalities stick out like sore thumbs.   It is unfortunate, though, that the designers decided to leave the monster count so low. In a day and age when fighting games are reaching casts of 40 and 50 combatants, the eight initial fighters and few hidden additions leave a lot to be desired. When playing against a friend especially, it feels as though there should have been at least twice as many pugilists to choose from. At least each creature has a variety of different skins that are quite different from one another, instead of the usual palette swap. The ant version of Preytor in particular, is one of my personal favorites, and is just a taste of the many possible costumes.    Configuration, the Mechanical Terror  Handling more like Power Stone rather than Virtua Fighter, War of the Monsters is the perfect example of the old adage ~easy to learn, difficult to master~. Manipulated with either the analog or digital pad, your characters have full three-dimensional movement and can jump and climb over and onto any obstacle on the screen. Select taunts, R2 blocks, Square and Triangle act as both light and heavy attacks, while the L1 and R1 keys allow your monster to strafe should you want to use Square's secondary function of shooting.   Determined by the distance between yourself and the opponent, shooting is actually quite the important aspect of War of the Monsters that will most definitely be exploited by defensive players. It doesn't do much damage and depletes your characters energy bar quite efficiently yes, but what it also does is serve as a fantastic long-range annoyance; at least, when you're the aggressor it does. When you're on the other end of the stick it's close to impossible to run away from the barrage of projectiles heading your way. Tagging an opponent as he runs or leaps away in search of health or power-ups can turn the match in your favor pretty quickly. And while some of my co-workers evaluated this technique as a weakness in the game design, I found it a clever way to promote multiple forms of combat, and give players a reason to destroy/not destroy the structures around them. Eighty-story buildings work fabulously as shields.   If fighting up close is more your style, the combo system is a little canned, but offers up some healthy diversity to keep you happy. Though it's possible that there could be many more combinations to find if you spent your whole life looking for them, it appeared that each monster had around eight to ten different types that strung together for as many as 20 hits. Putting them together correctly is another story entirely, as it's possible to counter combos at multiple points, recover while being hurtled through the air, and grapple your opponent with the touch of a button. Not to mention the two special attacks that each creature possess in their arsenal.    Consisting of both a short range and long range techniques, the special attacks are done the way they should be handled in every 3D fighting game; They do slightly more damage than a regular blow, distract or subdue your opponent, and look spectacular. Accomplished by pressing either the Square and X buttons simultaneously, or Triangle and Circle, the uncomplicated pyrotechnics act more like lifesavers rather than finishers. Admittedly, some are more useful than others (Togera's radioactive breath is far more helpful than Agamo's detachable and exploding head for instance), but on the whole the skills are pretty balanced and supplement each character nicely.   There are other button commands too, like pressing L1 and R1 together to auto aim your nearest threat (never forget this!) or using circle to pick up nearby objects and chuck them into hapless foes. Both of these techniques are extremely important should you want to win consistently, and when throwing objects in particular, can take off a substantial amount of your opponent's health when you discover which items that can impale them. Further proof that an outwardly simple game is actually much deeper than expected.   But that's the running theme in War of the Monsters: More than expected. Even after you've perfected the nuances of the combo system, the special moves, and learned all the proper defensive tactics, you'll still master the usefulness of the stages themselves. Entirely destructible, and carefully put together to promote all sorts of different battle approaches, utilizing debris, automobiles, and other obstacles to your advantage is all part of the fun. Imagine my surprise when a building toppled over onto my monster to crush it instantly rather than shatter into little bits as they typically do. Or the excitement I expressed when I discovered that you can uproot a giant Excalibur replica in Las Vegas for use in the field. Play War of the Monsters long enough, and you'll discover all sorts of surprises.    An Ape That Was Smarter Than Man  Another feature in War of the Monsters that stood out as remarkable, was the complexity of the computer's artificial intelligence. A moderate challenge on easy mode, the higher levels of difficulty are not only incredibly insane displays of fireworks, destruction, and mayhem, they are also frightening examples of the Emotion Engine's ~thinking~.   If you don't believe me, play a session on the Normal setting and play as hard as you can. Be amazed at how clever your opposing players turn out to be. Beat them into a bloody pulp for instance, and they'll lash out with one of their special maneuvers to get you off their back, before quickly darting and dashing between building crevices in search of health. That's right; when these giants are hurt they'll actually hide from you and go hunting for treasure. The CPU is already aware that it can't take you out in it's current state, and will do everything it can to get itself back into shape to whip you. It's really quite impressive, to watch an A.I. routine skip over the conventional wisdom of just standing in front of you to take punishment. These beasts want to win the fight every time out, and will do everything in their power to do so.   But the enemy's attacks don't limit their focus on just your character. If you're in an area with four beasts, and two of them are affiliated with each other while the other two aren't, that pair will team up and fight the other two monsters while they're in the middle of fighting amongst themselves. Don't get me wrong, the CPU always places the human player a priority opponent when fighting in a skirmish, but it doesn't become oblivious to the rest of the happenings around it. If there are enemy beasts around, and it considers it a bigger threat than you, it will attack that creature instead. War of the Monsters is the proud owner of the best artificial intelligence in a fighter we've seen yet These uglies aren't cheap win they win, they're tactical. Especially the bosses -- they're really nasty.   The Thing With Two Controllers  The section where War of the Monsters really finds its place, though, is the completely addicting two-player experience. Already mentioned in the Video Preview we did just a few days ago, the developers took advantage of an increasing trend in the videogame business -- that of the split-screen/full-screen integration, and exploited it to the fullest. Instead of confining two human players to small area of the battlefield with each bout, each player has complete freedom of movement. Should one person want to run to one side of the screen, while his opponent goes the other way, it's entirely possible. With no scaling needed.   It's accomplished by splitting the screen vertically just as it was in Twisted Metal: Black when two opponents are far away from each other. As they get closer however, the screen will seamlessly merge into a single full shot with both players on the screen. It's a small, but clever touch, which makes the use of split-screen easier to swallow for those of us who prefer our action in one place, or those unfortunate enough to have a small television.   Sadly the system isn't quite perfected yet, as there are occasional instances of the screen going split or full too soon and too late. While it doesn't happen at an alarming rate, it's a frequent enough occurrence to be noticeable. Truth be told, there are numerous examples I can recall that had me face to face with another monster, only to be stuck in the split-screen mode for three to four seconds longer than I should have. Not too big a deal really, but it's in there.   Technical issues aside, the two-player game itself supports a nice feature set. With a standard Free-For-All mayhem mode and an elimination option that lets you choose multiple monsters to switch between after losses. For our dollar, the best mode to enjoy is the Free-for-all selection with a set number of pre-determined wins crowning the victor (though unlimited play and sudden death were also available). Gaming sessions that lasted as long as five hours were not uncommon in these instances, and quickly became hazardous to our health as we refused to eat until we were finished.   That's not to say that the multiplayer mode didn't turn out to be a bit disappointing. The three available mini-games are next to worthless and why War of the Monsters only supports two players instead four is unfathomable (at the very least, it could have supported two on two via the I-Link cable). The lack of any type of online feature, be it downloadable content or full on SOCOM-like match play, is a painful oversight as well, and with the Network Adapter and Xbox Live catching so much positive buzz lately, it would have been great to cash in on that. Ah well, that's what sequels are for I suppose.   Visuals From Outer Space  One look at the brightly-colored, silky-smooth graphics that War of the Monsters pumps out on a consistent basis, and you may never look at your other fighting games the same way again. Each individual monster is rendered with thousands of polygons while maintaining the personality we've come to expect from Incog games after Twisted Metal. Totally different from one another (even when playing as alternate versions of the same character), the excellently designed monsters look and react just like the ones we grew up with on television. That alone is worth a multitude of points.    But the real star of the show visually, is the incredibly detailed stages. Totaling 13 in all, the highly populated and expansive arenas are inspired by plenty of real world cities. Although these places aren't referred to as Las Vegas or San Francisco as they most obviously are, they still reinvent those locations with near perfect execution. Alas, that's only the beginning. What's really remarkable is the destruction that lies in the wake of your actions. Skyscrapers shatter and topple over, helicopters and tanks fire tracers before exploding in balls of fire, and massive crowds of screaming people run for their lives in horror before being smashed into the ground as bloody puddles. This is the total embodiment of an interactive monster movie, without even a hint of framerate slowdown.   The special effects aren't quite as spectacular, but they still beat out the old black and white visuals of the movies they're based on, and when seen in conjunction with the hilarious taunt animations and excellent closing cinema CGI sequences, the production values become readily apparent; truly a beautiful-looking game.    Beyond the Speed of Sound  With special thanks to the folks at Tommy Tallarico Studios and Big Idea, the soundtrack to War of the Monsters is nigh-perfect. Inspired by the same horn-heavy themes that used to populate the Saturday night drive-in, the sweeping and powerful score really pounds your eardrums. Especially when hooked up to a surround system or television set with a decent audio output.   The sound effects are just as sweet with grunts, roars, and screams chiming in at the just the right time. Cars honk at passing creatures, hordes of panicked evacuators shriek in terror, and the crackling of electricity are but a few of the dozens of subtle and not-so subtle vittles that populate the speakers throughout your adventure. Too bad we didn't get all this goodness in DPL2 or DTS though; it could have raised the bar even higher.As you may have surmised by now, we had an absolute blast with War of the Monsters. Somewhat shallow with its one-player adventure options (the story for each monster is identical) and damaged by a lack of four-player support, it's still one of the most entertaining games to hit our offices in quite a long time. Simple as it may be on the surface, the game's finer points are a lot deeper than they first appear. How else could you explain one of our more recent playing sessions when we gave this a go for seven straight hours without ever even caring what time it is?All we can do now is look to the stars and cross our fingers for the possibility of a soon to be released sequel. If Incog could double the monster count, toss in four-player and online play, and add a couple more stages we could the beginnings of the greatest party game ever made. In the meantime, however, the first and only edition of War of the Monsters should be studied over carefully. It's rare when a game like this comes along, and an appreciation for it is assuredly deserved. Do the proper thing my friends -- buy this as soon as you can.", "date": "Jan 9, 2003"}