{"name": "Impossible Creatures", "name_review": "Impossible Creatures Review", "ref": "https://www.ign.com/articles/2003/01/09/impossible-creatures-review", "text": "I've seen a bit in my life. More than some, less than others, but I was sure that I had seen one of the biggest freak shows on the planet the day I walked into the IGN offices and met my future colleagues. But even this level of bizarre and depraved looks and nature that I have become accustomed to doesn't quite match the sheer oddity that comes with the premise of Microsoft and Relic Entertainment's genetically enhanced real-time strategy title Impossible Creatures. If the idea of taking different species of animals and mixing them together doesn't interest you by itself, then taking those creatures and putting them into battle should push you over the top. While it isn't the best RTS I've ever laid hands on, I've had a pretty good time playing Impossible Creatures from my first crack at the helm last February through this final copy, even if everything doesn't work quite as successfully as planned.   Impossible Creatures takes the normal RTS formula of humans at war in the future or Elves and Orcs beating each other over the head with overused ideas and pounds it to a pulp with it's bizarre nature. Instead of people, robots, or other sentient monsters doing the attacking, you'll be in charge of an army of your making. You'll have to make this army with the Sigma technology that allows genetic combination of two different species of animals. Mix and match parts to create around 40,000 different units in total, although a lot of these units will be close enough to each other that you won't be able to tell the difference. Sometimes a tail is just a tail, you know?   Impossible Creatures follows the exploits of Rex Chance, a slightly Indiana Jones-like war correspondent and adventurer who's out to find his long lost father after receiving a note from him revealing where he's been. Turns out he's been doing genetic research on a thousand mile long chain of islands off the coast of Chile under the employ of one Upton Julius. Upon arrival however, Rex quickly discovers that all is not well on Isla Veritas as he's attacked by ant wolves... an unpleasant surprise for most people I would think. In fact, Upton Julius has done some very bad things to your father and the research project. With the help of a woman named Lucy Willing, a friend of Rex's long lost pop, he is able to escape and start his journey of discovery and revenge.   The story is set in 1937 with the feel of pulp coursing across the surface. Everything is done with this adventurous style from the nifty future technology of the 30's to the way the script has been written and the characters behave. Rex is out for vengeance and Lucy just wants to save her project. Both make good heroes and the same goes with the several villain characters. They're an amusing bunch from the brutal Scottish Whitey Hooten to the appropriately creepy mad scientist Otis Ganglion. They all are wonderfully done with style and character and terrific voices. The story progresses with the help of each of these characters and their fun cut scenes as you fight your way towards the mastermind Upton Julius finding along the way that there is more to Rex than meets the eye.     The single player campaign is fun and creative in most parts with a bunch of objectives per map to keep you on your toes and interested in what's happening. The beginning of the journey sees you with zero creatures in your army, so you'll have to do some quick work and collect some DNA from the indigenous fauna on the different islands as you go. Each time you tag one of these creatures with Rex, you'll have the genetic blueprint of an animal to use during the single player campaign.   As I mentioned earlier, the big difference between normal RTSs and Impossible Creatures is in the way units are handled. Most RTS games will offer you a selection of units that have been balanced to compliment and counteract each other offering up specific abilities exclusive to them. Relic has instead created a system where players are given the opportunity to create their own units for battle using the genetic blueprints of 50 stock animals to create hybrids. While this is a cool idea and creates a wealth of different units, it also means that the game isn't nearly as focused as a standard RTS would be making it hard for the balancing to be on par with the great strategy titles of all time. They've certainly given it a valiant effort, but when all is said and done, much of the actual fighting and battle tactics aren't as interesting as StarCraft or Age of Empires.    Each stock animal comes with different attributes like speed and toughness to pack hunting mentality and regenerative abilities. Specific parts of these animals also contain special abilities. So lets say you take an electric eel and an eagle and put them together. If you don't give it the wings of the eagle, it won't be able to fly. If you don't give it the head of the eel, it won't be able to shoot electricity out at enemies. The trick here is balancing what you want. The eagle also has very good vision for scouting purposes, but in order to use that, you'll have to have the head of an eagle, so taking the head of the eel is going to significantly reduce your creature's sight radius making it less useful as a scout. Tailoring your units for specific purposes is the name of the game. You'll need to have ranged attack and artillery as well as building destruction creatures and powerful melee units in order to run a successful campaign.   You'll also have to take cost and research level of the creatures you make into account. Stock creatures have a beginning research level of anything from one to five. Depending on the two creatures you combine's levels and which parts you take from each animal, you'll end up with a final research level that you'll have to advance to in the game before you can create the beast. The levels cost more and more as you increase in level, but the higher creatures are much more powerful than the lower level creatures. They're also much more expensive.   While keeping all of this in mind, you'll also have to pick and choose carefully because there are only nine slots for creatures in your army. Half of the strategy is actually in the creation of your tailored army. Single player and multiplayer handle this differently however. The single player game will allow you to mix and match your creatures as you go, partly because you'll have to collect them as you move through the game and partly because you'll have to play with creatures in order to understand their uses. It'll take you a lot longer than a normal RTS to really figure out the best unit combos on the field because of the enormous selection. Therefore, the single player gives you a good turn and pauses while you fiddle in the lab to create your monstrosities.    Multiplayer will have combatants battling with pre-made armies. Some of these have been prepared and canned by Relic but the real fun will be in creating your own suited to your specific play style and tactics. The crazy part about multiplayer battles is that you won't know what creatures you're going to be fighting against until you actually see them in combat. You may have units that can crush your opponents or they may be able to exploit the one weak link in your army.      Actually creating the creatures is a ton of fun both for comedic and strategic value and the interface is fantastic. You'll first have to select two creatures from the list, which can be sorted through by attributes and abilities making it easy to find the creatures you need. Once you get have the creatures you want to mix, they'll appear at the top portion of the screen on either side. In the middle will be the hybrid that morphs as you make changes to it. You make these changes by either selecting body parts by hitting icons located on either side of the hybrid, or by hitting buttons for the special abilities that are available to each of the creatures. By hitting the special ability you want, it will substitute the appropriate part automatically so you won't have to search for it. This works for everything from attacks to special abilities. In the middle bottom is a list of attribute numbers for speed, health, defense and so on. These all change with every part that you switch in and out so you can see the difference your making in the stats.    You'll also be able to see how much the changes add and subtract from the cost of your creature. Seeing the disproportioned creatures pop up on your computer screen is a kick. Most of them blend together very nicely with only a few combinations making utterly bizarre kinks in the model. It's an awesome system and one that they should pat themselves on the backs for.   The only problem is that some of the creatures are just plain useless and the first levels of research are easy enough to get though and defenses strong enough against weak creatures that the many lower level creatures will be left out completely in many battles. It also seems as though some specific animals are much more useful than others. Most of my armies in the single player game when dealing with third and fourth level creatures were made up of lobster hybrids entirely because they were so much better than everything else. While my unstoppable Le Grande Crustacean Armee was fun to see, especially in the funny way they ran across the ground, it was too bad that they were the obvious choice to mix other abilities with.    The same thing goes for flying units. They're just so underpowerful it's sad. I've found very little use for them as comparable ranged ground units (in terms of cost and research level) can destroy them with little trouble and anti-air towers can kick the crap out of nearly anything in the sky. What I would have like to have seen is a giant poop bomb from a pelican hybrid. Have you see the size of the poops those birds take? Now that's dangerous! Seriously, super weapons like my proposed super bomb would have added a little weight to an otherwise sad air assault.   The fact is, abilities like flying and camouflage or digging can be countered so quickly and easily at all levels that it's nearly worthless to try for anything sneaky either. There are enough easily attainable and affordable counters for these abilities, it's silly. In fact, most of your level 1 or 2 creatures will have part wolf or coyote in them, which both have keen sense abilities used to detect hidden creatures.   Once you've got an army you like, you can use the army analyzer that will let you see the strong and weak points. It'll tell you everything from not having strong enough melee units to not enough level two creatures included. It's a big help for beginning commanders that are a little uncertain about what they're doing.   When you've got your army together and are in the game battling, you'll be in for a visual feast. Watching your freaks run around spitting lightning, kicking, biting, scratching, and whatever else they do is pretty fun. The terrain and units are all done very well with lovely colors and style. Visual effects are beautiful although I wish there were more of them as flashy as the electric eel burst.    Sound on the other (the critters are under attack) hand is quite a mixed bag. I wanted to strangle the henchman (the critters are under attack) as he is constantly (the critters are under attack) telling you when your critters (the critters are under attack) are under attack even if you are looking (the critters are under attack) and controlling the critters that the damn (the critters are under attack) henchman is warning you about. Yes! I know the freakin' critters are under attack asshole! Shut the F up! I did shut him up, especially since half of the office was ready to lynch me and my poor critters. Unfortunately that also meant that the warnings of your buildings being attacked are shut off leaving you up to watch for the icon showing that something is happening. So some of my buildings got destroyed when I wasn't paying close enough attention. Unit acknowledgements for the human characters were pretty weak as well. For there only being a couple of human characters, Relic didn't put much variety into what they say. I can understand the creatures not using a bunch of different sounds, but you might as well do more with the people. When you get past this shortcoming however, you'll find some great voice work in the cutscenes and wonderful music all around.      Actual control of the game is pretty slick with a nice GUI and basic RTS commands. Control of the 3D camera should be easy enough for everyone, including those that have never played one of these types of games before. The AI didn't do anything that surprising or special, but different AI does use different tactics. You'll get some of the trickle attacks, AI that builds and then tries to crush you with a giant force, constant nagging attacks to keep you occupied, and some that tries to expand fast in the skirmish mode and so on.     What did you think of Impossible Creatures? Actual unit AI isn't always as terrific. Most of the time they picked targets that I would have, but every now and again, they would just stop attacking or attack a building on their own while creatures and defensive installations are hitting it. Pathfinding is a pain sometimes. They'll always take the shortest route to a point, but some of the time this means they'll be walking in a long straight line just waiting to get torn up by enemies in wait or bunching up and milling around pathetically in choke points. It certainly is better than what it was in beta however. Creatures hardly ever turn around and go all the way around the island to get to their destination if the path is blocked now. The cramped valleys and bases will often mean you'll need to make sure your melee units run in front of your ranged or they'll get stuck in the back of the pack.While it isn't the best RTS I've played, Impossible Creatrures is a good, fun, and very creative game. If you're looking for a new twist on an old genre, this may be what you need to boost your interest again. Hell, if you're new to the genre altogether, this is a pretty interesting way to start.The creature creation process is close to enough to recommend this by itself, but put together with a fun single player mode and interesting Magic the Gathering style army building multiplayer strategy, it's a kooky ride that most gaming fans will enjoy. Add that up with the promise of many mods due to Relic's mod developer network and open engine, this could grow bigger than it is now.It's barely shy of missing total approval, but for sheer style and creativity alone, I recommend that you at least give this one a look before you head out to the store next time.", "date": "Jan 9, 2003"}