{"name": "Crimson Sea", "name_review": "Crimson Sea", "ref": "https://www.ign.com/articles/2003/01/09/crimson-sea", "text": "Koei's back with another game, and no, it's not based on ancient Chinese history.  It's Crimson Sea, an action-adventure game that features a unique melange of gameplay styles, great graphics, and some of the hokiest voice acting this side of Nobunga's So-Cal condo.  So how did this hodgepodge of gaming styles turn out?  Read on.    Gameplay The game puts you in the role of Sho, head of G-Squad, an elite group of agents for the Intelligence Agency of the Galaxy (IAG), as you go out to stop an alien (Muton) invasion from destroying the galaxy.  I'll bet you've never heard a story like that before.  Actually, even though the basic premise sounds incredibly cliche, there are a lot of interesting twists and quirks to the story that keep it entertaining and interesting.  I'll refrain from going in-depth into the story since that's where half the fun of the game comes from.  You'll laugh, you'll cry (well, maybe not cry), but you definitely won't be bored.  The cutscenes and FMV are great to watch.  They look good and are quite funny, intentional or not.     Crimson Sea is your atypical run-and-gun game.  From a central hub, you take on different missions that will have you completing a variety of goals.  Sometimes you'll be protecting a team member while they fix your ship; sometimes you'll be searching a town for invisible enemies within a set time limit; other levels are of the scrolling type where you must collect a certain number of items before reaching the end.  One of the more interesting levels places you in a town where everyone looks human, though many of them are Mutons in disguise.  You must use your radar to find out who's what, and then eliminate the enemies.  While the levels aren't drastically different -- you are always killing a LOT of Mutons (bugs) -- they are varied enough to keep the game feeling fresh.  That's not to say every type of level is perfect.  The timed missions can become a little frustrating because if you don't complete the objective in the, say, 20 minute time limit, you must start all over.  When a level takes several tries to complete, it can get old pretty quickly.  Luckily, you usually have a choice of several missions you can tackle in any order, so you can always try something else and come back to the failed mission later.      Oh, I trust you alright.  Actual combat is performed using either your gun or with a melee attack.  You begin the game with your standard issue gun, but as you acquire money throughout the game you can buy upgrades.  And we're not talking about simple upgrades.  There is an pretty in-depth gun upgrade system that is divided into three categories: barrel, effector, and generator.  Each category has its own set of upgrades that can be purchased (or found), and by combining different pieces you can create a gun that suits your tastes.  Also, as you use the gun, it will gain experience and raise levels on its own.  Another feature of the weapons system is that if you don't like the gun you've made, you can go into your inventory screen and make a new one since you keep every gun part that you purchase.  This is a great feature that changes the way you can play through levels.    Of equal importance is the melee combat system.  You have a ~blade~ of sorts that you will find yourself using more than you might think.  Great for combat in tight spaces, your blade also alters as your gun does.  Each gun upgrade you purchase and use also affects your blade's stats, so you must keep this in mind when not only purchasing your upgrades, but also when using them.  It's nice to see a game give a little more attention to its combat system, rather than having it be just a button-masher.    Besides your gun and blade, your character will also have Neo-Psionics that he can use.  These are pretty much analogous to your typical super move and do damage to all the enemies within a given range, though not all of your Neo-Psionics are offensive.  Some cure teammates, others shield enemy attacks.  Then, of course, you have ones of mass destruction.  Each of your Neo-Psionic attacks can also gain experience and raise levels, making for an overall RPG-like weapons system.  Again, it's good to see that some thought was put into what might otherwise be a shallow action game.      One would think that a third-person 3D shooter would have either the standard Halo-type controls, or maybe something like Dynasty Warriors, but Koei has opted for a control scheme that some will find absolutely heinous.  The left stick moves your character, but when you make a sharp turn left or right, your character will rotate in place a la Resident Evil.  Not exactly the most efficient control scheme for an intense action game.  Also, instead of the right stick controlling a free camera, pressing left or right on the stick will cause the camera to swing in the pressed direction to certain degree and then it will snap back.  Almost a useless feature if you ask me.  Other odd control mechanics include having to hold down both triggers to go into a Splinter Cell-like first-person mode (camera is behind and to the side of the head), and using a button to make a quick 180 degree turn.  While the 180 is not really that strange, the fact that you have to be standing still to do it makes it hard to run away from a group of enemies, then quickly turn around to blast them.  The controls are clunky at best, and what makes it even worse is that you cannot customize the button configuration.  You can't even invert the aiming!  I always use an inverted stick, so adjusting to the game took a bit of time.  The lock-on feature is also only useful when battling bosses or a small group of enemies (which is rarely the case in this game).    So the control sucks, right?  Well, yes and no.  Although there are plenty of changes and tweaks that could make the game a much more user-friendly experience, the game is still playable.  The more time you spend with it, the more you begin to understand its strengths and limits, and can plan your strategy accordingly.  Like Gunvalkyire, with practice you can master the control scheme and actually get quite comfortable with it.  Even the Resident Evil games were fun with their impossibly clunky (even more so than Crimson Sea) controls.     These shoes suck for Muton killing. Crimson Sea will remind you of a lot of games but at the same time feel like its own entity.  After spending only moments with the game, Phantasy Star Online, Gunvalkyrie, Dynasty Warriors, and Final Fantasy all came to mind.  Not a bad list of games to draw from if you ask me.  When fighting, you (sometimes) have a team of CPU-controlled characters fighting with you, there are plenty of bug-like Mutons to kill, and there are even some RPG elements thrown in for good measure, like gaining experience and buying and using items on the fly.  Also, like Gunvalkyrie, many levels have you clearing out all the enemies in the area, with a score assigned upon completion of the level.  The overall score is based on factors such as how much time you took, how much energy you lost, and what your max combo was.  Crimson Sea even uses a similar scale as GV: letter grades, with 'S' (Super) being the best.    Also, the influence of the Dynasty Warriors games is more than obvious in Crimson Sea.  Each level contains literally hundreds, maybe thousands of enemies that you must destroy, and also like DW, touching an enemy will not hurt you.  They must actually attack you for your character to take damage.  This makes sense, and in a game like this it is almost necessary.  No one could realistically dodge every enemy that comes at you in this game.  So while the numbers may seem daunting at first, you begin to realize where you have a little bit of leeway and can plan your strategy accordingly.  Another feature borrowed (though slightly modified) is team management.  You have a varying number of teammates (depending on the level) that will fight with you.  While you can just have them run around doing their own thing, those wanting to take a little more control can assign their party in one of several different battle formations.  If that's still too basic for you, you can also assign each member to a specific point on a 5x5 grid, your character always being in the center.  And although you can place a character anywhere, each character has specific locations that they prefer and will be more effective in.  At its core, it's a relative rudimentary system, but this is an action game, not a strategy game.  What's there is just enough to give the game the depth it needs without over complicating things.      Graphics Oddly enough, Crimson Sea's visuals remind me of the visual styles used in all of the games that it also borrows gameplay elements from.  You've got the high-tech, yet organic feel from PSO, the enemy and boss designs from Gunvalkyrie, the unique (is this an understatement?) hair designs and sexy girls from Final Fantasy (Live-D could be LuLu's long lost sister), and the Asian flair found in the Dynasty Warriors games, as well as many of Koei's other Asian history-based games.  All of these elements meld well and give the game a unique, yet familiar feel.      From a technical standpoint, Crimson Sea is quite a looker.  During battle, you'll find yourself surrounded by literally hundreds of enemies with nary a hint of slowdown.  Even after playing the game for some time, seeing all those bugs scurrying across the screen never really loses its appeal.  It's nice to see that Koei managed to handle the onscreen chaos without the incredible fogging found in the Dynasty Warriors game, and maintain an incredibly smooth framerate to boot.  Nice Job.  Also worthy of mention are the fantastic character models.  Smooth, well-modeled figures and sharp textures, along with some truly original character designs, make the characters in Crimson Sea a cut above the rest.  This is particularly noticeable during the game's numerous cutscenes.  And the first time you see Live-D up close and personal...well, I'm sure you'll know what I mean when you see her, or any of the females in the game for that matter.    Ironically, during actual gameplay is when you will appreciate the graphics the least.  Not because they're bad, but because your character is a just a hair too small (to accommodate the ensuing chaos, of course), and also because the enemies move so quickly that you barely have a chance to appreciate their visual splendor before you have to obliterate them.  Not really an issue, and you're more than compensated for it with some boss characters that will have you searching through a thesaurus to come up with an accurate description of their physical attributes.            Yes, I'm so cute. Sound Typical of many Koei games is questionable voice acting and Japanese-tinged guitar rock, and Crimson Sea continues this arguably fine tradition, though to a lesser extent.  While the voice acting is definitely hokey at times, it's always remains bearable and enjoyable, though maybe not believable.  Yangqin is the only character that will gnaw at your aural experience, reminding one of an even more irritating Jake Lloyd.  Still, his lines are not numerous and, with the right attitude, can be thought of as humorous.    Musically, Crimson Sea has the above mentioned guitar rock, but it also has a good amount, and range, of atmospheric and orchestrated tracks that do a great job of creating the mood and accenting the story.  Take the bgm that plays while you're in IAG headquarters.  It's subtle, yet effective ambient sounds give the impression of being isolated in space, with an uncertainty in the air of what events have yet to transpire.  Perfect, since that is exactly what is happening onscreen.  Another level that has you fighting your way down a long bridge while trying to defend yourself from wave after wave after wave of Mutons has some upbeat, heavy rock playing.  Again, well suited for the events, even though it is a little cheesy.  But maybe that's a good thing...  The brightest spot in the game's sound is its excellent use of surround sound.  The in-game Dolby Digital 5.1 soundtrack is fantastic.  Spatial positioning and accuracy is right on the money, to the point where you will find yourself using audio cues to locate enemies and allies.  When surrounded by a couple hundred Mutons, the surround effect blankets your ears and will leave you dizzy, or feeling claustrophobic.  Combined with some nice sound effects, the overall impression is, er, impressive.Let's get this out of the way first: Crimson Sea is not for everyone.  Many will find its controls and camera too unforgiving, similar to how many found Gunvalkyrie unplayable.  And yes, the game does have its problems.  By no means are the above problems minor, but given some time and dedication, the game is quite playable and thoroughly enjoyable.  I would definitely recommend renting this title first, as many gamers will love it or hate it (or quite possibly both), though I think most hardcore gamers will find something to like here.  Crimson Sea is a great foundation for a new franchise, and if Koei can mend some of the more glaring issues, they could have a real hit on their hands.  Still, as is, Crimson Sea is an intense, fast-paced game that has a lot to like.", "date": "Jan 9, 2003"}