{"name": "Theme Hospital", "name_review": "Theme Hospital", "ref": "https://www.ign.com/articles/1998/04/16/theme-hospital", "text": "Nearly a year after its PC arrival, Theme Hospital makes its way to PlayStation, and with the exception to its annoying control, the game is just as creative, innovative, and satisfying as ever.  Basically, Theme Hospital places you in the position of creating a fully-fledged care center, filled with pharmacies, disgruntled nurses, doctors with bad attitudes, and competition from other hospitals. If you've played Theme Park, you'll immediately know what fun you're in for. If not, it's recommended that beginners give heed to reading the manual. It's by no means a heavily technical game requiring a career in medicine, but gamers will want to see how to built, buy, and compete in a productive and efficient way, and that takes a little learning.   The interface is set up by means of several menus from which you purchase every little detail in the damn hospital. You need to buy everything from plants and chairs to receptions desks, doctors, etc., etc. It's intuitive once you know the logic behind it, but many people might simply look at the blank screen and wonder how and where to begin.  In the long run, however, the game is deep and well thought out. Of your doctor choices, all of them have good and bad traits, and it's your job to explore their abilities. Some have more skills then others, including psychiatric knowledge (at least in the beginning), which helps to build clientele as well as reputation. The great thing is that if you feel evil and dark, you can build your hospital and then maim, injure, or poison your patients -- for pure entertainment purposes, of course. But there are ramifications, as in real life. Among other things, your reputation will drop immensely and patients will 'know' not to appear at your hospital, and instead begin frequenting a rival hospital. Theme Hospital is full of this kind of humor and choice, which makes it different each time you play. It's the brilliance of Bullfrog's wonderfully sick humor that makes TH such a must-have.  The game's biggest dilemma is housed in the usually versatile PSX controller. In the case of Theme Hospital, it's clunky and often times annoying, and the game doesn't support any kind of mouse, which forces players to use thr controller. The menu setup is logical enough, so once you start using the purchasing and selecting interface, you'll do OK, but it's not fast and if you've already played the PC version, you'll really pull your hair out with frustration. Or more likely, you'll simply go back and play the PC version.  Still, for those virgin Theme Hospital folks, this version isn't bad by any means. It's still a kick, and is deep and challenging all the way to the end.  Douglass Perry", "date": "Apr 16, 1998"}