{"name": "Blood Omen 2: Legacy of Kain", "name_review": "Blood Omen 2", "ref": "https://www.ign.com/articles/2003/01/14/blood-omen-2-7", "text": "Eidos Interactive has certainly capitalized on the Silicon Knights created character of Kain, a blood-sucking vampire anti-hero. First, with the original Legacy of Kain for PlayStation, which opened a new style of action-RPG to western audiences, and later with several sequels, including successful spin-offs in the Soul Reaver series. Kain has, over the years, transformed, in design and in character, always seeming to grow a little darker, and so have the styles of his tales, going from quasi-action-RPG to pure 3D adventure.  The latest, Blood Omen 2, follows the exploits of Kain once more, and he's more pissed off than ever. Armed with a variety of weapons and dark gifts -- special vampire magic, if you will -- the character runs, jumps and glides his way through large, dark worlds while fighting foes and sucking their blood. There are definite flaws and shortcomings in design and execution that scar the experience, but the end result is still worth investigating if you're a longtime fan of the atmospheric franchise.  The Facts  You are the vampire Kain - the most evil figure to grace a video game console Move through crowds unseen cloaked in stealth, travel stories above the peasant herds on which you feed leaping from roof-top to roof-top, and use mind-control on hapless fools to help you overcome vampire-proof inventions Drink the blood of your enemy Combat unfolds as Kain engages armies of demons and humans alike A variety of attacks, special moves and combos Travel through atmospheric gothic environments Single-player game No progressive scan, DPLII support   Gameplay Kain, a ruthless vampire, had chosen to rule a damned Nosgoth rather than accept death and restore the land to its rightful order. As the sequel tells it, over time he grew an army and spread his dictatorship through Nosgoth as if a disease. But an opposing force known as the Sarafan, a group made up of mutant humans and zealots, rose up against the vampire armies and took the battle to Kain. In a dramatic finish, the Sarafan Lord tossed the bloodsucker to his demise and all was well -- or so it seemed. Blood Omen 2 takes place some 400 years after the events of the original game and the story is just as intriguing. Kain, the wickedest of vampires, has been revived, and he's out for vengeance. Without care or concern, the vampire treks through Nosgoth and wreaks havoc, his ultimate goal to eliminate the Sarafan opposition once and for all.  Kain is cool. He's an anti-hero, sure, and though it seems almost clich? nowadays to be an evil conqueror in videogames, he was at least one of the first and he remains one of best. He's out for himself. He doesn't care about anybody else, and that's a cause and style we can get behind. So it makes sense that Blood Omen's storyline, which unfolds through in-game cut-scenes as you progress through the adventure, is one of its bigger selling points. The vampire does things that would make Mario bury his head in the sand and weep, and yet we don't mind; rather, we find ourselves entertained.   Were Blood Omen 2 made five years ago, it might have stood out in the genre of 3D adventure games. But by today's standards, it's easy to spot the game's lack of polish and formulaic, unrefined play mechanics. Kain begins the game with a limited set of abilities, but as he journeys deeper and deeper into the dark world he acquires special gifts, magic powers of sorts, that help him on his way. Progression revolves around exploration, but there are also simple puzzles and the inserted enemy encounter to break up the process. The concept is neat and tidy enough, and developer Crystal Dynamics has made good on some of it. Control is tight and responsive, but not quite up to par with some of the competition's offerings. Meanwhile, Kain's enhanced ability's are genuinely entertaining, from the standard suck attack that enables him to literally drain the blood out of a dying victim's body, to his supernatural mist glide, super jump, and more. The vampire can even trance some AI characters into performing certain tasks, which is admittedly not only devious, but very satisfying.    But the execution also has issues. The cities of Nosgoth provide the anti-hero with little more than a series of repetitious enemy encounters, far too simplistic puzzles and the occasional boss fight. It's as if Crystal Dynamics somehow used a standard template for creating an adventure game, inserted its property into it and generated the end product. Kain can punch and suck the blood of enemies. Yes. Check. He can and must flip switches to activate doorways. Check. Sometimes doors will only open when all enemies have been beaten. Check again. Done. And most of the levels have a ho-hum feel to them -- nothing particularly new and exciting, just more of what happened in the previous stage. That's not to suggest that it's all the same old, same old. The combat system, light for sure, still utilizes a lock-on function and it generally works very well. Plus, Kain can pick up weapons to beat on foes. There's even the draw of wanting to build the vampire's strength, gain him new abilities, and ultimately unravel the story. But there's no real wow factor -- nothing that makes us say ~whoa!~ as we did the first time we saw the worlds morph together in Soul Reaver for PS2. Indeed, by all accounts, Soul Reaver is the far better game, and that's disappointing considering that Blood Omen 2 arrives later.      What we have here is a standard adventure game with a slick license. We imagine that'll be enough for some diehard Kain fans. For others, though -- especially GameCube owners who've gone onto play the utterly more entertaining and polished Eternal Darkness: Sanity's Requiem, incidentally by the same team that originated Kain, this one's bound to be a lesson in edible, but dated play mechanics.  Graphics Blood Omen 2 has a graphic look to rival its gameplay attributes: a notch above average, but still outdated when compared to some other games -- competing products. Again, Eternal Darkness comes to mind. Kain and Nosgoth are visually presentable for sure and there may even be graphic portions that impress, but generally the look lacks detail and roundness due primarily to lower polygon designs. The vampire lord himself appears flamboyant to the point of being comical, which clashes deeply with the dark and menacing nature of the character. The worlds are large and varied and some of the particle effects -- as when Kain drinks blood or sifts through mist -- are well done, which is pleasing, but again at the cost of pure detail. Nosgoth, with its blocky structures and stiffly animated citizens, looks like a city born in a first-generation 3DFX powered PC game and not something befitting of GameCube's hardware. The port to Nintendo's next-generation console has at least provided Blood Omen 2 one major visual improvement in a fluidity that now hardly ever stutters from 60 frames per second, a vast difference from the choppy PS2 version. Sadly, the game does not run in progressive scan mode.  Sound The audio portion of Blood Omen 2 is a little over the top, but solid all the same. The voice work in the Kain franchise has always been one of its strong points and Crystal Dynamics has used talented actors to play the parts of Kain, his vampire cohorts and his human enemies. As a result, dialogue flows more realistically, which adds a notable sense of mood and realism to cut-scenes that guide the story along. Some of the music fails to live up to the speech, but for the most part we've no complaints. The original Blood Omen remains one of my favorite PlayStation games so I was naturally excited by the prospects of a true sequel. Kain's latest adventure doesn't exactly live up to the first in my opinion, but there are some reasons to be excited. Followers of the series will no doubt enjoy taking control of the vampire lord once more and inflicting all sorts of pain on the guilty and innocent alike without preference or care. The anti-hero makes the jump to third-person adventure complete with a handful of basic moves and some compelling special gifts, all of them satisfying to learn and execute. But at the end of the day the adventure here feels more cookie-cutter than most, seeming to follow a basic outline for how these types of games generally play and failing to deliver anything new, fresh or exciting. Kain has arrived on a next-generation console, that's true. But this doesn't feel like a true next-generation game. If you can live with that, the dark nature and gritty storyline of the title may outweigh its drawbacks. But there are far better adventure titles for GameCube and at least one with a more compelling theme and storyline to boot in Eternal Darkness. Worth a rental at the very least, but not a classic.", "date": "Jan 14, 2003"}