{"name": "Bionicle: Matoran Adventures", "name_review": "Bionicle: Matoran Adventures", "ref": "https://www.ign.com/articles/2003/01/15/bionicle-matoran-adventures-2", "text": "I haven't been this confused about what a game was going for since my parents bought me Milon's Secret Castle for the NES when I was eight. Bionicle: Matoran Adventures puts you in the oversized shoes of Kongu, a Matoran bird-rangler from Le-Koro of Mata-Nui and captain of the Le-Koro Kahu-force. If it sounds like I'm quoting Dr. Seuss, you should know that Lego's Bionicle series is made of deep, fan-adored worlds that make Star Trek look like Sesame Street.  Features  6 worlds and 3 boss areas  Switch between two characters  Battery save  Only for Game Boy Advance  I've always liked the concept of Bionicle, even if I've never gotten into it personally. It's Lego's attempt to veer away from their happy-faced yellow block people and create a more serious, dramatic and dark world of tribal cultures battling one another. And the toys kick ass.   What's not so impressive, however, is this game. EA's Bionicle: Matoran Adventures is a less-than-average platformer that plays with glitchy speed and while the story remains faithful, the game doesn't do its license justice. You begin with Kongu, a Le-Koro native who looks like a turtle wearing a hockey mask. He defeats enemies with a Tron-like disc on his back, jumps and...well that's about all he does. Your first task is to find your Turagan companion, who is basically a similar but taller creature who can't jump as high (he lacks Kongu's Metroid-like double-jump) but can bust down walls and stand on switches. Though incredibly basic, the idea of each character having specific abilities necessary to move on is here.   But aside from platform-jumping and unlocking passageways, there isn't much to this game. The backgrounds are boring and drab, and while character animation is unusually good, the actual sprites look more like Clay Fighters than their Lego counterparts. Gone are the edgy, plastic bodies of these warriors that adorn even the game's box, replaced with undetailed, doughy and poorly-colored bodies. The game lacks the cool, iconic look the toys have. In fact, your character looks more like an eight-year-old kid dressed up like a Bionicle for Halloween than Kongu himself. And while music works well enough (though nothing really stands out), the sound effects are overpowering, with the same mechanic zip sound every time you jump or even sit still. More subtle sound effects would have done wonders for the game, as even the enemies chunk along noisily in this respect.   The game also lacks any cohesiveness; you never feel like you're in the game world, rather just moving around a sprite over a jungle/desert/whatever background. The developers had a golden opportunity with the lush Bionicle worlds to have the creatures fit better into their surroundings. Instead, the enemies look bad and just run around clumsily. As I said before, the animation on Kongu (even while his body looks too mushy) is smooth to the point where I wonder if they rendered the artwork. But the animation moves much too fast, so it looks like Kongu is dancing like Kevin Bacon in Footloose when he's really just walking forward. The rest of the game also plays very jittery; for example, when you jump, the whole screen moves, and not just a little bit but wildly around so that (coupled with the size of your character) it's very hard to tell where you're going. You'll also be asked to take many leaps of faith to platforms that are off-screen, so get ready to fall into pits. A lot.   Basically each level is a different natural setting, where you find a new Bionicle companion, hit a few switches, hop a few platforms and you're done. It's not the shortest game I've ever played (I once beat an Elmo GBC game in eight minutes) but it's up there. Each level really varies only in its background image. The bosses aren't amazing but they're pretty fun to battle, and each has more than one attack so there's some variety there. There's even a little bit of GBA effects like sprite scaling, but it's far from enough to give the game an eye-candy factor.  What else can I say, the game just doesn't deliver. A lot of times you'll see games with bits of inspiration bogged down by a few faulty issues, but there's nothing about this game that stands out. If your kid has an Everquest-like obsession for the Bionicle series, that might be enough to make this game enjoyable for him or her. But for everyone else this platformer will seem bland and poorly-executed.", "date": "Jan 15, 2003"}