{"name": "The Lord of the Rings: The Two Towers", "name_review": "Lord of the Rings: The Two Towers", "ref": "https://www.ign.com/articles/2003/01/22/lord-of-the-rings-the-two-towers-6", "text": "Although the videogame industry is still in its youth, there is an old adage that goes something like this: ~Movie-games suck.~ It's not a pretty saying, nor does it make sense for the publisher or the buyer for movie-based games to stink. Instead, movie-based game should be great. But we can't count the times we have slogged through endless hours of games designed inside the marketing box, controlled by the movie studio's notion of a game, and restricted for numerous other license-based reasons.    For the largest independent videogame publisher in the world -- layered with management levels and executives trying to add in Matrix-like spin scenes -- a game based on the J.R.R. Tolkien movie license of  Lord of the Rings: The Two Towers is theoretically the perfect target for this failing formula. But EA has skillfully evaded the movie-license trap, side-stepping around the usual problems and tearing into a new formula, which is using a movie license to make an excellent game.   The Facts  Three playable characters:  Aragorn, Legolas and Gimli  Third person action-adventure gameplay with an emphasis on tactical sword fighting  Hundreds of unique combat animations  Battle five boss monsters from the first two movies  Thirteen levels consisting of  memorable movie moments from the first two films  Face the evil forces of Sauron in over 10 environments from the movies, including the Mines of Moria and the walls of Helm's Deep  Musical score taken from Academy Award-winning The Fellowship of the Ring  Solid 3D engine enables tens of polygonal characters to be on-screen at once with no slow-down  Advanced particle effects engine  Real-time graphic effects, lighting, reflections and transparencies, among others  For one player only  Presentation  EA's game Lord of the Rings: The Two Towers is based on the movie, which is different than the Universal Interactive game, based on the J.R.R. Tolkien's literary works. That one is an action-adventure game, while EA, partnering with Stormfront Studios, has assuredly created a visceral, high-action beat-'em-up that hugs closely to the concept of Golden Axe, yet layers the game with options, rewards, multiple playable characters, and a progressive combat system. But it's clearly still a heavy hack-and-slash-a-thon if ever there was one.   Not to take away anything from EA or Stormfront, but in many ways EA has take its production cue from New Line Cinema. It's risen to the same quality level, set forth by Director Peter Jackson and crew, and in doing so has created a cleanly designed game, a beautifully dark and accurate game steeped in Middle-earth foliage, and one that's heavily invested in the movie's resources, integrating movie and gameplay like few games have done before.    The best example is in the telling of the story. Before each level gamers see movie footage from LOTR: Fellowship of the Ring and LOTR: The Two Towers, which the developers then perfectly modeled and choreographed into in-game cutscenes. Instead of changing from FMV to in-game models at the normal juncture, the FMV clips merge into the in-game scenes before the game starts, sustaining the level of disbelief, carefully fooling you into believing you're playing the movie. The effect works brilliantly.    As for the game style, it's clearly distinctive from Universal's title. The whole game is a shrine of movie images, movies, art and interviews, taken from both Fellowship of the Ring and The Two Towers, offering these very assets as rewards for beating various stages of the game. It's wealthy with unique assets, even if the interviews range drastically in quality. For instance, Elijah Wood is a great interview because he is young enough to know games, while Ian McKellan and Viggo Mortenson clearly know little to nothing about them, and oddly they can barely act their way out of the interviews!    Just wait until that nasty Cave Troll crashes your Moria party. Still, the game's core front-end accurately reflects the movie's dark tones, grim characters and grave themes throughout its 12-plus levels with excellent scenery, movie stills and actor shots. Several scenes from the The Two Towers appear as a nice bonus, since the movie isn't even out yet. Although if you have seen the Fellowship of the Ring, the movie scenes corralled for this game are heavily, sometimes bluntly and wincingly cut. They leave you hanging, knowing what could or should have been kept it.      Gameplay  The Two Towers is a beat-'em-up to the bone, but that doesn't mean it's dumb, shallow or easy. It means you are fighting all the time, constantly honing your combat skills. What makes this game interesting, far more interesting than other beat-'em-ups is that there is strategy, management and strong reward-incentives behind the action.    Much like Devil May Cry on the PS2, you earn grades -- fair, good, excellent, and perfect -- for your performance. These grades, or style points, are based on the variety of combos you use and the brevity of hits you incur. Use lots of combos and ward off enemies by parrying or dodging, and you earn high points. Perform the same move repeatedly, use single-hit attacks, and take lots of damage, and your result is less encouraging.    After each level, players can then buy new skills with their points. Some are permanent things, such as increased strength, speed or more powerful arrows, while the bulk of the items are attack moves, such as four-button combos, get-up attacks or rushes. Characters also progressively increase their character levels, like in an RPG. So, as new character levels are earned, new skills and attacks become available. The character's health and level are indicated on screen. What's great about this system is that players can progress through the game by leveling up each character one after the other, instead of linearly progressing to the end, and then starting over with each character. (Though the best way is to fight all the way through with one character, then go back and finish it with the two others.)   Designed with a linear map portraying level progression, The Two Towers shows the level you have played, with which character, and what grade you have attained. The mission tree also then offers various branches, shown as arches off from the main trunk that indicate what bonuses and rewards you have opened up. Once players finish the game (by beating the 12 core missions) with all three characters, a secret character opens up, and a 13th secret level also opens up. (But naturally, we won't tell you, cause it's a spoiler.) And in addition to the 12 basic missions, there are at least more secret missions -- one for each character -- including a hell-pit found in the Tower of Orthanc.    The moves are basic. Each character can strike with a quick attack (A), a shove (X), and a fierce attack (Y). B is block, and using L and A you can use projectiles; there are arrows for Legolas and Aragorn and throwing axes with Gimli. You can hop back using a shoulder button, too. And if you forget the moves, the weird but working menu system takes you away from the game, brings up the upgrade menu to see them, then, loads the game, where you were playing up again. During the 12 missions, various non-player characters come into play as well. Boromir, Gandalf and various other fighters accompany you throughout the game, and one of the three main characters is always around. For instance, in one level, Gandalf helps you clear out a village with his staff strikes, while in another, a guard accompanies you through a dynamite-heavy section. The NPCs won't defeat a level for you, but they might assist in killing off a few orcs.    Using the rapid-fire bow can be even more fun than the sword! As for the story, the game starts up with a foot in the past. Players see a condensed summary of the One Ring's history, as is expected to be told in all the Lord of the Rings movies. The default training level pits Isildor in a fight at the foot of Mount Doom, and weaves in excellent movie footage to tell the story after your fight is done. After the first two levels (the second level pits Aragorn against the Ring Wraiths on Weathertop), The Two Towers opens up for players so that three characters are available, Gimli the dwarf warrior, Aragorn the human ranger, and Legolas the Elven archer. The game then bridges the gap from the movie Fellowship of the Ring and moves into The Two Towers.      The mission design is straightforward. Most missions are linear paths through a forest, village or mine, while others are based on an arena-like structure. Several bosses appear, including a Cave Troll in the Mines of Moria, the Watcher in Gates of Moria, the Uruk-hai leader, a pair of Mountain Trolls, and many more, including some surprises. The boss fights are based on patterns, though they become progressively harder. In fact, the game starts out quite easy through level four or five, with a few hang-ups here and there, and then around level six, Fangorn Forest, its grows increasingly difficult. Never too difficult, but enough so that you'll end up spending about six-eight hours the first time through. Of course, it may take longer in hard mode (there is easy, medium and hard). Once I knew every level, it was easy going right back in with level-7 Aragorn and busting though the levels with the other characters, opening everything else up.   There are few problems with The Two Towers, though technically it's quite fit and polished. The only problems occur in a few sections with the camera and one specialized Uruk-hai fight. In the Helm's Deep: Breached Wall level, it's a gradual uphill slope. The camera is a third-person perspective angle that shows a moderate amount of action simultaneously, but given the combination of the two, it's difficult to see up the slope when it's crucial to do so. Among other enemy attacks, a giant Troll comes rambling after you and that complicates matters even more, since he takes up so much of the screen. The camera should pull back ever so slightly to provide gamers with at least some inkling of the screen in this particular level, since so many waves of orcs, goblins, Uruk-hai and trolls come down at you.    Other than that the biggest problem with The Two Towers is, despite its replay strengths, brevity. It's over too fast, there aren't enough levels, and this game just begs to be played with at least one other person -- especially in what would have been an excellent co-op mode. That and well, it would be nice to play as another character or two, and the move list could be bigger. But, to its credit, the moves are easy to pull off, and the archery system is better than most.    Graphics  The most telling and perhaps the most deceiving visual element of this game is watching the movie footage transform into the in-game footage on screen. Everything becomes more simplistic, less detailed, and almost kiddified. Of course, as videogames go, The Two Towers is intense, highly detailed, and packed with excellent character models. But if you're just a regular joe, it might seem otherwise.    Still, considering all of the action going on, there is a lot to like. The character models are exceptional, from the lowly goblins and suicide orcs to the high level Uruk-hai, Cave Trolls, The Watcher, and all of the Fellowship members. It is amazing and ironic, however, that in this game Gimli's face is horrible looking, while in Universal's The Fellowship of the Ring game, Gimli is the best looking and sounding character. Also, the textures are of good quality, and each of the various characters shows off excellent layers of clothing, armor, helmet styles, etc.    The game features excellent, smooth and nearly perfect animations, too. The characters move fluidly through their attack animations, and each combination attack is superbly linked and interpolated. The backgrounds show off great but limited details, since most of the missions are designed in linear fashion. So, as far as you can see, the game looks good, but it's usually closed off, keeping you from seeing great distances.    But Tolkien fans will like what they see. In Fangorn Forest, players might see a Tree-Ent or they're sure to enjoy the character design of the Watcher. And in an amazing feat of technical wizardry, the final level, Helm's Deep: Hornburg Courtyard, shows off a stunning quantity of enemies simultaneously, without a hitch in the 30-plus framerate. That level is truly astounding in that regard.   Landscapes and environments are recreated perfectly. Fans of Middle Earth will be extremely pleased to know that the GameCube version of The Two Towers is every bit as beautiful as the previously released PS2 and Xbox versions.  It particularly shines in comparison to the PS2 version; the textures are much more clean, the rough edges are all smoothed out, and the particle lighting effects are even slightly more radiant than before.  In this vein, the real-time gameplay visuals are nearly as brilliant as the slightly superior Xbox version.   But it must be said that where the Cube version falls short is its standard Achilles heel: FMV compression.  As mentioned, The Two Towers is loaded with tons of great FMV footage, and the smaller Cube discs translate to slightly more compressed full-screen video cutscenes.  You'll notice slight compression artifacts, but if you've been a Cube fan for any amount of time, then you're certainly used to this side effect at this point.  And to its credit, EA actually pulled it off much better than other development studios, as the FMV is still quite enjoyable to watch.   Sound  Using the score from the two movies, The Two Towers videogame provides an ominous and impressive soundtrack that is naturally perfectly fit for this game. The arching orchestral themes are dark, heavy and compelling, thanks to the superb movie-quality sound, which is re-created  the mono, stereo, or Surround sound options.    Narrative and voice acting from the movie are used in the game, and many hours of original voice acting are taken from the lead actors, Elijah Wood, Ian McKellan, Viggo Mortenson, and Orlando Bloom and a few others. The authentic quality of their voices lends the game a genuine and authoritative feel and sound. The actors that voiced the orcs, goblins, trolls, and other creatures provided great sound effects too. We loved the raw emotive sound of the trolls and especially the Uruk-hai leader in the Amon Hen.   Again, all of this crisp, excellent in-game audio can be contrasted to the slightly more compressed audio found in the game's many FMV sequences.  Some scenes feature more noticeable background fuzz and whine than others, but it's slightly more than what you'll find in either the PS2 or Xbox renditions.  It's there, but it's not nearly bad enough to ruin the experience for you, and we applaud EA for packing so much FMV into this game and keeping it on the Cube version.The Two Towers is good, twitchy action-fun. Based on the movie, this fast-action style beat-'em-up is well adorned with great supporting elements from quality sound, graphics and other movie-related resources. There is no doubt that EA has beat the bad movie-to-game formula, integrating a wealth of movie assets into a game that neither looks nor feels like it's been hampered by movie license red tape. In fact, it looks like the opposite. EA has stuffed this game with an enormous level of excellent stuff from both movies, resulting in a real treat of a game, especially for Tolkien fans. That in itself is a great thing.As a game on its own merits, The Two Towers is a solid beat-em-up that's definitely worth owning. It's not the longest game, it begs to be a multiplayer game (particularly a two-player co-op game), and it could use more moves, more adventure aspects (though, I guess it's not really an adventure game, so that's not entirely fair), and more levels. But, it's still a thrill to play as Gimli, Aragorn and Legolas.It's different enough from Universal's title, which is an action-adventure title based on Tolkien's literary works, for gamers to warrant a look at both. But if this game's score indicates anything to you, you'll know which one to pick.", "date": "Jan 22, 2003"}