{"name": "Kobe Bryant in NBA Courtside", "name_review": "Kobe Bryant in NBA Courtside", "ref": "https://www.ign.com/articles/1998/04/28/kobe-bryant-in-nba-courtside", "text": "First came Midway's NBA Hangtime, a basketball game that looked and played more like an arcade game than it did a sport simulation. Then came Konami's NBA In The Zone '98, a blurry offering with limited options and sluggish control. And now, nearly two years after Nintendo 64's release, the big 'N' enters the sports arena with its own basketball game.  Enter Kobe Bryant in NBA Courtside  Developed by California-based Left Field Productions, Courtside marks the beginning of Nintendo's sports division, which will soon be expanded upon with Angel Studios' Ken Griffey Baseball. Nintendo recently acquired the endorsement of Los Angeles Lakers star guard Kobe Bryant, hence the game's name change from NBA Courtside to Kobe Bryant in NBA Courtside. What would a sports game be nowadays without a celebrity endorsement?  The Facts  Full official NBA licensing, including all 29 NBA teams(with up-to-date players, rosters and stats) Play-by-play calls by Seattle Sonics announcer Vic Orlando Four-player simultaneous play Medium-res mode (512x240) Create-a-player option Multiple camera angles and instant replay Rumble Pak and memory pak support   Gameplay Courtside plays moderately fast, has a number of signature and special moves and a finely tuned combo-system. Players can, for example, spin, dribble under the leg and then shoot with a relatively simple combo. Likewise, players can call picks, alley-oops or change positions on the fly. Controls are intuitive (B for shooting, A for passing, L/R and camera buttons for positioning and specials), and logical. All of this comes together for the best basketball gaming experience yet seen on Nintendo 64.   However, it's still not perfect. The biggest problem lies in Courtside's decidedly dull gameplay. We just don't get a feeling of fast-paced basketball competition with the title. Though framerates are wonderful, everything moves at a slower pace, especially when compared to Konami's In The Zone '98 for PlayStation (not to be confused with the Nintendo 64 version). Are we being overly critical? Maybe a little. Certainly this is the best basketball game Nintendo 64 has seen, and its gameplay doesn't just outshine, but totally obliterates the likes the current competition for the system.  Graphics No comparison, this is the best looking hoops game on the console. Running in an impressive medium-res mode (512x240), framerates never suffer so much as a hitch. Additionally, real faces of NBA athletes have been texture-mapped onto players, reflections actually look good (for a change) and animation is smooth. However, a lower polygon count is visible, though subtle, with players sporting square-like heads upon close examination. Worse, players move as if they're suffering from horrible constipation, with stiff, robotic bodies that don't flex or bend. Seriously, we never knew professional basketball athletes have such amazing posture. All things considered though, the ups definitely outweigh the downs in the graphics department and overall Left Field has done an amazing job.  Sound Top-notch music and sound effects compliment the game. A plethora of ~rappy~ beats, scratches and grooves add a touch of mood to the title. Crowds cheer realistically and dynamically, play-by-play calls by Vic Orlando are crisp, clear and realistic, though a bit on the unexcited side, and the in-game music works much to the title's benefit. Technically, this is an excellent example of what can be achieved on the cartridge format.  Rest assured, Kobe Bryant in NBA Courtside is the best basketball title available for Nintendo 64. Tight controls and a tweaked gameplay engine deliver the basketball simulation that Nintendo 64 owners have been asking for, but haven't gotten. Crisp, medium-res graphics and wonderful sound only make the game that much better. However, Stiff animation, a sometimes slow-pace and lack of style/character keep the title from a higher score in the end. Maybe for the sequel. Still, basketball fans will love it and we do recommend everyone give it a try.", "date": "Apr 28, 1998"}