{"name": "Best of Tests DS", "name_review": "Best of Tests DS Review", "ref": "https://www.ign.com/articles/2008/03/17/best-of-tests-ds-review", "text": "What genius decided to make a DS game based on standardized testing? Who was it at Neko Entertainment that pitched Best of Tests DS as a legitimate title? This isn't a brain game, folks. There is no game here. This is a neutered IQ test that doesn't even tell you your IQ. Maybe the developers should have taken an IQ test before they decided to make one.   There are two elements to Tests: intelligence and memory. Both sections have a series of tests that are supposed to measure your abilities and help you improve them. They do neither.   The game tracks nothing besides your cumulative score, but the score is never given a meaning. My Global Score is 107. Is that good? The game's case and manual keep mentioning Intelligence Quotient, but an actual IQ score never comes in to play.   It's a completely noncommittal game. Best of Tests refuses to tell us if we're doing well or not.  There is no progress tracking, or high scores list. There is nothing to show that you're improving besides just moving on to the next test. There isn't even a way to improve since the game does not tell you what the correct answer is on a missed question. Say you're really bad at letter sequence puzzles. Every time you get those questions wrong, mad scientist guy will just give you a disapproving look and move on, even in training mode!   Think hard. The training mode is just a test with only one type of question. There is no results summary at the end. You can't select the difficulty. It never attempts to teach you anything, at all.   Best of Tests assumes that you're either really young, or a total idiot, and forces you to start the game on easy. We had to play through the entire easy mode just to get to normal, only to find out that it's still absurdly simple.    Here's an example of an actual test question: ~Complete the Number Sequence: 16, 15, 14, 13, ...~    Really?   Really?   We've got no problem with simple questions, but please, give us the benefit of the doubt that we know that ~day~ is the opposite of ~night~ without making us endure a series of tedious tests.   During the entire tribulation our ears were assaulted by gritty elevator music. It's fitting because the last time we hated life this much was when we were stuck in an elevator for hours. In fact, if we had to choose between that and playing this game again, we'd take the elevator tomb.There are countless websites that offer IQ tests that actually give you a score to brag about, and most of them are free! Or, for 20 bucks, you can buy Best of Tests DS, and sit through a questionnaire with all the difficulty of a Preschool Entrance Exam. If you're afraid you might be a complete moron, feel free to pick it up, since the game will never tell you how stupid you are, or anything else for that matter.", "date": "Mar 17, 2008"}