{"name": "Black & Bruised", "name_review": "Black & Bruised", "ref": "https://www.ign.com/articles/2003/01/30/black-bruised-3", "text": "For the first time on PlayStation 2, a developer has gone full-steam ahead to create a cartoon-style arcade-inspired boxing game. The boxing genre is packed with hybrid titles that mix arcade and sim aspects and there are certainly a few realistic sims out there too. But no one has gone for the old-style Super Punch-Out style of wacky, nonsensical, entirely implausible boxing that created so many fans back on the old Super Nintendo.    Canadian developer Digital Fiction, however, yearns for those old days. In its heart of hearts, we believe the team wanted to create a game in that same mold, delivering kooky characters and silly scenarios and making games fun in the old sense of the word. While Black & Bruised is no Super Punch-Out, it's the closest any game has come to emulating it in some time. And in a casual sense, Black and Bruised is a fun party game that casual gamers and first-time players will enjoy. Simulation and diehard boxing fans? Well, this game is not for you. No, not at all.   Presentation  From the beginning, Majesco knew that Black & Bruised would be stylish at its core.  It's been said time and again that the cel-shaded look and overabundance of personality found in B&B was influenced from the classic Nintendo Punch-Out! franchise of years past.  And to a large degree, Digital Fiction succeeded in infusing the title with exactly that: personality, flair and top-notch presentation.   It's not hard to visualize the concept art that must have been adoringly sketched and later rubber-stamped by the production team in designing the game. Each character practically leaps from the canvas and comes to life with distinctive names, personalities, costumes, fighting styles, background music and voiceovers.  Take, for instance, our man known as ~El Luchador.~  This masked Spanish fly appears to be the lovechild of a tiger and a melon.  With his lime green pointy stripes, he taunts his opponents via witty quips of burritos and ass-whippings.  Or you've got ~Micky McFist,~ the scrappy Irish brawler with the cloverleaf tattoo on his chest -- something of an orange-haired version of Brad Pitt from Snatch.  Others such as ~Jumping Janet~ or ~Tiny,~ the obviously largest boxer in the game, leave more to be desired.  Still, it's a motley crew that players should have no problems finding a favorite fighter among for whooping the tar out of the rest.    As the rest of the package goes, the menus are all clean, bright and full of life and sound.  Digital Fiction even added a few subtle touches that most wouldn't notice; for instance, every time you select a player, his or her facial expression randomly changes.  Perhaps one of the best presentation touches is the good use of voiceovers in the menus, cutscenes, and even the practice tutorial.  It's nothing big, sure, but such little touches go a long way to keeping things subliminally stimulating, and such little touches work nicely here in Black & Bruised.   Gameplay  As we've experienced in the past with this title, slipping on the gloves and tossing around our cel-shaded dukes in Black & Bruised is a bout of mixed results.  The action is fast, the variety of punches and animations are all well done, and the fundamental arcade boxing engine itself does indeed come close to the excellence achieved by even Punch-Out! so many years before.    Basic moves still function much the same as we've experienced in the past. The button configuration is still fairly similar, with any of the face buttons hucking your left and right punches respectively.  The R1 button can be used as an uppercut modifier, and L1 will put up your defenses. One thing that we're thrilled to see is the new combo system that's been seriously tweaked since our last go around in July of 2002.  Instead of simply mashing two buttons simultaneously, a string of buttons must now be entered in succession.  For example, a double right hook, left jab, and right uppercut chain combo can be done with a series of the face buttons plus modifiers.  These combos do require some practice and memorization, as they're intuitive and similar to many other fighting games.  Thankfully, the combo practice mode is well done and should have you tossing flurries of fists in a wildly exaggerated manner in no time.   As for how effective these combos are, we've come to the conclusion that is, well, debatable. The GameCube guys didn't feel it worked very well. I (Douglass C. Perry) feel differently. Most characters are so agile and quick that you'll instantly feel an urgency to land more punches than your opponent and faster. This leads to the strong tendency to wildly mash buttons, and to a degree that's even a decent strategy, but not in the long run. A good knowledge of the combos is your best bet against a true contender.    Typical strategies involve blocking an oncoming flurry and then retaliating with a flurry of your own, much like in Super Punch-Out. Using the power-ups at the right time and with the right strength (there are three levels for each one) is the smartest way to defeat your opponent. Though these powerups are rthe key to winning, often times the player with the quickest thumb wins out in the end.    In keeping with this frenetic arcade/cartoon angle, Digital Fiction included another key gameplay element to help spruce up the gameplay: the power meter.  As players pummel their opponents, a meter of stars builds for every successful punch. Once it's complete, you can click a button to snag the randomized power-up item floating in the lower-center of the screen.  These items range from simple damage power-ups to speed boosts, extra health, to some seriously goofy items, all of which hurt your foes as you build health.    Players can also choose to keep building their meter three times over for an even more powerful item.  These items add a definite Mario Kart feel to the game, which is a good concept, and as you progress, you'll see the moderate depth of the strategies manifest. The powerups are at the heart of the game and function to make this a good party title for casual gamers and first-timers. You'll learn that there is indeed skill required in becoming a Black and Bruised contenda, and there is no doubt a decent of amount of deep insider this kooky game.   Thus, the action is frantic to be sure, but Black and Bruised isn't a terribly deep game. In fact, it's not a truly dedicated boxing game. It feels more like a fighting game than a boxing game. Perhaps this is because it's more of an arcade brawler or because of the way Digital Fiction desifgned it, but one never gets that feeling that you're really boxing. You rarely shuck and jive, read your opponent, and land precision blows. It's not a bad game by any means, but if you want to box, this won't satisfy you at all.    The chain combos and power-ups add a lot to the overall arcade experience, giving this game a unique boxing style all its own. It's not realistic in any way, but it's not supposed to be. Black and Bruised is designed to fight somewhat like Super Punch-Out, and in a sense it does capture that fun, cartoon-style of boxing. On the other hand, it's not as good as Super Punch-Out by any means, nor does it follow the pure and somewhat simplistic pattern-based fighting found in that old classic. But overall, after about only a few hours playing this game, we grew tired of its relatively shallow gameplay and simplistic style.    See, Digital Fiction has gone to great lengths at add plenty of extra goodies.  For starters, the inclusion of the neat ~Boxer's Life~ mode is a wonderful thing.  Players can select any of the 19 total fighters and venture through a story mode of sorts.  Before each round, an FMV story unfolds that depicts a scenario for the fight.  Players must fight through each match in goofy ways or complete various objectives to proceed.  There are at least six different battles for each character to complete, thus close to 100 specially crafted rounds, complete with FMV story intros and objectives.  This mode should please fans of the game considerably, presuming that one enjoys the boxing action enough to fight through them all. If it weren't for the breadth of the modes and its delightful characters, we'd have put it down even earlier.   Graphics  To some degree, there's a tiny bit of a graphics sap lurking within us all.  We see something pretty and our eyes light up with wonder.  Black & Bruised is one such visceral pleasure.  It's truly some of the most polished cel-shading we've seen on any console or PC title thus far.  The characters are all bright, clean, and truly look more flat and cartoony than even some of Miyamoto's recent real-time Link renderings.  The subtle shadows and hard edges all blend to create a pseudo-2D style that's refreshing like a good Saturday morning episode of G.I.Joe.    The animations are also very well done, with exaggerated punches connecting with cranked necks all throughout the matches.  B&B's engine is fairly robust as well, as the game never once skips below it's near 60 frames-per-second draw rate. The PS2 version doesn't zip along quite as fast as the GameCube version, with only a tab bit of reaction time lost. It's hardly noticeable unless you play both. Additionally, the few texture details to be found such as tattoos and facial damage are all vibrant and crisp.  For what it sets out to accomplish, there's very little to flaw the title visually in any department, except for perhaps the slight lack of details and activity lurking behind the various rings.   For those who enjoy the overly simplified fighting gameplay, they've got themselves a real treat to savor on the screen in the form of cel-shaded boxing beauty.    Sound  Easily the biggest bruise on the body of this contender, the audio suffers in every way but one: quantity.  The game definitely packs in tons of spoken lines from all of the different characters, and you'll hear something fresh in just about every gameplay mode you venture through.  If quantity were all that mattered, this game would fare well.  Sadly, quantity is just about all it has going for it.    Sure, the voice acting is good, but this is a boxing game at its core.  When you nail a sucker in the jaw with a sharp left hook, his crusty face had better explode with a resonating ~wallop~ that lets you know that you just connected and hard.  But there's none of that to be found in Black & Bruised.  Instead, you'll think you've spent an entire evening in the kitchen slapping cupboards shut for hours.  The sound effects are nothing like the meat-slapping sounds of agony that a boxing game typically prides itself upon, and as a result, the onscreen action becomes slightly less gratifying.  And let's not even get started on the music: horrible synthesizer demo tracks that loop every five seconds (literally) during the fights.  As Fran would say, ~Whoopsee-daisy!~    The audio flaws are hurtful, but they don't ruin the game. But most voices and even some effects will suffer from a touch of tinny fuzz lurking beneath on either console.  Do us a favor and keep the volume at safe levels on your home stereo so as not to send any nearby canine creatures into trauma. Closing Comments If we at IGN rated games on personality, presentation, and visuals alone, Majesco's Black & Bruised would come highly recommended. It's a real treat to watch the action dance around on-screen, almost like staring for hours at one of those stereograms at the local mall poster shop. As fighters trade blows and the camera rotates smoothly around the action, it's pretty amazing to see how detailed and truly cartoon-like the cel-shaded characters appear. But when you stop the drooling and start focusing on the gameplay the disc has to offer, suddenly the infatuation becomes nothing more than a superficial love affair.For fighting and boxing fans hoping for an artistic rendition of Rocky, it was not meant to be with Black and Bruised. The gameplay is strongly rooted in quick and shallow action, and won't hook you beyond the various story and tournament modes that were wisely included. Definitely give it a look if you're helplessly attracted to the style and personality the title spouts; perhaps for a great weekend rental. Purchase with caution, however, as there's little chance that you'll find yourself jumping back into the ring once your love affair ends.", "date": "Jan 30, 2003"}