{"name": "Breath of Fire III", "name_review": "Breath of Fire III", "ref": "https://www.ign.com/articles/1998/05/16/breath-of-fire-iii-2", "text": "Capcom's long-awaited third chapter in a long running series that originally began on the Super NES, Breath of Fire III continues the tale of the struggle between the Brood, a race of dragons, and their oppressors, the Guardians.  You'll assume the role of Ryu, the last surviving member of the Brood, as he ventures through childhood and eventually adulthood in search of his roots and unravels the mysteries of his world. Along the way, Ryu will join up with a motley cast of characters including a rebellious princess, a female engineer, a theiving tiger, as well as two others who will both greatly help and slightly hinder his journey to find the Goddess.  For an RPG, Breath of Fire presents nothing incredibly new, story-wise, but the way in which everything in the game is arranged and executed shows an incredible amount of attention to detail and depth.  Visually, Breath of Fire III resembles role playing titles of old with hand drawn characters and seemingly 2D graphics. But on closer look, you'll discover that the jump from the Super NES to the PlayStation have provided the game with highly animated characters who emit little battle cries during combat, a polygonal landscape wherein you must use the manual camera to peek around objects and walls to discover hidden objects and characters, and a massive world packed to the hilt with secrets, sub-games and painstaking detail. Activities such as the arcade fishing segments, the somewhat complex master/apprentice system, as well as Ryu's interesting ability to transform into a dragon during combat, gives typically tedious tasks like leveling up, wandering the map and random battles a more tolerable feel and gives the player the option to busy himself/herself with other things in the meanwhile.   Mazes and caves are intricately constructed, while towns are bustling with activity and characters. Dialogue, while not perfect, still provides a good chuckle from time to time, while giving the world of Breath of Fire III a very immersive feel and the characters a good amount of depth and personality.   Filled with quirkiness (i.e. an Aussie-speaking dolphin complete with an option for English translation?), the game certainly will not disappoint role-playing fans with the odd surprise every now and then. With a cast of memorable characters, Breath of Fire III manages to combine the best of old school, traditional RPGs and adds in just the right amount of 32-bit innovation in order to create a game that's not only challenging and massive, but immersive and endearing.  Francesca ReyesI would like to make it clear: I really, really hate random battles. Yes,  I realize that it's an important part of the Japanese RPG design and it's grown to be accepted among fans of the genre...but it's a real drag walking barely two steps before a fight suddenly breaks out in the adventure. And in Breath of Fire, I've never played an RPG that had as many random battles as this one. I was thanking the game designers for offering the Mrbl3 item for cheap in the shops...when you activate this element, you're temporarily ~immune~ to random battles. Stock up on this whenever you see it in the shops. It'll save your insanity.As for the entire quest...it's not super pretty, but it's an enjoyable one with a simple storyline. Golden Sun it's not, but if you're nostalgic for the RPGs that folks were playing on the SNES, Breath of Fire is a decent diversion that'll last a good week of solid questing.", "date": "May 16, 1998"}