{"name": "Fisherman's Challenge", "name_review": "Fisherman's Challenge", "ref": "https://www.ign.com/articles/2003/02/03/fishermans-challenge", "text": "Water gently laps against the side of your boat. Lily pads lazily float off your port side. A light drizzle breaks the surface of the water while you reel in your grub lure. Calmly casting again, it's hard to believe you're in the midst of a summer tournament. Of course, it's hard to believe that you're sitting in your living room.   For those winter days, late evenings after work, and hectic weekends, or if you want to avoid fishing elbow, you're afraid of water, or you're opposed to ripping out huge chunks of a fishy's face, grab hold of Konami's latest fishing extravaganza, Fisherman's Challenge.    Gameplay  Besides the uncanny urge to fish day in and day out, what bait is powerful enough to lure you into yet another fishing game? Fisherman's Challenge does a couple things to fry the competition. Perhaps the most noticeable attribute is that you aren't tied to the coast. Fisherman's Challenge lets you explore the entire lake in your power boat-- allowing you to troll the depths of the lake or maneuver into the best angling position. The other unique feature (although it makes your fishing a little less authentic -- but they're digital fish after all) is the new fangled fish mood indicator.   This doesn't tell you when your water bound friends are having an episode of PMS or going through manic mood swings. Rather, a little window pops up in the bottom of your screen whenever fish are alerted to your presence because of your reckless motor-boating (which aids in spotting pockets of fish), or if fish are interested in your lures. This window acts as a ~fish-eye~ view of the bait. The larger your lure is in this window, the closer a prospective client is to nabbing it. If a fish's interest is wavering, this window lets you know it -- giving you the opportunity to pull out all your fishing tricks to get it to bite.     Along with the proximity to lure window, three status bars accompany the mood indicator. The relaxation meter tells you how cautious the fish are. The fuller the bar, the more relaxed and willing to bite are the fish. As you repeatedly fish in the same area or startle them with loud motoring, the bar slowly decreases and the fish will stop attacking the lure. In the same respect, activity and hunger meters also tell help you judge how delectable your scaly friends find your lure.   Angling is surprisingly intuitive -- you can figure out all your prime commands without instructions. Moving your boat around the lake is done with the left analog stick. When you find a good spot, hit X to move to the prow of your boat. Casting is also done with the X button. Once the lure is in the water, you can reel it in by rotating the right analog stick in a circle while jerking the line with the left. Setting a hook is also performed with the X button. It's simple. As you're fighting a fish, a tension and hook set meter pop up on the bottom of your screen. The higher the tension meter -- the more likely the line is to break. If the hook meter disappears, your fish will escape. To help you land the fish, arrow prompts will tell you which way you should tug the line to keep it from snapping. When you're finally ready to haul Mr. Fishy out of the water, another meter appears. You'll have to stop an indicator within the green portion of the bar to haul in your catch.    These tools will be put to good use in the main mode of Fisherman's Challenge. The real hook, as with most fishing games, is the tournament. Challenge lets you play through three skill classes (novice, semipro, and professional) through seasons composed of four tournaments. Depending on how high you place in each tourney, you'll be awarded points. You need to earn a set number of points to qualify for the final round in August -- which you need to win if you want to move into the next class. Each tournament consists of two, four hour (translation: 4 minute) excursions, giving you plenty of opportunity to snag big bass. The only problem is that you'll spend the entire novice season patrolling two wings of the same lake (things get a little too familiar). You won't see fresh water until you advance to the next class.   If you want a shorter competitive adventure, take a bite out of Fisherman's Variety mode. This is a variety of mini-game takes on the sport of fishing. Single player modes consist of Total Weight (get the highest total weight out of five bass), Increasing Weight (you have to catch fish that are heavier than the prior fishes), and Race (you compete for the fastest time in which you can catch a fish from three designated areas and sprint to the goal). If you'd prefer some live competition, you can also fish against a friend in Guardian Spirit (try to catch the Guardian Spirit fish before your opponent) and Battle mode (players can push a gauge towards their opponent by rapidly catching fish -- the winner is the one who pushes the meter all the way to the other end of the meter).   Tired of all this performance pressure? Challenge also has a Free Fishing mode that pits you mano o fisho. You get to pick the lake (options vary on how far you've progressed through the tournament mode), time of day, month, and the weather. Then, just fish to your heart's content.    So, you've caught all these fish -- what do you do with them? You can pick up to ten fish to house in your aquarium. Not only can you tour your best fish, but you'll be able to keep track of the time of day, month, weather, and the specific area of the lake you caught them from (letting you figure you out the best spots). If you're a collector, you can try to fill your aquarium with the seven different featured fish (four types of Black Bass, Bluegill, Rainbow Trout, and Catfish). You can also manage your lures by checking out your tackle box (you've got all the standard baits, poppers, cranks and jigs) and you can replace lost lures at the bait shop using cash you've earned from the tournament.   Graphics  Like most fishing games, Fisherman's Challenge doesn't win any beauty pageant awards. The game looks very arcadey. Character models look fairly realistic, as do the actual environments. However, once you go underwater, things start look very flat. Underwater weeds are two dimensional and the textures you find on tires and cinder blocks are basic. The fish themselves look good, but they lack any individuality. The graphics work, and are definitely better than any other PS2 fishing game, but you won't see rain ringlets on the water's surface or lifelike water and sand.    Challenge does run smoothly -- although there isn't a whole lot that's going on to make it stutter. You do, however, have to sit through twenty second load times -- which on their own aren't too bad, but they occur whenever you switch between menus. If you accidentally go to your tackle box, you'll have to wait for the tackle box to load, exit, and then wait while the main menu loads.   Sound  Fisherman's assortment of sound effects and music is also generic. Sure, you'll hear the zipping of lines, the roar of your motor, the plunk of the lure, the popping, clanking, or sputter of reeling in a lure, the thrashing of a fish out of water, and, of course, each anglers catchy phrase -- such as ~Look at what I caught!~ or ~What a fine fish!~ Other than these typical sound effects, Challenge is eerily quiet while you're fishing.    When you're looking for that perfect sweet spot (i.e. navigating in your boat), blaring, cheesy electronica arcade music will startle you more than the fish. The music stops once you switch to fishing and is replaced by the sparse sound effects. Fisherman's in-game sound is sub par and varies between the two extremes of too loud and obnoxious and no sound at all.Fisherman's Challenge is your standard fishing game. It doesn't offer any gameplay modes that you can't get elsewhere, but the ability to explore the lake's entirety and the fish mood indicator distinguishes Konami's fisher from others on the PS2. Controls are intuitive and easy for novices to grasp (although you'll definitely want to play with a rod instead of the dual shock, since spinning the right analog stick gets tiresome and annoying). Likewise, the tournament difficulty is pitched so that novices won't get frustrated, but there is plenty of challenge for top anglers. While graphics and sound hit Fisherman's Challenge hard, compared it still stands out from the competition. It leans more towards realism than the arcade look of most fishing games. If you can't live without fishing, Fisherman's Challenge is worth your time.", "date": "Feb 3, 2003"}