{"name": "Bio FREAKS", "name_review": "Bio F.R.E.A.K.S.", "ref": "https://www.ign.com/articles/1998/05/21/bio-freaks-3", "text": "Biological Flying Robotic Enhanced Armored Killing Synthoids, abbreviated as Bio Freaks, is the latest 3D fighter from Midway Home Entertainment, the company behind the Mortal Kombat franchise. Like MK, Bio Freaks is an extremely violent, excessively bloody, fast-moving fighter with a variety of sadistic, charismatic fighters to choose from. But Bio Freaks also attempts to go one step beyond the MK series with a fighting engine that not only enables full 3D fighting, but up/down hover battles and interactive environments as well.   The History Bio Freaks was originally developed as an arcade title (headed by Midway's Dave Simon), but Midway opted to release the game for home-consoles instead. At the time, MK4 had just entered the arcade arena and we can only speculate that Midway didn't want to take away from the game's spotlight with a simultaneous release of Bio Freaks. And so developer Saffire (Rampage: World Tour) picked up where Simon and team left off, porting the title to Nintendo 64.   The Story In the future, the Earth is but a mere shadow of what it once was. Giant corporations are at constant war with one-another over the planet's land. Of course, wars are no longer fought with armies or mass weapons of destruction, but by single battles between opposing, robotically enhanced synthoids. The fights are to the death and winners take all, including the losing corporation's territories. Hey, at least there's no evil Elder Gods who have escaped the Netherealm and must be dealt with.  Gameplay Bio Freaks, like Mortal Kombat before it, relies more heavily on speed and gore than it does a complex, finely tuned fighting/combo system. Tekken 3 and Virtua Fighter, Bio Freaks is not, but that's not necessarily a bad thing and here's why: the game doesn't try to be. Rather, long-range, projectile-equipped fights make up the game's majority. But that's not to say there isn't a wide selection of moves that can be performed, as each fighter can pull off more than 20 unique attacks, some more powerful (and gory) than others. Additionally, the battles in Bio Freaks are not limited to the ground. Players can hover into the air and continue a fight in mid-flight. There's even a first-person 3D view in single-player mode. The game's 3D engine enables characters to go just about anywhere, including background ledges and upper levels. Backgrounds are not just eye-candy either, they are interactive. In one level, players can fall into lava pits surrounding the arena, where they will promptly catch on fire and be thrown back into the fight with a loss of energy. In another level, players can actually fight underwater, and, if they're unlucky enough, drown -- if they aren't eaten alive by hungry piranha-like fish first.   However, while the fighting system works well and is responsive, it reeks of Midway's past efforts, both Mortal Kombat and War Gods. What we mean by this is that Bio Freaks controls exactly like a cross between the two games. Just like War Gods before it, executing attacks in Bio Freaks can sometimes be frustrating as some moves are difficult to master. In heated battle, it's not uncommon for players to resort to mindless button-mashing to win, which will often work. There is no block button. Instead, Midway has included a shield option, which must be performed as if it were a regular move to work. Additionally, Midway has assigned easy, but very damaging projectile attacks to one button. Fighters can spray dangerous gunfire across the battlefield at the touch of one button. What can happen -- and does happen with this is both players end up staying as far away from each other as possible and instead simply shoot damaging projectiles across an arena continuously until one fighter is dead. The fighting system, the way it works, encourages ~cheesy~ wins like this. Still, while the game's fighting engine certainly has a few problems its benefits, which lie in speed, interactivity and hover-battles, definitely outweigh its downfalls.  Graphics and Design A total of ten playable fighters (including two hidden) make up the sadistic bunch in Bio Freaks -- and we do mean sadistic. The grizzly crew from Mortal Kombat look like something out of a Disney movie in comparison. Using soft-skin texture mapping, the Midway/Saffire teams have managed to create the most realistic looking and animated fighters we've seen in a videogame to date without sparing any gory detail. Fighters smile, blink, hobble, jump, throw-up, drool -- all with no slow-down and all in real-time with no clipping whatsoever.  As far as actual design goes, well, here are a few examples of what to expect: meet Zipperhead, a psychotic, hunched monstrosity of a fighter who farts at his opponents as he slobbers rabidly. Though he doesn't seem to mind, he's got a hefty set of steel pipes stabbing through the skin of his back, through his body and out of his chest. Meet Purge, a swell fellow who sports giant scissors for hands, has a helicopter connected to his head for hovering and as if that weren't enough, his arms are equipped with flame-throwers. There are female fighters with busty bodies, a Duke-Nukem look-a-like, a few robotic hulks, a vomiting beast and the end boss is so big that players actually have to hover away from him.   Fatality? Not quite, but fighters can be chopped in half or decapitated, which ends in immediate death. On the other hand, players can pounce on an enemy, slice off a few limbs and retreat -- the fight will still go on. And worse, blood will continuously gush out of their wounds, making for an extremely gross (and entertaining) experience. Whereas fatalities are the end-result of a victorious battle, the gore in Bio Freaks can happen at any time in a match depending on strategy.Bio Freaks is quite possibly the best looking fighting game we've ever seen. Midway's Dave Simon and team should be commended for the game's excellent character designs and animation. However, gamers looking for a serious fighting engine should be aware that while Bio Freaks does deliver a balanced set of moves and options, the game has a long way to go before it can compete with the likes of serious fighters like Tekken and Virtua Fighter. If you enjoy the Mortal Kombat games, or if you're interested in mindless, bloody fun, then we don't see how you can go wrong with Bio Freaks. Serious fighting fans may want to rent before they buy though.", "date": "May 21, 1998"}