{"name": "Vexx", "name_review": "Vexx Review", "ref": "https://www.ign.com/articles/2003/02/10/vexx-review", "text": "The platform genre is dying.  At least, that's what everyone believes.  The truth is, the genre simply has grown stale over the past few years with cookie-cutter revisions of the same ol' junk.  But 2002 saw a change as many unique and fun platformers hit the three big consoles.  Though Vexx is coming a little late to the party, it's Acclaim's attempt to revitalize a once powerful genre.  While Vexx won't astound you with any groundbreaking new invention, it's still a platform-heavy game that will likely satisfy most platform fans. It doesn't reinvent the wheel, but it doesn't blow out the tire either.  Features Explore ten unique worlds filled with platforms galore Play as IGN Insider editor Fran Mirabella look-a-like, Vexx Jump, leap, swim, push, climb, shimmy, and bash your way through endless platform puzzles Over 15 hours of gameplay Progressive scan 480p support 5.1 Dolby Digital  Gameplay The title, Vexx, refers to an angry little runt out to avenge his grandfather's murder at the hands of Dark Yabu.  Along the path to revenge, Vexx must also manage to save his world from the evil clutches of said Dark Yabu.  Blessed with the power talons of the ancients, Vexx slashes, bashes, cuts, and blasts his enemies, which consist of a small assortment of unpleasant critters.  If the story sounds familiar, it's because it's essentially the same story found in the majority of platform and adventure games.  Little time was spent to create an original or progressive story.  Outside of the opening cut-scene and one or two other short scenes, which pop up more than halfway through the game, there's no story at all.  There's nothing to compelling in the story , and that's really the overall problem for Vexx -- there's just not enough to push you through the 20+ hours of gameplay time.    The overall structure of Vexx is surprisingly similar to GameCube's Mario Sunshine.  Instead of ~shines~ you grab shadowraith hearts.  Each level is massive and very open-ended and there are between eight to ten hearts to find in each of the ten worlds.  You can go about getting these hearts in any order you wish and new worlds become accessible after collecting a certain number of hearts.  You need sixty hearts to face the final boss, but completists can go after over two-dozen extra hearts just for the sake of fun.  As Vexx, your power talons allow you to jump high, slash enemies, uppercut launch them into the air, superleap, and unleash a powerful blast when airborne.  Juggling enemies, at first, seems the primary mission.  The more juggles you get on an enemy, the faster your talons power up.  When fully powered, you can unleash some talon rage.  Unfortunately, your rage isn't as cool as it sounds.  It merely provides a few momentary fireball blasts that wipe out enemies quickly.  A few hours into the game, it becomes clear that juggling enemies and filling up your frenzy meter are relatively unnecessary.  If only you received upgrades to your frenzy powers, but there are none to be found.  Vexx features a relatively small assortment of critters.  The first four worlds of the game see little change, with no new beasties added.  After that point, you do begin to see bigger, tougher, meaner creepies, but the overall creature design is a little weak.  There are way too many mushroom-looking dudes chasing after you and aliens with flaming heads looking to bump into you.  Why doesn't each creature match each unique world?  The creatures seem rather arbitrary, which isn't new to the platforming world, but it would be nice to see developers trying to push accepted standards.      The fighting in Vexx is really secondary to the platforming, however.  In fact, for the most part, you can run away from almost all the enemies and there are very few bosses.  Every trick in the platforming book has been tossed into the mix.  There are see-saw platforms, moving platforms, bottomless chasms, poles to shimmy, walls to climb, ceilings to take hand-over-hand, spinning platforms, shrinking platforms, invisible platforms, and just about anything else you've seen from the genre the past decade.  While there's nothing particularly new, it's all done incredibly well creating big worlds filled with endless tests of your jumping skills.  If you love platforming (no, I mean that seriously) then you'll be in heaven with Vexx.  Aside from tons of platforming tasks, the worlds of Vexx feature plenty of little puzzles to solve.  They range from the simplest of tasks (~Oh, I just go behind the waterfall, then?~) to more complex tests of wit (~wait, which way are the alien statues supposed to be pointing?~).  There are mini-games sprinkled in as well as more inventive puzzles, like raising a temple buried in the sand.  By far my favorite task, and easily the one of the most interesting puzzle in Vexx, is the tapestry crawl, which has you entering the 2D world of multiple tapestries, leaping from the heads of anonymous figures in the tapestry onto buildings and other pieces within the artwork.  Each successful task earns you another heart and gets you closer to your ultimate goal -- facing the Dark Yabu.  And the Dark Yabu is really the only true boss in the game.  There are a few tasks that have you facing mini-bosses, but their connection to the worlds they live in, or even the overall story of Vexx, are insignificant (and unknown).  They are cool little battles though.  Such as when you must match wits and weight with a bulbous sumo wrestler or when you have to avoid an ugly beast who rolls into a ball and chases you around a small arena.  If only these bosses had some connection, any connection, to the game outside of withholding a shadowraith heart, the battles might have been more interesting and intense.  As is, the mini-bosses become just another task to another heart.  I don't mind the critters, though I'd have liked a greater variety.  I dig the massive worlds and the platform elements are a joy, but my big gripe comes with the total failure to do anything interesting with the day-to-night feature in the game.  As you play, day shifts to night.  Some enemies change color and become a little tougher to kill.  A few of the worlds have portal areas that can only be accessed at a certain time of day.  However, playing the game, it seems like there's supposed to be more.  Why not have creatures transform into other things at night?  Why not have completely new paths emerge?  In the end, the day-to-night feature is more about a change in lighting than a change in gameplay, and that's a shame.    I like Vexx.  It's fun, it's challenging at times, and it's got an endless amount of platform elements.  But this is a game flawed by design.  Outside of the rock and air suits, which are useful in about 5% of the entire game, there are no power-ups whatsoever.  You don't learn new attacks and your current attacks never get more powerful.  There are no new skills to gain -- you have everything you need right from the get-go.  Vexx takes platform concepts from many games, but the one it left behind is the ability to improve your character.  Without this, there is no sense of growth or even progression in the game, making world #1 no different in feel from world #8.     Graphics Vexx does its best to dazzle you with pretty backdrops and dusk-to-dawn effects, but it's all just an attempt to divert your eyes from some ugly bumps in the visual road.  The vistas are attractive and the worlds have a life to them that is often lost in platformers these days.  Everything you see can be reached in each of the massive worlds.  But those big worlds come at a cost.  Yes, you can reach anything you can see, but you often will miss a lot of things until you get relatively close.  The draw distance is rather weak for an Xbox game, the penalty for developing to the lowest common console denominator.  Enemies, bridges, and even blades of grass pop up suddenly.  You can actually see the textures drawing themselves as you walk along.  And, unfortunately, the framerate problems seen in earlier versions of the game have not been completely wiped out.    Vexx must be allergic to transparency, because whenver that effect comes into play (too often to be disregarded) the game drops quite a few frames.  There are other sluggish moments as well, but the majority of gameplay is not hampered by slowdown, so it becomes more a cosmetic issue than one of gameplay.  And, well, cosmetically, Vexx isn't an eyesore but it's hardly pushing the Xbox's capabilities.  Vexx moves fine and the creatures on the various worlds look decent, though there are far too little variation and limited animations for the critters.  Overall, at a general glance, this ain't a bad looking game at all.  But it's the numerous small details that peck away at an otherwise decent-looking title.  Vexx does support 480p progressive scan to add a bit more clarity to the big worlds in the game.  Sound Vexx is a boy of few words.  And this is a game of few sounds.  The effects never seem to vary, with the different Vexx attacks all keeping the same sound and each enemy offering repetitive grunts of pain.  The voice-acting, what little exists, is middle-of-the-road.  The score, however, offers a decent mix of whimsical tunes and action-paced diddies.  But the score is a bit limited and after 20 hours, there's only so much you can listen to before wishing there was some new sound around the corner.  At least it all comes in 5.1 Dolby Digital.   The true strength of Vexx is in the patforming and puzzle elements.  The game is good and a lot of fun, but misses out on greatness simply because there wasn't enough thought or daring put into the design.  It's challenging at times, but the game is a bit unfocused.  Still, the puzzle elements are a pleasure and the gameplay mechanics are simple and somewhat addictive.  There are lots of little faults to Vexx but it's a good game, if not a great one.Platform fans hungry for a run at another big adventure should check out Vexx, but don't expect a revolutionary experience.  It's a long game and some may not be compelled to finish it, but it's a good experience, especially if you enjoy hopping from platform to platform.", "date": "Feb 10, 2003"}