{"name": "Armored Fist 3", "name_review": "Armored Fist 3", "ref": "https://www.ign.com/articles/1999/10/23/armored-fist-3", "text": "For whatever reason, the history of video games seems inexorably linked to the tank. Who can forget the first glimpse of Battlezone's sparse green geometry through the haze of a smoky arcade? Or the sweaty-palmed thrill of a hard fought game of Combat for the Atari 2600, your victory secured with a ricochet shot just as the score stopped blinking? Or even the secret tank level in Smurf's Rescue for ColecoVision, the area that allowed you to live out the ultimate Gargamel fantasy, dozens of little blue annoyances gumming up your treads. For as long as games have been around  and for as long as they continue to be  expect tank games to keep appearing on the diesel-clouded horizon.  Following in these treaded shoes is NovaLogic's Armored Fist 3, the latest and greatest in the company's tank simulation line, this time putting you in command of a M1A2 Abrams tank. With a voxel-powered graphics engine, and enough detail to choke an Army tank instructor, it's a title that tries to rumble down a fine line  the long-sought after middle ground between simulation and entertainment. And that's no easy task for an arena so complex. Does it succeed? Will you need six weeks of basic training just for to get through the tutorial? Will you understand what's going on if you haven't played the first two Armored Fists? Stop asking so many questions.  What may be intimidating to tank-game novices is the vast array of keys needed just to get around  and look around  in Armored Fist. By our count, about 70 percent of your keyboard is consumed by command keys, and getting used to the spread of hotkeys does take a while. Fortunately, the game's excellent manual and tutorials do a good job of helping the beginner sort things out  especially in the easy mode. Be patient, once you get the system down, fun is waiting around the corner.  Graphically, the game isn't as impressive as many other military simulations on the market  land or air. NovaLogic continues to give voxels  volumetric pixels -- the old college try, and it's an admirable effort. Voxel engines have a good deal going for them, especially in games like Armored Fist where varying 3D landscapes are important for hiding, formulating strategies and devising tactics. The engine does boast nice features this time around, but not enough to make us believe NovaLogic couldn't have done without the voxels and created a 3D accelerated game. There are some nice touches, like persistent tank treads in the sand and billowing smoke after rounds are fired. Our trouble here is less in the look of the game (which is passable when looking at vehicles and landscapes, but offers up terrible special effects, explosions, and damage) but more the somewhat limited speed with which CPUs render voxel worlds. Even running on our 600 MHz test machine, framerates seemed to chug, especially when confronted with multiple enemies and loads of whizzing bullets. With all that Armored Fist 3 has going for it  realism, depth, complexity, fun  it's a shame that stuttering framerates will turn some players away before they have a chance to experience the game behind the voxels. Our plea to NovaLogic: Turn to 3D acceleration now.  And it really is the game behind the mediocre graphics that kept our interest cemented. The attention to detail is here, a fact evident when you first open the box and see the healthy manual staring back. Easy mode allows players to jump right in the game, soak up a few training missions, and be on their way, targeting the enemy and racking up kills in no time. But the detailed advanced mode is where we suspect a lot of players will end up. It's got everything a wanna-be tank driver could ask for, from multiple tank views, to eight different stations you can work the action from: Gunner's auxiliary and primary sight, and of course the driver's position. The varying stations allow you to be in total command  and somewhat overwhelmed at times, too, especially in advanced mode. But if you've stepped up to advanced, that's what you're looking for, anyway. Trying to battle a column of T72s headed straight for you, while also keeping your eyes on the $#$&#@! Hind helicopter, and those damn infantry units firing away is a heart-thumping experience that will get your motor running.  What the two modes do is allow a nice balance of realism, of simulation, and of fun, of entertainment. Instead of trying to balance both in one play mode, NovaLogic has done a nice job of splitting gamers' demands for fun and realism right down the middle. Buy the title, and you can have your M1A2 Abrams cake and eat it, too.  Once you decide exactly how hard you want to make it on yourself, you'll choose between training, battle, and campaign mode. Training is rather self-evident; battles let you jump into single missions, even play ones that you've already completed. Campaigns are the meat of the game, and the title revolves around four areas in which you'll complete campaigns (if you're lucky). Battle your way through campaigns in Somalia, Thailand, Iran, and Azerbaijan, with your success or failure in each mission affecting the later missions in that campaign. Carelessness with your formation of tanks in an early fight, for instance, will mean you'll be up the creek in a later fight. Luckily, the game lets you jump from our tank  or formation  to another, controlling everything you see fit. Don't like the way the computer is fighting with your flanking column? Aren't happy with the formation the AI is using to attack your foes? Jump into those tanks and do it yourself, if you think you can do better. It's a feature than can be a little hard to handle sometimes, but once players get the hang of switching back and forth, it makes the end feeling of accomplishment that much greater.  Working your way through the missions is satisfying, sure. But where's that sense of in-your-face, that feeling of sticking it to the other guy? NovaLogic has thought of you taunters, too, and multiplayer support is included to work over NovaWorld. Better yet, the game's Voice-Over-Net technology allows you to actually talk to the guy you just wasted (providing both you and he have a full-duplex sound card, that is)  allowing you to really rub it in his face. Our tests of NovaWorld play were dicey  sometimes we were able to connect, and sometimes not. Tests of the Voice-Over-Net on a LAN connection, though, worked well and added a certain spice to the action that text-message taunts couldn't. Now, if only you could talk to more than one enemy at once ...  Logging onto NovaWorld, which supports 32 players fighting against each other, is a relatively painless process. But we had intermittent difficulty getting the server to find an update we needed, and then getting us logged in. Hopefully, it's just an early problem that NovaLogic will work out. The online service supports a good variety of game types  deathmatch, cooperative, team deathmatch, capture the flag, and something called Red on Blue, where each player controls a platoon of four tanks. Unlike team deathmatch, though, players must achieve certain mission goals, a la cooperative play.  Armored Fist 3 does an impressive job of straddling the difficult line between simulation and action, providing depth of play and attention to detail that is both appreciated and helpful, once you stop feeling overwhelmed by the myriad controls. If only NovaLogic would give up the voxel ghost and give us some lens-flared, smoothed-out Direct 3D or Voodoo graphics  with the resultant faster framerates  we might never pop our heads out of the turret.  -- Mike Morrissey", "date": "Oct 23, 1999"}