{"name": "World Cup 98", "name_review": "World Cup 98 Review", "ref": "https://www.ign.com/articles/1998/05/21/world-cup-98-2", "text": "Only months after the release of FIFA: Road to World Cup '98, EA Sports is already on the ball again with a sequel. World Cup '98 is essentially a refined version of FIFA, minus the player-creation mode and the FIFA teams -- but with improved gameplay and cinematic scenes.Created by EA Canada (the makers of both FIFA titles), World Cup '98 will simulate the tournament with all 32 teams that qualified (plus eight that didn't and eight hidden ones) and 10 fully licensed World Cup stadiums. The enjoyable predecessor featured fantastic options and a ton of features, but we felt the gameplay and speed still didn't match up to Konami's International Superstar Soccer. And while control- and gameplay-wise World Cup '98 is still not quite up there with ISS, the presentation, options, and multiplayer capabilities of this game serious butt.Gameplay: World Cup '98 offers five different modes of play for up to four players: World Cup, World Cup Classic (only available to players who win a World Cup), Friendly, Penalty Shootout, and Practice.At first sight, the game may appear like a slimmed down version of Road to World Cup because of the lack of a player creation mode and FIFA teams, but World Cup does exactly what you'd expect it to do: Perfectly simulate a soccer World Championship. Thanks to the complete World Cup license, accurate teams, and a stadium selection that ranges from Lens to Marseille, World Cup '98 feels like the real thing.Gameplay and control are largely similar to Road to World Cup, but the game runs faster and more smoothly (you can also adjust the speed) and the reaction time has been tightened (thanks to some EA doohickey called Compression Touch). On the downside, the game is still not as responsive as it could be. EA decided that it was more important to portray accurate player motions than to cut the animations short by letting players turn on a dime. In the game, this translates into videogame soccer that's beautiful to watch, but sometimes frustrating to control. Another recurring problem is the passing AI. It may be realistic, but it's really easy to overshoot when passing to a team member.Thankfully, the artificial intelligence (AI) routines have been completely reworked to deliver ~smarter~ goalies and player AI (for example, the goalie won't accidentally kick the ball out when kicking off and reacts more realistically to different ball speeds).One of the best new additions to the game -- that in my mind pushes this game ahead of its enjoyable predecessor -- is the ~on the fly,~ in-game management. Players can activate four real-time game tactics at any time in the game by pressing Z and R. This way, sim fans can pull off off-side traps, send men forward, and execute wing back runs. Another good, new feature is the handicapping system, that enables more evenly matched contests between otherwise mismatched teams, and trivia for die-hard soccer fans during the half time intermission.Finally, the World Cup Classics Mode is a nice little bonus feature that lets you replay eight classic final matches from World Cup history -- complete with the authentic teams and outfits of that time. However, you need to beat the World Cup once to enable the Classics Mode (and you need a controller pak to keep it).GraphicsWorld Cup '98 is pretty amazing looking. The polygon models are realistic and move about well most of the time (there's a bit of jittering here and there) and the cinematic scenes when players prepare for penalty kicks or after shooting goals are second to none. The stadium graphics, especially when playing evening matches are also really cool, with an orange sky and different colored lights in the tribunes. Too bad the audience isn't animated, but at least there are two giant flags corresponding to the teams in the stands. EA's attention to detail is again apparent in the fact that the field will actually get worn down as you play, meaning brown mud will eventually shine through the grass close to the goal areas. Unfortunately one problem that has plagued the FIFA series makes a return again. Although the framerate has improved, the game still appears jerky at times. A far cry from the smoothness of many other EA games -- and, of course, Konami's ISS series. The menu and tournament screens deserve special mention. They may be a little difficult to navigate at times, but they sure are gorgeous.SoundNot much has changed here. Overall, EA's soccer games have never disappointed in the sound department, and this one's no different. N64 owners will be treated to the fantastic Dolby Surround sound (at least someone's doing it!) cheers and the usual sparse but spot-on commentary by Lynam and Motson. As usual, the game starts off with a short digitized music clip, this time from Chumbawamba's Tubthumping. It would be cool if next time, the in-game midi tune would echo the intro, but that might be a bit much to ask.MultiplayerUp to four players can compete. Set-up is fast and painless and the game plays well even with four people on board. When playing with several players on one team, World Cup beats ISS hands-down. Each player has a differently colored marker (as opposed to ISS's different shapes) and playing with three or four guys against the computer is the next best thing to watching the real World Cup.OptionsYou can virtually adjust everything. From referee strictness to player fatigues, difficulty levels, handicapping, speed, volumes, controller config, clock times, weather -- you name it. Don't get confused by the front page set-up menu. You need a memory card to save it if you adjust features there. Once you go into a game menu, you can adjust everything without having to save it. It's needlessly complicated, but you'll get used to it. Note that World Cup is yet another memory hog, just like most other sports games. Reserve a whole Memory Pak for this puppy.Slowly but surely, EA Sports is inching closer to the perfect soccer game. The full license and authenticity of the graphics and atmosphere will make this a favorite with World Cup enthusiasts, even though it doesn't quite play and move as well as ISS. Having said that, if you're into soccer, you should definitely get it -- even if you own ISS. It offers a much different experience from Konami's game and a more ~authentic approach.~ If you already own FIFA Road to World Cup, you might want to think twice about buying World Cup '98, unless you can't live without a more accurate WC sim. Everyone else, check it out. The multiplayer modes are too good to pass up.", "date": "May 21, 1998"}