{"name": "Darkened Skye", "name_review": "Darkened Skye", "ref": "https://www.ign.com/articles/2003/02/12/darkened-skye-3", "text": "In today's competitive videogame industry, publishers are always looking for the next big idea -- something lasting that will get its titles flying off store shelves with earth-shattering sales.  The simplest and often least creative means to crank out a sure-fire console hit is to combine one item from column A with something special from column B, and viola!  Something ~fresh~ is born from two otherwise stale designs.  We like to think of Darkened Skye as the result of such a wacky corporate brainstorming session.  Producer A: We need a new game idea.  How about Zelda meets Skittles?  Designer B: Hmm.  Everyone loves Zelda.  And everyone loves Skittles.  I see where you're going with this.  Producer A: Make it happen.  And so it happened; first on the PC early last year, and now finally arriving on the GameCube this past November.  Nintendo fans have surely seen this mysterious title lying about store shelves during the post-holiday season and have perhaps been intrigued by its well-conceived art style and appropriate box text. With taglines such as, ~Wield Powerful Magic,~ ~Solve Ancient Mysteries,~ or the always-popular ~Save the World,~ how could you possibly refuse?  But there's also no mention of the highly emphasized Skittles factor whatsoever, so gamers expecting this adventure to be salty or chocolaty will have to settle for candy-coated fruit instead.  The Facts:   Play as heroine Skye as she realizes her destiny to collect magical Skittles  Do not eat the Skittles; instead, use them to save the world  Fight through five different worlds, each with multiple areas  Real-time action mixed with fantasy adventure elements  Wield powerful magic  Solve ancient mysteries  Save the world  Requires six Memory Card blocks  For one player only  Gameplay As the game's instruction manual is prone to remind you, all good adventure games require a few basic elements: a hero longing to find her place in the world, a gratuitous source of evil to provide the conflict, and a bag of Skittles.  Darkened Skye has them all.  Truthfully, we have no idea where the Skittles idea originated, but we must give publisher Simon and Schuster points for creative use of a snack food license.  In her homeland of Lynlora, gamers play as Skye: a simple girl whose fate will soon be intertwined with the sugary treats.  In Skye's world, a ~Great Rainbow~ once adorned the heavens -- think back to your favorite ~Taste the Rainbow~ television commercials of the '90s, and this will make perfect sense.  The Rainbow once bore artifacts known by the commoners as ~Skittles,~ but has since been stolen by the gratuitously evil Lord Necroth.  You'll never really learn why exactly these Skittles are so important to your world, nor why Necroth feels the need to steal them, but it is not Skye's place to question her calling.  Once she accidentally stumbles upon the first orange Skittle, she's compelled to save the world by collecting the rest of the flavors and other related mystical artifacts in her quest to restore the Rainbow.  The story isn't the most gripping or epic fiction set to a videogame, and, in fact, it's rather poor.  But you can't blame the Skittles license for that.  In fact, the Skittles are actually the best thing going for this formulaic tale, as without them we'd be left with a much more generic and worthless quest.  We applaud S&S for daring to incorporate such an unorthodox property from column A into a videogame adventure title, but the underlying story is still far too run of the mill to truly care.  Perhaps with a bit more creative design, the Skittles idea could have really sold itself as a quality crossbranding. As it stands, gamers will quickly forget about it.  Taking control of Skye herself feels very natural to gamers familiar with the common dual analog control setup.  The action is viewed in the third-person, with Skye onscreen running, jumping, and smacking creatures over the head via her enchanted staff. The left analog stick moves forwards, backwards and strafes right and left while the C stick is used to turn horizontally and aim the camera vertically. You'll play the game with both hands on the sticks and hit the L and R buttons to wield your staff and jump, respectively.  As far as basic controls are concerned, it's very fluid, easy to pick up, and never frustrating.  The problems soon come when you hit the L button to attack the many wild creatures set in your path.  Skye will swing her staff in a predetermined path, but not with nearly enough agility or style to cause Fox McCloud take note.  There are a few different animations, and pressing up and the L button simultaneously will send the girl swinging madly for a brief four-second frenzy.  Enemies will swing big clubs of their own or return fire with projectile weapons (such as arrows), but Skye has no defensive moves to block or counter such attacks.  Thus, it's back to the old-school shooter hit-and-run tactics: run in for a quick hit, and then quickly run out of the way.  There's no targeting of enemies and no lock-on function to provide more precise combat. The end result feels very sloppy, and Darkened Skye's fun factor is seriously hurt for it.      As players progress, they gain other abilities; namely, spells and items.  A single spell and item can be equipped via the pause menu and then used in game with a press of the Z or X buttons.  This gameplay element is nothing new to fantasy adventure fans, and it's implemented in typical fashion here.  Eventually, as players round up the requisite Skittles, they'll be able to assign them to new spells and activate their powers.  If only these powers were useful enough to keep our attention, then we'd feel more compelled to stop eating our Skittles and save them for magical purposes.  Sadly, we're not even allowed to eat them.  Games this generic tend to feel more like a psychological experiment over time, as if some game designer somewhere is testing our ability to follow directions, read hints left in quest logs, walk down linear paths, successfully thwart a handful of mindless creatures, and earn the prize.  As a work of art, Darkened Skye does not evoke emotion or entice with polished gameplay potential, and not even all of the Skittles in the world can save it from such a fate.  Graphics Developer Boston Animation has created a fantasy world in Darkened Skye that is both clean and very smooth, while otherwise lacking the detail and variety to truly set it apart.  The framerate is a brisk yet inconsistent 60 frames per second that falters whenever multiple characters and enemies get hyper onscreen.  This is certainly great for participating in all of the running, jumping, and slashing that goes down in Skye's world, but as we mentioned, it won't make it any more fun.  Character models are slightly blocky but well designed for the most part.  On the low end, environments are wrapped with endlessly repeating textures that border on stereogram quality -- you know, those 3D posters that you stare at in the mall -- and the landscape is particularly low-polygon and angular.  While the visuals certainly won't impede your ability to engage in what little story and action this fantasy world has to offer, they certainly won't dazzle the more refined gamers in the crowd -- not even with the help of its progressive scan mode.  Sound During the game's many cutscenes (both real-time and pre-rendered) sliced between key points in the game, the audio quality is always above the marks set by the majority of sloppy efforts on the system.  The game features many hours of solid voice acting that is both well delivered and quaintly charming with its sarcastic bite, and it rings through loud and clear on the GameCube.  Even the music is clean of all compression and features nice musical compositions to fit the medieval fantasy style of the adventure.  The instruments are noticeably MIDI, however, and are perhaps the reason for their crystal clear delivery.  Still, it's not a bad audio effort at all, and definitely one of the shining points of the game.The entire Darkened Skye gameplay experience is nothing new or exciting if you've played any remotely similar third-person adventure title during the past five years on any system. It's a short-lived adventure that experienced gamers will pass with flying colors (pun) and little intrigue.  While the control is solid and liberating, the combat and action elements feel rushed and void of depth.  Items and spells are always a good touch, but those in Darkened Skye are so standard that only newcomers or true Skittles fanatics will find them interesting.  After hours of collecting magical Skittles running quickly through a barren 3D world, and I'm left only with an uncontrollable urge for something sweet from the vending machine.If you've played Nintendo's Star Fox Adventures, then this valiant effort is not worth your time or money. If you're very new to the genre and are extremely forgiving of its lack of polish, then you might give this one a weekend rental should Star Fox be sold out.", "date": "Feb 12, 2003"}