{"name": "Dark Cloud 2", "name_review": "Dark Cloud 2", "ref": "https://www.ign.com/articles/2003/02/14/dark-cloud-2-2", "text": "The original Dark Cloud was a big hit on the PS2, not only because it was a great game, but also because it was one of the only RPGs out on the PS2 at the time. Now, there are a slew of great RPGs currently available, making Level-5's job of creating a standout sequel that much harder. Did they succeed in outdoing not only themselves, but also the competition? Absolutely.   Gameplay Dark Cloud 2, like the original Dark Cloud, is a compelling mlange of gameplay styles that may feel awkward at first, but slowly settles into a comfortable pace after a few hours of play. But regardless of what styles and genres Dark Cloud 2 attempts to combine, the game is a straight-up RPG at its core, and I couldn't be more thankful.  Much of Dark Cloud 2 is spent crawling around randomly generated dungeons while searching for the exit key. Sounds familiar, doesn't it? It should if you played the first Dark Cloud because the dungeon crawling aspect of the sequel is almost identical to the previous game. It's so similar that you'll find yourself fighting many of the same enemies and picking up many of the same items in similarly constructed dungeons. Aside from the graphical overhaul and new items, there is very little to differentiate the dungeon aspect of Dark Cloud 2 with its predecessor. You still fight your way through dungeon after dungeon as you search for the key to the next level. If you liked this part of the first game, you'll definitely feel at home here. If you didn't like it then, well, things haven't changed much. The battling can still be a tad repetitious (though less so in the sequel), and it's easy to tire of the repeated dungeon graphics for each major dungeon theme, especially when it consists of ten or more levels.  The combat system in Dark Cloud 2 has changed very little from the original game. In other words, it still uses the now classic Zelda lock-on system, and is in real-time rather than being turn-based, also like Zelda. When in battle, your arsenal of moves includes your standard attack (which can be repeated for simple combos), your projectile weapon/magic, and any items you may have that can thrown at an enemy. Killing most of the enemies in the game is actually very easy, requiring you to do little more than block, then attack, then block, and so on and so on. At first I found this unchallenging and repetitive, but it didn't take long for that to change. As you progress farther into each dungeon, you'll come across monsters that can kill you with one or two hits. One missed block and you have to start the dungeon all over again. This became a little frustrating later in the game because of the somewhat cheap hits that can occur when you least expect it. Also, because you have to hold down the block button while pressing the attack button to pick up an object, my character would sometimes go into a lifting animation when I wanted them to quickly attack after a block. It wasn't unbearable, though, and over time I learned to take more time and compensate for the delay.     Also back from the original game is the concept of breaking and repairing weapons, only now it's been revised with a few handy and much needed tweaks. Let me explain: every weapon has its own endurance meter that slowly decreases every time you hit a monster. If the endurance meter becomes empty, your weapon breaks and is more or less worthless until you repair it, although in the first game, if you broke your weapon it disappeared. Now, in the first game this occurred incredibly frequently, and often times you were short of the repair powder needed to fix the weapon. Thankfully, this happens much less in Dark Cloud 2. But not only do your weapons last a lengthier time period, there is also an abundance of repair powder to be found throughout the game. This makes the weapon breaking and repairing concept feel much more natural, and to a point, realistic.       Probably the most notable feature of the first Dark Cloud was its town building feature, and you'd be correct to assume that it is back and better than ever. Like many of the other new and improved features, the town building aspect has been completely overhauled with a more powerful, yet more intuitive system that lets you build more complex towns with greater ease. In the original Dark Cloud, your character would explore the dungeons and come across Atla, or spheres that contained parts of a town. You could then use these parts when (re)building the lost city. In Dark Cloud 2, the method for acquiring parts for your town is a quite dissimilar. Rather than finding parts in the dungeons, you must find special ores randomly placed in the dungeons. You can then feed these ores into your town-building robot/ship, and it will then determine what parts you can or cannot make. But even then, you must go out and either find or buy the necessary raw building materials to build a house, or a tree, or a river, or anything else for that matter. If town building seems a little more complicated, it's because it is, but it's also very easy to learn and use, thanks in no small part to the reworked interface. I'm glad to see so much time was spent in making this aspect of the game deep, yet user-friendly.  One of the more creative elements added in Dark Cloud 2 is the idea of creating, well, ideas. After taking pictures of various objects, you can then use the pictures to create a new idea card for an invention. For example, by taking a picture of milk cans, a belt, and a metal pipe, you can conjure up the idea for a power pack. After you've got an idea formed, you must then find/buy the necessary raw materials to physically build the said idea. But not every group of objects will end up being a usable idea. To find one that is, you must either be incredibly crafty and inventive, or do like I did and search for randomly placed clues that offer some suggestions for inventions. Overall, the concept is really great, as is the implementation. My only complaint is that this feature is underused. It's a shame to see such an innovative concept go underutilized, especially in such a well-rounded game.     Another great addition to Dark Cloud 2 is Steve. Who's Steve? Well, Steve isn't actually a character per say. He's actually a robot/vehicle of sorts that functions more as a weapon than anything else. In fact, you must treat Steve the same way you would a weapon, and that includes using repair powder to fix his weapons, and gaining experience the way other weapons do. What is different is the way you upgrade Steve. Rather than synthesizing him and raising his stats, you can upgrade him physically with new weapons and parts, in essence creating your own personalized Steve. Once you acquire Steve (which is very early in the game), you can then switch to him on the fly by pressing in on the right analog stick. You'll not only find this useful when in dungeons, but also a necessity as you face bigger and more dangerous enemies.     While we're on the subject of switching characters, I'll go ahead and mention Monica. I won't get into who she is or where she comes from (I wouldn't want to ruin the story for you), but I will say that she is another playable character that you can also switch to on the fly by pressing in on the analog stick. She's more or less very similar to Max, except that she has magical abilities that include shooting projectiles and shape-shifting into enemy forms. Again, I'll try and stay away from the details since discovery is a large part of the fun in this game, but let's just say that Monica is not only cute, but extremely useful to boot. Also, the times when you have Max, Monica, and Steve available simultaneously really help make the more difficult dungeons easier, as each character has their own life and weapon points. So, if one of your characters is low on energy, you can just switch over to another one for the time being.       There's so much to talk about in Dark Cloud 2 that to list everything here would be absurd. Even what's been mentioned here only scratches the surface of the joys you'll find in the game: the great, (albeit somewhat easy) boss battles; the well implemented mini-games such as fishing and golf; the intricacies of town building and time traveling; the easy-to-digest story; the depth in upgrading and building your weapons; it's all there and then some. While all this may seem a little overwhelming at first, fear not. On the menu screen is a help feature that will give you fully voiced tutorials on just about every aspect of the game. Better yet, the tutorials are not only informative, but are a joy to watch, as they use the same elementary drawings and diagrams found in the first game. Well done indeed.   Graphics Simply put, Dark Cloud 2 looks spectacular. I can think of few games as visually impressive on the PS2 as this game. But what makes the game look so good is not incredibly high polygon counts or lots of extravagant lighting and particle effects. Instead, Dark Cloud 2 is a visual success due to its polished and graceful presentation, as well as its fantastic art design. While many games take the no-holds-barred approach and bombard the screen with as many effects as possible, Dark Cloud 2 heads down another path, full of subtle lighting effects and a crisp, fresh, and almost playful look. The overall effect is truly delighting to witness in motion.  A large part of what makes Dark Cloud 2 stand out visually is its perfectly implemented use of cel shading. Rather than using a flat-shaded effect with heavy black outlines on every edge, Dark Cloud 2 uses a method that the developer refers to as ~tonal rendering~ where the polygons are given a soft, shaded look. Additionally, the use of black lines is used sparingly, but when it is, it's in all the right places, accenting and highlighting the wonderfully constructed character and environment models.     As mentioned earlier, the art direction in Dark Cloud 2 also plays a large role in making the game come together so nicely, at least from a visual standpoint. A mix of old-school fantasy themes, anime expressions, circus fashion, late nineteenth century attire, and a good portion of just plain creativity create a fantastical world that leaves very little to the player's imagination. In fact, there are so many memorable (and likable) characters, enemies, and environments that I wonder if Level-5 could ever top themselves. And in case you're wondering, yes, the game really does look that good.   Even from a technical standpoint Dark Cloud 2 delivers in spades. There's nary a hint of slowdown, the framerate is always above a respectable 30 fps, the draw distance is great, and there are few, in any clipping issues to be found. That's not to say the game is perfect from a graphical standpoint as there are a few minor complaints I could make (limited facial expressions, insignificant pop-up issues), but it would be like me complaining about the missing parsley garnish on my butter poached lobster with melted leeks and golden chanterelles. What all this boils down to is that Dark Cloud 2 is arguably the best looking PS2 game out there, period. Besides, where else can I see an overweight clown stripped down to his boxers with a belt of dynamite strapped to his tan-lined chest?         Sound The music in Dark Cloud 2 ranges from really good, to really really good, to exceptionally good, but for some reason it feels like it never goes the extra step the way the graphics do. Not that I'm really complaining, but for a game that seems to have held nothing back both visually and conceptually, I feel that the music is just a little too restrained. You can almost hear it wanting to break free and seduce you with epic love ballads and moving battle scores, but it always comes just short of it. Instead, you get an extremely solid and functioning soundtrack that few could complain about when not taking in the other aspects of the game.   A big and welcome addition to Dark Cloud 2 is the use of voice during the majority of the cutscenes. Entirely missing from the first game, the inclusion of voices gave me a better sense of the characters as people, and sometimes made me laugh out loud with their hilarious voices. All I'm gonna say is vain fish god. You'll know it when you get there.   The quality of the voice acting is always important -- it can make or break the tone of a game. Luckily, the voice acting in Dark Cloud 2 is more than adequate and is definitely better than the voice acting found in say Final Fantasy X. Playful and honest would be a good way to describe it. Ironically enough, the weakest voices in the game are Max's and Monica's, the two main characters of the game. While there are times where Max sounds natural and convincing, much of the time the dialogue feels forced and empty, especially during any of his monologues. Still, the overall quality of the voices is better than what's found in most games, and that in itself is something to be thankful for.Dark Cloud 2 takes the standard sequel road and gives us everything that made the original Dark Cloud great, only bigger and better. Actually, I take that back. Dark Cloud 2 takes everything great from the original Dark Cloud and super sizes it, up sizes it, and then king sizes it just for good measure. The leap in quality between the two games really is amazing. From the incredible graphics, to the great sound, to the refined gameplay, Dark Cloud 2 just oozes of quality and polish. It truly feels like that game that Level-5 always wanted to make with the first Dark Cloud.As good as this game is, it's not for everyone, especially those who were not fans of the original's dungeon crawling and town building. Because many of the same gameplay elements made their way from the first game, you're still going to get a similar experience, although it'll be a lot prettier this time around. But, if you're main complaints about the first game involved small details, like the frequent breaking of your weapons, or it's lackluster graphics, then definitely give Dark Cloud 2 a try. It fixes almost every problem found in the first game and then adds some sugar coating on top. In the end, Dark Cloud 2 is a superb RPG that doesn't disappoint. Buy it, play it, then play it some more. You can thank me later.", "date": "Feb 14, 2003"}