{"name": "Tom Clancy's Ghost Recon", "name_review": "Tom Clancy's Ghost Recon", "ref": "https://www.ign.com/articles/2003/02/18/tom-clancys-ghost-recon-3", "text": "For a game touted as IGNPC's ~2001 Game of the Year,~ Ubi Soft's Ghost Recon has much to live up to in its current GameCube form.  Even its new GCN packaging is all too quick to bear the ~Game of the Year~ tagline across the front cover artwork.  Sure, the game was once crowned as the king of strategic PC shooters back in the day, and it even re-appeared on the Xbox this past November as a similarly well-produced and online-enabled package of warfare.  But it seems that time has a cruel sense of humor, as the last system to finally receive the game is now met with a port full of problems.   The Facts:   Tactical, squad-based U.S. Army combat set in the year 2008  Equip and command multiple units via an in-game map and weapons layout menu  Multiple game modes, including training, tactical exercises, and campaign  Track and check your single-player game statistics  View medals and awards earned, such as movies and screenshots  Two player simultaneous action for both mission cooperative and competitive matches  Dolby Pro Logic II support  Requires 17 Memory Card blocks  Gameplay Perhaps the difference between 2001 and 2003 is much longer than we'd like to think.  Back in 2001, the PC release of Ghost Recon was critically acclaimed for its superb tactical combat and realistic visuals.  Today in 2003, none of such kudos apply to its belated GameCube port.  You will not find ~substantial enemy AI~ here; instead, a mockery of modern militaries -- American, Russian, or otherwise.   There are very few ~fluid animations~ to be found anywhere within the game, and the texture work and trees are absolutely not ~some of the best [we've] ever seen.~  Perhaps time has taken its toll on Ghost Recon, but we stand by the philosophy that games should ripen over time.  This one most certainly has not.  As in most other Red Storm/Tom Clany titles, players can choose to dive headfirst into Ghost Recon via its standard training mode firing range.  It's nearly the exact same training mode featured in the remarkably poor The Sum of All Fears GameCube title that recently shipped to stores, but with a slight twist of lime.  Whereas The Sum of All Fears was based more in S.W.A.T.-style counterterrorism, Ghost Recon has its roots in the camouflage of standard issue U.S. Army BDUs.  It replaces the highly trained special forces in Fears with the highly-trained grunts in Recon, but manages too also keep consistent the many nagging gameplay and technical flaws afflicting its Cube brother.  Once gamers are familiar with the dual-analog control scheme -- again, very similar to The Sum of All Fears -- then it's time to fire up the Campaign mode.  Here, you can play through 15 story-driven missions that ask players to do many of the same things that a real life platoon leader would need to accomplish: pick your troops, select their weapon payloads, and assign specific ROEs (Rules of Engagement) to determine how your computer teammates will react when encountering enemy forces.  And if it weren't for the clumsy interface or applesauce-for-brains soldiers stationed in the field, such responsibilities would be a welcomed treat for Cube fans.  Sadly, we're stuck with applesauce, as Ghost Recon's entire AI package has been severely dumbed-down for this latest console rendition.  You'll grow impatient as your teammates refuse to follow you deep into enemy territory, forcing you to run back and round them up.  Once everyone is finally moving, you'll watch in horror as they finally show up and get gunned down at your feet.  If tactical military warfare were any more like babysitting, we'd expect to get $10 and a microwave dinner out of the deal.  Likewise, enemy soldiers are equally brainless, as they'll stay planted in their assigned spots no matter how many of their comrades slump to the ground around them.  Other times, your foes will perform as masterful sharpshooters, dropping your entire team from a wooded hideaway with a single clip as your crew mistakenly pops into their line of sight.  We love a good challenge as much as the next gamer, but Ghost Recon on the GameCube is better thought of as a lesson in anger management -- control your temper now, or pay the price of a new WaveBird later.      When ignoring its vastly superior PC forefather (and to a lesser degree, its Xbox sibling), Ghost Recon actually favors quite nicely in comparison to the recently released The Sum of All Fears GameCube debacle.  The game runs somewhat more smoothly, with slightly improved team and mission management options, more diverse and interesting terrain and objectives, and added combat elements such as blasting tanks and employing static machine gun nests to defend a position.  And there's even a two-player cooperative mode that goes beyond the gratuitous deathmatch scenario to allow players to attack a single mission together.  Considering the lack of online support in this Cube port (a feature the game was built around in its PC and Xbox renditions), it's a fine addition for those who can manage to look past the game's many frustrations and shortcomings in the process.  But in the end, these many shortcomings work against everything that makes a tactical shooter fun.  The game does not encourage strategic team assault, as you won't find your teammates cooperative nor the enemy cunning enough to deserve such thoughtful tactics.  When combined with the return of the floaty, inaccurate controls (see: The Sum of All Fears on GameCube) that leave us irritated as well as baffled (don't even ask us how to get your weapon out of zoom mode), Ghost Recon on the GameCube is a good example of a great game gone bad so many years later.  Graphics Nothing dates a game faster than its real-time visuals, and Ghost Recon on the GameCube has a distinct ~2001~ date stamped squarely on its forehead.  There's certainly nothing wrong with a game sticking to its roots in all facets, as we're always glad to get our hands on the latest classic rendition of Ms. Pac-Man just as fast as Namco can repeatedly port the sucker to market.  But when a game heralds itself as the ~Game of the Year~ (no matter how clever or misleading its done), expectations are such that it competes very favorably with the latest and greatest hits on the system.  Ghost Recon on the GameCube certainly does not compete on any level, and this is especially true in the graphics department.  The title's overall visual palette attempts to recreate a photorealistic style, and in some instances, its crisp, high-resolution output can work toward this end.  But in its details, the game is much more of an eyesore.  Textures are repetitively smeared with noticeable seams, and models are less detailed than they should be this late in the GameCube timeline.  The framerate always skips somewhere below 30 frames per second -- a flaw that could be forgiven if perhaps the visuals bore merit.  Blood effects are laughably poor.  (An M rating for ~blood and gore?~  Where?)  Character animations are extremely robotic and jumpy -- unnaturally so.  Even the effects such as gunfire and explosions are a terrible disservice to the life of excitement offered by a career in the United States Armed Forces.  Don't let the recruitment poster sign you up for this tour of duty, because it's a whole lot uglier than you'd like to believe.  Sound Adding to the list of things that Ubi Soft upgraded in its latest Cube port, this Tom Clancy thriller now rings true with Dolby Pro Logic II support.  You'll hear bullets shoot by your head at all angles and birds chirp in a far off patch clump of trees, but none of it will happen with enough clarity or distinction to truly tickle your eardrums.  In fact, the gunfire is just as bad as Red Storm's previous Cube titles, with tinny, compressed, and very non-frightening sounds of machinegun fire passing flatly through the air.  Military combat games require convincing sounds of shells clanging and bullets punching through the air to truly seat you in the role of Sergeant Badass, and this game doesn't have it.  If the game were any better, we'd consider this a true shame.  Otherwise, the game does feature nice dynamic music that will start up whenever you manage to ping an enemy soldier with your rifle, and then subside to ambient chatter as the action releases.  It's just cinematic enough to bump the presentation and sound quality up a notch, and at this point, Ghost Recon is counting all the notches it can get.Much like the recently translated The Sum of All Fears, Ubi Soft's Shanghai development team just can't seem to get the code right.  This latest Tom Clancy title to hit the Cube ships under the clever guise of a quality ~Game of the Year~ package, but in reality, it is nothing more than a below average port of a once great military shooter.  The menus are clean, and other elements of presentation are sufficient, but anything dependent on technical finesse -- such as computer AI, framerate, and precision controls -- is seriously lacking.  Gamers will find themselves frustrated and bored after only the first mission, which means that your multiplayer cooperative plans might not be quite the all-night party that you'd hoped.  Here's hoping that Ubi Soft's third try is the charm later this spring when it releases the much anticipated Splinter Cell on GameCube, because until then, Clancy fans are going to have to stick to the paperbacks.", "date": "Feb 18, 2003"}