{"name": "Bust-A-Move 2 Arcade Edition", "name_review": "Bust-A-Move 2 Arcade Edition Review", "ref": "https://www.ign.com/articles/1998/05/23/bust-a-move-2-arcade-edition", "text": "The moment you plug Bust-A-Move 2 Arcade Edition into your N64, you're doomed. Seriously. Acclaim and Probe have perfectly ported Taito's arcade hit to N64 -- not that that was a difficult thing to do. After all, the arcade hit has been around for years and now looks dated and sounds dated -- but appearance is not what it's all about.Bust-A-Move 2 (called Puzzle Bobble in Japan -- not to be confused with Enix's Japanese dancing game) features four modes at three difficulty levels: Player vs. Player Vs. the Computer Puzzle Mode Time Attack (one or two players)The object of the game is simple. You operate a bubble shooting machine that can, well, shoot colored bubbles up toward the top of the screen. The goal is to match up three (or more) bubbles of the same color by controlling the angle of your bubble shot via the analog stick. As an added twist, you can bounce the bubbles off the wall and try to drop as many ~orphans~ (single bubbles attached to the cluster you pop) as possible at the same time. If the wall of orbs reaches the bottom, you're dead.Gameplay8:42 AM: Arrived at the office. Popped in Bust-A-Move. Started playing the puzzle mode.9:31 AM: PSMOnline's Jay Boor arrives. Picks up controller. ~Here comes a new challenger.~9:32 AM: Vicious two-player battles ensue. Sarcastic remarks fill the air.10:35 AM: We should really be working. IGN's Julian Rignall, Craig Harris and Leiah Reich line up for ~pad.~ Complaints about skipping other players' turns are not uncommon.11:45 AM: It's virtually impossible to get pad. Too many people. Office crowded. Time to get to work. Matt arrives.12:35: Lunch.3:32 PM: Can't... resist... Looking for Bust-A-Move 2 cartridge. It's nowhere to be found. Two art guys are missing, too. Odd.3:45 PM: Found art guys at second capture station with our copy of Bust-A-Move 2. Lines form again.4:27 PM: Wooah. It's 4:27. Time to write some stories for the site.GraphicsYes.SoundYes.OptionsCredits (continues), match points and difficulty can be adjusted (three settings). Music and sound effects volumes (music test/sound test). Screen Saver timing can also be set. The game can be controlled via the analog stick or the D-Pad.Bust-A-Move 2 perfectly shows again: It's not all about graphics and sound -- gameplay makes a good puzzle game. Bust-A-Move remains one of the most addictive puzzlers since Tetris and if you at all care about puzzlers (and are willing to sacrifice many, many hours of your life), get it now! However, it should be said that it's time for the franchise to move on. Nostalgia aside, there is no reason why Bust-A-Move can't feature awesome Dolby Surround tracks, more features and some spiffy graphics effects. Considering the high price of cartridge games, I suggest you shop around until you find the game at a good bargain price somewhere (or for another console, if you have one). But make no mistake about it: If you like multiplayer puzzlers, this game will get its happy, pastel-colored claws on you and never let go.", "date": "May 23, 1998"}