{"name": "Yu-Gi-Oh! Duelists of the Roses", "name_review": "Yu-Gi-Oh! Duelist of the Roses", "ref": "https://www.ign.com/articles/2003/03/06/yu-gi-oh-duelist-of-the-roses", "text": "With games like Pokemon and Magic: the Gathering enthralling audiences on Nintendos, PC's, and local neighborhood streets, it was only a matter of time before the PlayStation 2's audience received a card battle of their own. Already a hit in Japan for well over a year before finally slinking its way onto American shores, Konami's Yu-Gi-Oh! Duelist of the Roses just happens to be the title matching up with the aforementioned heavyweights. And we have to admit; the game's premise is definitely surprising.   Retelling the infamous War of the Roses conflict of 1485 between the English houses of Lancaster and York, Duelist of the Roses is admirably based in factual history. Instead of the guns and bayonets used in the Battle of Bosworth Hill, however, this narration is played out with mystical card battles and gigantic summoned monsters. Not exactly how it happened in the formation of Tudor, but then again, Richard III isn't around to complain about it is he?   Chances are that if Richard III were still alive (instead of becoming the ancient dog food he eventually was), he'd definitely find plenty of things to grumble about. Despite the ability to choose which house you defend and a hefty amount of magical spells and fantastical beasts, Yu-Gi-Oh's gameplay never quite reaches the same level of quality that Nintendo's yellow rat does. Veterans of the physical game, pre-teen children, and fans of the television show, on the other hand, will probably get a big kick out of it.   Gameplay  Duelist of the Roses is one of those types of things that takes forever to explain but not long to get the hang of. In the most basic of terms, its structure is a modified ~Rock, Paper, Scissors~, with the appropriate categories built for the Yu-Gi-Oh rule set. Unless you play the card game with your friends in real life, however, understanding those rules can set you back a couple of hours while exploring them. To its credit, the game's tutorial (which clocks in well over twenty minutes long) does a terrific job of explaining all the different laws, premises, and other such things for newbies who haven't quite figured it out. As an added bonus, veteran players can simply press start and skip the tutorial altogether and move straight into the action. Even so, it's a good idea for everyone check it out at least once, as the rules in the videogame have been altered from the typical set to better fit its new skin.    Combat is entirely turn-based with a consistent 7x7 grid map serving as the battleground. Each player can summon up to five monsters on the map simultaneously, with powers and abilities determined by card type, location, posturing, offensive and defensive point values, square terrain, and an experience-based rank system that determines its power. Additionally, battle can end in four different ways: Reduce the opponent's Leader Points to zero (LP); populate all eight of the opponent's summon squares (or less where applicable); Have more LP than the opponent after all 99 turns have expired; or Summon the ultra-rare beast ~Exodia the Forbidden One~ for instant an victory. Whatever you do, try and avoid the draw -- it requires you to start over and can sneak up on you more often than not.   The most difficult aspect of Yu-Gi-Oh is memorizing the rule set and victory conditions; as the challenge of the game itself isn't too hard at all (even when selecting the weakened deck of the Serpentine Princess, the player's only true enemy is understanding how everything works). Once the knowledge has been acquired, it's only a matter of collecting a forceful deck of powerful strikers and spells before victory is yours. Granted, there are quite a few areas that will test your brainpower now and again (the battle with Keith comes to mind), but once you figure out their weaknesses it's smooth sailing. Besides, the instances where you'll have to strategize instead of muscle your way through see a very skewed ratio.    It's this simplicity and lack of effort that really hurts Yu-Gi-Oh in the long run. Why worry about which characters are on a meadow or forest tile when there's so many long-range attacks and spells that can pick your cards apart anyway? Why should you advance the low-level Skull Servants when you can just focus on the Magicians instead? Balance is a big issue in Duelist of the Roses, and the examples will be apparent the moment the game is begun.   That's not to say that the game doesn't have a lot to offer younger audiences. Lopsided as the combat may be, its structure and premise should serve as a solid breeding ground for aspiring strategists as they get older and graduate to more complex contests of thought (re: Final Fantasy Tactics, Iron Storm). Not to mention the fact that players will be able to build custom decks in and out of story mode, play games against their pals in two-person mode, and even trade monsters with their memory cards. Not a bad list of incentives at all.   Graphics  To say that Duelist of the Roses is pixilated would be an understatement; best compared to late-generation PS One titles of a similar nature, the maps and surrounding areas are uninspired and flawed with just enough texture detail to use a smidgen of the PS2's processing power. The monsters and spell cards are more appropriately done, with cool special effects and models representing the 800-plus attacks that the game has to offer. Unfortunately, the CG battle scenes used to illustrate the combat can get a little repetitive, even if some of them are truly cool.   Sound  Yu-Gi-Oh makes good use of its Dolby Pro Logic encoding when hooked up to an audio receiver, but the music and audio effects are rather paltry in comparison. Reminiscent of 16-bit Midi fare on the composer's side with little to no Foley to represent the action, the aural presentation is Duelist of the Roses is extremely disappointing. Luckily, there were one or two songs that caught our ear before all was said and done. But it just wasn't enough.Yu-Gi-Oh! Duelist of the Roses certainly isn't the second coming of card battle strategy games. It's easy on the brain and hard on the senses in a wide range of categories. Yet despite all of its flaws, there's still plenty here for younger kids to enjoy. Complicated rule set aside (let's face it, anybody who picks this up probably already knows how to play anyway), the kid-friendly setting and familiar themes are sure to spark an interest in an otherwise neglected videogame genre. Expect heavy sales and heavy requests for improvements in a sequel.", "date": "Mar 6, 2003"}