{"name": "All-Star Baseball '99", "name_review": "All-Star Baseball '99", "ref": "https://www.ign.com/articles/1998/05/27/all-star-baseball-99", "text": "Acclaim and Iguana are breaking new grounds again, only this time around it's not with Turok or even NFL Quarterback Club, it's with the latest addition to Acclaim's sports division, All-Star Baseball '99. Like QB Club before it, All-Star Baseball runs in high-resolution (640x480) mode, utilizing unsurpassed animation techniques and clever texture design for an end result that is nothing short of breathtaking. But the question remains: does the game play as good as it looks? Last year NFL Quarterback Club dazzled gamers with lush graphics, but came up short in the gameplay department, especially when compared to the likes of Madden 64. All-Star Baseball delivers on both accounts.  Features:  All 30 Major League Baseball teams and more than 700 MLB players. In addition to that, expect to see all the official MLB stadiums in beautiful rendered detail.  Hi-res graphics (640x480) A completely new, fully polygonal 3D graphics engine (enhanced of QB Club) Create-a-player option Roster management: trading, signing and releasing players, creating new teams, farm system prospects  Player injuries affect season  Track season-long statistics, including in-game highlights with color photos and updates  Rumble Pak support  More than 500 motions: catcher and baserunner collisions, wall catches, running throws, sliding catches, jump and pivot throws, broken bats, injuries, dives and kneeling throws. There is even more than 100 unique batting stances  Pitchers scouted by 1997 NL MVP, Larry Walker of the Colorado Rockies  Rain, dust, airborne hat and mask animations  Advanced in-game strategies -- hit and run, bunt and slash, the squeeze and suicide bunt, or the double switch  Multiple camera angles and spectator views  Play-by-play commentary by John Sterling and Michael Kaye  Seven game modes: Spring training, season, playoff, world series, All-Star game, home run derby and trivia game  End of season awards   Play Ball All-Star Baseball '99 is very much a baseball simulation game as opposed to the arcade thrills and spills found in Ken Griffey Baseball. What this means is realism. Everything in the game has been molded after its real-life counterpart, from the texture-mapped baseball players and rendered stadiums to the realistic game pace, batting system and stat tracking. If you're looking for realism then you needn't look any further.   That's not to say the game is boring though, as that couldn't be further from the truth. The baseball action, whether it be fielding or batting, is top-notch, fast and tight. The game's batting system is unique and unequaled. Both the pitcher and the batter are represented in the batter's box -- a blinking cursor for the pitcher and a circle for the batter. Players batting must align their circle (the angle at which their bat will swing) with the pitchers blinking cursor. Pitching the ball works exactly the same way, except the goal is to trick the batter and throw the ball when and where he can't see it coming.  This adds quite a bit of strategy to what is normally a simplistic task -- far more strategy than, for example, Mike Piazza's Baseball offers with its straight pitch-and-hit system.   Players can steal, get caught in a tag-down (which looks amazing), make diving catches, off-the wall catches, slides, get hit by the ball -- all the fun of the game is captured perfectly. The game features all the stat tracking, player rosters and so on, but it also includes a valuable option that is somehow missing in Ken Griffey Baseball: create-a-player. Players can customize their own athletes, including name, height, weight, team, number, skin color, eyes, face, beard -- just about everything, and then send them off to play in the big leagues. The only gripe we could find with the way the game plays is the fact that it moves at a slower, more realistic pace than Ken Griffey Baseball, which spits out play after play in a matter of seconds. Simulation junkies will no doubt appreciate the realism, but others may be a bit turned off by it.  Graphics The best looking baseball game we've ever seen, plain and simple. Mike Piazza and Ken Griffey Baseball look like 16-bit hand-me-downs in comparison. Sporting high-resolution graphics, excellent texture design and animation so realistic you'd swear it was real, there is nothing that comes close to All-Star Baseball in terms of visual finesse.  Imagine rendered stadiums that reflect changes in daylight, soft-skinned players with the faces of real athletes texture-mapped onto them, a selection of multiple camera angles, (including fish-eye batting, behind the catcher and over the catcher views), motion-captured animation, all with a fast framerate that never hitches. Not only is All-Star baseball the most beautiful baseball game we've ever seen, it's one of the prettiest games in existence. That said, the game does lack the little extras that add character. For example, when a player hits a home-run there's no real sense of achievement -- he just runs the bases. In Griffey, when a player hits a homer his teammates will give him high-fives when he approaches the dug-out. We're probably being picky, but minute details like this add quite a bit to the game.  Sound Though the game sports play-by-play commentary by John Sterling and Michael Kaye, the All-Star's sounds are rather uninspired and dull. Once again, we'll refer to Griffey, which has background sounds of ambulances, cheering crowds and music. All-Star has commentary. It's not bad, but it certainly could have been better.  Note that there seems to be a defective first batch of All-Star Baseball on the market that crashes when using certain memory paks and created players. Contact Acclaim's customer service if you're one of the unlucky early adopters.Despite its flaws, which lie mainly in character, I'm recommending All-Star Baseball over Ken Griffey and Mike Piazza Baseball. Why? Because it has tight, realistic gameplay, more options than the competition (including a create-a-player mode) and graphics that push the limits of Nintendo 64's hardware. Gamers shouldn't be asked to settle for anything less than a next-generation baseball game, and this is exactly what Iguana and Acclaim have delivered.", "date": "May 27, 1998"}