{"name": "Zone of the Enders: The 2nd Runner", "name_review": "Zone of the Enders: The 2nd Runner", "ref": "https://www.ign.com/articles/2003/03/10/zone-of-the-enders-the-2nd-runner", "text": "There were quite a few criticisms when Konami's robot action piece Zone of the Enders made its way to store shelves nearly two years ago. Professionally pounded because of its repetitive nature, brief playing time, and somewhat limited game design, ZOE never quite lived up to the hype that its constituents had placed upon it. Despite boasting North America's first playable demo of Metal Gear Solid 2 as an added bonus and an impressive dose of anime-inspired production values, Zone of the Enders was deadpanned as a universal disappointment; a game that could have been something great, but fell short of the mark several laps before the end of its race.   With 24 months of user feedback and industry denigration, however, Konami of Japan has returned to its universe with a newfound ambition: To make ZOE the game it was supposed to be. More characterization, a deeper battle engine, hidden bonuses, and a myriad of graphical improvements are only a smidgen of what the developers have done to improve on the original. And despite what nagging similarities Zone of the Enders: The 2nd Runner may share with the first game in terms of control problems, one point has to be recognized: ZOE2 is a damn fine videogame experience.   Story  An enormous aspect of that experience is the meticulously thought-out plotline. Taking place two years after the events of the first game in the year 2174, The 2nd Runner answers a lot of questions left by the original. As veterans of the previous title may remember, Zone of the Enders came to its conclusion when the Orbital Frame robot known as Jehuty was whisked away by the United Space Force battleship Atlantis. Following his battle with the powerful OF known as Anubis, the unlikely hero Leo Stenbuck fell into obscurity with plenty of mysteries and an obvious segue into this latest installment.    As the new adventure begins, the story switches to the perspective of Callisto Ice Miner Dingo Egret. While he's investigating a hidden source of the energy ore known as Metatron, his mining team is ambushed by the same villainous army from the last game; BAHRAM. Surprised to learn that the source of Metatron was actually the abandoned Jehuty, Dingo hops aboard the frame and races to save his friends to stop BAHRAM before they can take Jehuty themselves. After a lengthy tutorial and a couple of battles, the plot really begins to thicken as it's soon discovered that Dingo is an old acquaintance of returning BAHRAM fiend and pilot of Anubis, Nohman. Following treachery on Nohman's part and quick thinking by a busty Frame Runner called Ken Marinaris, Dingo becomes embroiled in a deadly race against time to stop Nohman from completing is invincible fortress Aumaan. If he doesn't, his lifeline could cease to function, and his death would quickly follow.   Happily the tale above is only the first half-hour in The 2nd Runner's Hollywood quality storyline. Populated with a score of plot twists, revelations, and appearances by characters long thought dead or missing, this new Zone of the Enders tells a much thicker story than the one that came before it. As an added bonus, there are even a couple of references to another Konami classic Gradius with the inclusion of a transforming spaceship/robot known as Vic Viper. It's an awesome inclusion for old-time gamers to be sure and just a hint of the type of cool goodies that the developers have in store as the quest unfolds.    Gameplay  In the realm of robotic videogames there are two distinct types of play that enthusiasts can choose from: action/shooter and straightforward simulation. Zone of the Enders: The 2nd Runner qualifies as the former without even so much as a hint of similarity to the simulation breed. A balls out action game in every sense of the word, its design and pacing isn't meant for the type of crowd that worships titles like Armored Core or Carnage Heart. Even so, the first in the series was plagued with an abundance of mechanical problems and gameplay issues that weren't appreciated by the faithful. Even though it was (and still is) one of the coolest looking games around.   If you're returning to the dance in search of an entirely different play engine, then you may want to turn around and go home. The 2nd Runner plays just as it did before -- with ascend and descend buttons, automatic targeting, and all the same attacks and maneuvers we had previously. The good news is that there have been plenty of refinements and additions to go along with it.   For starters, Konami has sophisticated the lock-on command. Originally limited to one enemy at a time, the new lock-on allows you to target dozens of units at once. Though it may sound like a technique by which to make the game easier, it's doesn't really work out that way. Instead of taking on one or two enemies as was the case in ZOE, your objective here is to face off against forty to fifty enemies at any one time -- i.e., you're going to need the multiple lock-on feature just to survive. It isn't a luxury.    Another new feature is the ability to customize your combos. In the past, pressing the Square button repeatedly would result in the same canned multi-hit technique time and time again. The 2nd Runner still follows that same basic formula for sure, but this time, altering the final button you push changes the way your combination ends. Tapping Triangle for instance will launch your opponent into the air while finishing with the X button smashes them into the ground. This simple change allows for more strategy than you'd first think, and the rewards in more restrained quarters are a real bonus. Grappling has been altered too, with a much faster response time and the ability to take advantage of different types of throws. You can even pick up debris from your surrounding area and use them as weapons -- and in some cases, it's absolutely necessary to do so. Failure to adapt to your surroundings and enemy's attacks can often prove fatal.   Of course, the biggest new addition is the new list of sub-weapons. No longer limited by a mere ammunition meter, the sub-weapons' usefulness is determined by a second energy bar known as the sub-gauge. Selected by using the L1 button and the directional pad (~Escape~ is no longer one of Jehuty's commands), Sub-Weapon attacks drain segments of the bar every time they're used. Though they're a lot more useful here than they were in the prequel and can prove to be one of your most trusted allies when taking on boss characters.    They're a lot more fun to look at too: The Geyser command stuns enemies temporarily via huge electric energy bolts while Gauntlet creates huge bits of static particles that cause double damage to anything it hits. Comet is a sparkling blue ball of plasma that hones in on anything you fire at, and Decoy creates a spectacular multi-figure Jehuty illusion that coerces your opponent into attacking a mirage of your alter ego. Though some of these sub-weapons are purely for novelty's sake (there are 14 in all), the majority of them will save your skin on more than one occasion. These certainly aren't meant as fillers in an otherwise packed control scheme.   Speaking of controls, the same awkward up and down movement from the original game has yet to be fixed. Not so much of a problem when fighting in close quarters, maneuvering Jehuty to where you want it to go can prove a huge pain in the mech. The indoor levels in particular make for some pretty frustrating navigation, as in unison with a bothersome follow-camera, it's oftentimes difficult to see where you should be headed -- the camera can unpredictably swing around 90 degrees for no reason at all and can prove more difficult to adjust on your own rather than wait for it to fix itself. It's this particular gameplay flaw that detracts from Zone of the Enders 2 which is pretty disappointing when compared to the fine angles of the original. Luckily there are enough positive changes to help this game achieve higher higher marks despite this issue: particularly when speaking of the bosses and puzzle solving.   Formerly limited to a basic retrieval system the new puzzles still aren't that groundbreaking, and still require the player to do a lot of fetching and section searching. What the developers have done different this time, however, is to require a lot more detective work for the answers. Instead of having Jehuty move from point A to point B, you must locate clues that point you in the right direction while receiving additional help from ADA (Jehuty's artificial intelligence). You can even have limited discussions with ADA by pressing L3 or R3 for yes or no answers to her questions. It isn't a groundbreaking touch to be honest, but at least it's a step above what it used to be.    Bosses on the other hand are a lot more menacing than they were before, with devastating combination attacks and plenty of power behind their every attack. Some of these monstrosities are extremely difficult to defeat and could take several continues before you can figure them out. In fact, the game as a whole is a lot more difficult, with a noticeable difference over the Japanese version in terms of challenge. To make things even more interesting, your unlimited continues come at a price -- all experience you gained prior to continuing is lost and you're reset to the skill you were before the level began. Talk about a proper incentive.   While we're on the subject of incentives, there are plenty of goodies that can be unlocked for beating your quest. The one-on-one fighting game that lets you pilot any Orbital Frame against another human opponent is probably the most interesting, but its unfortunately plagued with an abundance of camera issues and control problems that's worse than that of the main adventure itself. The other bonuses like extra Jehutys, EX Missions, New Game +, and several hidden endings and pictures are just the tip of the iceberg. Konami really tried to give its fans a little something extra this time around and it shows.    One last thing of note before we move on is the cut scene to gameplay ratio. In a similar predicament as Namco's recent RPG opus Xenosaga Episode I, Zone of the Enders: The 2nd Runner has a lot of storytelling moments that could bother players who just want to get down and dirty. Though simply pressing the start button can skip these cut scenes, several of the game's many missions revolve around what just took place in the video conversation -- making it a little pointless to skip the multitude of cinemas. On a personal note, these bits of plot didn't bother us in the least, but when weighed against the game's brief 10-12 hours of initial playtime; it could prove an annoyance for some.   Graphics  Hard as it is to believe, the visuals in The 2nd Runner have actually been improved upon. An already dazzling game with its technical limits held within a twitchy camera and the occasional framerate drop, ZOE has taken a big step forward in terms of graphical accomplishment. Still made up of exceedingly complex polygon models and astonishing scenery, the artists have upped the ante by increasing the number of onscreen objects, the particle effect count, and a move to cel-shading for its primary visual tool. Best of all, the awkward-looking 3D cut scenes of the first game have been transformed entirely to hand-drawn anime cinema. And the transitions as smooth as you could hope for.   Now one thing that should be clarified is how often the use of cel-shading comes into play. Utilized only when illustrating larger special effects like explosions or smoke, ZOE2 isn't really comparable to something like Jet Set Radio Future or Dark Cloud 2. Instead, it looks a lot like the first game -- only with cartoon-quality explosions and special effects. A technique used in a similar fashion with TDK's Robotech in 2002, the cel-shaded sections blend very well with the polygon robot models and do a good job of avoiding the stigma of using the technique just for the sake of using it.    The most impressive visual aspect of The 2nd Runner, however, has to be all the activity going on at any one time. Combining the aforementioned cel-shaded special effects, a plethora of particles, swarms of enemy machines, and subtle but effective lighting techniques, ZOE2 is pushing some serious processor muscle: let alone the pounding it's going to give your corneas. It's easily the most effective technological feat of programming we've seen since the busy worlds of Ratchet and Clank, and believe us when we tell you -- that's saying something.   Unfortunately all this visual candy comes at a price. As not only is there an occasional bit of slowdown in some of the more populated areas of Mars and the like, there's also the previously mentioned camera problem. Obviously confused by the perpetual battles in each and every level, it's difficult for the smart-cam to stay focused on where it's supposed to go. Even when you try and tell it what it should be doing with the right analog stick, the display still hangs and twitches at bizarre angles at the most inopportune of times. It's just too bad that these problems aren't limited to being a mere graphical issue, and instead become a hindrance for gameplay as highlighted above.    Sound  It's overly disappointing to learn that The 2nd Runner lacks the option to listen to the Japanese track as other recent titles have allowed (see .hack//INFECTION and Tenchu: Wrath of Heaven for examples). But then again, ZOE2 sports one of the fastest translations in recent memory (with the Japanese version released only weeks ago), making it a pretty forgivable omission; especially considering the fact that porting a game's native language is still somewhat of a novelty and not yet an industry standard (to Konami's credit, it took decades of fan outcry before anime importers caught on to the same practice). And while this fact would normally set our ~purist gamer~ genes blazingly afire, it doesn't cause too much of a stir with this latest illustration. As the English dub in Zone of the Enders is miraculously competent.   In fact, it wouldn't be any stretch of truth to announce that ZOE2's voice acting resides among the elite in the industry. Far surpassing the talent found in the more established Saturday morning cartoons and above-average dubs from anime subculture, The 2nd Runner blew us away with how realistic its actors really were. Granted there were quite a few unnatural pauses between character bits while the disc loaded the audio data, but that hitch aside, conversation and dialogue flows incredibly well. Especially of note are the game's two main protagonists: Ken and Dingo. As their banter is comparable to the idle chatter we hear in everyday life -- very natural and very believable.   Backing up the vocals with just as much reverence is the superb musical score. More emotional and dramatic than the Techno-heavy rhythm of the first game, Zone of the Enders: The 2nd Runner beautifully mixes electronica dance beats with a classical instrument infusion. The combination is marvelous and continues to raise the already impressive level of presentation even higher. Sound effects match-up well too, but are for the most part your typical mixture of laser blasts, explosion booms, and slashing metal clangs; with all of it recorded in the standard surround sound formula that's so popular in the majority of today's PS2 games.Zone of the Enders: The 2nd Runner is a dazzling masterpiece of high tech production. Obviously a much-loved project by its renowned producer Hideo Kojima and designer Shuyo Murata, ZOE2 has taken admirable steps towards melding cinema with gameplay. The action-enabled counterpart to Namco's Xenosaga Episode 1, The 2nd Runner isn't so much a videogame as it is an all-encompassing experience.That's not to say that it isn't without its flaws though. Still troubled by the same camera and manipulation conundrums that infuriated so many critics the first time through, ZOE2 is far from finding that perfect moment of controlled enlightenment. With the added sub-weapons and options for Jehuty to choose from however, along with a laundry list solid bonuses (including a tantalizing little mini-game that finds its inspiration from the NES classic Gradius), and some of the best graphics you'll find from any system on the market, Zone of the Enders: The 2nd Runner is a worthy candidate for our fabled editor's choice award. And now that we think about it, we're pretty confident that you'll find it an easy choice for your library as well.", "date": "Mar 10, 2003"}