{"name": "A Tale in the Desert", "name_review": "A Tale in the Desert Review", "ref": "https://www.ign.com/articles/2003/03/11/a-tale-in-the-desert-review", "text": "A Tale in the Desert (ATITD) has completely taken me in.  What's even more amazing is that it captured my attention when I was very involved in another game.  ATITD is unlike anything I've ever played before.  It's an MMORPG but there's no combat.  Instead, you work to unlock technology and learn new things.  There are different disciplines, each with different tests to take and pass.  You work to build things great and small - from a chest to a tent to a master forge.  There is a legal system that is controlled by the player base.  I think this game has something for everyone.  People looking for PvP may not be as impressed with it as I am.  However, this game is a free download, I suggest even they give it a try.   After downloading the game from the official site (https://www.atitd.com) and patching, you enter the story.  Pharaoh has proclaimed his Egypt is perfect, but a mysterious Evil Stranger disagrees.  He puts Pharaoh to the test and challenges him to have his people pass tests in seven different disciplines.  The Evil Stranger follows the progress of the citizens of Egypt and will do his best to sabotage their efforts, but in very subtle ways.  Eventually all players will have to overcome his interference and build a Great Work in each Discipline.   You're not left to flounder on your own in this game.  When you first log into the game, you are given the ability to find a mentor.  I'll use my mentor as an example.  When I first entered Egypt, she took three other newcomers in addition to me under her wing.  You arrive as a peasant and are given your very first goal: to become a citizen.  There are several steps to achieving this and your mentor will guide you through them all.  For example, at first, we gathered slate and took it to the School of Architecture.  We paid 2 slate as tuition and learned stone blade fabrication.  From there, we were able to make stone blades and learn carpentry.  After several more steps, we all made bricks and became citizens.  Through all of this, our mentor was there guiding us.  I was eventually able to build a shrine honoring her, something I was excited to do after all of her help.   So, now that you're a citizen of Egypt, what do you want to do?  Amazingly enough - you can do whatever you want.  No, this isn't where you go to character creation and choose a class and distribute your skill points.  There are no set ~classes.~  You can explore all of Egypt looking for rare gems and minerals.  There are people who are trying to become great political figures.  We have some in our guild who spend their day trying to find the perfect recipe or the best spot to grow cabbage.  You can be an architect, a trader or an artist.  You can even spend your day just wandering around, looking at (and judging) other people's sculptures. Will you or are you playing A Tale in the Desert?    One of the things that first attracted me to this game is your ability to both have a life AND play the game.  If the doorbell rings, that's fine, you can go answer it.  The day I decided to quit Everquest was the day that I had been sitting at my computer for 6 hours straight and had accomplished absolutely nothing.  In this game that will never happen.  You can play for ten minutes and honestly get something done.  Obviously, the more time you spend in the game, the faster you'll progress.  However you can, and will, progress no matter how much time you can devote to it.   The in-game chat system is great.  You have your main channel, a channel for system messages, a channel for your guild (or guilds as you can join more than one) and channels you can open for anyone you want to send private tells to.  What is even better is the in-game email system, EgyptMail.  If someone's not online, simply send them mail and they'll get it next time they log in.   The cooperation in this game is amazing.   Never before in any MMORPG have I felt more like I was part of a team.  I've always been in great guilds, and we've gone on raids, done epic quests, but never anything like this.  In Egypt, we work together to build great things.  Just today, we built an obelisk for one of our guildmates.  It took two hours of everyone making bricks, but it was fun and well worth it when we saw the finished product.  Someday, we may even build a pyramid.    Every task in Egypt seems to be building towards something - like gaining experience but so much better.  You collect grass and dry it into straw.  Perhaps that straw will be used to lure a camel or combined with sand and mud to make bricks.  The bricks could become part of a grand monument or used to expand your guildhall.  The possibilities are endless and as we research the technologies available at the Universities, new ones are unlocked.  The leveling treadmill is eliminated and even the most repetitious act seems fun, because you know what the rewards will be.   Today I decided to take a bit of a break from guild projects and initiate into the school of Architecture.  To do this, you have to first learn project management.  Like any good school, the School of Architecture requires tuition.  After I processed enough flax for 2 canvas and 6 rope I ran to the school and paid them to teach me how to manage construction sites.  Then I ran back to camp and with the help of a few guildmates made the rest of the rope, canvas, boards and nails I needed to construct my tent.  Finally, I put it all together and lightning struck!  I was now an initiate!   There are six other schools that you can study at.  Body, Thought, Worship, Leadership, Conflict and Art.  Each  discipline has vastly different tests, all fun and challenging.  Deciding which path or paths you want to choose may be the hardest part of the game.  I'm still currently undecided but there is plenty for me to do.  I've learned how to dowse for minerals and have spent a great deal of my time looking for rare ores and gemstones.  If the guild is in need of board or bricks, I'll gather wood or straw to make them.  And every night (game time) between 2 and 4 am, I hunt for rare mushrooms.   I have really enjoyed my guild, but if you're not interested in a guild, going solo is very viable.  You won't progress as fast in most things, like you certainly won't be the first player with a paper press.   But you will be able to work on whatever is on your personal agenda and not on your guild's, giving you tremendous freedom.  Most solo'ers specialize in one thing and trade for whatever else they need.   Don't like something?  Fine, change it.  Think someone's name is inappropriate or offensive?  Do you think that your flax should be saved for you even if you leave it all night?  Alter the game world by proposing a law and seeing if the rest of Egypt agrees with you.  It's amazing how much the developers are willing to change based on the desires of their players.   The graphics are good.  Not amazing, but good.  If I had to pick one thing that I didn't like about the game, it would have to be the graphics.  I'm a little disappointed in the lack of detail in my character's face, buildings that you can't go inside and a few other things.  The sound is disappointing.  You hear footsteps when you run and a few ambient noises, but not much else.  It is best when turned off and listening to your own MP3's instead.This game is incredibly ambitious and delivers more than I expected.  There are so many different things to do and so many different ways to play the game that I cant imagine anyone getting bored.  The graphics and the sound effects are slightly lacking but the rest of the package more than makes up for it.  It is a game where you use your brain and have fun.  You truly work as a team to unlock the great mysteries of technology.Download this game and give it a try.  There are some things that you cant do without paying, so pay the $13.95 for the month and experience the game fully.  Its still cheaper than any game you would have picked up at the store and will give you hours and months of enjoyment.", "date": "Mar 11, 2003"}