{"name": "NASCAR Racing: 2003 Season", "name_review": "NASCAR Racing 2003", "ref": "https://www.ign.com/articles/2003/03/11/nascar-racing-2003", "text": "When I read that the racing gurus at Papyrus would no longer be making NASCAR sims, the first thing I did was dig for corroborating evidence. I just could not believe they would abandon their cash cow. Unfortunately for them, either EA outbid them, or for some other financial reason Papyrus couldn't continue the way they were, and thus we are faced with the reality that NASCAR Racing 2003 is their last such title.  So they ~pulled out the stops~ as designer Rich Yasi put it, to give us the best possible experience, and set the bar as high as possible for EA.   If I had to bet, I'd say most readers of this review have likely purchased an earlier version of this series, and are wondering just why you should buy it AGAIN.  For those of you who have not purchased one of these titles, or are perhaps played a different NASCAR game and crave a deeper, more involving experience, you've come to the right place.   This title has always been first and foremost about trying to produce the most realistic simulation of stock car racing ever.  Its success in this regard has drawn praise from NASCAR drivers themselves, but more significantly, these guys don't just drive the car for promotional dollars, but because they feel it's realistic enough to actually help them stay sharp for the real thing.  That's high praise indeed.   Because this game is primarily about the physics model, that's where I'll start.  The 2003 takes the Papyrus physics model to a whole new level of accuracy, and for the first time in this series, I felt like I truly had to focus on just driving the car, not just worrying about racing the competition.  While I did the obligatory quickie race at Daytona, things really got interesting when I took the car to Atlanta, where lifting off the throttle for turns is required.  The first indication of the newly enhanced physics model is how much the car pulls to the left down the straights, because of the way the car is set up to turn left more easily.  I had to steer to the right to go straight, so much so with the included setups that I actually exited the game to recalibrate my controller.  I just couldn't believe that for the first time I couldn't more or less relax my hold on the force feedback wheel down the straights.  This will vary from track to track and from setup to setup.  For example the ~easy~ setup at Daytona hardly pulls left at all.  On the ~fast~ setup the left pull was so severe that I was STILL turning the wheel slightly to the right in the middle of the corners!  Regardless, it is a welcome sign to see that the cars seem to behave accurately here.   So, what about the graphics?  Papyrus has never really had people gushing over its NASCAR graphics.  Other titles have been flashier. This year Papyrus has made several improvements.  When I max out everything on my GeForce 4 the graphics look very nice, indeed.  The lighting model has been improved everywhere, so you can see reflections on cars and trackside objects, such as shiny mirrored buildings around the grandstands.  I also really loved the way the overhead track stadium lights would rhythmically brighten my metallic in-car dash.  Realistic shaded skid marks appear where cars lose grip and stay on the track.  The whole thing is just eerily real.     The cars also bounce and bob more realistically along the uneven parts of the track, although there is a bit of glitchiness with shadows in that when the car squats low, sometimes it seems to dive into its own shadow and that looks a little funny.  If you have a GeForce 4 you can set the texture filtering quality to extreme, otherwise, the car textures look a little 'fuzzy', and that seems to make a big difference in image quality.  I was all ready to knock the game for this until I discovered this setting.  It didn't seem to hit the frame rate much, if at all, on the GeForce I have.   But all the glitz in the world matters little if the frame rate is choppy.  With everything on in a 30 car field even sitting still waiting to come around for the pace lap, my frame rate dips into the mid-teens, and that's on a Pentium 1.7Ghz with the GeForce4 4400Ti.  So those of you with faster Pentiums or better GeForces should be able to turn nearly everything on and enjoy the amazing graphics.  For the rest of us, turning a few of the more expensive things off will give a compromise which still looks pretty darned good even with a full field. One other important note is that Papyrus sims tend not to be ~one year and out~ products.  Because they went so far at the high end, this game will look even better as you upgrade your computer, so it was good that the Papyrus people aimed high.    For graphic effects there have been some additions worth nothing. Probably nothing will be more noticeable than the grime that can accumulate on your windshield.  No helmet tear-offs here!  This option can be disabled, or you won't even notice it if you're not in the car (I know some people compromise by going to an 'over the hood view' which is certainly present).   Also you'll notice the car bumps up and down along the tracks more visibly from within the car, and you find out very quickly that the real tracks aren't glassy smooth as it sometimes has seemed in the past.  I can personally attest to how realistic this is from having been a passenger in a Winston Cup car for 3 high speed laps at Daytona.  It's bumpy enough to be scary.  You wonder how the car stays on the road with all the bumps!  Papyrus did a great job here.  Not only is this a visual effect, but during some bumps, such as one nasty one on the back straight at Lowe's, the revs will suddenly spike up as your rear tires skip over it.   A fully rendered large center mirror is enabled showing not just the cars behind you but all the bodywork behind your seat.  You can also see some of the rear left window and see cars moving up alongside with it, just like the extended mirrors the pros use.  Once you're driving the immersion is incredibly absorbing.  The way the cars move around you and race seems utterly realistic, both while driving and during replays. The cars ahead of you even exhibit flashing of backfiring from their exhaust pipes as they slow for turns.   The roar of the cars and the sounds of your spotters are perfect. Immersive is the word that just keeps coming to mind while I drive. There's just nothing to spoil the illusion, and it's easy to forget you're playing a game, especially with a good force feedback wheel and pedals (which no sim-fan should be without these days).   So, the graphics and sound and physics are great, but Papyrus has often forgotten one very important component to selling their games to a large audience:  the newbie.  It seems that if you weren't as religious as they were about realism and difficulty, then you could just forget it, or go buy a competitor with a more forgiving experience.  There has traditionally been an arcade setting.  However, Papyrus has gone beyond this and made more options to make newcomers happy.  First and foremost  are the video lessons.   Using store replays from in-car, a video  driving lesson with popup text boxes and audio voiceovers help you understand how to drive effectively.  Even if you've done some racing, it's good to watch these, as you might pick up on something you could do better.   For newcomers, it's just the thing to help them understand the way stock cars at high speeds work and how to build good driving habits which will reduce the frustration.     Unfortunately the interactive track guides, which debuted in last year's version, seem to be gone. Bummer.  I really liked those and I think newbies would still benefit from them.       To make the actual physics model easier to come to grip with, you will get options such as stability control, traction control, and anti-lock braking.  Damage can be turned off or to a more forgiving setting so that shunts don't end races as often in real life.   But the biggest thing that they added for most people (and I include myself here), is adaptable AI.  If you check this box, the game will start you at 70% difficulty.  This is a piece of cake for experienced racers, but it lets anyone just hit the track and start racing competitively.  The AI will be driving at this speed but as the race wears on will adapt itself closer and closer to your speed by raising or lowering this 70% percentage.  When you finish the race, you'll see that the grayed number next to the ~Adaptability~ checkbox will have changed up or down.  After my first race at one track, it was up to 84%.  After my second race, it was up to 96%.  In addition to ensuring you get to live in the midst of traffic all day instead of being out of sync with the pack, you also can see your improvement.  This setting is stored on a track to track basis.  So you don't need to worry about becoming an expert at Atlanta only to have your clock cleaned at Martinsville!  I did notice that the first few races, the AI falls back steadily, then makes two or three lunges at you, particularly if you're leading the last lap.  It's as if they suddenly find a bit of speed, take a potshot at you, and then fall back if you hold them off.  Later on things even out a bit.    Of course, the old method of just manually setting a difficulty for a track is there, too, for people who know what they want or believe that part of having fun is getting your clock cleaned at 100% difficulty until you get good enough to be competitive.   The AI will race multiple lines around the track, not just the low groove, and sometimes they will stay there long enough to make you wonder how you'll ever find a gap through it.  Newbies will quickly see that just diving under a car the last instant is a recipe for a wreck, and learn how to time their moves to get under a car early enough, or pick up the throttle early enough on the exit.  You can drive around some cars on the outside, and others will tend to drift high and leave room for you low.  It keeps the game fresh and interesting, making each encounter a puzzle to solve at high speed!   They also sometimes cause wrecks on their own, which is highly refreshing, as usually every yellow that comes out is MY fault!  ALL the NASCAR rules seem to be implemented, from speeding in the pit lane, merging into traffic before the back straight, passing the pace car, etc.   Some nice extras include driver ratings which are freely editable if you think an opponent's personality needs tuning.  You can alter their aggression, consistency, finishing, qualifying, road course, short track, speedway and super speedway rankings.  You can also set the quality of their vehicle and pit crew!  You can create and save driver/car rosters to race against, and a full paint shop is supplied as it has been for several years now.  You can do 3D previews of your car and import and export your paint template.  You'll also find on the Internet that rosters, rankings and car sets are downloadable to keep you current with each new season.  I'm sure the Busch cars will also be available if they aren't already!   You can also choose your own car and your preferred multiplayer car (this was a longstanding gripe since online play became available!).   I spent some time playing with the paint shop program, and was able to import some artwork to make my 6 year old daughter a Disney ~Beauty and the Beast~ theme car which I think came out very nice (see the  screenshots) and shows just how easy it is to make nice looking cars. It didn't take very long, and features like the ability to import custom decals, create semi-transparent overlays, and paste manufacturer templates on top of your car's paintjob just add to the professionalism of the package.      Multiplayer is also supported through the freely accessible Sierra network.  As has been the case since NASCAR 4, you can drop in and race up to a full field of opponents at any time.  There are track ratings you can use to enable yourself to play with faster and more polite racers.  As usual, the downfall of this system is that when you first get out onto a track, you'll find that just completing two laps without wrecking or driving into a wreck is the major challenge, not racing. This hurts your safety score and your track ranking, and keeps you out of the safer races.  It's best to find a league online with a password and rules that eject unruly or unsafe drivers.  If you show them that you'll drive clean and responsibly you'll have a safe, fun experience racing against other likeminded people, rather than juveniles of any age which think that running into other people is 'fun'.Although I could sit here and write pages of little nits about this game or what they might have done even better, I end up feeling that these are nits.  Everything they've always offered in this game is here, plus everything they could cram in that we've been wanting for years.  It's almost time to stop thinking of this as a game and just as a flat out simulation, a tool which will be useful for years to come and a very riveting hobby to engage in, alone or with friends.EA has made some promising strides with their NASCAR Thunder franchise, and with ex-Papyrus designer Ed Martin running the show there, I find reason to be hopeful that with some time and effort, EA can eventually match and exceed this effort.  But barring a major revolution, NASCAR Racing 2003 will be the reference work for NASCAR sims for the forseeable future.  As virtual drivers of all experience levels can be happy they left us not with a whimper but with a bang.  I heartily recommend this title to anyone who wants to find out just what is so fun about working your way through traffic at 180 mph.", "date": "Mar 11, 2003"}