{"name": "Major League Baseball Featuring Ken Griffey Jr.", "name_review": "Major League Baseball Featuring Ken Griffey Jr", "ref": "https://www.ign.com/articles/1998/06/03/major-league-baseball-featuring-ken-griffey-jr", "text": ", the Angel Studios developed, Nintendo published baseball title has been a long way coming. In fact, the game has been one of the most anticipated Nintendo 64 titles for years. Surely then, this, without a doubt, is the baseball game to get for the console, right? Well, that all depends on what, exactly, you're looking for in your baseball game. If it's arcade-style and fast-paced baseball action then Griffey is recommended over the competition, which is Acclaim's All-Star Baseball '99. However, if it's a realistic baseball simulation you seek, as we do, then the Iguana developed, Acclaim published ball-game is the way to go. It all comes down to personal preference. That said, let's take a look at Griffey.  The facts   Official MLBPA licensing; more than 700 official players Season stat tracking; team, players, schedules, injuries, scoring.  Three skill levels, two different batting styles (arcade and classic), alternate running styles Dynamic camera angles Multiple gameplay modes, including exhibition, season, world series and home run derby EEPROM data management Commentary by Ken Griffey Rumble Pak compatible Two-players simultaneous; four-player home run derby mode   Play Ball! Ken Griffey delivers up arcade-style, fast-paced baseball. Batting, fielding, pitching all happen in the blink of an eye. As an example of just how fast this game moves along, once a pitch is thrown another can be pitched over the plate within a matter of seconds. An inning is typically over with in less than a minute, sometimes less than 30 seconds depending on how skilled a player is or isn't.   Like All-Star, Griffey utilizes a unique pitching/batting system that adds quite a bit to the otherwise simplistic process. The oncoming ball is represented by a blinking cursor that fades in and out of the batter's box. This cursor coincides with the pitcher's heartbeat. Depending on how fatigued a pitcher is, the cursor will be visible or invisible for longer amounts of time. The batter is represented by a round circle that must be aligned with the pitcher's cursor to hit the ball correctly. The problem is that the batter only has a few seconds to see what direction the ball is headed in before it blinks off of the screen and an educated guess must be made. The system enables quite a bit of strategic gameplay for both sides of the ball.   Once the ball is hit a corresponding shadow shows players where it will eventually fall in typical videogame baseball fashion. All of the baseball dives, off-the-wall catches, side-armed throws, toss-outs, tag-downs -- they're all in the game and they all take place extremely fast. The game is entirely offensive though. Once a ball is hit there's a 90% chance that players will end up on first base with no problem at all. It's not at all difficult, in fact, to round-out a double nearly every other hit. A wide in-field gap can easily be penetrated regardless of what fielding configuration players decide upon. No matter which way you look at it, this is a batter's game. Players looking for a realistic, well-balanced offense and defense may find themselves disappointed. But those who would prefer a painless, forgiving hitting system will no doubt love Griffey.  Of course, the game features nearly all the options present in All-Star Baseball, including stat-tracking, player rosters, multiple gameplay modes and so on, but it is lacking the all-valuable create-a-player feature for reasons unknown. Once again, this will only matter to die-hard baseball fanatics.  Graphics Griffey's graphics are a definite improvement over GT Interactive's Mike Piazza Baseball, but they can't hold a candle to the eye-candy of All-Star Baseball and that's putting it mildly. The game's polygonal 3D engine sports players with long, awkward arms and legs, and thin bodies that constantly pitch back in forth while batting. While the players aren't necessarily ugly, the field and stadiums surrounding the action definitely are. Angel Studios has used just about every Nintendo 64 filter known to man, including anti-aliasing and excessive dithering, for a final effect that is both blurry and lacking detail. Character animation ranges from excellent to awkward, with players that run in stiff, jerky motions. On the other hand, the game does feature an excellent dynamic camera system which highlights the game's action. For example, if a ball is popped up, the camera will shift to a view just behind the fielder's head and players will actually get to see the ball falling down into his glove. It's very well done. We would be lying, though, if we said that we weren't expecting a little more graphic finesse for a game that has been in development for so long.   Sound and character What Griffey lacks in the graphics department it makes up for in terms of sound, with atmospheric crowd cheers, organ music, fireworks, booing, commentary and even city noises like ambulances driving by. The character of the game is further enhanced with home-run animation and cheering that are missing from All-Star Baseball.   All things considered, Griffey is a graphically stale, but solid baseball game that emphasizes fast, arcade gameplay. The game moves at an amazingly quick pace that is sure to keep arcade-junkies happy, but it lacks a few options, namely a create-a-player mode, that keep it from a higher score. If it's fast gameplay that you're looking for then you won't find any better for the console. If realism is your thing though, as it is mine, then I recommend you give All-Star Baseball a try first.", "date": "Jun 3, 1998"}