{"name": "MLB 2004", "name_review": "MLB 2004", "ref": "https://www.ign.com/articles/2003/03/14/mlb-2004-2", "text": "If Ernie Banks played MLB 2004, he'd change his catch phrase from ~Let's play two~ to ~Let it rain~. From gameplay to graphics, MLB lags so far behind its competition that if Major League Baseball is really looking to start contraction, they can start it right here.   The game's claim to shame is that it's the only baseball title released this year that actually looks like it belongs on the PlayStation One. Then again, there was actually PlayStation One baseball games that played better than this. It's one thing if the game looks bad but at least plays somewhat decent. But when the ~Magic Bullet~ physics engine is so wacky that balls mysteriously turn--in mid-air--and move toward fielders, you know something is definitely wrong.   Gameplay  In the first game I played, I threw a no-hitter. Sure, it was only on Veteran level, but still, I think that's the first time I've ever picked up a baseball game and fired a no-hitter in my initial attempt. I juiced the difficulty up to All-Star, and even though I failed in my bid for back-to-back no-no's, I still had a complete game shutout; this time only giving up three hits. After playing with MVP Baseball's excellent pitching system, MLB 2004's tossing ideal proved to be extremely flawed.   The reason? There are no meters to master and every pitch looks like it's thrown at 200mph. Curve, slurve, fastball, none of it matters unless you throw a changeup or knuckler. As no matter what it is that you throw, it comes down the pipe as heat. A pitch traveling 75mph looks like a pitch traveling 95mph. Not only that, but you can perfectly place the ball wherever you want. Spot the slider on the outside corner and it's strike one. Move the splitter low and inside, strike two. Spot the fastball high and inside, strike three. Good control, not so realistic, especially in the ninth inning when your starter is still shooting sliders toward the plate at 93mph and perfectly hitting every corner.    To make matters worse, it doesn't matter how fast you tap the buttons; the pitching experience in general is like a human rain delay. It's as if the game needs to load between each pitch and it won't let you advance until it's ready. Now if you think that's bad, wait until you're at the plate and waiting for the computer to pitch it to your hitter instead. He'll go for the rosin bag, step off the mound, smack his glove, and do whatever it takes to delay the pace of the game. And though you can tap X to try and speed through the process, it makes the animation jump back to where the pitcher is looking toward the plate, and whatever you were doing (practice swings) stops and automatically places the bat back on your shoulder; An awkward, choppy sequence for a game attempting to imitate TV-style presentation.   Speaking of presentation, each game begins with a cool panning sequence of the home team's stadium, and ends with a replay of the Play of the Game. The Play of the Game replay is so simple a concept, yet so brilliant; I can't believe all sports games haven't adopted it into their repertoire. What's funny, though, is that in between the promising opening and the spectacular end, the game itself is really lacking in terms of mimicking a televised game. While there are replays, there is no slow motion option, and you can only watch the replay from the exact angles the original play was seen. So if a play looked questionable the first time, you'll never really be able to figure out what the call should've been, because you can't review the play from a better view.    The replay did come in handy during one of the strangest sequences I've ever witnessed in a game, though, just so I could prove to people that I wasn't hallucinating: On a ground ball toward the third baseman (Troy Glaus), the ball was no where near the fielder's glove when it actually took a left turn in the air and jumped into Glaus' mit like the leather was some kind of voodoo magnet. Then, as Glaus went to throw the ball, David Eckstein started sprinting toward Glaus and almost ran directly into the big man as the ball was released. To top things off, the throw was high, and even though the first baseman jumped to make the catch and the batter clearly beat the throw, he was called out. Hmmm That couldn't have just happened like I thought. Actually it did. I only wish I could've seen it in slow motion.   Then again, the madness  likes to call gameplay had just begun.   The next time I played, I decided to spark the old Giants/Dodgers rivalry by intentionally plunking every Dodger in the head with Jason Schmidt fastballs. Four straight pitches actually traveled through Kevin Brown's back but that's another story entirely. My experiment was intended as a test of the animations of players as they rounded the bases. And to my surprise none of them ever touched home plate when they crossed it. So I did it again, and again, and each time, not one Dodger touched the bag as he trotted home. Maybe they were too woozy from getting drilled in the head.   The more I played MLB 2004, the more I became frustrated. Running the bases is by far the worst experience of any of the games in the genre this season. To run to third, you press Square and left or up. If you're running home and want to return to third, press Square and down or right. But if you're advancing home, you press X and left or up. Confused yet? I understand that each button corresponds to a different base, and that's fine, but try remembering the base and those directional pad movements during a rundown. It's natural to press down to go home, not third, and left to go to third, not home. MLB succeeds in making the obvious confusing by forcing people to think instead of react, something that's murder when it comes to playing sports and in this case, sports games.   Hitting the ball, though, isn't as frustrating as it is easy, especially against the computer. In my first two games, Barry Bonds went 7-8 with 6 home runs. Now, Barry's good and all, but no body's that good. You use a simple cursor (although you can play without the cursor if so desired) to smack the ball, and MLB does a cool thing by letting you try to guess your opponent's pitch. Guess right and your cursor will expand; guess wrong and it shrinks. A nice touch, but not really needed as you can basically smack the ball at will once you get used to the blazing speed of the pitch. Especially since the location of each pitch is blatantly displayed as the ball is delivered.   MLB's one point of redemption is the fact that it sports a few unique features that aren't found anywhere else. The best by far is the game's Spring Training mode where you create a player and send him to spring training in hopes of making the team. If you get called up to the big leagues, you get additional attribute points to increase your player's skills. Talk about pressure. When your player steps up to the plate and you know you have to get a hit to advance to the next level, you can actually feel the shirt collar tighten around your neck. Other cool features include Franchise and Manager modes, both one and two-player seasons, a Home Run Derby, and a Fantasy Draft where each player is given points (like salary) and you are forced to draft players that fit in your budget. The Draft is a great lesson in understanding the economics behind the game, even if it's not real money.   Graphics  If MLB wins any type of award, it should be for worst looking baseball (and possibly sports) game of the year. It's the type of offering that makes High Heat look like fin art, and that's really saying something. The whole muddy appearance, from the players to the field, is so dull and drab that it seems like the sun never shines in baseball. And that's not even supposed to be a metaphor.   The character models are all right and the animations are decent, but when compared to the rest of the game's horribly unexciting textures, it's not a saving grace in the least. Not to mention the fact that the animations we mentioned earlier take eons upon eons to play through. Why not just hurry up and throw the ball already?    Sound  Dead air. There are people in the crowd, players on the field, and announcers in the booth, but no one says a word in what seems like forever. There are maddening stretches of time where there's nothing but silence throughout the stadium. Similarly, there are other moments where the announcers finally speak only to make me wish that they hadn't. Hit a long fly ball to the outfield and listen as Vin Scully proclaims: ~This should invoke the infield fly rule.~    And even though the stadium appears packed, it's like they've all been gagged. Baseball is supposed to be fun, so why isn't anyone cheering? Oh yeah, they're watching the game I'm playing.   When six baseball games compete on the same system in the same season, and you're the worst of those six games, it's time to hang up the cleats. If the top baseball game doesn't sell as well as the second or even third best-selling football game, how many games does the sixth best baseball game sell? Can't be enough to sustain a series, can it? Can it?   Sales aside, MLB's a disaster. It's like sending Jose Mesa in to pitch to Omar Vizquelyou know nothing good is going to come of it. Unlike the Mesa/Vizquel showdown, however, MLB's not something you'd actually pay to seeif you'd even want to see it at all. When six baseball games compete on the same system in the same season, and you're the worst of those six games, it's time to hang up the cleats. If the top baseball game doesn't sell as well as the second or even third best-selling football game, how many games does the sixth best baseball game sell? Can't be enough to sustain a series, can it? Can it?Sales aside, MLB's a disaster. It's like sending Jose Mesa in to pitch to Omar Vizquelyou know nothing good is going to come of it. Unlike the Mesa/Vizquel showdown, however, MLB's not something you'd actually pay to seeif you'd even want to see it at all.", "date": "Mar 14, 2003"}