{"name": "MotoGP 3", "name_review": "MotoGP3", "ref": "https://www.ign.com/articles/2003/03/18/motogp3-3", "text": "Without a doubt, Namco has a reputation of making quality games. They also have a reputation of making incremental upgrades to their franchise sequels. Just take a look at the Tekken or Soul Calibur games. Heck, let's even throw Pac-Man in the mix. While there were undoubtedly improvements made with each iteration of the said games, there was hardly a monumental innovation to be found; the core of each game remained true to its predecessors.    The MotoGP series, thus far, has dared not stray from this tradition. The first two games were so similar that one wonders why a sequel was even released. Now, Namco has released MotoGP3. Does the third game in the well-known motorcycle series break free of Namco's usual convention, or does it once again follow in past footsteps and rehash the same old game? Actually, it does a little of both.  Gameplay MotoGP3, like the prior MotoGP games, is based on the MotoGP, the premier motorcycle racing tour that takes racers around the world as they compete for the gold. A group of twenty-one riders lock heads as they race around hairpin turns and continuously break and accelerate, finding the perfect balance of speed and, well, balance.   Like previous MotoGP games, MotoGP3 offers up an Arcade, Season, Challenge, and Time Trial mode. Arcade mode lets the player set up a single race on any track, under conditions to your liking. Besides choosing a track, the you can also select the type of motorcycle, the weather (wet or dry), the number of laps, difficulty level, transmission, and whether simulation mode is on or off. The simulation mode is of significant importance. Turning it off makes for a more arcade-like experience; the motorcycle can lean far left/right and not have worry about falling over, and wiping is out is especially difficult. While this may seem like the game is babying the player, it's only after you turn simulation mode on that you see its appeal.     Turning simulation mode on obviously creates a more sim-like experience, the biggest distinction being that leaning too far to one side will cause the rider to topple over. While much more accurate and realistic in terms of motorcycle racing, only those who have an extremely firm grasp on the game's mechanics and physics should even attempt playing with simulation mode turned on. It's very unforgiving and hard to master, just like real motorcycle racing.  Also found in the general settings of each race are motorcycle options. While buying new parts and upgrading the motorcycles is a feature left out of the game, you can adjust the gear ratio, bike response, engine output, braking, and whether to use 17 inch or 16.5 inch tyres for each of the forty odd bikes. The MotoGP series would benefit from having a deeper bike customization system. Not only would it make each bike a little more personable, but the replay value of the series would be greatly increased. Maybe next time.      Making a return is the Challenge mode. In MotoGP3, there are one hundred separate challenges that typically ask the player to either beat a particular rider, or complete a track in a given amount of time. Beating the challenges will open up a ton of unlockable content, from real-life photographs to hidden characters. But these challenges are no piece of cake. To beat them will require a lot of dedication and practice. To make things worse, each challenge has three levels of requirements: Bronze, Silver, and Gold. Achieving Gold in any of the challenges is sure to test to your skill (and your mental stability), but the goods are worth it.  New to the MotoGP games is a Legends and four-player split-screen mode. The Legends mode pits you against four legendary riders who've all been former champions in the MotoGP. This mode plays out similarly to the Arcade, only there's less riders in the race. Oddly enough, the races actually seemed to be easier in the Legends races than in the other modes. The four-player mode is also a significant addition. Though online play would have been a much sweeter deal, the lack of four-player split-screen games makes MotoGP3's seem that much more enticing.    Probably the most substantial change in MotoGP3 is being able to individually control and use the front and rear brakes. Seemingly a frivolous addition, the independent use of the brakes makes for a considerably altered playing experience. Using the rear brake is advantageous when steering your bike during drift, though it will increase braking distance. On the other hand, using the front brake is comparable to full braking. It can be used to adjust braking distance during full braking, and in a game that focuses heavily on braking distances, having independent control of each brake can mean the difference between first and second place. The player can also use forward/backward weight shifts, coupled with brake control, for a more realistic motorcycle racing experience. Leaning backwards will cause the bike to understeer and push to the outside of the corner, but accelerating out of corners is much easier. Conversely, leaning forward will cause the rider to lose speed when exiting corners, but turn-ins will improve.     By default, both these features (brake and weight control) are turned off. As a result of making the game more realistic, it becomes much more challenging; the more the player must keep track of, the harder the game becomes. But this is in no way a negative addition. In fact, it's the one thing that makes MotoGP3 stand out in the series. Why this feature was missing in previous MotoGP games is more of a mystery than anything else.   The AI in MotoGP3 is aggressive, even at the easy difficulty. But more importantly, it doesn't feel cheap. The rubber band phenomenon found in many racing games does not appear to be in effect in the game, and that's a good thing. Passing up a rider and leaving him in the dust will do just that -- leave him in the dust. You could actually wait a few seconds as the rider catches up in a believable amount of time.   Because motorcycle racing is completely different than racing a car, many gamers new to the genre may find learning how to compensate for braking distance and turning angles difficult, and maybe even frustrating. Luckily, and I don't know if this was done intentionally or not, you can see the skid marks on the track and they act as a perfect racing line to follow. Only speed and braking need to be figured in turn calculations, assuming the guideline is followed. This may seem a little cheap, but because the emphasis is more heavily placed on speed, the track marks are more helpful than anything else.     Graphics Simply put, MotoGP3 is a visually stunning game. The game's visuals are both technically and artistically sound, and are always in a state to impress. The game's 60 fps never falters, the rider animations are first-rate, and the textures (for the most part) are sharper than a Ginsu knife fresh off the production line. Even a prolonged stare at the television screen may have trouble distinguishing between what's being rendered in real-time and what is video. The added camera effects only add to MotoGP3's photorealistic aesthetics.  A lot of what makes MotoGP3 look so good are the small details, like the glare found on the rider's windshield in the cockpit view. The way the reflection distorts and animates is truly superb. Also, while the digital speedometer found in the cockpit may seem typical, and maybe even boring, a closer look will reveal the almost transparent outlines of the digital number display. An almost trivial detail, it's this sort of care and attention to detail that makes MotoGP3 a visual success.   But what's even more remarkable than the creamy smooth framerate, the excellent lighting effects, and the exceptional animation are the graphical effects used when racing on a wet track. Of course, there's the obligatory raindrops on the screen, but the implementation in MotoGP3 is particularly admirable. The drops on the screen even refract the light to a degree, creating an iridescent layer of colors on each drop. Switching to cockpit view while racing on a wet track will produce a water-melting effect on the windshield that is equally as fine as every other effect in the game. Additionally, the faint reflections seen on parts of the track that have more water on them are so illusive yet realistic that it takes a few moments to even realize you saw them. Great stuff.   That's not to say everything is perfect in MotoGP3. The track textures could definitely use some work, the crowds are static and lifeless, and there are some minor aliasing issues. Fortunately, all of this is moving by at such blinding speeds that it all works out. Only from a stationary point of view are these problems even noticeable. Also, although the tracks are based off real-life tracks and are modeled as such, that doesn't mean they are as visually interesting as they could be. But, that is the nature of the tracks and sport, so when it comes to realism, MotoGP3 hits the mark.   Sound MotoGP3 puts the player on a track with up to twenty other motorcycles, and unsurprisingly, that's exactly what is heard the majority of time: lots of motorcycle engines. The high whir of the motors sounds authentic, and produces a feeling of speed and power. But take out the motor sounds and you're left with the game's slightly better than average selection of electronic-rock songs. While it could be much worse, too many other racing games use similar soundtracks, and it makes MotoGP's soundtrack sound more like background noise than anything else. Better to just turn off the music and either pop in your favorite music CD, or not have music at all.   Although MotoGP3 doesn't support Dolby Pro Logic II, the game still does a noteworthy job of creating spatial directions and movements. It's never hard to tell which direction a rider is coming from, or if they are in front or behind the player, whether using headphones or a surround sound setup.  Motorcycle racing games aren't for everyone. Even some general racing fans may be turned off by the more difficult learning curve. But those who are looking for exactly that -- a challenging motorcycle game -- could do no better than to pick up MotoGP3. While not completely different from past MotoGP games, there are enough improvements to warrant picking this game up, even if you've got an earlier version of the game. It's fast, beautiful, and chock full of modes and options. Get it.", "date": "Mar 18, 2003"}