{"name": "Black & White -- Platinum Pack", "name_review": "Black & White Platinum Pack", "ref": "https://www.ign.com/articles/2003/03/19/black-white-platinum-pack", "text": "I'm going crazy.  No really, I'm completely insane now.  I've just spent the past five days chained to my computer, only taking breaks to scrounge whatever leftover pizza I can find in my room and a little bit of sleep.  I'm extremely tired, a bit delirious, and mildly dehydrated. Undulating red rings are burned into my eyesight from casting thousands of miracles, playing havoc with my peripheral vision and leaving trails whenever I scan my eyes over a light surface. I'm suffering from the peculiar feeling that I'm looking down on everything from high above at a 60-degree angle, and it's making me slightly nauseous.  All of this may sound pretty ghastly, but it's not like I've been suffering.  I've been playing one of the most highly anticipated Mac games of the past two years: Black & White.  Unless you've been living in a cave in highlands of Tibet for the past five years, you've probably heard of Black & White, the latest God-sim from PC sage and minor-deity himself Peter Molyneux, one of the brains behind such innovative and creative games as Populous, Dungeon Keeper and Magic Carpet.  Because of its lofty promises, Black & White has been getting major media coverage forever...but now I can finally say that yes, it does live up to the hype.  The question has been raised several times, ~What exactly is Black & White?~  And rightfully so.  Before we got our hands on the game, even we weren't sure exactly how the game would play.  We knew you played the role of a rookie god complete with cool powers and miracles, we knew you had a pet avatar creature that you could teach through your actions, and we knew that there would a strategy element to the game with you trying to gain influence over the villages controlled by rival gods. But what we didn't know was how all of these parts fit together.    Now we know, and after playing Black & White for almost a solid week, I can say it's a truly miraculous ~game.~ I call it a ~game~ because it's more of an experience -- a living world that you have influence over yet still don't have total control over.   Not surprisingly, the strategy portion of Black & White is a lot like Populous, only in an entirely 3D world. Like Populous, you play as a god who's trying to convert as many followers as possible.  There are eight different tribes in Black & White: Aztec, Celtic, Egyptian, Greek, Indian, Japanese, Norse, and Tibetan.  Influencing the tribes to join your side will afford you different miracles specific to that tribe.  For example, the Celts specialize in natural and healing powers, while the Aztecs offer more offensive, warlike miracles.  While you don't have total control over your villagers, you can suggest roles to them, such as foresters, farmers, breeders, builders, and pure worshippers.  The more villagers who believe in you, the more miracle-casting power you have, but of course the less people you have gathering resources, constructing buildings, and making sweet, sweet love.  The many islands in the game are populated with several tribes, some who owe allegiance to no one, while others may worship another higher being.  So how do you get these little buggers to look to you as their supreme being?  By performing miracles and acts only a god could, of course.  Produce food for them when they're hungry or heal a sick elderly villager and you'll convert a few to your side through acts of godly kindness.  But showing off your more violent powers will work as well.  Burn their villages with sizzling fireballs or reign down an electrifying lighting storm on their town center and they will worship you out of sheer terror.    That's where one of the important facets of Black & White really comes into play.  Like the name implies, you can be either a kind and gentle god or a livid, vengeful god -- with shades of gray in between.  The concepts of good and evil are handled very elegantly in the game.  Just because you have to toss a fireball into the village store every now and again doesn't mean the villagers don't notice all of the bountiful forests you've provided them with and your charitable healing work at the old villagers' home.  No, no -- it's an overall combination of your actions that you'll be remembered for.  Rain fire down on your followers and your area of influence will slowly turn into a dark, foreboding land.  Be kind and your realm will sparkle with wholesome purity.  But remember, you're not in this alone.  Not only will your actions affect your land and villagers, but they'll also affect your creature as well.  Amidst all of this RTS gameplay, you'll have a pet to look after as well.  Your pet is the physical embodiment of godly power, and (s)he can perform almost any task you can, like casting miracles and impressing villagers.  The creature AI in the game is simply brilliant.  AI is Molyneux's forte, and he always surrounds himself with master AI programmers, so this didn't come as much of a surprise. Watching your creature learn -- and I do mean actually ~learn~ -- is an amazing thing to witness.  By rewarding your creature with a gentle rub, you can encourage your pet to continue doing that action, while slapping him around shows him your disapproval.  The learning process even goes to the extreme of teaching your creature where to use the bathroom.  Your villagers won't be too happy if your 200-foot behemoth of a monkey poops right in the middle of the town square, but by leashing him to a rock and setting him next to a field when he's young and rewarding him when he poops in the meadow and you've got yourself a gigantic source of free fertilizer.  Your creature is also the vehicle that you'll use to fight other rival creatures.  While the fighting system isn't nearly as complex as a console fighter, you can attack, block, and you can even throw a few special moves into the mix when you're going up against a rival avatar.  As if all this weren't enough, there are plenty of story-based quests in the game to complete as well.  While you don't have to do these quests, you're often rewarded with a new miracle power or the like, so it behooves you to at least try a few quests if you're not too busy managing villages and teaching your creature how to breakdance.  All of this wouldn't work without a finely crafted control system, and Black & White certainly shines with its complex yet graceful interface.  Although you can assign hotkeys for most of the actions, the entire game can be controlled with the mouse as well, with the left mouse button controlling movement and the right mouse button in charge of your actions, such as smacking around your pet or interacting with objects on the landscape.  You can even cast any of the miracles in the game by using the oft-touted ~gesture~ system.  For example, you draw a counterclockwise spiral on the landscape and then a ~W~ to create a water miracle.  The gesture system is a great concept and, for the most part, it worked extremely well.  For some reason though I was never able to successfully cast the healing miracle, which is a heart-shaped gesture, while I was in the field.  I would invariably get a completely different miracle every time I tried to cast heal, so I was relegated to zooming back to my temple (which I always set a waypoint at) any time I wanted to cast heal.    I also wasn't a big fan of using the mouse for controlling the camera, but that was easily mapped to a standard first person shooter setup.  I mapped the movement controls to the AWSD buttons, set Q and E for camera rotation, and R and F to change pitch. This made controlling my god hand quick and easy, and made moving around in the game world much more straightforward for me.  While learning the game will take some time, and it will take some time, the included tutorial does a good job of teaching you the basics while you're actually playing the game, so it's not like you have to sit through a boring, drawn-out interface lesson before you actually jump into Black & White.   As you all know by the screenshots and movies by now, Black & White is a visual masterpiece.  The technology behind the game is the best of the best, and this game will really show off that new, high-powered graphics cards you just spent $400 on. Zooming from high over the island right into the face of a villager twenty miles below is a breathtaking journey, and although the villager models aren't as detailed as models from other games, there can literally be thousands of villagers running around on the same island.  There are some texture pops as you fly around the terrain, but this is easily forgivable for a game with this level of detail. The creature models all look incredibly sharp and are easily recognizable for the animals they represent, although the cow does look rather awkward standing on it's hind legs...just as you would expect from a bipedal bovine.  The charm and personality of each creature is displayed through incredibly realistic facial and body animations that give you the impression that your pet is actually alive.  I felt genuine guilt every time I would spank my monkey...it must be the Catholic in me. All of this graphical acuity is complemented by stunning lighting and particle effects, and the little touches like fluttering butterflies and a full weather system all add to the sense that you're in a genuine, living world.  Hell, the game will even log onto the Internet to check your local weather so you can play with your current conditions if you so wish.  Now that's detail!  The sound design in Black & White is as finely crafted as the rest of the game.  The music hangs in the background, where it should be, and never get repetitive, annoying, or overbearing.  These are the tunes I would listen to if I were a god.  The environmental sounds are apparent only when you get close to an animal, villager, or object.  For example, zoom close to a stream and you'll hear it babbling, or scroll over a village and your followers will tell you what they need to be happy.  Produce a storm and you'll hear the loud crash of thunder.  Throw a fireball into the middle of a town and villagers will scream and cry in terror while engulfed in flames.  The natural creature sounds are just as impressive and realistic sounding.  Tigers growl, bears roar, and you'll hear a bevy of ~eeps~ and ~oops~ from monkeys.  Sound cues will also give you an indication of how to complete some of the quests in the game.  In one quest I had to find a shepherd's lost flock.  I knew one of the sheep was on a nearby mountain, I just couldn't spot it by eye, so I scanned over the mountain at a tight zoom.  Sure enough, I heard a bleat to the right.  All I had to do was strafe over and there was my wooly little friend.  So there you have it...the single player game is un-freaking-believable.  Unfortunately, the multiplayer side isn't nearly as in-depth as the single-player game, and it really feels tacked on to an otherwise brilliant single-player package.  There's a pitiful assortment of three multiplayer maps in the game, and you can play those out in a good day of extended gaming.  Also, because you can bring your single-player creature into the multiplayer fray, and since some creatures have matured further than others, it's often hard to find a balanced opponent of equal strength to play against. While it's kind of neat bringing your creature online to fight against others, cooperating as a cohesive clan, or wresting a rival village from a living God on the other side of the modem line, this is definitely not the focus of Black & White, and you'll find more enjoyment from the solo game than you will in multiplay.  With that said, the epic single player side of Black & White is wildly imaginative, elegant, charming, and a lot more action-packed than I thought it would be.  Words like ~ground-breaking~ and ~revolutionary~ are sure to be attached to this title, and I can already state with confidence that Black & White is assured ~classic~ status in the annals of PC gaming.  While micromanaging the shear number of things to do may be overwhelming for some players, Black & White is like stepping into a breathing, living world, and although it took a lot of patience for the release, the final creation was certainly worth the wait.   If that weren't enough, the Platinum Pack also includes the Creature Isle expansion pack. Creature Isle places you in a world with no other gods. Instead, the island is home to several masterless creatures. These creatures have banded together in a Brotherhood and require all new creatures to pass a series of trials in order to gain admittance. The trials were instituted in order to weed out the bad creatures from the good. Presumably, if you can play soccer, you are good. As you best each of the creatures in their individual challenges, you earn their support for entry into the Brotherhood. You also get the chance to switch your current creature out for the new creature type.  While there are villages and populations to manage, Creature Isle was designed to focus almost exclusively on the creatures of Black & White. Much more attention has been placed on the care and maintenance of your creature and his or her ability to display independent initiative in solving the various problems around the island. Sadly, the lack of a directly competing god tends to spoil the enjoyment for me as I'm sure it will for fans of the game who are more interested in the strategic side of Black & White.  Each of the 20 or so creatures in the game has a unique and intense personality. And while much of the personality comes through the voice acting and dialogue of the characters, even more comes from the animation and modeling. The various creatures all look and move like individuals. There are a few oddities here, such as Pristax the Leopard. He speaks with a very proper British accent but also launches into a breakdancing routine. Now, I'm not saying that the worm and the headspin aren't big over at Eton these days, but it still seems a bit off. And the less said about Yax, the red-assed Jamaican Baboon, the better.  The challenges themselves are a bit tedious and some of them seem out of character for the game. Right at the start you have to compete with Madino the Cow in a bowling match. This is probably the most irritating of the games in Creature Isle. You have to throw a small stone at a group of pins. Your creature throws the ball wherever the stone lands. You play through five frames against the cow. It's a very slow-paced game -- the moreso because it's intercut with lots of cutscenes and reactions to the shots.  Then there's the issue of whether or not a bowling game belongs in a game that's supposed to be about a divine entity. I kind of have the same objections about the Candyland-style challenge and the game of marbles that you play against Jango the Ape. If the developers are trying to make a point about God playing dice with the universe, it could have been done more subtly. If they're trying to say something about the innocence or immaturity of the creatures, then that might have been handled better as well. I'm not saying that the game can't have humor or levity in it. That's not my point at all. What seems odd to me is that the first game seemed to deal with the issues of godhood with a lot more sophistication and ~reality~ than this one does.  But to be fair, there are many contests that fit perfectly within the context of the world. Helping people remove curses, gathering a crew to help transport Kula the Polar Bear to a cooler climate and stopping marauders from destroying buildings all seem to make sense within the world of the game. Playing marbles or soccer tends to take away from the profound nature of the first game, but helping out the villagers is still a satisfyingly godlike experience.  Some of the contests require persistence rather than skill. You'll have to herd sheep into a pen by using their natural aversion to your creature to guide them. The sheep don't seem to recognize the presence of your creature until he's stopped for a second or two so you'll probably have to stop well ahead of the sheep to get them to turn and run in the opposite direction. A wolf asks you to play hide and seek. Since you can still see his footprints, you just have to follow him around the island until he ~hides.~  Other contests just require that you find the gimmick or trick that makes them possible. The tortoise race is remarkably easy once you realize that you can cut across a large portion of the track. Not all the tricks are as apparent as this one, and I'll leave it to you to figure out just how in the hell you get past those guard dogs to rescue Nazzle the Bear.  A few competitions require only that you have taught your creature to do the ~right~ things, like watering farms for instance. Your creature can also learn a few new skills in Creature Isle. First, and maybe most importantly, he can learn to construct buildings. This is a big leg up in multiplayer as it allows you to get you village pumping in a short period of time. Your creature also has two new miracles: an anti-spell miracle and a haste miracle.  You'll really begin to see how well you've taught your creature when he begins to take care of Tyke, the little chicken that you'll have to hatch early in the game. Tyke learns by watching your creature and, once he knows what to do, can be a big help in regulating and modifying your villages. Tyke learns the lessons your creature teaches him pretty quickly and is quite good at putting them into practice. I didn't see as much of a moral dimension to their relationship as I did between me and my own creature in the first game but that may just be because I projected most that stuff onto the relationship myself.  The ultimate goal in raising Tyke and completing the various creature trials is to win the approval and affection of Eve. Eve's a mysterious character motivating things behind the scenes. I could say more about this but it would tend to spoil a lot of the game. I'll just say that pretty much the whole game builds towards this meeting with Eve. Whether or not the payoff is worth it depends on how much you enjoyed getting there.  The real appeal of the game is in the nurturing and maintenance of your creature which, for me at least, isn't necessarily the best aspect of the first game.  The Mac port of both the original and expansion are top notch. Feral has continued to update the game and it is now pretty much bug free and running smoothly. The recommended requirements are a 500MHz G3 and a 32 MB OpenGL video card. I would aregue that those are the minimum requirements. This game really shines on faster processors.  The bottom line is that the Platinum Pack is a huge value for Mac gamers. Black & White is easily one of the best sims ever, and you're essentially getting the expansion pack for free. Go buy it.", "date": "Mar 19, 2003"}