{"name": "Ultima Online: Age of Shadows", "name_review": "Ultima Online: Age of Shadows Review", "ref": "https://www.ign.com/articles/2003/03/20/ultima-online-age-of-shadows-review", "text": "I remember the day when I first learned about Ultima Online.  I was in my cubicle on my second day of a new job when I overheard two fellow employees talking about this game.  I thought to myself ~Wow that sounds really cool! I must learn more.~   After a few weeks of talking to other players, I splurged and brought home Ultima Online.  My life has never been the same. Since that time Origin has released various expansions, including last years Lord Blackthorns Revenge which had a few nice features, but wasn't enough to draw many players back to UO.  On the other hand, the latest Expansion, Age of Shadows is a sure winner in the eyes of current UO players and might have enough in the way of features and content to bring many old players back. The biggest changes include two new classes, the Necromancer and Paladin, the addition of a custom house design tool and a new landmass that not only ties into the new storyline, but opened up an additional 1500 spaces per server to place a house.  This landmass also houses the largest dungeon in UO to date.  As if this wasn't enough, they even added about 12 creatures that can be encountered in the new land areas, magical item crafting and other types of weapons, armor and skills.   Not your Grandma's UO   The Ultima Online we have today is nothing like when it was released in 1997. When UO first started, the only thing the players had to worry about were Player Killers (PK's) and making sure they kept their skills and attributes at the levels they needed for their template. Now you have the ability to lock skills or set skills to raise or lower from use or lack of use.  New skills have been added but the skill cap remains the same it always has been at 700 points. Preferably you would like to have 7 skills at 100 to have the ideal character but some templates needing 8-10 skills will now require the players to try and balance things out perfectly, creating a lot more work and forcing you to keep a close eye on those numbers.    It will take a newcomer some time to get used to the interface.  There are many different windows that can be open.  At any given moment you can have your paper doll (the area where you access your backpack and select various options), map, backpack, still window and attributes screens open.  UO also has more possible Macro Keys than most current persistent state worlds.  A macro key is something you set to either use a particular skill or speak to an NPC (non-player character).  For example, a famous Macro is ~Vendor Buy Bank Guards~. This Macro does three things.  When you are at a Shop, it opens the Vendor Purchase window.  When at a bank, it opens your bank box.  Finally, if you are getting attacked in a guard protected area and you aren't the aggressor, it will call one of the cities guards to destroy your attacker.  The interface can get overwhelming at times. However, you will learn and become an experienced player with perseverance.  Eventually, these things become second nature and not such a big issue anymore.   New Classes You Say?   Yes you heard right.  Age of Shadows adds two brand spanking new classes to choose from, the Paladin and the Necromancer. For those of you familiar with the history of UO, you may remember back in 1998 when Origin implemented Necromancy on the test server at a very early stage.  At that time things seemed like they would go well with this new class, but then the project was pulled for unknown reasons.  It appears the whole concept was sent back to the drawing board and finally has made its way into the game with this expansion. In addition to Necromancers, they added the counter to that class, the Paladins. The two sides, the good and the evil, have been fighting a war in an attempt to rid the land of each other.  It is up to the players to choose the side they will fight for. Would you rather be good or evil?   The Good   The Paladin is a fighter/healer who calls upon a divine power to help aid himself and his group mates in battle. He can call upon these powers to heal, cure poison, lift curses and improve his fighting abilities. He even has the ability to sacrifice himself to aid everyone in his group with a massive heal/resurrect, which will resurrect all dead, heal players to full and cure all disease, by sacrificing his own health points, possibly even killing himself.  There is many other powers available to the Paladin, like Dispel Evil, which attempts to dispel evil summoned creatures and Holy Light, which is an attack spell using energy damage.   For a Paladin to use these special abilities he has to develop his Chivalry skill, which automatically rises each time you attempt he casts a Paladin Spell. The higher the Paladins karma, the more powerful the spell becomes.  To play well as a Paladin, you have to do as many good deeds as possible. You also need to donate coinage to the divine power, which can be done at the various shrines scattered all across the lands of Britannia.    The Evil   The Necromancer plays the opposite role that the Paladin plays.  These are Masters of Evil.  They rely on the dark powers and a poor reputation to become more powerful. They specialize in spells of destruction and have the ability to transform themselves into dreadful creatures. Not only this, but they can also raise the dead to create an army of undead to fight for them.  In addition, they can summon pain, pestilence and curses to kill their enemies. Samples of their Evil Powers include Corpse Skin, which makes opponents more vulnerable to fire and poison, and Lich Form, transforming himself into a lich.   Like the Paladin, the Necromancer relies on his Necromancy skill to cast spells.  The higher the skill the more proficient he becomes at casting and the more he casts the higher his skill will raise. Necromancers rely on Negative Karma to gain a bonus in spell power.  In this sense, Paladins and Necromancers compliment each other well.   The Battlefield   The new land mass of Malas ties in nicely with the addition of the new classes.  The world is split in half, the north half being controlled by Paladins and the southern half possessed by Necromancers. The two halves are connected by a bridge that spans a space of emptiness.  You find by talking to NPCs in the Paladin or Necromancer cities that the two sides have been raiding each other back and forth in an ongoing war. It is up to the players to choose which group to support. (Note: This is just a storyline, there are no control features in this expansion) The addition of Malas is the largest landmass expansion in UO to date and is very much needed. It opened an additional 1500 spaces where one could possible place a home.   Malas is also the home to the largest dungeon in Ultima Online, Doom. This dungeon is filled with horrifying, demonic creatures vile enough to send a shiver down your spine. As you work your way through, the encounters become increasingly tougher and one can only survive this dungeon with teammates to plunge into the depths with and cleanse its evil.   Build Me a Home   A new custom house tool has been added with the Expansion.  The system is very similar to the house creating tool in EA's world famous game, The Sims.  Creating a house is a rather simple process (much easier than finding a place to build a house on most servers).  All you need is a basic knowledge of how the tool works, enough gold to make the house of your dreams and a touch of creativity. The process is rather simple.  You start by selecting the plot size you wish to build.  This is largely dependant on the amount of space you have to build on and the amount of money you have on you. The cheapest Plot is a 2-story 7x7, and that starts off at 30,500 gold (remember this is just for the base price of the house) and it can get as expensive as 179,000 Gold (for a 3 story 18x18) As you're going through the creation process, adding Walls, Stairs, Decorations the cost of the house continues to increase and homes can be in the millions once everything you dreamed of having has been placed.  The interesting thing is that no one can see what you are building until you make your house public and pay for it. You can at anytime put your home back under construction to give it a new design.  This feature in and of itself is enough to make this probably the greatest UO expansion to date.   The benefit of owning a custom home over a classic, and cheaper in most cases, home is the fact that you can design it to be whatever you want. As you travel through Britannia you will see Castles with Moats, Towers with Waterfalls pouring down to a pond, Huts and even houses that look like an outdoor garden. Your imagination is your only limit when it comes to house design.     Other New Features   This expansion also includes 12 new monsters to pit yourself against, all of whom are located in the new lands. Take on the mystical and powerful Crystal Elemental or pit yourself against one of the foul creatures on Malas, the Demon Knight, which can be found in the Dungeon Doom.  You can find these and others scattered throughout Malas, either wandering outside or inside the Dungeon.     Combat Changes have been introduced as well.  These include an expansion to the currently supported damage types of poison, fire, physical and energy by adding strategies to how each can be used.  Also, cold damage is now possible. The inclusion of resists enables one to resist any of the named damage types if their armor supports it and spells can aid resists.  Special Combat Moves have been added. Warriors get the ability to use their mana to aid in the use of a weapons special ability. Some of these abilities include firing an arrow while running (at the cost of accuracy), a skill that ignores the effects of armor on the object you're attacking, the ability to knock enemies off their mounts and even the ability to strike while hidden. The chance of success increases as your skill in that weapon type increase.     New Weapons, Armor and Weapon Skills have been added.  Ten new weapons have been added for the various skills, including a Composite Bow, Lance, Pike and Rapier.  Players can now craft or find Dragon Armor and a few other new armor types as well.  One of the more interesting features is the item insurance one can purchase. For a fee you can select an item to be insured from death. This means when you die, these items will stay with your ghost.  This is especially nice at times when you are unable to reach your body before it decays and all items are lost.  It is recommended you insure your most important, irreplaceable items.   Blacksmiths and Tailors will gain the ability to craft armor and weapons that are imbued with magical properties. This allows for many more choices for players when selecting the type of armor they wish to use. The quality of the armor is based off the Crafters Skill, the Quality and type of the material being used and the quality and type of rune being used to imbue the armor with its magical attribute.   Finally other changes include the removal of stat loss upon death, interface changes, including changes in the appearance of windows, and other minor changes internally. Nothing really ground breaking here, but things that have made an impact in making this expansion the best expansion since The Second Age, which added two creature races and a huge landmass.   Nothing can ever be perfect and even this expansion has its downfalls. The graphics haven't been touched since the release of the 3D engine and compared to many of today's MMOGs it cannot compete. Do not let that concern you because after all graphics aren't what make a game good, but they do give nice bonus points to a game that was developed extremely well. Low graphics quality has its plus sides as well. A person can run the 2D version with a low-end system, even as slow as a Pentium 2 200 Mhz. and the 3D Version can run on a Pentium 2 300 Mhz.  While a Pentium 3 500Mhz+ with 128 Mb of Ram will give a much better performance, most new MMOGs require a player to have a minimum of an 800Mhz processor to even run the game, many with requirements above the 1Ghz Range.  If you do not have a beefy system and love MMOGs this might be your best reason to pick UO. The game still suffers a few crashes and packet loss seems to be an issue on busy nights even with a broadband connection, but it's nothing to serious to make the game unplayable. The development team is very effective in stopping bugs as they find them, which is a great sign when running an MMOG. Bugs will always exist, but response time is the key importance when dealing with them.Outdated graphics and bugs aside, its safe to say that Ultima Online is back in a big way. For many players UO has always been old reliable. With the most sophisticated character development system in existence today and many features to make your characters unique, you have a sure winner here. Ultima Online doesnt suffer as bad a leveling treadmill as many other MMOGs do, and in places where it is harder to jump to the next level in your character creation, there are plenty of other things for the players to partake in with the amount of content available in the game.", "date": "Mar 20, 2003"}