{"name": "J.League Winning Eleven 6", "name_review": "Winning Eleven 6 Final Evolution Import Review", "ref": "https://www.ign.com/articles/2003/03/21/winning-eleven-6-final-evolution-import-review", "text": "First of all we'd like to apologize for such a late review. Winning Eleven 6 Final Evolution (WE6FE) has been out in Japan since late December and the GameCube version was released in January (to sadly very lackluster sales). Whereas the PS2 version has clocked in more than 500,000 units already. There's hardly any difference between the two games. There's some slowdown in the GC version, but that's about it.    WE6FE is an amalgam of Winning Eleven 6 and the European Pro Evolution Soccer 2 (PES2). Basically after releasing WE6 in Japan in March 2002, Konami quickly converts the game into the European PES2 with a few quick improvements based on feedback. However, whereas in the European versions Konami's changes are often rough and out of balance, the Final Evolution is a stunningly balanced and much-improved final version with many finely tuned nuances. PES2, while a superb game, pales in comparison to the Japanese games. The Japanese games in the series look noticeably sharper, play smoother and the small kinks have been ironed out of the gameplay. For most fans of the series the important updates are the correct rosters, graphical updates and some new players in the various National and Club teams. It's all here.   The fact that the changes made in WE6FE are small, but make the game feel almost new when compared to WE6, are an testament to the superbly honed and intricate gameplay that Konami offers in it's soccer game. WE6FE feels drastically different than both WE6 and PES2, despite it being an update of the same game. The graphics have improved, but it's the gameplay that's really been re-worked. The rosters are bang up to date, or rather were back in December when the game was released. However, the big news is that WE6FE supports updates via the PlayStation BB-unit in Japan (and no, you cannot use the service with an US, European or 3rd party Ethernet adapter, you need to be using the SCEI offered BB-service). In other words, there's online-support. Konami updates the team rosters every once in a while and they can be downloaded via the game's option menu. Only in Japan though. Of more interest is that according to the developers, some visual updates will be also possible to download. So David Beckham's ever-changing hair can be  matched in the game, but other visual differences can also be downloaded. Hopefully this is the first step to offering full online play in the next game. The graphics engine has also been changed, though it still is Renderware.   In terms of teams, they are the same as they were in WE6, besides the updated, afore-mentioned rosters of course. There are 32 club teams in total and it's hard to see Konami bringing in more since all the known and interesting ones are already in here. The problem in bringing in more club teams is of course that the quality of each team starts to differ quite a lot when compared to the current 32. Still, it's understandable that more club teams from various national leagues are wanted to satisfy players needs, but the current line-up can hardly be faulted.    The editing facilities have been greatly improved. There's a massive selection of boots and shirts that are very close to the real-life ones, even if there's no Nike, Umbro etc licenses in here. By default the jerseys are accurate in their color, but purists will want to change some of the shirt designs around a bit. Also, thanks to the not-so-laidback-Dutch football governing body, there are no real player names for the Dutch national team. Most other teams have real player names. It's possible to customize pretty much everything, but if you got an Xport, it's worth tracking down some of the amazing save files that have been created. These make the jerseys and rosters 99% accurate.    Gameplay  WE6FE gameplay has improved tremendously. It's the first game in the series for years that will re-kindle players interest to the series. This is due to the great balance that the development team has achieved. The previous games were awesome, but it's scary to play WE6FE and realize just how much has been improved. Everything has been tinkered a bit, to a very positive result.   The pace of the game has slowed down a bit, but finally, the players varying running speeds are properly brought into the game. In the old PS one games, fast players such as Brazil's Roberto Carlos could basically run around the pitch and go past 99% of the defenders due to his speed. So after that Konami opted to change this so even players with fast running attributes, were always caught up by slow defenders, which became annoying and took some of the shine off the attacking gameplay. Now though, great balance has been stricken, but it's also a combination of new the animations that helps this balance. If you run with the ball utilizing a fast player and have gained some momentum, the slower defenders will have problems stopping you. They'll try to bump you off the ball and both players use their arms to push each other away in a very realistic manner. While battling for the ball like this for dozens of metres doesn't look that realistic, the system still works great. Good attacking players can shake off defenders and leave them in their wake, or try to dribble around them. The slower pace of the game really helps the dribbling aspect. The WE/PES-series has always been notable for the fact that is possible to create great plays and moves, as one can hold on the ball for a bit instead of having to kick it all over the pitch as the defensive team unrealistically runs to each attacking player trying to get the ball. The slower pace and improved dribbling allows skilled players like Zidane to weave through a few opposing players with great skill and make great passes even under pressure. This doesn't mean that it's always possible to do Maradona-style runs all the time, the defending play has also been improved, but not losing the ball as soon as you hit an opposing player has an drastic, positive, impact on the gameplay. Sometimes the ball can bounce to your advantage and sometimes it doesn't.   The crossing was great in WE5, floaty and useless in PES2 and brilliant in WE6FE. It is possible to reach a forward player on the edge of an off-side position only for him to escape the defenders and go at the goalie one on one. Also, good passing players can accurately make long high passes straight into the path of running players. The passing in general has been improved. Through-balls work far better than before and it's now possible to put the ball straight to the feet of your advancing attacking player who is in the middle of defenders trying to get ahold of the pass, if you got an player that can pass the ball well. The shooting also harkens back to the old days. You can unleash some seriously powerful drives just outside box that seem to rip the goal's net out of it's place. This is very satisfying and makes for more entertaining gameplay as you really cannot allow chances for skillfull shooting players to have an open chance to shoot. The AI-controlled teams are also deadly in their set-pieces. It's not a good idea to give Rivaldo or Beckham a chance to try and score from a free-kick near the penalty area.   It's quite difficult to score with long shots though, but not impossible. All in all, the shooting element is well done, but it's still strangely difficult to hit the target when you are facing the center of the goal, no matter how close you are. The ball tends to drift wide.   While the defender AI has in general improved, there's still an occasional problem with the Center-Backs. They often allow an midfield player the chance to run straight into the box as neither of them move in to block until it's too late. Also, it's a bit too easy and common to keep hold of the ball in the opposing teams penalty area, it's just a bit unrealistic and hard to defend against. The goalkeepers have gained many new animations and are certainly the toughest they have ever been in the series.   The Master League is much the same as it was before. Pick a team, gain points by winning and buy real-life players for your team and try to create an soccer-dynasty that will go on for years and years. There's loads of game-options and various game modes, but an proper league system for multiple human players is still lacking.    Graphics  The visual differences in WE6FE when compared to both WE6 and PES2 are surprisingly great considering this is an update, not a sequel. The graphics in WE6FE are, in short, superlative and the best we've so far in the series. The player's are a bit chubby in close-ups but the superb animation takes your mind off that. The player models aren't that detailed in general, but the facial details are quite strikingly close to many real-life players, which helps the immerse the player into the action during replays. There's some new individual celebration and kick-animations too.   The animation is more complex and there's surprisingly many new moves that you didn't realize were missing before. Goalkeepers tip the ball over the bar, throw their hands up to signal that the ball is going over the goal, stop making a dive when they see the ball going past the goal and so on. The new animations are small, but there's loads of them that really help to round out the whole package.    The stadiums also look utterly fantastic, all of them. The pitches, especially the actual grass looks a bit more realistic than before as some of the glass-like shine has been gotten rid of. The stadiums look good, but it's really the pitches themselves that look magnificent. There's clear distinction between different types of grass and each surface is quite close to how they look in real-life. None of the stadiums are named correctly, but you got Barcelona's Nou Camps and Manchester United's Old Trafford for example.   Sound  While the great crowd chants have been cut back a bit due to memory restrictions to bring in more animations, the audio commentary is great. It's in Japanese and I only understand some of it, but the passion and the feel of the commentary works superbly well. The music starts to grate after a while though. There's still room for improvement here as the crowd doesn't always react properly to the events on the pitch. It would nice to get a massive crowd chant going on while you are going for that winning goal in extra-time or hit the post in a tight situation.Winning Eleven 6 Final Evolution is an stunning soccer game and an incredible improvement over WE6 and PES2 on which this is based. The finely-honed gameplay is the best it's ever been. The improvements are small, but they are exactly the kind of ones that have required hundreds of hours worth of testing and feedback. Compare this to PES2 and you will be amazed at the many improvements. There's very few niggles, but for experienced players, the game is a bit too easy in it's Master League mode and in general, even at the highest difficulty setting. Still, great stuff from the development team.", "date": "Mar 21, 2003"}