{"name": "Pro Race Driver", "name_review": "Pro Race Driver Review", "ref": "https://www.ign.com/articles/2003/03/24/pro-race-driver-review-2", "text": "There's no denying that the developers at Codemasters know the racing genre inside and out. With Pro Race Driver, Xbox owners are treated to the most recent edition of the company's TOCA (Touring Car Championshp) series and it may, in fact, be the best of the bunch. We give it this designation despite several shortcomings, because they were shortcomings borne out of unrealistic expectations.   Taken for what it is, Pro Race Driver features one of the most impressive racing engines available on any system. As a supposed hybrid of the racing and role playing game genre (the so-called ~car-PG~) and as an Xbox Live compatible online racer, PRD comes up a short. We'll touch on the role-playing and racing elements later, but the Xbox Live disappointments require a bit of explaining. It certainly isn't against the law for a racing title to remain offline these days, but if that's the case, then that racing game shouldn't be delayed for the sake of adding Xbox Live functionality and then be released without that online component as Pro Driver was. It could've been the four-wheeled equivalent of Moto GP, technically brilliant racing online, but Xbox owners will have to simply settle for regular old technically brilliant racing.  Gameplay  The presentation elements take over as soon as you boot up the game. You're given the story of Ryan McKane, from his father's death to his beginnings as the next big thing in racing.  When it's all over you're up to your jumpsuit collar in McKane's world navigating around the office/garage complex that serves as the game's front end. It is from here that you can choose to run free races solo or with buddies or embark on the game's career mode and see what becomes of Ryan McKane, the sensitive bad boy of tour racing.   The career mode has you competing in racing championship seasons made up of six races and divided into territories like Northern Europe, the Americas and the Pacific Rim. Hopefully, you'll be earning championship points and money by placing sixth or better in the different races. The challenge here is that you're always progressing forward one way or another so there's no do-overs or quick save and reloads. If you quit in the middle of the race, you finish 20th and get no points but you're still in the middle of the season so it's on to the next race for you. But all is not lost for that championship series, because points are cumulative and you can still earn your ten points per victory in the remaining races. Winning a championship means you're good enough to face off against one of the other pro racers in a one on one race for his car. These one time only events can be restarted and run until you win so it'll only be a matter of time before you can add his car to the available list in free race mode.  The points you're earning are also being applied towards the championships tier system. You have to earn a certain amount of championship points (ie, be consistently competitive) to open up the next tier of championships featuring better drivers and more powerful cars.  The interface for all of this is Ryan McKane's computer system that he logs onto from the office. You'll even see it boot up and be able to pull up email offers from different racing teams. The offers from racing teams vary because you're being offered a car and a chance to race in a specific championship at the same time. In fact this is one of the areas where Pro Race Driver seems limited because your choices for championships (as in the new tracks you want to race on) are directly tied to the car you want to drive. There's no picking the best car for the right track like we've seen in so many other racing titles. Instead, the task is to get to know the power and handling of whatever car you're in and take the time to listen to your crew and customize the vehicles setup for the tracks that you're racing.   In some cases you'll have to audition for a racing team who are interested in you because they want to make sure you're up to the task if racing for them. They'll put you in the new car you'll be driving and on a track that's in the circuit that you'll be racing on should you join them.  You will have to race a lap under a certain time to make the team. These invariably turn out to be the best cars, like the Mercedes-Benz CLK AMG'd with 450HP, and can present the toughest challenges. In the case of that Benz, if you don't qualify in four tries, they rescind the offer.  While the structure of Pro Race Driver's car/track unlocking system can be a bit confusing, the racing itself is pure joy. The cars themselves are simply gorgeous and will leave you very impressed the first time you run a race. The tracks get progressively tougher with complicated hairpin turns and elevated turns to the point where your first lap is spent just getting to know the course. The AI of opposing drivers is excellent and definitely something to contend with over the course of an entire championship. On the leaderboard, you'll notice the same guy finishing second or even first in every race and then you'll start to recognize him on the track. Some are more aggressive than others and will have no problem jamming you into a barrier or sending you skidding onto gravel. Most of the 19 other racers however are cuddly puppies and won't do much to you if you play the role of bully smashing them into obstacles and using them as cushion when you go inside on a tight turn. Your car shows damage and sustains damage however so you may not want to be too much of a demolition demon.   The most challenging races are the ones that require you to pit between specified laps, say 2 and 5. While running a good race remains universal (fast on the straights and smart in the turns) the psychological pressure of pitting is considerable. Even though you know everybody has to do it, the process can be unsettling as you watch other racers pass you while you're getting your tires changed and oil checked in a cool little cut-scene.    The greatest strength of Pro Race Driver is how it handles your screw-ups and superior moves. The game does an excellent job of making you feel bad about yourself when you spinout onto gravel or crash head on into a barrier because something like that is your fault and you should feel bad watching 11 other racers fly past you. The course is laid out right in front of you and the burden is on you to know the limits of what your car can do in terms of stopping distance, acceleration and turning radius at different speeds. However, the game also does an excellent job of rewarding excellent driving. If you were to get ~in the zone~ after your head-on crash and drive like you're supposed to, you will get back into contention provided there are enough laps to go. If you wipe out and proceed to try to win the race on every turn, you'll only make things worse for yourself. Conversely if you've been an iceman on laps 1-4 of a five lap race and then lose your concentration that last time around, chances are you'll do something that will cause you to lose the race, maybe even at the last possible instance. This is the essence of the sport that so many other racing games miss, but that Codemasters seems to build their games on.  The car-PG elements of Pro Race Driver end up being a misnomer for what is basically a good story fueling a great racing game. You get to pick your racing teams and championships, but other than this there isn't much for you to determine as far as development of your character. We're given McKane's motivation when the game first begins and from there we see him interact with unique characters like mechanics, managers and foxy lasses. They're all brought to life with outstanding voice acting and definitely make the game more interesting but it's not as if we have any responsibility for Ryan McKane beyond racing him around race tracks. Call it a racing game with a heart but don't confuse it with Final Fantasy.  The Time Trial, Multiplayer and Free Race are all self-explanatory and are a great way to enjoy the fruits of your labor by racing on tracks and in cars that you've unlocked in the career mode.   Graphics  This game wouldn't be half as appealing if it didn't look so damn crisp and clean. The car models, made up of many thousands of polygons, are among the most impressive vehicles of any type, that you'll see on Xbox. But the fact that they can be ripped and smashed apart in real time with animated body parts flapping and flying around puts the cars of Pro Race Drive in another category and makes the cars of Rallisport Challenge look bland by comparison.  Attention to detail and authenticity are what Pro Race Driver is all about and you get it in every visual element in the game from the tracks and cars to the office/garage interface. Sponsorship paint jobs and decals on the race cars are accurate right down to the Shell Oil and Del Monte logos on the fenders. Racing Mexico, not only do you see ads for Herdez food products, but you're encouraged to get to know La Nueva Dodge and sign up for Telmex on the race track's billboards. It's the combination of details like these that really get you into the world of Ryan McKane. Real-time reflections mean you'll see that ad for La Nueva Dodge on the overpass flash across the rear-window of your car as you race under it in third person perspective.  In most racing games the only animations you'll see on the car models themselves would be the front wheels turning and maybe the drive inside manipulating the steering wheel. Pro Race Driver gives you that but damn near encourages you to bash into walls and other drivers just you can see how cool it looks as your vehicle disintegrates piece by piece with awesome real-time damage animation. Spoilers and windshields are usually the first to explode off of your car if you're rear ended by some reckless driver or slam into a barrier too fast. Losing your tires and rolling on pure metal rim not only looks cool because they're extra wide, but there can be a certain sense of accomplishment finishing a race in such bad shape.  The real visual treats come when you tear up your rear bumper but not enough to totally rip it from your car's body. It'll barely hold on to one attach point on the rear of your car flapping and dangling until you do something else to break it completely off. The American vehicles in the game are the usual suspects when it comes to dangling bumpers. The overall effect of all this is that you'll feel compelled to avoid big crashes and wipeouts because a) you don't want to lose the race and b) you don't want to trash your car to the point where it shuts down.  The cut-scenes and racing garage/office are all well done and suit the rest of the game's level of authenticity, even though some of the characters look blockier and fuzzier than others. Every time you get ready to race or hop around the facility you'll see different characters doing slightly different things. Before a race McKane will be somewhere in the garage doing something appropriate like talking with his crew or goofing off.   Sound  You can believe all of what you see and all of what you hear in Pro Race Drive because Codemasters doesn't take shortcuts when it comes to the audio department either. In full Dolby Digital surround sound you're hearing competitors coming up behind you on the left and right, putting those rear surround speakers to great use. Furthermore the car engine sounds could be the very best we've ever heard because they're many and varied and make us feel a bit more familiar with cars we're never going to own.   It's easy for anyone to tell the difference between say an old school Mini Cooper S and a Corvette Z06 when you've got their engines revving down a straight away. But car-geeks, especially those outside of North America, will appreciate the subtle differences between the 320HP Toyota Supra and the 276HP Toyota Chaser because it's there.   The voice acting is actually top notch and helps make up for some of the inconsistencies in the characters' look. The accents are right even when you're listening to broken English with a German or Japanese accent on an answering machine in the Pro Race Driver Challenges. Although it doesn't happen often enough, the furious outburst from one of your competitors confronting you in your garage is made all the more hilarious by the fact that he never takes his race helmet off. Muffled outrage is an underutilized comic instrument but the team at Codemasters sure made it sound realistic.  Because it's an Xbox racing game, custom soundtracks are expected and, sadly, are missing in Pro Race Driver. The tips you get from your crew during a race can be somewhat helpful since they tell you how you're doing on a lap and what position you're in, but it's nothing critical like you'd find in a rally game. In fact, chalk that one up to PRD's Colin McRae heritage. Pro Race Driver is easily one of the top racing titles on Xbox even if it doesn't have Xbox Live functionality and role-playing elements. The racing engine carries the entire thing but it's so refined that this isn't a weakness. In fact with the beautiful graphics and damage effects, PRD gave me the style and the substance that I feel more games, in any genre, should have.If I had to point out a weakness it would be the structure of the career mode and the way it limits the player to choosing racing team, car and racing circuit all in one shot. There are plenty of each to choose from but being able to mix and match a bit and still have it mean something in the overall career could've lead to some interesting combinations. As it is though, the game shows off all of its cars, tracks and beauty in due time as long as your good enough and patient enough.", "date": "Mar 24, 2003"}