{"name": "Batman: Dark Tomorrow", "name_review": "Batman: Dark Tomorrow Review", "ref": "https://www.ign.com/articles/2003/03/24/batman-dark-tomorrow-review", "text": "Comic book heroes and video games seem a perfect fit.  It's the same audience, and the crazy villains and incredible powers found in a funny book is often not nearly as weird as some of the stuff seen in video games.  After all, you don't get much odder than Rayman and people love that little quadruple amputee.  So why is it that almost all comic book-licensed games turn into total garbage?  Who knows.  My hope was that Kemco's Batman: Dark Tomorrow could buck the trend.  But it doesn't.  There is no polite way to say this, so I'll forgo civility for honesty:  This game is crap.  To find the redeeming qualities of Batman: Dark Tomorrow would be nearly impossible, simply because the game is so incredibly flawed from top to bottom that it brings flashbacks to another ill-fated super hero game, Superman 64.  And though Dark Tomorrow isn't nearly as God-awful as that notorious Superman game, it's pretty close to unplayable and is certainly completely unenjoyable.  Gameplay Batman: Dark Tomorrow is not plagued with bugs.  You won't see Batman running through walls and you won't see the AI getting stuck in objects.  And that's kind of sad, because it means this really is a ~finished product~ and not something merely thrown out there for the sake of having something released.  This is the culmination of someone's vision and it very well mirrors the horrible streets of Gotham City sans their ultimate protector.  In essence: It's dark and all hope is lost.  Dark Tomorrow never had a chance to be good, because early on in the design phase someone had to choose how the camera would work, how the controls would handle, and someone had to decide on level objectives, design, and a combat system.  Quite frankly, Batman fails in all these areas.   A 3D adventure, Dark Tomorrow lets you play as everyone's favorite vigilante hero, Batman.  That's the good part.  Then comes the controls, which are simple but puzzling.  For fighting you get one button to kick, one to punch.  And if you want to do a combo punch or kick, you hold down the left trigger and press the punch/kick button.  This is the maximum level of complexity for the fighting system, which is okay if the rest of the game works.  Heck, Streets of Rage 2 never offered much complexity but I played it every day for a good solid year.  But the combat just isn't fun and the need to hold down the left trigger to combo a single button press makes no sense when every other game out there would simple have you hit the A button multiple times.  And don't bother with blocking -- there is none.  You slug it out and that's it.  The problem here is that Batman doesn't kill, so he can only render thugs unconscious.  But thugs only remain knocked out for about five seconds.  Once you've knocked a fool down you've got to stand over them and put on bat handcuffs to secure him.  This gives you a required cut-scene.  Every time you put on handcuffs, the action is stopped for the same cut-scene.  Again and again.  And the problem comes in when you have four or five baddies coming at you at once.  Because if you're not quick enough by the time you've knocked down your third guy, the first one is already getting up.  It's incredibly stupid and very frustrating.    Batman comes with an assortment of gadgets from his handy utility belt.  You've got a Batarang, grappling hook, bat handcuffs, nightvision, smoke bombs, and even an all-purpose bat utility.  These beauts are pulled directly from the comic and look just as they should.  This is one of the few areas Kemco got right.      However, the implementation of these items is all wrong.  The game starts with a neat little Batman swinging exercise where you must use the bat cable to swing from building to building.  But unlike Spider-man, you can't swing, release a line, and produce another while in mid-air.  So you have to go to the edge of a building, swing on your cable, land on the next building (if you're lucky) and repeat.  Again and again.  Meanwhile the camera is going against you the entire time, switching perspectives seemingly at will.  The batarang would have been cool if you could simply switch to it (using the D-Pad) and then locked onto an enemy and thrown it.  Instead, using the batarang requires you to go into a first-peson mode where you cannot move.  Oy.  And even then it's almost impossible to see the batarang once you've thrown it.  But if you do move the targeting reticle over an enemy a blue bat symbol appears.  And if you're fortunate, the batarang will find its target.  But, of course, you've then got to hurry over to handcuff them before they get up.  Control and camera are the central problems with Dark Tomorrow.  There's no manual camera control, which is annoying in itself, and the fixed camera positions are idiotic.  You'll often find yourself fighting guys far at the end of the screen, well removed from the action.  One key thing to note is that if you are pressing forward when the camera switches, you will continue on in the proper direction.  However, the moment you let go of the thumbstick, control becomes relative to the perspective.  This becomes quite confusing and you'll often find yourself running into a room, relenting slightly on the controller, and then accidentally going back the way you came.  And the control is total garbage.  It's often hard to tell where you are supposed to go thanks to some sloppy level design and worse than this is the fact that many ledges can't be grabbed the first time you try.  That is, you may try and jump up to grab a ledge five times in the exact same spot only to suddenly grab it for whatever reason on the fifth try.  This leads to lots of accidental deaths when swinging across rooftops and will have you unable to figure out where to go, because the obvious path isn't possible because, for some reason, you can't grab a ledge the first few tries.  I mentioned dying, which you'll be doing quite a lot of.  But don't sweat death, because Kemco made it easy to continue.  There are load screens literally every 30 seconds in Batman: Dark Tomorrow and the game autosaves between each ten-second load time.  (Yes, the game really pauses roughly every half-minute of gameplay to load for 10 seconds.)  If you die, you can continue from the last load.  You'll begin with completely full health and all your equipment refreshed.  So there's no need to conserve any items or try to stay healthy, because death means nothing in this game.    The one bright spot for Dark Tomorrow is the presentation elements.  The cut-scenes and story are great and totally authentic to the comics.  The gadgets, the characters, the storyline, and the voice-acting lend themselves well to the universe and offer a stark contrast to the chaotic and poorly designed gameplay.    But a good story just isn't enough to save Batman from what is easily the worst game of the year so far.  Not only is it a disappointment for comic book fans, but it's a pretty sad display of how everything in a game can go incredibly wrong.  The camera, the fighting system, and the gameplay make this one nearly unplayable.  I fought through this game and I promise you, the story is not worth the misery you'll suffer along the way.  Graphics Batman just doesn't quite cut it on the next-gen front.  It's not an ugly game, but it doesn't utilize the Xbox hardware at all.  Batman's flowing cape doesn't flow like it does on GameCube.  In fact, it just sort of jitters in place for the most part while the GameCube cape flows dynamically with Batman's movements.  Why would the Xbox get the short end of the stick here?  There are also some slowdown problems and the animations are anything but fluid or particularly diverse or dynamic.    The only plus is the nicely rendered cut-scenes.  Unfortunately, there are some compression problems causing some major artifacting, which uglies up all of the cut-scenes.    This is a game, with all its jaggies and aliasing, that could have been on the N64 and it shows.    Sound This is a mix of good and bad.  On the one hand, the voice acting is solid from top to bottom.  Batman sounds authoritative, dark, and moody as he should.  Commissioner Gordon, the insane Joker, and the diabolical Ra's Al Ghul all sound great.  But the sound effects are laughable and for the most part non-existant.  You'll often see gunfire but never hear it.  And the punches, kicks, and thwaps are hardly inspiring.  Even the rain, which sounds great on GameCube, is almost impossible to hear on Xbox.  And it's only in stereo! A weak effort for an even weaker game. How bad and disappointing is Batman?  It makes me realize I underrated Sneakers.  The fact that it's got some better things in the GameCube version in terms of graphics and sound is a sign that the Xbox version was just a poor port of an already poor game.  The controls and camera work against you at almost all times and, frankly, its just not any fun whatsoever.  I love Batman, have since I was a little kid.  And Dark Tomorrow promised to do the character right.  From a story standpoint, it did.  But the game itself makes me long for the days when Batman was best known for being a comical crimefighter on TV and no one would dare think of making him part of a video game.  This game is a crime against comic book licenses.  Flawed from top to bottom, from beginning to end, the only true redeeming quality of Batman: Dark Tomorrow is that any poor sap who bought this game can probably still get $25 trade-in at their local game store.  Not worth a buy, not worth a rental, not even worth the free mini-comic inside.  This is a great example of ~what not to do.~", "date": "Mar 24, 2003"}