{"name": "World of Outlaws Sprint Cars", "name_review": "World of Outlaws", "ref": "https://www.ign.com/articles/2003/03/24/world-of-outlaws", "text": "Since it leapt onto the racing simulation scene with Dirt Track Racing a few years back, Ratbag has stayed in this genre, adding Dirt Track Racing 2 and World of Outlaws for the Playstation 2. Now, some months after it debuted on the PS2, World of Outlaws hits the PC.  My expectations for this title were a not that high because I was not blown away with the PS2 version. Although it is popular among oval fans, I didn't feel that there was enough variety in the game. The sport is more of a cult favorite rather than a national phenomenon the way NASCAR Racing is. Further, it's all on bland dirt tracks. Really?  How good can this be made to look?  That having been said, I was surprisingly impressed with the PC game. Whereas console games need vibrant graphics, PC games can go high resolution and put in so many details that it just looks real. That is what has been achieved in WoO for the PC. I can run this game at 1024x768x32-bit on my computer with no apparent slowdown (whereas in Sierra's NASCAR Racing 2003 I have to drop to 16-bit and lower some detail settings). Of course, there are only as many as 16 cars on the track, but still, it's nice to be able to have everything maxed out once in awhile. Although the tracks are dirt, they aren't uniform in nature. As the day wears on, certain portions of it harden and seem to have a shine on them as they are packed and smoothed by car tires. On the extreme inside and outside of the tracks the dirt is more loose and dark colored. These various surfaces 'feel' different and need to be taken into account when you're racing.  Around the track are various grandstands, from the little rinky-dink local ones up to the Winton Cup sized stands in Bristol. Because the final races are run at night while the practices are run during the day, you get to race at different times within a single event.  The clouds, sky, lighting effects and shadows are incredibly realistic.  The cars have high polygon counts, varied color schemes and sponsors, and kick up very real looking dust and mud. If enabled, you can have mud splattering on your windshield when you get up close to someone and then you'll need to use one of your limited numbers of tear-offs to clean your view. You can drive from a couple of behind-the-car views, or an in-car view with our without your cockpit surrounding you. You can also glance left or right with a key press to quickly check out what's going on around you, since you have no mirrors. Glancing aside, you're still going to need a good surround setup so that you can hear where the competing cars are relative to your own.  Although there are single races and quick racing, the heart of the game is really its career mode. No longer original in concept, but still a good way to provide some continuity to gameplay, career mode enables you to begin with a couple of local tracks and a cheap car and work your way through earnings and championships. Unlike many other games, you can simultaneously compete in multiple series. Your points for each championship are tracked independently of one another.  The graphical front-end for the game lets you move between your office and your garage/hauler, and in the former you can choose which events you wish to participate in each week. You cannot participate in more than one event per week, so if the idea is to win a local championship, it might mean passing on bigger prizes like Regional races.    The money aspect of career mode is pretty important. You can repair your car element by element, for a price. You can do so to a certain extent in-between heats at an event and completely between races. However, that price means less money is available for upgrading your car or buying a better one.  The races themselves follow the real rules of the sport. You get a few laps to practice and two hot laps of qualifying. With that position, you race a heat. Turn in a great performance there and you might get to participate in a ~Trophy Dash~ (made more interesting by the fact that winning one doesn't seem to win you a trophy!). If you don't do well in the racing heat, you will be relegated to racing with the lower half of the bunch in what's called ~B Main.~ If you should do poorly there your weekend is over. But do well enough and you can get promoted to the ~A Main~ (the main event).  At the end of the weekend you get your prize money and go back to your headquarters to fix or upgrade your car, pick new events to race in, etc.  The races are no Winston Cup endurance events. 15-20 laps is the most you should have to put up with, and the laps are quick, lasting 15-20 seconds on average. So each race is a sprint, and mistakes can be hard to overcome.    Full Race replays are available, but you cannot save them. There's just one set of trackside cameras, and that's too bad because the 'look' gets repetitive quite quickly. In the replay you'll see very nice looking dust churned up behind your car, but other than that your car doesn't appear to be interacting with the surface. No marks or visible ruts are carved into the surface.      The game supports force feedback input devices, and with the Logitech Momo, the game felt reasonably good, with a lower spring rate when the car is loose.  The game is less forgiving than its console counterpart when it comes to collisions and you can wreck yourself completely out of the race. You can also bring out yellow flags, and the game will automatically cut forward to the race restart with you in the proper position. One thing some people may not like is the return of the ~wall-glue~ that Papyrus' NASCAR series was once famous for. If you brush the wall, you'll often nose around facing it to a stop in short order. Your forward momentum gets killed a little too fast to be believable. Although you can reverse, it's very easy to stall the car. In my experience, it's best to stall the car by staying still and waiting, because a yellow will come out and you can resume, whereas trying to get yourself going again can result in another very annoying feature: the illegal lap.  Illegal laps are the bane of this game, because, in my opinion, they aren't administered fairly. If you spin all the way around and try to turn around to get going again, the game will think you're going in the wrong direction and hit you with an illegal lap, which disqualifies that lap from counting. Spin out in 4th, lose a few spots and resume, and expect the dreaded illegal lap message to come up on your screen and you're back in 16th. Also, if you cut too much of the inside of the course (often just a raised dirt or grass infield), you'll get an illegal lap. That's quite fine and understandable, but again, if you go a little loose and try to get back onto the course, if you don't somehow come off onto the track fast enough: you guessed it: illegal lap and the race is shot.  What makes this especially horrifying is that on some circuits it's quite easy to get beyond sideways and either nose into the infield a bit, or spin completely around. You can have everything seemingly hooked up correctly in mid corner and then the camber of the track changes or you drift wide. As you turn in the car just tries to swap ends on you. This makes mistakes easier to make, and then this gets exacerbated by the ease with which the game decides you've created an illegal lap condition. That's yet another reason why, when I spin out, I just sit on the brake, wait for the ~You stalled it~ message and let the game restart me, because this way I'm less likely to lose a lap than I would be trying to get going by myself again. Hopefully the people at Ratbag will recognize this and fix it in a patch.  Car setup is available in the garage, and things like rear axle width, spring softness on each corner of the car, weight jacker, wing angle and wing position (forward to back) are provided for. With these and other settings, you can customize car performance, but little help is provided for you to do this. I usually end up just altering wing position and angle based upon where I need the grip.  You can also tweak your car's down force during the race by pressing a key or button to raise or lower the wing angle to within a certain deviation from your setup. It's hard to really notice how much of a difference this makes. Usually it's the car's fundamentals (its horsepower, weight, etc) combined with your driving abilities more so than it is car tuning. That's not to say at the game's higher levels the tuning doesn't become more important, just that for a majority of drivers, you'll have to blame your own abilities rather than your lack of setup knowledge for your mistakes.  The AI of the other cars varies from competent to abysmal. In Bristol, AI cars wrecked me and each other with frightening regularity, while on some other tracks, I felt they raced in a more disciplined manner. The biggest difficulty is dealing with the fact that everyone is going around the corners at least partially sideways, so you don't just ~drive around~ other cars, but try to control how much you slide sideways in the corners so as to hold your line. AI is another area which could be smoothed out by a patch.  Multiplayer can be done either directly, via IP address, or with the integrated interface. Only one or two servers were up at the time of this review, but I think that this ultimately will be where the game stands, as no computer controlled race can match up to real competition. Since AI won't be a problem here, we're going to see some decent matches. Overall, I give the game a qualified thumbs up. Fans of this sport should absolutely love this, NASCAR fans should like it, and casual users should at least try a demo of it to see if it strikes them as fun. As is the case with most PC sims, a wheel is highly recommended to truly get the most out of the title. Since the races consist of short sprints rather than long NASCAR-style runs, you can compete in short blocks of times, so for racers who want a realistic fix without an impossibly large block of uninterrupted free time, this game fits the bill.A very solid representation of the sport, approachable for many different users, but mastering it will only come with a great deal of time and effort, as is the case with many quality sims. I might well call it ~NASCAR for the Time-Challenged~.The graphics and sound are excellent, and the real sport should have nothing to be ashamed of with this title.", "date": "Mar 24, 2003"}