{"name": "Furious Karting", "name_review": "Furious Karting Review!", "ref": "https://www.ign.com/articles/2003/03/25/furious-karting-review", "text": "Sooner or later, every athletic event in the known universe will be turned into an ~extreme sports~ game.  I mean, if Razor scooters can be ~Extreme~-ified, what can't?  We all knew it was only a matter of time before the rough and tumble world of professional teenaged go-kart racing received the video game treatment, and that time...IS NOW!   Abandoning the cute and fuzzy stylings of previous mascot-themed kart games, Infogrames' Furious Karting tries to take a more edgy, realistic look at the gritty world of competitive go-kart racing.  The thing is, it only tries about half way.  Sure it has ~Hip~ young people instead of plumbers or bandicoots, but how seriously can we be expected to take a game in which you throw chickens at each other?   Something of a cross between a traditional kart game and a realistic racer, Furious Karting (or Kurious Farting as its called by those who frequent the Xbox boards) isn't exactly a bad game.  The thing is, it's not really a good game either.   Furious Gameplay   Controlling your furious little kart is a pretty straightforward affair.  The R trigger goes, the L trigger brakes.  Turning is accomplished with the left analog or the D-pad.  You know the drill.     In a relatively interesting twist, Furious Karting allows you to move your racer around in his seat with the right analog stick.  This is how most of the game's tricks are accomplished.  Leaning one way while turning the other will cause you to pop up on two wheels, and leaning while in midair will cause your kart to spin in that direction.  It's not exactly Tony Hawk, but it works well enough.   Pehraps the biggest way in which Furious Karting tries to set itself apart from most other kart games is with its team-oriented gameplay.  As a member of the Yellow Sharks or T.N.T., your primary concern is that your team wins each of the game's championships.   Sometimes this means taking one for the team.   For example, let's say you're way behind in the stats three races into a five-race championship.  Your coach may actually instruct you to let a certain member of your team who's ranked higher than you win.  This isn't a suggestion, it's a command.  If you come in first, it's game over.     One time I even finished first in the championship standings, along with first in the final race, but my coach still told me she couldn't stand to have me on her team and that I needed to pack my bags.  Maybe I'm just not a team player, but this strikes me as really, really stupid and absolutely no fun at all.     Furious Combat is fairly basic.  The B button swings your bat, which is your only melee weapon. The A button fires powerups, which are littered all over the course.  These Furious pickups include speed boosts, grenades, oil slicks, and a chicken that slows people down if they run into it.  While the chicken is at least a little amusing, most of these weapons just aren't very interesting, or even useful.  The worst of the lot has to be spring.  It makes you do a flip.  That's it.  It doesn't hurt anybody, or speed you up, or anything like that.  You just flip.  Hey, at least you get some Fun points!   That's right: fun points.  Whenever you do a trick you'll be presented with a message along the lines of ~You gained 0.2% fun!~  This has got to be the first game ever that actually tells you how little fun you're having with it.   Those fun points aren't just for information's sake, though.  The more fun points you accumulate, the faster your tricks become!  What does faster tricks mean?  More fun points! Meaning faster tricks!  Resulting in more fun points! Dear god kill me now!      Then there's the Karma points.  Guess how you get Karma points?  No, not by being nice to people, you idiot.  You gain Karma by beating the tar out of your opponents.  Duh.  Of course, you lose Karma points if you whack a teammate over the head with your rod of aluminum death.  For this reason, we have the X button, or as it will from now on be known, the apology button.  If you accidentally deliver a skull crushing blow to your friend's head, just hit the apology button and presto!  They might not be mad at you any more.  The more Karma points you have, the less likely your friends are to stay mad at you.   Compared to the Fun and Karma points, Speed points aren't very thrilling.  You earn them by winning races and they make your kart go faster.   Along with improving your racer's stats, you can also do some rudimentary tinkering with your kart.  Top speed vs. Acceleration ratios can be adjusted between five preset gear positions, and changing the position of the karts seat will affect the degree of oversteering, making the vehicle more or less prone to sliding.    Furious Karting's multi-player support is barely adequate at best.  Apart from the standard four-player race, the only game included is oh-so-hiply named ~Jam Battle.~  Jam battle is apparently a fancy name for ~keep away,~ because that's all this is.  One player starts with a CD icon over his head, and a bar in the corner of the screens slowly fills the longer he has the CD.  If somebody else runs into that person, they get the CD, and try to keep it away from everybody else.  Exciting stuff.       Furious Graphics   The visuals of Furious Karting aren't exactly ambitious, but they do what they're supposed to do tolerably well.  Everything is bright, colorful and cartoony.  I'm not sure how ~Furious~ a stylistic choice this was, but it works okay.   The game's environments, for the most part, are duds.  Sorry Infogrames, but I really don't need to race around inside a shopping mall.  I know that malls are cool and extreme and all the kids like them, but that doesn't mean that they make a good place to go Karting.  There are a few bright spots later on in the game, like the red and blue sky in the snow levels, but these are few and far between.   The racers themselves are also a bit on the boring side.  Furious boring.  After the Amateur races, teams are assigned uniforms, causing them all to look completely identical.   I know this is supposed to be realistic and all, but that doesn't make it very interesting to look at.     While the game runs fairly smoothly early on, choppiness becomes a bit of an issue once you start driving the faster vehicles.  It's never so bad that it really prevents the game from being playable, it's just a little annoying.   Furious Sound   As far as the quality of the game's music goes, well, I really hope you've ripped some CD's to your hard drive.  You're going to need them.     These songs are extreme in that ~Disney Channel program about hip pre-adolescents who listen to extreme rock 'n' roll songs~ kind of way.  In other words, they're not very extreme at all.  A mixture of tepid, non-threatening rock and tepid, non-threatening hip-hop, this stuff just isn't very good.  Of course, this makes the fact that there are only eight tracks, four for each team seem like a good thing.  Just be thankful that the game supports custom soundtracks.   Even more annoying than all this Furious Music is the Furious Voice Acting.  For some reason, it seems that every Furious Karter hails from a different part of the globe.  You've got a Russian Karter, an Indian Karter, French, English and so on.  I swear, it's like they're trying to form Captain Planet or something.  During races they spout ~with it~ catchphrases like ~Raise the roof!~ in heavily accented English.  Ugh.   Furious Karting does get a few creativity points for trying to utilize what it calls ~Interactive Music.~ Basically, the game's soundtrack is divided up into two ~CD~s, one for the Yellow Sharks and one for T.N.T.  Depending on which team is in first place, you hear tracks from one CD or the other.  It's at least a little neat and its good for letting you know who's ahead. Unfortunately, you can't use a custom soundtrack as your opponent's CD, so unless you're in first the whole time, you're still going to be hearing lots of those crappy Furious Karting tunes.  Consider it an incentive to win races.  Furious Karting tries really hard to distance itself from the likes of mascot-based kart games like Mario Kart and Diddy Kong Racing.  Unfortunately, the game is just nowhere near as fun as those games.  It's so cartoony that no fan of serious simulation-type racers will likely give it a second look, but it's just realistic enough that people looking for something along the lines of the mascot-based games will be turned off as well.  If you're a complete and total kart racing nut, you'll probably find something to enjoy in Furious Karting.  The rest of us, however, would be better off saving ten bucks and picking up a platinum hits title or something.", "date": "Mar 25, 2003"}