{"name": "Super Puzzle Fighter II", "name_review": "Super Puzzle Fighter II Turbo", "ref": "https://www.ign.com/articles/2003/04/01/super-puzzle-fighter-ii-turbo", "text": "was an original puzzle game released back in the mid 90s as the company's attempt to offer its own take on the Tetris-style falling-piece puzzle genre that always does so well...when done right. This game is, incidentally, a hugely collectible game in the PlayStation and PC circles because it's been out of print for years. Capcom has revived the series in this spot-on conversion of the design, and if you're already fanatical about the series this is your chance to pick up a really styling version of the game design. Its heavier focus on random elements might not be everyone's cup o' tea, so keep that in mind if you're itching to find the Puzzle genre's ~Next Best Thing.~ Features Three game modes Eight playable characters (hidden ones, too) Single system multiplayer Link cable support for two players (multiple cartridge only) Cartridge save Only for Game Boy Advance Super Puzzle Fighter II Turbo follows the established formula of the ~match colors to make 'em disappear~ style of game design, and it's obvious that Capcom used Puyo Puyo as a foundation for its own take on the genre. In the game, players maneuver pairs of gems, normal ones, crash gems, or power gems, into a pit where they'll stack up. The idea is, of course, not to let that pile get to high by removing them from play by linking like colors together and hitting but also to screw the other person by dropping Counter Gems into their bin. This is done by arranging the gems in such a way that, when they disappear, Counter Gems will drop into the opponents bin. The amount of Counter Gems dropped is relative to the amount of regular gems removed from your bin, so it's important to arrange gems in a fashion that when one color disappears, the rest will fall into play and disappear as well. Combinations are incredibly important in Super Puzzle Fighter II Turbo.  As players ~fight~ against the computer or another human opponent, specific Capcom fighters (Super Deformed versions) fight along with the action that's taking place in the game. It's purely cosmetic, and it's not like these guys do anything that actually affect the action. They're just duking it out between each other, representing the action that you and the computer are putting forth in the puzzle game. But Capcom needed a hook to get people to notice the game design when it originally showed up to market. And it worked. Each character does have his or her own ~attacks~ that arrange Counter Blocks in specific fashion, so selecting the proper Capcom character to represent your side does come into play a little bit.  There are definitely many, many people who absolutely love the Super Puzzle Fighter game design. I, however, am not among the Super Puzzle Fighter followers. The design is very similar to Puyo Pop, but with additional elements that actually work against the player;  players have to work standard gems into arrangements that will cause a chain reaction, but they're restricted in activating these combinations by even more random factors: if the activating gem of the specific color you're waiting for doesn't show up, all the work that's been done up to that point is thrown out the window. Fans of the series will say that this is half the challenge, and they'd be right. All puzzle games rely on randomness, but in the case of Super Puzzle Fighter II Turbo, I think it goes a little too far, and removes a little bit of enjoyment out of the overall game design.  It's the challenge and strategy that's important, and it's certainly possible to get good at arranging gems in such a way that waiting for a specific activation gem isn't really a factor. Stick with it and you'll obviously find the little strategies in staying alive...but be warned that playing against computer opponents gets a little hairy because the AI has specific ways of working combos in the mix. So if you have a problem with learning combos in puzzle games, there's no way you'll be able to survive in Super Puzzle Fighter II Turbo because, as much as other puzzle games focus on 'em, this game is heavy on the combos.  The Game Boy Advance version has a good amount of features to keep players occupied, including a Street Puzzle mode where players can unlock extras, including modes, costumes, and additional characters, by defeating computer opponents. The game also has link play between two systems, but each player will need their own copy of the game. Though the game doesn't feature single cartridge kink mode, the development team did offer a single system multiplayer mode where each player shares a side of the GBA system; one player on the D-pad and L button, the other on the A, B, and R buttons. This mode is a little...no, a lot awkward, and I found myself more focusing on manipulating the clunky controls instead of focusing on the gameplay and creating combos. Games like Puyo Pop and Columns Crown have already whet people's palettes for single-cart multiplayer, and it's a shame that the development team of Super Puzzle Fighter II Turbo couldn't scale a version back for this mode...because this single-system mode is just not a good replacement. It's nice that it's in there, but it's just too awkward to enjoy freely.    If you're already convinced that this is a great puzzle game (as many, many die-hard Super Puzzle Fighter fans will tell you, the GBA version is definitely one to pick up...especially since this is the first time the series has been officially released in the US since the Saturn and PSX (and PC) versions hit the scene more than a half-decade ago. But personally, even though I'll still pick up this game casually every now and then, I'm sticking with the, in my opinion, better-designed Puyo Pop", "date": "Apr 1, 2003"}