{"name": "Clock Tower 3", "name_review": "Clock Tower 3", "ref": "https://www.ign.com/articles/2003/04/03/clock-tower-3", "text": "During the survival horror craze of the late 1990s, Human Entertainment's Clock Tower series rarely received the accolades that its designers had hoped for. Renowned for its storyline and atmosphere while simultaneously trounced for its complete and total lack of intuitive gameplay, the point and click adventure never pulled itself from the shadows of bigger and better adventures like Resident Evil and Silent Hill. And to be honest, it was rightfully so.   Amazingly, the Clock Tower franchise has managed to find a way to live on, and for the first time since its Super Nintendo incarnation, has been re-engineered by the minds at Sunsoft and Capcom to create an experience that not only transcends its namesake, but other genre entries as well. Bidding farewell to the mouse-controlled setup of versions past, Clock Tower 3 takes the more traditional approach offered by its competitors while implementing a few unique gameplay elements of its own. The result is the single best incarnation the series has seen so far, and one of the scariest adventures this side of Silent Hill.   Story  To reveal too much of Clock Tower's screenplay would be a disservice to the people who buy it. It's the well-laid plotline that serves as the game's strongest selling point, after all, and is by far its most compelling element. Beginning in London 2003, the story begins as heroine and boarding school attendee Alyssa Hamilton receives a panicked letter from her mother. ~Go as far away from the family home as possible~ it reads, ~no matter how enticing it may be to return here for your 15th birthday~. As one would expect, Alyssa becomes intrigued and frightened by her mother's note at the same time and does exactly what she was asked not to do: return to the family home the very next day.   Once there, Alyssa discovers that her mother is nowhere to be found and is instead greeted by a bizarre boarder who has taken up residence in the mansion. Cryptic and most definitely sinister, the stranger disappears upstairs to leave Alyssa on her own to figure out what's happening. Afterwards, things get really interesting as Ms. Hamilton finds herself traveling through different decades in time, involved in head-on confrontations with deranged serial killers, discovering her heritage as a ~Rooter~, and learning the truth of her family's history. To say that it's stimulating is to underscore it; the plotline should grip just about anyone if given the chance.    Gameplay  Returning fans of Alone in the Dark and Resident Evil should long be familiar with the control setup by now. Built entirely with 3D polygonal models, players guide Alyssa through sectioned rooms of much larger environments with pre-determined camera angles differing for each section. Of course, there are a few instances where the camera will begin to move or follow your character dynamically (ala Code Veronica), but for the most part, they remain stationary. Because of the pre-positioned nature of the cameras, however, successfully directing Alyssa from room to room can prove difficult as her sense of North and South changes. So while in one section, pressing up moves you to the top of the screen, the next area will reverse the controls as the camera changes. RE fans have gotten used to it over the years for sure, but for some, it can still prove to be a problem. Especially when navigating tighter spaces in a hurry.   Once players understand how the game works in terms of functionality, it's time to understand what you can or can't do. Now being that the lead character is a 15-year-old schoolgirl, the player's arsenal isn't that diversified anyway. In fact, for a large portion of the game, the only tools that Alyssa has at her disposal are a vial of holy water and the ability to crouch. A defensive weapon to help Alyssa escape wayward spirits or that stage's madman, the holy water is limited in the amount of times you can use it before needing to refilling it, and serves only as a temporary solution to your problem at hand: the things that are out to get you.    In any given level, there are two types of enemies that haunt your path. The first are simple distractions that roam the stage in search of their personal belongings. Should you happen to find these belongings and return it to the spirit's corpse, you'll free it of its obligation to this dimension and send it straight into Elysium never to harm anyone again. If you can't find it, you'll experience the ghost's rather pesky grapping tactics that make it just a little bit harder to advance in your mission. Unfortunately, these creatures rarely provide much of a challenge, and other than a few select examples, are little more than stage filler.   The real menace is the second type of enemy you face --the serial killer. Totaling six in all, the relentless life-taking bosses of each chapter pop out when you least expect it and can put your character in a serious hurt rather quickly. Only conquerable once you've fulfilled all of that stage's puzzle requirements, these main villains are hard as hell to avoid in the latter stages, and unless you've got an open area to work with, can trap your lead quite efficiently.   In helping to avoid these monstrosities, there are several areas in each chapter that can serve as ~hiding points~ or ~defensive weapons~. Though it's a good idea in theory, its execution isn't nearly as effective. To be frank, the serial killers move way to quickly to be fooled by any of these hiding spots (they're on your ass the second they spot you), and yet they work like a charm more often than not. In the first confrontation with Sledgehammer for instance, there's a see-through curtain in the tailor shop in which you can hide behind. As we were running away from him, he followed us right up to the curtain and was practically clipping right through Alyssa's character model, the second we pressed X to hide behind the curtain, however, Sledgehammer was suddenly confused and didn't know what happened to us. Grateful as we might have been, it doesn't make too much sense from a realist's point of view.   One aspect of the game we liked quite a bit was the omission of a health meter and the inclusion of a fear gauge. Rising and falling depending on your situation, the fear gauge affects how efficiently Alyssa can navigate the corridors and how easily she may be killed. Take a few blows from Chopper's axes with a 0% fear factor for instance, and you'll make it through, fill it up to 100% and panic, however, and the axe chop will kill you instantly. It's a cool idea for sure, and the slow-motion image-warping special effects that alter the screen once your character is ~panicked~ adds a lot to the presentation.    Not so lucky are the boss battles. Held at the end of each stage once you've completed all the puzzles, these combat missions see the fear gauge go away and the traditional health meter pop in. It's here that the game shows one of its biggest weaknesses, as each of the six bosses use identical tactics and timing regardless of their position. These fights can get to be pretty hardcore and frustrating, but once you've gotten the timing of each entity down, it's smooth sailing. Your only real vice is controlling your special arrows given to you when fighting these battles. As they cannot be aimed and will fire only in a straight line from where you stopped to charge them. Similarly, the responsiveness of your charge attacks in this mode are pretty stiff, so don't be surprised if you take a few on the chin when you didn't expect to.    Graphics  From a technical standpoint there's a wide number of issues that hold Clock Tower 3 back from achieving the same level of excellence offered by games like Code Veronica or Primal. Seam breaks and overly compressed video in particular cause quite a few problems now and again, and the camera changes sometimes happen far too abruptly for its own good; ultimately resulting in skewed character control.   Artistically, however, Clock Tower 3 is a visual delight. Successfully capturing the dirty, musty look of England's serial killer underworld, the environments are populated with objects and a variety of moving parts. Whether it's the sudden scurrying of a horde of hungry insects or the subtle tapping of growing rainfall, CT3 is straight out of a Mary Shelly novel. And to its credit, the sometimes-bothersome camera does have a few genuine moments of horror -- guaranteed to scare your britches off with its energetic and dizzying angles.   One peculiarity that should be noted though is Clock Tower 3's extreme depiction of violence. It's easily the most realistic and disturbing recreation of videogame murder we've ever seen, and for squeamish adults or concerned parents, this thing could definitely give you nightmares. One glimpse of the scene where a falling victim gets an axe in the back of his skull or the time an elderly blind woman is drenched head-first in a vat of acid, and the proof becomes rather apparent.   Sound  Sound is an incredibly important aspect of any horror experience (be it movie or videogame) and Clock Tower 3 is no exception. Composed by the well-respected Kouji Kubo, the soundtrack is one of the more haunting iterations that we've witnessed in recent videogames and appropriately blends silence with gothic bass for a mixture that's sure to please fans of movies like House on Haunted Hill and Se7en.   Vocals and effects are just as creepy, with somewhat monotone English actors gravelling and hissing their way to an eclectic grouping of serial killer speech patterns. And while the heroine Alyssa does a great job of capturing the essence of a 15-year-old girl, the real star of the show has got to be first boss Sledgehammer and his positively spooky delivery. If you don't find yourself checking over your shoulder leading into your encounter with him, one earful of ~Alyssa~ from his lips should definitely do the trick. Our only gripe is the repetitiveness of some of their catchphrases -- it would have been nice to see the in-game speech be as varied as the cut scene's language.Though it'll probably only last you five to six hours the first time through and the puzzles are far too simplistic, Clock Tower 3 still comes across as a surprisingly enjoyable survival horror game. Rough around the edges in terms of gameplay (especially when fighting against bosses) and a little on the short side, it's still one of the scariest things we've played in quite some time. It's the perfect example of atmosphere making up for mechanics really, as Capcom's revitalization of the franchise gives plenty of hope to those of us who only see Resident Evil and Silent Hill as the true ambassadors of terror. Genre fans should give it a rental first and buy later, they definitely won't regret it.", "date": "Apr 3, 2003"}