{"name": "Hamtaro: Ham-Ham Heartbreak", "name_review": "Hamtaro: Ham-Ham Heartbreak", "ref": "https://www.ign.com/articles/2003/04/04/hamtaro-ham-ham-heartbreak", "text": "In October, Nintendo officially wrapped up publishing on the Game Boy Color with Hamtaro: Ham-Hams Unite for the system, a cute and well-designed adventure game based upon the downright adorable Hamtaro: Little Hamsters Big Adventures series running on the Cartoon Network. This first official Nintendo of America hamster game was a surprisingly good game on the system, even if it wasn't very masculine to admit liking it. The Hamtaro series makes its GBA debut with Hamtaro: Ham-Ham Heartbreak, an extension of the Game Boy Color game that's improved both in graphics and sound, and though the storyline and challenges are completely new, the design is virtually identical to the first game in the series. The decent GBC game design still fits the GBA market, and Hamtaro: Ham-Ham Heartbreak is still a surprisingly engrossing and fun little adventure. Features 20 hour quest 86 Hamchat phrases to learn Link cable support to trade dances Cartridge save (one slot) Only for Game Boy Advance  The original Hamtaro adventure featured a theme that was pretty safe for those macho types; the task was to simply gather all your friends together for an event that was set to happen back at the clubhouse. The plot for Hamtaro: Ham-Ham Heartbreak's a little more lovey-dovey: a mean ol' hamster has caused break-ups in relationships all over the hamster community, and it's up to Hamtaro and his ~girlfriend~ Bijou to remove the hate and put back the love in all of the 20 relationships in the game. Yes, it's absolutely clear: Hamtaro: Ham-Ham Heartbreak is one sugary-sweet adventure. It's like washing down a mouthful of gummi bears with a 2-liter bottle of Jolt. But even the oversaturation of cute and happiness has its charm, and unless you're really insecure about your masculinity, its adorableness isn't so over-the-top to turn you off of the overall adventure.  Just like the first game in the series, Hamtaro, while totally chatty in the cartoon series, can only talk in the Hamspeak language in the videogame version. As the game's plot opens up, Hamtaro ruins his Ham-chat Dictionary, wiping out all the words that he learned in the Game Boy Color adventure. The task is to fill up the Ham-chat Dictionary with words heard in conversations with other hamsters, because Hamtaro can only say words that he's learned throughout the adventure. Each of the 86 different words in this edition's Ham-chat vocabulary activates an action that can solve puzzles all over the different areas. He's given the absolute basic of Hamspeak words: the standard Ham-Ham greeting (~Hamha!~), a dig command (~Digdig!~), a sniffing command (~Hif-hif!~), and a rolling attack (~Tack-Q~). With these first four words in your vocabulary, you must set off into the real world and put them to use. When you meet a new face, give them a friendly ~Hamha!~ If you don't get anywhere with that critter, give them a rolling ~tack-q~ to force a conversation out of them. From there, it's up to you to figure out the proper words necessary to get through the adventure.     The puzzles in Hamtaro: Ham-Ham Heartbreak are more trying to figure out the proper thing to say to the right hamster. There's a finite amount of things you can do in the game, so if you don't get somewhere in one area, simply run around the different locations until you can activate a conversation with your limited Hamspeak vocabulary. When your Ham-chat choices include blanks with question marks, that's a prime hint that you need to hunt down another character in the game and learn a new word. But even though the game's tailored for the younger crowd, there are many places that can definitely put up a brickwall in your progress; it's an easy adventure, but it's not a cakewalk. Like the past Hamtaro adventure, the roadblocks are few and far between...and usually it's because you've overlooked something extremely simple.  There are very few changes from the original Game Boy Color adventure and the new one created specifically for the Game Boy Advance, but they do exist. In Ham-Ham Heartbreak, Hamtaro is paired up with Bijou partway through the adventure, with many of the animations of the Ham-Chat words related to two hamsters instead of one. And where many situations in the original Hamtaro were limited to four words, there are situations in this GBA adventure where you'll have to employ as many as eight words at a time with a specific individual. There are new mini-games to play as well as more situations that require hand-eye coordination (including a couple boss battles along the way). But essentially, everything that was said about the game design in our review of Hamtaro: Ham-Ham Heartbreak still applies to Hamtaro: Ham-Ham Heartbreak. The game designers obviously didn't futz around with the formula established on the Game Boy Color, as they based the whole new story and adventure around the same gameplay elements that made the original adventure so charming.  The game's visuals aren't a massive leap from the Game Boy Color game; it looks like the designers lifted a lot of hamster sprite assets from the GBC game and reused them for this GBA adventure. That's not entirely a bad thing, though; the characters may lack color and detail, but they have a lot of cute little animations shared across the board. But, the backgrounds are far more lush and colorful this time around, and the programmers even push a few nifty GBA sprite effects to show that the hardware power didn't go to waste. The audio is much more lively this time around, even if the ham-chat vocals are simply the same FM synthesized squeaks that were used in the GBC game. The music is very upbeat and catchy, and the tunes definitely put the GBA's hardware to good use.  And though many of the additions are a little on the fruity side, the developers throw in a bunch of things to do that can be accessed even after the main adventure's over. Spend some sunflower seeds and buy some clothes to play dress up (and change the title screen in the process). Put some Ham-Chat words together and dance the night away in the Ham Jam room. Collect gems and combine them to creat accessories. Or, hop over to Fun Land and play three mini-games in the game arcade. There's so much additional stuff that it extends the lasting play a great deal. Look, I don't expect the truly die-hard gamer to drop everything and rush off to the store simply because there's a new Hamtaro game out for the Game Boy Advance. Controlling cute hamsters into having cute conversations is definitely not everyone's cup o' tea, but it's hard to ignore that the game has a certain engrossing charm. Hamtaro: Ham-Ham Heartbreak is just as clever and fun as the past game on the Game Boy Color, and if you don't have a problem putting something fuzzy and adorable in your system, there's a great chance you'll have a fun time with the rodents.", "date": "Apr 4, 2003"}