{"name": "Tube Slider", "name_review": "Tube Slider", "ref": "https://www.ign.com/articles/2003/04/07/tube-slider", "text": "We were surprised when corporate giant NEC in January announced that it would return to the console publishing arena. But we were even more shocked to learn that the developer of the unfortunately named Tube Slider for GameCube was none other than NdCube, a company jointly owned by Nintendo and also incidentally the talent behind the Game Boy Advance version of F-Zero.  Like F-Zero, Tube Slider is a futuristic racer. Its vehicles are hovercraft. They have turbo boosts and side rockets. They race across unpredictable twisting tracks, too. See the similarities here? But unlike F-Zero, the courses all take place exclusively inside transparent tubes. Another difference lies in execution, at which point F-Zero really begins to separate itself. For while Tube Slider is in the end a decent racer -- neither exceptional nor sub par -- it lacks the speed, balance and depth that Nintendo's franchise has become famous for.  The Facts  Fast-paced futuristic racer Compete on 10 tubed courses set across the globe Choose from 15 enhanced and ultra-tweaked hover crafts Multiple gameplay modes from Grand Prix to Free Run and Tutorial Turbo and boost enhancements temporarily add speed to vehicles in races Side-boosters on vehicles can be used to take sharp turns Four-player mode Does not run in progressive scan mode or support Dolby Pro Logic II   Gameplay The premise that powers Tube Slider couldn't be simpler. There are futuristic hovercraft and there are twisting, turning, tubular tracks that are there for the racing. That's it. The game's meatiest mode -- and that's not saying much -- is its Grand Prix, in which the point is to race through a series of tracks and unlock even more courses -- 10 in all -- and in turn speed through them. The only other single-player mode is Time Attack, which is fairly self-explanatory. It's shallow, definitely, a direct contrast to bigger and better productions like XGRA and the still tentatively titled F-Zero GC.  Play mechanics are equally simple, but not without entertainment and satisfaction. The title aspires for F-Zero-clone controls, but fails to deliver the trademark polish. Analog stick steers, A accelerates, B and Y jettison the vehicles with 'Booster' (an instant boost of nitro) or 'Turbo' (a continuous, but less powerful boost). Meanwhile, R and L are used for side-boosters, which can be used a la F-Zero in sharp turns. X and Z button, finally, change the camera angle. There's not a whole lot to learn, but what's there is fairly intuitive and it feels for the most part well done. The game's big feature, if any, is the ability to drift behind opponents and steal their boost, which can then be used for additional speed. The problem is that the opposition can do exactly the same thing to players and often does, siphoning away any sensation of thrust gained with the boosts.  Tube Sliders is incredibly unbalanced. The first three races are an absolute cakewalk. One could speed through them with his or her eyes closed and still probably rank first place in every lap. It's obvious these opening levels are designed to teach the player the ropes. The difficulty immediately changes, though. As soon as one opens up the second set of tracks, it becomes both hard and frustrating. All of the sudden opponents can effortlessly keep up and outpace players and oftentimes they will unfairly crash into one's vehicle and send it skidding to a dead halt, at which point a last point ranking is almost guaranteed. There is no effective method to avoid this, so players must simply do their best and pray it doesn't happen. Meanwhile, there are some track layouts that are downright baffling. Arrows on walls, floor or ceiling usually indicate the best route to take around corners or through drops in tubes, but sometimes if one follows the arrows their vehicle will go careening into mid-air and they will lose all of their speed. Why? However, there are times when the track design works brilliantly. The fact that the hovercraft can race on any and all sides of tubes is very welcomed and indeed, successfully transitioning from ceiling to sidewall is, well, fun.      Perhaps the biggest drawback to the game is that overall its race speed is just too slow. It doesn't move anywhere near as fast as other racers of this nature, which is definitely disappointing. And while the pace does improve as different leagues are opened, it never becomes fast or intense enough for our liking.   On the plus side, there is a four-player Versus Mode, the last of the game's play styles, and it runs pretty well, but again because the speed of the title is decidedly lacking the majority of players probably won't care.  Graphics Tube Slider has visual ups and downs. The design of the craft is acceptable. The tubes themselves are unique and extremely colorful. They feature transparencies and multi-layered backdrops that scroll by in a blink. The layout of the tubes, twisting and dropping, rising and turning, is equally well done, though sadly there are no major loops or jumps. The tracks are nicely varied in theme so that players will see futuristic backdrops as well as mountainous terrain, a big tree, a suspended bridge and more. And everything runs at a nice 60 frames per second, an essential in these types of games.  However, on the flipside, most of the ships and environments are constructed using a minimal amount of polygons, perhaps to save on fluidity.   Tube Slider  The texture application is unimpressive as oftentimes the locales will look saturated with color or unrefined in detail. A total lack of any graphical bells and whistles like an advanced particle system or lighting or shadow effects also stays this game's visual presentation in the realm of first-generation software. The title does not run in progressive scan mode, either.  Sound Nothing exceptional here. The music is sub par in nearly every way thanks to a cookie-cutter selection of techno tunes and bad guitar riffs that are both uninspired and lacking clarity. Meanwhile, the sound effects suffice, but aren't overpowering. So players shouldn't expect to hear thumping engine noises as their craft turn corners, nor should they expect any reverb or echo while zooming through the tubes. A standard hiss signals engine speed and there's not much else to speak of.Tube Slider is an above average racer. But it's not in the same league as more ambitious entries like XGRA and F-Zero. The game wants to be F-Zero. Hell, it might have actually been F-Zero at one time or another. Its control scheme and play mechanics sure seem similar. But in the end the game can't compete with the F-Zero's greater sense of speed, balance and visual finesse, and with only one gameplay mode consisting of 10 tracks that can be whipped through, it lacks the depth to keep you coming back for more.Worth a rental. But don't buy it.", "date": "Apr 7, 2003"}