{"name": "Midnight Club II", "name_review": "Midnight Club II", "ref": "https://www.ign.com/articles/2003/04/08/midnight-club-ii-3", "text": "Only a short time ago there were two arcade-style racing games that ruled the roost, Sega's Daytona USA and Namco's Ridge Racer series. The years have passed quickly and much has changed. Now we have racers as massively popular as Gran Turismo, as quirky as Auto Modellista and as blazingly fast as Burnout.    For the moment, Sega and Namco have lost their respective mind shares in the racing genre, partially because gamers want more than just a good arcade racer. They want more and different things. With Gran Turismo ruling the house of simulation on the consoles, what exactly is king when it comes to arcade racers? In the short team, we have Burnout 2 and Need for Speed: Hot Pursuit 2, but what have we in the long term?    The developer formerly known as Angel Studios (now Rockstar San Diego) and its parent Rockstar want very much to burn a racing series into your memory cells by the name of Midnight Club, specifically the second in the relatively green series, Midnight Club II. Born from an arcade sensibility, enabling players to race around large, open cities, and successfully mixing adventure elements into the racing genre first introduced by Beetle Adventure Racing and SF Rush,  Midnight Club II adds its own special nitrous into the engine.    Though it's been two years since the first title (Midnight Club: Street Racing), this sequel is going to deliver racing fans with an enormous thrill. This baby is going to burn more than just your memory cells, it's going to burn your weeknights and weekends, and when you get online, I suspect it'll blaze through even more of your precious time. I can calmly and intelligently tell you that Midnight Club II has earned the right to stand next to the arcade's big boys.    Gameplay  The Basics  As with all Rockstar games, illegality is inherent in the premise. Whether it's smuggling black market goods across borders (Smuggler's Run), turning your career around from a thug to a crime lord (Grand Theft Auto) or simply racing through civilian streets at night against other hot rodders (Midnight Club), there is something here you for your criminal, ~wild.~ Based on the sub-culture of illegal street racing, Midnight Club II enables players to strap into highly customized, non-licensed street vehicles and race through three metropolitan areas (Los Angeles, Paris and Tokyo) in checkpoint dotted courses. But you probably already know that.   Head-to-Head Available! Want to know if should buy the Xbox, PS2, or PC version of Rockstar's high-octane, inner-city racer? Just head over to IGN Insider to learn all about each version. In this feature we break down everything in a point-by-point comparison with side-by-side screenshots!  This is must-see material. And, if you already own the game, get the strategy guide.  Read It Now | Get the Guide   The game deals out more than 28 street machines over the three massive cities, and you earn all but the first one. Depending on the race, players can either follow an obvious course, or when they encounter more sophisticated races, they must find their own routes, using quick instincts and knowledge of the city's side streets, alleyways, shortcuts and ramps. Like the first in the series, the open design provides players with intelligent choices to make, instead of fixed rails in which to proceed. It runs at a smooth 30 FPS, with seldom drops in speed.    Career mode starts players off in a city and enables them to freely choose an opponent by clicking down on L3 to flash their lights, communicating the desire to drag. Like in the first, players follow the opponent to a point and the opponent sets the course. An onscreen map appears indicating where designated checkpoints are located, and arrows within the checkpoints indicate where drivers must turn next. It sounds simple, but given the speeds one reaches, they're very much needed.    One might race against a given character two or three times to finally earn the pink slip to their car, which can then be selected for any future race. The vehicles are already ~tricked out~ so there is no customization other than changing outward colors. Once players beat all the characters in a city and defeat the bosses that rule them, they move onto the next city. The progression is LA, Paris, Tokyo.    Career mode earns players cars, respect and opens up courses for all other modes. It's the story part of the game, and though it's better than the first because of its depth and variety, there isn't really a story. It's one single challenge after another, and they're rarely if ever connected. The characters you meet are cooler and less stereotypical for the most part, and there are more of them. I didn't laugh out loud like I did in the first, given its blunt caricatures. Instead, I was only mildly amused. Many are predictable, like the Italian ~Primo~ or the English guy ~Blog~ (or something like that). These characters just struck me as trying too hard to be Italian or English. But that's neither here nor there.   Arcade mode offers Cruise mode (just goof off driving around), Circuit (race any courses you've opened in Career in longer, lap-based races), Battle (which enables players to vie against another player in split-screen mode or against seven others online in the games Detonate and Capture the Flag), and Race Editor (a nifty track editor which lets you create and save courses for off or online play). I'll get into the other areas later, but it's extremely cool that one can create and use their own courses online using the Race Editor. The editor is a quick read. Players can't design a course, but rather they can use the map, laid down in a grid, to place checkpoints anywhere in the three cities. Sample it for about five to 10 minutes and you have a personalized course. Eight tracks can be saved to a memory card and loaded online. Nifty.   Online mode enables players to race with any car and in any city online that they have opened in Career mode. Using peer-to-peer broadband connections only (no dial-up connections will work), players will not encounter ticks or hitches from servers. Players also can tailor their races using cars, bikes, courses, types of races, and other variants as the criteria. Up to eight players can race simultaneously. Online play is available instantly upon boot up.    Midnight Evolution  What made the first Midnight Club so fun to play was that it was a cross-genre arcade racer that was instantaneously easy to delve into. One could drive all over the city in Cruise mode and just goof off. Similar to the notion in Grand Theft Auto, Rockstar's Midnight Club II offers gamers the ability to experiment with the populace and the environment. The arcade style of racing was pleasing because the controls were simple and the game delivered an instant pick-up-and play quality. All you had to do was learn the paths and you were on your way.   Midnight Club: Street Racing made the PS2 launch date, and so it lacked a few things, such as a polish, that third city and online play among other things. And so Midnight Club II picks up where the first left off. Strangely, at first it's difficult to determine exactly where it picked up. But as one plays through it unlocking cars, abilities, cities and whatnot, one comes to the realization that this second endeavor is a finely polished, highly tuned sequel. It's a natural evolution of the first game with logical, organic improvements that manifest during gameplay.   The career mode, for instance, perfectly demonstrates this point. It's bigger, more robust with challenges and races. The first city, LA, might seem like a small one during the first race, but you face off with about eight racers multiple times. One probably races in LA 25 or more times, and given the difficulty level, which is moderate to high, one will race the same course five to 10 times to beat it. You race against the heavy Samoan-looking dude, Moses, at least once and several other characters two or three times, with each race designed through a different section of town. And when you finally face Angel in the final boss stage of LA, you race against him multiple times across the sprawling entirety of Los Angeles.    The three cities differ drastically in design. LA is flat and wide, with less traffic than the others. It's an expansive, monstrous thing. One can recognize certain parts, such as LAX, Hollywood and the Santa Monica State Beach. Paris and Tokyo are different. They're dense with traffic. The latter two levels offer far more jumps, ramps, subterranean levels and buildings to launch from than LA. In fact, the course design in these last two illustrates how the game's overall design has evolved. There are more vertical areas, more shortcuts to examine and seek out, and more secrets, both underground and overground. The race against the Italian ~Primo~ is one of the more obvious ones. At the very end of that particular race (SPOILER) a secret ramp enables players to jump, via nitro boost, across a massive river to the final goal. You literally fly across the sky using this jump. The sense of majestically soaring through the air is quite amazing, quite Rush-like, and damn fine.    Delving into its arcade origins with creative verve, Rockstar San Diego has implemented new driving abilities into the mix. There are the standard things one would think of, such as burnouts and wheelies, but some others that aren't so obvious appear too. Players can adjust their cars in the air so as not to damage them too quickly. Given the amount of banging and smashing done in any particular race, it's a subtle but helpful option. Cars can flip up onto two wheels (two left wheels or two right wheels) so as to slip through heavily trafficked roads. This is simply amazing, given the level of physics, speed and control given to the player. You can drive with an amazing level of precision through a bustling city on two wheels for hours if you want. It's especially necessary in Paris and Tokyo, where the traffic is denser; and it works with remarkable ease. Why hasn't this been implemented before in any game, or done so well? I suspect it's because it's damn hard to successfully program, that's why. However one thinks of them, the tricks, especially rolling onto two wheels, creates more depth and skill to the once straightforward arcade racer.   Evolving in a slightly different way than we would have expected, Rockstar San Diego's Midnight Club II has been tinkered with in several other areas, which should attract a fence-sitting owner of the first game. There are hell-bent cops after your tail. They don't just chase you. They team up against you and all of the other racers. They're pretty smart for cops. They'll perform moves to tip your car, spin you out, or barricade the road. They set up roadblocks and they'll even call in helicopters to lay down a spot light to track you.    Weather affects your vehicle's performance. The normally super grippy vehicles lose traction during rainstorms, so players must adjust by slowing down, oversteering or turning earlier than usual. Lightning storms can brighten the dark rainy sky. And fog sets in. Of these elements, fog is the most difficult to cope with. Usually, players use a combination of the map and simple vision to make their turns, but with fog setting in, coping with 130-mile speeds gets seriously hairy.   Players can race on motorcycles. Here, one could take up the argument that Grand Theft Auto: Vice City has already done that. One could also add the argument that Midnight Club II is, in a sense, just a small portion of Rockstar's flagship series. Fair enough, it's a decent but short-sided argument (and if you ever hear anyone arguing that point loudly, you'll know they haven't played Midnight Club II). The difference, however, is as loud and clear as a bloated 400-pound clown on a tricycle singing Louis Armstrong tunes. Clear, I tell you. Midnight Club II is such a blazingly fast, undeniable adrenaline rush of speed and power, that it's far beyond the level of any race in the Grand Theft Auto series. While the cars in Midnight Club II equal and at times exceed the sense of speed in Burnout 2, the motorcycles smoke the cars in both.    Racing a cycle is just short of being out of hand. You earn your first cycle in LA, and then you must race the damn thing -- and it's insane. It's racing fan's dream come true. For instance, there aren't any nitro boosts for cycles; they simply don't need them. You must learn to drive these speed demons using as much care as possible, while at the same time you're desperately trying accelerate as fast as possible. Cycles have more acceleration and greater horsepower than their four-wheeled counterparts, but they're wily, sometimes unpredictable and less stable than cars. And if you get hit by a moving car your body flies like a tumbling rag doll. To turn in crucial areas, players must learn to shift their weight, which in turn shifts the camera angle (if you choose a behind-the-bike angle). It takes some time to learn, but if you want to ride the cycles it's an absolute must. Cycles can pull off cool tricks too, such as burning out, popping wheelies and performing endos. Needless to say, the cycles add a whole new level of fun to the game. And they add a whole new level to the online racing too.   The cars in Midnight Club II are fast. Fast, fast, fast. They handle extremely well, with a particular sense of ease and solid control. And in case I didn't mention it before, they're frickin' fast. A player can instantly pick up any car and learn to drive and learn its intricacies in minutes. That makes the game sound easy to play. It's not, because the competition gets so good, the courses get so hairy, and the speeds you race are so high (not to mention the constant presence of cop cars and constant traffic) that different challenges are created.    The cars offer super grippy tires. This attribute keeps the races blazingly high speed and your car in the race. Some cars are naturally more grippy than others, but even those have a good sense of grip compared to most arcade racers.    Also, just like in the first game but more so here, these cars handle incredibly well. There is a terrific sense of physics and handling to each one, and a particular sense of arcade anti-realism. The vehicles tumble and crash into one another, they fly and crash into buildings, and they smash into smoldering, desperately embarrassing flaming heaps of carnage (after which your car then nicely re-spawns on the spot). They feel spot-on and handle beautifully every time. The only real weakness in the cars is that, in the 28-plus vehicles, there is a surprisingly lack of variety. They are all designed to fly across the screen, grip well, respond tightly at high speeds, and in dangerously tight situations.   Lastly, the best new element about Midnight Club II is the AI. One won't notice the changes right away given the simplicity of the early courses. But once players have to race any of the bosses, say Angel, they'll see what Rockstar San Diego has dubbed ~railbranching.~ Railbranching is just a fancy way of saying smart AI, or better yet, unpredictable, perhaps even crazy AI. In the more sophisticated races the checkpoints are arranged semi-haphazardly, so that players and AI alike can choose many different routes to get to them.    A smart player's natural tendency is to follow the fastest car and trail it until the course's end, then hit boost, and boom, case closed. That won't work here. The AI cars follow a different route each time. They crash into building corners, each other, and into the cops; they use boost early and often, and they nudge you regularly, occasionally to your demise. The point is, the AI is sophisticated enough so that you can't follow it and win. You have to think for yourself, learn the course and trim those seconds off on your own. This leads to various AI cars winning at any particular time, and it also means that if you follow a different car you might learn some of the game's secret shortcuts. Yes, the AI takes the shortcuts too! Railbranching officially rocks.    Online  Along with the other big changes, Rockstar San Diego knows that the first Midnight Club  needed online play, and in Midnight Club II it gives us damn fine online play. Using the Network Adaptor and a broadband connection only, players can venture online and compete in a multitude of races against as many as seven other human players simultaneously (eight in total). If nothing else strikes your fancy about this game, the online capabilities should. It's easily the best online racer in the PS2 library, and it should stack up as one of the best online games the system has, period.    The secret to online racing is to play through a substantial portion of the Career mode first. Because the online races are dependent on the courses and cars you've opened up in Career, if you've only opened up cars from, say, LA, then you can only race on the courses and with the cars from LA. If you've opened up all the courses in Paris and LA, then those cars and courses are open to you, etc., etc. Obviously, the best course of action is to beat the whole game and then go online, but who has the patience for that?   Players can chat before, during and after a race, using ~Select~ to pull up the virtual keyboard. A USB keyboard is highly recommended so that players can actually type fast. The virtual keyboard works, but it's slow. Players can also chat in the lobbies to help decide where to go, or just to compare experience or vehicles.    Hooking up is simple, and during our handful of sessions online, I found two things to be most welcome. The interface smoothly transitions you from Career or Arcade mode to Network or Online mode, and the connections we played on neither broke nor faltered. I raced dozens of times on full, eight-player courses and the only thing that held the game back was the level of competition. At first I sucked ass, but later on, I wasn't sucking the ass at all, others were (an they were using loopy straws to do it).    There were a few times that a racer disappeared in front of me only to reappear again seconds later, or when a motorcycle opponent crashed and then re-appeared in a streak as he was driving through solid mass, but he must have been just re-spawning, which is normal to enter a race. Otherwise, the framerate holds up perfectly, the connections we played in were problem-free, and the sense of speed isn't noticeably compromised. In larger crashes and pileups and during the few times more than 10 or so cars are on screen together, the framerate does take a hit, but it quickly rebounds and gets back to normal.    The race types are bountiful. Purists can race in straightforward courses, and even more anal purists can race with only a single kind of car. You can mix cars, or mix cars and cycles, or just choose cycles, or you can race only Tokyo, or Paris or LA cars. The list is pretty endless. Players can also select laps, time limits, etc. Players can choose from Battle mode (with Detonator and Capture the Flag), or race mode, in which they can also add power-ups (there are nine all told). Using power-ups is insanely good fun, given the kinds of power-ups. There is Stop, Shield and Ice, but the more likeable ones are Reverse Steering, Go (forcing the car to fly ahead without stopping), Quad (which inflicts four times the normal damage), and Disruptor (which distorts your view). Needless to say, the selection of races (28 courses), plus any personalized edited courses, plus battle games, gives this game immense long-term replay value.     Graphics  Looking at the graphics in Midnight Club II is an interesting thing. At first glance, there doesn't seem like a whole lot of additions or drastic changes. But they are changes indeed. Comparing the old game and the new one side-by-side one can see that the sequel packs substantial visual treats. The quantity of textures throughout all of the cities is significantly better. It's not at the The Getaway level of detail, but this game moves way faster and has way more happening onscreen at once. Paris and Tokyo show off more detail than LA.   The cars still look pretty simplistic (texture wise and in the relatively small amount of polys per car), but they are clean looking, shiny and they reflect like mirrors on a sunny day. There are all sorts of shadows being cast, reflections too, and a vast amount of particles being thrown on screen simultaneously -- not to mention moving traffic with reflective cars, and hefty doses of AI pileups. One of the more obvious and likeable effects is the destructible street lamps, which, when smashed into, send a sparkling flurry of particles bouncing across the screen.   The cities all sport a different look, with LA being kind of murky and expansive, and Paris showing off occasional cobblestone roads and lots of narrow streets, while Tokyo is vertical, urban and metallic.   All in all, one can see that Angel Studios (Damn! It's Rockstar San Diego!) rebuilt the engine and genuinely honed it into a gleaming new piece of slick code. The whole game feels tightly constructed, with no seams, nearly constant framerates, and a polished finish to it, like a perfectly waxed car.    Sound  Sadly, the music crippled my audio experience quite a bit. I just couldn't get into a majority of these techno and hip-hop songs. Each city offers a different set of current sounds, with LA delivering more hip-hop beats, Paris a more Euro-based techno, and Tokyo a tweaked out techno of its own.    Perhaps it's just me, but after listening to the soundtrack to GTA: Vice City, which clearly spoiled us all, the music in Midnight Club II just seemed flat and dull. Of course, there are songs that stand out better than others, and one can actually stop the game and change the music in the middle of a level, but this is the first time in a long while where I simply turned the music off altogether.    The sound effects are tight, original sounding and appropriate. People in the street yell at you, and there is a constant level of teasing from the AI. They roust and laugh and cajole you, but they never step too far out of line. Midnight Club II is a sure-fire hit for anyone who likes to drive and play videogames. It's a rippingly fast racer blending some adventure elements with pure arcade racing. What's more, it is an excellent online game that offers an ostensibly limitless amount of replay value, given the range of courses and numerous race alterations and variations. Technically, the rebuilt engine is an impressive piece of code. The level of physics and AI improvements this game has shown is superb.Except for the soundtrack, Midnight Club II delivers the goods in every way that Midnight Club: Street Racing didn't and then some.", "date": "Apr 8, 2003"}