{"name": "Plus Plum", "name_review": "Plus Plum", "ref": "https://www.ign.com/articles/1999/10/28/plus-plum", "text": "We recently previewed Plus Plum, Takuyo's Dreamcast falling blocks game.  It's Puzzle Fighter with a twist that unfortunately makes things so complicated that you'd have to be a rocket scientist (or one of our tech guys) to play the game with any amount of success.  For the average Joe like myself, Plus Plum ends up being a monotonous gaming experience.  You will, for the most part, already be familiar with the general rules of the game.  Red, blue, yellow, green, white, and purple plums drop from the top of the screen one at a time.  As you position and drop the plums into place, you can alternate their colors in a limited way; red can go to blue, yellow to green, and white to purple.  If three or more plums of the same color are dropped into adjacent positions, the whole group will disappear, and any plums that were above them will come crashing down.  When a group of plums disappears, any adjacent plums will switch to their alternate colors.  The game's unique feature is that it's being played on a balance, with your plums being dropped onto the balance's left platform and your opponent's onto the balance's right platform.  Each plum is assigned a weight value, and when you drop a plum onto your platform, the platform will move down depending on the weight.  Similarly, if you manage to make a group of plums disappear, your platform will move up depending on the weight lost.  If your platform hits the bottom of the screen, you'll loose.  Making the weight of your opponent's plums increase is, therefor, the main point of the game, and this can be done in two ways.  First, your plum weights will collectively increase if you should manage to hit the top of the screen with any of your plum columns.  Also, if you unleashes a powerful combo using a particular type of plum, the weight of that plum on your opponent's side will increase, in accordance with the size of the combo.  A two length combo will result in an increase of only 0.1 or 0.2 pounds, but a combo of length six will slap one of your opponent's plum forms with a weight increase of more than 30 pounds, usually providing for an instant death.  This form of gameplay sounds interesting, and it probably looks like a good idea on paper, but in practice it's far too complicated a system for weak minded folks like myself.  The primarily difficulty arises from the color changes that accompany a group of plums disappearing - most of the time, it's too difficult to conceive ahead of time what will happen when a plum in any given position.  There's just too much to take into consideration when playing the game, and you'll find yourself most often trying to clear the playfield of all the garbage plums just so that you can get set up for one of the three suggested strategies for linking together plums (see below for illustrations taken from Takyuo's web page).  It ends up getting monotonous after a while.  That's really unfortunate, as there are a lot of cool elements to the game.  Similar to Capcom with Puzzle Fighter, Tokyuo has given Plus Plum lots of character by populating the game with . . . well, lots of characters.  We're talking about anime-style heroes and foes, all drawn in a unique style.  You'll see the characters when you play through a puzzle match, although the game doesn't have nearly enough animation in this area, as similar games on the N64 (I'm thinking, actually, of one old Konami puzzle game whose name now alludes me - any help?) did a lot more with the idea.  The main benefits of having the characters can be seen in the one player mode, where you select a character and go through an adorable little story that manages to take you through battle with each character.  The story is narrated through high quality voice acting, the only problem being that the voices can be somewhat drowned out by the sound effects and music (and this comes despite your ability to lower the sound volume).  The story mode and characters are probably the game's best features, and people who like anime characters and voice acting may want to thus look into the game.  If you're looking for an enjoyable puzzle game, though, you should probably stay away from Plus Plum, unless you're a master of mind, and you consider other games in the genre to be way too simple.  -- Anoop Gantayat, IGNDC", "date": "Oct 28, 1999"}