{"name": "Enclave", "name_review": "Enclave Review", "ref": "https://www.ign.com/articles/2003/04/08/enclave-review-2", "text": "With every release of a new system, there is always at least one game that makes the public gasp at the beauty that is shown before them, but gaze in bewilderment at the final incomplete product. On the Genesis and Saturn, that game was Sonic 3D. While everyone was shocked at the ~3D~ characters in the game, actual play was far below the Sonic standard.  Enter Enclave.  When the Xbox version was originally being touted as the medieval multiplayer answer to Team Fortress, everyone took one look at its visuals and fell madly in love. Ultimately, the retail package was far from what was promised. Suddenly the gorgeous environments, cool art style and solid characters and environments weren't enough. The PC version, as we'll soon find out, has somewhat more going for it than its Xbox counterpart, but still fails to deliver in enough critical areas that it will keep players wondering why... Why such an awesome premise, brilliant delivery, and gorgeous engine failed to deliver perfection?  As should be obvious, the details are extremely well laid out and positioned. Serious time and effort has been put into Enclave's visuals and it shows; however, if you couldn't tell already, this game is plagued by some egregious gameplay problems. In the end, Enclave frustrates and amazes in more ways than one.  Tolkien-esque, the plot of Enclave is a rather rich one told in classic videogaming form. Dark times are rapidly approaching the noble kingdom of Celenheim. Darkness, the kingdom is familiar with -- it knows war well. Centuries ago a vast army led by the demon lord Vatar crossed the wretched Outlands and invaded the magically enchanted land of Celenheim. Vatar believed that if he could posses and harness that magical power that seeped forth from the Earth, he would be nearly invulnerable. He was wrong.   But boy did he ever try. Thousands upon thousands of evil men and beast pushed their way into the goodness of the world. The mighty Celenheim stared into oblivion. Its valiant armies stood against any challenge but buckled when the sheer numbers and viciousness of the horde swept over them. As Vatar's foul armies laid waste to the countryside and spilt the blood of any man, woman or child in their path, one great wizard stood to halt their progress. With a scream of pure anger and fury the wizard thrust his staff deep into the earth and ripped it open. From his rage burst forth an immense power and a vast, impassable chasm opened and devoured Vatar, but also separated the lands in the process. Victory was for the light, but joy was not to be found.   Vatar's legions retreated to the outlands, brooding, waiting, boiling in their own rage, and praying for the return of their wicked master. Celenheim, protected by the rift, rebuilt, but unity was lost.  Fast forward many, many years. The great rift that once swallowed evil incarnate is reforming. The world is changing once again. Magics that fuel the dirt and water are knitting the broken soil back together. Some areas of the void are now slim enough to be traversed.   Vatar's army is restless. Seeing the land merge before them, they amass, build mighty weapons to lay siege to Celenheim and arm their legions of evil with sword and sorcery. But Celenheim will not be defeated easily. It is battle hardened and its warriors know no fear. As the horde approaches, defenses mount, the pace quickens, heros stand, and cowards fall.   Enter you.  Awesome, no? It's delivered quite well, too. Even the menus are sleek and full of life. Each portion moves, contorts and shifts into the next bit of functionality with a dark but sweet sense of style; then you play. As either a force of light to be reckoned with or savage subservient minion of the dark, the story, like the menus, is functional and delivered admirably the whole way through. Decent voice acting that wavers with the occasionally childish receptionist chiming in, tells the tale well. Brilliant audio effects immerse the player from front to back. Non-interactive in-game cutscenes weave each mission into a larger game. A map ties the greater storyline and linear singleplayer campaign together in a believable fashion. Hand drawn cutscenes read like the flipping pages of a book between sets of several missions... It's that kind of fantastical lore we miss in our action titles. Die by the Sword, Blade of Darkness, where are you now? Enclave certainly has the allure and it develops decently. Though lacking the kinds of in-mission interaction, non-linearity and loving, superficial books of fiction titles of the sort often come with and now demand, delivery and immersion are almost spot on.   It's not with story and presentation that I find true fault (even though the many pages of story that came with Warcraft III and that map that came with every Ultima game ever made were really neat), it's with the play. Enclave is on the right track to greatness, but major flaws in many departments keep this game back from becoming a serious, full-fledged, uncontested winner.  We don't suffer as much as the Xbox version. I found our first-person view to be ideal for normal play. But strangely and most confusingly, Enclave offers the tiniest of a sand speck of a fraction of the depth of Morrowind, yet it actually depends on a similarly rudimentary level of combat. What the hell is that about? It's like Golden Axe went 3D but forgot to add some more gameplay.      Basic hack and slash combos are provided for, but advanced techniques like those found Die by the Sword, or even a more simplistic but still engaging combo system like Buffy, just isn't there. This makes melee combat repetitive, fast. Lunging at a goblin in the air, striking him down and then retreating behind the relative safety of a shield to prepare another blow is blissful, but doing it over and over with little to no variation just bores immensely. Simple fixes like a grappling system and some more varied and diverse combos or a more intricate form of sword play that relied on parrying, timing and environment could have helped.   And the ranged combat? It's even worse than the melee. Those character types that depend on it are so boring to play with their ~shoot at oncoming enemies like crazy~ gameplay that I found myself preferring the warrior classes above all simply because there was more to do and less to aggravate.  Sadly enough, a bit of mere technological polish when it came to fighting could have satisfied, for fighting is most unpleasant because victory and killing does not feel gratifying.   Graphically the title can be quite astounding. Texture detail is utterly insane and with a card that can boast a little anisotropic filtering, the whole thing is remarkably crisp, well lit, well designed, beautifully styled, and gorgeously filled with architecture and some scripted interactivity. It even runs solidly. Characters are also extremely well detailed, but the animation... The animation is horrid! Stiff, compulsory and wholly lacking, transitions are generally painful. Then they die. Anything that walks and dies is so totally unbelievable it's just wrong. Smoothing out general movement and adding a bit of the ragdoll love could have taken a mediocre in-your-face fighting system and made it at least pleasant and attractive enough to be entertaining despite the sheer lack of depth. As morbid as it sounds, even a little dismemberment with an actual impact on play would have seriously helped.  Artificial intelligence only worsens the problem and comes with a slew of its own flaws. Friendly A.I., first off, is probably as smart as a pre-school student learning about shapes and colors. A couple of examples can be found very early in the game, where you must take a huntress with you on your journey or at one point escort a daft merchant. She follows you and occasionally shoots enemies you attack -- the merchant will just stand there and get his ass kicked. She shot me sometimes -- he just kept standing there. Each time I tried going through the level with her, she would always get stuck behind some barrels or other objects (so would he in his own level), or she couldn't move through gates without me going back to open the door that she was too slow to follow through (he's still standing around and pushing me about by walking in my face).  The enemy A.I. is cursed, as well. They are graduating from the same preschool the friendly A.I. is, but at the bottom of their class. The key to beating baddies is to go in for a slash and hack, then move out before they can even realize that they were hit and need to strike back. Just hope you don't get caught or spun around on because of spotty collision detection. This makes the game ridiculous easy at times, until there are multiple enemies and the challenge increases. The hardest part of the game is not to get frustrated by the lack of quicksaving, which would have made everything a billion times easier. Sure, sometimes there is a false sense of intelligence you might appreciate as you circle strafe around a pillar trying to gain a vantage point over your foe who seems to be doing the same thing, but remember that he's just trying to figure out why he can't directly walk through the object.   And you'll be doing this all for quite a long time, which is both good and bad. There are two campaigns to battle through, the Light the Dark. Also, there are many playable character classes to choose from, allowing you to use the best-fitted fighter for whatever mission is at hand. There's a knight, a huntress, a wizard, druid, engineer, halfling, berserker, assassin, sorceress, lich, bombardier, and a goblin that are playable in Enclave. If sword swinging isn't your style, it's time to pick up the staff and cast some spells on the suckers. Don't do that.  What did you think of Enclave?  You can also equip your fighter with a bunch of different weapons, armor and whatnot before battles. Think you'll have to be a sniper? Get a ton of flaming arrows. Think the orcs will be swinging clubs in one big fighting frenzy? Pick up the knight and anything better than a dwarven sword. This level of customizability is a great addition to an action intensive genre, but it's nothing any RPG hasn't done years ago. And, it's all out of level preplanning, so you never get the feeling that you're adventuring or questing, but rather that you're completing missions as they come and then outfitting yourself by spending whatever funds you happened to earn in-game.  Like to take all this in multiplayer? Not possible, bub. So much potential and such a standard, to the point, no frills delivery is saddening. Enclave is a technical demonstration gone horribly awry when it came time to lay in the gameplay that would make it all truly epic. In some way Enclave remains enjoyable by being a straight action title with a brilliant, but imperfect delivery and a premise and allure that we rarely see done so incredibly beautifully. But, in another way, the entire time you play you're painfully reminded of the wasted potential that's sprawling out before you. Each jerky animation, tired and repetitious swing of the axe, uninspired mission, and yawn inducing spell only compound the problem. It's this odd amalgamation of coolness and brilliance coupled with sheer mediocrity, like that Starship Troopers CG cartoon. It should be good in theory, right? As it turns out, it's a toned down, incomplete and often lacking rendition of a concept someone once had that could have been amazing had it been done right.Each area of play has so many faults, it's undeniable. Still, there is a hack and slash dumb kind of grace that keeps you playing, especially since the story is solid enough to warrant it and the atmosphere rich enough to justify it. For that, the game deserves mention and note, and at least a gander. In-depth and amazing this is not so go in only if you're starved or are willing to play an acceptably average game that could have been so much more had someone just stopped and thought for a week or two about what needed to go in.", "date": "Apr 8, 2003"}