{"name": "Ed, Edd 'n Eddy: Jawbreakers!", "name_review": "Ed, Edd n Eddy: Jawbreakers", "ref": "https://www.ign.com/articles/2003/04/09/ed-edd-n-eddy-jawbreakers", "text": "falls into the same category as BAM's previous Cartoon Network GBA game, Samurai Jack, where the game designers attempt to recreate the same game design established in a past successful franchise...but fail to capture the original's essence in the newer project. Just like how Samurai Jack lifted its ideas from Castlevania, the Ed, Edd n Eddy developers looked to The Lost Vikings for its inspiration. Unfortunately, this game isn't nearly as fun as the real deal. Actually, it's not much fun at all, even if it was considered original. Features Three playable characters Six levels Cartridge save (three slots) Only for Game Boy Advance  In the game, you take control of Ed, Edd and Eddy, three goofy kids with their own individual quirks. They've got some sort of fixation towards jawbreakers, and turns out the local candy store is giving away tickets to win the ultimate jawbreaker (one that lasts forever). So, Ed, Edd and Eddy make their way through the six areas to the candy store trying to score tickets in order to get that coveted hardened sphere of sugar.  The way the game thrusts you into the action is absolutely horrible; they don't give you any idea what the strengths and weaknesses of each of the Eds are, and this game sorely needs a tutorial to start folks off into the adventure. The manual doesn't do that great of a job explaining it either, but here's the gist: Ed, the dumb one who tends to walk horizontally, is the strong one of the bunch. He can cart wheelbarrows and bash things with his head if he scores a football helmet, but he's the slow one of the bunch. Edd, the brainy one, can utilize switches and tools as well as put a slingshot to use. He's a little faster than Ed, but he refuse to go into hazardous areas. Then there's Eddy, the greedy one of the bunch. He can run fast and double jump, as well as use a jetpack and hypno-disc hat.  Now, with three distinct characters you'd think that Ed, Edd n Eddy: Jawbreakers! would be full of fun and variety, but when it's put into practice on the Game Boy Advance the game is just dreadfully boring. Levels go on for far too long with no indication on how far away the end of the round is, which is important considering that you have to get through the challenge before the clock hits zero. The characters move slowly even when running, and it's frustrating to make the specific jumps because it's never made clear what are actually platforms, and what are simply background elements. It's just not designed very well as a ~fun~ game...just a bunch of ideas that must be accomplished, spread out over large areas.  At least the game looks and sounds extremely close to the cartoon series. It has decent animation and background elements that fit the style guide established in the show. The music is also peppy and jazzy, with a good rendition of the theme song at the title screen. You've also got brief sound bites from each of the Eds when you switch back and forth between them. But all this can't help the game be any more fun than it is. Or rather, isn't. The timing for Ed, Edd n Eddy: Jawbreakers is a little bad, too, considering that the developers used The Lost Vikings as a sort of blueprint for their own game...and it ships just a week after the actual GBA conversion of the true Lost Vikings game. Even if The Lost Vikings never existed and Ed, Edd n Eddy was a brand new design, it wouldn't work for the game...the game design just doesn't come together as a game with any real ~fun~ to it.", "date": "Apr 9, 2003"}