{"name": "1503 A.D. The New World", "name_review": "1503 A.D. Review", "ref": "https://www.ign.com/articles/2003/04/09/1503-ad-review", "text": "I'll admit that I was a total punk in school, one who would rather spend time playing Wolfenstein or hiding shareware in the recesses of our computer lab's BBS than pay attention to what was being taught. In hindsight, part of my rebellion was based off not feeling challenged, and part of it was based off of continually reading ahead and understanding concepts before my teachers touched on them in class. But one of my greatest pet peeves was poorly taught topics, especially in history, one of my favorite subjects. For example, I once pulled out a lighter and set my sixty-dollar textbook on fire because my teacher butchered Columbus and Cortez's explorations of the New World (kids, don't try this at school). As I made my way to the principal's office with a half-singed textbook to face the wrath of my parents, teacher and principal (like I said, DON'T try this at school), I resolved myself to discover how the events actually happened. So you can imagine my delight with empire-building simulations that allowed me to shape and influence history the way I saw fit.  It's been said that ~variety is the spice of life,~ and while this has seemed to apply to most genres of gaming, the empire-building simulation has seemed to buck this trend quite severely. As the name connotes, a majority of them focus on the historical accuracy of a specific domain, such as Sierra's Pharaoh or Caesar series. Along with the specifics of creating thriving towns with robust economies, players were at times tasked with performing tasks pulled from the history books, such as fending off a certain invading army or curing an outbreak of disease. Usually, this was accomplished with the ~tutelage~ of advisors, members of your town who could provide insight on civic functions and help your cities grow into self-sufficient areas.  While failure was never an option, players would inevitably receive an infusion of ~loaner~ cash from your ~empire~ that could save your skin and turn your poor planning around. Not only was this unrealistic, but it removed a certain amount of strategy from the game, placing players on the computerized dole. On top of that, these sims never let you establish a country in your own name with your own people. Where's the United States of Jeff? Where's the glorious Haynes Republic? (Sorry, a wee bit of megalomania.) Well, Sunflowers Interactive and EA has provided a way for my inner dictator to come out with 1503 A.D., the sequel to the 2000's 1602 A.D.  Every game highlights one of the largest contrasts between 1503 and other city-builders; simply put, you're not connected to any pre-existing government. In fact, you'll establish a completely new nation that struggles for recognition with its neighbors and survival in the wild. Regardless of entering Campaign, Scenario or Open Play mode, you're initially given a lone ship stocked with minimal provisions, building materials, and crewmembers. You can set sail towards any landmass that you might find on your journey, yet once you've reached the shore, you'll need to check your surroundings to see if the island is suitable to support a new nation. This is established with the use of a scout, who will explore the terrain searching for mineral deposits such as salt, iron or marble. Scouts will also check on the size of arable land for your farmers, letting you know just how fertile the land is for production.  When you've found that perfect island, that Plymouth Rock, that land you claim in the name of...well, whatever, you build a warehouse along with a main marketplace and start offloading goods. Officially the hub of your settlement, these two buildings serve multiple purposes: 1) It provides a checkpoint for the importing and exporting of goods, 2) it's an initial collection and distribution center of raw materials for your settlement and 3) it's the initial founding of your country, which usually has an odd name like Pfaltzgraffenplatz or Dingleberrisia. Personally, I mentally discard those names in favor of the Haynes Republic, but that's just me.  Anyway, with these two building blocks for your country firmly established, it's time to work on the delicate balance of resource exploitation and expansion. In most city builders, there are specific areas that you can place your industries, and their output is governed primarily by the number of human resources that you allocate to a task. Instead of taking this route, 1503 bases product yield off two features: the serviceable area of the building coupled with its regional fertility rate. The immediate area surrounding a structure is the serviceable area that workers comb over, collecting fresh game, farming, etc. While buildings can be placed anywhere you want, situating a business in a fertile region for its raw materials can triple its production rate. This can be vital, especially when you're trying to increase the size of your population.      Similar to industry, houses can be placed just about anywhere in your country. Your citizens don't really ask for much, merely access to consumer goods and public buildings, such as markets, schools and taverns. While they have a serviceable area as well, it corresponds to access to these specific desires, requiring attention to future growth as you build your neighborhoods. Initially these demands are quite few, but as your people get accustomed to the lands and the number of goods or scientific advances increases, their needs will swell. Successfully providing citizens will everything they want allows them to increase their civilization level from Pioneers all the way up to Aristocrats, but even a short term denial of the most basic of wants can quickly erode your city, leading to collapsing structures and a virtual ghost town.   Obviously, keeping your citizens happy will lead to continued growth in your city, so you'll want to have a surplus of goods for them to gorge themselves on. The caveat to this is the land will inevitably run fallow, and won't be able to produce every kind of item necessary to please your people. For example, you may land somewhere that's perfect for growing potatoes, but abysmal for growing tobacco. Thankfully, excess wares can be traded with one of the many civilizations found scattered around the seas for merchandise that your nation lacks. Nine indigenous cultures ranging from the Aztecs to the Eskimos can be found, offering the possibility of mutually beneficial trade routes for all civilizations involved. In addition, players can always gauge demand of a specific product by trading with the Venetians, roaming merchants who gladly trade much needed supplies for gold.   You might think smoothly running a new country while trading peacefully with your neighbors and expanding your borders sounds like a large juggling act, and you'd be right. Knowing how to balance your citizen's wishes with your limited supplies is rather tricky, especially when you're starting a new colony. In fact, this is probably the greatest part of 1503's appeal to gamers. Unfortunately, it's also one of the game's greatest faults, which is that you're never given adequate information to successfully run an empire. What this enforces is dependence on trial and error gameplay, much of which will quickly drive novice and even some experienced simulation players away. You might as well throw away the instruction manual because it's incredibly vague, choosing not to inform you about certain features but instead directing you to the in-game help presented within the game.   Typically, I'd be fine with this suggestion, but the help files in other games actually HELP players figure out what to do. There are essentially two variations on the kind of info found in 1503's in-game help files: pictures of production trees and very little text, or a generic explanation of a concept. For example, the Raw Materials missing icon will pop up when a business has run woefully short on resources. Unfortunately, even if you manage to place the business in an area with an overabundance of supplies and clear pathways for deliverymen, this icon can and will still pop up. The largest ~help~ that the in-game manual will provide is to check the delivery of raw materials and goods. It's this circuitous logic that will prompt many a restart.   Speaking of building placement, there's absolutely no information on what buildings can help or harm civic development. This isn't a new concept; just about every single city-building sim has some kind of standard about what structures citizens don't want to live near. Think about it: would you want to live near a noxious tannery, a loud iron mine or a boisterous smelter constantly pumping out goods? Don't think so. Yet because there's no information on the deleterious effects of certain buildings on the environment or the city, players can sabotage their fragile economy by placing these complexes within residential areas. That's if you can see their area of influence, which can be so difficult to detect that you may put down unnecessary buildings, wasting your materials and money.   What's worse is that there are times when you'll need certain buildings or goods, but you'll have no way to acquire them because the computer has deemed that your civilization isn't at the right technological level. For instance, many times I'd progress through a campaign with a decent start, only to have a mysterious fire break out and burn a majority of my city down to the ground. While I frantically searched for people to put out the fire, I only discovered to my chagrin that I needed to build a fire brigade. Unfortunately, because I wasn't at the hidden, arbitrary game standard where I had access to a school building so I could research a fire brigade, I had to watch as my town went up in smoke, then watch as I visited the load screen for the umpteenth time. Talk about feeling useless in a time of need.       Even more futile is the entire combat system, which is not even a necessary part of gameplay. Again, I've got to draw the comparison between previous empire games and 1503. In other games, combat is a necessary part of founding cities. Establishing a militia, founding a standing army and providing defense for your city is necessary for fighting off the numerous invaders, raiders and vagabonds that commonly threatened your territory. Failing to do so meant that your town would easily get looted or destroyed.   In 1503, however, building an army constitutes aggressive action against the other cultures on the map, who then start producing armies to buffer them against incursion and openly launch offensives against your cities. Players can choose to completely avoid conflict of any kind by simply not building an army, thereby ensuring peace. There are some missions where fighting are unavoidable, such as certain stages along the campaign or particular scenarios, but the overwhelming majority of missions can be relatively battle free.   1503 A.D. does feature a very definite advantage over its predecessor, 1602: The graphics have received a complete overhaul. The animation of townspeople and wild animals is rather well done. If you look into the woods, you can see animals grazing and even feeding on each other. On a tight zoom, you can discern woodcutters hefting their axe and prepping their swing before hacking into a tree, townsfolk walking into church for services, and farmers harvesting crops. Just about everything in the game has some degree of animation, which goes a long way towards investing the mundane tasks of administration with an air of liveliness. This is further reinforced by the visual upgrades in homes and buildings as a city prospers, with homes turning from wooden shacks to small cottages and dirt roads becoming cobblestone streets. Other cultures have similar details that are unique to their civilization. There are only two downsides: one's an odd glitch that completely blacks out the mini-map, and the other is that the graphics aren't cutting edge. Actually, they probably weren't cutting edge a few years ago, but they're good. What did you think of 1503 AD?   Sound is particularly weak in 1503 A.D., simply because of the sheer lack of effects. There are some ambient sound effects from nature, such as waves lapping or animal calls. You'll hear voice acting when you click on specific, controllable units or only during event moments, though the voice acting is average. Aside from that, you'll hear a few effects scattered here and there, such as a building being erected. Music is literally nowhere to be found, with the exception of a celebratory chime that is triggered the first time you place a building, so a majority of your game will be played in silence. Don't get me wrong, I expect quite a bit of a learning curve with every city-building sim that I play. 1503 certainly will provide that for you, with tutorials that don't fully prepare you for the game, bad documentation, and unexplained goals and advances. Once you get past these hurdles, you'll find that it's a decent simulation of city building. It does raise a blatant point in my mind though. I don't profess to be a historian of Middle Ages architecture. I don't know what you'd need to create a successful sheep farm. Hell, I might not even be a good lumberjack to produce viable lumber for a house. But developers don't suppose players are experts in these things either. That's why they provide them with certain information about the benefits and disadvantages of structures. It's likely there will be a level of trial and error as people get accustomed to playing the game; this information is merely designed to cut down on the number of times you have to restart a game from scratch because you placed a neighborhood around a noisy factory or other residential blight. 1503 A.D. doesn't follow this train of thought, choosing to instead eschew this standard. What it actually does is establish a higher degree of trial and error and experimentation. Unfortunately, that may turn of newcomers of the genre to this title, and potentially frustrate experienced veterans of these kinds of games.", "date": "Apr 9, 2003"}