{"name": "Line of Sight: Vietnam", "name_review": "Line of Sight: Vietnam Review", "ref": "https://www.ign.com/articles/2003/04/10/line-of-sight-vietnam-review", "text": "I'm not so sure about this whole Vietnam thing. I figure a lot of people were saying that back when the war was on (some considerable amount of time prior to my unholy conception), and now I'm saying it as we gamers suddenly find ourselves staring at an invasion of almost as many forthcoming Vietnam inspired titles as we did World War II ones. Those titles born from the ashes and fire of WWII have succeeded admirably on the PC and various consoles. That conflict did not involve the bravest generation of American men for nothing. Medal of Honor, Battlefield, Pacific Theater, Day of Defeat, and even Wolfenstein are quality titles, but this kind of guerilla warfare in a torrid jungle has yet to prove itself as game-worthy material capable of reaching such heights of near perfection those other war efforts have.   Case in point: Line of Sight: Vietnam. nFusion tried its hand at World War II twice. Deadly Dozen fell considerably short of the quality mark, but Pacific Theater reached new heights and silenced the gaping jawed goons of the world who wrongly believed a budget title could not be good, price aside. Sadly, everyone looking for an extension of Pacific Theater's quality will not find it here, unless they'll enjoy all of the frustration and tedium of that title rolled into a tight, green ball called Line of Sight. The pseudo-series is pedaling backward with this one, and it's unfortunate because nFusion's last promised so much more out of the future.  Vietnam, unlike the shattered towns, rolling hills, loose forests, and urban wrecks of Europe is all about the jungle. Fighting in the jungle is all about patience, skulking, surprise, and quick, intense, violent outbursts of gunfire. Line of Sight delivers the jungle surprisingly well, but it's the combat -- the feel -- that falters seriously enough to negate the positives of the game.   Cramming a rolling environment full of varying bushes, trees, shrubs, grass, rocks, and logs is tough. For this, I commend Line of Sight for its nicely devised and technically functional and attractive environments. The bush looks like the bush and feels like the bush. It just doesn't act like the bush.   Mistake me not, there are no glaring problems with collision detection. In fact, I've found Line of Sight to be one of the smoother experiences around. Rarely, if ever, did I find myself aggravated and caught on an ankle-high rock or log, as was often the case in Vietcong. No, over that game, Line of Sight offers a much smoother, more cohesive kind of unobtrusive movement that's not at all akin to a clunky soldier simulation, but rather to a breezy action title. So when I say it doesn't act like the jungle, I mean the jungle doesn't let me play off of and enjoy the altered style of combat its nature demands.  All of Line of Sight is, appropriately enough, played by obtaining a line of sight on the enemy and dispensing them as quickly as possible. In fact, that's what the game is about. It's not reflex, it's not planning, it's not strategy, it's slowly, methodically, tediously crawling and crouching about through the thick, and hopefully from higher ground wherever applicable. It's about scanning the terrain for anything that moves and thus can be shot.   There are a few problems with this. For one, it's boring as all hell. The levels themselves are ridiculously large when played on your stomach. The combat is sporadic and largely revolves around engagements with disjointed, disorganized, randomly placed VC in groups of two, three, or even four. It seems less about logic and delivering a believable action experience and more about strategic placement for the sake of making the game unpredictable and overtly hard. Furthermore, through my extensive play of the title (in both cooperative multiplayer mode and solo play), I never got the impression that the enemy was ever on patrol. They're either standing about waiting to spot you specifically or have been spawned from the void of oblivion in a preset manner to charge you, specifically.   This wouldn't be a problem if the fundamentals of jungle warfare were taken care of properly. For one, surprise isn't surprise -- it's luck. You only know where the enemy will be when you see them, and when you see them is exactly when you should fire your weapon, since they won't be moving or doing anything else that would justify a hesitation on your part and warrant patience with the intention of it ultimately working in your favor.  Cover is also nonexistent. You can pretend all you want that the enemy will not be able to see you behind the shrub you've chosen for cover, but the fact is they can. In fact, they can even see through the solid bushes and trees that dot the way between them and you, and they'll hit you with their weapon every single damn time.  It's not just the accuracy of the enemy that angers, it's the perfect, metronome-like firing patterns they adhere to. The very moment a VC is capable of shooting his weapon, whatever it be and regardless of recoil or whether or not you're on the move, he will shoot. Bang...Bang...Bang...Bang...Bang. And every time, barring divine intervention or an obstructing hut, he will hit you. That wouldn't be too terribly bad had the game's version of a realistic mode allowed the player to live for longer than four seconds and also not forced a vicious, debilitating pain reaction to every shot that forbids movement, let alone a counterstrike. See, whenever a bullet impacts flesh, the player cannot move well and cannot shoot at all. It just so happens that your recovery time is slightly longer than the firing time of whatever enemy you're squaring off against, so it's a virtual certainty that if you were not killed in the first shot, you will be in the subsequent volleys two seconds later. Running is impossible, hiding is irrelevant, and returning fire is pointless. Great.       So go ahead and turn the thoughtful mode slider to ~arcade~ and become a walking tank. Then you can laugh deliriously when you horrifyingly realize that such a change will also make the enemies walking tanks. And, while the pain flash is not as severe in this mode, it is just enough to seriously piss you off and still get you killed, especially when fighting multiple enemies that now take longer to drop than before.  I've found a combination of the easy difficulty and the realistic setting to be the most enjoyable. But, as an awesome addition, both toggles can be changed on the fly, in-game, whenever you like. So play around, and get mad regardless of what you do, because this will be pointlessly going on for a long while.   12 missions need to be beaten. Just play through the first four and pretend you've done the rest. Aside from the furiously hard final that involves too many VC to count bent on assaulting and obliterating your base of operations, missions might as well be the same. In fact, had the time of day and amount of rain not changed, they would be the same. Objectives are meaningless and the transitions between operations often do not flow and carry absolutely zero meaning or worth. You'll not care for a second about the happenings of the war, the progress of your individual, or the well-being of the hostages that need rescuing. It's all trivial. Because of the similarities between missions and complete lack of emotion, playing becomes a chore.  It's like this throughout the entire game...you, on your belly, hoping your AI comrades, straight out of Deadly Dozen's mass of programming with sometimes suspicious path finding, will be able to pick off targets before you do. But, it gets even worse. What I hate most about Line of Sight are the baffling night missions (when I say night, I mean pitch black). I believe there are about four (maybe five?), and they all suck, a lot. Arm your M21 with a starlight scope and then zoom in and make the experience that much worse. It's like playing while staring through a paper towel holder with a magnifying glass taped on the. You have zero peripheral vision, are to some degree zoomed in, are crawling along on your stomach, ever so slowly pushing through dense plant life, and it's not possible to see anything until a VC shouts out the same shout he always does and then promptly shoots you in the face. Darkness, like the bush, offers little protection. The owls of the North Vietnamese army will see you regardless of where you are. But at least they do shout, which reveals their general location.    In fact, much of the audio does help general play. Provided you have the sound card, headphones or speaker system to crank it, the positional audio in Line of Sight is a necessity if you're not fond of the quick load button. At the same time you'll be pleasantly immersed in a richly realized environment loaded with proper bullet impacts, whizzes, jungle noises, rain fall, splashes, footsteps, and bush rustling. Not as important as the ambience, the music is terrific. Like the Deadly Dozen games before it, Line of Sight's orchestral war tunes fit very, very well (some come from those other titles, even). And then the joy stops when someone shoots you or you choose to shoot back.   Weapon effects in Line of Sight are some of the most wretched I've heard in recent memory. They're muffled, they skip, sometimes they fail to sound off at all, and that of the enemy's are so painfully consistent it's like listening to an incredibly loud clock tick in your ear while you're trying to enjoy something else. Very, very bad.     As you might have guessed from the environmental blurb, the graphics fare quite a bit better, even if animations lack the goodness of physics and models lack the goodness of current generation graphical effects and articulation. Weapon models are almost painful to look at and feature nothing the way of transitions when you're cycling through them. A very odd mishmash indeed.  What did you think of Line of Sight?  What Line of Sight does inarguably have going for it is a solid multiplayer component. Coop play, I love, while other modes are a bit too standard. Coop is still hard as all hell, and in many ways even harder than the solo campaign since friendly players are likely to tire of the crawl all the time philosophy to victory and are even more likely to fall prey to the human weakness of not seeing everything within a mile radius, but it's still a blast.   I can see the competitive modes also succeeding. But, since many of the environments lack that distinctive feel and differentiation that allows other games to offer up our favorite maps and our favorites weapons and classes to play them with, I can see it getting quickly passed up as a novelty in light of other currently available titles as well as those on the horizon. Besides, the entire time you're venturing through either with or against others, you're still subject to the limitations of the game. All that poor technology catches up and takes its toll. Mission structure, pacing, environmental layout, and general combat is all less than exhilarating and often times tedious and inconsequential. You do these things because you're told to, but there is no driving motivation to warrant suffering through uncannily aware and adept AI, some typically jungle-esque jungle environments, and a lot of general tedium. Getting shot sucks, a whole lot. And, shooting other people isn't particularly thrilling.The low production values that plague nearly every aspect of this title are a real downgrade from the suave coolness of Pacific Theater and are more inline with the original Deadly Dozen, only worse in a number of different ways. It's less exciting, more redundant, harder, suffers from poorer missions design, and lacks some of the more important redeeming factors of its older brother. Line of Sight had a lot of promise, and fairs better than other Vietnam efforts in some respects, but it's just not solid, well-rounded, or exciting enough to play through happily, nor does it have any single feature or group of features that are amazing enough to completely outshine the horrendous artificial intelligence and insipid combat. Ho-hum.", "date": "Apr 10, 2003"}