{"name": "CSI", "name_review": "CSI: Crime Scene Investigation Review", "ref": "https://www.ign.com/articles/2003/04/11/csi-crime-scene-investigation-review", "text": "is a very popular show that airs on CBS.  Set in Las Vegas, the series takes viewers inside a crime from the perspective of the evidence.  Banking on its popularity and following in the footsteps of other programs like Law & Order and American Idol, CBS teamed with UbiSoft to put together a PC game.  It boasts realistic artwork, voices from the actors in the show and scripts developed by one of the actual writers for the show.  Unlike some of the other major disappointments of late with TV to video game ports, CSI: Crime Scene Investigation, the video game, actually does CSI: Crime Scene Investigation, the television show, justice.   As the newest recruit to the Las Vegas CSI team, you will be charged with gathering evidence, questioning witnesses and deciphering clues to discover the secret behind each crime.  There are five cases in all to investigate.  At first, only one case is available.  Upon completing the first case, though, a new case is opened.  You can go back and play any of the cases over as often as you'd like.  You will definitely find yourself replaying cases since after each case, Gil Grissom, the lead CSI, evaluates your performance.  If you have exhausted every lead and found every clue, you score 100%.  I never was able to score 100% on my first try.  You will want to score 100% because doing so will unlock ~bonuses~ in the form of concept art.  Failing to exhaust any lead thoroughly, using a hint with the built in hint system or going right for the obvious solution too soon will result in a lower score.  You are assigned a title based upon your percentage score, like investigator or master.  If you achieve Master status in all 5 cases, this will unlock additional bonus materials.   The start of the first case also acts as a tutorial, explaining how the interface functions and how to use the different investigatory tools available.  It is very short, as the game doesn't have much of a learning curve.  After the brief introduction, you are thrust into the game to solve your first crime.  A woman has been murdered and left in a seedy hotel room.  This is a point and click game and as such, you will have to find hot-spots and click on them to find clues and collect evidence.  However, all hot spots are easily identifiable and make sense.  Areas to be investigated are clear and when a tool for collecting or discovering evidence can be used, the tools section pops up.  Tools are divided into two types, collection and detection.  Collection Tools include the swab to collect DNA evidence or the casting kit to make impressions of tire treads.  Detection Tools enable you to discover a hidden piece of evidence, like fingerprints with the brush or luminal, which reveals blood stains.  Evidence separates items collected into three categories, trace/prints, documents and items.  Double clicking on each article will bring up an information box with all known information.   Location allows you to move from one place to another.  There are locations which open as you learn more about the victims and suspects.  There are also three locations which you can travel to at any time.  The morgue is where you learn about the cause of death and collect any items left behind on the body.  The morgue is only available if you have a corpse of course.  You can travel to Jim Brass, Captain of the Homicide Division, when you need some investigatory or background information.  He is also the person you ask to bring in individuals for further questioning.  Finally, the bulk of your research will be spent in the lab, where Greg Sanders - Lab Technician, the microscope and the computer all reside.  Handing Greg a piece of evidence will have him reveal anything interesting about the item.  The microscope can be used to compare hairs and fibers.  The computer allows you to search various records, like fingerprints and footprints, join in chat room conversations and do audio analysis.   There is also a case file that can be opened with a simple click, which summarizes anything learned about the victim, suspects and allows the mini-movies that are trademarks of the television show to be replayed.  As you investigate, you will need to find evidence that leads to one suspect.  To bring in a suspect for interrogation, at least one of means, motive or opportunity must be discovered.  Once you discover the facts to support all three, the person can be arrested and you have solved the case.   The graphics are realistic and crisp.  The animation on the models is decent, although facial expressions seem to be somewhat lacking.  The painted backgrounds are clear and make obvious what is important in the game.  Every model looks exactly like the corresponding television star.  Also, standard to the television show are short flashes called ~reconstructions~, and those are included int his game.  The visual effects lead to a feeling of immersion.  Enhancing that sense, all of the actors and actresses from the series have lent their voices to the game.  The background music is understated.  Sound effects are almost non-existent, although they really aren't needed.   The dialogue is as witty and interesting as the television show, probably due to the fact that one of the show's writers actually wrote the scripts for the game.   Although there are 5 cases, and you will definitely want to achieve 100% in each of them, the game is actually pretty short.  Once you achieve 100%, it is unlikely you will play the game over again.  You can solve the cases without a walkthrough, which is always nice.  There isn't anything too frustrating if you are willing to really listen to the clues being given and investigate every lead thoroughly.  There aren't really any missteps you can take either, ruining all the work you've done, except to go into interrogation with the culprit too soon.  It is also not timed, unlike Law & Order: Dead on the Money.  You can take as long  as long as you want, revisit as many places as often as you wish to and never have to worry about time running down.CSI: Crime Scene Investigation is a fun, albeit short, experience.  Realistic graphics, good voice-overs featuring the stars of the show, a simple interface and point and click set-up and gameplay that doesn't leave you pulling your hair out come together beautifully.  Having 5 different cases, with a twist at the end, that are all well-written and interesting is a bonus.  UbiSoft did everything right in this product and I sincerely hope to see a follow-up.", "date": "Apr 11, 2003"}