{"name": "Evolution Worlds", "name_review": "Evolution Worlds", "ref": "https://www.ign.com/articles/2003/04/14/evolution-worlds", "text": "Even in this post-Wind Waker age, the GameCube is seriously devoid of RPGs.  And there's always the argument that the Legend of Zelda games are now more adventure titles than RPGs--they lack the staples of the genre like turn-based battles, leveling up, serious item management, and magic spells that force the player to endure repeated viewings of pyrotechinal displays.  As 2002 drew to a close, Ubi Soft delivered Evolution Worlds, a traditional RPG aimed directly at the crowd that must have party management in their RPGs.  But how does a sandwich of two so-so Dreamcast RPGs, Evolution and Evolution fare in the wake of the Waker?  The Facts  Traditional RPG fixings: turn-based fighting, item management, party juggling Sequel to the Dreamcast Evolution titles Quality voice-acting Customizable CyFrames replace standard magic system Randomly generated dungeons No progression scan support   Gameplay Evolution Worlds is as formulaic as you can get for an RPG.  A young man, Mag Launcher, full of bravado that serves to mask his self-doubt, loses his parents under mysterious circumstances.  Of course, Mag sets out to find the item (the legendary Evolutia CyFrame) his parents were looking for, and if he's lucky, maybe he'll find them in the process and restore his family's once-great name.  Oh, and he's got company in the form of a -- wait for it -- mysterious girl who does not speak but possesses amazing magical prowess.  And to complicate his mission, a nefarious prince with the decidedly un-nefarious name Eugene, not only plans to find the CyFrame before Mag can, but is smitten with Mag's girl!  How will this epic tale play out?  You're going to need a lot of patience to find out, because the gameplay is as stale as the story.  The visuals may be in 3D, but EW follows the conventions of RPGs set in stone since the NES days.  Mag must travel from ruins site to ruins site on perilous excavations, which turn out to be nothing more than pure dungeon crawls.  At least you can actually see enemies coming in EW, so you have the choice of fight or flight.  Technically, you're better off fighting because this is one of those experience-point gathering games, but the combat is so ~blah~ that you'll find yourself tempted to twitch the control stick in the opposite direction whenever you see a spider, spiked turtle, or kissy-faced scorpion.  One of the central problems with this dungeon-crawl is that the dungeons are randomly generated.  The lack of rhyme or reason is disappointing, especially considering how clever some of the dungeons are in better RPG titles, such as Final Fantasy, Phantasy Star Online, and, yes, Zelda.  Progression is carefully designed so you have a goal to work towards, and when you figure out all the puzzles and defeat the bad guys necessary to reach said goal, there's a certain sense of accomplishment.  You don't get that from EW.  The randomly generated dungeons are sometimes so poorly laid out you can just run down a couple hallways before finding the stairs to the next level.  Never mind that one you get to the next level, there's no stairs to take you back down.  Should you run out health items, too bad.  Exit out of the dungeon and start from square one--in a new randomly!-generated dungeon that looks nothing like what you just left.  Fortunately, after a few dungeons like this, you no longer have to keep embarking on quests that lead you into random dungeons.  Dungeons actually start becoming pre-mapped affairs, but let's face it, they aren't much better than the on-the-fly dungeons.  And that's pretty much it.  You go from town to dungeon, over and over again, with bits of story sprinkled between.  While you're in town, you can chat with townsfolk (who actually have some goofy things worth listening to) and pick up additional members for your party.  Only three people can go into a dungeon at a time, but there are several characters to choose from.  Chain is an obnoxiously girl with a flying CyFrame, Pepper is a spicy, skilled adventurer who demands high pay for her assistance, and Gre Nade, Mag's faithful manservant, is a decent hunter.  Who you choose doesn't really ever seem important, it just depends on how you want to play the game.  Want to blow through dungeons?  Nab Pepper.  She may be costly, but she's best in battle.  Want to see more CyFrame animations?  Bring Chain along.  Fighting is straight-up turn-based.  Pick a command from a menu, assign an action, then watch a little animation.  Repeat.  The first few dungeons can be easily cleared without using any special powers or skills, but eventually, you're going to have to employ that funny-looking device on your back, your CyFrame.  What might seem to be the game's only departure from formula, you quickly discover that a CyFrame is just a topical substitute for a magic system.  As you defeat enemies, you gain points that can be used to unlock CyFrame moves for use in battle.  The more powerful the CyFrame maneuver, the longer the animation, too.  You can also add parts to your CyFrame to unlock additional talents, such as Mag's gas attack (complete with an old-school rattle can) and a giant hammer that puts the oft-delayed Malice to shame.  Party members not blessed with CyFrames are equipped with plenty of self-defense of their own.  Gre has a trusty rifle, but in one of the more humorous events, he can also literally serve up justice on a tray.  Linear bonks baddies with her frying pan, and Pepper has a gun that can shoot lasers, fire, and ice rays.  Graphics EW is essentially a port of two Dreamcast games, but developer ESP did try to clean things up a little, not unlike Sega's once-over of Skies of Arcadia.  Character models seem to be a little cleaner than in the original Dreamcast games, even though there are still plenty of sharp edges to be found on clothes.  Enemies don't seem to have revised at all.  An earring that looks like a hexagon may have been acceptable in a Dreamcast game, but not on the Cube.  The main characters, such as Mag and his girl Linear, sport that silly super-deformed look: big heads with even bigger eyes and little bodies.  They move their mouths when they speak, but it's not fluid at all.  Each character seems to possess just a few frames of facial animation, and it seems they were just haphazardly linked to vowel sounds.  The CyFrames are kind of clever, though.  Mag's CyFrame looks like a green Swiss army knife with a Mickey Mouse hand at the end.  And this little hand dispenses quite a few different blows, each with fairly fluid animations.  Too bad enemy animations don't get the same treatment--there are extremely bland.  The texture work is fairly decent in town, but it's absolutely boring in dungeons.  There might be only a dozen texture panels for each dungeon environment--ruins, rock, forest, high-tech--and they're used over and over again.  At least the towns are fairly bright and colorful, with grass, rock, sand, and other landscape textures.  The buildings though are decent, but it's hard not to love a town complete with its own milk bar, ala ~Clockwork Orange.~  Too bad there's no spot of the old ultra-violence to go with it.  Audio The good folks behind EW actually out-did Wind Waker in one area: voice work.  While Link and his companion just make little yelps and noises to simulate speech, Mag and his crew are quite chatty.  With the exception of a few thought balloons, all of the dialogue is spoken aloud.  And sit down for this one--the voice-acting ain't that bad.  Sure, the lines they speak are sometimes ridiculous (EW has a sense of humor), but at least the voice talent sells it quite well.  The score isn't that bad, either.  (It's certainly no Wind Waker, though.)  The themes are rousing and catchy, especially the battle theme.  Too bad there are only four or five pieces of music in the entire game.  No matter how good a couple of them are, they get old fast.  Times like these are when you covet the Xbox's ability to play user-created soundtracks.I forgot to write my comments, but that's okay. You've read the review, and Matt can jump in with his second opinion. Isn't he lovely, him?", "date": "Apr 14, 2003"}