{"name": "Monopoly Party", "name_review": "Monopoly Party", "ref": "https://www.ign.com/articles/2003/04/14/monopoly-party-4", "text": "Before the Atari 2600 invaded America's living rooms, there was a different breed of gaming for the family to rally around: board games.  Everything from Boggle to the Game of Life would bring friends and family en masse to the table, where great feuds were born and generational rifts were capitalized upon.  Board games still do a healthy business, but let's face it, does a heated Halo deathmatch compare to a game of Risk?  (Actually, yes.  Some of the best screaming matches -- the kind where you bring out long dormant hurt and apparently-not-forgotten dirty deeds -- can be had over a not-so-friendly board game.)  So, why not combine the two, video game and board games, and bring out the worst in all audiences?  And that's what Infogrames does with their release of Monopoly Party, a souped-up edition of the old favorite that can still bring two sisters to blows.  The Facts  Play classic or new Monopoly Party mode Speedier game play Five themed boards--including classic Monopoly New tokens Save unfinished games for later play Up to four players   Gameplay By now, most people have at least a passing knowledge of how to play Monopoly, thanks to its huge footprint in popular culture.  You roll the dice and advance around the board, buying up property.  The goal is to complete sets of like-colored properties, and then load them up with houses and hotels so that when another player lands on your space, they have to pay mammoth amounts of rent.  Secure enough property, and you'll eventually drive your opponents into bankruptcy.  This is usually when the poor sport of the group flips the board into the air, scattering paper money and plastic houses into the dark pockets of the room--on to later be found when they screw up your vacuum.  Thankfully, Monopoly Party is played on the television.  Should your soundly thwarted nemesis fling your GameCube into the air, you are legally entitled to poke him/her in the eye.  Anybody who has played a game of regular Monopoly knows, though, that the game can sometimes take an excruciating amount of time to complete.  Especially if you auction off property.  And especially if the designated banker is abysmal at math.  That's where Monopoly Party comes in.  Especially the new Party mode.  Now, everybody can roll the dice at the same time, make their moves, and engage in spirited auctions.  The pace is crazy--almost to the point where you lose track of what's happening.  Which turns out to not be very fun, because Monopoly actually requires a little thought and strategy, and the Party mode doesn't allow time for those things.  Thankfully, Infogrames did include a Classic mode, which is regular Monopoly.  Because the Cube handles the math and all dice rolls are done with just a touch of the A button, the game is still considerably faster than the board game version.  Gamers may try Party mode just to see how it works, but we guarantee that the return to the safe haven of Classic Monopoly is not far away.  Monopoly Party is also equipped with a rules editor, which allows players to tweak the options of the game -- you can turn off auctions, set up a jackpot on Free Parking, change tax rates, etc.  And in the event one of your Monopoly buddies has to scoot before the game is over, you can save the game to your memory card.  Monopoly Party is best played with other humans.  There's just no trust factor when you play against the computer.  Whenever it manages to perfectly land on that third property and complete a set, you get the feeling that Monopoly Party is as rigged as the McDonald's peel-off version of the game.  It may not be, but the lingering doubts quickly turn into high-octane rage when the computer effortlessly hands you your fanny twice in a row.  Graphics Now, Monopoly shouldn't really be too difficult to render on such an advanced system as the GameCube -- but considering how Nintendo 64-esue Monopoly Party looks, you can't help but be disappointed.  Where is the sweet, high-resolution render of the iron?  Why is the writing on the property cards muddy?  And who greenlit that awful, blocky text that dances across the screen when a big payout is made?  The art team on Monopoly Party obviously spent most of their time on the original board and tokens because the extra themed boards looks pretty shabby.  The fantasy board is just goofy, and the human-shaped tokens are just awful models.  The ancient monument board sports ancient graphics.  There was some serious fun that could have been had here, designing new player pieces and board backgrounds, but the opportunity was wasted.  Audio One game.  That's all it will take for you to turn off the announcer.  He grates immediately, especially when he's telling you that you need to sell your houses to pay rent on a tricked-out Boardwalk and Park Place empire.  The background music is equally terrible, but you'll rarely hear it above the trash talking you'll hurl at your opponents.  At least the sound effects, such as rolling the dice, are appropriate.I'll be honest--I dig Monopoly Party, but that's because I'm a fan of the board game.  A friend and I have saved game where we own equal halves of a fully stocked board -- hotels on everything -- that has been raging for weeks, just trading money back and forth, hoping one day the other will run a cold streak and be bankrupted.  I will break him, it's just a matter of time.If you're not a fan, Monopoly Party will likely not make a convert out of you.  But that shouldn't prevent you from giving it a rent, just in case.  Personally, I think Monopoly Party is a better game than Mario Party 4, with its overly complicated boards and tired mini-games.  The stakes in Monopoly Party are much higher, and the opportunities to pull screw jobs are greater.  Which should lead to some deliciously evil put downs between friends, as it has in my case.", "date": "Apr 14, 2003"}