{"name": "Final Fantasy Origins", "name_review": "Final Fantasy Origins", "ref": "https://www.ign.com/articles/2003/04/15/final-fantasy-origins", "text": "For those of us who have been dedicated to the role-playing genre from its inception on pen and paper to the rise of the Atari 2600's Adventure, a recurring theme has often appeared within the confines of the term ~RPG~. That theme of course, is the need to revisit past experiences in an effort to remind us how good something once was or how great it still may be. Whether it's your fourth time through the Dungeons & Dragons module known as Ravenloft or your fifth trip to the planet Motavia in Phantasy Star II, a return to the familiar is part of the RPG gamer's striking behavior. It's a bond between their adolescent gaming years and their modern lifestyle, and more importantly, it's a way to relive some of our fondest videogame storylines.    Square has always been a champion of such practices with several recurring themes in all of its Final Fantasy games; be it Chocobos, Summon names, or even weapon and item types, the idea that all of its stories were bound together by certain commonalities is part of what makes the franchise so special. Once the Sony PlayStation hit the market, however, Square took that idea a step further by re-releasing older titles with enhanced features for an all-new generation to enjoy. The two existing collections so far (Final Fantasy Anthology and Final Fantasy Chronicles) have not only successfully ported the late Wonderswan remake of FF4 and the Japanese-only FF5, but have also introduced new gamers to the magnificence of 16-bit storytelling with Final Fantasy VI and the always-brilliant Chrono Trigger. And yet, there was still more to be done; which gives the newly merged Square Enix yet another shot at the retro-remake market. This time with the aptly named Final Fantasy Origins.   A two-game collection that almost completely remakes the original FF which saved Square from Bankruptcy, and the Japanese-only release Final Fantasy II, Origins could go down in history as the best Square Remake Collection yet. Not necessarily entitled as such because of the quality of the games within (they're brilliant yes, but no where near the excellence of the latter FF's), but because of just how many elements have been changed, reworked, or altered to produce a wholly improved effort over its inspiration. These aren't quick package jobs -- they're self-contained, fully competitive 16-bit RPGs.     Final Fantasy  Easily the most improved game in the series, the new Final Fantasy is still the most basic. A simple tale of four legendary warriors out to unite the four magical crystals while kicking major enemy ass, FF1 definitely shows its roots in the 8-bit era. Active Time Battle systems, the ability to steal, or even an abundance of dialogue is seriously lacking here, and when compared to the first 16-bit game in the series (Final Fantasy IV), the design is a bit archaic. What Final Fantasy I does have, though, is an abundance of old-school exploration and level building with updated visuals and MIDI-quality music. It may not sound like much to get excited about at first, but once you sit down to play it, one will quickly realize why this game sold so many copies in the first place -- it's addictively fun.   In addition to the obvious presentation changes made to the audio and visual aspects of Final Fantasy I, there's also a number of other modifications that fans of the original may or may not like. For starters, several item, weapon types, townships, dungeons, enemies, and even character classes have seen several name alterations (re: the Fighter is now the Warrior, Black Belt is now the Monk, Sky Castle is The Flying Fortress, etc), while there's even a few new items all together. Also fresh is the ability to input several extra letters when selecting your character's name at the introduction screen and the ability to select a Normal or Easy difficulty level. This choice is more than one that simply changes the challenge given to your enemies too. It's also a factor in determining your highest possible level, magical ability, cost of weapons and goods, and the rate of your level climb. Nice touch.   Other bonuses to appreciate include: the Memo save function (save anywhere at any time instead of using inns, but lose your place if the system is reset), a handy dash button (bye-bye slow walkers!), an in-game bestiary that keeps track of monster types and stats, and several other informational screens and art galleries that you'll be to use before all is said and done. All in all, Final Fantasy I is a fantastic representation of one of the most influential role-playing games ever made, and it's almost worth the price of admission on its own.    Final Fantasy II  Never released in North America until now (the game that we know as FF2 was actually the fourth game), Final Fantasy II is one of the least played sequels in the franchise's history. An exact port of the WonderSwan Color handheld remake from a few years back, there are several significant changes made to this version that weren't in the original Famicom rendition, and a couple elements that still remain. The most important of which, is the stronger focus on characterization, story, and plot development. Though FF2 visits several recurring themes of the first game (four young warriors, crystals, the whole bit), its impact is much stronger and characters more endearing.   Just as in Final Fantasy I, FF2 has a number of visual and audio upgrades (and on a personal note, boasts one of the best battle themes in the series) with a few CGI cut scenes to match. The dash button has been added here just like its predecessor (sadly, it was a feature that wasn't realized until the 16-bit era), and an auto target option was included so that characters wouldn't waste a turn on a deceased enemy. A vastly important extra is the inventory menu, which has been increased in size to 63 slots from the original's 32, and enemy encounters that are much easier than they were before. Worry not though traditionalists; beating the game once unlocks the original version of the game by which you can test your might.   Perhaps the most important aspect in all of Final Fantasy II, however, is proof that Square was always looking to improve. Rather than stick to the basic experience system found in the first game, FF2 relied on a skill proficiency system that was later adopted by such popular games as ShadowRun and DaggerFall. The more a character uses any given ability, the better they become at it. Which in turn, makes them more powerful as they increase in skills. Also of note was the ~World Memory System~ that requires you to ~remember~ certain areas of the terrain or dungeons for use in puzzle solving or story-based elements later in the game. This isn't a practice you yourself have to perform though; you actually have to instruct your alter egos not to forget something; pretty innovative for its time.What else is there left to say really? Other than the fact that role-playing fans, Final Fantasy nuts, and aficionados of old school gaming have plenty of reason to give Final Fantasy Origins a definite purchase. This one-disc set is literally overflowing with a high-quality history lesson that not only provides well over 40 hours of simplistic but addicting gameplay, but a true look back at the origins of the world's most popular RPG franchise.The only thing left to do now is sit back and wait for one last hurrah on the PS front from our buddies at Square Enix so they can give us the last two major titles that never saw a U.S. release: Final Fantasy III and Seiken Densetsu III. Call it Final Fantasy: Treasures, Final Fantasy: Resurrections, call it whatever you want -- just give it to us, and give it to us now!", "date": "Apr 15, 2003"}