{"name": "Yu-Gi-Oh! Worldwide Edition: Stairway to the Destined Duel", "name_review": "Yu-Gi-Oh Worldwide Edition: Stairway to the Destined Duel", "ref": "https://www.ign.com/articles/2003/04/18/yu-gi-oh-worldwide-edition-stairway-to-the-destined-duel", "text": "not only features one of the most unnecessarily long names in history, it's also a follow-up to the game that Konami released back in late 2002:  Yu-Gi-Oh! The Eternal Duelist Soul. A little less than a half year after the original card game's release on the GBA, Konami revisits with this sequel, but other than the addition of a few hundred more cards, a slight tweak in pace, and a new style challenge interface, there's not much change to the overall game design. It's still a great strategy game and highly recommended, it's just not the upgrade we were hoping for. Features More than 1000 different cards 12 different booster packs Password system for owners of the actual cards Cartridge save Link cable support for two players, trading and battling (multiple cartridge required) Only for Game Boy Advance Yu-Gi-Oh! is another version of games like Magic: The Gathering or Pokemon: Trading Card Game, and Yu-Gi-Oh! Worldwide Edition, like last year's Eternal Duelist Soul is a virtual, paperless version of the game for the GBA. Players put together a card deck of monsters, magic attacks, and traps, and go up against other players' decks in a one-on-one battle. Players take turns putting down a single monster in attack or defense position, as well as activating magic powers that could give the player or his monsters enhanced abilities...or take away something from the opposition. Flip-effect cards can change the course of a battle; putting them face down may force the opponent to attack the card, which will activate a special ability that could hurt the opponent, his monster, or help the owner of that card. The match is over when a player's 8000 hit points is whittled away to nothing.   For Yu-Gi-Oh: The Eternal Duelist Soul, Konami has converted more than eight hundred different cards in the Yu-Gi-Oh! set, and in Worldwide Edition Konami expanded that number to more than a whopping 1000 cards (that's what the game says anyway...if you think I'm going to hand count them all, you're crazy). The inclusion of these new cards match up with the latest collection of actual Yu-Gi-Oh cards that can be purchased in local gaming shops, and the amount of cards really gives the GBA title a whole lot of strategy to its design because of all of the effects to uncover and learn. Each victory nets a brand new booster pack to open...and each card can then be worked into the player's main deck, secondary deck, or left in his or her collection. Just like the previous game released last year, owners of the physical Yu-Gi-Oh cards can enter in the password printed on their card to include that card in the GBA game...but each password can only be entered once.  The game design is exactly the same in Worldwide Edition, right down to the same gameplay interface and audio soundtrack. The pace of the actual card game has been increased a bit, so challenges seem to flow much more quickly since the cards and attacks zip around a lot faster this time around. But some of the same issues that we had in the first game in the series are still here; countering trap cards is still a mystery if you don't know what the card does ahead of time, and once a specific card has been turned over you can't take back that move even if it's going to do something potentially harmful to yourself. Eternal Duelist Soul's lame campaign mode has been replaced by a better interface where players can challenge opponents all over the land. But we can't help but be just a little disappointed that the game designers didn't implement a mode similar to what Pokemon: Trading Card Game on the Game Boy and Card Fighters Clash on the Neo Geo Pocket offered; the infinitely superior RPG-style exploration mode mops up the interface Konami created for Worldwide Edition. The game still takes moves one day at a time, so every selection you make on the world map, whether its to take part in an individual challenge, a competition, or simply to talk with one of the people to learn a bit more strategy, marks off a day on the game's calendar. There are specific events that happen on specific days, so you'll need to keep track of what's going on and what's going to happen.  Once again, Konami assumes that players who pick up this game are already familiar with the way the Yu-Gi-Oh card game design works. For the folks who have never discarded a single monster in their life, it will take a few tries to understand the mechanics. Konami seems to have this phobia of including a tutorial mode in any of its Yu-Gi-Oh card games...and it's the same thing here. It was something that was needed in Eternal Duelist Soul, and it's needed in Worldwide Edition.  But apart from the slightly wonky auto-rules and the lack of a tutorial mode, the Game Boy Advance, like Eternal Duelist Soul before it, is a lot of fun. There's a lot of thought that needs to go into deck construction with the more than a thousand different cards in the library. How many creatures should you hold? How many magics? How many traps? Which magics and traps would kick ass in specific situation? Should you overpower your deck with high level creatures with fewer low level...or vice versa? How many cards should you have in your deck? Two dozen? Three? For a game that the younger crowd's playing almost religiously, Yu-Gi-Oh has a lot of strategy in its design. And even in its complexity, the rules to the card game are very simple. All that's required is learning the structure of how each of the different card types are used and how the player's turns are laid out. After that, it's just all about studying each of the different effects each of the 1000+ cards have on the rest. It's slightly faster, it's got more cards to collect and utilize, but Worldwide Edition isn't quite the mighty sequel that it could and should have been. The distinct lack of advancement in the series might not be enough to get previous owners interested enough for the new game. But for who that want to keep up with the latest in the virtual Yu-Gi-Oh games on the GBA, and who have no problem spending 30 bucks on additional packs of cards for the real deal, Worldwide Edition is the one to get.", "date": "Apr 18, 2003"}