{"name": "Castles & Catapults", "name_review": "Castles & Catapults", "ref": "https://www.ign.com/articles/2003/04/18/castles-catapults", "text": "It's not every day that you see a giant publisher giving a junior high school project the chance to be published. Wait, that's not really fair to the junior high schoolers, I'm going to assume kids raised on games would be able to make a better game than this piece of work Magic Lantern put out. Whoever sold them that lamp ripped them off, cause there's jack for magic inside, no matter how hard they rub the thing. Castles & Catapults is simply the worst strategy titles I can remember in my tenure here, and I've seen a lot of them.   Where should I start? The story? Sure, I guess there was a story. Something about the middle ages and your quest to rid the world of evil people. Whatever, it was barely a story and barely worth paying attention to due to the fact that the entire story was told through one 100 word paragraphs at the beginning of each mission. ~Sire, we're going here to beat these people up!~ Yay. I'm intrigued now, really.   The game itself is a real-time strategy game mixed with some sort of Rampart-like gameplay. Each of the levels is fought over in rounds. At the beginning of each round, you'll pick your forces from six slots showing random allotments of units. Each player is given a number of points to spend and each of the choices is worth a different amount. Every time a unit is picked, another is put in its place, you just don't know what it will be. If you don't like the choices available to you, you'll have two opportunities to pass to your opponent hoping that he'll choose something and leave you with a good unit in its place. Along with the actual fighting units are random pieces of castle that you can purchase (which means you don't know what piece it is until you buy it), healing potions, and repair kits for your walls. So the strategy of how you want to play the game is up to you, but doing anything but balancing your units out is incredibly stupid. Different AI with different personalities will challenge you in skirmish and campaign, but they don't work so well. One guy likes magic while another likes melee while yet another will pick as many siege engines as possible. Whatever the case, they're all stupidly easy to beat because all of their strategies, if you can call them that, are childlike.   After you have your units and castle walls picked, you'll move to deployment phase where you can decide which units will fight with whom. You can set up three armies, the infantry using up one square, siege engines taking one to three sqaures, and dragons taking five out of a total nine per army. Once in the battle, the armies will always stick together and work together so choose wisely where to place your units. You'll also be able to switch to your castle screen where you can place the various castle parts (anything from a line of wall to a tower that fires arrows) in the space available. Don't be fooled into thinking this is even half as fun as Rampart was. Half the time you won't have any wall pieces to place and even when you do, chances are you'll never actually create anything that resembles a coherent castle wall. But at least it's good to see that the mentally challenged masons of the middle ages were given equal opportunity.     Once you're done, you'll be dropped into one of the uninteresting and generally strategically bankrupt maps. There'll be a couple of chokepoints every now and again and some hills, but considering anything can run up a hill and units can just run by defenses in front of a choke point, there's not much use to either of them. Really, when siege engines like trebuchets can slide right past your idiot troops and attack your keep before you can do anything about it, you're going to be frustrated. Your sad little melee and archer units will run behind trying to attack and fail at it giving it at least a couple of shots at your castle.   After you've destroyed the enemy units (I can't say I failed to even once) you'll go back to pick new units for a second round while maintaining those of yours that survived. After doing all of the same stuff as well as using any healing on injured units or damaged walls, you'll drop back in for a second round. The whole point of the game is to either be the last man standing, or to destroy the enemy keep with siege weapons. Each round has a time limit, but battles are over so fast that you'll either end up destroying the enemy keep if you have siege weapons or dragons (which are insanely overpowered and under priced by the way), or just ending the round quicker if you don't.   With only a total of three melee units, two magical units, one archer unit, five siege weapons and one dragon, the possibilities for very strategic battles are little to none. Just try to pick the best units and fling them at the enemy. The only sneaky decision I made the entire game was moving my siege engines around the side of the map to attack the keep during the fight. But I had won the fight long before my engines reached the enemy base, so there really wasn't much point.   So now that we've established the weak and ill conceived gameplay, let's talk about peripherals like graphics and sound. I'm wondering if the game could get anymore bland. I'm also wondering how it suffered slowdown in the middle of a fight with eight units with such a low end showcase. There is nothing here worth remembering from a technical standpoint or an artistic standpoint.   Sound is actually the only thing even remotely close to average with decent music and a real person doing voice work before each mission. Heck, let's give them credit for not creating another ~All your base are belong to us~ type of debacle.   As far as multiplayer goes, check out everything I just wrote and then you try sharing it with a friend. See if they don't try and hang you on a fence by your underwear.  If you see Castles & Catapults sitting on the ground underneath the bargain bin at your local software dealer, that's probably because the rest of the bargain titles tossed it on the floor out of embarrassment. How anyone could package this and expect someone to spend twenty of their hard earned dollars is beyond amazing. Games like this make me slap happy. I gotta slap myself in disbelief, slap the people that sell it because they're thieves, and slap Ivan just because he's there. Most of all I have to bitch slap this game over and over again for stealing my time and bringing me hours closer to death with nothing to show for it.", "date": "Apr 18, 2003"}