{"name": "Ninja Five-O", "name_review": "Ninja Five-O", "ref": "https://www.ign.com/articles/2003/04/21/ninja-five-o", "text": "from Konami and Hudson feels just like a leap back to the good ol' arcade days where Shinobi, Ninja Gaiden and Rolling Thunder were king of the action pack. The developers  have obviously been schooled in those  arcade games, as their own creation in the form of Ninja Five-O builds off those classic games and their unique gameplay ideas, while at the same time offering a very unique and contemporary gaming experience on the Game Boy Advance. Features Six missions Three difficulty setting, one unlockable More than 20 levels Time Trial mode Cartridge save for high scores/time trial times Only for Game Boy Advance Ninja Five-O (known as Ninja Cop in some circles) puts players in the role of a Ninja-gone-detective, Joe Osugi. His task is to stop a terrorist group that has been influenced by the evil forces of the Mad Masks, items that were previously locked away by the distant forefathers of the Ninja. As Joe, players don't do a whole lot of detective work; it's just part of the game's storyline. Instead, players put Joe Osugi's ninja skills to use to take out the terrorist threat and rescue hostages, eventually attempting to fall the leaders that have been put under the influence of the Mad Masks. Bionic Commando is clearly the game's main inspiration, as many of the level challenges require players to make use of Joe's grappling hook; players will have to swing from platform to platform to get around the areas. But what's more, players will have to pump, swing, and leap up to get the Ninja up to higher platforms; this technique is very different than Bionic Commando, which allowed players to simply pull up to the higher ledge with the grapple arm. In Ninja Five-O, this required grapple-swing technique adds so much to the level designs, and it looks so damn cool when you pull it off like it's second nature.  But Bionic Commando is only part of the game's inspiration. Hudson also rightfully lifted gameplay ideas from Revenge of Shinobi and Shadow Dancer, easily some of the most recognizable ninja action games ever released. In Ninja Five-O, players have an unlimited number of shuriken stars that they can lob at terrorist enemies, and these projectile attacks can be upgraded by picking up lightning bolt icons. There are only three levels of shuriken power-ups, which is a little annoying since you don't get anything extra when you're all maxed out and you pick up another power-up...except for points. Players also have to make use of Joe's sword attack to take out enemies up close...and after getting used to the controls, you'll probably find yourself using the sword attack more than the shuriken stars. It's much more effective to charge into an enemy with the sword slashing, especially since there are enemies that hide behind hostages as human shields; it's very easy to accidentally take out a hostage with a star, which is a no-no when you're trying save them. Players can also latch onto ledges as well as slide attack, which comes in handy when trying to climb through tunnels with livewires zapping all over the place.  But even though the game's pretty much an amalgamation of existing old-school game ideas, it's a combination that really works. And the designers have crafted 20 levels that are extremely challenging, but not frustratingly so. Players have only one life to clear out the entire level, and it will take a few times through to figure out the best plan of attack; all the levels are rigidly designed, with the same enemies, power-ups, and keys in exactly the same location every time. Players will have to learn the specific attacks of each of the colored enemies in order to succeed; so, every level essentially has a ~pattern~ to follow, but it still requires a lot of skill to get to the end of each area. The designers take advantage of the level layouts by also including a Time Trial mode for each level that's been completed; the game will record the best times to cartridge, with each level having a ~qualifying~ time to accomplish.  Ninja Five-O is a surprisingly great game that almost came out of nowhere; Konami released this game as quiet as can be, with relatively no previous hype. The game harkens back to the days of Ninja arcade games, and even though it borrows its gameplay elements from previous designs, it's not a me-too Game boy Advance game. Since it's an original game with no license or previous title to bank on, chances are it'll be one of those games that'll just sit on store shelves...which is a shame because this is an exciting, fun and challenging action game that shouldn't be missed.", "date": "Apr 21, 2003"}