{"name": "Chopper Attack", "name_review": "Chopper Attack Review", "ref": "https://www.ign.com/articles/1998/06/18/chopper-attack", "text": "Seeing a gaping hole in the console's lineup, Midway has picked up Seta's helicopter shooter, Wild Choppers, for release in the west. Unfortunately, the game arrives much too late. As this first-generation game from Japan stands next to titles like Banjo-Kazooie and Midway's own Mortal Kombat 4, it looks hopelessly dated. Nevertheless, players looking for a helicopter game on N64 can't be very picky, and an okay game is better than no game.Essentially a fully polygonal version of the good old Jungle Strike for the Super NES, Wild Choppers has a lot to be excited about: 3D graphics, a mostly fluid framerate, booming explosions, missions with different objectives, power-ups, eight attack choppers, and a cool arsenal of missiles, bombs and decoys. Unfortunately, there are a few problems, as well.Gameplay: Select one of eight funky looking helicopters (all with different attributes, such as speed, amount of weapons, armor). With the money you earn by successfully completing missions, you can buy air-to-ground, air-to-air, and air-to-ground-and-air missiles, as well as dummy decoys, rockets, cluster bombs, homing bombs, and powerful secret weapons that appear later in the game. It's important that you buy the right weapons for the right missions. For example, if you're required to destroy factories, stock up on bombs. Mission briefings before each level give you hints on what to buy and clue you in on what to expect.The first thing you notice when starting a mission is that the control takes some getting used to. Thankfully, Midway added alternate control schemes to the Japanese ~leftie~ position (in the original, you HAD to hold the controller on the left and center prongs, using your right thumb for the analog stick to control pitch and yaw and your left thumb for the D-Pad for directional movement. Now you can select more Turok-like controls with C-Button movement). Like in Turok, you eventually eventually get used to the controls, but Chopper Attack's helicopter physics -- as realistic as they may be -- don't go together with accurate aiming and quick action. Everything feels a little too lose, and the helicopters fly entirely too slow.Thankfully, there's a lot of gameplay in Chopper Attack. The first few levels are a bit on the boring side, with simple missions like freeing POWs so that a rescue helicopter can pick them up, or taking out choppers and stealth planes, but later on the game really starts to shine. One level has you protect a jumbo jet from terrorist attackers, others lead deep into cave systems where you have to destroy chemical weapons factories or square off against futuristic attack forces and fighter planes. You can lock on to your targets with homing missiles, shoot at them with your (unlimited) machine guns (if you can manage to aim well enough) or bomb ground targets. Destroyed structures often contain weapons power-ups, health packs, or fuel -- but sometimes your enemies also hide a trap in the buildings that will blow up after a few seconds. If only the game moved a bit faster...GraphicsChopper Attack moves along smoothly most of the time, but there's a fair amount of fogging or darkness to hide draw-in. The detail level is generally pretty low. Especially the ground textures are far too low-res for comfort, looking more like camel-hair blankets than actual hills. Chopper Attack's camera perspective is partially at fault, being so close to the action that every texture gets blown up to gigantic proportions. The polygon models of your chopper, ground targets and enemy vehicles are rather nice, though, and the awesome explosions are different depending on your target (trees even fall over when you bomb them). Like in Blast Corps, destruction is the name of the game -- and if there is one thing that Wild Choppers excels at, it's blowing stuff up. Although they could have been done a lot better, missiles leave contrails when they whiz through the air, and there is even the occasional metal texture livening up the mess of brown and green ~blankets.~SoundSound effects are well-done, with stereo explosions, rotor rattle, and realistic weapons noises. On the down-side, the militaristic music sounds like somebody hid an NES in your N64. Good thing Midway added an option to switch it off (something that was missing from the Japanese version) The voice samples are rather inane (~I've got a birthday present for ya!~ and ~You yella!~ One of the most rewarding experiences is blasting a pesky Rambo-lookalike -- and hearing Sly Stallone scream as he flies through the air.OptionsRumble Pak and Controller Pak are both supported. Once you save your game, you can even go back into the missions in the Practice Mode and just fly around without objectives. There are two difficulty levels, but sadly, no two-player support. A major oversight in a came of this type.In spite of its slow speed and dated look, Chopper Attack manages to be a fun shooter. Like in PilotWings, even just flying around in the 3D environments has its appeals (despite the fact that you can't go up and down at will) -- and once you get the hang of it, bombing and blasting your opponents makes you want to play on despite the pain slowly building up in your thumbs. Although I wouldn't go as far as to recommend purchasing this game, it has its charms and makes for a good week-end rental. And until THQ releases EA's Strike on N64, there is no alternative.Peer Schneider", "date": "Jun 18, 1998"}