{"name": "Burnout 2", "name_review": "Burnout 2: Point of Impact Review", "ref": "https://www.ign.com/articles/2003/04/28/burnout-2-point-of-impact-review", "text": "Need some speed?  Wanna sport a rally?  Hoping to join a club at midnight?  Forget all that -- all the racing you need on your Xbox is Burnout 2: Point of Impact - Developer's Cut.  Criterion's sequel to their fast-past high-octane smash-em-up returns with an even greater sense of speed, improved AI, deeper and more intelligently designed tracks, and an extra game mode specifically designed to showcase Burnout 2's impressive crash physics.  They say to save the best for last, which must be why Xbox owners are getting Burnout 2 after PS2 and GameCube.  The Xbox version, dubbed the Developer's Cut, has several upgrades over the PS2 and Cube releases.  The list includes over 20 additional custom car skins, custom soundtrack support, the score from the original Burnout, and Xbox Live support.  But can all those additions really make Burnout 2 worth the wait?  Hell yes.  This game is &*#$ing awesome.  Features Bigger tracks and better AI than the original Burnout Stunning crashes that will blow you away 21 extra custom car skins Solid 60fps in two-player split-screen races Custom Soundtracks Score from the original Burnout 5.1 Dolby Digital Xbox Live support in the way of an online scoreboard  Gameplay Burnout 2 isn't without its flaws.  In fact, there are some nagging shortcomings that drag down the final score a bit.  Heck, I don't even think it's in the top three best Xbox racers.  However, it is by far the most fun racer on Microsoft's big green box and offers a greater sense of speed than any other four-wheeled racer on the market.  The concept is simple enough -- Your goal is to go fast, and the more risks you take, the greater the rewards in terms of speed and spectacular crashes.  By barely missing cars, getting air from hills, scoring mad drifts, and weaving through head-on traffic, you fill your burnout meter.  When full, holding down the A button will send you into hyper-speed.  While you're going much faster, you're also faced with greater risk of crashing.    Burnouts are a lot easier to come by than in the original.  And by maintaining a fast speed and taking risks, you can string burnouts together.  You could, if skilled enough, maintain one consistent burnout throughout an entire race.  The sense of speed is spectacular, even more so than the original.  Anyone playing this in third-person perspective is a fool, because the bumper view adds some amazing sensation.  Hitting your burnout and trying to take your car into head-on traffic requires lightning fast reflexes and a sixth sense about traffic patterns.  Going this fast, you sometimes won't even see a car until just a second before its flashing lights are right on you.  Of course, all of these risks come at a cost.  Zipping through a busy intersection or snaking through the oncoming lane can quickly result in an accident.  When that happens, don't look away.  No one's seen accidents this titanic, amazing, and awe-inspiring since the '80s run of CHiPs.  At such high speeds, even a minor bump can lead to a spinout across three lanes of traffic, causing all kinds of chaos on the road.  Trucks flip over, buses smash into retaining walls, and sports cars flip end over end.  Hoods, wheels, and fenders fly off and litter the road.  Though a crash hinders your race (you automatically respawn without any damage after about 5 seconds), it's hard to be too mad about a crash when it looks this great.    If anything, Burnout 2 doesn't take their crashes far enough.  Using an unbelievably realistic crash engine, the boys at Criterion could learn a thing or two from watching the intro to some CHiPs episodes.  In Burnout 2 there are giant trucks hauling a load of ten-foot long logs.  But in an accident, those logs don't come loose, roll around and cause more damage.  Why do you have logs on a truck if they aren't going to do anything? And there are lots of gas trucks, but there are no explosions in the game.  Burnout 2 should be one notch higher than it is to truly make it the greatest racing spectacle on earth.  Even without these things, it's still amazing to witness the crashes.  Aiding in these mega-accidents are long, smartly-designed race courses.  Though there are occasional splits in the courses, it's almost all linear.  Though it would be nice to see the next title in the series offer a wide open city to explore like Midtown Madness 3, the tracks are still far better than what was offered in the original.  With an American theme (as opposed to the European flavor of the original), the tracks are inspired by real U.S. locales, including lovely Santa Cruz, California.  The long tracks are designed for speed first and don't have lots of twisting turns that force you to slow to a crawl to get through.  Your goal is to keep your foot on the accelerator from end to end, power drifting along the way.      Traffic AI is more intelligent this time around.  Cars flash lights as you attempt to avoid a head on collision and there are far fewer incidents where cars will swerve into you, which was a problem in the first Burnout.  The cars you race against (up to three AI drivers) are much better than previously seen.  In the last Burnout, the AI drivers had about four patterns for each race and it became easy to predict where a car would go, allowing you to cause accidents to hinder them.  Not so now.  If there are limited patterns for the AI cars, I certainly can't see them.    If Burnout 2 needs anything, it's a more organic feel.  Though the AI is better and the tracks are bigger, races still feel very planned.  The same cars tend to be in the same spots, and though they may react differently in different situations, it still offers an air of predetermination.  Along a different line, it's a disappointment that you can only race against three other AI cars.  When there are Xbox games offering races against up to 19 AI drivers at once, three is skimping it pretty hard.  But at least the three AI racers do a good job of trying to force you into traffic.  There's competition in Burnout 2 to not just speed past an opponent, but to try and push traffic their way or otherwise force them into a horrendous accident.  There are few greater feelings in a racer than riding alongside a tough opponent and edging them into a semi.  As a horrific scene erupts behind you, the music kicks up to get the blood pumping even faster.  That's cool.  Burnout 2 features a Championship mode similar to what was offered in the original Burnout.  Racing against four AI opponents in a variety of locales, your goal is to get gold and win enough points to nab the trophy.  As you progress through the mode you'll unlock other games, like pursuit (where you try and bash a criminal car with your cop cruiser).  New cars, skins, game modes, and track are all there for the unlocking.   While the Championship mode is good and will keep you going, the difficulty ramps up in an odd way.  The first few races are cake walks.  Then suddenly it becomes very difficult to win.  No middle ground.  Towards the end, you'll have races where you can go through four laps without a single wreck and never catch sight of the lead car.  Your only choice is to learn to string burnouts together.  Seems a bit unfair that you can't win a race with perfect driving.    The Championship mode is good, overall, but it's nothing compared to the beauty of Crash mode.  The goal in Crash mode is to cause as much damage as possible.  Featuring 30 different crash scenarios, Crash mode is the most addictive mode I've experienced in an Xbox racer.  Some long nights were spent trying to get gold in crash events, as I promised myself, ~One more time and then I'll go to bed.~  Two hours later, barely able to keep my eyes open, I was still there, trying to better my record.  Crash mode is absolutely phenomenal.  While it's not hard to medal in all 30 scenarios, it's quite tough to get gold in all 30.  And even then, you're still likely be inspired to continue playing in order to cause even more spectacular crashes.  Another incentive to keep playing is the use of Xbox Live scoreboards.  While there's no head-to-head pay or downloadable content, Burnout 2 does allow you to connect to Live and upload your scores.  There are plenty of categories to choose from and it's cool to see where you rank (or how far you are from ranking).  At first I scoffed at the idea of supporting an online scoreboard, but after checking it out and seeing that someone strung together 46 burnouts (my record is 8), I found myself compelled to try and get at least close to some of these records.      That said, Burnout 2's scoreboard offers nothing you can't get from any other Xbox Live game.  In fact, there are some Live games that offer better scoreboards than this.  There's no ~buddy list~ scoreboard to show you just your scores against those on your buddy list, and no regional scoreboard section either.  If a scoreboard's all you can offer on Live, at least make it the best it can be.  That's not what this is.  Nice, but it should have been more.      Lastly, there's multiplayer.  I'm not trying to discount the multiplayer aspects of Burnout 2, but this game is a much better single-player experience.  Still, those wanting some multiplayer fun won't be disappointed.  Though there's no System Link support, the split-screen is fantastic, offering a smooth 60fps and all the furious speed found in single-player.  Racing spilt-screen has never looked better on Xbox.  The Crash mode is just a matter of hot potato, which is fine, but not terribly innovative.  Why not find a way to have players working against each other in a crash mode?  The multiplayer isn't bad, but it doesn't seem much of a focus of the game and really, you'll likely find far more life in the stronger single-player elements.  Graphics Burnout 2's greatest asset is speed.  Moving incredibly fast, the sense of speed is unreal.  It's amazing that a game can move so fast, with so many other cars on screen, and still maintain gorgeous textures and impressive lighting.  A smooth 60fps, even in split-screen mode, with no slowdown whatsoever while you blaze around at 200mph?  Gorgeous.  The crashes are stunning and memorable, with car parts flying everywhere.  Great effects as well.  Burnout 2's only disappointment comes with the jaggies.  If only Burnout 2 was as clean as many other Xbox racers, it would be a true thing of beauty.  But the jaggy demons do dent into the overall visual appeal of the game.  It looks great, but not quite at the level of some recent Xbox racers.  Sound The crash sound and the blare of traffic are perfect.  Screeching tires and the booming sound of an accident in Dolby Digital 5.1 is something not to be missed.  When you hit a burnout, the music ramps up appropriately.  It's nice that Criterion included custom soundtracks and the score from the original Burnout.  And you'll probably want to hop to your own soundtrack after a while, because the electronic music featured in Burnout 2 is a bit generic and, dare I say, a bit too inorganic (see how it all ties together?).  As Randy Jackson would say, ~I just ain't feelin' it dawg.~ Burnout 2 is the fastest four-wheeled racer on Xbox.  The speed is amazing and the crashes are phenomenal.  I'll never give up my Crash mode.  It's too much fun.  The races are good, but maybe could have been stronger.  Certainly Burnout 3 will need to take some bigger leaps, but if the progression from Burnout 1 to 2 is any indication, Criterion will have no trouble taking the series into the future successfully.  This is for any racing fan who isn't interested in customizing things and worrying about being the perfect driver, but at the same time doesn't want the false feeling of a cart racer.  It's the perfect balance between arcade and reality.  Definitely not the best racer on Xbox, but my favorite for sure.", "date": "Apr 28, 2003"}