{"name": "Lemonade Tycoon", "name_review": "Lemonade Tycoon", "ref": "https://www.ign.com/articles/2003/05/21/lemonade-tycoon", "text": "Years ago, when Commodoe 64's ruled the classroom, Lemonade Tycoon was considered a killer app.  A crash course in business sense, you learned how to manage profit with cost, how to gauge customer response, and the inherent value of sugar in any enterprise.  Now, the sweet sim is back on your cellphone and PDA, thanks to Hexacto, and it's up to you to rid the neighborhood of scurvy, once and for all!  Features: Multiple maps View results on the LSX (lemonade stock exchange) Several stands with lots of upgrade equipment Save game feature Hone the perfect lemonade recipe!  Tired of watching your profits disappear into the ether on the stock market? Bummed that your combo fro-yo/tire shop went bust?  Go back to business school by setting up a lemonade stand in a quiet neighborhood and reacquaint yourself with the basics of business: supply vs. demand.  You start the game with an empty stand a a few bucks.  You must use your capital to buy supplies, like lemons, sugar, cups, and ice.  Judge the weather and neighborhood before you draft your initial recipe, because once the day has started, there's no changing the formula.  If it's a particularly hot day, consider using more ice than usual in your mix.  And if it's overcast, try a little extra sugar to appeal to the communal sweet tooth.  No matter what, you ain't gonna break the bank on that first day.  But it's good experience, a way to start learning about the fancies and fickleness of your customers.  Make appropriate adjustments for day two and try again.  Too many days of losses and it's time to hang up that ~We lost our lease!~ sign.  Stick with it, though, and take time to consider all the variables that can go into a single day of lemonade slinging, and you'll soon be turning incredible profits.  Use those profits to upgrade your stand with superduper equipment, like an industrial-grade juicer that will mix your lemonade faster.  On a hot day, you need to crank out that beverage to keep the customers coming by.  Get a line, and you might miss some crucial sales.  The people that visit your stand are groovy little automatons cut from the Sims.  They move to and fro, going about their business.  When they visit your stand, you can gauge their satisfaction by tiny thought balloon that appear over their heads as the wander away.  A big smiley face means they dug your product.  The inverted grin with the squinty eyes means your mix was either too sour or too watery.  Exclamation points mean the wait was just too long.  Lemonade Tycoon is a freakishly inventive, clever, and addictive game.  Anybody with an ounce of entrepreneurial curiosity in them will immediately take to Lemonade Tycoon, as it manages to present all the aspects of business leadership and required horse sense you might find in a college classroom without the insane tuition.  You provide a product the public wants and they will buy.  Advertise to the right demographic and they will come.  The visuals are quite charming, with the goofy little people wandering the neighborhood (or mall, or whenever you put your stand in later levels) and a capable interface that makes buying supplies and prepping recipes easy on the peepers.  With so much information to take in--weather, customer satisfaction, lemon supply--Hexacto deserves major kudos for presenting it perfectly on such as small screen.  (We tried it out on the Motorola T720.)I was a huge Lemonade Tycoon junkie on the Commodore 64.  And I was re-infected just as easily by this souped-up remake.  The PDA version of LT is certainly better than the celly rendition--more tips, bigger playing field, etc.--but the Motorola T720 was a fine portal to the world of citrus hustling.  Looking for something different than the current crop of puzzlers and simple action titles?  Download Lemonade Tycoon, toot sweet.", "date": "May 21, 2003"}