{"name": "Rise of Nations", "name_review": "Rise of Nations Review", "ref": "https://www.ign.com/articles/2003/05/21/rise-of-nations-review", "text": "My turn-based strategy (TBS) reviews date back to the late 1980s. By contrast, I distinctly remember giving a glowing recommendation in a PC Games issue of 1992 to Westwood Studios' Dune 2, the first major release real-time strategy (RTS) game. I don't take this little trip down Recollection Road to proclaim any special authority or knowledge about these game genres; who could? Maybe Sid Meier, Chris Crawford, or another of the small handful of developers that truly built the computer gaming industry. Instead, I bring this dual focus up because I wish to draw your attention to a dilemma. You see, I'm sorely conflicted. Rise of Nations is a sort of halfway house in many respects between the RTS and TBS genres: while all players (whether AI or human-controlled) move at the same time, the ability to pause and issue commands before restarting time/actions effectively creates a turn in two discrete phases. At least, that's the way a part of me looks at it, because these two inner voices representing my enthusiasms for RTS and TBS games down through the years are now passionately disputing all matters relating to Rise of Nations inside my head. Computer games have been credited at times with causing everything from kleptomania to black masses, but I never thought I'd become the PC poster oldster for Multiple Personality Disorder.   So with your permission (which you can email to IGN, along with a request to Steve Butts that he take pity on my dotage and treble my wages) we'll treat this review as a dialog between the two voices in my Cro-Magnon skull, each giving its own perspective. And since ~Barry~ and ~Brenesal~ don't state those perspectives clearly, let's call them ~TBS~ and ~RTS.~ Just recall that they're both me, limited to comments on Rise of Nations, and everything should be fine. Of course, if another voice calling itself ~MadCow~ should interrupt and start sobbing about shards of glass, run like hell.   Starting Out  RTS: Let's consider the options. Multiple playing and winning conditions are an aspect of Rise of Nations that really does it for me. Sure, there has been a similar of even greater variety of options provided in games like Patrician 2 and Europa 1400, but these aren't traditional RTS titles. It can be argued that you're really not playing against anybody else in them, except yourself. With Rise of Nations, you can play for a host of different victory conditions, such as Barbarians at the Gates: all other nations attacking only you; double resources and one later technological starting age for yourself; no rushing permitted for the first fifteen minutes; and a huge map of the Himalayas and a playing time limit of two hours. Or you might try preset teams of allied nations, where advancing technologies are very expensive and take a long time to research; nations are limited to populations of fifty on a map filled with large islands; and players are eliminated from the game when any of their cities are captured. Winning can be based on many parameters, including a military victory, controlling a certain percentage of available territory, the number of Wonders (fourteen possible) a given side has built, or the first player to reach whichever technological age you decide is the final one for the game, etc. I really, truly like this.   TBS: Multiple winning conditions? Smoke and mirrors. What really drives a good strategy game isn't the choice among several winning conditions (though it's certainly attractive), but the gameplay involved in different victory conditions. That's one of the reasons I really like both Alpha Centauri (which is as much Reynolds' game as it is Meier's) and Master of Orion III: they both become entirely different games if you try for, say, the evolutionary/research win in the first, or a Senate win in the second, instead of going for a military victory in either. What kind of excitement can you look forward to if you go for the economic or population wins in Rise of Nations? Running up your research tree, as usual, and planting cities or building markets, as usual -- just more of each. The focus is different from the military win, but there's no additional gameplay to challenge me. Rise of Nations is precisely the same game with the same features, either way.   RTS: I like the eighteen ~races~ available for play by any side. (And note you can select the number and race of your opponents, from one to seven, including the designation of a specific foe, a randomized foe, or one whose only quality you know is that it has special advantages for offensive, defensive, or economic gameplay. Hotcha.) The realworld national designations mean nothing, and have at best only the most generalized relationship to the unique benefits each race receives. But the advantages of each race are very well chosen for game balance, variety, and distinctiveness. They involve everything from free or cheaper units and buildings to free researches, faster repairs, automatic healing units (French), revealed maps (Spanish), and dramatically increased attrition rates of enemies on your soil (Russian).   I also like the non-linear campaign, in which all these races take part on a giant map. You choose your race, then spend each turn moving armies either into another of your territories, or across into somebody else's. Needless to say, when you enter theirs, they resent it, and that results in armed conflict. You then drop into a standard Rise of Nations realtime, isometric screen, for a bit of personal, one-on-one warfare. Each victory that gains you territory also brings with it some combination of rare resources, supply centers (which affects the number of armies you can station in a territory), tribute, and bonus cards. These bonus cards can be used for a diversity of purposes, such as lowering the fortification value in a land before attacking it; while tribute lets you buy more bonus cards, increase territorial fortifications, or make diplomatic deals. Credit where credit is due: the design was taken over from Warlords: Battlecry, right down to the ability to attack any country you want, and acquire a different benefit from each. But I think Rise of Nations has created an intriguing and attractive variant.   TBS: Yes, there are many races available, but none of them has a personality as such. I really miss the sophistication of design placed into Alpha Centauri and Alien Crossfire factions, the way they valued unique aspects of government and culture differently, and treated you, in turn, differently according to the way you approached or deviated from a given ideal. By and large, too, the eighteen races look the same, since they only employ three different graphics sets for buildings across the ages. The music is the same no matter whom you play, so the racial distinctions feel abstract, rather than part of an immersive experience.   As for the campaign, Warlords: Battlecry at least provided a host of custom-tailored units for more than a half-a-dozen fantasy species, and heroes with unique professions and a range of abilities and spells. Rise of Nations has none of that to offer. Gameplay can and does become repetitive, after you've been through a series of battles that pit your forces against others which resemble them so greatly: Rise of Nations is built upon borrowed ideas, treated in a grey fashion. You'll notice, too, that the whole world map section, with its careful strategizing about what to move, play, or attack next, takes place in turns. This is only one of the elements that blur the distinction in Rise of Nations between an RTS and a TBS. In all modes but multiplayer (through GameSpy matchmaking, LAN or direct Internet play), you can play the product like a TBS, with discreet turns for in-depth instructions and actions. In fact, on large maps with many players it's almost a requirement, given the sheer number of tasks you monitor and forces you control.    Ease of Use  RTS: Let's return briefly to something you touched upon, a moment ago: multiplayer mode. I personally like it. It's fun to play, easy to communicate, and the core commands are simple to learn, especially with the aid of the six in-game tutorials. The interface overall is a delight, and with up to eight players, supports quick chat and the easy transfer of resources.   TBS: Leaving aside the issue of multiplayer (which remains a nearly mindless clickfest, no matter how you camouflage it), I do agree that Rise of Nations has an extremely good interface and a lot of in-game help. I've never liked complex games which tried to make you believe it was possible to abandon all on-screen controls. The wealth of information Rise of Nations provides is supported by a multitude of useful pop-up screens. Roll the mouse over the Market, for example, and you're succinctly told what functions the building has, a hotkey command that returns to the Market, and a research that will improve it. The interface displays the amount of resources you've gathered, and how fast they're being gathered; your number of cities and citizens; and how many citizens are allocated to each available task. All of this fits over the main screen but never obscures it, thanks in part to a lowest resolution level of 1078 x 768. Much of the informational detail in Rise of Nations can be concealed by choice, but its availability really does cut down on the steep learning curve that could otherwise be expected from a game with so many linked activities and resources.   RTS: I also like the automation applied to non-military units. If you don't send a citizen to build something, for instance, it will (by default, which can be changed under options) move towards the nearest available resource-gathering activity, and lend a hand. If you have a caravan standing around and start a new city, that caravan will begin a route between its current city and the latest addition, adding automatically to your cash reserves.   The game also takes a commonsense approach to grouping units. If you click-and-drag a box around your militia and accidentally include a few civilians, Rise of Nations ignores the latter. When your land troops attempt to cross a body of water, they automatically deploy ships   TBS: ...presumably inflatable bath toys, kept strapped to their bodies at all times...   RTS: ...for that purpose. It's little things like that which make gameplay a lot smoother, and conversely makes it so much more difficult to return to other RTS products that lack these features.   TBS: But things can become pretty unwieldy in massive battles, you'll have to agree, when you want to send units away from the front to heal. They can only do this in buildings (unless you're the French, or possess the Eiffel Tower Wonder), and there's no mechanism whereby a unit will go to heal on its own, as in Total Annihilation, when a certain level of damage has been done it. You have to select each unit individually. Nor are you notified when that unit finally heals. You have to take the unit out of the building it's in order to examine its state. That's really awkward.   That reminds me: a while back, you brought up the six in-game tutorials. Sure, they're nicely designed, but like so many tutorials in RTS games, they never dig beneath the basics of movement, building, and research. They're essentially fluff.   I also miss an in-game encyclopedia. It was the kind of thing both Alpha Centauri and Master of Orion II did so well. Or look at the ledger book in Tropico II, with it detailed descriptions of each building type, the number of buildings in a given type your empire possesses, etc.   RTS: Can't say I disagree with any of that, except the tutorial comment (because the finer points can only be left to learning through play). But I would note that BHG probably didn't include an in-game encyclopedia or ledger because they don't want to draw you away from the action on the main screen. RTS developers typically invest a lot of design time in maintaining the element of momentum, and a player breaks that every time they go to check an in-game help system.   TBS: So the solution is to send them off-screen to thumb through the manual in pause mode, instead?   RTS: Saracen dog.   TBS: Spartan pig.   Graphics  TBS: Finally, a good conquest strategy game with enough drawings of each unit to make animation good. Nice touches on the water and circling birds, too: not quite Dungeon Siege, but I suspect Big Huge Games got the idea from there. This is a classy looking game.   RTS: Good? You would say that: TBS developers and players think all you need is AI, and smirk at the idea of truly attractive visuals. What about Topware's Earth 2150 and Moon Project? Those RTS games at least gave you attractive and diverse weather and true 3D terrain, both having their effects on unit movement, visibility, and battles. Hell, you even had units that could burrow underground, so the plane of activity actually occurred in three areas: the sky, on the planetary surface, and beneath the land. None of that is in Rise of Nations, if you discount the presence of bombers and fighters over whose actual movement while in flight you hardly control. Units can't use mountains for visual and attacking bonuses, or forests for defensive bonuses. Rise of Nations is just another Age of Empires, from a purely graphical standpoint.   I'm also disappointed by the zoom control. Sure, there are three levels, but as they don't appreciably differ that much, I have to wonder why BHG didn't include a fourth or even a fifth level, pulling further away. The jump from the most distant zoom to the mini-map overview is too great a change, in my opinion.   TBS: I think you're being too hard on Rise of Nations, in this respect. While graphics can be used to enhance the atmosphere of a game, they aren't what make a good strategy game.   RTS: No, but graphics that are truly, effectively 3D add a whole new dimension (pun intended) to strategic gameplay.   TBS: Puns are the lowest form of humor.   RTS: Only when you haven't first thought of them, yourself.   TBS: But in this case, I did...didn't I?    Gameplay  RTS: We're back from commercials, with both halves of Barry Brenesal's psyche battling it out over various aspects of Rise of Nations. I'm RTS...   TBS: ...and I'm TBS. We've now moved beyond issues of startup and ease-of-use, into the actual gameplay, itself.   RTS: That's right, and something you said earlier struck me; that's there's nothing new in Rise of Nations, just a lot of borrowed ideas.   TBS: Well, yes. And most of them come from TBS games. For instance, a host of buildings offer named researches such as Herbal Lore and Pharmaceuticals. These in turn grant your people new abilities or improve existing ones. All this is very similar to Alpha Centauri or the Civilization series, as are the many Wonders you can build, or the anachronistic ruins that mysteriously provide a one-time resource boost.   RTS: So it isn't original. Is originality that important? It's how you use what you've got that makes the difference.   TBS: And that brings me to my next point, thank you. Rise of Nations may use various features found in TBS games, but it doesn't implement these features with any real personality. Consider each of your named researches: it has an effect, whether on resource gathering, unit competence, etc. But the research itself remains nothing more than a handy label. The strategic benefits are made clear, but not the importance of the research itself in terms of civilization's progress. So a player learns Herbal Lore, but never learns what that progress means, its eventual impact on the codification and composition of plants, etc. In the final analysis, Herbal Lore is just a dry, nondescript step on a ladder towards victory, differing from, say, the Taxation technology only in terms of its game benefits, rather than what it actually means.    Other developments in TBS games seem to have been absorbed into Rise of Nations in a rudimentary fashion. Diplomacy is a good example. You can make alliances, but you can't make temporary treaties that involve a group of nations agreeing to battle a specific third party, as in Europa Universalis II. (Have I mentioned that EU II is an RTS? And a more original one, too.) Nor can you threaten neighbors into backing off from alliances made with your foes, or get them to agree to an exchange of maps. If you go to war, an AI ally won't automatically do so, which destroys one of the main reasons for a standard alliance in games! Exchange units or researches? No way.   RTS: I think you're missing the point. Rise of Nations isn't about the intricacies of behind-the-scenes manipulations. Like any standard RTS, its raison d'etre is building structures and units to take over the other guy. Reynolds has created a reasonable compromise in the game that lets you keep your attention focused on the playing field, on a single main screen, while adding an extra dimension through dramatically increased options for research. It's not too taxing for a quick multiplayer session, yet strong enough to add attractions to standalone mode.   And now if you've finished complaining about what Rise of Nations lacks as a TBS, I'd like to discuss some of its RTS gameplay aspects I really enjoyed.   First, there's the way research is deliberately spread out among a host of buildings at any given time. This means that instead of researching one particular technology, as you would in the Civilization or Master of Orion series, you have (after the initial startup phase) a broader selection of technologies and upgrades to learn through simultaneous resource investment, if you so choose. You can even build libraries in multiple cities that research differing technologies. As all research is resource-driven, however, you have to be selective about the technologies your people study, and balance these against upgrades to resource collection and unit quality. It's all a major part of Rise of Nations strategy.   Second, I appreciate the smooth flow of technological development as you move from Age to Age. This was not something that could automatically be expected, as each of the eight Ages, which are researchable, unlock a host of potential improvements (which in turn depend upon, you guessed it, more research). It would have been all too easy in a game that placed so much stock in technology for any given Age to be all too quickly achievable, with a particular technology that provided the nearest thing to a quick victory. (Alpha Centauri's fighter jets, available upon completion of the Doctrine: Air Power technology, provided just such a boost.) Of course, there are bound to be individual technologies that various Rise of Nations players swear by, assuring us all that a straight path towards its completion results in automatic victory; but if so, I've yet to find it, and I've been playing Rise of Nations for more than eighty hours. There are certainly different overall winning strategies suited to various types of players, but I don't think the game is so poorly balanced as to give one path an easy route to success.   National borders: among my faves. I suppose I really only value it because the last game in that TBS series you were once so fond of, Civilization, permitted foreign units to walk right into the middle of your territory and set up cities without even waving hello. That was utterly unbelievable. By contrast, Rise of Nations expands the perimeter of your nation through cities and research, but always within a certain distance of your home territory. Territorial integrity and unit attrition prevent you from thrusting a citizen unit deep into your opponent's, shall we say, flanks, and they can't do the same to you.   And speaking of flanks, I applaud the developers' application of combat bonuses to flanking attack strategies. Entrenchment, too, and formations, which can be kept during troop movement or allowed to lapse until arrival at an end point: your choice.   I should mention the strong AI, as well. The developers are justifiably proud of it; so much so, that they allow you to dispel the fog of war (it's another one of those great options), and watch the various AI-run nations themselves. It's a great way to get a sense of what the AI considers an efficient civilization-building strategy. At weaker than average difficulty settings, the AI is less aggressive and sensible: enemy scouts run away, but return to let you kill them, and enemy citizens remain at work while you attack, instead of going inside their buildings and shooting at your troops. Above average difficulty levels give extra resources to your foes, but the AI remains unchanged. It's essentially ~honest,~ or as honest as an AI which attempts to impersonate a clever, scheming human being can be.   What did you think of Rise of Nations?   TBS: On the AI, at least, we agree. I think the AI, plus the complexity of research options and the pause/command structure, clearly show that BHG has placed a considerable emphasis on Rise of Nations as a singleplayer game. It's refreshing to find that at a time when fat cat game company producers are telling developers that we, the players, only have interest in multiplayer titles, and couldn't care less about the savvy of a computer opponent; all sales evidence to the contrary.I suspect that now you can see my problem in some detail, and no, I wont take lithium for it. I place its origins squarely at BHGs doorstep for creating a game that borrows extensively but cautiously from the TBS genre, doing what it does extremely well but offering next to nothing which is new.Does that make it bad? Hardly, but it does indicate the kind of dichotomy of views among players that Rise of Nations will probably face. Despite the PR rhetoric, this isnt the RTS that brings in all the TBS diehards, looking for a depth of gameplay that goes beyond the standard feature set created in Dune 2, more than a dozen years ago. Gameplay will vary slightly if you play towards different winning conditions, but not as though a group of new features were being slotted into place. Rise of Nations diplomatic options are slim and its nations lack real personality, unlike such other RTS titles as Europa Universalis II and the Total War series. Similarly, there are RTS games out there made by Topware that will appeal more to the player who wants a genuine 3D use of terrain for strategic purposes.On the other hand, Rise of Nations is incredibly rich in optional gaming conditions. Multiplayer is fun, standalone is a challenge, the AI is among the best Ive seen in an RTS, and the learning curve is surprisingly slight. A part of me thinks BHG did an excellent job on this one, while another part believes a chance was missed to move more than cautiously beyond Age of Empires and design something strikingly fresh and imaginative.In the end, though, I cant fault BHG for delivering anything less than a professional product that will strongly please RTS players.", "date": "May 21, 2003"}