{"name": "Stake: Fortune Fighters", "name_review": "Stake Review", "ref": "https://www.ign.com/articles/2003/05/23/stake-review", "text": "Four-player fighting games in the same vane as Power Stone haven't fared all that well on Xbox.  Metro3D, makers of Armada for Dreamcast, hope to change that with Stake, a fighter that allows up to four players to duke it out on one screen for the ultimate championship title.  Sadly, Metro3D has put out a rather miserable game that isn't worth a rental, much less the $30 price tag.  Gameplay Stake puts you in the shoes of one of eight legendary fighters, combating across large arenas with up to three other AI or player-controlled characters.  The controls and design are made along the same lines as Kung Fu Chaos and Loons: The Fight for Fame.  It's a lot of one-two button-mashing, which can be quite fun and good if done right.  It's not done right here.  The fighting is often slow as you must navigate poorly designed levels to find the handful of characters who are also wandering around aimlessly searching for you.  Once in contact, it's just a matter of a couple of combos and some power moves, none of which look good, feel good, or work effectively.  Your standard power-ups are here and you can pick up and toss items, but none of that makes the experience any better.  Battles never seem to flow and tend to have an ~everybody mash buttons and pray~ feel.  There's no great sense of control over the characters, no precision in the attacks, and nothing inventive in the gameplay.  In essence: Stake is a slow, boring, predictable game that feels at least a year out from actual release, despite the fact it's on store shelves right now.  Hurting even more is the fact that the pointlessly large levels require multiplayer games to be split-screen (there is no System Link or Xbox Live support).  I say the level size is pointless, because the gameplay doesn't create any sort of ~hunter/hunted~ atmosphere and the only reason to travel outside the general area of a single screen is to get to where the combat is going on.  So why make some extravagant, long level if it serves no purpose?  The split-screen for a four-player fighter is distracting, especially when you consider that almost all of the fighting happens when the players are in the same vicinity as one another.  If the split-screen went away when players neared (a la ToeJam & Earl III), that would be fine, but the split-screen remains throughout.    Pointless four-player split-screen in effect.  Stake fails where others have succeeded.  It doesn't try anything new and doesn't succeed at anything already done within the genre.  That's not exactly the kind of thing you want to display proudly on a resume.  The gameplay -- from controls to the combat system to level design -- is bad.    Graphics Stake isn't pretty to look at either.  The ripped-from-Capcom character designs are of the ho-hum more-of-the-same variety and the effects are PlayStation One fantastic.  From the constant stutter to the bland textures to the terrible animations, Stake shows off what not to do on Xbox.  There's nothing to admire here, nothing that taps into the power of Xbox, and nothing that makes this a game that couldn't be done on an older system... actually, this has been done on an older system (Dreamcast) and done much, much better (Power Stone).  Sound Ugh.  Though the main soundtrack -- which features a small handful of cliche oriental fight tracks -- isn't all that bad, the rest of the sound palette is virtually empty.  You have to listen very, very closely to hear any of the sound effects.  The small, repetitive squeal of an opponent, the rumble from the controller that serves as sound for an explosion, the yawn someone fails to stifle while playing the game -- they're all there.  You just have to listen.  But hey, Stake gets ups for including a custom soundtrack option, for what it's worth. Thank Jebus for the inclusion of a custom soundtrack option.  This way I can rip my favorite John Tesh album to my hard drive and have Teshie's smooth elevator sounds playing in perfect harmony with Stake.  Yeah, it's bad. Yup, it's boring.  And you got it -- It's not worth a purchase or a rental.  Stake, strangely, costs less than a pair of Converse these days and, I suppose, if you were to figure out how to craft the game into a decent pair of shoes, it might serve you to pick up a copy.  Otherwise, stay away.  Stay far, far away.", "date": "May 23, 2003"}