{"name": "SEGA Arcade Gallery", "name_review": "Sega Arcade Gallery", "ref": "https://www.ign.com/articles/2003/05/23/sega-arcade-gallery", "text": "Classic arcade games will always have a welcome home on the portables. These games are great to whip out and play for quick shots since many of them were designed for quick shots in the arcade. The GBA has a good amount of classic arcade game compilations from Namco, Konami, and Midway, and THQ has released the first Sega arcade compilation, a collection of mid-80s games ~creatively~ titled Sega Arcade Gallery. The pack features decent representations of four games from Sega's arcade past, but that's all it is. And yes, these games are still fun to play even today, but one or two of them don't retain their classic charm as well as some other classics have. But it's great to see the old designs live on in the current videogame generation...and if you were loving these games when they hit the scene more than a decade ago, you'll have a grand time with the portable renditions.  Features: Four conversions of classic arcade games Only for Game Boy Advance  Before there was Virtua Fighter 4, Shen Mue, and Daytona USA, a game designer at Sega, Yu Suzuki, worked on many arcade games that are considered ~classics~ today. THQ commissioned Bits Studios, the development team responsible for the Game Boy Color Warlocked game to recreate four of Yu Suzuki's games on the Game Boy Advance hardware. Since the GBA's hardware isn't quite up to the task of emulating the hardware Sega used for these arcade games, Bits had to build these titles from scratch for the handheld. Only real fans of the original will see the differences between arcade and home versions, because the team has done a commendable job bringing the games from the arcade hardware to the Nintendo portable.   Each Sega fan will certainly have his or her own favorite, but the game that means the most to me is Outrun, a simple but energetic racing game across the country in a Ferrari with its top down. The GBA rendition is pretty spot-on with the arcade version, though there are slight differences here and there: slightly fewer trackside sprites and a lower resolution for the actual road. This game has the most variety out of the four in the pack, since players can take different branches and see different parts of Outrun's world. The gameplay is missing the analog control from the arcade version's steering wheel (and I do miss the ~shimmy~ from the wheel when the car flies off the track), but it still controls pretty well in its digital conversion on the GBA. And it's great to hear ~Magical Sound Shower~ coming out of the GBA's speakers.  Number two on the list is Space Harrier, one of the first 3D shooters ever conceived. In the game, players move their on-screen character up, down, left, and right, shooting at oncoming enemies and avoiding their incoming fire...as well as other obstacles floating around the area. I was never that good at the arcade version, but on the GBA port it's not terribly difficult to reach level ten. But it's a blast to get that far, and the developers recreate all the gameplay, graphics and music very well on the GBA hardware. Again, there's no analog on the GBA system, so the developers map a ~quick move~ function to one of the shoulder buttons for better control over the character; but honestly, the character moves fast enough as is. Super Hang On is another decent Sega racer that's put together pretty well on the GBA system. Instead of porting over the original, which is essentially just Pole Position on a motorcycle, Bits gives us the next generation...which is Pole Position on steroids. There's no gearing this time...players can opt to turbo-boost their bike after the bike hits its maximum speed. This is necessary to complete the different tracks and pass the opposition, since the clock's ticking away surprisingly fast. The GBA handles the pace of the game extremely well, even when the screen gets cluttered with half a dozen opposing cyclists.  It seems like every great GBA arcade compilation has its black sheep, and in the case of Sega Arcade Gallery, After Burner earns that title. As awesome and energetic as the game was in the arcades, on the Game Boy Advance version the game feels much slower, and has less technique in its design. In the arcade, players had control over their aircraft with an analog flight yoke, but on the GBA the controls are much more limiting. Players will die without really seeing why they got hit, since it's hard to see incoming missiles. The intensity just isn't here, whether it's due to controls or just not enough attention paid in the  port from arcade to the GBA system. There are other compromises in the design as well: players never land their craft like they do in the arcade...these sequences in the arcade are replaced by the in-air refuel sequence from the first level.  Like all the rest of the classic arcade compilations on the GBA, Sega Arcade Gallery doesn't feature any sort of save RAM in the cartridge, which means the thought of recording high scores is thrown out the window...power down the system and all of your rankings are lost. It's a minor complaint, but in a design where high scores are the real driving factor in playing, it's a drag that it doesn't record these scores. And while Bits Studios did a fine job with the conversion of these four games, they didn't go the extra mile for the GBA compilation. No history, no background details on each of the games, and no hidden extras after reaching specific parts of the games. So, don't expect anything more than a straightforward presentation. Even though the three games in THQ's Sega Smash Pack were deeper in gameplay, Bits Studios did a far better job converting the four arcade games in Sega Arcade Gallery. They're not perfect, but they're damn close to the originals...except for Afterburner which obviously received the most ~editing~ to get the game to run on the GBA system. Afterburner just isn't very fun to play on the GBA, but the rest of the grouping still holds up in quick gaming shots. A few extras, hidden or otherwise, would have been nice in this compilation, but at the $20 pricepoint the game's being released at, it's hard to refuse this deal.", "date": "May 23, 2003"}