{"name": "Hulk", "name_review": "Hulking Hulk Review", "ref": "https://www.ign.com/articles/2003/05/24/hulking-hulk-review", "text": "With videogames based on summer blockbusters selling like hotcakes (X2: Wolverine's Revenge and Enter the Matrix have both done extremely well despite a flush of mediocre reviews), it's really no surprise to see that Vivendi Universal has dipped its own foot into the pool with the digital reenactment of its parent company's impending hit, The Hulk. Developed by Radical Entertainment (best known for the snowboarding adventure Dark Summit) and powered by the full cooperation of Marvel Comics and Universal Pictures, Hulk could potentially be just as big as its movie to game predecessors -- and even bigger if the movie draws the type of numbers its supporters are expecting.  From the personal standpoint of the videogame world's biggest Incredible Hulk fanatic, (sure it's self-professed, but go ahead and try me -- I've got the chops) I can undoubtedly say that the gaming community has been waiting for a title like this for quite some time. Permanently inundated with shoddy interpretations of the green goliath on other platforms for years prior to this one, it was only natural to go into the new adventure with a skeptical eye and an expectation of defeat. With the opportunity of mixing two of my favorite pastimes in the history of the world, however, (The Hulk and videogames) I realized that I'd be crazy to pass up the chance to give Hulk an official IGN spin. And to my pleasured surprise, I'm glad that I did. It seems that someone has finally understood what it takes to make the perfect Incredible Hulk videogame -- or should I say, almost.  One of the best aspects of playing Hulk is that it's not an actual adaptation of the movie but rather a sequel to the film. Instead of carbon copying the events of a picture that's not due in theaters for another couple of weeks, Hulk tells a new tale altogether. Drawing on his comic book roots, the Hulk's enemies this time around consist of the dastardly genius known as The Leader and several more contemporary foes (Madman, Flux, Ravage, and Half-Life to be specific). Just like Activision's X2, this approach helps keep the mystery of the film while still allowing us to feel like we're a part of it. It's an idea more movie adaptations and comic book translations should keep in mind when moving to the videogame world.  Broken into two different types of play styles, Hulk allows you to play as both Bruce Banner and his emerald alter ego across 30-plus stages. Instead of having some sort of transformation element that pits you as both characters in every level, however, the game has divided the adventure into specific Banner and Hulk missions. For every couple of Hulk spots, you'll get a single banner objective, and then the process repeats itself and so on and so forth. It would appear that the developers attempted this division to break up the monotony of smashing through everything that gets in your way, but that's where the problem lies: smashing your way through everything in front of you is what's fun.  At their best, the Banner missions are pretty excruciating. Made up primarily of stealth-like crawling and hiding, the whole objective as Bruce is to infiltrate some kind of facility so that he can learn more about his story and find a way to get himself out of the mess he's caught up in. Unfortunately these stealthy objectives are drawn out for far too long and can get pretty frustrating in the latter stages. Though the number-puzzles and lever/switch-goals aren't that bad on their own merits, it's arriving at them without being spotted and manipulating the objects around you that turn out to be the real pain in the neck. In the second Banner stage, for instance, there are several areas where the player has to pull and push boxes next to taller structures in order to climb over them. While it's a good idea on its own, the sloppy Banner control scheme makes it difficult to climb the things you want to climb or grab the things you want to grab. Adding even more frustration to these levels is the fact that the camera isn't as dynamic as it is in the Hulk stages and can't be controlled. This results in preset camera angles that can make it difficult to see what you're doing and even harder to locate off-screen guards. While it's certainly commendable that the designers tried something different, the Banner mode just doesn't work as well as it should, which leads one to wonder... Since they're so aggravating, shouldn't Banner be erupting into the Hulk when he has to play through them?  Once players get past the Banner sections and can actually play as the Hulk, though, the game becomes incredibly entertaining. The Hulk is overflowing with an abundance of cool moves and abilities and will fight, react, and move just the way his fans would expect. From his classic thunderclap to his popular ground smash, all of his favorite combat techniques remain intact and can cause some serious destruction. Pulling them off is pretty simple too, as the punch button acts as the primary means of attack with a punch modifier thrown in to mix up the combos. There's a throw option too, and based on which enemy you grab a hold of, there are three distinct types of grapple attacks you can perform. Simple as it may sound, the system is very intuitive and can end up being pretty varied -- the included targeting system is a nice bonus too, but you really won't be using it too much; that's one thing Hulk really has going for him, he seems to understand exactly where you want to aim something.      Another positive aspect of Hulk is that practically anything and everything in each stage can be destroyed or manipulated. Though it's not on the same level as say, War of the Monsters, structures can still be completely obliterated. Whether its pillars holding up a building, parked cars, electric generators, or even grounded helicopters, there's an abundance of object fodder for smashing, lifting, and throwing. Another top bonus is the fact that you can use any of these objects as a blunt weapon in addition to a projectile, and just as the grapple system we mentioned earlier works, each object will react in a different way depending on what it is. Hulk does a great job of convincing you that you're in a living, breathing, world.  The only drawback to the Hulk missions is that the game is a little on the short side. When combined with Banner's quests, there's only 30 or so missions to travel through and the Hulk's sections go by pretty quickly. To help combat this, Radical has added three difficulty settings and tons of unlockable bonuses (from trailers and teasers pertaining to the movie to behind the scenes featurettes about the videogame). Other modes in addition to the story feature have been included as well, including what could be the coolest aspect of Hulk: a super secret bonus mode that adds a third type of gameplay apart from The Hulk and Banner that we wouldn't want to spoil for you just yet. In true cross-platform promotional form, the only way to access it is by watching the Hulk film when it comes out in June and putting together clues that create a code for the videogame. It's with that code that the special third mode can be unlocked.  Radical has made an interesting stylistic choice regarding the game's visuals during the cutscenes. Resembling a 1970s watercolor paint by numbers, the fascinating use of strong overlapping colors is an approach we can't recall ever seeing in a game like this before. Interestingly enough, the technique works pretty well and once you get used to this approach it blends in perfectly. The gameplay visuals are a little more traditional, but retain the bold lines and other aspects of the cinema scenes rather well. What we really appreciate, though, is the solid performance, which, even on midrange systems, never seems to dip below 60fps at any time.  Also cool are the damage textures that Hulk leaves behind when fighting his enemies. Smashing the ground, hitting walls, or creating explosions all leave some kind of footprint on the world around our hero and it looks really good. Nearly every structure in every environment can be destroyed or altered in some way, and by the time our Jade Giant is done, players will have no doubt that the Hulk just had is way.  Unfortunately the ~smart camera~ that follows both Banner and the Hulk cannot be adjusted as we mentioned earlier. In all honesty, it's a shame because there are instances where the camera isn't too smart at all (particularly when taking Banner on one of his stealth missions). All too often we found ourselves exploring one of the large levels at a disadvantage -- there were things shooting at us that we couldn't see. Though they were right behind our character, swinging around to meet them was no different than ignoring them, as we still couldn't see our foes because of the camera limitations.  Vivendi Universal has been pushing the limits of high production values lately, and Hulk only illustrates that further. It's clear that the developers wanted to make the game as much of a cinematic experience as possible. Supporting that theory, the game also boasts the vocal talents of the movie's very own Bruce Banner, Eric Bana, in addition to new and original music based on the motion picture.  The sound effects aren't quite as impressive, but at least they're varied. Roaring Hulk sounds, explosions, crashing automobiles, and shattering glass are just a few of several convincing audio tricks and when used in conjunction with a high-end card, do a great job of convincing the player that they're somewhere within the Hulk's little universe. Despite the fact that Hulk is easily Radical Entertainment's best videogame project ever, and the number-one version of the Jade Giant to ever come to consoles and PC, I can't help but feel as though it was still held back a bit from what it can truly be. Hurt by the tedious and boring Banner missions and smacked around by a troubled and immovable camera, Hulk suffers in areas that should have been tightened before release.Those problems aside, Hulk is still an incredible source of enjoyment. Using the proper ~destroy everything~ approach that a game of this nature needs in conjunction with an easy to learn combo system, Hulk doesn't steer action fans wrong too often. The real treat, however, is sitting back and waiting for a rumored and possible sequel -- a game that will more than likely fix the nitpicks of this version. All they have to do is drop the Banner segments, tack on 20 more levels, throw in a few new moves, and put us face-to-face with Abomination and we could easily find ourselves in beat 'em up heaven. In the meantime, this first rendition of the Hulk is pretty darned satisfying. Definitely worth a try.", "date": "May 24, 2003"}