{"name": "Off-Road Challenge", "name_review": "Off-Road Challenge", "ref": "https://www.ign.com/articles/1998/07/03/off-road-challenge", "text": "It's called Off-Road Challenge and it's the latest game from Midway Home Entertainment. You probably didn't know it was out as Midway failed to mention this fact to just about everybody, but it is. Should you buy it? Is it really worth it? Good questions. Simple answer: no.   Off-Road Challenge, like many Midway games, began its unhealthy life as a stale arcade game running on a carbon-copy of the Cruis'n USA engine. After mediocre success in the arcades, Midway handed the title over to Avalanche Software for the home conversion to Nintendo 64, where a bad game was made worse.   What is it? Imagine Cruis'n USA with monster trucks and you've nailed this game down perfectly. Players race through a handful of tracks, roughly six, ranging from the Mojave Desert and El Paso to Baja and Las Vegas. Of course, to avoid being a technically unimpressive version of Cruis'n USA, Midway has dished up a selection of new vehicles to race with, about eight -- all of which are monster trucks and buggies. Unfortunately, most tracks, despite their various locations, ultimately amount to racing fast on a dirt road with terrible framerates and loads of pop-up. Worse, the trucks don't feel as if they are actually on the track and regardless of attributes don't drive any differently.  If that floats your boat then we highly recommend this title.   Oddly enough, a game called ~Off-Road~ Challenge never lets players really go off-roading. There are invisible borders engulfing all the roads in the game. Attempting to stray from the road is useless because it acts like a ramp, simply pushing the truck back to the main road. Like Cruis'n USA, there are a number of unique objects to crash/race through, from falling boulders to other trucks, trains, tires, carcasses, bumps, fences and what have you, but the novelty of it all wears off quickly.   On the bright side, this game does come packaged with a two-player mode. Unfortunately, the mode sucks. Two player races enjoy a superbly executed framerate drop and work best one-on-one, as no computer-controlled players race. If they did, we fear the game may blow up.  Graphics In terms of visuals, this game has it all: pop-up, dithering, blurry sprites, blurry polygons, ugly colors, limited textures and a super-smooth sense of speed complimented with more than 20 frames of animation per second. Midway and Avalanche have eliminated the use of fog with an excellent draw-in procedure that does little to deter hitching framerates.   Sound The mono sound effects and music are a joy to take in. Generic music never sounded quite so good. All of the trucks are equipped with racing sounds, crash sounds and breaking-through-something sounds. For added pleasure, winners are treated to a screeching car sound. We feel that Midway has done an overwhelming job by implementing sound to this cartridge. We hope to hear more from Midway games in the future, just so long as they aren't in stereo and aren't using any quality compression techniques. This game, like Mike Piazza Baseball before it, has graphics and sounds, control and comes in a shiny box. Unfortunately, Mike Piazza's box is better, framerate higher, sense-of-speed more exciting and offers more diversity. Of course, since we gave Piazza the high rating of three stars, well, I suppose this sucker doesn't even deserve that. If you have way too much money on your hands and have never burned a Nintendo 64 cartridge before, we highly recommend this title.", "date": "Jul 3, 1998"}