{"name": "Incredible Hulk GBA", "name_review": "The Incredible Hulk", "ref": "https://www.ign.com/articles/2003/05/29/the-incredible-hulk", "text": "is about ready to rampage across movie screens this summer, and Vivendi Univeral pounces on the  opportunity to produce videogames based upon the license. The GBA game, which isn't actually based upon the flick, just doesn't have a whole lot of depth because the designers focused almost exclusively in making The Incredible Hulk a beat-em-up action game like Double Dragon or Final Fight...but in a more 3D, go anywhere fashion. But despite its shallow design, it's fun in quick shots, though, just enough to get aggressions out of your system. Features 33 levels Cartridge save (three slots) Link cable support for four players (multiple cartridge) Only for Game Boy Advance  To be fair, how else would you design a game based upon a giant, green Adonis that's living a perpetual temper tantrum? Hulk Fishing? Hulk Kart Racing? Hell no...you let him loose to trash everything in sight. And that's exactly what GBA developer Pocket Studios set out to do in The Incredible Hulk. The team's game design is actually more based upon the comic book series than the flick, so there aren't any references to the Ang Lee movie...apart from maybe the rendered 3D Hulk character players control on the GBA system.  There isn't a whole lot to the game design, not surprisingly. The Hulk doesn't have a whole lot of brains under that brawn, so the game's entire basis is to get from Point A to Point B, beating up an endless army of bad guys out to down the green beast. The focus is, of course, a whole lot of punching, with the occasional use of Hulk's jumping ability to leap over hazards like electrified floors or minefields. Players stay alive by constantly punching enemies and objects...as well as picking up the occasional food item that will replenish The Hulk's energy. In the heat of the battle, players can earn the ability to pull off more powerful, screen-clearing moves. Even with all of this in place, if you're looking for a lot of variety in your Hulk gaming, sorry, it's not going to happen in The Incredible Hulk.  What's cool about The Incredible Hulk is the developers' graphics engine that allows for several on-screen enemies, as well as walls and objects that can be crushed or destroyed. And The Hulk can even pick up a lot of large items, anywhere from a wooden crate to a massive helicopter, and toss them at the enemies for an extremely gratifying KO. The artwork is also well done, with good attention to character animation as well as some of the still screens ripped right out of the comic book world. However, the somewhat wonky collision detection could have used a bit more work, since The Hulk could be swinging at an enemy or object right in front of him without contact. And many times items that can be picked up have to be picked up at a specific angle...something that definitely kills the flow of the action.  The constant punch-punch-punch action isn't so bad in short bursts, especially when you simply want to whip out your Game Boy Advance system to appease your aggressive side. Unfortunately, while the game has a cartridge save, it only keeps track of players' progress after they finish each of the game's missions. And in this case, missions can expand for several minutes before players find the exit...and by the time they reach it, the whole punch-punch-punch thing has already worn itself out. And because the game's levels can expand a good distance, an overworld map would have helped a great deal, if only to show how much of the map the player needs to cover to complete the challenge; Pocket Studios worked on a few Army Men games with this feature, so it seems pretty doable to me. A little more gameplay beyond mindless punching could have benefited The Incredible Hulk's game design, but as-is this game isn't too bad. The lack of a ~save anywhere~ feature (or checkpoints within the huge levels), and a slightly loose collision detection don't work in the title's favor. But in all if you're looking for a mindless action game with a whole lot to crush, maim, and destroy, The Incredible Hulk could scratch your violence itch.", "date": "May 29, 2003"}