{"name": "Wakeboarding Unleashed Featuring Shaun Murray", "name_review": "Wakeboarding Unleashed Featuring Shaun Murray Review", "ref": "https://www.ign.com/articles/2003/06/04/wakeboarding-unleashed-featuring-shaun-murray-review", "text": "It seems the extreme sports extravaganza never ends.  As if skateboarding, BMX, surfing, snowboarding, and Razor scootering weren't enough, Activision just dropped Wakeboarding Unleashed Featuring Shaun Murray onto store shelves.  I can already feel your eyes rolling towards the back of your head.  Before you take a peak at your brain, stop for a moment and consider something seemingly impossible: What if Wakeboarding Unleashed offered enough of a gameplay twist to add something new to the genre?  If the answer is yes, then your eyes need roll no more.  If it's no, then by the end of this review, your peepers will be catching a good glimpse of what lies inside your skull.  Which will it be?  Read on.  Features Game features Shaun Murray of Wakeboarding Unleashed fame!! Seven boarders Twelve tracks to trick Scores of challenges and gaps to conquer Co-op and head-to-head multiplayer modes Inspired soundtrack including one of the very best songs by the Pixies  Gameplay  Tony Who? It's impossible to review an extreme sports game -- especially one from Activision -- without comparing it to Tony Hawk's Pro Skater.  So let's get this out of the way first and fast -- Wakeboarding Unleashed shares a lot of similarities to Tony Hawk, but a few gameplay tweaks make for a very different experience.    You are a wakeboarder.  If you don't know what that is, well, you're probably not alone.  Think of it as the snowboarding version of water skiing.  Unleashedis the extreme version of the already extreme sport, meaning that you can bust some crazy tricks not possible in real life.  As a wakeboarder, you are limited by where your boat goes.  After all, if the boat goes left and your speed, momentum, and ability to stay afloat are all tied to hanging on to the rope attached to said boat, then you need to play follow-the-leader.  However, in Wakeboarding Unleashed, you can release the rope and go handless for short periods of time.  It's the very nature of wakeboarding -- and the ability to let go of the rope -- that keeps Unleashed from becoming another T Hawk clone.  Wakeboarding Unleashed FAQ Tired of eating wake??  Get help for free with Myke's in-depth walkthrough for the greatest game to ever feature Shaun Murray! We promise not to tell anyone we lent you a helping hand.  Get The FAQ | Get Codes Yes, you are hampered by the boat's course, but part of the game is figuring out where to let go of the rope, as you can achieve massive launches off the boat's wake and jet to seemingly unreachable locations.  It's more than merely launching yourself up to grab a grind off a high ledge, you can guide the boat down different paths by releasing the rope at proper moments.  For example, by releasing the rope, grinding the rim of a boat, and calling for the rope on the other side of the boat, you might end up taking the path to the left over the normal pathway to the right.  It's the need to manage the boat, your speed, and your path while still attending to the normal ~extreme~ challenges of grinding, tricking, and busting gaps, that sets Unleashed apart from the majority of its genre.    To put it simply: It feels like Tony Hawk, but it ain't.  Riding the Waves Controls are virtually identical to Hawk and even include the ability to manual so tricks can be strung together.  The only major difference is the use of the trigger to release and call for the rope.  Speed is greatly determined by how you manage yourself behind your boat.  It's amazing how well the water and rope physics are balanced in Unleashed, because there's never a moment where the speed in relation to your position behind the boat doesn't make sense.  Learning to manage that speed is one key to victory over the many challenges in the game, but it's not something you'll know instantly.  This game takes a bit of time to master.  There are a lot of gameplay subtleties brimming underneath the surface that might not be instantly recognizable the first time you pick up the controller.  Don't be intimidated by this idea, though.  Wakeboarding Unleashed is, at its core, another fun extreme sports game.  You still must pull off a variety of grinds and fantastic aerial tricks to earn the hefty scores.  Your main source of air, or at least your most consistent, is the wake left by the boat pulling you.  By dashing to one side (double-tapping a direction) you can create instant tension in the rope.  Then just swing back the way you came and the moment you hit the tip of the wake, jump to earn some gorgeous air.    After mastering the controls, it was amazing the air I grabbed.  More impressive were the stunning number of cool, long lines I found simply by being creative.   Manuals are easy to maintain and after just a couple hours with Unleashed I was launching off my wake, releasing the rope, grinding the main gun of a battleship, pulling two massive air tricks, snagging the rope back mid-air, manualling once I hit the water, and launching off my wake once again.  Combos in the millions are not impossible and when I pulled off the bigger combos, I found more satisfaction than I'd had from any extreme sports game in a while.  The subtle and creative control scheme can't be complimented enough. Wakeboarding Unleashed is flat out fun and offers a nice wrinkle to the typical extreme sports formula.  That's not to say the gameplay won't feel familiar, but as the game progresses, the unique aspects of Unleashed become more evident -- and crucial to use!  A Career on the Water Wakeboarding Unleashed's career mode is similar to other extreme sports games.  You have runs, which last as long as you can keep your groove meter filled.  This meter lowers when you bail or fail to pull off combos and fills as you spank air and score the massive tricks.  During each run, you have a variety of objectives to complete and a slew of gaps to find.  The objectives are anything from earning a high score to frightening five lumberjacks.    Every gap in the game (there are several hundred) has a video clue.  These clues are unlocked with gap keys earned by completing other gaps during a run.  There's nothing nicer than having the ability to see where that one last gap is.  Now pulling off the trick to hop that gap is an entirely different matter.  A good third of the gaps in the game are tough, so gap-fiends should love Unleashed.  Along with the standard objectives and gaps to contend with, each level also has a challenge mode.  These challenges are separate from your standard run and can be quite tough to handle.  There are cool challenges, like the Count to 10 challenge, which forces you to maintain a combo while collecting numbers 1 through 10.  Then there are challenges that are frustrating and, frankly, annoying, like Video Shoot, which forces you to control your boarder from some terrible and awkward TV camera angles.  It changes the rules of the game and just isn't any fun at all.  I like the career set-up for Wakeboarding Unleashed.  It's very similar to what's been done before, but the objectives and gaps flow together nicely when pulling off a run.  Rarely did I find myself going, ~Okay, this run I'll try for this objective, next run I'll go for this.~  Instead, I just went with the flow every time and would nail two or three objectives and a few gaps just by playing with some skill.    You Don't Have to be Alone Anymore Wakeboarding Unleashed has only a few multiplayer modes, including Tony Hawk standards Trick Attack and Horse.  That's nothing new.  What is great is that you can play co-operatively with a buddy.  One person drives the boat, the other gets to board.  That's right, you've got full control of the game at this point.  Developer Shaba could have said ~A'ight, we done,~ but instead took things a step further.  The two-player co-op mode features new objectives and challenges for every level in the game.  The geography of the levels stay the same, but the grinds and ramps have almost all been altered.  Not only do you have challenges for your boarder, there are challenges for the boat driver as well.  This adds about another 20% of game time to an already large game and forces you to have a buddy over if you intend to truly 100% the game.  Oh, and it's pretty damn fun to boot.  But Where to Board? There are a dozen levels in Wakeboarding Unleashed, though one is a small training area and a couple serve as limited competition parks.  The main levels are large and well designed as far as offering a huge number of lines and places to go once the rope is away from your hands.  There's the Bayou complete with alligators, Venice and it's grind-worthy gondolas, and the lumberjack-infested Timber Lake.  A good variety of locales, but thanks to the same drab color palette, many of the levels feel like the same thing with a different coat of paint.    My favorite level, the Boneyard, puts your boarder in the midst of the Retirement Castle for naval ships.  Grind on the bow of a battleship or cruise the insides of an aircraft carrier.  All in a days work.  It's levels like this that make some of the slightly less exciting areas bearable.  Missing Pieces I really enjoyed Wakeboarding Unleashed, which makes some of the missing pieces all the more disappointing.  Unleashed features no create-a-boarder or create-a-park options.  There's no customization features either.  You can't trick out your board with the design you want (though each wakeboarder has four different board designs to choose from) and more importantly, you can't turn your boat into pimp central.  These are things that Activision extreme sports games have had for four years now.    You just cannot bypass standards like that unless they're replaced by something comparable.  Here though, there's nothing at all to fill its place.  There are only seven wakeboarders to choose from (a lower amount than I'd like) and just a handful of boats.  Why not offer boat upgrades as well as board upgrades?  Heck, why not let me make my own boarder as well?  There's a high standard Activision set with the Tony Hawk series and Wakeboarding Unleashed fails to meet some of the minimum requirements.  It's the games only true failing, but considering these missing ingredients are some of the things that should be part of the foundation when building an Activision extreme sports game, it's a serious knock against the title.  Graphics On the visual side of things, Wakeboarding conquers its most obvious target -- water.  The water doesn't just look fantastic on the surface, but it's probably the most accurate to date in terms of real-life physics.  The wake and its splashes are an important part of gameplay and Shaba got them right.  Rather than merely offering a shiny cellophane surface, these kids keep the ocean in motion, with subtle ripples on the surface that make the deep blue look about as real a it gets.  The water is reflective of the environment, but unfortunately does not reflect your wakeboarder as he does his business.    On the short end of the stick, the textures aren't always as rich as they could be and the color palette is too limited.  Many levels seem drab and dark.  Sure, there's the bright and interesting Hong Kong, but the majority of levels look too similar in color.  Granted, no one should have a neon pink swamp, but someone early on had to decide to include these specific twelve locations.  A bit more variety and visual oomf in the environments would have gone a long way.  Sound While Shaba may now be under the Activision umbrella and Wakeboarding Unleashed may feature many Hawk-ish elements, the soundtrack is a refreshing change from the norm.  That's not to say it isn't filled with some great alternative rock tunes (in my day it was called Post-Modern Rock... oh, how the times have changed!), but the sound isn't nearly as, well, generic as some other extreme sports titles.  There are modern bands (Pavement among others), but also many classic groovers including the Pixies (Wave of Mutilation... brilliant choice), Love and Rockets, and Van Halen.  If you don't love this soundtrack well, tough.  I do.  It's a good thing that the music is kicking so good, because the sound effects are, well, minimal and unexciting.  Yeah, you get the boat motor and the wave splashes and the lovely thunk of your head hitting a log, but there's little in the way of peripheral sounds.  It would have been nice to board past people on a boat and hear them make comments about you, for example.  The sound effects, however, are drowned out by the music so it's a moot point as long as you enjoy The Flaming Lips and The Stooges.   Wakeboarding Unleashed isn't as good as Aggressive Inline or the Tony Hawk series, but it is a great deal of fun.  In fact, this is one of my favorite extreme sports games, despite some of the standard features missing from the game.  It's challenging, it's incredibly long, and the gameplay is distinctly wakeboarding.  Heck, before Unleashed came along, I didn't even know what kind of gameplay could define wakeboarding.  This is it.  You don't have to dig wakeboarding or even know who Shaun Murray is to enjoy the game. Wakeboarding Unleashed is a refreshing change from the latest batch of extreme sports games, but probably isn't going to make you change your religion or enlighten your video game life.  The multiplayer is deserving of the high praise and the single-player career mode is solid.  If you've been waiting for a new extreme sports game to chomp into, give Unleashed a try.  If you don't like it, you can always roll your eyes and curse that damned IGN editor who steered you wrong.  That's what I always do.", "date": "Jun 4, 2003"}