{"name": "Pirates of the Caribbean: The Curse of the Black Pearl", "name_review": "Pirates of the Caribbean: The Curse of the Black Pearl", "ref": "https://www.ign.com/articles/2003/06/18/pirates-of-the-caribbean-the-curse-of-the-black-pearl-2", "text": "Another summer flick becomes a Game Boy Advance title as TDK, Pocket Studios, and Disney Interactive work together to bring the live-action film to the little LCD screen. Pirates of the Caribbean: The Curse of the Black Pearl definitely has good production values in its graphic and sound presentation, but it's the gameplay where the design falls apart...it's just not entirely fun being a pirate in this game.  More than 20 levels Land and sea missions Password save Only for Game Boy Advance Pirates of the Caribbean for the Game Boy Advance probably has about as much to do with the Summer 2003 movie as the movie does with the Disney Magic Kingdom ride of the same name. The game design puts players in the role of pirate Jack, set out to accomplish tasks and collect treasures which will eventually lead to the unveiling of the mystery that surrounds the arrival of the ghost pirates in the Caribbean. Or something. You'll just have to tough it out through the extensive and somewhat unrewarding quest to uncover all the plot. The game looks to put Pocket Studios' The Incredible Hulk isometric engine to work for this design, but where The Incredible Hulk emphasized pure action, Pirates of the Caribbean is more focused on exploration.   The game's actually split into two game designs: land and sea. On land, players run around collecting lost treasure while completing the task set at the beginning of the level, most of which ends up getting from Point A to Point B on the map. On the way, players have to swashbuckle against English soldiers and pirates, and it's here that the game misses huge gameplay opportunities. There's really no technique involved in this combat; players can simply slash fast and weak with the A button, or slow and powerful with the B button. The collision detection is incredibly wonky in this swordplay, since it's never made clear if a missed strike is due to sprite position or because the enemy blocked the attack. The collision is worse when trying to wipe out snakes in the sand, since these guys only seem to die at random slashes.   The exploration element isn't much better, since the level designs aren't very elaborate. Though the player has the ability to jump, climb ledges and shove blocks a la Tomb Raider, these elements aren't used nearly enough in the 20-plus levels in the game. And as large as these levels are, they just aren't a whole lot of fun to play. The game gets slightly better when earning a musket as a supplement weapon to the sword, but using it is a little awkward since it can only be whipped out at a distance from enemies, and players can only fire it standing still.   The sea portions feel more like a secondary mini-game, but they're certainly a nice change from the land-based levels. In these challenges, players hit the open waters and either make their way to the next part of the map, or simply dominate the waves by eliminating other ships in the harbor by firing cannonballs at them. The port and starboard cannons can be fired independently with the L and R triggers, increasing the distance of fire by holding down the buttons for a short time. As fun as these mini-missions are, it's unfortunate that the sea-based portions don't go beyond that; this engine could have made for a good race between pirate ships for a little more variety.  We can't fault the developer for an extensive password system to save the game in progress, as that was most likely TDK's decision to axe the extra cost of the EEPROM. But it's another one of those games that fails to record the string of text so players can pull it up outside of the game. If players elect to quit the game without powering down the unit, they better hope they've jotted down the text because the Continue Game screen annoyingly doesn't pull up the last password earned. If passwords must be used in a GBA game, it's best to make it as friendly a system as possible. Though the game looks and sounds like a quality game design, the focus on graphics and sound just can't help along the fact that Pirates of the Caribbean on the Game Boy Advance just isn't that much fun to play. The sea levels, obviously meant to underplay the exploration game design, are actually more enjoyable than the more numerous explore-and-swashbuckle levels. Had the game put a little more attention on the weapon combat it would have been a lot more fun, but as it is the battle between pirate vs. pirate in Pirates of the Caribbean is a basic and tedious button-masher.", "date": "Jun 18, 2003"}