{"name": "NFL Xtreme", "name_review": "NFL Xtreme", "ref": "https://www.ign.com/articles/1998/07/16/nfl-xtreme", "text": "Think back to when you didn't have a PlayStation, and you had to play football outside... can you remember that far back? Anyway, the thing I have always loved about backyard football, when compared to the NFL, is that there were no time-outs, no yellow flags, no nothing, it was just non-stop scoring -- it was football, minus all the crap. Now, Sony attempts to recapture that old backyard-ball feeling with its newest football game, NFL Xtreme.  With all these features to choose from, you'd think that this game was a football sim. Seriously, gamers can trade players, sign free agents, build an all-star team, you can even create your own player. The game also has three difficulty modes, a player and game speed adjustment, and yes, it's Dual Shock compatible. NFL Xtreme is packed with all kinds of cool features and options, however, if you're an arcade-feel fanatic, all these options may be useless. In fact, I have yet to 'build' a team.  The sad part is, playing NFL Xtreme is like playing a rated PG version of Midway's NFL Blitz. Let me explain. If you look at NFL Blitz, there aren't as many features and the main focus is to mutilate your opponent, it's an arcade game, not a simulation. Swinging a player around by his arm, doing a leg drop on his back, the referee is on vacation, it's time to kill! NFL Xtreme, on the other hand, lacks that violent personality, it's watered down. Like when you tackle a guy, you just bring your opponent down to the ground. With the exception of an occasional clothesline, it's a mere tackle. We want more carnage!  One thing that NFL Xtreme has is graphics and sound. The game looks amazing, and the sound, it's top notch. On field players move exceptionally well and the crack of the pads between players does make you flinch and bite your teeth. However, the turbo feature in this game needed some touch up. Sure, your guy runs faster and all, but what is suppose to be fire emitting from your player's shoes looks like diarrhea. Hmm, I wonder if there's any connection?  The problem with NFL Xtreme is that this game is supposed to be an arcade game, yet it still plays and feels like a sim. If you added six players to each team you'd literally have GameDay '99. Bottom line, if you want a football game with arcade style play, I suggest you wait for NFL Blitz.   Jay Boor", "date": "Jul 16, 1998"}