{"name": "Sonic Adventure", "name_review": "Sonic Adventure DX Director's Cut", "ref": "https://www.ign.com/articles/2003/06/21/sonic-adventure-dx-directors-cut", "text": "It was four years ago that Sega and Sonic Team released Sonic Adventure, a flagship 3D platformer, for the ill-fated Dreamcast console. The title, just as Super Mario 64 did for Nintendo's Mario franchise, brought the hedgehog kicking and screaming into full 3D and forever altered the gameplay dynamic of the series. For its time, Sonic Adventure represented an intriguing blend of 3D technology and pure speed, and for that reason the title dazzled early adopters.   Fast forward to the present. A port of the game -- largely unchanged -- has arrived for Nintendo's GameCube console. Sonic Adventure DX Director's Cut, features some minor visual enhancements, new mission challenges, and GBA-link functionality to boot, and the single-player adventure itself remains an entertaining romp through the hedgehog's universe. But gamers are accustomed to 3D games now and by today's standards, Sonic Adventure is dated. Further, no longer dazzled by the title's once-impressive technology, it's depressingly too easy now to spot its many game design and technical flaws.  Features  Port of the 1999 Dreamcast platformer Sonic Adventure Choose from six playable characters including Sonic the Hedgehog Zoom through a host of beautiful environments spanning more than 30 levels Solve minor in-level puzzles, take down enemies, and fight bosses GCN version features new 60 mission modes to extend replay value GCN version features minor graphic enhancements GCN version features GCN/GBA link functionality GCN version features Sonic Game Gear games Runs in progressive scan mode Dolby Pro Logic II support Requires nine memory blocks for saves Single-player game   Gameplay Sonic's long-time nemesis Dr. Robotnik is once again chasing an evil plan to destroy the world. The baddie, who also goes by the name of Eggman, hopes to harness the power of the seven Chaos Emeralds, energized artifacts, and do very cruel things. Of course, the hedgehog won't allow that and so the story -- or what little there is to it -- sets up the action to follow in Adventure. Gamers are introduced to the tale through an opening FMV scene that was made four years ago, but still holds up today.   Strategy Guide Coming Soon! Want to be Super Sonic? Then you need our guide!  Tips, tricks, and full walkthrough coming the week of July 7th  See Other Guides | Get Insider  This GameCube port, like the Dreamcast original, takes the tried-and-true play mechanics of the classic 2D games and attempts to recreate and enhance them in full 3D. Gamers can play as Sonic or five other franchise characters including Tails, Knuckles, Amy Rose, Big the Cat and the E-102 Gamma, and each advances through the game differently -- some better than others, we might add. Sonic and Tails are the real heroes of Adventure as they're both fast and agile, two abilities which lend themselves to the speedy, chaotic pace of some missions -- the better ones in the title, anyway. Playing with the other characters, particularly Big and Gamma can be a slow, bothersome process. There is much to do in Adventure, but the primary goal is to zip through levels and obtain the scattered Chaos Emeralds, thus stopping Dr. Robotnik's evil plot.   The game excels at delivering fun stages that feel like 3D-ized pinball machines, and half-controlling Sonic and pals through these twisting, turning, looping, dropping locations is highly enjoyable. Control is light and intuitive -- analog stick to move, A to jump, B to charge and spin, and that's really it. Players will be thrilled by the intensity of some levels, as Sonic bounces off springs and rides rockets across chasms, spins through multiple 360-loops, hurls himself off jumps, and more, all without missing a beat. No doubt, when Sonic is blazing a path through mindlessly twirling locations the game is at its very best.   But when things slow down, they really slow down, and this is where Adventure takes a sharp turn for the worse. So let's jump right to it: exploration in Sonic Adventure is a chore and just about any level that puts emphasis on it in the game is a failure. This, because there are so many limitations that hinder the levels that aren't noticed when Sonic is speeding through a loop and bouncing off walls. We could probably write a thesis about the many game design flaws throughout some of the levels in the game, but we'll keep it short and sweet. Consider these examples: there are invisible walls and paths that lead directly to them; the hub world features an entire city of which only a few doors open, and figuring out which ones is a guessing game; and there are areas in the title where Sonic will die if he falls in water and others where he won't. These faults speak nothing of DX's disorienting, dizzying camera system, which is perhaps one of the worst in a 3D videogame. Only when Sonic is running through a loop or speeding along does the camera seem to shoot the action accordingly; when players choose to explore, it catches on walls, rotates in the wrong direction, and is generally a big pain the ass. Any attempts to control the camera manually will usually only worsen the situation. Meanwhile, Sonic himself also often catches onto the objects and locales in the worlds and screams to a dead halt, destroying what is one of the game's primary appeals: its sense of speed. He may, in fact, be in mid-loop, scrape against a wall, and immediately stop -- not very polished given that so much relies on being able to stay in motion.  Sonic Adventure DX Director's Cut on GameCube  With some 30 missions, some decent mini-games, Game Gear goodies and a Pocket Monster-like Chao-raising mode (and therein the GBA link functionality), this is still a fairly deep Sonic game. Anybody who bought the Dreamcast original, though, should know that the additions to the GameCube port are mostly negligible. Why wasn't the camera fixed? Why does Sonic seem to stick to everything? Sega would have made fans a lot happier had it worked on these issues and ignored the marginal new mission mode, which can only be accessed anyway after the adventure has been beaten numerous times.    Graphics Sonic Adventure was gorgeous when it debuted on Dreamcast four years ago and that beauty still holds up today. From the fairly crisp presentation of the FMV sequences to the large, stylized worlds in which Sonic explores, the game looks good on Nintendo's system. Sonic himself is well constructed, as are the other characters, and the environments are usually big, stretching, and filled with obstacles and objects. The texture work in the game is well done -- textures are detailed and clear for the most part, a statement that's not true of many other truly next-generation GameCube titles. Sonic animates quickly and fluidly. Meanwhile, Sonic Team has made some slight visual improvements to the GCN version in the form of more realistic, shimmering transparent water effects. Happily, progressive scan support is included.  Now the bad. What the hell happened to the framerate? Sonic Adventure on GameCube lacks the steady fluidity of the Dreamcast version because the framerate is constantly dipping up and down between 60 and 30 frames; sometimes below that, in fact. It really puts a hamper on things. The speedy sensation of moving through the locales is dented considerably because of all the dips, and that's inexcusable for this four-year-old port. As for the rest, NPC character models lack detail and animate stiffly; there are no shadow, lighting or advanced particle effects to speak of; the worlds themselves lack geometry and as a result look square as opposed to rounded. Get the point?  Sound Ladies and gentlemen, please cue the cheesy 80s' guitar riffs, for Sonic is about to enter the building. The audio portion of Sonic Adventure is sure to incite a war amongst hardcore fans -- there are those of us who hate it and those who love it. To its credit, the game does run in Dolby Pro Logic II, which is always a plus. However, we can't get past the generic music. Sadly, the voice acting does little to counteract the tunes because it's so poorly executed and so carelessly mapped to animations that it's more humorous than entertaining. The sound effects, though, from the hum of a speed charge to whizzing over rings, all comes off crystal clear.  When Sonic is going fast, all is right and good I breezed through Sonic Adventure when it was released on Dreamcast years ago and found it to be a fairly enjoyable title. But it doesn't stand the test of time. The game has its moments: racing through pinball-like locales, bouncing off walls and whizzing through loops, is as intense and fun as it used to be, and it's these moments that ultimately save the title from being a total failure. Meanwhile, with 30-plus missions, bonus areas, six playable characters, Game Gear titles, and a Chao-raising mode with GBA-link functionality, there's a high degree of depth here, too.But there are so many flaws in execution that can't be ignored, either, from one of the worst camera systems in a 3D game to the fact that Sonic himself catches onto the environment and sometimes comes to a dead stop in mid-sprint. And what the hell happened to the framerate in the GameCube port?A very sloppy port of a game that has long been undeserving of its high praise. A mediocre platformer. If you own the Dreamcast version, don't bother. Everybody else, consider renting Sonic Adventure before buying it.", "date": "Jun 21, 2003"}