{"name": "Disciples II: Guardians of the Light", "name_review": "Disciples II: Guardians of the Light", "ref": "https://www.ign.com/articles/2003/06/24/disciples-ii-guardians-of-the-light", "text": "The last couple of years have seen a small rebirth for big market turn-based strategy games, which is a good thing. While there's a lot of the same being thrown around in the various titles, especially those set in fantasy worlds filled with dwarves, elves, and orcs, each of these types of titles have something different to offer. One of my favorites of the recent crop was last year's Disciples II: Dark Prophecy. Not only did it provide some fun gameplay and a quick battle system that still managed to give plenty of options for strategy, it showed that developers could even make what on the surface seems like a run of the mill world into a beautiful and artistic journey. Now Strategy First is coming back to Disciples this summer with not one, but two expansion packs letting players revisit the series with a few new features. The first of these, Disciples II: Guardians of the Light focuses on the ~good~ races in the game. It does add some new campaigns and story and even a couple of new features, but I can't tell you that this expansion pack is a great deal for fans of the game or beginners due to its price and lack of new and substantial gameplay additions.   The tricky thing about Guardians of the Light is that it's a stand-alone package with the original game inside. So not only are you getting an expansion, you're getting the original, so it's more like a gold edition. That's pretty cool for new players, but leaves me wondering whey they didn't just put both of these expansions together and then come back with a gold edition that includes all of the above. Those that have already played the original game might find it hard to shell out 40 bucks to get both of the new expansions that are basically just new campaigns. Because this is a stand-alone expansion that includes the original game, I urge those that didn't already play it who are thinking about trying it out to read my review of Disciples II as well as this review. The core gameplay is the same so I won't be diving into that here.   The story is set in the same world that has been torn apart by a war for control. Guardians of the Light takes the position that good were victorious and now the stages of rebuilding have begun. Of course, as is the way with most believable characters, not even the good guys are completely good. The Empire is rife with conflict as three factions vie over the now empty throne. The religious right has made it into this story heavily with their inquisition and hot pokers and the like as well as the assassin army of the former intelligence minister. Meanwhile, the Mountain Clans are trying to recover from the catastrophe that rocked their world at the end of the first game while they also try to find a way to talk to their god Wotan. And of course, those bad boys that just won't stay dead are back to muck everything up along with their Damned friends. The story is told in the same style as before, dark, dirty, and brooding, minus the voice-overs, which is too bad because I enjoyed them in the first game. The story progresses through the use of in-game dialogue, missions, and briefings, all of which propel the fiction along in good form. Those that are new to Disciples II completely will find the original campaign very well done with voice-work where appropriate.   The Guardians of the Light expansion features a bunch of additions, but nothing that changes gameplay significantly. In fact, the only real addition that made much difference to me was the auto-resolve feature for combat. There are just some battles you know you're going to win (or lose) and being able to speed those up can save some time better spent making your next move on the map or getting into another more challenging fight.   Both of the campaigns in the game, that take the side of either the Empire or Mountain Clans, are completely new with the new story and scenarios. The scenarios themselves are just as addicting and fun as they were before. But there's really nothing new to see here. It's more of the same, which isn't bad, it's just not as exciting as it might have been either.   Both of the campaigns in the game, that take the side of either the Empire or Mountain Clans, are completely new with the new story and scenarios. Both of them also require high level leaders to even begin. In order to play, you have to export a level 10 or above leader from the original campaign in Disciples II. The bad thing for most fans of the game is that they've long since uninstalled and deleted their characters, as I had. Strategy First did at least have enough consideration to add a leader of each type for each of the four different races that are level 12, so you won't have to play through the first game all the way. The bad thing is that they're hidden on the CD so that you'll never be able to find them unless you read the readme file all the way to the end where it tells you how to include their pre-made high level heroes. You'll even be able to change the name of the hero to whatever you like at the beginning of the campaign, so pretending it's your hero (if you can even remember the name you used to begin with) won't be hard.   The main problem with these high level scenarios is the same problem I had with the rest of the game when it originally came out. You can only carry one leader over per level and no troops. So you have to go through the motion of building up troops each game, which is entirely annoying, especially when the whole map is littered with incredibly powerful creatures. Even sticking powerful units in with your weak ones to build them up can be a pain in the butt. Half the time they die anyway because they're seen as the weak link by the enemy AI. I really wish that they had figured out a way to ramp up the difficulty of scenarios differently so that you could bring more than one leader into the next round. This is really what made the difficulty level so high originally and continues on in that vein even with the easy setting.   Along with the new campaign come some new scenarios, multiplayer maps, and a random map generator. Although, frankly, I think that description is more than a bit deceptive. In order to get a random map to play on, you'll have to enter the scenario editor - that's right, you can't do it in the game - and create a new map and then randomize it. It isn't entirely random either; you still have to pick the number of cities, mines, crystals, enemies, and more. Every time I've seen a random map generator advertised before, it's been with the understanding that it randomized a map on the spot with only a number of players and a map size (which now can get up to 120x120 and 144x144 by the way).    One thing that you can be certain that you'll still enjoy is the art. Everything is just as beautiful as it was in Disciples II: Dark Prophecy. The year in between the original and these expansions did nothing to diminish the skill and beauty the art team managed to squeeze into this title. There is not a turn-based strategy game out there that can compete on this level. So obviously, the announcement that higher resolutions were going to be supported (the original release only supported 800x600) made me pretty happy. But low and behold, once I found the option to change the resolution (which also can't actually be done in the game) I found that the resolution only actually increased for the map, not the rest of the game. The battles, cities, army management, and even the menus are still actually in 800x600. The game just puts these portions in a smaller window when leaving the overland map. That's lame. You can actually get this windowed screen to stretch to cover the entire screen at higher resolution, but it doesn't look as good as it does in plain 800x600. This is another misleading claim that is sure to stink to a number of fans looking forward to the art in higher resolutions. I still can't fault the game itself very much, and those gamers out there that are looking for a good turn-based strategy games that haven't tried Disciples II: Dark Prophecy could definitely do worse than buying Guardians of Light. Just be forewarned that if you want to play more high level campaigns as one of the evil races, you're going to have to shell out another twenty dollars for Servants of the Dark, which will be released in mid July.But then again, you can find Disciples II: Dark Prophecy for ten bucks at most stores if not under that. So if you're looking for a real bargain that may be the way to go. Either way, veteran players are kind of getting the shaft with this brilliant money making scheme that Strategy First is pulling with these expansions. If they were both together for twenty dollars along with a real random map generator and complete upgrade in resolution, I would be much more inclined to recommend it just as an excuse to get back in and play more. As it is, only new players and veteran fans who have taken up smoking crack to fill the void of no Disciples II will want to shell out the money for each of these expansions.", "date": "Jun 24, 2003"}