{"name": "Rockman EXE 3 Black", "name_review": "Mega Man Battle Network 3 Blue Version", "ref": "https://www.ign.com/articles/2003/06/26/mega-man-battle-network-3-blue-version", "text": "Just this year Capcom branched out the Game Boy Advance RPG series Mega Man Battle Network into its own franchise. Not only does the game have its own Saturday morning anime series, but it also received the console treatment in the GameCube title Mega Man Network Transmission released earlier this month. But it's the RPG series that started it all, and to keep the series going on the system Capcom has released Mega Man Battle Network 3. The game is a brand new story using the established game design, which means there's very few new elements to surprise players who completed the first two games in the series. Though it's a bit disappointing to experience the same ol' stuff a third time in just under three years, the Battle Network RPG design is still a solid one that will give players a few dozen hours of high-tech fun. Features 20+ hour quest Link cable support for two player trading and battles Cartridge save (one slot) Only for Game Boy Advance Mega Man Battle Network 3, like the previous games in the series, is an RPG design where players control Lan, one of the best net-battlers around. See, the world of Battle Network is one of the future where everything from chalkboards to doghouses is connected via a huge network. Many people of this world carry around Personal Electronic Trainers, or PETs, and Mega Man is Lan's own PET. These two work together, and when trouble's a-brewin' online, Lan must jack-in so that Mega Man can do some damage. Battle Network 3's story, starting about a month after the end of Battle Network 2,  revolves around a tournament that Lan's invited to attend. After completing in each division, a little more of the story opens up that involves, you guessed it, an evil faction looking to take over the world via the integrated network. Players familiar with the previous two games will not have any problem following the distinct rules of battle for Mega Man Battle Network 3, but the designers still force everyone into a ~refresher course~ of sorts for newbies that are jumping into the design starting with number three. When players encounter enemies (via the tiring, but seemingly never-ending trend of ~random battles,~) players will choose battle chips that can be activated during battle. Normally, only one chip can be sent to the brawl, but using a little strategy (i.e. two of the same chips, or two of the same type chips) players can piggyback other chips into the list to give Mega Man extra firepower. In the battle sequence, players can move Mega Man over the red squares on the grid, utilizing his standard blaster to peck at the enemies in the fight. But it's the battle chips that really do the most damage, and the strategy is to pick the right chip for the right enemy and situation. Some enemies can remove grid squares from play, making it impossible for Mega Man to move to these sectors during the fight. Others can leap out of their area and into Mega Man's temporarily, so players must learn to keep their blue guy moving so he doesn't take too much damage in the battle.  For the first time, the series has gone the way of the Pokemon route and is now offered in two distinct flavors: White Version and Blue Version. Both versions are identical in quest, but each version has a handful of original elements. Along with unique battle chips in each version of Mega Man Battle Network 3, there are five unique Giga Class chips that can only be obtained in White but not Blue, and vice versa, but since Giga Class chips cannot be traded between games, these will stay exclusive. On the same note, Mega Man can adopt an exclusive fighting style in each version that cannot be learned in the other version. There are also exclusive enemy viruses in each version, including a completely different level boss deep in the adventure; White owners will battle Mist Man in Chapter Seven, while Blue owners will duke it out with Bowl Man.The shame of it all is that both games come on standard gray plastic cartridges, so the ~white~ and ~blue~ of the different versions are really just in namesake and background color on the title screen. But other than the separation of elements between two versions of the same game, Mega Man Battle Network 3 doesn't offer a whole lot different from the previous two games in the Battle Network series. It's clear that the development team used the exact same tool sets that were utilized in the original game and last year's sequel, since Battle Network 3 features literally no graphical or audio enhancements over the past two adventures. The game does feature a slightly modified folder system to make navigating and organizing the battle chips a bit more intuitively, and Mega Man can now assume seven different fighting styles that result in new programs that can be assigned to the character; this element adds a bit more experimentation to the adventure. The adventure incorporates far more interaction between Lan and Mega Man, which means more frequent need to send Lan on parallel quests while Mega Man waits around in the virtual world. Mega Man Battle Network 3 doesn't seem to support the same connection with the previous versions of the game, the same way that Battle Network 2 supported trades with the original game through the Retro Trader function. That ability has been scrapped in Battle Network 3 in favor of the ability to trade between the two different versions of the third game.  There's also the missed opportunity of connection between this game and the recently-released GameCube action game based upon the Battle Network series. Though the GameCube platformer isn't that much better than the average GameCube fare, it would have definitely added a bit more to the design had Capcom introduced connectivity between it and the GBA RPG title. And it just doesn't make too much sense why Capcom didn't do it, what with the whole ~jack in!~ element that surrounds the Battle Network idea.  There's certainly nothing wrong with Mega Man Battle Network 3, since it features the same RPG game design as the previous two games in the series. But the problem: it's the same RPG game design as the previous two games in the series. Very little has changed in the game design, which seems like a trend in the Game Boy Advance market that's becoming more and more common; Golden Sun and Advance Wars shares this issue, and it's just a little disheartening to see it continue. But that said, the game's a fun, easy-to-follow adventure that takes more than the standard 20 hours of RPG gaming to get through. Just don't expect a whole lot of additional elements beyond what was already established in Battle Network and Battle Network 2", "date": "Jun 26, 2003"}