{"name": "Endless Ages", "name_review": "Endless Ages", "ref": "https://www.ign.com/articles/2003/07/16/endless-ages", "text": "New games are released all the time. But surprisingly, with so many titles out on store shelves, it can be a bit difficult to find anything new and exciting to grab on to. Games hardly ever offer anything that the one that was released the week before didn't. Whether this is because developer's imaginations just aren't as strong as they used to be or ideas are being ~used up~, it seems to be becoming increasingly difficult to offer something that is truly original. Yet Endless Ages certainly gave it a go combining a couple of different genres together with some crazy worlds to create something at least passably new, even if it misses the mark in so many other areas.   It is being called the first MMOFPSG (regardless of Neocron and PlanetSide), which means Massively Multiplayer Online First Person Shooter Game. Combining the action and pace of a first person shooter, with the advancement and addictive power of a role playing game, all set in a crazy massively multiplayer environment filled with both high technology and magic gives Endless Ages a certain niche in the MMO market.   The game takes place in an after-life of sorts where three races, humans, amphibians and blobics, go when they pass on from their own worlds, only to find that they have to fight like hell yet again... for no real reason. In this afterlife death is of little consequence as once you die you instantly re-spawn to fight again, leading to an endless succession of violence and mayhem, which I suppose isn't really a problem. Unfortunately, the story isn't heavily emphasized in an interesting way to explain the coexistence of such different species together. It just is... accept it.   The minds of yesterday have been kept intact however. The technology from the world of the living has been brought over in the consienceness of the scientists who have passed over into this realm. This means that weapons and vehicles such as jetpacks are in ample supply for anyone with enough cash. But the focus isn't just on technology here, there's also a very heavy presence of magic to contend with from humans that can call down destructive forces to amphibians that have the ability to take control of the creatures around the game world to do their dirty work. Endless Ages has really tried to combine everything in this game, offering something to everyone, but ends up blurring it together without any real cohesion.   The game begins by asking you to create a character of which of you have four choices: human male, human female, blobic and amphibian. Each has the obligatory advantages and disadvantages such as the Blobic's high power but low mobility. Once you've chosen a character and given it a small set of visual adjustments, you are thrust into the training area. As tutorials go this one is fairly poor; the instructions are written on billboards positioned about the training grounds, so if you don't find them you don't learn much. For most people this will not pose a significant problem as you can pick up some of the basic skills pretty quickly, but only after you redefine the keys. The default set is nearly un-usable and places F8 as the examine/interact key, forcing you to reach across the keyboard anytime you want to do something. Really... what the hell? Who does that?   More frustrating than anything, however, is the mandatory half second pause before any action. It happens between equipping pieces of armor, between reloading, and between taking or selling pieces of loot to the store. If you try to skip this delay the action just is not acknowledged by the interface and you're left twiddling your thumbs. After managing to figure out the basics, you can advance into the gameplay world, where you are once again completely lost as you try to figure out what to do with yourself. The beginner quests require a higher level than you can muster in the first two days of playing, leaving you with very little to do. Running around shooting blocky little creatures is kind of entertaining for a little while, but can't hold you forever. More trouble is in store for players as even finding the beginner quests can be a huge pain in the ass. Much to my dismay the first quest I came upon was a mid-to-advanced level quest. Games have to make getting into a game as easy as possible, especially one that uses quests as the main gameplay focus.   Once you do get used to the unusual quirks of the game, you can actually start to play a little more and start to take a look into the world itself. The graphics are not impressive, or good really, but can be adequate for the experience as they certainly won't tax your system. Don't expect detailed textures or fancy effects, you won't find them in this world. There's very little ground cover, very basic colors, and blocky and messy models. After seeing some of the latest MMOs including PlanetSide, another MMO action game, this just doesn't compare.   Overall the idea of an action based MMO is excellent, giving players a more active role in the game, using reflexes to shoot, dodge and survive where most MMORPGs are simply a sit back and watch the action unfold type of affair. Some of these enemies are nearly impossible to fight without some form of dodging to help keep your health bar, well... healthy. FPS enthusiasts will love the advantage those years of shooting to train your hand eye coordination have given you. All the important skills in a FPS action game will come in handy to help you kill the local wildlife, which is extrememly hostile and extremely abundant. But those MMO players out there that go for the RPG type games will still be able to enjoy the long-term goals and the advancement in status by playing consistently.   Outside of the main cities you are presented with a landscape with quite a variety of creatures running about for your shooting pleasure. To accentuate all this is a beautiful horizon, which is no simple background effect. Every hill, mountain, and island on the horizon is a real place you can go to and visit, assuming you have the proper tools. This makes exploring a great challenge, as long as you can avoid the nastier critters.The game was a good concept, one that caught my attention right away, unfortunately it was poorly executed. The game controls left a lot to be desired, and while fully customizable, the interaction with NPCs and lootable corpses is far too discouraging. On the plus side is the fresh scent of some bit of originality, something that sometimes seems hard to come by in the video game industry. With any luck games like this and PlanetSide have proven new ground for which future developers to cultivate and improve upon. I would definitely give a sequel a chance, not a simple expansion, but a second game altogether, to fix things up, put in some new graphics, and make a better presented experience. But for the time being, don't bother.", "date": "Jul 16, 2003"}