{"name": "The Terminator", "name_review": "The Terminator", "ref": "https://www.ign.com/articles/2003/07/22/the-terminator", "text": "Apparently, even handsets are not immune from this summer's spate of movie-tin games.  Ah-nuld's ~T3~ made a huge splash on opening weekend, but is already struggling to recover production costs domestically.  Maybe you can help him out on the go, by downloading this ~just-in-time~ quickie that features the Teutonic cyborg menace-cum-father-figure and a very, very loose connection to the franchise.  Features: Number-pushing action! High score board  The year is 2080.  The machines have ravaged the planet.  You are a rebel soldier, scouring the ruins of Los Angeles, saving humans while fending off the minions of Skynet's robot army.  Armed with a machine gun and grenades, you have to make it through every single level, rescuing key human resistance figures and wiping out James Cameron's horde of mechanical nightmares.  Sounds fun.  At least, it sounds more fun than Atari's awful Terminator game, which made the trip from shelf to bargain bin with great haste.  Well, Terminator celly game, get thee to the bin, toot sweet.  Now, In Fusio's Terminator is billed as an action game on Verizon's Get-It-Now site.  Whatta load of crap.  You wanna know how you shoot the never-ending onslaught of T-100s and Hunter Killers?  By pressing keys on your number pad, each one corresponding to a different section of the screen.  And if you want to hurl a screen-clearing grenade, tap ~*~.  Other than that, you're a spectator to this first-person, side-scrolling, on-rails so-called ~shooter.~  The screen slowly moves from left to right as you traverse the dead city, and robots walk into view.  Sometimes they turn to shoot, sometimes they just keep on keepin' on.  You score points by shooting as many of these robots as you can, as quick as you can.  There are several different models of Terminator, too.  Some are pure metal endo-skeleton.  Others are half-blonde, half-robot.  And in the very background, there's the Arnold model, complete with trademark shades and leather jacket.  (We guess they just sent back all these leather jackets via the time travel device?)  Between each level, you visit an armory, where you can stock up on supplies, like medical units and extra grenades.  This cache of goodies never seems to deplete either, between each level, you're right back to having nine grenades in stock, making Terminator pretty easy on the trigger finger.  In addition to raiding the armory, occasional crates of supplies are dropped from the air -- presumably from helicopters or jets that would have been long-grounded by the machine army's Hunter Killer air force.  Oh well.  Some of these crates are booby-trapped.  Just to make it easy on you, the bad crates are stamped with a human skull.  Don't shoot those.  There is a decent amount of sound in Terminator.  Every level opens with a melody, which is unfortunately not taken from the original film's score.  There are quick bursts of ~plink-plink~ shooting, but nothing sounds remotely like a gun or a grenade going off.  Now, if Barnyard Bouncin' can sample cats and cows, Terminator could have at least tried something similar.  The visuals are equally ~eh.~  The scrolling is rudimentary Genesis, with a couple layers of movement.  The sprites are just okay.  At least you can tell they're robots, unlike the Hulk game, where you have no clue if you're looking at the Hulk's fist or a glob of green Play-Doh.Oh, joy.  Now cellphones are on the receiving end of craptastic movie-licensed games.  Just when I had finally accepted that I'd always have to wade through a decent amount of bland, effortless excuses for action games, now comes this next wave of shovelware.  Hopefully, enough people will turn their backs on this game and it's ilk to discourage gamemakers from thinking they can just slap a hot pop culture license on a weak game.  Of course, with consoles still drowning in this poopware -- has anybody else been assaulted by Ubi Soft's fascinatingly flaccid Charlie's Angels GameCube title -- I'll steel myself for the longhaul.", "date": "Jul 22, 2003"}