{"name": "Rally Championship [2002]", "name_review": "Rally Championship", "ref": "https://www.ign.com/articles/2003/07/30/rally-championship", "text": "Rally and WRC might be a niche market, but publishers don't seem to want to stop making games about the primarily European sport. Conspiracy joins the crowd with Rally Championship, another racer on the dying-for-racers GameCube. It feels Quick Rally and Arcade modes for the ADD-ridden (think most of the IGN staff) and a Career mode for the more focused rally-racing gamer.  Features  Simulation rally racer with arcade elements Six different rallies and 33 stages across four different regions 25 licensed cars Four-player mode Runs in progressive scan   Gameplay You'll hear us complain a bit about the graphics and the sound, but not much about gameplay. That's because it feels damn good. We're not talking about the course designs, but more the physics and the vehicle control. We felt a real sense of speed while playing Rally Championship, but on top of that we also felt like we were in full control of our vehicle.   And when we did find that we accidentally flipped or managed to get out of control we were convinced that the vehicle reacted the way a real WRC car would in a given situation.  Unlike other racing games third-person perspective doesn't make the control change much and we didn't encounter any accidental fishtailing while driving.    As much as we can praise the actual gameplay we're afraid most players will agree that it's hindered by awful interface and menu systems. At first you might think they're very simple, which they are, but that simplicity is what kills them. The entire menu system feels incomplete and not unlike something we've seen in pre-production games.  On the other hand, with six rallies and 33 stages across for world locations, not to mention 25 licensed cars, we can't complain about the selection offered.  Graphics Rally Championship looks decent through a composite or S-video connection. It's nothing we haven't already seen on the Cube, but it looks fine. Track environments are very picturesque, taking place in some of the world's most famous rally locales. And there are some really nice-to-see visual effects like water reflections, working headlights and some cool texture swapping work to make our vehicle appear dirty.   Most of the environments tend to feel as if they're missing something. Sparse would probably be the right word as all the basics for the tracks and surrounding landscapes are there, but it seems a tad too lean on not so much scenery, but objects and obstacles.   Rally Championship has quite a few options for camera angles, but we really like the in-car cams. They give us an uncanny sensation that we're actually inside a purpose-built rally car being pushed to the limit. By design the camera moves a whole lot in this view and you should probably stay away from playing in this view if you're prone to motion sickness.  Even with the lack of action or eye candy in the scenery the game really looks beautiful with a component signal. It's really like a whole new game with some more scan lines to make the game look pretty. It doesn't look so muddy and actually has that polished look we see so much in PC games.   Sound Call us sound-nazis, but aside from something like GT3 or maybe EA's upcoming Need for Speed Underground we've yet to be impressed with the sounds coming from a racing game. We can sympathize with the developer as nailing down each and every sound effect isn't an easy task. Rally Championship is another racing game that has the bare minimum effects, but most players won't care or really notice--how many of you have actually been to a rally event? We're sure that's the mentality that the designers of Rally Championship are banking on.  Still, the generic engine sounds aren't the best. Some of the other effects like rain drops, puddles and general road noise are okay, but could be so much better. The navigator--er, co-driver voice offers are standard fare and extremely boring stuff like, ~easy right one,~ or ~hard left.~ Yeah, it's nothing to write home about. It's odd that no one has figured out that sound effects are like almost half of what makes a really good racing game.  Rally Championship on GameCube  The soundtrack is as equally uninspired. Some of it is ill-composed wannabe-techno while other tracks are bottom of the barrel ~rock~ music and, mind you, we use the term rock music as loosely as possible.Racing games on the Cube are really too few and far between. There's no excuse for the lack of wheel-to-wheel offerings from anyone on the Fun Machine part 2. Rally Championship does have its shortcomings, but it also has its pluses. The most important aspect of the game, its gameplay, was solid and felt just about right. Although the environments can be sparse in areas they're overall pretty nice to look at as you tear through the gears in each course. It has a lot of potential if and when a sequel rolls around, but this isn't a Colin McRae, that's for sure.", "date": "Jul 30, 2003"}