{"name": "Stuntman", "name_review": "Stuntman", "ref": "https://www.ign.com/articles/2003/08/01/stuntman-2", "text": "Atari's internal development team, Velez & Dubail, named after the two members Fernando Velez and Guillaume Dubail, continue to work their expertise both in Game Boy game development, as well as Game Boy racing design with a GBA conversion of the Reflections-designed PS2 game, Stuntman. An ambitious project absolutely, but the group managed to work as much of the console design's gameplay into handheld form, while still pushing the system hardware to its current limitations. And under that ~wow factor~ lies a unique and challenging experience for Game Boy Advance gamers. Features Six movies to complete Precision Tests and Jump Tests Link cable support for two players (multicart) Cartridge save Only for Game Boy Advance  One constant in game development: the more comfortable programmers get with the hardware, the more they can pull off in their designs. Velez & Dubail has had a long career in Game Boy racing design, offering impressive 8-bit packages in games such as V-Rally, Wacky Races, and Test Drive Le Mans. The team recently broke out into Game Boy Advance development with the technical marvel that was last year's V-Rally 3 conversion. Stuntman marks the team's second GBA title, and it's obvious that, while sharing very little in the way of gameplay, Stuntman is building off the V-Rally 3 engine...with some visual improvements, of course.  The game design of Stuntman is based entirely on the same game released on the PlayStation 2, where players assume the role of a stuntman in several film productions. The director calls for the skills of the stuntman by putting him in a string of driving scenarios that must be completed in order to move onto the next challenge. Players will have to drive fast, first and foremost; the stunt is timed, and running out of precious seconds will end it abruptly. While driving the many different vehicles with the pedal to the medal, players will have to do specific tasks as they're called out by the director; crash into an object, pass a vehicle on a specific side, do a handbreak turn, spin out, or launch off a jump are just a few of the things that will be required during the fast-paced challenges.  Players can accidentally miss one or two objectives in each challenge, but each goof up can be costly; the idea is to earn as much money as possible by being the best stunt driver out there, and the pay is docked for any screw-ups...and the potential bonus gets reduced with each time players have to restart the stunt from the beginning. It's not easy to get a high score in Stuntman the first time around, which does mean the replay value's increased for those looking to restart their stunt careers after the challenge is over. Money that's earned can also be used to purchase vehicles and levels outside of the movie making process. Stuntman is definitely another one of those showpiece Game Boy Advance titles thanks to an incredible 3D engine that mixes texture-mapped polys and sprite-based objects. The game looks and plays a bit more smoothly than the team's previous V-Rally 3 effort, even though it's utilizing similar techniques for its racing shell. But even with the impressive effort, it's clear that the programmers are still making compromises with the hardware to get 3D to work; objects will still show through foreground poly structures, like a moving train appearing in front of a mountain it's supposed to be traveling behind. It's a distracting glitch, but it's pretty obvious that it's something the programmers had to leave in the engine for specific technical reasons.  While the idea of the PS2 game has been recreated pretty closely on the Game Boy Advance, the whole movie making theme just isn't nearly as strong in the handheld rendition. On the PS2, everything you do is actually being filmed and recorded, which then gets spliced in with actual full-motion video of a faux movie production. The Game Boy Advance obviously doesn't have the technical prowess to pull something like this off, so the whole element of being part of a film production just isn't evident beyond the film's title cards that bookend each level. Sure, you can watch your performance at the end of each run through in an extremely limited replay option, but it's just not the same. And besides, since the game's engine isn't completely 3D, the developers have to limit the camera angles used in the replay to basic drive-bys at the same eye-level as the normal in-game camera...so it's not very useful or fun to watch.  But even with these minor issues, Velez & Dubail have created a unique and fun experience on the handheld, offering an original challenge that plays well on the handheld. And there's even more to be had beyond the movie-making experience, with the game's original Arena contests. Players can set out in six strategically laid out challenges called Precision Tests, where they'll have to drive forward and backwards through gates, slalom around posts, launch off jumps, and park within specific zones before the time runs out. In the Jump Tests, players have a set amount of time to collect airborne letters that form a specific film-based word, and the only way to do this is to launch off jumps and collect them...angling the car down the roadway to shave seconds off the clock. These Jump Tests can also be played in two-player mode, where both players attempt to collect the most letters before time runs out. Just like their previous effort in V-Rally 3, Velez & Dubail pull off a very decent conversion on the GBA with Stuntman. Its focus on driving technique instead of racing gives it a distinctly different flavor for handheld gaming, since the GBA's already chock full of the racing variety. The conversion isn't quite as versatile as the console game it's based upon, but at least portable gamers won't have to put up with the seriously obnoxious loadtimes the developers put PS2 gamers through last year.", "date": "Aug 1, 2003"}