{"name": "eJay Clubworld: The Music Making Experience", "name_review": "eJay Clubworld", "ref": "https://www.ign.com/articles/2003/08/01/ejay-clubworld", "text": "What first came off as a novelty genre for consoles now looks like it's becoming a full-fledged, almost over crowded market. Though the number of releases in the music creation scene are still very low, the fact that almost all of them offer identical features and at budget prices makes choosing one over the other a bit difficult. With the recently released MAGIX Music Maker, a more or less competent piece of software priced at an affordable ten bones, a company would either have to release a superior product, or a comparable one at the same price point to make any impact in the genre. With eJay Clubworld, it seems that Crave has decided to go with the latter.  eJay Clubworld: The Music Making Experience is another beat/drumlooop creation suite not unlike the previously mentioned MAGIX Music Maker or MTV's Music Generator; players can use the included drum/vocal/fx samples to create their very own, arguably professional-sounding music. Now, the first thing you should know is that eJay Clubworld, let alone any music creation software on a current console will not be as flexible or powerful as similar software on a PC. On top of that, there will always be a downgrade in interface due to use of a controller versus a keyboard and mouse. But if you're willing to accept these facts and don't have access to a PC and the proper software, eJay Clubworld could open up a whole new (club)world for you.  A major difference between eJay Clubworld and other music creation games is the approach and angle. Rather than laying out the tools and letting players figure things out, eJay separates different genres of music, providing separate ~clubs~ for electro, hip-hop, reggae, drum & bass, etc. For those wanting to focus on a particular genre, this can be a good thing as the game will offer corresponding samples and examples. On the other hand, having to navigate through the different clubs to try something new is a bit cumbersome and the division just seems unnecessary.   Because this is a PS2 game, it will obviously use a controller as an input device. Unfortunately, controllers don't work very well when having to navigate through different windows and menus, let alone cutting, pasting, and moving selected items. This has been a problem with just about every game of this type, though the controls schemes have been usable overall. Fortunately, eJay Clubworld actually has the easiest to use scheme out of all the music creation games. The somewhat simplified GUI also helps make each piece of the creation process a bit more digestible. But the more accessible interface has its faults, too, since the number of options is noticeably lower than in other games. There's a little bit of give, and a little bit of take. Rather than one interface being better than another, it's more that each one appeals to a different audience. Deciding and knowing what you're looking for will determine how much you'll like eJay Clubworld.    The eJay brand of music creation software has well-known DJ Carl Cox as its spokesperson and eJay Clubworld is no different. In fact, he even voices the tutorials in the game. But where MAGIX Music Maker had relatively in-depth tutorials about every aspect of the software, the tutorials in eJay are a bit lacking. Cox's monotone voice doesn't help make the learning experience any more exciting, either. Often you'll hear something along the lines of, ~This feature does this. Check the instruction manual for more info!~ Um, ok. We'll do that.    eJay Clubworld consists of an arrangement screen, a mixer, a groove generator, a hyper generator, a scratch mode, live jam, video mode, and jukebox. The arranger is where you'll place each sample in a timeline-based layout; the mixer is just that -- a mixer; the groove generator is drum machine used for creating custom beats; the hyper generator is used for creating custom melodies (think the piano roll in Fruityloops); the scratch mode lets you use the analog sticks to scratch ~records~ just like a DJ; the live jam mode let you program sounds to each controller button, and you and up to three friends can have a virtual drum circle; the video mode is similar to visualization plug-ins for Winamp; and the jukebox lets you listen to all your jams with custom playlists and whatnot.   As mentioned earlier, eJay is very much like the also budget-priced MAGIX Music Maker. Both offer similar functionality, though the interfaces are tweaked in different ways. In its favor, eJay is easier to use, though at the sacrifice of complexity. There's no doubt that with enough time and patience someone could turn out something pretty good using the tools and samples given. Also, eJay offers a couple of modes (live jam and scratch) that MAGIX doesn't, and they do add a little more than just novelty value.   The possibilities with eJay really come down to how dedicated a user is. While far from professional-grade software, eJay is a good gateway into more sophisticated and flexible software programs like Cubase, Fruityloops, and Pro Tools. If you're into making/learning about electronic music but do not have the comforts of a PC and the appropriate software, you should give eJay Clubworld a try. It's incredibly cheap, relatively easy to learn, and offers more functionality than you'd think. My biggest complaints about eJay are the dividing of musical genres and the lack of more samples. Not being able to import your own samples hurts any title of this sort, but again, as an introductory piece of software, you could learn a lot about making electronic music. In the end, if you're even remotely interested in music software, give eJay Clubworld a try -- there's really nothing to lose.", "date": "Aug 1, 2003"}