{"name": "Sid Meier's Alien Crossfire", "name_review": "Alpha Centauri: Alien Crossfire", "ref": "https://www.ign.com/articles/1999/11/09/alpha-centauri-alien-crossfire", "text": "It's usually pretty difficult to do a review of an expansion pack. It always gets a little bit unclear as to whether you're reviewing the pack's merits alone or reviewing the combination of the original title and the new addition. Fortunately with Alien Crossfire, the new add-on pack for Sid Meier's Alpha Centauri, it's not that much of an issue. Alien Crossfire is one of the most ambitious and entertaining expansion products ever released, blending seamlessly with the original Alpha Centauri package to give gamers and excellent reason to return to one of the most popular gaming worlds ever created, Planet.  Let me start by saying that I have no intention to re-review Alpha Centauri. If you are new to PC games or have been living on Mars for the past year, just click here to read all about the original game. With that said, let's pick up the game storyline where we last left it. After the faction wars that took place in Alpha Centauri, things began to settle down a little bit. Each of the groups maintained an uneasy peace with the others, not at all happy about the situation, but with too much at stake to risk their own survival on an all out war. Every so often a couple of groups would start taking potshots at each other, arguing about where a particular border marking was supposed to be, but for the most part the world was a much quieter place than it had been a few years before. Until the aliens showed up that is. Coming from the depths of space, two alien groups, each factions of a single race split by their beliefs, crash landed on Planet and began immediately to make plans for the destruction of the other group. Meanwhile, several of the human factions on the planet had internal arguments that led to still more political fractionalization. The stage was set for another bit war and Planet somehow sensed it. The hidden consciousness behind the planet began to create life forms even more hideous and deadly than the Mindworms in an all out attempt to force all of the unwelcome visitors on her surface to either leave or die. Here's where the game begins  seven new factions, each with strange new beliefs on the importance of Planet and how she should be treated, all aiming to rid themselves of the others.  Let's take a quick look at the new players. First off there's the aliens (their race is actually called the Progenitors), which are split into two groups, the Manifold Caretakers and the Manifold Usurpers (Manifold 6 being the alien name for Planet). Long ago, the Progenitors started a series of experiments on a planetary level that are now starting to come to fruition. The Manifold Caretakers believe that those experiments (particular the one on Manifold 6) should be allowed to continue to their natural conclusion. The Usurpers on the other hand, believe that there is vast potential in Manifold 6 and which to use its powers to become as gods. Naturally, the Caretakers are a little bit closer to planet, and have recycling tanks in each of their bases in order to help maintain that harmony. Their warriors are also protected by harmonic control devices that give them a defensive bonus in combat. The Usurpers, spurred on by the chance for immortality, have higher morale and grow their population at an increased rate. They also have resonance-enhanced abilities, but use them for an offensive advantage in combat. Both races have already performed scans of Manifold 6, and are aware of all major landmasses when the game starts. Another advantage of both of the Progenitor groups is the fact that they are rediscovering lost technology rather than trying to discover it anew. This means that they have access to Non-blind research that enables them to choose the exact technology they wish their scientists to work on rather than dealing with the chaotic guesswork that most of the human factions are limited to.  It was this human tendency to wander aimlessly in the search for knowledge that led Prokhor Zakharov to hook an AI module to one of his lab assistants. His attempt to create a more scientifically advanced human backfired when the result, Prime Function Aki Zeta-Five found herself distressed by the emotional frailties of human society. Striking out on her own, she forged the Cybernetic Consciousness, a group of Cybernetically enhanced beings that believe that the ultimate culture can be achieved without emotions getting in the way. While this lack of emotion and dedication to technology has enhanced the group's efficency and research abilities, the fact that they're all unfamiliar with the concept of the sex drive has limited their ability to grow populations quickly. Their other advantages include the ability to accept a Cybernetic Society without any negative effects and the ability to steal research automatically when conquering an enemy city.  The Data Angels are also obsessed with technology, but they embrace their humanity as well. Led by the underground hacker heroine Datajack Sinder Roze, this group is dedicated to the free flow of information. While this slightly anarchistic environment makes it difficult for the police to keep things under control, the faction's expertise at Covert Ops give them a success and cost bonus when probing enemy groups. This same spy network info also gives them any technology that any three other groups have discovered.  One group that couldn't give a damn about all this technology is the Drone faction, led by Foreman Domai. After a great worker uprising, many of Planet's laborers who wished to escape the oppression or disdain of their technocentric factions move to join this new group. The Drones' goal is to achieve a great industrial nation where the workers are rewarded rather than oppressed. Not only does this make for a society that can be beat when it comes to turning out products, it also has created a society of mutual respect that generates fewer dissatisfied citizens. Their example of care for the working classes helps them in other ways as well. When another faction's base revolts, there's a good chance that they will see the Drones' movement as the best hope for their future. Sadly, their lack of interest in research hurts their ability to stay on top of the latest technological inventions, and their single-minded dedication to production keeps them from ever being able to operate under a government that seeks to care for the environment.  The environment is the primary concern of Prophet Cha Dawn, a young boy who claims to be able to hear the voice of Planet. Appearing out of nowhere, this fae child has gathered a massive following who seek only to do the will of Planet. According to Dawn, this will involves cleansing the planet of those who do not seek to understand its consciousness, which makes the other factions nervous at best. The Cult's fanatical devotion to the planet has its rewards including a natural affinity with Planet and its native life forms that is so strong that Mindworms are often used as police in the cities (with startlingly effective results). The down side is that with so many people worrying about Planet, there aren't that many left who are actually worrying about getting any work done.  The last new faction are the Nautilus Pirates, a group that just wants to be left the hell alone. Led by Captain Ulrik Svensgaard, this group has taken to the seas to generate their own new society. The group has used their knowledge of the deep to construct sea enhancements even in the deepest of waters, and their abilities in naval combat are unmatched. The downside is that, no matter how good they get at the seafaring lifestyle, it's still just not as efficient as putting buildings and workers down on dry land. Still, I have played many a game conquering all land cities only to find that the Pirates are just as strong as I am with only sea colonies to show for it. Not a group to be trifled with.  These factions, and the individual stories associated with each of them are the real strength behind Alien Crossfire. Even so, there have been a few other changes made since Alpha Centauri that you might want to know about. First off, there are now nine new technologies for you to discover. All of these have their roots in the new harmonics technology brought down by the Progenitor races, but they can definitely be adapted for human use. Along with this there are a handful of new building types, including the Aquafarm, which improves farm and kelp farm production, the Covert Ops Center, which delivers a bonus to Probe teams operating from the center and the Flechette Defense System, which offers protection from missile attacks, for you to discover and build. While all of the new additions are nice, and make sense within the new storylines, they don't really change the game all that much and tend to be window dressing except to those few who wish to make them the cornerstone of their strategy. A handful of new multiplayer options expand the ways the game can be played (play by E-mail and hotseat have finally been included), but won't matter all that much to those who have already been playing the game online for ages.   In the end, Alien Crossfire is all about single player improvement. While those who are looking for a change in their multiplayer games will certainly have a few new options to play with, you'll find that they won't make all that much difference in the long run. Still, by adding seven entirely new factions, each with their own rich storyline, Firaxis has given an amazing new life to their original product which is certainly worth the cost of an expansion pack. If you own Alpha Centauri, you owe it to yourself to go out and pick up this pack. It's a lot cheaper than a whole new game, but it'll keep you occupied just as long.  -- Trent C. Ward", "date": "Nov 9, 1999"}