{"name": "Madden 2004", "name_review": "Madden NFL 2004 Review", "ref": "https://www.ign.com/articles/2003/08/20/madden-nfl-2004-review", "text": "While the Madden football series has been made famous by every console from the Sega Genesis to the PlayStation 2, what most people don't realize is the fact that game originated on the PC. That's right, fourteen years ago, before it was the king of the consoles, it was one of the hottest PC games on the market. Unfortunately, these days it seems like the game is geared toward consoles so much that the PC version gets left behind in terms of features and, occasionally, even gameplay.  Madden NFL 2004 tries to set things straight by finally adding one of the best console features from last year, the Play Editor, while also incorporating the best new features of the 2004 game, namely Owner mode and Playmaker controls. While Owner mode lends itself perfectly to the PC market, you'll need to go out and buy a PC controller with double analog sticks if you want to utilize the groundbreaking Playmaker function. Once you get it all hooked up, the game works great, and if you crank it up to the highest resolution, Madden for the PC even looks better than its console counterparts. Unfortunately, even with all of these great additions, there were still some features that made the consoles that were left on the PC cutting room floor, namely Madden Cards and the EA Sports Bio. Sure, they might not be the two biggest features in the game, but it could leave a few PC owners left with a good case of console envy.  Features  Madden's Franchise mode has always been deep, but this year the depth and intricacies of running an NFL team are taken beyond simply being a coach or general manager, and actually enable you to become owner of your own franchise. Once you select a team to play Franchise mode with, you are immediately sent to Training Camp where you're then able to utilize nine of the mini games from last year's title to actually improve specific players attribute points. You select a player to participate in a drill like Pocket Presence, Chase and Tackle, or Swat Ball, then if you score enough points and win a trophy, you're awarded a set amount of attribute points to improve that player. Or, if you're feeling lucky, you can gamble those points and participate in the drill on a higher difficulty setting in hopes of winning even more points. Win again, and you're presented with a second opportunity to bet your points or move on to the highest difficulty ranking. Lose and you lose all of your points. If you win, though, you win big, and you can shape a player like Terrell Buckley into a nickel Sam Madison.   Once Training Camp is complete, you move on to Preseason where you can play preseason games, adjust your team's depth chart, sign free agents, re-sign, release, or even trade players. But trading players isn't simply a straight-up swap anymore, as you now place players on the Trading Block, then tell the other teams around the league what it will take to pry a player like Charlie Garner from the Raiders. If you want a quarterback with an overall score of 85 in return or a number one draft pick, that's what you ask for, then watch as other teams make you offers that fit your criteria. Once you find an offer you like, the game will then show you the value of each player in the form of a letter grade, and will even show a scale that tips in the favor of the team that's getting the better of the deal. You're also presented with the salary cap figures to show if you'll take a cap penalty for making the trade.    Speaking of finances, once the preseason is completed, that's when you're able to dive deep into the ownership part of the game. Here you'll be able to set the prices for everything in your concession stands like BBQ Beef Sandwiches, the Big Tuna Melt, popcorn, pizza, soda, and beer. You can also set the prices of team merchandise like programs, hats, jerseys, bobble heads, and foam fingers. From there you move on to the price of parking, tickets, and even the amount of money you want to spend on radio, television, and billboard advertising in hopes of coaxing additional fans into the stadium. And if the advertising isn't working, you can even throw a special Fan Appreciation Day and give away key chains, hat, souvenir cups, or even arrange for fans to meet the players before the game. You will also be consulted by your trusty Board of Advisors who will chime in with words of wisdom and warning like ~We should think about using some of that cap room,~ and ~Missing the playoffs last year was a big setback.~ Once your season has been completed, you're presented with a balance sheet that displays all of your finances including assets from ticket sales, concessions, parking, merchandise, NFL shared revenue, and your local media contract, as well as your various expenses like player salaries, staff salaries, stadium upgrades, stadium maintenance, advertising, and Fan Appreciation Day.       Upon seeing your bottom line and checking out your cash flow situation, you can then look at your coaching staff for changes. Madden NFL 2004 not only features the names and likeness of all of the real head coaches in the NFL (except Bill Parcels), but also includes all of the assistant coaches from around the league. So if you're sick an tired of the way a head coach from your favorite squad has been under-performing and want to replace someone like Dave Wannstedt with an assistant from another team like Jim Mora Jr. of the 49ers, all you have to do is fire Wannstedt, pay him for the remainder of his contract, then offer young Mora the job and hope he accepts you generous contract proposal. If you're unsure about an assistant's credentials, you can click on coach information and it tracks a coach like Mora all the way back to 1985 when he was an assistant with the San Diego Chargers, and even includes his career winning percentage, most recent record, and the number of Super Bowl trophies he has won throughout his coaching career.  Beyond finances and coaches, you can also choose to rename, renovate, rebuild, relocate, or upgrade your stadium complete with an EA arcade for the kids and an Internet cafe so fans can surf the net while watching their team pound the ball through the defense. The stadium builder is so in depth it's crazy as wannabe architects can manipulate just about ever facet of their new stadium, from where to put the tunnel in the first deck to where you want the scoreboards, to the type of turf your players will smash their opponent's faces into.   If you feel like the fans of your hometown just don't want to support your team or aren't spending their money the way you desire, you can test the market and attempt to relocate the team pretty much anywhere across the country from Boston to Birmingham, or if the United States doesn't suit you, how about Quebec, Montreal, or even San Juan.     But moving teams isn't as easy as Al Davis makes it out to be as first you'll need to design the new stadium, secure the funds from the city and through Personal Seat Licenses, then send your proposal out to a vote. The danger here is that if your proposal is turned down, the fans of your current hometown will find out that you were attempting to relocate the team and will then spend even less money on you next year as they take out their frustrations on your pocket book. If your proposal to move to the new city is accepted, though, it's clear sailing and you can go the Ravens-route and change the nickname of the team from something like the Miami Dolphins to the new and improved San Juan Marauders. You will also be able to change your team's logo and even incorporate logos from the NFL's past like the original Chiefs logo with the Indian running or the classic Patriots logo where some Ben Franklin-looking dude is set to hike the ball. Once your logo and name are changed, you're then able to completely change your team's uniforms, including their home, alternate home, away, and alternate away outfits.   When you've finally mixed and matched all the right colors, stripes, socks, and shoes, it's finally time to play some football in your new city, and in this case, country. But this just shows the level of detail the game goes into. It would've been one thing to add an owner mode that lets gamers simply change the price of popcorn, maybe hire and fire your coaches, but little else. Madden NFL 2004 takes everything sim-sports fans demand and have seen in stand-alone games like Baseball Mogul for the PC and incorporates them seamlessly into their game to give football fanatics a simulation aspect into their franchise experience that until now on consoles was only dreamed about. And the great thing is, if you don't want to do any of this, you don't have to. You can play a season or even a franchise just as you've had in the past, with no worries about the bottom line or the shortage of fans buying Jason Taylor bobble heads. But if you're looking for an added dimension to your game, something beyond X's and O's, Madden's ownership mode is something you can spend hours with as you discover the complexities of living life in the owners box as well as behind the center.      Beyond the mind-numbing number of additions to Franchise, the game also features some other outstanding modes. You have the ability to create your own team from scratch, complete with the same uniform and stadium editor found in Owner mode, then replace a loser like the Cardinals or Bengals in your league with your new and improved squad. Madden sports a variety of classic teams so fans can relive their favorite moments with their favorite franchises of all time. The only downfall is the fact that none of the real names or numbers are used for the throwback teams, but the good news is that the game does feature a player editor that enables those that know their football history the opportunity to go into the game and change those mystery men to the players they grew up watching like Marino, Clayton, and Super Duper.   Adding to the PC version are a host of cool online options including leagues, tournaments, and quick matches. The game also features the use of buddy lists, tracks career stats, and even adds the bonus of right-click functionality.   GamePlay  Since Michael Vick is the NFL's ultimate playmaker, it's fitting that Vick's videogame is the first to introduce Playmaker control to the gaming gridiron. At the line of scrimmage, Playmaker control flips the direction of running plays or quickly adjusts your primary receivers' route depending on the defense in front of you. For example, if you see the safety cheating up for a blitz and you have Terrell Owens running a curl on the outside, all you do is simply tap the right analog stick straight up and watch as the quarterback taps him rear to signal the change in routes. When you hike the ball, T.O. will now run a deep fly pattern to take advantage of the one-on-one coverage, and with the deep pass, you'll be rewarded for your correct read of the defense.     But Playmaker isn't simply used before the snap, as it comes into play after the ball is hiked as well. If you're running the ball downfield and you have a blocker leading the way, by pressing the right analog stick to the right or left, you actually tell your blocker which way to block (your player actually points!), and have a better chance of following his lead to paydirt, or at least a first down. As the quarterback, you can use Playmaker to adjust receivers in mid-route, pulling back on the right analog stick to make the receivers run back toward the line of scrimmage, pressing up to send everyone deep, or to the right or left to send them toward the sidelines and away from the crunch of the middle of the field. Playmaker control is one of those gameplay features that once you start to tinker with, you wonder how you ever played a football game that didn't utilize it before. It just adds to the amount of adjustments you can make at the line of scrimmage and beyond as now you can not only call an audible or hot route at the line, you can send men in motion, flip runs, and change the primary receivers route with the flick of your stick. And Playmaker isn't limited to offense, as just like the NFL, there are Playmakers on defense as well. Using the right analog stick, you can adjust pass coverage before the play, then gamble once the ball is snapped and tell your players to rush the line of scrimmage to stop the run, or drop back to disrupt the pass. It's definitely risky, but like the offensive Playmaker controls, definitely rewards you as well for making the right reads.  But this is where another gameplay enhancement has been made, as now it's not so easy to initially tell if a play is going to be a pass or a run. Draw plays and play-action passes have always been useless in football games as they always took too long to develop and never featured the deceptive qualities that make them so successful in the real NFL. Madden 2004 changes all of that, however, as now when you call a draw play and hike the ball, the passing icons instantly pop up and the camera zooms out like it's a pass play, and just when the defense begins to drop back into coverage, the camera zooms back in on the runner and the defense realizes that it was a running play all along. The same theory holds true for play-action passes, as the camera focuses in on the running back as he busts into the defensive line, then the camera zooms back and the passing icons pop up as the defense collapses and the quarterback zeroes in on his favorite receiver. The first time you see either of these plays, you're going to be fooled into a big gain by the offense, and the beauty of these plays is that even 50 games later, their still deceptive. Another improvement to the gameplay camera is seen when quarterbacks roll out of the pocket to the right or left. Now as the quarterback runs towards the sidelines, the camera rotates with him to show the entire view of the field instead of cutting off half the view as in years past. It sounds like a small improvement, but it makes a world of difference, especially when using Playmaker controls, as you can call receivers on the opposite end of the field back toward you in order to make the catch.      Another addition to the gameplay is the ability to change packages at the play selection screen without having to go into the depth chart or substitution screens to switch players. By changing your package you can, with the press of a button, transform your backfield from a halfback and a fullback to a fullback and a tight end or even a fullback and a wide receiver. If your star receiver is being locked down by your opponent's star cornerback, you can switch your precious T.O. or David Boston to the opposite side of the field or even hide him in the slot. This really comes into play because the game finally enables you to take advantage of your receiver's size when calling plays for taller receivers like Keyshawn and Jerry Porter. The size and jumping ability of your players is now factored in to the equation when a DB battles a receiver for the ball, so by matching up the right receiver against the right, smaller cornerback, you're using your knowledge of the NFL to set yourself up for success. Luckily, the defense is also able to make adjustments to counter the offensive moves. At the play-calling screen, the defense can now switch linebackers, swap cornerbacks to the opposite ends of the field, or change the position of your safeties. Again, the ability to change packages is a feature that you'll utilize so often, and has simplified player adjustments to such a realistic degree, it's amazing that this wasn't thought of or implemented sooner, and it makes playing games without this feature that much harder to stomach.  Beyond the new modes, the gameplay aspect that gamers will most notice and most applaud is the vastly improved play of the defensive backs. Defensive back play, and in particular, cornerback play, has always been a complaint in the Madden series as it didn't seem to matter if you had Charles Woodson or Charlie Brown back there covering a receiver, he was just a polygon waiting for his chance to get burned. Madden 2004 turns those complaints into cheers as now the cornerback position finally receives the respect and importance it deserves as the corners in Madden play more like the corners in the real-life NFL. Now if you throw into double coverage, you're going to get picked. If you try to beat Champ Bailey on an out and you throw a lazy lob his direction, Champ will not only intercept the ball, he'll high-step it back to the house. Madden, like the NFL these days, features big plays on defense and finally makes playing D fun. You feel like you can not only stop the offense, but that you can time plays right and turn the momentum in your team's favor with a key turnover. In fact, not only do your corners play better, but it's like the entire defense is more aware of what's going on during the course of a play. Some of the coolest new animations are not only the cornerbacks swatting the ball out of the hands of the receivers, but the safeties or linebackers diving for those ricocheted passes and picking off the deflections as they slide on their knees.    But defense isn't the only area that is finally open to big plays as special teams, and more specifically, punt and kickoff returns, have been upgraded to pro levels of gameplay. Gamers will finally get to utilize returners like Mason and Buchanan to score points for their teams, as not only do these players blaze down field, but their teammates actually form wedges and block the defenders. And when I say block, you'll see defenders straight getting stuck and pancaked out there as you look for a hole and burst toward that goal line.  Another big improvement over last year's Madden is the selection of plays in each team's playbook. The game finally features team-specific plays that you actually see teams run on Sunday. From the Atlanta Full House where Vick lines up with three running backs to take advantage of the Falcons awesome speed to the Steelers Trips Bunch where players like Hines Ward and Antwan Randle El crisscross their way down field to create openings, if your team features a favorite formation, you're finally going to be able to duplicate it in the game.   But while passing, special teams, and defense are Madden's strengths, the one area that needs minor tweaking is the running game. This really only comes into play during goal line situations, but when you try to rush the ball up the middle into a crowded goal line, your running back is sometimes pinballed around from tackler to tackler and seems to get lost in the endless bodies around the endzone. Sometimes the word touchdown appears, sometimes you simply get tackled, but it's that moment when your player gets lost in the masses that you feel for one of the few instances in the game, like you have no control over what happens. The running backs also lack the smooth transitions from one move to the next like Sega was able to accomplish in their game ESPN NFL Football. In ESPN a running back can go from a spin to a stiff arm in one motion. In Madden, the moves aren't linked, and if you try to pull off too many moves on the same run, you'll occasionally be penalized with a fumble. That's not to say the running game in Madden is bad, as it has some of its own great qualities including the size of the back coming into play when it comes to picking up extra yards or running over tacklers. It's really just a nit-pick I have after playing through a few seasons.    Graphics  Madden features almost 800 new animations this year, including everything from tacklers pushing ball carriers out of bounds to running backs who get tripped up actually putting their hands down to the ground to try to regain their balance, then either catching themselves and continuing their run, or losing it all together and tripping their way down to the turf.   The single-player interface has also been enhanced as now when you're picking a play, the middle of the screen is utilized to show replays, close-ups of players and coaches, or cut-scenes that highlight everything from Eddie George pounding his chest after slamming through a linebacker, to a teammate running over to help up the player who was just tackled. One oddity in these cut scenes, however, is the strange occurrence where you see the player in the game get up and start to walk back to the huddle, then the cut scene shows him on the ground and his teammate helps him up, or the opposite where the player is still down in the game and then the cut scene jumps in and you've got this guy who's still down leaping into the air and pumping his fist.   To help add to the realism on the field, you'll also see all of the tattoos, pads, and alternative helmets sported by specific players around the league. You'll even see details like Mike McKenzie's dreads and Jeremy Shockey's golden locks hanging out of their helmets. Every stadium has also been recreated down to a science, as you can actually watch the shadows in Texas Stadium move downfield as the sun peaks through the opening in the roof. Add to that the fact that the PC version features per-pixel lighting and soft shading, and there's no wonder the Madden PC players look the best of the bunch.  Sound  For a game that features the name of the most famous announcer in the history of pro football, the announce team in Madden has always suffered, and Madden NFL 2004 is no different as the team of John Madden and Al Michaels might look good on paper, and maybe even sound good on Monday nights, but their transition to the game is troubled. The main problem is when Al Michaels is talking about a team and he'll say something like ~Today's game features...~ in one tone, then say ~The Atlanta Falcons~ in a completely different and disjointed tone of voice. Also, what makes no sense is when Al's introducing the team that's about to play and starts dishing dirt about their star player. He'll talk specifically about the player's receiving prowess, even talk about where he went to college, but will never actually call the player by his name. What makes the sequence even stranger is the fact that Al will say that same player's name constantly throughout the game, so you know the name's been recorded, but in the intro Al only refers to him as ~he~. If the guy's so good, at least learn to say his name when you're talking about him.    Away from the booth and on the field, the sound gets a lot better as you hear players grunt, groan, and talk smack before plays. Some of the words are inspiring like ~ Give it all you got, sideline to sideline.~ Some are just meant to intimidate like ~Bring the pain, baby!~ or ~Is that all you got?~ Michael Vick was even brought into the development studio to lay down tracks of his quarterback cadence. I guess the next step is to do that for all the quarterbacks so you have the real voices of everyone from Jeff Garcia to Kyle Boller calling audibles in their own voice. Now that's taking things to the next level.If you only own a PC, Madden is well worth the money, as it's the best-playing football game to ever grace a graphics card. The PC version is the best looking of all of the Madden games this year, but you'll need a high-priced system to check out the high-priced graphics. You'll also need to go out and get yourself a controller with double analog controls in order to utilize the Playmaker goodness. Hmmmmaybe there's a reason why this game is king of the consoles after all. It sure is a lot easier to pop the game in a system and play.", "date": "Aug 20, 2003"}