{"name": "Dance Nation: Ministry of Sound", "name_review": "Dance Nation: Ministry of Sound", "ref": "https://www.ign.com/articles/2003/08/22/dance-nation-ministry-of-sound", "text": "Since the grand idea of cellphone gaming was introduced on 3G handsets, many genres have been attempted, and with decidedly mixed results.  Simple puzzlers and word games fly high, while fighters and racers have a tendency to crash and burn.  But the rhythm game genre -- populated by the likes of Dance Dance Revolution and PaRappa the Rapper -- hasn't really been represented in the go-go gaming fad.  So, THQ Wireless has taken it upon themselves to be that proverbial first stab, with Dance Nation: Ministry of Sound.  It's not a bad stab, at all.  Features:  Four songs from Ministry of Sound Rhythm game  Dance Nation: Ministry of Sound is not THQ's virgin voyage into the music genre. The Calabasas, Calif.-headquartered game maker tried the category on for size with Britney's Dance Beat, a very engaging, playable rhythm game that failed, well, because it starred Britney -- just as she was on her way out.  (~I'm a Slave 4 U?~ How many times could you make it through that piece of pop smear? Maybe one?)  Dance Nation: Ministry of Sound smartly excises the pop tart for a band with actual talent, and a catalog of pretty good songs to choose from. But it does smartly resurrect the game engine from Britney's Dance Beat, and since it works so well with a good band, proving that THQ was really on to something.  When you start Dance Nation: Ministry of Sound, you can pick from four songs - ~She Moves (La la la),~ ~Music Makes Me Happy,~ ~Like Blackwater,~ and ~Return of Nothing~ - and then immediately hit the dance floor.  A generic hip-hop hootchie stands in the center of a giant wheel, as gyrates as you nail the beats by pressing the appropriate number key when a colored swatch rolls over it.  Why she's there -- no idea.  Perhaps it was a hold-over from the Britney days.  The game is incredibly easy to pick up and just start playing, and that's probably why it works so well, even on limited hardware like a cellphone. THQ Wireless was wise enough to only assign a few numbers to the rhythm wheel, so you don't throw the whole thing down in disgust when your bananahands keep hitting the wrong digit.  The first song will have you only alternating between ~4~ and ~6.~  Of course, the key to any music game's success is the actual tunage.  Really, did PaRappa actually offer that great of game play?  No, it was the infernal catchiness of ~Kick, punch, it's all in the mind~ that got everybody jamming with the paper-thin puppy.  Ministry of Sound's numbers are definitely catchy, and the phone we tested the game on - Motorola T720 - impressively didn't botch them up.  Sure, it ain't like listening to a stereo, but you definitely know what song is on without having to trust the song select screen.A surprising success. Not the game, per se, as it's based on a very smart dance game engine. It's a surprise that a rhythm game actually works on a cellphone, where you would imagine the the genre would flounder. THQ Wireless pulled off a minor miracle here, but helped along the way by Ministry of Sound, who provided a short catalog of good songs that actually sound decent, even when run through whatever goofy MIDI processor THQ employed to squeeze them tunes down to an acceptable level.", "date": "Aug 22, 2003"}