{"name": "Rider X 3D", "name_review": "RiderX 3D", "ref": "https://www.ign.com/articles/2003/09/04/riderx-3d", "text": "We railed pretty hard against MLB Slam, Blue Heat's baseballer, for looking so rudimentary.  But at least it bails itself out with an impressive little game of baseball. Reaxion's Rider X 3D, which tries to fake the 3-D funk, also looks incredibly last-gen. Does it save itself with a decent snowboarding game?  Features: Create your own rider Freestyle, Arcade and Championship modes  Again, we're faced with a game that can hardly be considered a looker. The rider looked like he/she/it was drawn in the basic paint program that comes with Windows. The half-pipe is very uninspiring. In fact, the opening menus look better than the game itself.  But the catch is, and always is, how does it play?  And the answer to that, ladies and gentlemen, is so-so. Control is actually where this snowboarder stumbles, as it's hard to pull off the combos the game claims you can make since the tricks are assigned to the number pad.  Use ~4~ and ~6~ to move you ride from left to right, gaining momentum in the half-pipe. When you build up enough speed, launch yourself out of the tube and use the other number keys to pull off tricks like rodeos and indies.  It's not as easy as it sounds, especially since the tricks don't seem to flow together very well. Nor does it seem that the controls are terribly responsive. In mid-air, we tried to do a couple of tricks and a twist, but it was no dice. We ended up face-planting it in the powder several times.  The create-a-rider mode is slightly intriguing. We're not used to customizing handset games that often, so it was nice to see there were some options in designing our ride. There are several faces to pick from (not that you'll see them in the game, nor does the choice of gender affect the player model), you pick pants color, and give your avatar a name. Use this rider throughout the game to earn cash and buy board upgrades in the shop.  Arcade mode is a straight forward pass down a mile-long half-pipe. Freestyle gives you a never-ending track, no time limit, and unlimited falls -- the best way to get the hang of the controls. Good luck with that.  Championship mode throws you into a tourney with other riders. You can opt to watch their runs down the pipe, or skip out and just view their scores. When it's your turn, beat their records for cash.  This actually adds some depth to the game, as there are several tourneys to enter.  Surprisingly, there is some decent audio in the game. The opening melody is nice, and the jingle between championship runs is decent. Too bad there's no sound to accompany your run down the pipe, but, well, that's the way the cookie crumbles. What the ~X~ stands for, I have no idea. Probably something XTREME. The game is not the complete flop you suspect it is on first boot up. Sure, the visuals are borderline insulting (that rider model has got to go), but the Championship mode and board shop are intriguing additions. If you're really into snowboarding, give this a try. Otherwise, wait for Activision to port their icy X-Games to your handset.", "date": "Sep 4, 2003"}