{"name": "Hunter: The Reckoning Wayward", "name_review": "Hunter: The Reckoning Wayward", "ref": "https://www.ign.com/articles/2003/09/09/hunter-the-reckoning-wayward", "text": "Xbox and GameCube aficionados may remember last year's thrilling four-player action/horror title, Hunter: The Reckoning. It was a bloody and filthy monster-hunting fiesta set in ~The World of Darkness~ created by the pen and paper geniuses at White Wolf Publishing. Part of the same universe as fashionable licenses Vampire: The Masquerade and Werewolf: The Apocalypse, Hunter: The Reckoning is among the most successful tabletop RPGs of the modern era. Not surprisingly, it continues to grow in popularity at an accelerated rate and has managed to be just as prodigious on the videogame front as it has been in book form. With a performance like that is was only a matter of time before the insatiable console audience was treated to a sequel, and what better time to unveil it than at the beginning of the hobby's busiest of seasons?   Which brings us to the release of the first such follow-up, Hunter: The Reckoning Wayward. A PlayStation 2-exclusive and direct sequel to the original, Wayward continues the tale of Deuce, Samantha, Kassandra, and Father Esteban as they blast their way through the infested innards of Ashcroft. Picking up two years after the events of the Xbox and GameCube version, Hunter, Part 2 finds the quartet summoned back to their old stomping grounds in an effort to locate a pair of ~wayward~ hunters. Missing for unknown reasons and the proponents of a panicked distress signal, the misplaced hunters' reason for disappearing is more complicated than our heroes first think.   And much to our enjoyment, so too is the game. Taking mechanical ideas first explored in the earlier title and expanding upon them quite effectively, developer High Voltage Software is out to repeat the first Hunter's success. Though this PS2 sequel isn't without some of the same problems of the original in addition to a couple of technical issues, it still does a great job of capturing the more than its fair share of action, depth, and atmosphere.    Gameplay  From a gameplay standpoint, the whole premise behind Hunter: The Reckoning is to wipeout whatever evil creature gets in your way. Whether it's a member of the undead, a cultist fanatic, or some kind of indestructible behemoth, your job as a Hunter is to kill the bad guy. There are tons of them to face off against too, with all sorts of different strategies needed to destroy them. Casting the right spell, blasting them with projectiles, or using your sword for old-fashioned hacking and slashing is pretty much the order of the day. And to say that it can get intense is an understatement.   Heavily borrowing its elements from titles like Total Carnage and Super Smash TV, Wayward combines those aspects with the melee fighting of Dynasty Warriors and the item retrieval of today's popular adventure games. Uniquely set up so that the action is performed with shoulder buttons, The Reckoning's style will definitely take some getting used to if you didn't sample the Xbox or GameCube versions. Working on a simple three-tap combo system in conjunction with a relatively easy charge-combo, the primary fighting technique in Wayward is performed up close. And though it's less dependant on projectiles than the last installment, it still provides an equally basic weapon system with limitations on ammo and a scarcity on refills. Players can then aim and strafe with the right analog stick and leave the remaining buttons open for whatever they like.   It's this new control scheme that serves as the sequel's biggest asset. As one of the original's principal criticisms was the need to use the face buttons to cycle through and then confirm different weapons and Edges (magic) before being able to attack. This clunky quick-menu switch-system made changing attacks under heavy fire extremely difficult and drained valuable seconds off your reflexes.    But that won't be an issue anymore. As L1 now serves as the Edge button and L2 allows your character to jump. On the other side of the spectrum, melee and projectile attacks have their own designations on the R1 and R2 respectively, and the face keys allow players to switch their Edges and weapons without taking their fingers off the attacks. The result is a more reactionary and faster inventory system that allows you to think on your toes and not have to worry about being caught in a crowd.   Character classes are more diverse too, with differences that actually show up in the gameplay. Deuce, for example, is an absolute monster during group combat but gets his ass handed to him from distances. Kassandra can zip through stages extremely quickly if you need to avoid your pursuers and Father Esteban is a terrific Edge-casting support character. Unfortunately Samantha is just as dominant here as she was in the previous game, and while her potential may not be as high as the rest of the characters, she does everything so well that it doesn't really matter. Luckily scrubs that resort to using her will be happy to know that the Nightmare difficulty setting will make short work of her unless they know what they're doing.   One bonus that we're particularly fond of is the decreased linearity of the missions. Rather than have the game dictate what stage you travel to next, players can choose where to go via the open-ended hub system. Represented by a hotel room (and later a prison security office), gamers have complete control over their character's destinies. Trophies earned for solid performances, cinematic cut scenes, informational tidbits, and a handful of other Easter Eggs can all be accessed from a single place without having to beat the game. On the same token, players can also decide where they want to travel to via the hanging map and decide whether they'll return to areas they've already been or skip over some sections completely. It's a feature that the first game could have used pretty badly.    Also entertaining is the diverse mission structure. While it's true that your primary goal is to kill everything in sight, most stages oblige you to do more than just that. One area for instance, requires you to find and save innocent bystanders before they can be offed by a lunatic sniper; while another forces you to protect a weapon smith from a horde of oncoming rots so that she can make a set of silver bullets. Truthfully these are all just distractions from a larger, more repetitive gameplay structure. But for the most part it works -- and when paired with a collection of super tough boss fights and the creative use of map obstacles manages to fight off the reiteration curse longer than usual.   But that's not to say that Reckoning Wayward is all chocolate and roses. As there are a couple of technical and aesthetic hang-ups that hold it back from its full potential. The biggest of which would have to be the exclusion of four-player co-op. A major feature push for the GameCube and Xbox prequels, the original's ability to support four people on a single screen has been nixed in favor of a two-player option. Most likely a decision that was made to save the framerate from a slow and agonizing death, it's still a step backwards when your sequel lacks one of its predecessors strongest selling points.   Another bump in the road is the similarity that Wayward has to the first game in terms of levels. Diverse as they may be in structure, a lot of the stages from the Xbox title have made their return for the PlayStation 2 installment. It's not a huge deal if this is your first experience with the Hunter series, but for those of us who played the original it gives off the distinct impression of a rehash. Other issues like a sometimes-asinine auto-camera, less than stellar collision detection, and a legitimate full-system crash while playing mid-level in a retail copy make us wonder just how good this one could have been if it had more tightening.    A lot of the above issues are understandable and can be overlooked in the right circumstances, but for a crash bug to make its way into retail code without getting fixed -- now that's just plain uncool (luckily, it happened only once in our 15 hours of review time).   Graphics  Wayward's Xbox predecessor definitely has the edge in terms of visual quality. As this PlayStation 2 sequel has nowhere near the same level of texture detail or smoothness of animation. While the original Hunter boasted a wide array of excellent lighting effects, highly detailed character models, and top-notch production values, the follow-up is a generous step behind. It seems that the game's most glaring problem comes by way of slowdown, as it chugs along at a decidedly robotic rate when too many enemies surround the player. It won't be an issue for most of you if Hunter is played on the Easy setting, but give it a try in the Normal and Nightmare difficulties and you'll definitely notice.   Those issues aside, Wayward's graphics engine is still pretty impressive. As despite the slowdown there are an enormous amount of objects pushing the PS2 hardware at all times. Dozens of rot zombies, spider-like skitters, nefarious Ghost Knives, and other such beasties approach your squad from every angle imaginable in massive groupings, while being supported by appropriately dark and moody locations. And though the stages aren't as interactive or populated as the Xbox opener (less things will explode or break and spilled blood immediately disappears), they fit the storyline and characters perfectly.    But it's the art direction and design that truly stands out. Ripped from the White Wolf handbooks and illustrated guides, each and every protagonist (good or bad) looks exactly the way it's supposed to. Gritty, bloody, and dirty, the game does a great job of convincing you that the world has gone to hell and, besides the choppy animations we mentioned earlier, pulls you in from the very beginning. Take one look at the horrifying Machine Boss or twisted War Ghouls and you'll be sure of it.   Sound  Much in the way that Resident Evil and Silent Hill use sound effects and occasional music for scares rather than a full-on score, Wayward's audio presentation is all about ambiance. Dripping water, muffled groans, werewolf howls, and other creepy noises are pretty much the dominant set piece while slashing the bad guys. What stands out most, however, is the weaponry audio; clanging metal, squishy flesh, and the booming thud of guns and grenades fill the night air like a Discovery Channel Civil War documentary.   But that doesn't mean that Hunter is light on the music side. As one of the game's recurring sub-quests requires you to find hidden audio files that unleash tracks you can play for the hub world. Artists like Portwine/Stasica and No One fill the voids appropriately with Industrially-influenced Hard Rock (the ~Plantula~ piece is awesome), and situations that see your characters surrounded by enemies kick off a somewhat-dynamic panic track to illustrate how dangerous your situation is.   The only real complaint we have in this department is how the voices have been recorded compared to everything else (adjust the options all you want, the vocals will still be muted). Recorded in Dolby Pro Logic I, everything sounds solid for sure, but when it's hard to tell what everyone is saying, it can make watching the cinematics somewhat difficult.   Surely Hunter: The Reckoning Wayward lacks the sheen and production value of its Xbox predecessor and its tendency to repeat locations from that build could prove bothersome for returning veterans. And yes, framerates in the more populated areas do get on our nerves and the various other technical issues didn't help much either. But when taking the good with the bad and weighing in both sides as fairly as possible, Hunter: The Reckoning Wayward is still more than a worthy sequel to Interplay's starter from 2002.Because honestly, for fans of the action genre there's little that Reckoning doesn't provide. Sporting a total of six diverse character types, a boatload of varying weapons, tons of different magic spells, and almost 30 assorted stages, it can definitely hold its own. But dig down even deeper that you'll truly begin to appreciate what benefits it has to offer -- an incredibly challenging Nightmare setting, solid character designs, intelligent controls, and old-fashioned arcade shooting and slashing to name but a few of them.The Reckoning Wayward is a great holdover for returning fans of the series before the Xbox sequel Redeemer hits stores later next month. But newbies shouldn't worry either; there's enough here to satisfy them as well. Give it a try and let the Reckoning begin!", "date": "Sep 9, 2003"}