{"name": "PES 2008", "name_review": "Pro Evolution Soccer 2008 Review", "ref": "https://www.ign.com/articles/2008/03/17/pro-evolution-soccer-2008-review-4", "text": "Sports games have fallen on rough times with this generation of consoles. Moving into the high-definition era has caused many headaches for the developers of our favorite sports franchises and it has taken quite some time for the quality to rise to the level that we had become accustomed to on the last round of consoles. With increased visual fidelity comes more rigid animations and less realistic looking action on the field, at least that seems to be the case. Now we're a few years removed from the introduction of new hardware and sports titles are just starting to show signs of the quality from yesteryear.    Case in point: Pro Evolution Soccer 2008; formerly known as Winning Eleven. EA's FIFA series has been struggling to find its groove in the arena of football games for quite some time, and while it has certainly nailed high quality production values, it's Konami that is the first to score a goal in terms of gameplay. The list of features may not have any true standouts but it's tough to argue with the sheer amount of fun that can be had with a game of Pro Evolution Soccer 2008.   The start of a slide.  Remember back when the series carried that cumbersomely long name? The entire structure of Winning Eleven seemed to be as convoluted as its name with confusing menu systems and an uninviting presentation style. Those days are long gone thanks to a new title and a revamped batch of production values that lend themselves much more to the high definition landscape of today's videogames. From the introductory cinematic it's readily apparent that things have been taken up a notch. While they don't yet approach the level of new-age camera movements and menu integration that EA Sports brings, Konami has certainly made strides.   But Winning Eleven isn't about highly stylized menu systems or fancy video edits -- it's about delivering fun and realistic football. Last year's title fell a bit short as it struggled with the new Xbox 360 hardware, but PES '08 roars back with some of the best gameplay we've seen on the system. Animations are tight and efficient without being over-the-top and flashy. Some of the interactions between players are so realistic it's downright scary. Incidental collisions that actually look incidental are fantastic to watch. Goalies that charge out to tackle a one-on-one situation, sending the stampeding forward vaulting over can make for a cool sequence. There is stuff so awe inspiring that I had to make use of the save function in the replay system on more than one occasion.   There seem to be a limitless amount of physical interactions and animations that can take place. Slide tackles always look just a little different than the time before and the repertoire of ways to score the ball is only limited by your imagination and your ability to actually put the ball in the back of the net.   'Keep sacrifices the body.  The animations and physics system that drives the gameplay of PES '08 is what really separates Konami's football offering from EA Sports'. You never feel like you're running on rails, you always feel in control of what your players are doing, and it's incredibly rare to see the AI misbehave through the course of the game. Teammates make the appropriate cuts and runs to get open and defenses will adapt to your play to try and seal up weaknesses in their line.   The myriad of moves that can be pulled off on the pitch is daunting at first, but once you get your bearings and find your way around the controller things are reasonably natural. The biggest problem most will have is remembering exactly what everything does. There are shoulder button modifiers which can change your cross or shot in different ways, not to mention the right analog stick which acts as a sort of toned down trick stick.      As far as features go there isn't a whole lot here that wasn't present in last year's game. You'll still find Exhibition, Master League, Cup, League, and Online modes to toy around with; Master League being the real attraction for football diehards. While there is no ~superstar~ mode called out by name, the Master League allows you to create a player and sign him to your favorite team either through negotiations or by what I call the ~Hand of God~ technique. You can then watch your created stud and the rest of your squad develop over time. There are small cinematics that introduce important events like Cup games or playing against a rival squad and they help flesh out the experience considerably. Other nice touches include having a weekly fan snapshot placed on your home Master League screen. Small details like this making their way into Pro Evolution is a big step into creating a realistic managerial experience.   The Master League is the deepest in the game, even stretching as far as asking players to select the athletic peak for the life of their created fledgling star. Now if only there was the ability to simulate games or seasons to expedite the progression process a bit. As it stands you're stuck playing through an entire season, a process that can be more than a little taxing on one's social schedule. There's no way to change difficulties mid-Master League. This is extremely disconcerting as your skill progresses. Ideally you'd like to keep changing the difficulty as you progress to keep it challenging, but that's not possible here.   Get off me, bruh!  Negotiations are one aspect of Pro Evolution that could have been fleshed out. The process of signing players isn't nearly as fun as it should be. I'd like to see some options for courting players onto your team in some way. Maybe promising a fancy apartment or car to your new star would work? Pretty much anything beyond the current process would be an improvement.   The other modes in the game are standard fare. Cup allows you to hand pick a set of up to 32 teams and pit them against one another, something that should be possible in Master League but for whatever reason isn't. Instead you have to choose from a preset group of leagues and teams. Exhibition mode allows for up to four players to join up and play on 360 whereas PS3 owners can link up with seven total players. The online mode, which still features the lag that we saw in the last year's game, is limited to two players.    The biggest problem that some football enthusiasts will have with PES '08's gameplay is that it doesn't change much of the formula that was used in past Winning Eleven titles. There are no substantive additions to the career mode, no newly designed camera angles, and no improvements to the online mode. Still, those searching for old school football needn't look any further.   The Orangemen of football.  Aesthetically speaking -- aside from the aforementioned bump in presentation -- PES is a mixed bag. Some of the player models look awesome when compared side-by-side with their real life counterparts while some look just plain odd. The animations are stellar and there is never any clipping or wonky physics at work, but the framerate is something of a concern. When the camera pans around during replays the number of frames per second drops like a stone, making some of them nearly unwatchable. During general gameplay there's rarely a hiccup, but it does happen.   On the audio side the commentary is still solid, providing insightful input wherever available while not sacrificing accuracy. The crowd noise leaves a bit to be desired, though. The raucous European fans chant and cheer at the appropriate moments but it's never as over-powering as it would be in an actual match.  Pro Evolution Soccer 08 is what every sports fan wanted from the inaugural batch of titles from a few years back. PES 08 houses the same fluid and responsive gameplay that made Winning Eleven 9 one of the best football games ever made, only now it has some production values to match. The offering of modes may not have a standout or one feature that was obviously the focus of development, but it has more than enough to satiate the appetite of the many rabid football junkies of the world. For this years best virtual football and a return to form for one of the staples of our industry, look no further than Pro Evolution Soccer 2008. It wont disappoint.", "date": "Mar 17, 2008"}