{"name": "Rippin' Riders", "name_review": "Rippin' Riders", "ref": "https://www.ign.com/articles/1999/11/10/rippin-riders", "text": "Okay, I'll admit it right off the bat.  I've never been snowboarding, and I never plan to.  I don't know . . . there's something about sliding down a cliff to my potential death that just doesn't click with me.  That's not going to affect this review, though.  After all, it's not like I've ever been to Alaska for some Tactical Espionage Action, nor have I ever been to Emerald Coast Zone for some whale chasing and loop-d-looping, and I sure as hell enjoyed Metal Gear and Sonic.  Thankfully, the Dreamcast, the Dreamcast controller, and UEP Systems have joined forces to bring the snowboarding experience home in the form of Rippin' Riders.  And guess what?  The game's a total riot! Rippin' Riders is actually the US version of Japan's Cool Boarders Burrrn, the name change probably attributed to Sony's exclusive rights regarding the use of ~Cool~ and ~Boarders~ in conjuction with one-another this side of the Pacific.  Regardless of the change, US gamers get the exact same game Japanese gamers got this past August, with addition to two licenses from Salomon and Bonfire, which are manifested in the form of various billboards here and there throughout the tracks.  Everything else is in there, from the characters, to the ~WHOA, DUDE~ commentator, all the way to the exact same tracks and boards, so if you've played through the import, you'll know what to expect of this version.  For everyone new to the game, though, the premise behind Rippin' Riders involves your heading out to to the slopes, racing both for time and score.  The tracks are the game's brightest feature, as they're absolutely huge, filled with multiple paths, and varied graphics.  The first track is a good example, as you'll find yourself, as you go from the barren peaks of a mountain down to the depths below, gliding past cabins, trains, and through caves.  These beauties are easily one of the system's highest graphical points.  You'll be amazed.  Beyond sheer size and beauty, though, the tracks have moving obstacles like falling boulder and pillars, as well as plenty in the way of leaps and jumps.  You can select from six characters, each with their own rippin' look and style (personally, I like Bob - the guy's definitely on something).  Each character is rated on jump, technique, power, balance, quickness, and max speed, and each has multiple costumes, just for good looks (hey, if you're going snow boarding, you gotta look cool, even if that means wearing a tank top).  There are, from the outset, nine snowboards available to all the riders, classed according to their area of most use, including free style, all round, and alpine.  You'll actually find that some characters and boards are better for playing through the tracks for time, while others are better for playing through for score.  The result is that you'll need to make use of a good number of both characters and boards if you want to unlock all the game's secrets, including new characters, tracks, and the uber-board itself.  So how exactly do you get a good score?  By doing tricks, of course.  When airborne, pressing various buttons on the controller will give you access to various grabs, spins, and flips, with such curious names as ~indy,~ ~mute~, ~tail grab~, ~tweak,~ and ~melancholy.~  Hmm . . . is this some kind of strange language or something?  Anyhow, each individual character can combine these moves in a couple of ways for an ultra-high-scoring combo.  I must admit that the area of tricks is the game's largest flaw.  It can be very difficult to train yourself to do the various tricks, and UEP hasn't made things any easier by forgetting to include a training mode of any sort (maybe something where you snowboard down an endless, straight track filled with jump after jump).  You may find yourself frustrated before you've explored the game's depths, and even once you think you've mastered things, you'll still probably have trouble with the somewhat awkward input system.  If you can overlook this problem, though, you'll find a lot of fun in the various tracks and characters.  There's also a super pipe mode, where you perform nothing but tricks, trying to earn a high score.  And, let's not forget about the game's unique two player mode.  You and a friend can race free style in both horizontal and vertical split screen, or you can compete using a unique system in which doing tricks shrinks your opponent's area of the screen.  This version of the two player mode becomes intense with time, and forces both players to give their all throughout, as tricks can be done everywhere on the course.  The immense tracks, two player mode, and wide variety of characters and boards should manage to make you overlook the flaws involving the awkward trick controls.  I'd personally have liked a few more tracks in there, and maybe a larger default set of courses to begin with, as well as a means of playing the two player mode against the CPU.  Regardless of these problems, Rippin' Riders is a good time on your Dreamcast, even if you plan to stay as far away as humanly possible from the real thing.  -- Anoop Gantayat, IGNDC", "date": "Nov 10, 1999"}