{"name": "Dino Crisis 3", "name_review": "Dino Crisis 3 Review", "ref": "https://www.ign.com/articles/2003/09/16/dino-crisis-3-review", "text": "is not one of Capcom's premiere franchises. The DC series has its following, but is nowhere near the phenomenon of Mega Man or Resident Evil. That's in part because the previous  DCs were good, but not great. Capcom decided to make some changes to the series and try to turn it into a true blockbuster franchise. The graphics were given Xbox polish, new controls were added, and a more ferocious breed of dinos was brought into the mix. Throw all that inside one giant transforming ship and a hit is indeed a possibility.   Unfortunately, Capcom's latest  Dino effort is more miss than hit. While this may not make the franchise extinct, it certainly isn't about to draw new fans with -- what I will repeatedly refer to in this review as -- The Worst Camera Ever. And yet, Dino Crisis 3 has some great things to offer. Can the good overcome The Worst Camera Ever?  Features Explore the massive ship Ozymandias and battle scores of dinos! Puzzle elements involve transforming ship to reach new areas Gorgeous cut-scenes and shiny metallic walls will have you going both ~ooh~ and ~ahh~ Static cameras will have you going ~errg~ and ~&^$%!~ Surprise appearance of velociraptor-like dinos will have you saying, ~Clevah girl...~ Unlock extra game modes for prolonged pleasure  Gameplay Dino Crisis 3 takes place several centuries in the future as a three-member Special Ops team explores a derelict ship, the Ozymandias, which emerges from nowhere following a 300-year disappearance. It's destination -- Earth. Patrick and his investigative crew walk smack-dab into a nest of mutated dinosaurs (you know, even ~non-mutated~ dinosaurs probably would have freaked them out). Now Patrick and crew must solve the Ozymandias mystery before it's too late! (Exciting, isn't it?)  Strategy Guide Available!   Make them all        extinct!     Our complete walkthrough        comes with loads of screenshots, item location, expert tips, and secrets to beating        the baddest bosses in the game!   Get The Guide | See Other Guides  For the majority of  Dino Crisis 3, you play as Patrick, though there are a few moments where you get to play as teammate Sonya (yes, the requisite hot and fiery female member of the trio). Patrick comes equipped with a jet pack that lets him dash left and right and glide for short periods of time. Of course he also has several guns (three total) and three varieties of WASPs, little AI-controlled machines that help kill enemies.  A rare moment when the enemy is seen on-screen  Control is very simple and easy to get the hang of and is surprisingly fun. With a half-dozen mutant dinos surrounding you, the ability to get airborne and quickly dodge is essential to gameplay. And Capcom has thrown in loads of platforming chores that require intelligent use of your gliding ability. But these positives are cancelled thanks to, you guessed it, The Worst Camera Ever.  Capcom is famous for its static cameras. Rooms are divided into invisible zones. Each zone of a room is regulated by a camera in a set position that cannot be moved. There's no manual camera options whatsoever. This is the case in many Capcom games including the Resident Evil series. But in Resident Evil, Jill Valentine moves almost as slow as the zombies so that the static camera isn't nearly as bothersome to your sense of direction or as disruptive to your actions. Not the case in Capcom's Crisis , where action is intense and your speed and mobility has you moving around the room quickly.  There are far too many moments where you will be flying towards a platform you need to jump to and the moment you are about to jump you hit a new camera zone, so the perspective flips 180 and you are suddenly pushing back instead of forward and your sense of positioning in the room is scrambled. Platforming, at times, seems almost impossible thanks to The Worst Camera Ever.       On top of this, about 80% of the time you are shooting at enemies who are not on screen. You are trying to dodge attacks coming from off screen. The only thing that makes combat remotely functional is the auto-target feature, which intelligently locks on to the nearest target and rarely misses. Since the dinosaurs are so tough in the game, you need to hit them dozens of times before they die. It's a challenge, both in terms of the actual gameplay and because of The Worst Camera Ever.  I hate to admit it, but I enjoyed a lot of the combat in Dino Crisis 3 despite all of the flaws. It's intense, it's persistent, and it's not afraid to be challenging. It's likely many people will want to enjoy the game more than it deserves and, like me, will be able to ignore The Worst Camera Ever and finish Dino Crisis 3. That's because outside of this major flaw, there's a lot of promise here The giant ship you are on, the Ozymandias, is, in itself, one big puzzle. Formation Change Terminals can be found in certain areas that allow you to change the very structure of the ship. Suddenly a room you couldn't get to is now accessible. On top of the standard fetch puzzles, Dino Crisis 3 has this overall jigsaw that you must continually manipulate. Brilliant.   What's not so brilliant (aside from The Worst Camera Ever) is the lack of variety in enemies. As far as dinos go, there are only three non-boss dino-types in the entire game. Granted, there are quite a lot of very cool and inventive dino bosses, but most of the time you will be facing off against the same three types of dinos... again and again. If Jurassic Park proved nothing else, it's that there's a slew of dino terrors out there. How hard would it have been to put three more in the mix for variety's sake?  The bosses are great and most of the boss fights offer good cameras, which is a blessing, because these are some of the toughest bosses around. While they tend to only have a handful of attacks, the key to success is less about timing and more about avoiding attacks and constantly pounding the enemy with gunfire. If Capcom's goal was to have it feel like you were attacking a bus with an air rifle, congratulations. That's not meant to be a slam, I really do think they did a great job making the dinosaurs imposing. Perhaps too imposing for casual gamers.  If the camera were improved, a few more enemies added, and some unique environments thrown onto the ship (like a synthetic garden, what have you), Dino Crisis 3 would be a good game. Maybe not a great game, but certainly a good game. Instead, Capcom gave us this mess.  Awww, come on, I'm wearing gloves! Pleeeeeease?!  Graphics Capcom has proven they can do amazing cut-scenes and that's no different with Dino Crisis 3. The rendered cinematics are drool-inducing with giant a CG T-Rex slobbering as he looks down on their latest meal or a titanic ship performing an intricate transformation in the blackness of Space.  In-game, there's still plenty to admire. Though the game doesn't always run smoothly, the environments offer some impressive shimmer (perhaps even too much shimmer) and the weapon and jetpack effects are nice. The developer's did their best to make each room feel somewhat unique and the varying structures are nice, but the ship doesn't appear like anyone could ever have lived in it. If there were once people operating this ship (instead of 20-foot tall 'saurs) then they must never have eaten, because there's no garden, no cafeteria, nothing but rooms that would keep the ship alive as opposed to people. It would have been easy enough, in keeping with the game's premise, to throw in an aviary or a mess hall, or a rec room, or a garden -- something to give the design variety -- but none of that exists in the 50+ room Ozymandias.      The dinos themselves look cool, but the lack of variety here also hurts. With only three regularly appearing dinos to battle (the best being the simian-esque dinosaurs) the only real bonus is the beautifully created bosses who, of course, get special attention in CG cut-scenes. Good visual candy, but the visuals are a bit too limited.  Sound Surprisingly, one of the best sound features is the voice acting -- In a Capcom game?? Sure, no one in the group of voice actors is going to be nominated for an award anytime soon, but the English voices (even the Japanese version is dubbed in English) are pretty good. Sometimes they sound a bit corny, but nothing so bad as to cause night tremors.  The score is also not bad and kicks up when enemies appear. Still, like the visual design, it's a bit limited to only a handful of pieces so you continually hear the same tunes again and again until they become meaningless. If anything is lacking here, it's the sound effects. Capcom has shown brilliance in creating atmosphere through sound in the past, but here the opportunities are wasted. The sound effects are passable, but never manage to create a proper mood for the derelict ship or the dangerous situation these three people find themselves in.Having played through the Japanese version and the U.S. version (yeah, I went through this sucker twice!), I can't get over how close Capcom came to a winner. The level design is great, the bosses are cool, the cut-scenes are stunning, and the puzzles are inventive. The lack of unique ~grunt~ dinos makes combat get a bit too redundant and the camera is horrid. I can actually live with not seeing my enemies, but simply trying to gauge perspective and jump across a small gap should not be an impossible task -- Certainly not when it makes up half the gameplay!After the Japanese release (and subsequent dissatisfaction by those who played the game), Capcom had time to go in and at least try and repair some of the problems. Instead they spent half a year, apparently, on text translation only, because that's about the only thing that's changed. What Capcom has is a failed game that offers more frustration than joy and the only true satisfaction after playing through the eight hour quest is that fact that you survived. Finishing the game should earn you t-shirt that reads, ~I survived Dino Crisis 3 and all I got was The Worst Camera Ever~.", "date": "Sep 16, 2003"}