{"name": "Anarchy Online", "name_review": "Anarchy Online: Shadowlands Review", "ref": "https://www.ign.com/articles/2003/09/18/anarchy-online-shadowlands-review-2", "text": "With a development team quoting everything from Dante's Inferno to Akira as inspiration, it was clear from the outset that Funcom intended to attempt something a little bit different with this expansion, the question is have they been successful? In short, yes. This expansion, whilst not without its frustrations will very pleasantly surprise an awful lot of people, providing they are willing to give it a go.   Let's get it out of the way now; Anarchy Online's original launch in 2001 was nothing short of terrible. It still stands to this day, as an object lesson to would be developers on how not to launch a massively multiplayer on-line game. It was a bug-ridden, content thin, unbalanced mess, and whilst some saw a glint of potential shining through, the games reputation was not undeserved.   However, that was then and the beauty of online games of this nature is that the developers get a chance to correct wrongs and repair damage. Those that saw the potential in Anarchy Online were not wrong, and if the launch was a lesson to developers, the subsequent turnaround and revitalisation of the game is a lesson in how a development team can get it right by listening to their players and working hard.   Even before the release of this expansion, Anarchy Online had garnered several awards and was beginning to make ground on its more established rivals like Everquest and Dark Ages of Camelot. So what now? Can this expansion hope to bridge the gap and move Anarchy Online onto the next level?   Shadowlands finds the scientists of the planet Rubi-Ka discovering portals into a new and mysterious dimension that is related to the planet itself in some way, but very, very different. You, of course, have the task of exploring this strange new world and trying to discover the truth behind the motives of the two races that occupy the Shadowlands. The Redeemed and Unredeemed populate the Shadowlands and the power struggle between these two factions is what drives along the story element of the quests and adventures contained within the Shadowlands.   In terms of gameplay the expansion offers dozens of new playfields for all level of character from 1 to the new limit of 220, two new playable character classes (called 'professions' in Anarchy Online), a new perk system that allows further customisation of your character as well as the obligatory flood of new items, armor and weapons for the players to discover. The game engine itself has also been given a serious overhaul.   The first thing that strikes you about Shadowlands is how uniquely gorgeous the whole affair is. Even without a powerhouse of a PC even the starter areas are simply stunning. Spires of rock cut paths and cliffs out of the strange alien landscapes and as you progress through the six themes of the Shadowlands each set of zones brings a starkly different set of environmental conditions.   From the starter area of Nascence, through the lush paradise lost of Elysium, the rugged desolation of Schoel, the underwater city of Adonis, the icy plains of Penumbra, the volcanic wastes of Inferno, to the final chaotic maelstrom of Pandemonium, much thought has gone into each area and the little environmental effects constantly surprise you, like your characters breath being visible while in the freezing environs of Penumbra, or your view shimmering in the heat of Inferno.    Also worth a mention is the city that has been added to act as a 'gateway' between the Shadowlands and the existing world of Rubi-Ka. The city of Jobe is actually three islands that float in the ether itself above the planet -- the design of this city is awe-inspiring and the views from the top island are some of the most stunning you'll see on your monitor anytime soon.    I can barely stress enough how impressive the area design is, especially for an MMORPG; it really is up there with any other game you care to mention. Funcom have pulled out all the stops to make Shadowlands a visually stunning experience and they have succeeded. Visually the only thing that continues to disappoint is the special combat effects, a flaw that hasn't been corrected in the expansion, but given the beauty of everything around, you tend to not to notice that your massive fire attack or suchlike doesn't come with a special animation.   Gameplay wise, Funcom have taken a risk for an MMORPG in that the progression through Shadowlands is distinctly linear. Whilst this sounds every bit as alien to a veteran of the genre as the landscapes themselves, in reality the gamble seems to have paid off. The player embarks on an ongoing story through the Shadowlands as a series of quests opens up access to the next set of zones and the players are embroiled in the story of the battle between the Redeemed and Unredeemed. This leads to a level of immersion that is not often found in the genre. You come to care about the conflict and feel a sense of allegiance to your side as your sponsors send you on more and more challenging quests.   Numerous side quests can be completed to attain access to rest areas (called Gardens and Sanctuaries) that allow the players to both save their progress and travel between the various themed areas -- meaning that you can by-pass much of the tedious running back and forth that plagues other titles. There are also quests to upgrade the player's nano-technology and armor as they progress and grow stronger.   This abundance of things to do marks a definite change of direction for Funcom, and addresses one of the most common criticisms of the original game, the repetition of its mission system. Whilst Funcom's auto-content-generation system is a god send for the casual gamer, it did mean that for the more dedicated gamer the Anarchy Online experience could quickly pale by doing countless missions that didn't vary all that much.   Funcom have also addressed one of the other problems that all MMORPG's face and that's the general sense of bewilderment that new players are meet by when entering a game as complex as a MMORPG. The expansion introduces a new GUI (which has also been made available to all players whether they upgrade or not) that is a much more user-friendly affair, and will have a more familiar feel to newcomers to the genre.   They have also made the character creation process interactive with a series of dynamic help prompts, and a 'shuttle station' that, rather than having you make starting choices from a menu, finds you running around a space station finding out more information about Rubi-Ka before you make your choices by using one of three exits to the surface, allowing you to start on the old world, or start your new character straight in the Shadowlands.   The expansion also offers two new professions, the paladin-styled Keeper, and the vampiric assassin the Shade. Both offer a totally new experience for even long time Anarchy Online players, especially the Shade who cannot use armor at all, and relies instead on harvesting 'spirits' from their defeated foes that act in the place of bracers or body armor.    In terms of new additions, the last and possibly most important change is the addition of the new 'Perks' system. This allows the player to purchase a special ability every ten levels that further specialises their character. What's more there are many choices for each character. The only real disappointment with the system is that the developers have chosen to restrict certain perk lines to individual professions rather then allow a totally open system. Whilst understandable from a balance point of view there is a serious case of envy in hearing your friends describe their latest new abilities that you don't have access to -- of course you can do the same to them!    The perk system gives the players some new and co-operative abilities, meaning that some perks attacks actually work better when combined with another perk line from another profession is already in use on your target. This adds a whole new dimension to the combat, and even the regular players have yet to discover the full potential of the system.   All sounds great doesn't it...too good to be true perhaps? Well, as always with expansion packs of this nature there are problems. With all the new abilities and items open to players, Funcom have hedged their bets and increased the difficulty of many of the creatures you will encounter, and not all of these encounters have been balanced yet -- you can all too often find a monster that even the in-game system tells you to be an 'easy kill' is suddenly handing you your rear on a nice shiny platter. Shadowlands is not easy. Funcom are working from the point of view that if things are difficult at first and they have to tweak things down somewhat that is preferable to it being too easy at first and them having to make things harder and aggravating players. Still it's worth bearing in mind that the new encounters should be approached with caution.   The quest system also brings with it a new set of issues, the linear progression means that there will be inevitable competition for items and spawns where there are large numbers of players at a specific level range.   There are also some bugs, mostly minor, but frustrating none the less when encountered, although the game's launch has been incredibly smooth and most of the issues concerning existing players are simply balance issues. When your regular players are more concerned about spawn rates and damage ratings rather then lag or client issues it is a good sign that you have done things right.    The lack of a decent manual with the box is a more serious omission, especially from the point of view of the new player, and whilst the in-game help and online manual, not to mention some outstanding fan sites do compensate fully, it does not excuse the lack of a decent manual. None of the issues are insurmountable though, and most will be addressed in post release patches, but none of them can detract from the overall experience.  Shadowlands not only meets its rivals head on in terms of content for players of all levels, but in many ways saunters past them without breaking sweat. There is just so much to see and do that even the most established players will still be making discoveries for months to come.The shame is that the stigma of Anarchy Online's launch may some deter people from exploring this wonderful expansion. If you leave your pre-conceptions at the door and take the plunge you may just discover that the next generation MMORPG you have been waiting for is already here.", "date": "Sep 18, 2003"}