{"name": "Shining Soul", "name_review": "Shining Soul", "ref": "https://www.ign.com/articles/2003/09/22/shining-soul-2", "text": "Even though the game was just released in the US, Shining Soul is far from a new product. It's been available overseas for more than a year and half before it made its trek stateside, and even before it hit these shores Europeans received a localized version of the action RPG. The sequel has already run its course in Japan, which makes the original even more dated. Atlus bravely released this game in anticipation of publishing Shining Soul 2 next year, and the best advice I can offer: wait for the follow-up. The original Shining Soul isn't a terrible adventure, but it's far from a complete package; the lack of a storyline is the first indication of a bland RPG, but more important, Shining Soul is heavily designed for multiplayer cooperation. There has been little to no focus on the solo adventure, which makes this game nothing more than your basic dungeon hacker. Features Four character classes Cartridge save (four slots) Multiplayer support  Shining Soul is Sega's attempt to continue the company's classic Shining namesake in an original design on the Game Boy Advance; there have been many Sega-developed series using the Shining moniker: Shining Force, Shining the Holy Ark, Shining Wisdom, Shining in the Darkness. How Shining Soul ties in with the other games in the series isn't a fact that's really made clear, but anyone who has played through some of the classic Shining games will recognize certain character and enemy designs.  This GBA game is an RPG in the sense that players pick from different character classes, and level-up their on-screen persona through experience points as well as cause hitpoints of damage to enemies with weapon attacks. But in terms of gameplay, Shining Soul is mostly all action. And in the loosest sense of the word, too. If it weren't for the fact that you have to continuously manage your characters' equipment, health, and experience, there wouldn't be much to do in this game but aimlessly attack enemies with less strategy than Gauntlet. Honestly. All there is to do in the game is hack and slash through indoor and outdoor locations; enemies teleport in out of nowhere, and players can't move onto the next part of the ~world~ until they've met a hidden quota, either wiping out a set number of enemies, or defeating the one specific enemy in that area. Once that happens, the exit appears and it's off to the next area for the same action. Other than figuring out attack patterns of enemies and the end bosses within each realm, there's little to no strategy involved in playing Shining Soul. There aren't even any puzzle elements in the level design.  It's clear that the development team's main focus was multiplayer, which is definitely commendable considering most GBA developers work on that aspect as an afterthought. In this case, Shining Soul becomes a game similar to Diablo and Phantasy Star Online where as many as four different adventurers, each with their own skill levels, work together to get through the different, set missions in Shining Soul. But that multiplayer focus negatively affects the singleplayer design...like, where's the storyline? But even worse: players can't pause the game in battle. At all. The action never stops for the player when he enters the options menu, so it's possible that an enemy can pop out of nowhere and attack while you're adjusting inventory. This design element makes sense in multiplayer sessions, since pausing the game would affect everyone in the network. But this is a portable game, and portable gaming means playing with distractions; and the only way to safely ~pause~ the game is to save the game and quit, or hang out in the central village.  As bland as the gameplay is, there are some good ideas in Shining Soul. The ability to map different weapons and items to the L and R triggers works pretty well, though it's just initially a bit awkward to get the hang of it during the action. Item gathering and organization is handled by a clean checkerboard that shows empty slots in the player's inventory. And, of course, the multiplayer focus is a welcome element, though the player interaction doesn't come anywhere near what Nintendo has done for the GBA in The Legend of Zelda: The Four Swords. But these decent gameplay designs are within a game that features some really bad graphic designs; the backgrounds and characters are nicely rendered, but the sprite animations are downright terrible and chunky.It will be interesting to see what Shining Soul II brings to the table next year after experiencing what was created for the first game. There's certainly nothing wrong with creating a dungeon hacker, even a multiplayer one, but it needs to be something more than what Gauntlet was...especially if it's to be branded within a well-known RPG ~series~ like Sega's Shining namesake. As it stands, Shining Soul just feels like a shell of a design, good ideas and intentions spattered thoughout boring action sequences.", "date": "Sep 22, 2003"}