{"name": "D&D: The Temple of Elemental Evil -- A Classic Greyhawk Adventure", "name_review": "The Temple of Elemental Evil", "ref": "https://www.ign.com/articles/2003/09/23/the-temple-of-elemental-evil", "text": "(ToEE) is more than just a mouthful to say -- it's the first RPG to be based on the new Advanced Dungeons & Dragons 3.5 rules. As it's based on a classic Gary Gygax module from the '80s, ToEE has a lot to live up to. Translating such a well-known adventure, especially one originally written by the creator of D&D, is a tasks that's ripe with pressure...and I'm happy to report that Troika did a good job at pulling off that lofty task.  While the Troika team did take a few liberties with side quests and expanding the village of Hommlet a great deal to offer up more gameplay possibilities, for the most part the digital version of ToEE plays out very similarly to the classic module. You'll already recognize a lot of the locations and characters if you're familiar with the original, such as the seedy town of Nulb, the noble Burne and the drunken Elmo, and the locations in the game even resemble some of the drawings included in the original module. While the story isn't really all that deep, I can say that the digital version of ToEE lives up to the fame of the original pen-and-paper module (Why do they call it pen-and-paper by the way? Does anybody really play tabletop D&D with a pen?). But I can't really fault Troika for the lack of deep storyline since the original module was more of a dungeon crawl ~hack-n-slash everything die~ type affair.  The ToEE module was massive adventure, and the computer game lives up to that legacy as well. As you would imagine, there are an overwhelming number of people to converse and interact with, and the game is packed with thousands and thousands of lines of dialogue, especially when you consider they're tailored to alignment and even intelligence. You can expect some very different options if you initiate a conversation with a player character who's a bit dim-witted, such as responding to someone who says ~You shant regret this~ with ~Me not even gret once yet.~    Like the aforementioned conversation, the folks at Troika have included their own brand of humor seen in their previous effort Arcanum: Of Steamworks and Magick Obscura and of course in the Fallout series which, although not technically a Troika game, shares many of the same development members. One of the funnier bits involves the NPC bard Zaxis, who sings all of his dialogue in an off-key warble. He's not the bravest bard in the band, and he adds a bit of wussy lightheartedness to your adventures in the sinister, evil temple by singing such lines as ~This is a big room...this can't be good~ while you're exploring.  In an interesting twist, you begin the game by choosing a general alignment for your entire party, and depending on your party's alignment, you can only choose characters appropriate for that group. For example, a true and just Paladin won't group with an assemblage looking to loot and pillage everyone in sight, and an evil half-orc barbarian wants nothing to do with a group of goodie two-shoes looking to plant daisies and save the world.       Your party's alignment does more than just affect what characters you can choose, though. Each alignment starts with a slightly different opening vignette (although all roads soon lead to the main village of Hommlet) and very different endings, giving ToEE lots of replay value even though there is no multiplay.   As we've come to expect from Troika, character creation is extremely deep in ToEE, and you can spend hours simply crafting the perfect party before you even step into the game world. Every detail from the basic stat attributes, race, gender and class to the more comprehensive choice of deity and even your character's height is included in the multi-step character creation process. Troika really got the spirit of creating an AD&D character down pat with ToEE, which is a good thing since this is such an important part in any RPG game. You're going to be stuck with these characters for the entire game, and it's a long one, so getting familiar with your characters from the get-go and crafting them exactly as you wish is vital. Of course, you can always use the pre-generated characters if you opt, but then you're kind of missing a big part of a role-playing game now aren't you?  You can have a total of five player characters in your party, and you can hire three additional non-player characters total party of eight. However, be careful not to give your NPCs both melee and ranged weapons as they'll sell the one that's not currently equipped at the nearest merchant -- they're greedy little bastards.  You can choose to play the game like you normally would play any computer RPG -- save before combat, character leveling, entering a new dungeon, opening a chest etcetera...reload if anything goes wrong -- or you can opt for IronMan mode. IronMan mode is the true challenge as you can't re-roll your characters and you can't save your game. Yes, that's right...you can't save your game. A save game file is made for you automatically every time you exit the game, but other than that you're on your own playing the entire game without an in-game save. As the game is hard as reinforced titanium rebar nails, IronMan mode is not for any but the most pain-loving of you out there.     With a game so large, you would expect a good mapping system. Well, ToEE combines a bit of the good with the bad. The area maps are well-detailed smaller version of the large maps, and by the end of the game you'll have a ton of maps to look through, complete with the beautiful lighting effects and vivid colors found in the rest of the game. Only problem is, nothing on the maps is labeled. You can manually place markers on the map denoting special places on each map, but auto-map designations would have been nice for the important areas, especially since you can only have so many manual message flags on any given map, and that's really a limitation in the large village of Hommlet where you'll want to mark a lot of the houses so you can remember where important denizens like the leatherworker, blacksmith and woodcutter reside so you can return to them to complete quests.      One aspect that I really appreciate about the game is that Troika has taken great care to bring an authentic D&D experience to the computer, with only a few minor changes to the rules to move gameplay along, such as the Cloak of Elvenkind always gives a +10 hiding bonus (you don't have to pull it over your head for it to work) and you can cast spells while holding weapons. I played tabletop Dungeons & Dragons for years back in the day, so I know quite a bit about D&D, but I have to admit that I wasn't very familiar with the 3.5 rules. They're fairly similar to the 3rd edition rules with only a few changes, but the differences from classic AD&D are dramatic. Thankfully ToEE includes an extremely detailed manual (one of the best I've seen in years...complete with a kick-ass chocolate chip cookie recipe) and a well-detailed in-game encyclopedia that will answer most of your questions.   As with nearly every RPG, there's a lot to be done in ToEE, and this adds up to a lot of gameplay options. Unfortunately, the interface isn't the best at presenting all of these options in an easy-to-use manner. The control scheme is very reminiscent of Neverwinter Nights' interface where there's a circle of options surrounding the selected character's portrait with expanding menus containing more detailed options extending from the original choices. While the interface in Neverwinter Nights was complex and fairly easy to use, ToEE's interface is convoluted, unwieldy and confusing, and playing with it actually seems to extend the gameplay time as choosing trivial actions take a lot of time. This was the most frustrating aspect of the early parts of the game, as it takes a few hours to learn. ToEE really could have used the help of assignable action hotslots so you wouldn't have to drill down the chain of options for your most-used choices.  However, once you do get the interface down, everything flows much better and the game offers a much more satisfying experience. The combat engine is impressive and powerful, and like the rest of the game, is very deep. You can go head-first into the fray with sword, bow or spell readied, or you can be a little more strategic with your combat decisions and use advanced attacks like trip or cleave, or even place your characters in the proper positions to take advantage of flank attacks. And even though ToEE uses a turn-based combat system, it flows pretty well.    Combat isn't perfect though, and the enemy AI is a bit flakey. Sometimes creatures will totally and completely ignore you while you're beating on their companions, or even worse, them. I happened upon a couple of masochistic som'bitches that were happy to sit there and let me beat on them without moving a muscle.   As I mentioned earlier, ToEE is a tough RPG, and there's no rest for the weary. Almost every time you rest you get some kind of random encounter. While this keeps the game exciting and combat frequent, it means that you'll be traveling all the way back to the safety of the Inn if you want an assured break with time to heal your characters and memorize spells, which also makes the game rather tedious as you journey up and down the same road again and again from the Temple to either Nulb or Hommlet.      Unfortunately, the complicated interface and AI problems aren't the biggest problems with ToEE. That dishonor goes to the numerous bugs that you'll run across while playing. As ToEE is a huge, complex, detailed RPG, I can see how some bugs would slip through the QA process, but ToEE is just infested. While none of the bugs I encountered are necessarily fatal or detrimental to the game, they certainly are annoying.   One of the bugs leaves status like encumbrance still showing up graphically on characters even though they are no longer overburdened. Another affects party grouping as sometimes you hit the ~select all~ button and the game only picks a handful of your party, so you have to manually select them by dragging a box around them with the mouse -- which is easier said than done if your adventuring group is spread out. Yet another bug sees random creatures stuck in the environment, either in rocks or behind walls. In the case of them being stuck in rocks, you can take them out with ranged weapons, but the behind-the-wall bug is a little more frustrating as the monsters can still attack and hit you through the wall, even though you can't see them. Like I said...annoying -- and that's just a few of the bugs I encountered while playing. I have no doubt that Troika will release a patch soon to eradicate many of these problems, but the out-of-the-box game is just riddled with troublesome little glitches like those mentioned.  Pathing can be a big problem as well. Sometimes you click on an area of the map and your party will go beyond that point and double-back to it. Maybe they forgot where they were going and figured you wouldn't notice if they just got back in line. Worse yet, sometimes you'll select your entire party and move them to an area on the map only to find out later that only a few of them decided to follow your orders, leaving the rest of your party picking their noses back where they started. This is especially bad if your party gets split up and you come across a particularly nasty encounter as your mage and rogue may be the only ones standing against a group of Hill Giants in a tight corridor.    On a more positive note, ToEE is absolutely beautiful. ToEE uses a system that incorporates 3D characters on top of stunning pre-rendered backdrops. The backgrounds are so rich and detailed that it's almost as if you're moving your characters around on an oil painting, and the game looks even better with you have fireballs and lightning bolts flying around the screen.  All of the characters in the game are paper doll models, meaning you can see the items you place on each character when you're walking around in the game environment. While this technique has been used for a while, Troika takes the detail to the extreme as items and armor disappear from fallen bodies as you strip the dead of their possessions. And you will meet foes a-plenty. An evil temple isn't build on apple pies and ladybugs alone. No, no...expect the likes of trolls, ogres, ettins, owlbears,  a host of walking fungus and my personal favorite: the dreaded gelatinous cube -- all of which look like they stepped directly from the pages of the Monster Manual    Unfortunately, the walls in the isometric perspective often hide the beauty of the creatures (yes, even ogres are beautiful), and the loot of your fallen foes. I wish the walls would fade away as you mouse over them if there's something that you can interact with on the other side, but since they're pre-rendered backgrounds, the walls often obscure your view, making it difficult to select beasties in combat or loot them afterward. After starting out in 1024x758 resolution, I actually found it best to play at 800x600 so I could see the backgrounds up close and spot fallen enemies easier. And although the ~Tab~ key is supposed to highlight things you can interact with on the background, it doesn't always work and you often have to use the old adventure-game standard of scanning your cursor across everything on the screen to see what you can fiddle with or use.  Framerate usually isn't a problem in RPGs, and while ToEE runs well while exploring areas and walking around, the game does chug and the mouse control becomes jumpy when you're in a big combat sequence and there are lots of enemies on-screen at once. Yes, I'm running full balls-out details, but I don't expect sluggishness on a 2.4GHz machine with an ATi 9800Pro card running in 8X.  Like much of the rest of the game, the audio portion of ToEE is also a mixed bag. While the score sets an eerie mode for the entire game, the synth-heavy soundtrack is extremely repetitive, and the spacey sounds seem more apt for a science fiction game than a fantasy setting. For the most part, the sound effects are well done and varied, although many of the effects, especially the water splash, sound metallic and compressed. Voice acting is plentiful, and nearly every conversation is accompanied by audio, but for the most part the delivery is cheesy and stiff.    I did experience some problems with the sound mix where the voices where very low volume, even with the options menu slider maxed. When I exited the game and loaded it back up everything worked fine, but I did encounter this problem more than once and I've never noticed it with any of my other games, leading me to believe it's a compatibility problem with ToEE and my sound card, which is a pretty standard Sound Blaster Audigy 2.ToEE isn't perfect, but it's certainly not a stinker. Because it's such a deep, lengthy and detailed RPG, I can forgive some of the bug, but as it stands now, you're going to have to be patient to play ToEE. It can be an exercise in tedium, but after you get past the high learning curve required for the interface and if you can look over the bugs, you'll have a lot of fun with this RPG. But if you want something you can jump into easily right out of the box, skip ToEE...at least until a few patches are released.", "date": "Sep 23, 2003"}