{"name": "Mistmare", "name_review": "Mistmare Review", "ref": "https://www.ign.com/articles/2003/09/23/mistmare-review", "text": "When you first pick up the box for Mistmare in the store, you're greeted with some very interesting promises.  ~An addictive mix of action, adventure and RPG elements,  Use an incredible arsenal of weapons and magic ~  Whoever designed their box knew what they were doing.  These promises make the game sound like it's worth buying, and I'm sure many people picked up the game because of it.  It's just too bad the people who designed the box didn't give some advice to the people who designed the game.   With games today it gets more and more difficult to find one that really stands out from the crowd.  Sometimes it seems like every game out there is just a clone of another game, or that the designers just stole the best parts of all the other games and tried to combine them.  So when I saw the descriptions of Mistmare on their official site I thought perhaps I had finally found an original game.  The developers promise a game where the dark ages never ended, where religion has gone rampant to control the world, and where you alone stand against the coming darkness.   The story of Mistmare is indeed interesting, which is one thing the game has going for it.. The game takes place here on Earth, in what we'd consider the modern era, but it's a world vastly different.  Technology never developed, and humanity never progressed out of the dark ages of the Inquisition. Though it is set in the contemporary time period, swords and sorcery are the weapons of choice.  Massive buildings made of stone in a gothic style, dark torch-lit hallways, and small thatch-roofed hovels are still the norm. The story of the game is as follows, during the middle-ages a deadly fog, called The Mist, was slowly enveloping the world.  Those who were caught in the fog were found mutilated, or had gone insane.  The Catholic church devised a way to fight back the Mist using their discovery of magical Liturgical powers.  Unfortunately for the world, most of it was lost to the fog before this discovery was made, leaving just a small corner of Europe free from destruction.  As you begin the game you find yourself finish your training as an Inquisitor, a powerful monk gifted with powers both martial and magical to use against the enemies of the Church.   These magical powers are Holy in nature, encompassing spells to boost your own powers, to heal yourself, to weaken your enemies, or even destroy them.  I have to admit that the visuals for these spells are fairly well done.  The image of a blast of magical power shooting forth from your body and striking your enemies is quite impressive.  And the way your power lifts you up into the air and wraps around you to heal you is a very cool effect.  There is a bit of variety to the spells, but though they are done decently well, the entire magical system feels very clumsy and lacking.   Also included in the game are your classic RPG-type items like armor, weapons, and enchanted jewelry.  These items can give you bonuses to your stats and your powers.  The problem is that the entire stat system is so complex and non-user friendly that it's hard to figure out what exactly each stat affects, and how to raise those stats as you progress.  The basic concept for raising your stats is fairly unique.  You use items in order to raise specific stats.  For instance, you lift weights to increase your physical prowess, read different books to learn how to perform certain things better, or pray at shrines to increase your magical abilities.  The problem is that finding these items can be a bit difficult, or at least finding the ones you want.  And that doesn't include the hassle involved with managing the time it takes to use these items.     And while we're on the subject, let's talk about Mistmare's time management system.  They basically went for making the time in the game seem as realistic as possible.  You are given certain times of the day and night to do things, or told how many days you have to accomplish something, and many of the actions you do in the game use up your time, advancing the clock.  The goal I assume they were going for was to make it realistic and give the player a feeling of true interaction with the world, but they failed miserably.  All the actions you might want to take in the game, like lifting weights or reading a book, takes a certain amount of time.  All of the actions you spend most of your time doing though, like running around, talking to people, or combat, don't really take any time.  What this means is that you'll often find yourself doing unnecessary tasks taking a nap in the middle of the street, or lifting some weights, in order to advance the clock to the time you need.  This system also makes it difficult to really advance your character as much as you may want, because time ends up flying by and you're forced to move on.    The biggest problem though with the game is the user-interface and controls.  The first aspect you'll notice is the movement.  Instead of a keyboard movement which most gamers know is superior in any game with action in it, you're instead constrained by a bulky point-and-click movement system.  To move to a certain spot you click on that spot and your character moves there using a very poor path-finding system.  The speed at which you get there depends on how far away you clicked, meaning if you're moving around in small increments you get penalized by having to move slowly as well.  And that of course assumes you actually get where you want to go, instead of getting stuck on the corner of a wall or while trying to walk through the same place as an NPC.  One good thing they used though is being able to click on your destination on your in game map and your character will move their on its own.  This of course is subject to the same poor path-finding issues as normal movement though.     As for the user-interface, it feels very clunky and hard to use.  Using items in your inventory can be difficult to figure out, as well as using features like secondary equipped weapons.  Some of the keyboard shortcuts make sense, like using 'i' to bring up the inventory, and others don't, like using 'h' for the character sheet.  To add to these complications, mouse movement is too slow no matter how you mess with the game options.  This, combined with the horrible camera movement, makes actually playing the game extremely difficult, it feels more like work instead of a game.  And this doesn't even include the frustration involved with the fact that many of the conversation boxes are riddled with typos, sometimes making things even more confusing.  And once you think you've mastered getting to talk to people, you find yourself in a world populated with NPCs that say nothing more then a simple hello, yet still make you deal with a needless text box.    The fighting isn't really much more fun either. As if trying to click on unmoving objects like static NPCs or chests wasn't hard enough with the camera movement and slow mouse, trying to click on a moving target during combat is even worse.  These things end up making combat extremely frustrating experiences, detracting from the decent visuals that would have made it more fun.  It's one thing to watch weapons flash and spells flare, but you can't enjoy it when you're too busy trying to find your next target ad actually attack.  Thankfully, once you manage to target your enemy, combat is handled automatically, with the only choices you really have being what spell to cast and when.  Of course you also have differing combat stances you can execute, but these are really fairly pointless as the combat mechanics are designed so poorly.   The only real positive of the game is the graphics, which are really only barely adequate.  Visuals like the spells are well done, and character models aren't too bad, but there are many places where it seems like they did as little work as possible to make an object.  The graphics really wouldn't be all that bad though if it wasn't for the horrible frame-rate problems the game has, even with the most recently released patch. Even when running the game on a computer that far exceeds the system requirements the game becomes slow and sometimes will even lock-up on you in any area with lots of graphics, like in a city.     The sound in the game isn't too bad, including some fairly well done voice-overs for some scenes, though there isn't much variety in the voices. The music isn't that bad, I've definitely heard worse.  The music isn't all that great though either.  Sound effects are decent, though sometimes they'll become a little distorted when the game is slowed down.   Overall I'd say Mistmare is a game that promises much, but doesn't deliver on much.  If you're looking for a slow moving game with sub-par graphics, poor gameplay, and horrible controls, then Mistmare is the game for you. If you're actually looking for a game that plays well, with decent graphics and controls that are easy to learn and use, then put that box back down on the shelf and keep looking.  Perhaps if the developers had taken more time to work on the game it'd be better, but as it is the game falls far short of what the box would lead you to expect is inside.", "date": "Sep 23, 2003"}