{"name": "NHL '04", "name_review": "NHL 2004 Review", "ref": "https://www.ign.com/articles/2003/09/27/nhl-2004-review", "text": "It's been a bit of a roller coaster ride for diehard fans of EA's NHL hockey franchise. After the outstanding NHL 2002 hit in the fall of 2001, hockey fans thought they had nowhere to go but up from there. But NHL 2003 left a bad taste in the mouths of longtime fans because of a looser, more arcadey approach. The threat from Midway's NHL Hitz was taken that seriously.  For NHL 2004 the developers at EA Canada have taken their brand of hockey and made it more hardcore than ever. We're talking ~Gordie Howe on a frozen pond wearing moose fur~ hardcore. There are brand new controls, a now mandatory EA Sports style franchise mode and a fighting engine that almost makes the hockey around it irrelevant. This year, NHL 2004 is a lot more serious but it ends up just as fun as its predecessor from two year ago.   Gameplay  The NHL has changed to a more defense oriented, low scoring hockey league and NHL 2004 reflects this by making every goal in the game (as long as you're not on the easiest difficulty level) precious and hard-earned. This goes hand-in-hand with the new level of control players are given. Now that you can pass to open areas, create manual dekes and throw checks in any direction, the game expects you to put all of that free choice to good use and make your hockey team a fluid, cohesive unit. This makes the learning curve in NHL 2004 a little steeper than you might expect and we fully expect some casual gamers to miss the boat on this game. It plays a lot more like real hockey but that doesn't necessarily translate to a lot of fun right out of the box.   If you want to score goals in this hockey videogame you have to be precise and master all of the nuances of the sport just like a real hockey player. This feeling is best replicated by using the dual analog sticks of a gamepad. Being able to maneuver the puck around your skater's body and avoid the defense is a great tool to have but it's not as loose and easy to use as you might expect considering the system was introduced in last year's game. The physics are a little less forgiving in NHL 2004. Since you have independent control of both the stick/puck and the skater's body and momentum, you have to manage both to pull of an effective deke move. This isn't like last year's NBA Live where you can freestyle your way up and down the court. Likewise on defense you can throw checks using the right analog stick while still controlling the hockey player's body on the left stick. This means you can check puck carriers without skating precisely towards them and lining them up for a vicious hit. The new Bruise Control system allows you to power up your checks first and then unleashing a more powerful blast in a direction of your choosing. Similarly you can use the freestyle control system to both pull off your custom deke move and shoot in one motion. These two specific systems are extremely difficult to master, but provide a more satisfying experience if you can ever get the hang of it.   The developers brilliantly made sure to include more traditional controls for those who can't digest analog control. So you have an auto-deke button, a check button and all of that but you'll never become a crotchety, old hockey purist by playing that way. On the other hand you may score more goals and have more fun initially if you do.    The gameplay will only be as fluid and smooth as you make it. The real NHL isn't as graceful and full of awesome displays of skill as it used to be and so this game has taken a step in that direction as well. Mastering passing and taking whatever opportunities a defense gives you on offense is key and you'll have to work to make it look pretty. It's in this way that NHL 2004 is a lot more like Madden, in terms of depth of realism, than ever before. A beautiful goal on a beautiful shot after a beautiful setup will be rare and many things including your abilities will have to fall in place for it to happen. But sloppy goals, quickly capitalizing on your opponents' mistakes and other elements of 21st century hockey are present in NHL 2004.      You have five offensive and defensive settings that go from super aggressive to super conservative available to you on the fly during the flow of a game. Calling and playing within the parameters of these plays is super important because NHL 2004 has made aggressive freelancing on offense an extremely difficult road. Great playmakers like Joe Sakic will only come through for you if you read the situation and set him up to do something great for you. But again, having patience and learning what's required will be rewarded.  The fighting system has to be triggered by the user. Throughout the course of a game, hockey players will agitate one another and just generally get pissed to the point where a pair of fight icons pops up on the screen indicating the two players who have the potential to beat the hell out of each other. You have to consciously choose to fight and hit the button to start a good old fashioned hockey fight. The system has two hockey players grabbing each other's jerseys but you're in control of both punches and defense. You have a high and low punch button and you can defend either high or low against your opponent. The result is a controlled button-mashing minigame (not unlike Knockout Kings 2002) where you can go undefeated if you're quick enough to read an incoming punch and exploit openings in the other guy's defense.  The Dynasty Mode is very good and a welcome addition to the series despite a few shortcomings. First off, the selection of GM portraits that will represent you throughout the game is far too homogenous, even though this is a hockey videogame. There are 14 choices and they all look like they could be coverboys for ~Corporate Greed~ magazine. That's the most diplomatic way we can say it without saying it.   Other than this, running your own Dynasty is a ton of fun. While you start with whichever team you want (including imported custom teams), the infrastructure of your team is gutted just as you start the job. As GM you have the ability to upgrade both your team's facilities and staffing, thereby giving your hockey team permanent bonuses like increased skating or shooting attributes or the ability to sign free agent players for much less than your competitors. Managing this system is super important even if the interface itself -- a couple of lists with generic sliders-- is very plain. You'll appreciate the upgrades you make to your marketing, legal and scouting departments or the new equipment you purchase for team travel or the locker room when your players are on the ice playing above their potential.   Beyond managing the team's roster and finances (just like in Madden 2004), the most important aspect of Dynasty Mode is managing your team calendar. During a season you get to set what your team does in the days between NHL games. You can give your team short, medium and long practices or simply give them the day off but every choice will directly affect how your team plays. Long practices will make them better players but they'll have lower endurance and morale because of it. A day off will let them recharge their batteries but their skills will begin to deteriorate. The safest play is to always use medium practices because this doesn't knock off anything in the way of morale or endurance but it also only gives a minimal skill bonus. When you tie the calendar management system back to the overall team upgrade system we mentioned earlier, it's clear that you'll have to do some major planning and develop a specific management style for your NHL 2004 Dynasty. Every team sports game should demand this from us.     Even though the main interface for all of this is relatively boring with numbers and letters, it does make a difference in the product you put on the ice.     Graphics  The hockey players in NHL 2004 are a huge improvement over the lads we saw in last year's game. During the majority of gameplay the default (and best) camera angle is too far away from the action to really get an appreciation for them, but during fights and cutscenes they really shine.  The animation is improved because of all of the new abilities you're able to control like freestyle checking and pinning players against the boards. But again, the default camera angle makes it a little tough to appreciate all of these new goodies, but really there's no other way to play the game.   The crowds in NHL 2004 are great with dozens of fans hooting and waving in team gear and everything. The fact that they cheer heartily no matter what's going on is a bit of a bummer, but better that than nothing at all. The ice and side windows are all reflective and add a tremendous amount of realism to the whole experience. There's even tons of ice spray shooting up from the skates of stopping and turning hockey players.   The additional throwback hockey jerseys all look great as well. We weren't there to witness the original Ottawa Senators, for example, but they look pretty damn spiffy and authentic. The arenas are all marvelous with the unique touches that make them so recognizable. From the circular light pattern at Madison Square Garden to the championship banners crowding the rafters at Joe Louis Arena, the arenas look like the real things.   Sound  Your game announcers this time around are Craig Simpson and Jim Houston and their act is toned down significantly from what we heard from Houston and Taylor in NHL 2003.  The jokes are fewer and further between so all of that chatter time is filled with more useful information and insight to the game that's actually being played.  The sound effects in the game are almost perfect. The crowds will cheer, chant, boo and react appropriately to the action in the ice. The sounds of players crashing into the boards and the clackety sound of hockey sticks thrashing on the ice for face-offs and loose pucks both sound amazing through a surround sound system.   The selection of music EA has included in NHL 2004 is heavy on rock and features music from acts like Alien Ant Farm and the Ataris. Whether or not these are favorites of real life NHL fans is beyond us, but then again we're still wondering why Bryan Adams is always left off of EA Trax.At first I thought NHL 2004 had been unnecessarily tampered with because scoring wasn't as easy as it used to be. But upon further review I realized this videogame mimics the real thing more than ever and therefore the joys of the sport are found in big hits, near misses and brilliant scoring opportunities that barely miss lighting the lamp. If you can get over the fact that scoring is going to be reserved only for those that deserve it.It's an improvement over the last NHL game from EA but definitely a big change in direction for the franchise. There's plenty of room for improvement but it's clear that the effort has been put into NHL 2004 and the most serious hockey fans should get a kick out of it. Casual fans will either become serious hockey fans or break their controllers trying.", "date": "Sep 27, 2003"}