{"name": "Pong: The Next Level", "name_review": "Pong", "ref": "https://www.ign.com/articles/1999/11/12/pong", "text": "In the words of Jayson Hill, PR Manager over at Hasbro, ~If it weren't for Pong, none of us would have jobs right now.~ Amen, brother. This is the game that started it all -- and it seems like a risky proposition for Hasbro to take on the update of this title. What made Pong so successful (apart from it's timing) is the uncomplicated yet incredibly addictive gameplay. It would seem that anything you added to the mix would just complicate matters and get in the way of what makes Pong so enduring. Not that anyone is still playing Pong, but it is the patriarch or ~Grampa~ if you will of all electronic games that exist today.  Gameplay is based on the original Pong model. Those of you who don't know what I'm talking about should consult your local library or resident old-timer. They'll clue you in on the joy that is Pong. But since I know you and I know you've got better stuff to do than check out some library or sit around and listen to some old person drone on and on, I'll give you the basics. You've got a paddle that is limited to moving along a straight path. A ball is released into the arena and you and your opponent must keep the ball from crossing behind...what in the hell am I doing? You know what Pong is.  The paddle in the game has undergone some pretty significant changes. First, it looks and behaves better. It has real substance and weight and is slightly elastic. When the ball hits the paddle, the paddle gives just a little and that helps to enhance the realism of the game. You'll notice a little squash and stretch as the paddle bounces against the walls of the arena. The ball is largely unchanged. Apart from looking very round, the ball is just the same as the little blip in the original game.  You can control the paddle with the keyboard, mouse or gamepad. All in all, the mouse is the best way get into the game. It works so much better than any of the other options. This is largely a factor of being able to guage the distance of the movement of the paddle relative to the position of the mouse. The gamepad or keyboard controls make it harder to position the paddle exactly where you want it. The only other problem I had with the physics modeling is that you can't get any english on the ball if the paddle is still. In the original Pong, the area of the paddle that struck the ball determined which direction the ball would travel. If you hit the ball away from the center of the paddle, the ball would angle off in that direction. The only chance to get the same english here is to move the paddle as it strikes the ball. It's a lot trickier this way.  Some special power ups are available on some of the levels. They appear as spinning tops in the middle of the playing field. If the ball hits the power ups, the power up travels towards the player who last touched the ball. As the power up drifts closer, you must move to capture it. Most of the power ups are limited use items although there are some levels where each player is given an unlimited number of any given power up. I was pretty impressed by most of them. The Grab power up allows you to hold the ball and aim it for release. The Whack power up spins the paddle once very quickly. It's like a bat swing and is tricky to time just right. If you do make contact with the ball, the force of the spin will send it at outrageous speeds towards your opponents goal. Other power ups will bring in additional defenders (read: seals) to protect your goal. Still others will affect the playing field in some way -- like tilting the board, throwing out gusts of wind, and others too numerous to mention.  The game is divided into eight zones, each of which contains a number of different levels. Each level is composed of three separate challenges. As you defeat the initial challenges, more levels and zones are opened up for your gaming enjoyment. And as a special surprise, the original version of Pong is included; but you have to get pretty far in the game to unlock it.  It's in the level design that the game shows all its inventiveness. There are certainly enough straight levels with two paddles facing each other across a square field. Even there, Pong has gone to a new level. Most of the straight Pong levels have some gimmick to them that opens up a whole new world of strategic options. The first such level has penguins walking around the middle of the field. Every time a penguin is hit, he releases a new ball. Pretty soon you'll have to worry about three or four balls instead of just one.  Other levels offer unusual boundaries or spoilers on the field. One level has a spinning platform in the middle of the arena. This can send balls off in completely random directions. Ditto for the fans located on some levels. One of the truly neat (and frustrating) levels has you using multiple balls to send a large puck into your opponent's zone. You each start with two balls and use them to try to hit this puck in the center. As soon as it crosses into the enemy zone, you score a point.  But there's more. Apart from the normal Pong levels, there are all kinds of other options. Oddly, most of these levels are single-player only and not as goal centered. On one level, you're trying to herd sheep into a safety zone. It occupies the center of a round platform. The paddle circle the platform while trying to keep the ball and the sheep from wandering off. When you hit the sheep, they travel in the direction of the shot. The trick is to get them in the center without letting any fall off. A similar level involves knocking penguins off while navigating the same sort of round platform. The trouble here is that the platform dips in the direction of your paddle. This makes keeping the ball on the platform a lot more difficult.  Then there are the supreme digressions. One level has your pong paddle playing the role of fisherman. Angle your cast and set the distance to try to catch fish in a pool. The catch? (snicker) Well there's an alligator swimming along the edge of the pond. Every cast forces the fish away from the impact. If the little fishies drift into the path of the gator, they get eaten and you have to start all over again. The frog level is just as different. There are these frogs on a raft, see (I think I remember a dirty limerick starting out in a similar fashion), and you can use your paddles to tilt the raft. Why? Well, you're trying to maneuver a ball around the raft without letting it touch any frogs.  That's not even close to touching on all of the levels of this inventive game, but it should give a really good indication of what's in store. There are just as many interesting levels that I left out of the review. After all, there have to be some surprises in life...or gaming at least. It's got the same paradox of the original game -- periods of zen-like transcendence intermingled with bouts of vein popping frustration. But it's the kind of frustration that you don't mind so much.  -- Stephen Butts", "date": "Nov 12, 1999"}