{"name": "Drome Racers", "name_review": "Drome Racers", "ref": "https://www.ign.com/articles/2003/10/01/drome-racers-2", "text": "puts players in the world of fast and furious racing in the LEGO universe. The year is 2015 and the world is hooked on Drome Racing. The Drome isn't a type of race; rather, it's a giant dome that houses multiple environments where extreme racing takes place. Dromulus runs Drome Racing and basically reigns as king. He decides where and when races will take place, and not even the racers themselves know where the action will take place next.   Drome Racers harkens back to the Wipeout style of racing, where being able to race well is just as important as knowing how to use the available weapons. Being able to knock an opponent out of their cozy lead from a few seconds back is a common occurrence, as well as an important skill. That's not to say that racing takes a back seat to weaponry mayhem. There are various types of vehicles to race with, each suited to different race types and styles, along with an assortment of ways to modify the vehicles.   Gameplay  There are a few different types of races in the game. You'll race on road, off-road and dragster courses. The road and off-road races are where all the standard races take place, while the drag races serve as qualifying time trials to the circuits in Career mode. You'll have up to five other cars to compete against in any given race and a reasonable amount of laps to beat them in.   The dragster races are just as you'd assume: straight, fast and quick. The skill involved in dragster races is in shifting and accelerating. The right trigger handles acceleration duties while X and Y shift. That's all you'll need here, but it's not quite as simple as it sounds. You'll need to rev the engine to a nice speed where you'll start off the line quickly, but not to the point where you'll spin the tires or blow the engine. After shifting into each gear you'll need to find similar ground. If you floor it too quickly after shifting you'll spin the wheels and blow the engine. If you don't give it juice fast enough, you'll wind up losing the race. They don't last long and they may not be perfect, but the dragster races are a neat little diversion from the standard racing that the rest of the game entails.   What a hot LEGO car. The Arcade mode will let you race a singular track either in a normal race or a Time Attack. One nice thing about this is that you have access to multiple routes on each of the regular courses. You'll have access to an A and B route, as well as a reverse route for each of those. You'll also be able to change the time of day and weather, so even before you've started unlocking extra tracks, you'll have a nice assortment of ways to mix up your racing pleasure.   The Career mode pits you as a racer for Team Nitro where you'll attempt to win them the Drome Championship. The basis is that you'll end up running through a number of MCRs, or Multi Challenge Races. Each MCR is made up of a series of races, where each racer is ranked by his overall total time. Each MCR has a qualifying drag race which places the cars in order on the starting grid for the first race. Each successive race in the MCR begins with each racer starting in relative time to their overall MCR time. For example, if the first place driver is four seconds ahead of the second place driver overall for the MCR, he'll get a four second head start on the rest of the pack in the next race. The second place driver will then get a lead start of however much he was ahead of the third place driver, and so on. The first driver across the finish line during the last race of a MCR wins the series.    During the Career mode you'll be able access your garage to change cars, purchase upgrades or build a new car. Building a new car consists of picking its wheels, chassis and body type. Unfortunately, there are only a small amount of choices you'll have for each part, so the different combinations that you can create are rather limited. This makes sense in a way, since the real LEGO cars are built from such irregular and unique pieces that you wouldn't really be able to build a different car piece by piece anyway. Still, that sort of feature would have been nice to see.   The different cars that you can build are a way of fine-tuning your driving tastes a bit. For example, if you first choose the Road Tires, you'll be building a road car. You'll then have a few different chassis and body type options. Each of these choices lends different characteristics to your final car. If you choose the light chassis, the car will accelerate faster but its armor rating won't be as high. You can further adjust how you'd like your car to behave by purchasing upgrades.   Upgrading your cars is a simple process of earning the proper amount of loot, choosing the upgrade and clicking a button. The upgrades include Engine, Turbo, Aerodynamics, Tires and Armor. Each can be upgraded to a fifth level, with each level costing you more and more dough as you out-rig your vehicles. Upgrades are universal; that is, if you purchase the Turbo upgrade, all of the cars in your garage will see a performance increase. Lucky you.   As far as actually getting behind the wheel and driving goes, the cars handle a bit squirrelly at first and take a bit of practice to get used to. An odd thing is that the road cars are more difficult to drive than the off-road vehicles. The regular road vehicles seem a tad sluggish in regards to turning, but they also have an overwhelming tendency to fishtail. They won't completely spin out necessarily, but you'll find yourself facing a wall quite often when you first start playing. The cars handle like they have their handbrake permanently set. Even maneuvering around slow turns requires very subtle adjustments to steering or else your car may lose control. Very sharp turns are actually a bit easier to take than the slower ones, since your car will automatically act like you're trying to power slide and the game actually works with you during these turns.   Don't come within my personal bubble. On the other hand, the off-road vehicles handle a bit tighter than their paved course brethren. They don't slide as much as real off-road vehicles do, and actually handle a whole lot like how the standard road cars should. It's almost as if the handling physics for the two cars were switched at birth.   There are a variety of weapons to pick up and shove down the other racers' steering column. Each are unique enough that there are different tactics involved with using them, so some will take a bit of practice to learn when it's best to use them. Some weapons are guided, like missiles, some are of the ~shoot straight forward and pray you hit something~ variety, while others are simply dropped to slow down anyone behind you. Most have the same effect, where whatever car is hit will either slow down or spin out of control. What's most difficult about using the weapons isn't actually hitting anyone for the most part -- rather it's learning how to dodge their spinning wreckage. It's fairly easy to pelt another car with a missile, only to have your tactic backfire when they spin out of control and into your car.    The weapons are nice to see in the game as they shift it a bit from being a straight racer. It also adds a bit of tension to being in the lead, since there are then five cars behind you that are aiming for the same position, and you can expect that missiles and whatnot will be slamming into your exhaust pipe. The thing about the weapons that could have been done better is some way to counteract them. If a homing missile is coming at you from behind, there's little more to do about it than prepare to spin out and possibly lose your position. The direct-fire and dropped weapons can be dodged or avoided, but the homing weapons are basically ~automatically screw the target~ weapons.   Graphics  The car models are an excellent representation of the actual LEGO Drome Racers vehicles. They look exactly as if they had been built out of the proprietary LEGO pieces that are only capable of building one object. These cars aren't modeled out of the simple rectangular blocks that can build anything imaginable. Rather, they're made out of oddly shaped curves, frames, pointed objects, and other misshapen gadgets that make each car look entirely unique to itself. The detail given to each ludicrously designed piece of plastic is pretty dead-on.   The different worlds that lie within the Drome are all represented nicely and each is given a distinguishable look. The grassy hills and fields surrounding many of the paved courses look much more hospitable and lively than the barren dirt tracks. Mountains set in the distance look great, and everything in the environment is nicely detailed. The game is mostly set in open outdoor areas, so there's not too much to see as far as buildings or manmade structures go. What buildings and whatnot that are there aren't really of exceptionally groundbreaking design, but they fill the scenery fine and generally fit into their natural surroundings well.   Reliable LEGO shocks. There are a slew of some fairly neat effects in the game, particularly in regards to its particle effects. One of the coolest bits of eye candy is a tornado on one of the tracks. It looks pretty darn impressive and moves just as nice. The tornado and dirt tracks alike have some really nice dust cloud particle effects. You'll see dirt kick up and form a nice cloud before it breezes away like it should. Smoke and fire are equally impressive.   The only part of the game that isn't all that impressive, graphically speaking, is with the people inside your garage during Career mode. The people in the garage are there to let you choose and build cars, save the game, get racing tips, etc. They don't look all that good, and their lip-synced facial animation is pretty terrible and way off. This part of the game looks fairly rushed and is in stark contrast to the rest of the game's graphics.    Sound  The sound is basically what you'd expect from an unrealistic racing game. The engine and cars sounds aren't exceptional by any means, but they fill out the aural portion of the game reasonably well. Dirt and paved roads emit different sounds as your vehicle's tires interact with them, and they sound decent enough to be believable. Your vehicles sounds are all done well, but they aren't really anything that you haven't heard before.   A fair portion of the game's more ~flashy~ sound effects come from the weapons. They'll emit a ~woosh~ sound or something similar when fired and have their own explosion or damage sounds assigned to them. The weapon sound library is decent, but again, it's not anything you haven't heard before.   The soundtrack is a bit of a mixed bag, but it's generally decent. There are some fairly cheesy metal tracks on there which don't really add much to the experience, but the game has its share of nice music also. There are a couple tracks that meld a bit of orchestrated music with some electronic beats, and these tracks are actually pretty good. It's unlikely that you'd hear someone blasting this stuff out of their Cadillac outfitted with hydraulics and gold rims, but in the context of the game and its style, it actually fits quite well and I was happy to hear these tracks in there.  Drome Racers captures the essence of the LEGO racing world pretty well. The cars look great, as do the environments. Almost everything about it stylistically matches up to the license. The game's graphics engine is pretty solid and everything moves at a pretty quick pace. Add in the weapons and you've got quite an action-oriented racer.The game's downside is that it doesn't control as well as it should. The off-road cars control reasonably enough, if not in an entirely realistic manner. On the other hand, the paved road cars don't handle as well as they should. They're a little too unforgiving in their steering, so driving them requires care to make sure you don't slide at all, as opposed to trying to slide and drive aggressively and then trying to regain control of the car. The end result is that they're just not as fun to drive as they could be.", "date": "Oct 1, 2003"}