{"name": "Robin Hood: Defender of the Crown", "name_review": "Robin Hood: Defender of the Crown", "ref": "https://www.ign.com/articles/2003/10/07/robin-hood-defender-of-the-crown-3", "text": "For gamers seasoned enough to have played with the Amiga, Commodore 64, and Nintendo Entertainment System in the mid-1980s, Cinemaware's Defender of the Crown probably sticks out as one of the era's most notable multi-platform releases. Unapologetically billed as an ~Interactive Movie~, its story of a misled English Coup during the time of Robin of Locksley was truly an epic adventure. With elements of strategy and action combined under a single banner (something rarely seen for the time), its area of appeal stretched far and wide and its placement as one of the most sought after games around was definitely assured.   More than 17 years after its initial debut, Cinemaware has now returned to the source material that helped to define its company so long ago. Moving players out of the role of Locksley's friend Ivanhoe and into the guise of Robin Hood himself, Defender of the Crown is a modern remake of admirable proportions. In fact, it replicates just about every single mechanic that powered the original title in 1986. And while this can potentially serve as the game's greatest and most rewarding strength, it can also turn into the title's most glaring flaw. The real question is: which philosophy does it equate to best?   Gameplay  In its most basic form Robin Hood: Defender of the Crown is primarily a turn-based strategy game. Requiring players to seize and unite various areas of medieval England while simultaneously thwarting the efforts of Prince John and his crony the Sheriff of Nottingham. To accomplish this goal effectively, however, users will have to use a myriad of different action-oriented mini-games to carry out their tactical plans. As we originally mentioned in our lead-in, the setup is almost identical to the first Defender of the Crown and offers the same method of victory that we had before. Jousting, sword fighting, and siege attacks have been resurrected in addition to a few new areas of influence specifically incorporated to mix strategy and action as seamlessly as possible.    In fact, it's Defender of the Crown's steady balance between these two genres that stick out as one of the game's most outstanding merits. While a good part of the strategic element involves picking what land you want to conquer and which counties need to be joined, finding the funds and manpower to do so can only be funded through raids headed up by Robin Hood. If gaining the resources by a more regal means sounds more like your modus operandi, however, then a simple talk with Ivanhoe will allow you to host jousting tournaments against every other baron in the land. Stand victorious and not only will your reputation increase, but so too will your bank account and even your property. As you can see, each type of mini-game provides different sorts of rewards, and with the unscripted nature of these contests they should never provide the same challenge twice.   To the game's benefit these sequences are actually pretty fun -- whether you're raiding your enemy with bows or swords or challenging someone to a joust, the whole approach is pretty solid. Spoils rewarded for good performance match up well with the skill requirements for a particular challenge too; with the relatively easy bow and arrow approach providing the smallest amount of pittance and the majestic jousting ceremonies paying off the most. To be truthful jousting can be a little too hard, as the correct aiming of your lance takes hours upon hours of practice to master an intermediate-level skill. Though the simple fighting-oriented sword duels stand out as the most accessible and entertaining of all mini-games.   Of course there are other ways to gain finances as well. As the more land that you and your band of merry men has a control over, the more gold you can collect in taxes. Join together several areas that are part in the same territory and you'll enjoy bonuses for reuniting them. As your fame and reputation continue to grow, so too will the things available to you; and before long you can have the might of an entire empire under your grasp. Luckily there are several ways to earn an ultimate victory should your military efforts prove unjust. Paying to have the King ransomed out of Austria or defeating Prince John are just a few of them.   With all the elements that come into play, Defender of the Crown is overly enjoyable -- especially for fans of strategy titles who want to be able to pick up and play something without too much of a hassle. The simplified nearly turn-based battle system is easy enough to understand and has enough layers to warrant an actual stratagem despite a less than exciting presentation. While the castle-destroying siege missions you'll embark upon are cool enough to make them worth the wait that it takes to get to them.    Unfortunately, Robin Hood isn't without a couple of key issues that hold it back from ascending the legend of its inspiration; with its most troublesome problem being its finite limitations. Because of the fact that it's designed around a single story, players will only be able to assume the role of Robin Hood for the entire adventure. In this day and age of bigger and more epic strategy titles, having the ability to play as only one side in a group of eight can feel pretty restricted --no matter how many options are available to you. But even then the options aren't that many, with only five different kinds of battle units and the same three-step development process used for each captured territory (re: recruit a defending army, build a stronghold, upgrade, and repeat).   Another area of concern is that there is no difficulty setting for the strategy portion of the game. So while it's great that Defender of the Crown is challenging, it could chase away potential newbie converts with its overwhelming challenge in the later moments. More accurately put: your opponents get huge destructive armies much quicker than you do and can raid you just as easily.   This imbalance means that you'll gain and lose land, troops, and money more often than not, and unless you find a way to build massive defending armies early, are faced with dozens of hours of figuring out how to expand your empire beyond four or five locales. The only real way to do it is to take one or two satellites and hope not to get attacked as you upgrade them for several game months. It definitely exposes how minute Defender's scope can be.   Graphics  From an artistic standpoint Defender of the Crown appears just as we expected it to -- as a modest reinterpretation of a 17-year old game. The map screen itself is pretty basic with nothing more than a few icons and landmarks to discern what kind of country each army inhabits but the character faces are well animated. Battlefields and war sequences are far from interesting, however, as they appear as little more than chess-like icons on a miniature game board.   On the plus side, the character models and backgrounds used during the mini-game sequences are considerably better; with some excellent lighting effects and cinematic camera angles utilized in the sword sequences especially. The CG-rendered cut scenes are even more of an improvement with solid direction and an ample use of shadows, light, and expression. That said, Robin Hood still isn't anywhere near as good-looking as most of today's turn-based and real-time strategy offerings. But at leas it gets the job done.   Sound  One of Robin Hood's most compelling attributes is the top-notch voice acting. Each and every character that's given vocal life bursts out of the speakers with stunning believability. Cinemaware grabbed itself a great bunch of actors and all of them capture the demeanor and personality of their characters very successfully. Musically speaking the game is just as strong, with Sherwood-flavored horn and string instruments powering an overwhelmingly upbeat and classic soundtrack.   The only real audio problem we ran into are the default mixing levels of vocals compared to score. Too high on the musical end, it's not uncommon for a lot of the actors to get drowned out by a suddenly epic piece of the composition. Luckily this can all be adjusted in the options menu.Taken for what it is, Robin Hood: Defender of the Crown is a very faithful and entertaining remake of a title that today's more experienced gamers had the pleasure of growing up with. Accurately recreating the same tactics and mini-games that motored the original software so many years ago, nostalgia buffs and open-hearted genre freaks should immediately take notice.If you've never heard of Defender of the Crown or like your strategy deeper than the simplicity offered here, however, then Robin Hood definitely won't change your mind any time soon. Battles are from epic, the expansion model is limited, and there isn't anything to do outside of playing a single Sherwood adventure. Worth a try if you enjoy the source material or have an affinity for the time period (those folks should get several hours of enjoyment out of it); but it's better left alone if you don't.", "date": "Oct 7, 2003"}