{"name": "Pharaoh", "name_review": "Pharaoh", "ref": "https://www.ign.com/articles/1999/11/13/pharaoh", "text": "I have always found something so compelling about world building games. From my first moments with Populous and SimCity, watching my people spread out over a virtual landscape with buildings of ever growing complexity, I was hooked. But while I have enjoyed my countless hours with titles like Lords of the Realm, Settlers, and Caesar, there was always something missing  a sense of truly grand accomplishment. With Impressions' latest historical world building game Pharaoh, I've finally been able to fill that void in my play experience.  The basic idea behind Pharaoh is pretty simple  you start the game as a leader of a small tribe in Egypt. You must build a village and help your people flourish. With each successful village, you will move forward in time and take on the role of one of your offspring leading larger groups of people as they take part in the grand history that made Egypt one of the most thought-provoking empires of all time. As you slowly try to lead your family to eventual control of the nation, you'll have to gather resources for Pharaoh, build increasingly massive tombs for the city nobles and appease the often-fickle gods of Ancient Egypt. It's never easy, but the sense of accomplishment at the end of each mission is well worth the trouble. Those who are more concerned with building the largest city they can will be happy to know that the game doesn't automatically end at the completion of a mission  you can choose to keep governing any of your cities to watch them flourish for as long as you like. Eventually your family will be given assignments of greater and greater importance until one day when you will have accumulated the power to take the throne for yourself.  Living With The Nile  One of the greatest challenges to life in Ancient Egypt was the fact that farming could only be done on the narrow strips of land right next to the Nile. As if this wasn't problem enough in and of itself, once a year, the Nile flooded, leaving rich deposits of silt that made the land suitable for growing again. If the floods were good, then huge crops grew and everyone was happy. If the floods were not good, everyone starved. In Pharaoh, Impressions has done a tremendous job of recreating this annual event. Each year you'll watch as your fields are covered over by the Nile's waters. When things dry out a bit, you'll send your workers back in to start harvesting the many bounties of Nile Delta farming  flax, barley, grain, figs, and chickpeas just to name a few. If the floods were too low, the land may not receive the nutrients it needs and your harvests will be light. If the floods were too high, your crops may be destroyed (as well as buildings that were too close to the banks of the Nile. Since you have to feed your people for an entire year on the fruits of your labor, you'll find that overproduction and mass storage is the best way to ensure long term survival. Unfortunately, on most levels (as was true in Ancient Egypt) there is very little land available that is suitable for crop production.  Living With the Gods  One way to ensure better crops is too make sure that you stay tight with the gods, particularly Osiris. In Pharaoh, the gods are a very real presence, and must be appeased if you don't wish to see you towns fall apart at the seams. Each town will have at least one patron god that must be kept happy with the construction of temples and shrines and with frequent festival held in his/her honor. In addition to this main deity, some towns will pay homage to two or three (or more) others who must be similarly appeased. Be careful though, if your patron deity ever feels like the other gods are receiving more attention that he is, you're in for a world of trouble. Dealing with the gods is a major part of the game, and in a lot of ways is like taking care of a small group of very, very powerful kindergarten kids. If you make the gods happy, they'll do nice little things for you that fall within their particular realm of influence. If you ignore them or make them angry (which is very easy to do), they'll immediately go on a rampage causing untold destruction to your people. As it's not easy to keep everyone happy all the time, it's important to learn which gods control areas that are more important to your immediate goals and work to keep them happy so that they will help you out (or at least not mess you up). Here's a quick look at the lineup...  Osiris: Osiris is your basic agriculture god (he also served a lot of other purposes, but for right now let's stick with the basics). If you please him, he will ensure good floods on the Nile and if he's really in a good mood, he might fill your granaries with food. Make him angry and he will weaken the floods, destroy farms, or even spirit away your food. He is without a doubt the most important god in the game, and keeping him happy should always be a top priority.  Ptah: God of industry. He can help ensure good trade with your neighbors or better production in your various production businesses. Make him angry and he'll start destroying your warehouses. Since city growth depends on how many different goods your people have access to, this can have a very adverse affect on the future of your town.  Bast: Cat headed goddess of the home. Bast takes care of daily life in the individual homes of your people. When she's happy, she can raise your city's morale, or let the other gods know how wonderful you are by throwing a festival. When she's unhappy, she can turn your own people against you or strike them down with the plague.  Seth: While the god of destruction may not seem like the kind of deity who'd be a lot of fun to have around, his presence is vital on any missions where you face aggression from outside invaders. When he's pleased with you he will strike down your enemies before they have a chance to wreak havoc on your towns. Getting him pissed off has its obvious disadvantages.  Ra: Ra is the god of the kingdom, and he can really make life easier for you. When he's in a good mood, Ra can increase your standing within the kingdom and help make trade more rewarding. When he's not happy, he can see to it that everyone in the kingdom makes fun of you. Since you usually need a certain Kingdom score to end a mission, it's definitely a good idea to keep Ra happy. Otherwise you may spend an eternity as nothing more than a minor noble.  Once you move to the later levels of the game, you'll be able to build Temple Complexes to your favorite deities. These huge complexes not only keep the gods associated with them very happy, but they also allow you to construct associated buildings that will grant your priest special powers. Since this sounds kind of unclear even to me, I'll provide a few examples. After you've built a Temple Complex to Ptah, you'll be able to construct the Altar of Amon, God of the Sun. Possessing this altar will make your quarries, woodcutters and bricklayers work more quickly. You'll also have access to the Oracle of Thoth, God of Wisdom and Learning. When you have one of these structures built, your scribes will require less papyrus to teach the citizens of the city. Building a Temple Complex to Osiris will give you access to the Altar of Sebek, God of Fertility. Once you've built this altar, your priests will be able to make every household they pass satisfied with less food. Another advance, the Oracle of Min, God of Regeneration, quickens the rate at which trees, reeds and wildlife grow back after being harvested. When you finally manage to master these major halls of worship, you'll find that your job will suddenly get a lot easier... at least in some ways.   Living With Business  Once you're sure that your people are fed and that the gods are not planning to strike you down, you'll need to get to the task of creating a cultured society that has everything it needs to grow. To make sure that your people have enough to eat all year round, you'll first need to build a granary or two. These massive structures store any available food and then distribute it when it's called for. When these buildings empty out, it had better be getting close to harvest or you're going to start loosing citizens. To distribute the food held in granaries to your people, you'll need to build bazaars. These structures will buy any available goods (you can determine yourself what is available) and then sell them to the people who live nearby. If a house doesn't have bazaars near it, it won't grow.  Once you've managed to get houses access to the basic goods, you'll start to notice that they still will only grow so far. Bigger houses are built by wealthier citizens. Wealthier citizens require several different goods to move in. How do you provide those goods? There are two ways. The first is to make them yourself. Each of the different end goods used in the game  pottery, linen, bricks, weapons, beer, papyrus, etc, starts out as a raw material (clay, flax, clay and straw, copper, barley and reeds) that must be gathered by a group of workers, carried to a storage area that is run by another group of workers, carried again to production facility run by yet another group of workers where it is turned into the final product. The more of these produced good that are available to your citizenry, the bigger their houses will grow and the more taxes you'll be able to collect. The second way to gather these goods is by trading with other cities. By opening up your world map, you'll be able to get an idea of the different cities that are nearby. When you click on their icon, you'll see a list of what that city has for sale and what they are willing to purchase from you. Another click will allow you to open a land or sea trade route to that town (this costs money, sometimes a lot of money) and the goods will start arriving. In addition to providing good to your population that you might not be able to manufacture yourself, tade is an excellent way to fill your coffers with gold. Selling off the extra goods you have lying around can be amazingly profitable, something that is very nice when you are about to undertake Pharaoh's ultimate challenge  the construction of massive monuments.  Living With the Dead  You know the phrase, ~You can't take it with you?~ Well the Ancient Egyptians believed that you could. Provided it was properly prepared and stored, an object would appear in the afterlife next to the soul it belonged to. As you can imagine, some of the richer people in the world started to want to take a whole lot of stuff with them, complete with servants, cats and even entire boats. Unfortunately, storing all of this gear for the rest of eternity not only took up a lot of space, but it was also a touch morbid to all of those who had not yet traipsed off to their final rewards. The answer the Egyptians came up with was to build lots and lots of huge funerary structures that contained plenty of room for all the gear a wealthy body needed to survive in the underworld. Hiring the best architects available, nobles would construct these great tombs to be safe on the inside (don't want nobody stealing your goodies while you're too dead to defend yourself) and impressive enough on the outside so that people actually liked looking at them.  The same monuments play a very large role in Pharaoh. Every so often your leader will command you to construct one or more of these huge testaments to death. While there's no doubt that they make your city look snazzier, they can be a real headache for your city's infrastructure. First off, you're going to need a lot of labor to build the things. Since Impressions has decided not to use any sort of references to slavery in their game, this means that you're going to have to make a bunch of work camps to find workers, build several tracts of homes to house them, and come up with a lot of gold to pay them every month. As if this wasn't bad enough, there's the issue of the building materials to deal with. Building Mastabas, the most basic of funerary structures takes loads and loads of bricks, which must either be manufactured in your city from straw and clay (which takes workers to gather the clay, grow the grain, and to put them together into bricks) or bought from other cities (which takes loads of cash). You'll also need access to a Bricklayer's Guild to bring in architects who are competent enough to show your basic workers where to put the bricks. Later monuments are even more of a headache. Pyramid Complexes (the game's ultimate structures) require you to find a huge site on the west side of the Nile (these things are important to the gods). Next you'll have to first build the pyramid out of bricks or stone (which you'll have to mine) and then later you'll have to build a layer of limestone around it. The whole process takes a really long time, during which your city's resources will be under a remarkable strain. Still, the end result is spectacular and makes you feel as if you have really accomplished something amazing.  The Wrap-Up  Graphically, Pharaoh is a mixed bag. While the artistic design is amazing, and all of the structures and animations are brilliant, the display resolution seems a bit dated. The interface uses hieroglyphs to display all of the options to available to you, a feature that is cool looking, but kind of confusing until you get the hang of what everything means. With all that said, the game's plot animations are the finest I've ever seen in a game. Whoever did the work on these things deserves a beer and a big raise.  The same goes for the person responsible for Pharaoh's soundtrack. All of the music has a period feel, but is so catchy that I found myself humming it on the way home from work. And since it changes up as you go through the game, you never find yourself getting tired of a certain song. This is one of those rare, perfect soundtracks that you'll actually turn up to increase the suspension of disbelief. Sound effects are also impressive, although there don't seem to be all that many of them. Still, since you'll be spending hours on each level by the end of the game, maybe this is a good thing. Listening to pick axe fall on rock for three hours can be a little stressful.  I did have a few issues with the gameplay, but most of them sorted themselves out after a little while. First off, a lot of buildings will disappear if you don't give them road access. That's fine as a rule, but they disappear so fast that it can get pretty hard to get a road there in the first place. I also had a problem with the fact that certain on-screen warnings automatically center you on the problem and repeat themselves over and over. I build a small community of reed gatherers on the far side of a flood plain in one mission and couldn't accomplish anything else because the screen kept jerking back to the sight of their encampment once every few seconds every time the floods came. Finally, I wasn't completely happy with the combat engine. Getting your troops to attack enemy soldiers can be a real pain in the ass, especially when you need them to board a boat to get to the fight. All in all though, most of these problems only caused me momentary frustration and never ruined my ability to enjoy the game.  In case you haven't figured it out by now, I loved this game. Pharaoh's blend of addictive gameplay and excellent mission design kept me at my computer straight through many nights, a rare occasion after ten years of writing game reviews. Furthermore, the game's ability to be very historically accurate while at the same time remaining entertaining was a constant source of wonder to me. I highly recommend that every fan of the SimCity or Caesar game line, or anyone interested in day to day life in early Egyptian culture rush right out and pick up a copy of this title. A fantastic example of the genre.  -- Trent C. Ward", "date": "Nov 13, 1999"}