{"name": "Jimmy Neutron: Jet Fusion", "name_review": "Jimmy Neutron: Jet Fusion", "ref": "https://www.ign.com/articles/2003/10/10/jimmy-neutron-jet-fusion", "text": "marks the third time the Nickelodeon hero's graced the Game Boy Advance screen, and for the third time, the game just doesn't hit the mark. It's a little silly to expect hugely innovative ideas in a quick-produced licensed handheld videogame, but it would be nice to crack open one of these titles and find something unique. Jet Fusion definitely isn't a ~bad~ game, and in fact for what it is this title offers an extensive and somewhat satisfying experience for the young kids. But ~flawed and generic~ are two adjectives that spring to mind when playing the game. Features Four levels Two Goddard enhanced abilities Four mini-games Password save   Jimmy Neutron has always had a penchant for building overly complex inventions to solve miniscule problems -- even if his inventions always back fire in one way or another. In Jet Fusion Jimmy creates a machine that will project a book's contents into movie form. However, the containment field gets fried, sucking the town of Retroville into the book (which just happens to be about Jet Fusion, the renowned James Bond-like spy). Not only is Jimmy inside a spy novel, but all of Jimmy's friends have been turned into super-villains. It's up to the Boy Genius to work with Jet Fusion and stop Calamitous from taking over the real world.  What Jimmy Neutron: Jet Fusion boils down to is a game design that might be compared to Mega Man or even Metroid, but definitely not quite as intense or challenging; players not only have to have a handle on platform-jumping skills, they also have to be quick on the trigger when it comes to fire-power. Enemies swarm Jimmy as players work their way through the different levels, so what's an action game without the ability to take 'em out with a little firepower? Jimmy's standard-issued blaster might be plenty to get rid of these enemies, but to offer a bit of variety players can pick up limited weapon like grenades (micro dischargers) or a gumball blaster that have their own strengths when used.  The problem with the Jimmy Neutron design is that it feels like its levels are intentionally made as large as possible simply to make the gamer think that the game is absolutely massive. Levels seem to go on and on and on, but elements are spread out which definitely affects the feel of the action...it never becomes ~intense~ because areas are pretty wide open with plenty of running space. Exploration isn't really an issue since the levels are laid out pretty straightforward and force players in the direction they need to go...it's made for kids, and apparently developers are encouraged to ~spoon feed~ challenges to the younger crowd in order to give them a sense of accomplishment. There are some branches in the levels, sure, but the payoff for straying from the main path is hardly worth it...they only lead to additional weapon collectibles and energy power-ups that are plentiful in the standard areas. Occasionally there's a main weapon upgrade scattered in the secondary branches, but the upgrade they offer aren't really worth the little effort required to finding them. And upgrades to Jimmy's abilities are simply handed over, requiring players to just get to that point in the game in order to earn that new feature.  The mission tasks are very formulaic: each level requires players to seek out three different parts to ~fix~ a particular machine blocking access to the boss and the next level. Essentially, it's a ~door~ that requires three ~keys~ to open. Brilliant! It's something that's been done in half a bazillion other action games before it. However, the developers of Jet Fusion do manage to offer a bit of variety by creating mini-games for these particular doors: a pachinko machine with physics that are actually pulled off quite nicely, for example. But it doesn't look like these mini-games can't be accessed outside the main game once they're discovered. Maybe we can fault the cluttered password saving system for that omission?  And while there are no complaints in the character animation, the game's graphic design doesn't stay consistent with the established Jimmy Neutron cartoon style because it.bounces back and forth between pixel-art to 3D rendered character profiles. Jet Fusion may have been developed by a studio with experience on the handheld, but no real effort was made in actually showing off techniques or technologies that the team has created in the few years the guys have spent with the system. I guess it's just slightly underwhelming to go from last year's very ambitious (but flawed) 3D engine in Jimmy Neutron vs. Jimmy Negatron, to this 2D side-scroller that fails to impress visually...even just a little bit. Is Jimmy Neutron a bad game? Heck no. It's just not a very good one. It will certainly take players a good amount of time to get through the game's five different levels, but that's only because the levels just go on seemingly forever with very little to do beyond blasting the occasional enemy that wanders into sight. The password system for the game's save capabilities instead of the slightly more expensive SRAM is a pretty good clue that THQ might not have been overly worried about pouring a whole lot of dough into the game's development. The developer in turn created a very average, generic, and flawed GBA adventure.", "date": "Oct 10, 2003"}