{"name": "DemiKids: Dark Version", "name_review": "DemiKids: Dark Version", "ref": "https://www.ign.com/articles/2003/10/14/demikids-dark-version", "text": "Nintendo's Pokemon series didn't originate the whole ~catch 'em all~ design element in roleplaying games, but it certainly was the one that popularized the idea. Like it or hate it, Pokemon is one of the most successful RPG series ever created, so it's not a mystery why other software houses look to that design for inspiration on other titles for the Game Boy system. Atlus has had its fair share of Game Boy RPGs that lift the basic collect-and-battle design aspect, from the  Robopon series to Revelations. The company's latest effort is DemiKids, an adventure that, again, spans two versions of essentially the same game. And while the game offers an extensive challenge and a somewhat interesting storyline, DemiKids is a bland-looking roleplaying game that offers absolutely nothing new in  its game design, other than giving another stack of creature designs to collect. Features More than 350 creatures to catch Cartridge save (one slot) Link cable support for two player battles DemiKids is actually the next in line of the Shin Megami series (released in several incarnations in the US as Last Bible and Revelations), and shares similar design ideas. There are two different flavors of DemiKids, the Light Version and the Dark Version; like most ~dual branded~ Game Boy titles, the two editions of DemiKids are essentially the same game with slight alterations to encourage players to either A) seek out someone with the other version for trading, or B) play the game a second time.  The DemiKids series introduces two school children characters who are recruited to help seal a rip in time that's tearing the demon world, Valhalla, apart. To do this, players will have to battle a seemingly endless wave of more than 350 different demons by sending their own demons to do the dirty work. Some of the 350 monsters are in Light Version and not Dark Version, and vice versa, and only those players who have traded between the two games will be able to see all there is to see in the entire DemiKids world.  To successfully seal the time rip and bring peace to the demon world, players will have to work their way through a very large and expansive overworld of many different towns, each with their own series of characters and conversations that open up the story of DemiKids. Along the way, players will be faced with the very, very familiar and arguably tiring element of random battles in the wilderness between towns. Here, players can choose to do battle in turn-based fashion, converting attack points and magic points into offensive and defensive moves against the enemies they face...as many as three at a time. Or, like in the Game Boy Color Revelations game, they can use the art of conversation to attempt to recruit that particular monster on their side. It's essentially the same idea as the Pokeball, but done in a more submissive way. I guess forcing monsters to join your cause just wasn't what the designers wanted, because it's the monsters' choice whether they want to side with the player or not. Like Pokemon, players can trade their creatures and go to battle through the use of the Link Cable, but don't expect anything that hasn't been done already.   There are more than just slight alterations to the game design between the two games. The biggest difference is, of course, the lead characters in both versions, as well as the starting creature that players begin the quest with. Also, in Dark Version, players actually branch off into a different area before rejoining the quest that's established in Light Version and learns a bit more about the goal of the game before players of the other version do. It's this extra side quest that makes Dark Version a more challenging game. But players are given the upperhand in Dark Version because of the ability to alter and adjust the parameters of all party members...instead of just tweaking the main character and lead monster in Light Version.  Despite having some of the most energetic Game Boy Advance boxart on the market, DemiKids is actually a strikingly dull role-playing title on the Game Boy Advance. It never really tries to be anything more than its ordinary self, never offering much more than the stereotypical Japanese, turn-based game design. And it does it with very little flair; menus are bland with odd ~shareware~ like fonts, conversations are obviously kept simple because of the aim towards the ~Kids~ side of the fence. The game does have a decent amount of artwork for the 350-plus creatures and multitude of different characters in the adventure, but it's just art.  Battles are extremely bland because of the lack of any animated ~flair.~ This was something that Pokemon also lacked, but believe it when I say that DemiKids features even less animation during the battle than the latest Pokemon title. Without any graphical ~oomph~ for the battles (of which takes up more than half of the gameplay time in DemiKids), the fights are a drain on the player's patience because, other than a new random demon creature that may pop up, there's not much new to experience. Because the quest is extensive with plenty of levelling up opportunities, folks who really dig the wander-around-until-a-random-battle-occurs Japanese RPG gameplay will probably be able to swallow the game design of DemiKids. Personal biases against the random battles aside, I think that DemiKids isn't that great of an RPG simply because the designers don't go that extra mile to give the players a real bang-up experience, instead simply relying on basic gameplay elements and an extensive line-up of creatures for its design.  There's nothing here that seems to give players a real sense of excitement beyond the discovery of new creature creations throughout the 20 hour experience...and that's just not enough to hold the casual gamer's attention. The bland random battle element only enhances the game's ~ordinary~ status.", "date": "Oct 14, 2003"}