{"name": "Crouching Tiger, Hidden Dragon", "name_review": "Crouching Tiger Hidden Dragon", "ref": "https://www.ign.com/articles/2003/10/15/crouching-tiger-hidden-dragon-2", "text": "is just a bit late for its party, showing up on the Game Boy Advance a good three years since the original theatrical release. It's also a strange game to base an action game around. Yes, there were some really great action scenes in the film, but it was more story than fights. But Ubi Soft went to town to produce a game design that incorporated certain elements from the movie, and though the GBA game isn't entirely original and very, very short, it's at least a satisfying experience in the time it lasts. Features More that a dozen levels Password save  Ubi Soft's GBA rendition of Crouching Tiger Hidden Dragon puts players in the role of Jen, the young thief who's mislead by Jade Fox to steal the legendary Green Destiny sword from its rightful owner, Mu Bai. The game opens up during her escape after swiping the weapon, and the fight is on. Ubi Soft's China development studio was put to the task to recreate the movie in action form, and The game itself is essentially a side-scrolling action game where players not only have to attend to the seemingly endless wave of enemy characters and creatures with combat skills, they also have to maneuver through platform designs to reach the next part of the level. The storyline of the game unfolds through some really awkward cutscenes where some artist pieced together cutouts of the actors over digitized backgrounds, and in some places it's difficult to tell who's talking during the text dialogue. Unless you've watched the film, you probably won't know what the heck's going on.  The developers definitely tried keeping it simple without any real focus on exaggerated combos, so the player's character doesn't have a whole lot of moves in her arsenal. Her combat techniques are simple slashes and kicks that are all handled by mashing on the B button. Combining certain controller directions and jumps with the B button will add a few more attacks to the mix, but in all honesty the game doesn't require a whole lot of strategy to wipe out the enemies. These guys are very easy to read in their own attacks, so avoiding taking damage is not terribly hard to do...at least early in the game.  That's not to say that there's not much to do in Crouching Tiger Hidden Dragon. There's actually a good amount of variety in the levels. Players will have to pull off wall-jumps in order to reach certain levels, or use collected power-ups to perform supermoves or heal poison and confusion states. There are even subtle nods to the film: some levels require leaping up on tree branches and jumping across water surfaces. It's a nice touch.  Deeper in the game the design moves from its standard platform action to brief changes where players ride a horse through some hazardous terrain. There's even a forced-scrolling level where players must outrun rising fluid...it's a nondescript green goo. Really.  The overall difficulty level is a bit on low side because the designers throw as much help at the player as possible. Extra lives are easy to score thanks to not-so-hidden green dragons that award one-ups after collecting just ten of them. And while it's inevitable that players will take damage during the game, it's easily replenished because someone has scattered chicken all over the battlefield. Hey, it's the gaming cliche: when it doubt, use cooked chicken as a health powerup. But because it's not a terribly difficult game, Crouching Tiger Hidden Dragon is a short adventure. Three hours and you've finished. The developers throw in a small incentive in the form of two endings, but since it's pretty clear why you get the ~bad~ ending, it's a simple task of repeating the last level to get its ~good~ ending. If you're like me, some days you just want to have the satisfaction of kicking back with an action game and completing it from start to end. Crouching Tiger Hidden Dragon definitely scratches that itch. It's not very a very original adventure, but the team at least put together a solid, enjoyable, but extremely short design for GBA gamers. But please rent the movie if you want to understand the story.", "date": "Oct 15, 2003"}