{"name": "Mega Man Zero 2", "name_review": "Mega Man Zero 2", "ref": "https://www.ign.com/articles/2003/10/17/mega-man-zero-2", "text": "The Game Boy Advance is quickly becoming the Mega Man system. In its less than three years on the market, not only has Capcom created two original Mega Man game series in the form of the Mega Man Battle Network and Mega Man Zero, but has also brought back a long-lost gone portable with Mega Man & Bass. But just as the company did back in the NES days with the original Mega Man series, Capcom's churning out sequels to its GBA series, creating new experiences by reusing assets from the past games in the series. It's certainly worked out for the company as it can produce sequels on a faster than yearly rate, and it's worked out for fans of Mega Man as they can get their hands on more of their favorite game franchises. Mega Man Zero 2 is definitely among  this tradition. When the series was started last year, it was the first real and original Mega Man game for the Game Boy Advance, and because of that it definitely added to the game's excitement value. Mega Man Zero 2, a continuation of last year's adventure, builds upon everything already established in the original Zero, and though it definitely adds a few new elements to the mix, there really isn't anything here you haven't experienced already... it's just a lot more of it. More CyberElves, more abilities, and more frustratingly difficult level design. Mega Man fans know just what they're getting into, though, since Capcom's notorious for its almost evil level design, and in this sense, yes, Mega Man Zero 2 is a worthy follow-up to the Mega Man line. But it's not as special or as significant release as the original game was when it hit shelves last year. Features New forms and skills to acquire Cartridge save (two slots) Link cable support for two players Mega Man Zero 2 is set a year after the ending of the original Mega Man Zero, in a world where reploids are unjustly attacked by an organization called 'Neo Arcadia.' Early in the game, Zero falls prey to a trap set by Neo Arcadia's ruthless and newly self-appointed commander. Though she appears on the surface to be fighting for the good of the world, she tricks Zero into helping her with her ultimate plan and use him to wreak chaos between reploids and humans.  Players are faced with the same gameplay that was already established in the original Mega Man Zero: blast through run and jump, enemy infested areas and complete these missions in order to advance the story forward. Last year's game was a little sloppy in its mission layouts, but it's been tweaked better for the sequel since players now have unlimited continues to complete the specific level. But that doesn't make it any easier, since players still have to get through the challenges with their storage of extra lives (usually three in reserve)...and if the level challenges don't get you, the end level bosses -- these gigantic monstrosities with wildly varying attack patterns -- definitely will. Just as with most of the Mega Man action games, the game does really boil down to one specific pattern: waste your lives by memorizing the level layout and perfect your abilities until the end boss. Then, it's all a matter of losing your lives trying to defeat the end boss. Mega Man does rely heavily on hardcore gaming skill, but don't be naive...there's a ton of trial and error involved as well. Along with the player's standard blaster and sword abilities (both which upgrade in abilities the more you use them), players can also equip more ~weapons.~ The most significant is the Chain Rod, which is essentially Capcom giving Zero the same ability as another one of the company's past videogame heroes, Bionic Commando. Players can utilize this chain to swing from ledges as well as grab out of reach items (or bring enemies up close). Level designs definitely put this Chain Rod to use in several places, which makes it a good thing that players can easily equip it as Zero's main or secondary weapon. The clean controller interface is definitely one of Mega Man Zero 2's strengths, but trying to use the Chain Rod is a little frustrating. It's a little stiff in its design, and collision has to be absolutely precise...and in many levels, if players can't get that Chain Rod off at the right time, it's a quick life lost thanks to the many, many, many bottomless pit deaths in Mega Man Zero 2. CyberElves also make a return in this sequel, and there are a lot more of them. CyberElves are Mega Man Zero's version of the Pokemon element of collection; if players find these fluttery little sprites after defeating an enemy, they can scoop them up and utilize their specific powers during the action. Some turn on-screen monsters into power-ups, others freeze them in place. Zero can only have one CyberElf equipped during a level, so it's a bit of a strategy for players to pick the right elf for the job. But their appearance is almost entirely random...though specific ones hang around the same area, they sometimes just refuse to appear. There are other enhanced elements in this game, including the Mega Man-esque ability to use acquired boss power-ups for a near perfect level run, as well as upgraded, palette-swapped forms players can collect throughout the game...there's not a whole lot in this sequel that makes it a whole new adventure. Except for maybe the multiplayer support; find a friend with a copy of the game and you can go head-to-head with them in three different ~race~ type modes. It's definitely a neat and welcome inclusion, adding a little more competition to the game design. Yes, this game is hard. Like the other members of the Mega Man franchise, Zero 2 features some of the most challenging videogaming you'll ever experience because the designers never let up on the difficulty. It's meant to be a tough game, possibly to give players a real sense of accomplishment defeating these level creations. But it certainly wouldn't hurt the game if the creators sloped the difficulty curve a little more in the player's favor, especially early in the game. If you're frustrated easily, this game is not for you. If you loved the original Mega Man Zero there is absolutely no reason why you won't love this sequel...unless, of course, you're looking for a brand new gaming experience. What it lacks in new elements it makes up for it in tighter design and more ass-kicking level designs...don't think for a second that this game is going to be a simple trek through. If anything, it's an excuse to see just how much patience you have, and just how much gaming skill oozes from your fingertips.", "date": "Oct 17, 2003"}