{"name": "GTA: Vice City", "name_review": "Grand Theft Auto Double Pack Review", "ref": "https://www.ign.com/articles/2003/10/22/grand-theft-auto-double-pack-2", "text": "I'm only going to say this once. You're a fool if you don't already own Grand Theft Auto III and Grand Theft Auto: Vice City. Now, if you're in a coma, or you're 12 years old and your parents actually read game labels (all 2% of you), I understand. Otherwise, forget it.After its unprecedented 2001 hit, Grand Theft Auto III, and the 2002 blockbuster Grand Theft Auto: Vice City, Rockstar Games has bundled the two games together for the sweet price of $39.99 so you can repent past mistakes, sins and foolishness (and whatever else you're guilty of).The deal is good for two main reasons: 1) Both titles are exquisite, absolutely hilarious, brilliantly designed, and deep, and both are well worth the full price of admission; 2) Now that Rockstar has lowered the price of GTA III to $19.99 (as a PS2 Greatest Hit) and GTA: Vice City to $29.99 (also as a PS2 Greatest Hit), this bundle is $10 less than those two individual games bought separately. It's a bargain, do go get it.The Grand Theft Auto Double Pack is not a remake. It's a straight bundle. The two games are exactly the same as the originals in content, graphics, gameplay, sound -- everything. The two games contain the same brilliant passages, the same technical dilemmas, the superb soundtracks. The Xbox bundle, coming out November 4, 2003, is the one with the minor graphic changes, the slightly modified hands and fingers, and the like. Not this one. The only differences are the box art and the price.Grand Theft Auto IIIAfter writing 5 million words on this DMA's dramatic first venture on the PS2, I'm surprised there is anything left to say. Putting aside all the chart-topping awards, the talk about its great design and the other things it's garnered, Grand Theft Auto III is, quietly plainly, a hell of a game to play. It's easy to get into and arcade-friendly. Taking place over what is the equivalent of miles and miles of polygonal real estate, it's easily one of the biggest games on the PS2.Players will find themselves addicted to hundreds of missions, engaged in the characters and deep storyline, and challenged to find all those damned hidden packages. The open design will please you, the citizens will tickle you with the things they say, the special jumps and five-star criminal ratings will make your heart beat like never before. And you'll love the ongoing radio commentary. In short, Grand Theft Auto III is just as brilliant as ever. It's an indisputable must-have game.Check the full GTA 3 ReviewGrand Theft Auto: Vice CityUnlike its dark, gloomy and brooding brethren, Grand Theft Auto: Vice City is like a pink sunset and a glass of Bartles and James. GTA: Vice City is a time-machine that deposits gamers into the early 1980s in an American city not unlike say, Miami, Florida. The differences and improvements between the two are small yet massive, minor in subtlety but major for those who are paying attention.The lead character actually has a name (Tommy Vercetti), he can talk (thanks to the keen voice acting of Ray Liotta), and the story is like a blended margarita of Scarface and Miami Vice, replete with lots of Mafioso backstabbing, double-crossing and surprise characters. Players ride cars and motorcycles AND boats; they can buy real estate (therefore setting up numerous bases); there is a slightly less annoying pop-in rate (though it still exists), and travel by helicopter is a regular thing.Then there is the superb collection of songs thanks to Epic Records. The seven CD soundtrack is a well thought out and superbly selected set of songs ranging across the board from the likes of Michael Jackson (~Billy Jean~) to Twisted Sister (~I Wanna Rock~), and from Kim Wilde's ~Kids of America~ to Herbie' Hancock's ~Rockit.~ All of these being the tip of the iceberg. And don't forget the DJs and radio personalities who also appear.In short, GTA: Vice City is actually deeper, more engaging and better looking (if only by a little bit) than GTAIII. Without a doubt, GTA: Vice City was the best game of 2002 on PS2 and the best in the series to date.Check the full GTA: Vice City ReviewAnd just for the heck of it, might as well check out the full soundtrack review of the Grand Theft Auto: Vice City Box Set.There is little left to say, except that you should already own both of these. And if you don't, Rockstar has just made it easier and cheaper to do. Now, do the smart thing and buy this PS2 bundle, for God's sake. The only reason you might hesitate is if you own an Xbox, in which case, by paying $10 more, you can acquire the bundle with slightly enhanced graphics, shinier stuff and hands that look less like G.I. Joe's Kung Fu grip. Scoring this game, I should add, is a weird thing. Especially when it comes to scoring two games with one overall score. I have used the highest score of the two games, because both games together, at this price, logically and by all other means, warrant it.", "date": "Oct 22, 2003"}