{"name": "Teenage Mutant Ninja Turtles", "name_review": "Teenage Mutant Ninja Turtles", "ref": "https://www.ign.com/articles/2003/10/23/teenage-mutant-ninja-turtles", "text": "The late 80s and early 90s saw a massive mainstream hit in the form of the Teenage Mutant Ninja Turtles cartoon series. And Konami was there to scoop up the cash machine videogame license, producing action games on the NES and in the arcade, as well as bringing those arcade machines home in ports for the Super NES and Genesis. All good things must end, but the TMNT series has recently been given a surge of life thanks to a revision of the characters in the new Fox animated series. And once again, Konami's there to scarf the rights to produce videogame adventures. The Game Boy Advance version the company created is a satisfying little action game thanks to a nice variety of things to do, but it's over before it really gets started...and the lack of any multiplayer support so that multiple turtles can get in on the action is definitely obvious and sorely missing in this package.  Anyone between the ages of three and thirty-three should know who and what the Teenage Mutant Ninja Turtles are. Honestly, you don't need to know anything other than the fact that these guys are kick-ass kung-fu amphibians with renaissance names: Michelangelo, Donatello, and Raphael, with Leonardo leading the quartet. They hide out in their sewer home and train with a sensei that happens to be an anthropomorphic rat.  It's been nearly a decade since these guys had their own videogame, and it would have made a lot of sense if Konami simply went back in its archive and produced a port or two of the existing TMNT games for the 2D-friendly Game Boy Advance system. Instead, though, we get a whole new adventure and gameplay design that shares very little with what the company created in the previous generation of the Turtles license. If anything, the Game Boy Advance version is more in line with what the company did, under the Ultra name, for its first game on the Nintendo Entertainment System. Not the arcade ports, but the original side-scrolling adventure where the turtles work through the sewers and the streets against the footclan.  The Game Boy Advance game is actually broken up into the four different characters, with players taking control of each turtle individually. Each turtle has his own set of four levels to complete, each based around an episode from the television series. All four have similar control schemes, but they're each balanced in strength and speed based upon their cartoon personality, and each feature unique fighting moves than. For example, Raphael can climb up walls by spearing his Sais into the concrete, and Michelangelo can reach higher platforms with a superskilled walljump. They each have their own attack animations because of their different combat styles and weaponry, but the gameplay boils down to using the A and B buttons with the D-pad in specific combinations to nail the endless wave of enemies as quickly and successfully as possible. Though a little skill is required to down the badguys (leaping out of the way of a firing laser gun or an attacking mouser), the combo system is a little on the rudimentary side...rapidly hitting the B button is enough to juggle most enemies out of the way. But the combat engine is at least satisfying since there's a lot of enemies to wipe out in the game's 17 different levels, and timing the attacks can net a nice, meaty five hit juggle in some cases.  The game would get a little dull if all it had were these side-scrolling levels, but thankfully the developer implement an original, interim challenge for each of the four turtles. In Leonardo's levels, players will zoom through the sewers in their custom Sewer Slider in an Operation Wolf-style shooter.  Moving through Michelangelo's challenges will give players the ability to ride through the sewers on a ~shell board,~ grabbing gems without getting hit by oncoming sewer traffic. Raphael has a very challenging race against Casey Jones in a fun Shell Cycle challenge, and Donatello takes to the air with the Shell Glider for a little old-school shooter action. It's unfortunate that there's only one of these levels per character, as Konami could have definitely extended the playtime by adding one or two more.  And that's the biggest fault of Teenage Mutant Ninja Turtles: the length. The console versions stink because the action gets incredibly repetitive, but that's not the problem in the portable rendition: there's just not nearly enough on the Game Boy Advance. It's all over in just three hours, and even with the added element of hidden gems only adds on another half hour or so. And what falsely extends the game's length is the enormous amount of cutscenes between the missions...the yabber between turtles and bad guys just goes on and on and on and on with nothing much in the way of actual important substance. It's cool that the developer kept with the style of writing from the current animated show, but man...eventually you'll just be hitting the action button just to skip the near tons of scrolling text.   The game's gaping omission: no multiplayer support. How can you have a Teenage Mutant Ninja Turtles game without any sort of cooperative or competitive challenges? Answer: you can't.     The console version is very pretty, but it's also extremely dull and repetitive. This game never comes off boring because the developers inject a bit of variety in each of the characters abilities and challenges. The game isn't much more than your typical Final Fight or Double Dragon type of game, but it's a pretty satisfying gaming experience...especially for those who dig the Turtles. But you just can't ignore the fact that the game's irritatingly short. The game's over before it feels like it actually starts, and even with 17 levels to plow through, some missions end surprisingly quick. The game allows for unlimited continues (the only downside is that it also remembers the health bar at the last checkpoint), which definitely attributes to how easy the game is to win. As fun as it is to plow through this game, it definitely needs a little more Turtle Power.", "date": "Oct 23, 2003"}