{"name": "Harry Potter: Quidditch World Cup", "name_review": "Harry Potter: Quidditch World Cup", "ref": "https://www.ign.com/articles/2003/10/28/harry-potter-quidditch-world-cup", "text": "Publisher Electronic Arts is no stranger to the Harry Potter universe. The company has already released a handful of console action-adventures which follow the Boy Who Lived through his first two years at Hogwarts School of Witchcraft and Wizardry and there are more in the works. But in its latest title, Harry Potter: Quidditch World Cup, EA makes the fictional sport of Quidditch a focal point for players.  As longtime Potter fans -- ones who have read all the books and watched their transformations into movies -- we know Quidditch all too well as a kind of intense, dynamic, and dangerous mutation of soccer which is played not on the ground, but rather in the air. Author J. K. Rowling did a fantastic job of imagining this fantastical sport and Warner Bros. commendably recreated it on the silver screen. The good news is that EA's interactive take plays well and looks sharp. The bad news is that it is neither as frantic-fast nor as unrestricted as Quidditch is in the books and movies, which is sure to disappoint the Potter hardcore.  The Facts  The first and only way to experience complete Quidditch matches. Climb aboard a flying broomstick and take flight to engage in exciting competition high above the Quidditch pitch Play as any one of four Hogwarts houses and numerous characters from the books, including Harry Potter (as a Seeker on the Gryffindor team), crafty Draco Malfoy from Slytherin, and international Quidditch stars such as Bulgaria's Viktor Krum Play all the Quidditch positions and execute all the high-flying moves: control the three Chasers to score ten-point goals with the Quaffle, the two club-wielding Beaters to control the two dangerous Bludgers, the Keeper to guard the three goal rings, and the Seeker to capture the Golden Snitch to end the match and score 150 points Compete for the Quidditch World Cup, with professional Quidditch teams and stadium environments including USA, England, France, Germany, the Nordic Team, Japan, Spain, Australia, and Bulgaria - featuring Viktor Krum The first Harry Potter two-player experience -- two players can play head to head on PC and all consoles Collect Quidditch Cards gained from challenges completed, moves made, and games won. These in turn unlock special moves, all of which help players achieve the ultimate honor of winning the Quidditch World Cup Stunning 3D environments and special effects Runs in widescreen mode, but does not support progressive scan   Gameplay EA has done a fine job of realizing the Potter universe in Quidditch World Cup. The game sparkles with crisp FMV sequences featuring Harry, friends and rivals, and a slick menu interface set to the backdrop of the sport itself enables a variety of play modes and options. In this way, Quidditch World Cup is -- fictional competition or not -- a lot like one of EA's many sports offerings like Madden. By the same token, players can pick from their favorite teams -- houses like Gryffindor and Slytherin -- for instance, and likewise earn wizardry cards which are great for viewing and for unlocking special moves and arenas. It's a very well balanced setup with a tangible degree of depth.  But whether gamers choose to partake in an exhibition match against a friend or go through the Hogwarts Cup in an attempt to advance to the World Cup, it all boils down to the same gameplay scenario, which of course revolves around the sport of Quidditch itself.  In Quidditch, which is more or less wizard soccer, two teams comprised of seven players each compete against one another on broomsticks in the air. The quaffle, a floating sphere, acts as the equivalent to a soccer ball. Three ~chasers~ on each team offensively move the quaffle up and down the airborne stadium and attempt to hurl it through one of three existing goals for 10 points. One ~keeper,~ or goalie, on each end tries to block and return those attempts. Players must also witch out for ~bludgers,~ or hard spheres with minds of their own that blaze around arenas and try to knock wizards off of their broomsticks. The sole job of two ~beaters~ on each team, or wizards armed with bats, is to make sure the bludgers don't zoom in and take out one of their chasers. Lastly there's the ~snitch,~ a tiny golden sphere that hides itself around the arenas; each team has a single ~seeker~ whose only goal is to find and capture it, which is worth so many points that whichever team finds it first usually wins the match.  EA has successfully included all of the play options in its re-creation of the sport. Gamers can on broomstick move adequately around the stadiums, dodge attacks, send bludgers after opponents, or pass to teammates and shoot the quaffle through rings for points. Shots can be charged by holding down the shoot button, which is a nice touch. Naturally, chasing after the snitch also figures into each match, and this scenario in particular, as it controls tightly and requires some level of strategy, is a lot of fun.   The game also does a fine job of capturing the spirit of the films. Brief, but entertaining cut-scenes during matches show seated house friends cheering in delight after a score is made, which helps pound home the color of the license. Players that choose to play as Slytherin will even get to see crude close-ups of Crabbe and Goyle, and what's not to like about that? These cut-scenes are different depending upon the team selected and their performance.    On top of everything else, EA has thankfully even deepened the experience some for the gaming world. There are well done special moves that can be executed at the right time -- a wide variety of mid-air volleys and acrobatic steals. Players can manipulate the seemingly out of control bludgers and send them after opponents in attempts to knock them loose of their broomsticks. This function is very entertaining, especially in multiplayer matches. Easily performed steals are commonplace. There's even a fun combo system, which enables players to string together a series of passes and then score -- and successfully doing this, we assure readers, is undeniably satisfying.       But just as the offering succeeds in some areas it also fails in others. Perhaps the biggest disappointment is that gamers have no control over vertical movement in arenas. EA says it didn't include the option because it would make the control setup too complex for younger players, but by our measure the go-anywhere-flying in Harry Potter and the Chamber of Secrets, which also included a Quidditch mode, feels much more intuitive because we can move in any direction. And besides, some of the combos in World Cup are more complex than flying in any direction ever could be. Another significant drawback, just as important, is the title's overall lacking sense of speed. Flying around the environments feels subdued -- but not slow -- compared to the unpredictably fast and furious Quidditch matches designed in the books and movies. And finally, the game -- at least in single-player mode -- is too easy. Quidditchers will be able to mop the opponent AI up with very little effort, which means that  younger players are likely to get the most enjoyment out of it.   World Cup is, in spite of these issues, a well-conceived, fun interactive take on the fictional sport. It's also a game that has enough options, be it Game Boy Advance functionality with the GameCube version (players can link up for cooperative play or to trade cards with friends who also own the handheld), or the hundreds of secret-unlocking cards that can be collected through the Hogwarts and World Cups. And on top of everything else, there is the two-player split-screen mode, which is just as fun as the regular experience with the added benefit of going against a friend, who can be insulted repeatedly after they crumble and lose.  Graphics Harry Potter: Quidditch World Cup looks very much like the Warner Bros.' movies and that's a high compliment. From the clean, detailed and well-animated character models (complete with facial movement) to the gloriously varied and colorful wide-open stadiums, the game's visuals are well-realized. It can't be an easy undertaking to make flying on a broomstick look anything but painful, but in the context of the title it looks magical and energetic, a feat achieved through fluid, varying character animation, a wealth of particle effects and more. Dynamic in-game cut-sequences highlight the importance of special moves, as characters will actually jump atop their broomstick and balance there and these scenes drive the satisfaction factor up. The title even runs in widescreen mode for televisions that support it.  On the downside, the camera occasionally disobeys and momentarily shoots the action from the wrong angle, the backgrounds lack geometry detail and some of the textures in the title could stand for more clarity. Finally, the framerate sometimes dips here and there, but is generally smooth. Sadly, World Cup does not run in progressive scan mode on GameCube or PlayStation 2.   Sound Solid all around. Epic orchestrated music accompanies the loud, energized FMV sequences and in-game play scenarios, and a truckload of sound effects account for everything from the buzzing snitch to the thumps of bludgers and eruptions of goals. On the other hand, some of the effects can be repetitious. Excellent quality voice work means that everybody -- from Harry to Draco -- sounds the part (for obvious reasons). The title even runs in surround sound.Harry Potter: Quidditch World Cup could have been given the true Madden treatment, but instead EA has made a fun, but slightly shallow take on the fictional sport. I like this game because it lets me play Quidditch complete with all of its loveable elements and options. Everything I read about or saw in the movies I can do in this title, for the most part intuitively, and EA has even added some magic of its own in the form of new combos and highly welcomed in-air special moves. Plus, it all looks great. But on the other hand I am disappointed both by how easy the game can be advanced thanks to the forgiving AI (it does get harder as different difficulties are unlocked, but it takes awhile) and the development team's decision to eliminate vertical control from matches as it dilutes some of the go-anywhere-flight that is part of this sport's appeal. The brutally fast sensation of speed in the books and movies has also been reduced noticeably in the game, which is also discouraging.Potter fans will want to give this one a rental and see if it's worth owning. Parents may want to look into it for their kids. Everybody else should wait for a slightly smarter Quidditch sequel with more freedom and more speed.", "date": "Oct 28, 2003"}