{"name": "Slave Zero", "name_review": "Slave Zero", "ref": "https://www.ign.com/articles/1999/11/16/slave-zero-2", "text": "So, have you ever been in the middle of a helluh funny joke, with a group of people hanging on your every word, and you finally make it to the punch line, but no one laughs?  I am guessing that's probably what the development team behind Slave Zero feels like right about now.  Unfortunately, I can't say I feel as bad for them as I would some helpless schmoe attempting to deliver the ~how many programmers does it take to screw in a lightbulb~ bit.  Reason being that nearly everything behind the concept of SZ says ~cool,~ but not quite as loud as the implementation screams ~rushed.~  This game is a mess, gang, so much so that I'm not even sure where to start.  Perhaps the best place would be game flow.  I'm sure you've all played enough action games to know what makes them tick.  Hell, even if you haven't, I'll let you take a stab at where the genre gets its name....any takers?  Ah!  You there, in the front?  ~Action!~  Ding ding ding!!!  Tell him what he's won, Bob!...but enough sarcasm.  People play action games because they want some excitement, some intensity.  No, check that.  They don't want ~some~ action, they want a lot of it, and they don't expect it to let up until the final boss has a rocket up his tailpipe and a bad case of lead poisoning.  Slave Zero's first and most evident gameplay pitfal would have to be its utter disregard for this primary principle of gaming logic.  A good 50% of the game, you're just sort of walking around, shooting enemies who act as if they aren't too sure of what you intend to do with that fancy shcmancy rail gun of yours, and because of this, the experience just feels empty.  To make matters worse, there is the occasional mission, such as the escorting of the convoy deep inside the sewers, that makes you know that someone on the design team knows what he's doing.  Enemies come at you from nearly every conceivable angle, and between taking them out and keeping up with your boat-bound buddies, you really get the sense of urgency, and are kept on the edge of your seat.  The sad thing is, however, that this sort of action is anything but a regular occurrence, and the lifeless gameplay gaps that connect these killer sequences only serve to threaten your interest, as opposed to your character's life...which is what makes things interesting in the end, is it not?  It's just like someone sat out to ruin my fun, and they wanted me to know exactly what I was missing.  Evil, I tell you.  Just plain evil.  And as if to echo this vile dichotomy of quality, the game's visuals tell a painfully similar tale of near greatness.  Some of the most brilliant character design and atmosphere I have ever witnessed in an action game is completely wasted by one of the sloppiest engines I have ever seen in my gaming experience.  On the one hand, you've got some awesome looking mechs, each with their own behavioral patterns and distinct attack capabilities, who are chomping at the bit to light you up against the seedy, sprawling city skyline like so many neon signs on the game's intimidating skyscrapers.  You will most certainly get a sense of being a giant robot in the midst of a Transformer-esque confrontation that most cartoon fanatics would kill for on Saturday morning, but the problem comes in when the game decides to make you admire the talent art team's handiwork, one frame at a time.  You heard right, this game suffers from slow down like Robert Downey Jr. suffers from substance abuse: uncontrollably, frequently, and in such a way that even the casual observer can see there's a problem.  Don't get me wrong, I never expected 60 FPS with this game, but slowing down to less than a frame a second when there is nothing but level geometry to deal with (meaning there are no enemies or effects on-screen to tax the CPU), well...that is just plain sloppy, and there is no excuse for it on the Dreamcast.  A screen full of baddies and tons of explosions is an expectable if not weak excuse, but it's pretty evident that the team either wasn't able to get this thing moving at an acceptable rate or the code was ripped out of their hands and sent to the ole production line before it's time.  If the latter is the case, I hope Infogrames is ready to learn the ~you get what you pay for~ lesson the hard way, because this isn't what anyone expects from the next generation of software, and it simply will not cut it in today's marketplace when games like MDK2 and Shadowman are living proof that the DC can handle 3-D action.  And to make matters worse, Slave Zero features (or shall we say doesn't) another painfully evil omission that we're a bit baffled by.  There's absolutely no in-game music whatsoever.  That's right kids, much like your chances of winning the lottery, there ain't no music in the nightingales, or the Dreamcast sound card, for that matter. Infogrames actually went so far as to blame the hardware for the inability to stream sound, voice, and music at once, but we've talked to other developers who've done so, and many a game (such as Sonic Adventure) serve as an indisputable piece of contrary evidence.  Regardless, the fact remains that the killer music we let ya sample on the site a few weeks ago is now nowhere to be found, which is a quite bummer, and much like a mid-make out fart, a major mood killer.  Don't ask me why, but giving the bad guys a good dose of my blaster would have been a bit more enjoyable if I had some tunes to help set the pace.  And when it all comes down to it, that is what Slave Zero is missing.  Pace. This game has nearly every ingredient necessary to be a success, from character design to smooth control..there's even a good story complemented by some excellent voice-acting, but when you actually have to experience all this amidst the game's incapable engine and spotty design work, it simply falls apart.  The first few levels are just way too slow for their own good, and even if they were designed as subliminal training, they did little but discourage continued play, which is a shame since the game doesn't really pick up until about level four.  Most people will be so discouraged by the game's simplicity and internally complicated pacing that they'll miss out on the later levels killer weapons and equally interesting mission objectives.    It's just too bad. There was a lot to like here, but after all is said and done, action fans will be well served to hold back their hard-earned bucks for the likes of Kain 2 or MDK2 than put down the dough for this one.  It's pretty obvious that the game's intent got lost somewhere between publishing deadlines, and the game could have been so much more.  If you're as disappointed by this news as I was, keep in mind that the PC version ought to be able to lick the frame-rate problem and could be worth a look, but the Dreamcast version of Slave Zero won't be capturing gamers' interest any time soon.  -- Brandon Justice, IGNDC", "date": "Nov 16, 1999"}