{"name": "Rainbow Six 3 [Xbox/PS2]", "name_review": "Rainbow Six 3 Review", "ref": "https://www.ign.com/articles/2003/10/29/rainbow-six-3-review", "text": "Don't let the title confuse you. All you need to know is Rainbow Six 3 is the Ubi Soft Montreal developed debut of the popular Tom Clancy franchise on Xbox. Even with the success of two Ghost Recon titles and a little game called Splinter Cell, there is still room for a squad-based FPS like Rainbow Six 3 in the Xbox's library. This is due to the fact that RS3 boasts the most complete package of features, functionality and gameplay we've seen yet in the genre on Xbox. The developers took a look at how people actually played these types of games both on PC and on console and built an offline and online experience that are more similar to each other than not, but that both offer tremendous replay value. Pound for pound, Rainbow Six 3 might be the best value going on Xbox this holiday season.  Gameplay  You're cast in the role of Ding Chavez, the leader of a four-man team of Rainbow Six operatives who are sent around the world to answer terrorist threats with a minimal amount of attention and casualties. You can play either through 14 specific missions with multiple goals or terrorist hunts where it's simply kill everybody that isn't a Rainbow Six operative. But the brilliance of RS3 is that you can do these games solo and co-operatively whether you're talking about a System Link networked game or online via Xbox Live. When you go online and want to go head to head you can play adversarial gametypes like Sharpshooter with 16 total players for an all out close-quarters scuffle.   The solo game attempts to re-create the feeling of online play where your three AI teammates would be human controlled characters. And so the quick-order interface command menu and the voice-command system (if you own an Xbox Live Communicator) are the two means you'll have to boss your extremely intelligent teammates around. The whole game then becomes a test of your ability to manage both your team and yourself during the heat of battle when all kinds of things are going on. RS3 places a heavy emphasis on balancing your role as a commander and your role as an effective assault trooper. You have to be good at both to succeed.   Strategy Guide Available!    Kill Them        All               Our expert guide gives you detailed training and a complete walkthrough to make        you the elite among all soldiers.  Get The Guide | See Other Guides   You can command your teammates to move to locations, open doors with vary levels of aggressiveness, secure hostages and other things by either using the innovative command system or by simply saying what you want them to do into your Communicator. The quick order interface uses the A button to contextually issue the most logical command for whatever you have targeted. So if you see a door or look at a spot on the ground and tap A, you've given them the command to ~open and clear~ or ~move here~ respectively. Otherwise you can hold A and bring up a radial menu that has more aggressive commands you can perform on a door like ~open, flash and clear.~ The contextual quick tap A commands are especially handy when it comes to securing hostages and defusing bombs. Oh and your voice equivalent of tapping A is the magic phrase in RS3. Yelling~Go, go, go!~ will get you far in this game. All of the commands can also be executed on zulu --everybody gets in position but doesn't execute until you give the word-- whether you're using the standard control or voice. Shouting at the TV has never been so interactive.    They're independent so your teammates always fire when fired upon but as far as their location and positioning go, you're in charge. For example when you tell the three of them to breach, open and clear a door to another room, they'll get in good defensive position while one of the guys leaves himself vulnerable by actually planting the charge. When they bust into the room, they follow basic procedure by filing in and sweeping the room in way that keeps them all protected. Ideally, you'll want to support them by being the fourth functional member of the assault team by watching the team's back, side or front.whatever the situation calls for. If you don't and get addicted to giving orders all the time, your guys will eventually come under fire and take damage because you're not there to cover a critical blind spot or something like that.   In other words, as a human being you're supposed to be the most intelligent guy on the team, but if you don't know what you're doing, you're no good to the team to begin with. It is through trial and error and many ambushes that you will instinctively pick up proper techniques on how to clear a room and keep your team safe. Just like we saw in Splinter Cell any game that teaches you new skills slowly and steadily is a winner in our books. Your mission won't end if your teammates get killed, since you can always complete the mission by yourself, but this changes the gameplay considerably. At full strength your Rainbow Six team can blow through any mission as long as you manage it skillfully. When you lose one or two guys, you have no choice but to step up and perform the roles that you've been watching the three of them perform throughout most of the levels. That is, you've been watching them set up defensive positions and watch each others back as you gave them orders, but when the team is cut to two or three guys, you've got to start doing that yourself or it'll all be over soon enough.      The Tom Clancy level of realism you expect from a Rainbow Six game is all in this console game. The list of weapons isn't quite what it was on the PC, but there are multiple types of assault rifles, heavy machine gun, sniper rifles, shotguns and pistols so that you can make some decisions about how you want to head into battle. Ubi Soft Montreal streamlined the gearing process by limiting players to four slots made up of a primary weapon, a secondary weapons and two items slots and omitting items like the heartbeat sensor. The addition of grenade launchers and the fact that you can use them as secondary weapons --instead of pistols-- means you can pretty much get your Rambo on with an overdose of firepower. The last two weapon slots are reserved for items like grenades, flashbangs, claymores and even a gas mask or two. Night vision and thermal vision are automatic so there's no need to worry about them and you're given plenty of ammo for your primary weapon, usually 12 magazines.  The multiplayer elements of Rainbow Six are even better than what we got out of the Ghost Recon games. All of the cooperative game types are built around the four-man team system so that four humans can take on the roles of the Rainbow Six operatives in the solo campaign. Terrorist hunt and simply running through the main missions with your buddies over a network or over Xbox Live is just a whole lot of fun. The enemies have randomized routines to always keep you and your friends on edge. As great as the cooperative games are in RS3, stepping up and going head to head against other humans in one of the adversarial game types like survival or sharpshooter.   The functionality of the Xbox Live elements in Rainbow Six 3 are the best indication that the developers (and Microsoft) have high hopes for the online lifespan of this game. Things like being able to set your default preferences for a quick match search and pick your preferences for team game and attaching all of this info to your gamertag is very handy. When you combine the variety of gametypes and just general functionality of the Xbox Live component, this game is bringing a lot of the lofty ideas of online console game into reality. There will be plenty of downloadable content on the way for RS3 as well including some that will be waiting for you as soon as you buy the game, take it home and jam it in your Xbox.   Graphics  The look of RS3 isn't too stunning, but the game's visuals are all very practical. The character models and environments are all well done even if we know they're not quite up to the best Xbox has to offer. The animations of the characters in the game aren't as crisp as you'd like them to be, but you can nonetheless see exactly what guys are doing when they bring their weapons to bear, reach for doorknobs or cover their eyes to avoid the damaging effects of a flashbang.    The environments and their level of detail ultimately carry the day for the game's graphics. You get outstanding lighting falling across very polished looking buildings, snow and other structures. The same lighting also falls on and cast shadows all around any objects that your character might be holding. Only one light source at a time will be doing all the work but the shadows and shine look great especially if you're in a dark area with a really bright directional light like from a flashlight for example. There are also times where shadows, either yours or an enemy's, will inadvertently give away a unit's position. Some structures like cars and whatnot aren't too detailed with blurry looking textures that obscure details and it almost looks like it was done on purpose.  The greatest advantage to the game's visuals is the way interactive objects --like doors and ladders-- blend so well into the rest of the local environment. Doors that can't be opened, look just like doors that can be opened so you're compelled to explore and scan them with your targeting reticule to make sure. This adds a level of difficulty and realism to the game that helps maintain the level of tension throughout. A glowing shiny door that looks different than its surroundings would've undermined a lot of the authenticity this franchise is known for. Sure we're talking about a console game but that doesn't mean it has to be dumbed all the way down.      As an FPS, the animation of your weapon jumping around as you fire it and the accompanying muzzle flash play a huge part. Different weapons in the game have their own weight, physics, muzzle flash and other disadvantages that you have to negotiate if you want to be effective in a firefight. Paying attention to details down to this level help separate RS3 from similar games in the genre.  Sound  Music and sound play huge roles in Rainbow Six 3 just like we've seen in most of the Tom Clancy-themed games on both PC and console over the years. In Rainbow Six, one of the limitations of the first person perspective, of course, is not knowing where enemy fire is coming from. Your AI teammates will actually call out if they're taking fire and in some instances the direction the attack is coming from. You'll hear comments like ~Sniper on the roof!~ or ~~I've got your six, Ding!~ throughout the game. These alerts are in addition to the instant responses to your commands and other idle comments your teammates will spit out when they've been standing around too long. Like Splinter Cell  before it, you can't play RS3 with the sound turned down because you'll miss half of the experience and get blasted by bad guys quite often.  The music is very much inline with what we've seen in Rainbow Six games on the PC. It's slightly interactive with changes coming as you enter new phases of a mission and things become more frantic. When you get smoked the depressing death music will be familiar to veterans of the PC Rainbow Six games. It just feels like you've let the entire free world down when you hear those solemn strings.  The voice acting is well done even though we would've loved to have heard Willem Dafoe reprise his role as CIA agent John Clark. The accents of your British, French and German teammates are decent but there's not much opportunity for them to really spread their wings. They use military terms so there's no funny British-isms or anything like that.   As we said, during the heat of a gunfight you won't always know where the fire is coming from and that's even with the excellent Dolby Digital surround sound going. Things get hectic quickly and that means you'll hear gunfire, the ricochets and your teammates yapping all at the same time even though they're coming from the appropriate directions.     The use of the headset to give voice commands and talk to teammates online is cool enough but the spatial sound system is really impressive. You will be able to hear nearby players whether they're on your team or not whilst playing online, but the sound will come from your TV or sound system's receivers. This really drives home the point of using your Xbox Live Communicator as a real piece of military equipment that connects you directly to your teammates. The sounds going on out there in the game world are just going to be picked up by your flesh and blood ears by way of your speakers.  That's why the Communicator only covers one ear. Rainbow Six 3 is an extremely fun game that takes the basics gameplay of Ghost Recon that had everybody hooked last year and dresses it up with prettier graphics and lots of extra functionality. The co-operative gameplay options are outstanding and set the bar quite high for every online shooter on the way to Xbox including the mighty Halo 2. I enjoyed RS3 for hours at a time even though on the surface it just looks like a stripped down version of the PC game that came out months ago. But the game just keeps drawing you in with one feature or another until you're completely under its spell. As soon as you bored with giving voice commands to AI, you can hop online and play cooperatively. When you don't want to be friendly anymore you can stay online and cap anybody that's not you. When you're sick of that, you can go back to the solo offline game and perfect your command skills. You're first person shooting the whole time but you're loving it in different ways as often as you like. Relationships with real people should be that way, not videogames.This is one of the top Xbox Live games of 2003. Even if you have Return to Castle Wolfenstein in hot rotation, clear some space on your calendar and in your library for Rainbow Six 3.", "date": "Oct 29, 2003"}