{"name": "SSX 3", "name_review": "SSX 3: The Soundtrack", "ref": "https://www.ign.com/articles/2003/10/29/ssx-3-the-soundtrack", "text": "As a stand alone CD, SSX 3: The Soundtrack serves up a choice selection of mid to up-tempo electronically bent jimmies ranging from such seminal artists as Fatboy Slim and The Chemical Brothers to such underground stalwarts as Swollen Members and left-of-center favorites like The Faint and Royksopp. For the most part the album is a collection of previously released tracks, however there are two never before released joints, plus a couple of spanking crisp remixes to sweeten the mix.   The album commences with a new cut from Fatboy Slim in the form of the uber short (it's only 3:16), but catchy little ditty ~Don't Let The Man Get You Down.~ The track is essentially a warm remix of a vocal outtake from The Five Man Electrical Band's classic 1971 anti-establishment pop gem ~Signs.~ Keeping in tune with snowboarding's left-of-center aura, Mr. Cook has snaked the ~and the sign said 'long-haired freaky people need not apply'~ line from the aforementioned song and wrapped it in a loping bass groove augmented with bouncy piano fills and weird, cartoonish ~mmmm-bop~ vocalistix. It's an infectious, if somewhat novel, little joint.    Mexican electronic mavens Kinky step up with ~Mas,~ culled from their self-titled 2002 release. The song is a rousing blast of electronic rumble that begins with haunting voices before dropping off into an undulating bass rumble filtered through kinetic percussion and swirling synth, all the while vocalist Gilberto Cerezo can be heard chanting variations on the word ~mas.~ Sweet is the most appropriate descriptive word for this entry.   Norway's chilled out duo Royksopp loan ~Poor Leno~ from their 2001 album Melody A.M.. For those who have never heard the track before, it's an upbeat slice of chill out ambiance, as shuffling rhythms percolate over washes of electronic goodness and mildly vocoder laced vocals. Hypnotic in a futuro, laid back House kind of way.    Who is your favorite SSX 3 character? Canadian avante rapper/urban musicologist K-Os drops his nasally flow over a slinky, sinewy groove on ~Freeze,~ lifted from his 2002 release   Exit. Astute rap fanatics will note that K-Os' voice is eerily similar to that of Q-Tip, both in tone and timbre. And K seems to be rather aware of this, too, as he even includes a few references to ATCQ in between his lyrical lines.    From the East Coast of Canada (K-Os hails from Toronto) the album flips to the West Coast, Vancouver, specifically, to hi-lite the beats and attitude of long time underground kingpins Swollen Members. ~All Night.~ The song is featured here, working almost like a preview to SM's upcoming album Heavy (due out on   Battleaxe Records  on 11/18/03). The track is something of a departure for the Canuck quartet, in that it bounces along to a ping-pong electronic beat that sounds like it was culled from the Dirty South-meets-Neptunes-meets-P.Diddy crates. While the beat and the rhyme schemes are infectious (although one cat sounds hella like a young LL Cool J), it sounds as if the crew is trying to jump onboard the flavor-of-the-day bandwagon. It's hard to tell if the guys are being serious or taking the piss. Whatever the case, it's very uncharacteristic indeed.   The Audio Bullys represent with an edit of their 2003 hit ~We Don't Care,~ a rousing and brash slab of grungy British house lifted straight out the garage. It's all punk poseur vocals surrounded in a lurchingly turgid electronic glaze. The Chemical Brothers are represented next with their 1995 classic ~Leave Home.~ The track forms the perfect segues from the audacity of AB thanks to thunder punch rhythms and blast boom energy.     The albums only other truly new cut comes courtesy of The X-Ecutioners. ~Like This~ begins like a long lost funk jam as rolling bass reverberates underneath jagged chicka-chicka rhythm guitar slices. Then a scratchy, echo laden female voice comes into the mix talking about seeing the X-Ecutioners at a dingy club. Then there's a scratch break before the femme fatale narrator slips back into her story. The track continues to ping-pong back and forth from vocals to scratch in a hypnotic blitz. It's like a bugged out post punk jam from the early '80s mixed with basement scratchmatic rap aesthetic. In one word: brilliant.   N.E.R.D.'s ~Rock Star~ gets the remix treatment in the form of the newly minted ~Nevins Club Blaster Edit,~ which juices the track up considerably. The Faint's ~Glass Danse~ gets the ~Paul Oakenfold Remix~ overhaul, while Basement Jaxx' ~Do You Thing~ goes for the ~Jaxx Club Remix.~ The album finishes with the other brand new remix, the ~Junior Sanchez Output Remix~ of Placebo's ~The Bitter End,~ which gyrates with schismatic guitar splurge and boing-boing rhythms all the while vocalist Brian Molko's piercing whine cuts through the mix. Searing.   Despite the fact that more than 75% of the SSX3: The Soundtrack is composed of previously released material, the album still makes for a solid listen, each track appearing to have been carefully chosen and then strategically placed to create a cohesive flow from beginning to end. Plus the two new tracks by Fatboy Slim and The X-Ecutioners are stellar indeed.   Oh yeah, for the hardcore gamers and diehard SSX fans there's a bonus DVD which includes an SSX 3 trailer, some screensavers, wallpaper, and character icons, not to mention cheats and hints. And they toss in a behind the scenes look at the making of SSX 3, as well as the video to Royksopp's ~Poor Leno.~", "date": "Oct 29, 2003"}