{"name": "Hidden & Dangerous 2", "name_review": "Hidden and Dangerous 2 Review", "ref": "https://www.ign.com/articles/2003/10/30/hidden-and-dangerous-2-review", "text": "The original Hidden and Dangerous was generally regarded as a good game weighed down by bugs and poor AI upon its release a few years ago. After a few patches, though, most fans of that genre recalled the game favorably, recalling with nostalgia scenarios like the sinking battleship and the derailed train. Since that time, the tactical shooter genre has matured with the Rainbow Six and SWAT franchises. Plus we have all the vaunted WWII shooters like MOHAA, BF1942, and now Call of Duty. In short, this gaming segment is now a tough nut to crack. While HD2 makes some significant improvements over its predecessor, it has much higher hurdles to overcome this time around, and knocks a couple over along the way.   HD2 tells the story of a crack team of officers from the British SAS (Special Air Service), an airborne insertion team whose job was (and is) to go deep behind enemy lines and make surgical strikes involving assassination, supply line disruption, espionage, and more. These are elite fighters trained for countless types of weapons and stealth combat. You will take up to four men to different hotspots throughout the world during WWII, from Norway to Africa to Burma and elsewhere, dealing with  Italian fascists and the Japanese as well as good old-fashioned Nazis. As you successfully complete missions, your surviving officers will gain ranks, earn medals, and receive small increases to their abilities.   This RPG-like element, however, is a little confusing. Your stats are divided into Health, Strength, Endurance, Shooting, Stealth, First Aid, and Lock Picking. But Lock Picking simply isn't used enough (hardly at all, actually) to justify giving it a stat of its own. It would have made more sense to fold this into the Stealth skill and divide the Shooting skill instead. With class-based combat, you have the medic, the grunt, the sniper, the spy, etc. For me to be equally proficient with a sniper rifle as with a submachine gun almost feels like cheating, especially given this game's attention to technical detail.    When I chose a loadout before a mission, I always discarded any sidearms and gave them a rifle and a machine gun, because of how flexible HD2 allowed the Shooting stat to be. There was no skill division between heavy and light guns, with pistols being lumped in with bazookas. With so much emphasis on combat, I would have expected to see an extensive skill breakdown in this department.   And I don't suspect it was because they wanted to avoid complicating things. HD2 has a command for virtually every button on the keyboard, and even resorts to ALT and SHIFT variants. You can do most operations pretty easily with the mouse, but things are still a bit clunky.   By default, you control your soldier's movement speed with the mouse scroll. In other action games, this is usually reserved for weapon switching, and there isn't an easy-to-reach substitute with all the other commands you'll need. Leaning, crouching, climbing, lying prone, switching to different soldiers, entering tactical mode (more on that in a moment) pausing the gameI don't know why there's a button for climbing, but there you go. Usually it's the jump key.   Speaking of climbing, the enemy AI had a few problems negotiating ladders. Sometimes they would all bunch up at the bottom and I could wander over and pick them off. And when you are on a ladder, you can't aim your gun, jump off laterally, or look behind you. Third-person mode at least allows you to see above you before someone can get a line of sight on you, but otherwise it's an unnecessarily dangerous maneuver, especially for an elite killing machine.   Party AI, however, is pretty intelligent. You'll have a bevy of commands at your disposal, and they'll obey to all of them. You can order them to follow, hold position, take cover, tighten formation, spread out, fire at will or wait until you fire, and that's just the tip of the iceberg. They'll notify you every time they sight an enemy, and your character will also call out targets as well. When this happens, the enemy will show up as a red dot on your compass, making for relatively easy tracking even in dense brush.   Confusingly, the compass is an optional item, even though the manual itself describes it as being almost essential, which it is. When an enemy or enemy vehicle makes a noise, you'll get a gray blip in the sector of the compass that points to their direction, so it doubles as both visual and auditory tracking. Plus, when you enter tactical mode, sighted enemies are marked by a red box.    Although tactical mode uses the in-game engine this time, it could still use some work on reducing clickage. Switching to it almost always brings up a useless camera angle, usually looking straight down on the last unit you were controlling, from only a few feet up, instead of, say, a behind-the-shoulder angle that would allow you to quickly survey the field. Plus, the navigation controls in tactical mode are a bit odd. Scroll the mouse wheel to go up and down, and push the cursor to the edge of the screen to advance your view.   You'll have to click on a unit to move them somewhere, instead of the unit you controlled last already being selected. Then right-click to make a waypoint, but their path doesn't make much use of cover and stealth. Plus, you have the option to change their stance, speed, and demeanor (defensive, offensive, etc.) but it doesn't stick until you make a waypoint, click on that waypoint, and change all those attributes from there.    Pathfinding was also a little problematic. I would leave party members straggling, only to find them running in place in front of a low obstacle. This might also have been a problem with the map. Doorways with prominent sills seemed to stick sometimes, forcing you to run or hop through, which could be dangerous if you are in a stealth situation. I imagine that if I had these problems from time to time, then my AI-controlled buddies would be virtually helpless.   Although my party members seemed to be pretty aware of each other's positions, they wouldn't move to provide clear line of fire when someone had sighted an enemy. In some firefights, I would get numerous announcements that someone couldn't fire because someone else was blocking them. Well, one of you move! You're killing machines! Thankfully, though, there was almost no babysitting. They were capable marksmen and fairly good at making themselves small targets.    All this wouldn't be so bad if the missions were still consistently satisfying and entertaining. Unfortunately, the locations are so enormous and the objectives so time-consuming that it often felt more like a very dangerous day job rather than a tense, challenging adventure. Also, your map will often have only a few vague markings on it, if anything.   And it's not for lack of information, because each mission gets a detailed briefing that clearly lays out all your objectives. Since you have to kill everyone on a few missions, with 50-1 odds or worse, it would do to have a little more help. Two missions around mid-game gave me a full crew but the others were almost completely unnecessary and even liabilities on one mission, since for some reason only one of my men was given a disguise.   Since a typical campaign incorporates all kinds of different requirements, you'll need a huge loadout to accommodate, since you can only carry what you started with at the beginning of that campaign, or what you pick up along the way. Would the basement mission in Norway have been easier if you'd known to bring a silenced rifle and a knife? Probably, but you'd have to start the campaign from scratch in order to add anything you left behind. There's also a mission later on, right at the end of the campaign, that requires at least three surviving members to get through successfully, because they all have to man a turret. Leave a couple behind? Sorry, you can't get more troops until you've reached the next campaign.  There's a great game lurking somewhere underneath all of these questionable design decisions. The vehicle physics are great, the draw distance goes far, the countless weapons sound satisfyingly real and deadly, the music surges dramatically, the objectives are varied and interesting and the locales are exotic. Unfortunately, most of those pluses can be attributed to the LS3D engine (the same one used for Mafia) and even here, the engine is showing its age, especially with some blurry textures and lack of interactivity.I did have sporadic fun going around ~eliminating resistance.~ There are moments of brilliance in HD2, but also stretches of tedium and excessive saved game reloading, since you only have a few men and are usually working in stealth.If you can get around the interface learning curve and are patient and observant enough to find out what tactics work and don't work, HD2 might be a rewarding experience for you.", "date": "Oct 30, 2003"}