{"name": "Mortal Kombat 4", "name_review": "Mortal Kombat 4", "ref": "https://www.ign.com/articles/1998/08/19/mortal-kombat-4-2", "text": "Mortal Kombat - you may have heard of it. This little fighter has been going strong since its violent (and therefore controversial) debut almost a decade ago. The game gained popularity not only through its use of real actors and gallons of blood, but also with its unique style that has evolved over three sequels. Mortal Kombat 4 is the latest incarnation in the series, and the PC's got it.  The obvious change in the franchise for this version is the switch from the videoclip cutouts to a fully 3D polygonal engine. What's amazing is that it still plays like a Mortal Kombat game even though the game has shifted from its roots. The 3D engine adds more dynamic camera angles, the ability to sidestep, and generally gives the action and animation a much smoother feel. There's also a handful of new fighters that join a rank of seven classic combatants, fifteen in all. Better still, this new incarnation also introduces weapons into the bout, though they seem a bit out of place.   The PC version of this game is an outstanding conversion. In fact, I'll go one step further and say that its even better than its arcade counterpart. Not just in graphics (which, with a Direct 3D card, look sharper than the original arcade game), but this home version introduces a few options not found in the machine. A good example is the 2 on 2 combat, a tag-team style game where another teammate jumps in when the first gets defeated. There's also a tournament mode for up to eight players, fighting through a competition tree to determine the victor. And for those who can't stand reading through the manual, there's an on-screen moves guide that can be pulled up at any time during the battle -- pretty handy if you haven't crammed all those special maneuvers into your brain yet.  I'm only going to kick this conversion for one specific reason -- no network play. It would have been great to play your buddy remotely. Sadly, the only way you're going to get accurate two-player action is to own two Sidewinder pads. And don't even try to play this game on the keyboard -- not only will it cramp your style, but you'll also look like a complete idiot hunched over the keys trying to mash a four-finger combo.  Mortal Kombat 4 is the apology to Midway's last Mortal Kombat effort (anyone remember Trilogy?). Put simply, the game is the best home conversion of the title available, even when compared to the excellent N64 and PlayStation versions.  -- Craig HarrisI enjoyed Mortal Kombat 4 on the console systems quite a bit, but the Game Boy version just doesn't cut it for me. Playing alone with an overly limited set of moves against a dumb computer drone gets old real quick. The inclusion of lots of Kombat Kodes is nice, but it's just not enough to energize this lifeless port.", "date": "Aug 19, 1998"}