{"name": "MTV's Celebrity Deathmatch", "name_review": "Celebrity Deathmatch", "ref": "https://www.ign.com/articles/2003/10/31/celebrity-deathmatch", "text": "MTV's Celebrity Deathmatch was some slam-dunk entertainment when it hit back in 1998. You got the celebrities, you got the over-the-top, cartoonish violence, and that intangible hipness MTV could still bring to the table. One might wonder why they waited five years to come out with a game based on the franchise. It's not like five years of development when into this game--that's apparent from the get-go, unfortunately, in case the $19.99 MSRP didn't tip you off to begin with. That's right, kids, our once-hallowed show has been reduced to a bargain bin title. And it's only downhill from there.   You'll get to play through a few episodes. Three, to be specific, with three more unlockable episodes as you progress. You'll also get one-on-one combat against another player, choosing from the whole smorgasbord of celebs. You can also create your own guy, giving him a custom set of moves and his or her own special look. Sounds like a whole messload of fun, right? This is where things get tricky.   You can blow through a single match in about sixty seconds. The computer opponent doesn't block very well on the default difficulty, so you can mash the attack buttons repeatedly to pummel them to death in short order. You have three standard attacks of increasing damage like most other fighting games, and one special move. The problem is, the television show is all about special moves--a series of increasingly outlandish moves that ends with destroying the opponent beyond all hopes of physical recovery. You'll still get some fairly amusing finishing moves, but your character will use the same one every time. I guess you can't expect much for under $20 retail, but still, you feel a little cheated.   The other aspect of the show that gets almost completely stripped is celebrity dialogue. Johnny Gomez and Nick Diamond have a bunch of choice lines, (although they will repeat them a few times in the same fight), but the celebs get an opening insult and a victory comment. Even the best lines don't approach the biting humor of the TV show. Tommy Lee says, ~I rule!~ at the end of a successful match. ~I rule!~ And I think to myself ~Okay, it was only $20. It's all right if the world-famous drummer of one of the most infamous rock bands in the world is restricted to two words that could have come out of the mouth of any other character in the game.~ The game claims thousands of lines of dialogue, but I don't know where those all went. They must have been short lines.   The Soundtrack For The Slaughter   The soundtrack to the new Celebrity Deathmatch game from Gotham Games is all about the hard rock, with a few select, extra amped-up rap jams tossed in for extra fist waving goodness. Artists represented range from the likes of established acts such as Sevendust, The Eastsidaz, Lil Jon & The East Side Boyz, and The Yin Yang Twins to newcomers like Pay The Girl, Chyna Whyte, and The Kicks.    There's a little more variety in the ring, though. Some weapons and temporary skill boosts will randomly drop during play, and you can run over to them and pick them up (by pressing a key instead of running over it, natch). You'll have a chainsaw, blunderbuss, tennis ball shooter and a few other items at your disposal. But for the most part, you can do plenty of damage with your own bare hands. And who wants to make the match even shorter than it's already going to be? You can also pick up health packs, speed packs, armor boosts and other stuff, but who wants to prolong what's already a middle-of-the-road experience? It's a philosophical thing, really. Besides, that stuff wasn't too prevalent in the show, so I'd rather just keep it real.    One trademark element that manages to make it into the game mostly unharmed is physical signs of damage. There's actually a broad level of damage indicators, with black eyes, busted lips, torn-up clothing, stab wounds, and various splatters of blood. You can really tell when you're kicking someone's ass. When the opponent is on the ground you can kick them repeatedly and even stomp on them viciously, and they will spray appropriately gory gouts of blood.   In fact, when their health bar is down to the bottom, they will just constantly spray blood all over the mat. If you're some kind of sicko, you can just kick and stomp to your delight, because the match isn't over until one of you triggers the finishing move, which you can't execute anyway until that person's health bar is completely empty. I suppose it's a good stress reliever, but then so is Minesweeper, and that's free.   But the pleasure of blood is incomplete without the appropriate level of visual detail, and CDM doesn't really deliver. On the PC version, you can crank the resolution up to 1280x960, but the textures don't scale much. The models are all pretty blocky and, sadly, you never get the impression that you're in control of a claymation figure. It just ends up looking like low-budget 3D.I can only guess what CDM could have been if done with a larger budget. What I found most disappointing was the loss of the claymation feel and the sense of personality of each celebrity--in other words, the elements that make the TV show so memorable. This might have been bearable if combat was interesting and if you couldn't whip through the entire single-player game at video arcade speeds. I know games with longer learning curves than the entire play time of CDM. I wouldn't recommend picking this up unless you're a determined Celebrity Deathmatch collector.", "date": "Oct 31, 2003"}