{"name": "Ford Racing 2", "name_review": "Ford Racing 2", "ref": "https://www.ign.com/articles/2003/11/03/ford-racing-2-2", "text": "Once upon a time, a writer in Russia came up with a book that he claimed would be his own interpretation of American culture. The result was a book that repeated the name ~Ford~ over and over again for hundreds of pages. True story. With the release of Ford Racing 2, developer Razorworks has come up with the video game equivalent of that book. By taking a blank medium, in this case a basic racing game, and repeating the ~Ford~ name over and over inside it, it almost forms something like a decent game. In some places it almost makes it, but for the most part, FR2 will serve better as a promotional tool for the brand than an enduring title.   Of course, just having the name of the Detroit company just isn't enough, so FR2 has 35 Ford cars ranging from old trucks from the 50s and 60s up through different years of Mustang to modern concept cars. This is almost triple the amount of cars in the straight-to-budget Ford Racing, but it's still a paltry number of cars, especially since Ford has so many to choose from in their whole, you know, history of making cars. One thing is definitely true, though. The question of whether grandpa's old junker truck would stand a chance against a modern F-150 can be finally solved (possible spoiler: it can't).    Gameplay  So there's still a racing game here, right? Well, yes, sort of. But not really. The main mode of FR2 is the Ford Challenge mode where there are 34 challenges to unlock cars for use in the races (more on that sordid tale later). There are eight different types of challenge here, including standard fare like a race, which is what you would expect. There is also an elimination race where cars get removed at the end of the three laps until the winner is the only one on the course. There is also a duel challenge where each of the three laps features a different car that must be beat. Throw in the time trial and you have a beginner's set. To make things more interesting, there are a few different time challenges which are three slightly different flavors of the same thing.    There are three different types of racing challenge that focus on following a clean line around the track. The most ingenious one has an ideal racing line that follows the entire track. Straying from the track will effectively make the clock run twice as fast so going fast and staying on the line is key. This is an effective way of showing how to take turns. It's a good idea, but there are also two other challenges where the goal is to either drive between cones or hit hourglass icons to extend time. These usually follow the same line, and do the same thing, except that they don't handle straightaways very well. Hit a spot perfect for some leadfoot action and the objects start zigzagging across the road. It may add some extra challenge and some variety, but I would've preferred a series of the first racing line challenge to these kart-racing inspired challenges.   It may sound like this isn't so bad after all, though, right? These racing line challenges educate the driver about driving skills so that they can be better when it comes to the racing that's in the tile of the game, right? Wrong. With 34 challenges spilt between eight different types of challenge, the total number of challenges that are actually about racing becomes fewer and fewer. To make matters even worse, there's no way to pick a track a track and a car and race on it. There is a Quick Race option from the main menu, but this will drop the player into a random car on a random course. Sure, it's quick, but it's useless. Kinda like Malt-O-Meal. You just add water and heat it up and then you don't want to eat it any more. The only way to choose the course and car is by choosing the two-player race option. Since it's doubtful you'll be able to confuse someone else into wanting to play this at the same time as yourself, this probably won't happen too often.    Graphics  Graphics  The graphics are just baby steps away from the PS One predecessor. The engine is solid and maintains a good framerate throughout, but that's because not much is being asked of it. The environmental geometry is basic and never opens up into any large areas. Even the views have been simplified to just two: front-bumper cam and right-behind-the-car cam. The former is easier to drive with, but a driver-seat cam would have been much better. That couldn't have been too difficult, but it's not here and it damn well should be.   One part of the graphics does deserve special mention, however, and that is the level with the lava creeping onto the track. The lava doesn't do any damage to the trucks ('cuz these are Ford trucks), but going through them does produce a thick cloud of black smoke. This black smoke didn't look special and really shouldn't get any special mention, but it is funny that the only penalty for driving through lava, which is really hot, is a puff of smoke.   Sound  The soundtrack to the Ford life is filled with horrendous rock and funk bands that sound like those bands you listened to in college. You know the ones: they formed just a few weeks before the big day and practiced a couple times, but never together -- yes, those guys.   The rest of the audio effecs have some unconvincing whines and growls that don't always sound like they came from the belly of a Detroit beast. We've definitely heard better and are willing to bet that you have too.    When FR2 finally does get its groove on, it has a few moments of some mildly exciting racing, but these were far and few between. The arcadey physics and simple tracks make for a pretty bland experience. There are some interesting challenges with the racing line and the general game engine is decently executed with some arcadey physics and yet it still is not remotely enough. You're better off playing another racing title and imagining that they cars all have blue Ford logos on them.", "date": "Nov 3, 2003"}