{"name": "Black Dawn", "name_review": "Black Dawn", "ref": "https://www.ign.com/articles/1997/01/03/black-dawn-2", "text": "Remember that old TV show Airwolf? Didn't you always wish you could fly that attack chopper into battle, shooting down terrorist planes and helicopters? Didn't you always wish Ernest Borgnine was your co-pilot? OK, maybe not that part, but the rest, yeah!   Like this season's other big chopper game, Electronic Arts' Soviet Strike, Black Dawn puts you at the controls of a military attack helicopter, in this case an AH-69 Mohawk. And also like Soviet Strike, Black Dawn sends you on campaigns, comprised of multiple missions. In fact, the two games are stikingly similar. Black Dawn does, however, have its own peculiarities.   Terrorist groups have grown powerful over the years, and in 1998 the situation has reached a head. You are part of a Black Operations strike force, sent into hostile territory to complete seven campaigns in varying global locations, each comprised of multiple missions. The missions must be completed in order, and you cannot save until the end of the campaign. This can be frustrating, because if you die before you complete the entire campaign, you have to start again from the beginning.   Black Dawn is less of a sim than Soviet Strike, which is to say not at all. It's placed squarely in the ~Arcade~ file. While your fuel and ammo can (and does) run out in the middle of a campaign, fuel-ups and weapons upgrades are achieved by flying through power-up icons. These appear after you destroy an enemy vehicle, so you can't just ~shoot and run.~ This does make it hard to manage your resources, as you're never sure just what power-up you're going to get. And if you run out of fuel, you're screwed. You can pick up a wingman to help you, though, which can come in handy.   In the looks department, Black Dawn has got it covered. The different landscapes range from water to park to snow, and are textured accordingly. The enemy planes and choppers are superb, and there's no shortage of awesome explosions. In addition, the light sourcing is well done, especially on the night mission.   Black Dawn is a satisfying arcade chopper game, and while it doesn't have quite as strong an AI program as Soviet Strike it is an enjoyable game.", "date": "Jan 3, 1997"}