{"name": "MechCommander", "name_review": "MechCommander", "ref": "https://www.ign.com/articles/1998/08/19/mechcommander", "text": "It's not as if the world was exactly dying to get their hands on another real-time strategy game. The last Christmas season alone brought over 50 new titles to the genre and the steady stream of Warcraft and C&C clones since then has made the category a sort of industry joke. Fortunately not every one is trying to copy what has come before. Microprose's latest addition to the jam-packed genre, MechCommander, is a refreshing break from the standard real-time model that places emphasis on unit skill rather than unit production. Sadly, the game is held back from reaching its full potential by AI and pathing problems. First, let's take a look at the good in the game.  MechCommander's story line and game mechanics take place entirely in the ultra-popular BattleTech universe and for the most part hold true to that system. Players take on the role of a newly created officer type, the mechcommander who's job it is to coordinate the efforts of a team of 'mech pilots. Basically the way this translates into gameplay is that players point and click on different areas of the map. From here the 'mechs lumber over to the selected point and do their best to complete the instructions given to them (more on this later). Outside of missions players can design their own 'mechs in the 'mech bay, or even salvage and rebuild defeated enemy 'mechs. Since units and resources are very limited in the game (and earned at the end of missions, there's no mining to do here), the value of each unit is immense. Loose a 'bot in the first mission and you won't have him for the rest of the game. This is where the true strength of MechCommander lies. Unlike the majority of real-time strategy titles that break down into production contests, MechCommander encourages strategic thinking by making the loss of an individual unit really hurt. All of this action is portrayed with excellent graphical expertise. Everything from pilots ejecting to 'mechs knocking over trees is shown with surprising detail and fluidity and does and excellent job of bringing players deeper into the game. Better still, the interface is well-designed and easy to handle, and should prove almost invisible for most fans of the genre. Unfortunately telling your 'mechs what you want them to do isn't the problem with this game - it's getting them to actually do it.  MechCommander has some seriously bad AI problems. Point and click on an area, and your units will almost certainly move towards it, but may or may not end up at that point exactly. While this doesn't prove to be much of a problem in early missions, it can be very frustrating once the game gets heated up - there are many times that reaching the right point at the right time quickly can make the difference between loosing a 'mech or keeping it. In fact, if players get their units in too tight a clump, they may end up watching their own units blow each other to pieces. This would be frustrating under the best of circumstances, but in a title that revolves around being in the right place at the right time, it is downright tragic. Still, as unfortunate as it is, the flaw is not entirely fatal. Most players will be able to learn the quirks of the movement system and with a little luck will manage to play around the problem.  Another problem with the game can be found in the team's simplification of the MechWarrior game itself. All considerations of aim and heat management have disappeared. Although the game's developer's claim that this was done to keep gameplay moving, it seems to be a rather major departure from what the BattleTech universe was all about in the first place. Rather than making each shot count, players are now encourage to just blast away with abandon - after all, there are no real reasons not to do so. This wouldn't really be considered a design flaw in any other game, but is almost certain to disappoint fans of the original board games.  To sum up, MechCommander is an exciting new take on an increasingly dull real-time strategy genre with a couple very serious flaws. Even so the game's positives are plentiful enough that players with the patience to learn how to play around the game's irritating AI problems will be able to find plenty here to entertain themselves with. This is the first effort from the fledgling house at FASA Interactive and shows a lot of promise for the future if the team takes the time to iron out the kinks.  -- Trent C. Ward", "date": "Aug 19, 1998"}