{"name": "EyeToy: Play", "name_review": "EyeToy: Play", "ref": "https://www.ign.com/articles/2003/11/04/eyetoy-play", "text": "Call it simplistic. Call it silly. Call it what you want. But there is something ridiculously likeable about the EyeToy, Sony Computer Entertainment's newest little peripheral.    We know what it is, too. It's simple vanity. Ever walk by a large, clean window and gaze at your reflection? Yep. The EyeToy is all reflection all the time. You are constantly looking at yourself, posing, dancing, and asked to provide silly facial expressions. It's not exactly one of the seven original deadly sins, but it's no matter, the EyeToy makes expressing yourself - vanity, if you will -- good, light fun.    To be honest, we have been seeing this technology for years now at trade show after trade show (since the year 2000 at the spring Game Developer's Conference). But this year, SCE finally applied the game's best qualities to games.  So, with the purchase of your $49 EyeToy, you're actually getting 12 mini-games, plus several play zones in which to simply goof off in.   When you purchase the EyeToy, a disc with 12 games comes with it, comprising the ~Play~ disc set. The games are, in no particular order, Beat Freak, Kung Foo, Wishi Washi, Soccer Craze, Boxing Chump, UFO Juggler, Slap Stream, Plate Spinner, Disco Stars, Ghost Eliminator, Mirror Time, Rocket Rumble,     Beat Freak:  is similar to Dance Dance Revolution in that it's a dance game, but it's more like the arcade game Para Para Paradise, since you're using your hands. In it, you see little discs spinning from a center point toward speakers and as they hit the speakers - one in each corner - you touch the speaker. The close the disc is toward the center when you hit it, the better the score you get.   Wishi Washi:  is an exercise in washing windows. Yes, that's right. The more windows you can clean with both hands before the timer goes off, the more points you get. It's cute but simple. Nothing more to add.    Soccer Craze:  This is a funny little game. You can use your hands, but you should really use your head. The goal is to head the ball into the windows of the apartment buildings on either side. If you do well, a second ball appears on screen for extra points. Bald mean men appear to puncture the balls and you have to avoid hitting the good guys too.   Boxing Chump:  A simplistic boxing game. Punch low or punch high. I like this game, but it's no rockem-sockem robots, darnit!   Kung Foo:  is just like the arcade game Whack-a-Mole in nature, but with silly little Asian characters jumping from all over the place. It's actually a workout for your deltoids, and it'll make you laugh just because it's so silly.     UFO Juggler:  Spin UFOs for points? It's distracting, and not my favorite.    Slap Stream:  A cute arcade game. You must hit the rude little mice showing their bums at your and making fart noises as fast as possible. The faster you attack, the more points you earn. But don't hit the cute little bunnies in white, or you lose real quick.   Plate Spinner: This is good stuff. You must spin plates, as many as four, and keep them spinning for the highest point score possible. If you do it well, you can maintain a rhythm for extra points. Also, there are monkeys involved. Monkeys are always good!   Disco Stars:  Another dancing game like Para Para Paradise, this Simon Says-style gives you several different songs to choose from and to dance to. Follow the leader and hit the points on the beat, baby! Oh yeah!   Ghost Elimination:  You're the big man in a spooky graveyard. Grab as many ghosts as possible and squish them. And for bonus points, squish flocks of bats, too. Clever but it's hard to know if you should squish them or bat them around. In either case, this one is the least polished of the lot.    Mirror Time:  This one plays on the ideas of a fun house, symmetry and reversal. You smack green icons but avoid red ones, while the screen splits and uses reversal to fool you. It's clever, and as simple as any good carnival game ever was. This is one of the more difficult ones.    Rocket Rumble Perhaps my favorite, Rocket Rumble is basically Fantavision using the EyeToy. It's pretty, it's fun to get combos, and we only wish it were deeper. But hey, it's good stuff.    The Play games are carnival and arcade in nature. The concepts are simple, instantly graspable, and fun for a single player. There are 12 of them, plus the icons, menus and characters on screen are likeable, cute and funny.    On the downside, none of these games are deep in any way. They are uncomplicated enough for a four-year old and appealing enough for your grandmother. None of them come close to the sophistication of today's multi-genre endeavors, but it's OK, cause the games clearly don't try to be anything other than what they are.   Let's be clear about it: EyeToy is the ultimate party game device. We have no qualms saying that if you bring this to a party where they play PS2 games, you'll be the star. No, really. As soon as someone sees these games in motion, they instantly want to try them. We had people walk buy and say, ~Oh that's so stupid.~ But within minutes, they all came by and tried it out for themselves. Heh. The EyeToy is irresistible.It's simple, really. You get this for your girlfriend and she'll be hogging the PS2 forever more. AND she'll stop bugging you about playing too much Final Fantasy X-2, AND she'll want to take it to parties, AND you'll finally be the party hero, instead of a party loser. Well, we just plain lied about that last part, but hey, EyeToy is good, earnest fun, like being at the county fair, except it's in your own home, its a Webcam, and it's cool.", "date": "Nov 4, 2003"}