{"name": "Mario Party 5", "name_review": "Mario Party 5 Review", "ref": "https://www.ign.com/articles/2003/11/08/mario-party-5", "text": "It seems like yesterday that we were invited to Nintendo's popular party -- and here we are again, four friends sitting in front of the TV, Wavebirds charged and drinks in hand, ready to sink our teeth into the latest Mario Party for Nintendo GameCube.Just a little over one year after the fourth installment both enthralled and annoyed us, Mario Party 5 has somewhat quietly slipped into stores, ahead of its official release date of November 11. Overshadowed by next month's big multiplayer extravaganza, Mario Kart: Double Dash!!, MP5 may not have gotten as much attention as other new releases headlined by Nintendo superstar mascot Mario, but don't mistake the silence for a sign of bad quality. Mario Party 5 is not only a better game than last year's, it's hands-down the best party game on the console.Features Four-player party action, with more than 70 new mini-games Play the party game in free-for-all or team-work mode (2 vs. 2) New capsule system, lets you change the location of events on the game board New duel, traditional, or everyone-vs-Bowser mini-games Play as Mario, Luigi, Peach, Yoshi, Wario, Waluigi, Daisy, Toad, Boo, or Koopa Kid Donkey Kong appears as non-playable event character (along with three banana-themed mini-games) New, easily scrollable 3D maps Compete against the Koopa Kids in the new Story Mode Play mini-game tournaments against friends or the CPU Assemble machines and do battle in the Super Duel Mode Compete in three bonus modes: Card Party, Beach Volleyball and Ice Hockey Supports progressive scan and Dolby Pro-Logic IIGameplayLike its predecessor, Mario Party 5 is both a game of chance and a game of skill and quick reactions. And like MP4, it features a turn-based board game at its core. Players roll the dice and move over differently-themed boards on their quest for stars, then engage in frantic mini-game battles for coins (which in turn are needed to purchase or win stars). After a predetermined number of rounds, the game ends and players are awarded bonus stars depending on what happened in the game (a feature that can once again be turned off, if you don't like the unpredictability of it all). And like all of its predecessors, Mario Party 5 is really two different games -- depending on how many players are invited to the party. Play with four players, and Mario Party 5 is a blast to play. Because of the interaction between players off-the-screen, waiting for other players to take their turn doesn't put you to sleep. But that doesn't change the fact that developer Hudson and Nintendo have once again ignored the series' biggest problem: wait time.This is where we launch into our yearly rant on making players watch the same in-game event scenes over and over Look, guys, it's fun seeing a Hammer Bro. slowly come out and toss hammers at you once. See it twice and it gets boring. See it 100 times and it'll suck the lifeforce right out of you. We can't be the only people on the planet who impatiently wait for the CPU players to move, clicking our controllers' buttons in frustration, anxious to finally go at it in a mini-game again! This problem is compounded by the addition of the new capsules that can virtually turn every space on the board into a ~happening spot~; as well as one of Bowser's nasty habits to do the same when there's only five rounds left in a game. Instead of just bitching about this problem, how about we try to be constructive and propose a solution:R Button: speed up all non-player controlled and automatic scenes (ie: when Mario is hopping across the board, triggers an event at the end and is chased by the Indy Jones boulder, and so forth). Just run everything at 5x the speed while the R button is pressed. Heck, you can even mute the audio and make it play all fast and high-pitched, like pressing fast-forward on an old Beta deck.L Button: rewind the action. If you fast-forwarded the CPU's turn and you're surprised that you're suddenly 30 coins poorer, hit the L button and quickly rewind to see what happened.Let the player speed up his own non-controllable scenes when it's his turn. Let all players be able to speed up the CPU's scenes. Voila! Problem solved. Instead, this incarnation of MP gives us slightly faster player movement (the characters no longer casually stroll across the board), the option to speed up message text, and an all-new Story Mode that addresses the wait time at least to a certain extent. In this special single-player mode that has you compete against Bowser's Koopa Kids, all three opponents move at the same time. This greatly cuts down on wait time, but still has you twiddling your thumbs as you watch the computer players pick where they'll go and trigger events. Nintendo's own Wario Ware for GameCube actually features things for the other players to do when they're waiting for their turn (such as moving across the screen and stealing stuff) and the A button speeds up certain non-controllable events, such as card counting. With that, we end our yearly rant in the hopes that Nintendo will listen to our pleas and hit fast-forward on all the unskippable buzz kill that's inflicted the series since the very start.Blow the whistle to guide Chomp to the goal -- but don't get bitten. Let's move on to what makes Mario Party 5 stand out from the rest of the party crowd -- whether they're Sonic, Disney, or Shrek themed: good mini-games. Lots and lots of good mini-games. The variety, control, and presentation of all of Mario Party 5's little battle games never ceases to amaze us.  How come no other company (or even Mario Party 5 maker Hudson) can make another party game that has mini-games this good? Whatever the answer, we are once again hooked on jumping, buttstomping things, hitting buttons, shooting stuff, avoiding obstacles, and popping balloons. Whether you're dodging our familiar blue pals in ~Pushy Penguins~, climbing up a magic beanstalk, playing co-op jump rope or teaming up to move the handles on a clock, there is no denying that the designers of this game are full of ideas. Although it would have been nice to see some of our favorites return, like Dungeon Duos (nothing beats it), we can already see that there will be quite a few games we'll fondly remember when MP6 rolls around. For example, Piece Out, a deceptively simple two-player puzzler, is better than most standalone puzzle games we've seen in recent years.The main board game's items shops have been replaced with capsule dispensers, which is a great change for the most part. You no longer buy items, you simply get random ones from an oversized gumball machine. Once you have them, these capsules can be used on your player before each turn (which costs coins), or placed on the board up to 10 spaces ahead of your character. The cool thing about this is that you could potentially step into your own trap -- or reap the benefits of whatever event you placed on the spot. Naturally, Hudson added tons of game-altering events (collect three miracle capsules to steal all the stars from the player in the first place), which makes for a turbulent gameplay experience. It's often impossible to predict the outcome -- but it's not all a game of chance. Smart use of the capsules can help turn the tide, and you can always secure yourself a star if you're kicking ass in the mini-games.Once you have unlocked a fair number of mini-games in the board game modes, one of Mario Party 5's other modes starts to get interesting: Mini-Game Mode. Up to four players can go head-to-head in Free Play (play any unlocked mini-game), Battle (tournament -- spin a roulette to determine mini-games), Circuit (kart-themed mini-board -- winner gets to hit the dice block and move forward), Decathlon (10 games), Wars (capture tiles on a hexagonal field), or Tournament (compete in duel-only mini-games). Each one of these games comes with a different look -- and all are worth playing for those that hate waiting for their turn in the main modes or those that don't have the time to commit to a full board game.Then there's the Super Duel Mode, which lets one or two players buy parts with coins they earned, build a battle machine, and then do combat with a friend. The premise of customization and combat sounds great, but the actual gameplay feels sluggish (even with faster machines) and unexciting, making it strictly a mode for the very young. Finally, Bonus mode offers two action sports games, Beach Volleyball and Ice Hockey (don't expect something as fleshed out as Beach Spikers or Hitz, but both are amusing multiplayer diversions) as well as a somewhat different board game style, called Card Party. Players roll the dice and try to find stars in a card labyrinth that is only gradually unveiled as the cards are turned over. Waiting for turns is once again a major downer, but the actual gameplay, by board game standards, is solid.Overall, Mario Party 5 is once again a collection of incredibly addictive (and well-thought-out mini-games), framed by a decent, chance-based board game experience. Like its predecessor, it suffers from wait-o-ritis because of its turn-based nature. The sluggishness of the board game isn't quite the welcome resting point between mini-games as it would initially appear to be, as the more you play it, the more familiar and boring the non-controllable events get. Still, if you've got three friends who come over to your place often and stay long, Mario Party 5 is the game to get.GraphicsFeaturing fully-3D boards and nicely detailed player models, Mario Party 5 isn't a bad looking game. While the effects work and the environments are simple, one can't deny the variety and loving detail with which the designers endowed each and every map and mini-game. Things don't look so hot when the camera zooms in while your character is standing on the board -- and facial animation and actual story cutscenes still seem to be a foreign word for the folks behind this game, but it's a good looking party game that rings true with the Mario universe. The game runs smoothly at all times and supports progressive scan 480p mode for HDTVs (when output via component cable) for that extra crispy look.SoundWhile other games are surging ahead in the audio department, the Mario series seems to be treading water. We're treated to the same ~hahaha~, ~banana banana~ (it's clearly what DK says -- you know it!), and strange grunts as always. All interaction beyond that is done via text, without narration or actual character speech. Likewise, the music sounds like, well, a Mario game. Which means anyone who's ever owned a Casio synthesizer in the '80s will probably feel all nostalgic. On the downside, trying to mimic an orchestra with said samples results in an incredibly cheesy sound. It's time Nintendo either updated its libraries, or went out to some seedy Kyoto bar and hired some almost-out-of-work jazz band for a few bucks to jam through the entire Koji Kondo repertoire. There is no reason to not try something a bit more adventurous than the same old bad synth orchestra stuff. The game uses Dolby Pro-Logic II, but due to the nature of the game, ineffectively.I asked to review this game. You see, I've got quite a few non-gamer friends who love playing what many would consider ~mainstream~ games, like EyeToy or Mario Party -- and I can't count the number of hours we've wasted on this particular series. Mario Party 5 is another successful installment in the franchise. On the one hand, it's filled to the brim with imaginative mini-games and modes, on the other it still suffers from the same baffling waiting times in the board-based modes. As a multiplayer party game, Mario Party 5 is a must-have, there is no question about that. You'd be hard-pressed to find another four-player game that's as easy to get into and as tough to put down. The spotty single player experience and the waiting (even when playing with multiple players) bring down our overall score, but there is no denying that this is another quality party title.Mario Party is an interesting game in that it is able to appeal to two very distinct audiences. It really is the perfect drinking game for college dorms (heck, it even has some advanced stat tracking options that show you in graph-form when player #3 started to suck) and at the same time a great game for kids to enjoy with their siblings. Judging from other efforts in this genre, until Hudson fixes the wait time problem, Mario Party 5 is likely as good as mini-game party games get.", "date": "Nov 8, 2003"}