{"name": "Tekken 3", "name_review": "Tekken 3", "ref": "https://www.ign.com/articles/1998/08/24/tekken-3", "text": "In the world of fighting games, Namco's Tekken 3 stands alone. Although there were some doubts about its conversion from the arcade's System 12 board to the PlayStation, and concerns that Tekken 3 would be just be a slightly better Tekken 2, those fears are unfounded. Not only is Tekken 3's core game as close as you can get to arcade perfect without getting a new machine, the extra features included make it the most well rounded fighter on the market.  As the PlayStation reaches the three year mark, more and more games are seriously pushing its limits, and Tekken 3 is one of those that makes it very apparent that the PlayStation is reaching its physical limits. At first glance, Tekken 3 looks just like it did in the arcade. The animation speed is impressive, and the textures are cunningly crafted to make the lower-resolution models look as good as possible. However, after a while, you will notice that the characters are significantly chunkier, and despite all efforts, the backgrounds are still simple 2D backdrops. Still, it's the best-looking fighter on the PlayStation this side of Tobal 2.  Tekken's fighting system is arcade-perfect. Arguably, it still is one of the best on the PlayStation. For those new to the series, Tekken uses two punch buttons and two kick buttons to simulate the left and right sides, and as such, will be unique until Bio Freaks comes out in the US. It a fighting system that's worked extremely well for Tekken over the years, and it's just gotten faster and better. There's a huge number of moves and combos available now -- almost as many as Virtua Fighter 3 from Sega, which isn't on the Saturn. It's not so much an improvement upon the Tekken series as a maturation. The characters seem well-balanced, and some of them have been reworked to be less cheap (can you say Lei?). All in all, this game is more even than any of the previous ones.  Of course, as a fighting game, Tekken 3 is everything you'd hoped it would be, but without the classic Namco extras, this would just another really good fighting game. The ending FMVs are back, and if they're any indication, Namco's upcoming CG movie is going to be stunning. The animators have progressed to the point where realistic hair and human models are uncannily real, down to individual strands. Check out Lei's ending just to see how good they look. While we don't mention FMV normally, it's become part and parcel of each Tekken to have one for each ending movie for each character, and it's one of the fine touches that make Tekken one step above everything else.  As fighting games continue on and on, more designers are realizing that fighting just isn't enough. Ending FMVs, extra battle modes, quest-style RPGs are seeping into the genre. Nobody realizes it better than Namco, and one of the reasons that Tekken 3 gets the top score is because it has two excellent alternative play modes: Force mode and Ball mode. Ball mode is the already popular beach ball competition which places the Tekken characters on the beach and in a duel to the inflated air death. Force mode is the Final Fight style side-scroller mode. Both of these are surprisingly playable and complete -- they're well thought out instead of being mere throwaways. Although they're limited in appeal, such alternative modes are going to be the wave of the future, and Namco has made a great start.  Tekken 3 on the PlayStation is the most well-rounded fighting package on the market. Not only does it provide an excellent fighting game, but the extra modes and practice features make it the benchmark for fighters to come. The only gripe that we'd have with it is that Namco's set the bar so high that we shudder with anticipation and dread over what the designers'll have to do to top this.", "date": "Aug 24, 1998"}