{"name": "NBA Showtime", "name_review": "NBA Showtime: NBA on NBC", "ref": "https://www.ign.com/articles/1999/11/18/nba-showtime-nba-on-nbc-2", "text": "The return of two-on-two arcade basketball in the mold of the original NBA Jam arcade games comes to us courtesy of Midway and its arcade-to-N64 port, NBA Showtime: NBA on NBC. We were looking forward to some of that back-and-forth, rim wrecking, rowdy and lewd basketball action that can make for some of the best multiplayer action on any platform. A funny thing happened on the way to the N64, though, for NBA Showtime. Most of that arcade action we'd been craving has made it home to our favorite Nintendo console, but there are just a few things missing here and there that are enough to get your attention in a negative way. But we're only talking about slight differences. The little things. It's sort of like being in the twilight zone or even in Europe where they put mayonnaise on french fries.  The Features:   Full NBA license includes real players and 29 authentic arenas Exclusively licensed NBA on NBC music and graphics. Aracade style Create-A-Player feature includes RPG style improvements. Television style camera angles and replays. Five players for each team plus mascots and other hidden characters. Dozens of individual dunks. Console exclusive codes for ~InfiniteTurbo~, ~No Goaltending~, ~Always On-Fire~ and more. Secret courts including playground and outdoors. Dozens of player animations including ballhandling moves and celebrations. Free throw shooting element adds more realism to an otherwise 'Jam' style game.  Multiple powerups like ~Hot Spots~ and ~Team Fire~ Multiplayer mode. Rumble Pak compatible. Endorsed by Shaquille O'Neal.   Gameplay The concept of two on two arcade action has basically remained the same since 1992 when the original NBA Jam arcade machine came out. The emphasis is still on outrageous gameplay with the rules and mechanics of the game only loosely based on real life physics and other human limitations. Showtime in the arcades simply added the full NBA and NBC licenses to give the old basketball arcade game some attitude and slick television presentation for the late 1990s.   The biggest difference between the N64 version and the arcade Showtime game is speed. Believe it or not, the Nintendo 64 version actually moves faster than its arcade big brother and we don't mean slightly. NBA Jam on the old Genesis system was incredibly fast and so we've been led to believe that a super charged game makes for a better home gaming experience since you won't have to waste quarters getting used to the pacing of the game. We've also been led to believe that there's a major graphics-game speed  tradeoff going on with Showtime so that the game would have to be super fast to justify its lack of detail and rough look.  The artificial intelligence is the same so that the computer controlled team will always stay within striking distance and that the losing human team will get that nice catch up ~luck~ working for them when they need it. Sometimes the computer's A.I. pattern will be to play solid defense and run a conservative offense. Other times, the bots will try to simply outgun you by letting you score and capitalizing on their superior firepower. Usually, however it will be a nice mixture of all playing styles depending on the time remaining in the game and the score.   The create-a- player made the transition to the N64 intact and should give bored players plenty to do once they've beaten every team in the game. All of the mascots, animals, crazy outfits, nutty courts and collection of power up codes have all been faithfully recreated in the N64 version of Showtime.   As far as the little differences between the N64 and arcade machine games, you'll notice that there are no replays during the run of play. The Dreamcast version of Showtime will have the little three or four second replay of a great play right after it happens but this has simply been omitted from the N64 version. Also there's a major collision detection/animation problem in Showtime that seems simply be an oversight on the part of Eurocom, the game's developer.   Jump shots that appear to be off, usually headed towards the front lip of the rim are the one that seem to go in, while shots that appear right on target will ricochet off the middle of the hoop as if it was the heel of the rim. This happens at both ends of the court and it is consistent. It's annoying because you'd figure tweaking the game's engine to move the ball where it's supposed to be would be an important little detail to both Eurocom and Midway. Unfortunately, the ball-rim interaction isn't the only problem that pushes the envelope of annoying.  The dunks in Showtime are a major part of the game's appeal and there's a major problem here as well. As you take Ray Allen high into the sky, whirling about, the announcer yelling out some crazy catchphrase, he'll eventually start to descend towards the rim.  And then, all of a sudden, before you can say ~Vitaly Potapenko~ he's got his hand on the rim, the ball is through the net and the dunk animation is over. The canned dunk animations seem to be roughly split into two parts --the flight and the follow through, for lack of better terms-- don't always sync up and your eyes will see what looks like a hitch or drop in framerate. The bottom line is, you never actually see the ball go through the rim.   This off-track dunk animation is especially apparent when your player goes into his dunk flight animation and gracefully floats past or through the backboard, a problem in itself,  only to ~magically~ appear hanging on the appropriate part of the rim when the second part of the dunk animation kicks in. This is very very disturbing.   Considering jump shots and dunks are the pretty much what this game is all about, it's fairly disappointing to see so little attention paid to refining those animations for the N64 version of Showtime. It really gives the impression that this title was either extremely rushed or an unloved cut-and-stuff job of transporting a great arcade and Dreamcast game to the Nintendo 64's limited cartridge space.  Shooting free throws is nearly impossible because of the crudely translated interface. That little ball bounces back and forth fast enough in the arcade game. Not being able to see that sucker move in the N64 version just isn't fair.  The multiplayer game is always a solid part of games like this and you can expect some heated battles when you get down to it with some of your game playing friends. There's some slow down when you get four going at once and unfortunately all of the game's missing elements are still missing in multiplayer games.  Sound The story with the sound is similar to the rest of the game's presentation. Most of what you want is here but there's enough missing to make you take notice. There are no player mentioned by name in the N64 version of Showtime. At the beginning of the game when they trot out and stand there to be introduced......there's nothing. They just stand there and wave. Throughout the game the announcer will refer to the team names and nicknames but no ~Barkley to Olajuwon, what a move!~  Other than these key omissions the sound is still one of the strong points of the game and we especially love the snappy lines that pop up from time to time. ~In his case, the playground is heaven~ is a line that would be over the heads of all but the most dedicated hoop fans and it's this attention to detail that makes the audio sections of Showtime appeal to basketball fans.  The music is typical urban, high energy fare that goes right along with the intensity and excitement of this game. Beyond this all of the dribbling sounds, sneaker squeaks and explosions are well done and on time enough for us.   Graphics This is yet another example of how Midway teases us with an N64 version of their successful arcade and Dreamcast games.  The graphics are certainly going to suffer because of the console's limitations, but this doesn't make it any easier to forget what this game is supposed to look like.  All of the same animations are present but the player models are just at a much lower level of detail. You won't recognize Reggie Miller's smiling mug as he scoots up and down the court, but at the end of the quarter, when the close up camera zooms in on him he'll look like his familiar self. The extra muscular look to the players and their accurately mapped faces are night nearly as crisp and clear as their DC and arcade counterparts. We said it with Ready 2 Rumble and we'll say it for Showtime: the N64 version looks just like the Dreamcast version... if you were looking at your television through a dirty screen door.  To keep the speed up, the level of detail on the players was dropped but other corners were cut as well. The crowd is completely still and they actually look like cardboard cutouts. The rolling banners at the NBA scorers table that usually changes to say ~NBC Sports~ or ~I Love This Game~ in the advanced versions of Showtime don't move in the N64 version.   One silly little thing about Showtime that really got under our skin was the text. The menus and even the gameplay screen have some of the lowest resolution text we've ever seen in a videogame. On the player selection screen, the player ratings and attributes were so hard to read that we thought it was written in Cantonese. There were times where we couldn't recognize a player by his face and that's a shame because we couldn't read his name either. If you have a TV smaller than say 21 inches, it's very possible that you won't be able to read half of the writing in NBA Showtime. Unreadable menus is one of the biggest videogame sins that we never knew could happen.  As far as looks go, Showtime for the N64 had a lot to live up to, but it seems the game was made to look even less refined in the interest of keeping the framerate and overall speed of the game at their max. This is a sacrifice that had to be made, but we're convinced that with only four characters running around a more or less static 3D environment, the N64 has enough processing power to make the guys look a little sharper and still move just as quickly.  Normally I'm impressed with Midway's efforts to accurately reproduce their franchise games across all videogame platforms, but with Showtime there seems to be corners cut that could've been dealt with in a better way. While the speed of the game is impressive and the action is non stop, the sum total of all the little omissions here and there do add up and dampen the spirit of the game enough to notice. No replays, missing sound samples and choppy scoring animations may not seem like much by themselves but taken together they all point to one thing. This game was rushed and/or a low priority. Even if we forgive the missing sound because of the N64's weak audio capabilities, we can't overlook other clues of laziness. In the create-a-player mode there is still the option to choose your guy's jersey number even though there are no jersey numbers anywhere in the game. Showtime is the best two on two basketball arcade experience on the N64 period. I just can't escape the nagging feeling that this game could've been done a little better with just a little more time or effort or both.", "date": "Nov 18, 1999"}