{"name": "Cabela's Dangerous Hunts", "name_review": "Cabela's Dangerous Hunts", "ref": "https://www.ign.com/articles/2003/11/11/cabelas-dangerous-hunts", "text": "is the immediate follow-up to 2002's first console Cabela game, Big Game Hunter. The earlier title was a decent entry in the field of hunting simulation but lacked polish and depth. Dangerous Hunts takes that core game play and makes improvements in almost every area for a more exciting and complete hunting game. The graphics, sound, and gameplay mechanics have all been amped up. The game is still a long way from perfection, but anyone with even a remote interest in hunting should keep reading.   Now, from the get-go there are three ways to jump into the game. Action zone will pit you against a continuing onslaught of different animals. As each area is cleared of prey, a portal opens and transports you to the next challenge. The animals are often large, slow moving targets that go down in a single shot. If you have a handle on aiming, and pulling the trigger these levels offer very little challenge. The mode is amusing the first time through, but it is too easy to really add to the game.   Quick Hunt offers gamers a chance to jump into the thick of things without the business of advancement and level unlocking. I found this mode to be useful for testing new items and weapons before jumping into the meat of the game that is Career mode. Players begin their career by creating a profile with a customizable skill set which includes strength, stealth, and accuracy. As in Big Game Hunter there is the option to choose from different age demographics like young male, or middle age woman. A character's weaknesses can always be compensated with higher quality items. These are of course purchased at the store.   Click For More Images For many hunts there is a focus on item management. This means that gamers will want to carefully select which hunting accessories are going into their limited pack if they want to successfully bag an animal. There is an auto-equip option too but there are some instances where the suggested items will exceed the available funds. This means that players must manually remove some items. This takes the ~auto,~ out of auto-equip but at least it lets you know what to save up for. Most non-predators have a corresponding call or decoy that proves to be highly useful when tracking them down. Hunting without these items is not recommended, as it adds countless hours to the process of tracking down some of the more scarce prey.   After filling up your pack with hunting goodies, gamers can either charter a hunt to any available location or attempt a challenge. Filling tag quotas for each area and successfully completing requirements of a hunting challenge unlock these locations. Some of these include killing a set number of animals before sunset, or taking down an animal with a specific weapon. One of the first available chartered hunts is in the forests of northern California and the easiest way to begin a game is by selecting the wild boar chartered hunt. The animals are relatively easy to find and can be taken down with a standard rifle or handgun. Hunts grow progressively longer and more difficult as players amass the money to buy better equipment.   In all, Dangerous Hunts features 27 different animals across 12 locations. There are snow-covered trails, dusty plains and dense forests. Each location is teaming with different sets of indigenous wildlife. The environments can be traversed in a reasonable amount of time, and most of the larger locations are made up of ravines that act as trails and guide hunters from one open area to the next. In some locations vehicles such as snowmobiles are available for faster transport.   While in the field, there are a few onscreen indicators that careful hunters will want to monitor. In the bottom left hand corner of the screen are the hunter's health stats. These include energy, hydration, nutrition, and stamina. On the lower right hand corner of the screen is the good old stealth meter. Unfortunately stealth is not dynamic enough to be realistic in Dangerous Hunts. It is mainly effected by whether a character is running, walking, or crouching. Unfortunately it has nothing to do with whether or not your character is in a bush or behind a tree. Approach is completely dictated by the wind indicator in the upper right hand corner of the screen. Staying downwind and moving slowly are the two important factors for successfully sneaking up on your prey.    The largest problem with Dangerous Hunts has to do with unbalanced gameplay. This is clearly illustrated by the differences in hunting a timid herbivore and tracking down a predator. On long, drawn out hunts, variables such as health and stamina will come into play, as it will take a good amount of tramping through the woods in order to find some animals. The scarce animals are more prone to being spooked and items such as camouflage and scent cover are also necessary for sneaking into position. Even after taking every precaution; move too quickly over a rise, and the more timid animals will be scared off. It is this slow and patient style of play that sets Dangerous Hunts apart from other ~first person shooters.~ The game is most successful when it is focused on the thrill of the hunt. Of course, casual gamers with short attention spans may be quickly frustrated by the lack of action.   This is probably why Cabela introduced the ~Danger,~ aspect of this game. The inclusion of animals that will seek out and attack hunters greatly adds to the action element of the game, however it also wipes out almost every bit of the previously mentioned strategy. For example, while hunting predators it is unnecessary to worry about hunting accessories other then a high-powered weapon. Gamers simply enter the level and run around until they cross paths with the hunted animal. If you want to expedite this process the store sells a predator call and a slab of meat. But because predators also seek out the hunter, there is no need for stealth or the use of lures. While these animals will put up a fight, they rarely do much damage before you are able to take them out. Anytime a player kicks the bucket due to an animal attack or exposure, they are rescued by a ranger and dumped back to the main menu where they are free to start the unsuccessful hunt over.   Graphically, Dangerous Hunts walks the middle of the road. The environments are well varied and have a decent amount of foliage. Small touches like rickety wooden bridges, fluttering butterflies, and falling leaves add to the feel of the game. There are a few areas with noticeable pop up, and it can be distracting that foliage will materialize as you zoom in with a riflescope. The best looking part of Dangerous Hunts are the animals.   Predators are appropriately menacing and have decent attack animations. Some of the deer and wolves look a bit stiff while running over varied terrain but this doesn't harm the game play. Ultimately the visuals are neither impressive nor offensive. With decent environments and some spiffy looking animals it has the necessary components for a successful hunting simulation.    And how about those sounds of the great outdoors? The game features gurgling brooks, chirping birds, and howling predators ready to wipe the forest floor with your carcass. Sound is most effective in tight situations. The pounding of hooves from a charging boar is effective enough to cause mild panic while escaping through the brush. There are also some voice clips and decent weapons effects, however the real standouts are the animal sounds and calls. I can't say if the hunting lures are completely realistic, but the predator call consistently caused my cat to hiss at the television.Dangerous Hunts offers a bit more action than the usual stealth based hunter. The addition of predators means that gamers can expect a slight break from the drawn out routine of searching for an animal and carefully getting close enough to bag it. However, the predator hunts do not add enough variation to the game play to keep this from being a niche title. Hunting fans may be attracted to the more realistic, slow, deliberate pace of the non-predator hunts but even this becomes highly repetitive after the first few levels. It is worth a rent, though.", "date": "Nov 11, 2003"}