{"name": "Gothic 2", "name_review": "Gothic II Review", "ref": "https://www.ign.com/articles/2003/11/12/gothic-ii-review", "text": "Role-playing games aren't really as prevalent as they used to be in the PC market. But even when they were, many of them were number crunching and heavy handed enough to discourage more casual gamers from taking part in an overly complex character building scheme. Many of these also used a less personal approach by locking a camera in an isometric view, looking down on a small party of characters. But every now and again, gamers that want an RPG that combines the personal nature of a single character with less mathematics get what they want. Such is the case with Gothic II, a generally fun and large gameplay experience that is hampered by a sad interface, a combat system that can be frustrating, and fairly hefty system requirements.   Gothic II picks up where the original Gothic left off. The same hero is back for this sequel which takes place literally two weeks after the end of the last game. The Sleeper was defeated and this nameless hero (who it seems will forever remain nameless) was buried in the resulting shake-up following the great evil's demise. Lucky for our hero, Xardas the magician was there to save him and heal his wounds. When the hero wakes up, this new adventure begins as Xardas explains that the last breath of the Sleeper awoke even more bad things to do his bidding, including dragons, and that once again, Nameless is going to have to save the world. To do this, you'll have to take control of the hero and acquire the Eye of Innos, which is your first and biggest quest.   Of course, in the name of this quest, you're going to have to undertake many other quests in order to raise your level a bit and fit together pieces of the puzzle. Thankfully, most of these quests are more interesting than your garden variety ~pick this up for me here and bring it back to me~ types of missions. Not to say that those aren't there too, but the majority of quests given to you by the NPCs littered throughout the gaming world will be varied and fun. Some will require you to slaughter creatures or bandits while others will put you in contest with mercenaries that need a good ass kicking. A lot of the quests will require that you complete other quests as well, so even those fact finding missions will have a little more excitement to them than they might normally.     One of the best things Gothic II has going for it is its freedom. There are several ways to complete many of the missions as well as three main ways to complete the entire game. After a while of playing the game, which resides in a world that can be wandered at your discretion by the way, you'll have to make a decision which will lead you down three separate paths. This decision lies in which guild you join. Go towards the mercenaries and you'll live a life of money grubbing and martial combat. Move towards the wizard path and you'll want to become a powerful magic user. Or you could join the militia split the middle as you'll eventually become a holy paladin. Each of these paths will still bring you to the same major plot points in the story, but each will have a different path towards getting there along with different quests and dialogue as well as seeing varied reactions from NPCs. There are also apparently different endings to the game, although I certainly didn't have the time to play through all three paths so I can't really comment on their quality.   One of the great things about this big choice is that you'll have the chance to explore a bit from each of the guilds before you make your decision and begin down one path. This is actually a theme in general. You'll be able to complete quests at your own leisure (for the most part) and wander the world to find new ones in the meantime. Thankfully there's a fairly good journal section of the interface to keep tabs on what you've finished and what you haven't as well as provide some information gathered that will help to complete a quest (although there were bits left out that I thought were fairly important for some quests).   Unfortunately, the quest log is really the only good part of the interface. Your inventory in particular is a huge jumbling mess. Everything is placed into a gigantic grid of slots (you can carry thousands of pounds of equipment and food) with no options to sort by particular types of equipment as was found in Morrowind, even though it's loosely sorted by type. What's worse is you can't use your mouse to pick any of these items and select them, instead, you have to search with the arrow keys. There is no hot slot belt area for healing potions or herbs (although, if you're smart enough to read the readme file, which most people aren't, you'll find there's a way to activate that in the gothic.ini file), no good map system with the ability to mark spots to remember, and apparently no ~get all~ ability for looting corpses (although I've learned since playing that you can press the right ctrl button to collect all of each type of item, but couldn't find documentation to that effect). So if you didn't stumble across that features, you'd have to either loot each item (meaning each gold coin) individually or hold the mouse button down so that it starts to increase the number of multiple items taking per second. So in order to take 150 gold pieces off of a corpse, you can click 150 times or hold down the button and eventually get them all.    Once you've gotten over the sad state of the interface, you'll be able to sink into a pretty hefty game with a lot of quests. And if you're going to complete any of them, you're eventually going to have to try your hand at violence. While there are some options for completing quests that don't involve the slaughter of forest animals or humans that do bad things, most of them will have you fighting one way or another. Whether the fighting is actually part of the quest or just the fact that you have to fight random creatures that happen to be in the road on the way to your quest is irrelevant. Your sword will eventually drip with blood. Your need to get better at combat, whether that be martial or magical, is a huge one. At the beginning of the game, old Nameless has forgotten how to do everything and can barely protect himself against giant rats and squeaky goblins. The progression of your character to a point where you can actually kill things without worrying or getting seriously injured is long. This game is hard and getting the knack for melee combat is even harder thanks to some awkward controls.   The notion behind the melee combat is good because it's an action approach instead of a pure dice roll. As you increase your skills with one-handed or two-handed weapons, you will gain swings that you can use in a combination to do in your enemies. These combinations take a lot of perfect timing to pull off however and if you miss, or decided to stop a combo in mid-swing, you're going to find yourself standing with your sword raised over your head while you remain motionless and very vulnerable. This can be frustrating; especially when you just want I wanted to be able to use quick jabs or big swings by themselves instead of linking them into combos. Quick attacks are sometimes better.   The unresponsive controls also can aide in your demise. Don't think you're going to be able to make any quick slashes while you're moving around. You can click your mouse button as much as you want, but unless you're moving forward, you aren't going to attack. So most of the time, you'll find yourself holding down the focus button (ctrl for me) and using the movement keys to use your sword. While this is the way to get your combo attacks working, it also means that you're going to be pretty much standing flat footed. You can sidestep while holding this focus key down, but only after you've started an attack, otherwise, you'll actually just use a side slash attack. The result is that you don't have the freedom of movement that you might like. I like being able to focus on one enemy however.     If they had used a control system like Blade of Darkness  or even Zelda, where locking onto a character allows you freedom of movement, I would have loved this game all the more. But locking onto an enemy can be sketchy when there are multiple opponents. If they're running around you in circles attacking from all sides, locking onto the one enemy in front of you will leave the rest of you undefended. And then half the time, when a different enemy runs in front of you, your focus will change, and you'll be attacking this new target without finishing off the more damaged one first. The other problem with this system is that in big scrums that involve friendly AI, you could easily find yourself accidentally locking onto an innocent farmer or allied soldier instead of the intended monster.   Magic combat isn't much easier. Instead of having a hotkey to throw selected spells around, you'll have to get the spell ready, hold down the mouse button, and then press forward to use the spell. Don't even think about using a spell when holding down the ctrl key as you would for melee, because nothing will happen and you will die with much blood and screaming. But there are still a good variety of fun spells to use when you do manage to cast them correctly.   But with all of that said, when things do work (mostly when you're fighting only one opponent) and you manage to get in some combos and block some attacks, fights can actually be pretty fun. Unfortunately, finding opponents that won't eat you alive for the first half of the game is pretty difficult meaning you're going to have to wait for a while to get into entertaining fights. Early monsters can be especially frustrating simply because you can't block, so you'll have to string together attacks and hope that these creatures can't get an attack in the meantime.   Rewards for combat are the usual sort, experience and loot. One of the interesting things about combat is that many of your human opponents (especially in the mercenary camp if you decide to go that route) will only knock you down and leave you unconscious with a sliver of life left. But they'll also loot your body for money and weapons. While I like the idea, it can really screw you in practice. Now, they don't just take some of your money, they take all of it along with the weapon you were using. This can be a tremendous problem if you don't have another weapon in your equipment because you'll have no money to buy a new one. You could try to get your weapon and money back from the guy that just took it from you, but slapping at him like a pansy girl isn't going to cut it. So instead, loading a save game or having a second or even third weapon (if you get worked again) is your only choice.   Now enemy AI is pretty straightforward for most creatures. They'll attack you and attack hard. There seems to be two AI sets for different creatures. One set will just attack you head on without bothering to move around and the other will attack in packs constantly moving around and giving you fits because of their speed. Both will kill you. Opponents with weapons are much more interesting as you'll have to block, anticipate attacks, and make sure that you keep locked on them as they strafe and run around. Usually, if you're being attacked by more than one human or orc, you're going to be in a world of trouble until you're powerful enough that it doesn't matter anymore, which will take a long, long time.    AI also has some serious pathfinding problems. You can stand on stairs or ramps where enemies could get to you easily, but half the time they'll just run in a straight line at you, find that you're up a little bit and then run around in circles or straight into a wall. Good pathfinding would have them find the ramp or stair beginning and run up to attack you. This fault can be easily exploited to make sure that only one enemy at a time can attack you. Enemies will also get stuck on objects in the world fairly easily. There were more than a few occasions where enemies were running in place while stuck on a bench or a log or some such thing.   One of the good things about the AI of characters that makes the world in general more interesting is the day/night cycle. All of the characters and monsters will recognize the time of day. Citizens in towns and workers on farms will go about their daily routines which include working, eating, relaxing a bit, talking to other NPCs, and eventually sleeping. Monsters in the wilderness have their sleep cycle with many creatures sleeping at night and others sleeping in the day. Some of the quests in the game will actually take advantage of the cover of darkness challenging you to sneak into certain areas to steal objects. Nighttime also has its own perils thanks to a very dark world. Unless you're carrying a torch or have used a light spell, you'll be walking blind half of the time. Or you can be lame like me and turn the gamma up a bit and use it like night vision goggles. Either way, finding a bed and sleeping until the appropriate time of day to complete whatever mission you're on will help quite a bit.   But all of these objects that enemies get stuck on are half of the greatness of the world in which Nameless runs around. The world is simply full of objects. Trees, undergrowth, logs, rocks, mushrooms, chests, barrels, boxes, tents, poles, houses... you name it. All of this makes the experience pretty fun. There are a lot of monsters and NPCs running around in the world as well. None of them are fantastic looking, but all are definitely acceptable. Animations for each of these can be a bit clunky, but are passably good for the most part. Particle and spell effects are also decent, if not impressive, but considering the Gothic II originally came out a year ago in Europe, that's not very surprising. Gothic II isn't the prettiest game around, but its environments are good enough to entertain and immerse.     The unfortunate side effect of so much being on screen at the same time is slowdown. If you have a good computer, you'll find that the game runs fairly smoothly as long as the view distance isn't pumped up as far as it can go. Even on a 3GHz machine with 1 gig of RAM and a GeForceFX 5900 Ultra, Gothic II will have slowdown issues with everything pumped up all the way, especially if the rain begins to fall. On a 1.4GHz with 512MB of RAM and a GeForce3, slowdown is a regular occurrence, even with settings turned down quite a bit. This is definitely something to think about if you're thinking about buying this.   There's a lot of different graphics in the world, but there are also a ton of sound bites. Every NPC in the game has a speaking voice. Of course, many of them will be overused for general NPCs that don't have a lot to say, but this is made up for by the huge amount of dialogue found within. The strange thing about the dialogue, which has struck everyone that has wandered by and seen me playing the game, is that you certainly aren't going to get the typical fantasy world British accents here. There are a lot of Southern accents, Texan accents, East Los Angeles accents, Bronx and Brooklyn accents, Midwestern fare, and some normal Hollywood American accents as well. It's a very strange mix that can be entertaining, but is always weird. It's hard to get used to hearing a guy in plate armor with a bastard sword speak like he's about to start praising the Confederacy. I happened to like this bizarre twist but it seemed that many people around the office didn't. Either way, the bytes that are there range from good to average anyway. But nobody is going to be winning a voice-over award here like the Nathan Zachary character from Crimson Skies should. Gothic II has some great content and quest progression lying underneath an incredibly clunky exterior. If the combat didn't have such a high learning curve, the difficulty ramped up a bit slower, and the interface wasn't terrible, this would be a pretty good game. There's a lot of game here that would certainly appeal to the action/RPG crowd. I'm not sure why it's so hard to create useable and fun melee combat in a third-person RPG made for the PC, especially with so many great examples to look at, but Gothic II certainly makes you wish for some. It could have been a really great and fun game. As it is, it has some really good things and some really annoying things that make average to good gaming experience on the whole.", "date": "Nov 12, 2003"}