{"name": "Batman: Rise of Sin Tzu", "name_review": "Batman: Rise of Sin Tzu", "ref": "https://www.ign.com/articles/2003/11/13/batman-rise-of-sin-tzu", "text": "Batman's had quite an extensive videogame career across all systems, and his latest adventure, Batman: Rise of Sin Tzu has been spread across all available systems thanks to Ubisoft. For the Game Boy Advance version, Batman's the lone cowboy he's always meant to be. The console version of Rise of Sin Tzu gave players control over the Dark Night's entourage like Robin, Nightwing, and Batgirl, an element that gave the PS2, GameCube, and Xbox games at least a bit of variety in their gameplay. But on the handheld, it's just Batman, and the fact that it's only Batman throughout the adventure is a good indication of the GBA version's lack of design diversity. Features Password save Four Gotham baddies: Bane, Scarecrow, Clayface, and Sin Tzu. Connectivity with GameCube Rise of Sin Tzu on the handheld is a rigid brawler that takes place through the streets and rooftops of Gotham City. Though fighting's the main objective in this action title, there's also a smidge of platform elements to its design. But even with the basic running and jumping required to get from the level's start to finish, most of the gameplay involves Batman beating the tar out of the tons of enemies throughout Gotham City. This is definitely basis for a satisfying action game considering Batman's combat background, especially what's been established in the animated series. But the combat's implementation in this game is so basic and stiff that the gameplay just falls flat.  The graphic designers definitely had fun creating a whole slew of animations for Batman and the grunts that leap out of windows to attack him. The animators rendered a ton of moves for the Caped Crusader, including a series of punches and kicks that are pulled off with incredible fluidity. But in action, the combo system is so rigid and rudimentary; to pull off a flurry of attacks it's all a matter of timing the only attack button in three-press fashion. Too fast or too slow on the pattern and the attack won't come through. But pull it off successfully and the attack is successful with a very satisfying animation. But that animation is canned and reused over and over and over. Players can change up the attacks with the up or down on the D-pad, but the game features very little assortment in combat. The ~super combo~ is a canned animation that players can pull off after filling up a power-bar, but they're not in control of this action beyond activating it by holding down the attack button.  The great animation carries over to other moves, like enemies rolling backwards after being thrown, or leaping up to their feet with martial arts expertise. It's just a shame that the designers put the same amount of effort and focus into the gameplay as they did the character motions. All the platform designs are slight variations of the ones before it, with only basic use of Batman's gadget belt to get through portions of the game. Batarangs and bat cables are at the player's disposal, but they only come into play at very specific places scattered over the levels. Flash bombs are the only things in Batman's pouch that comes in handy during combat, but they're in short supply and must be collected to replenish.  The Game Boy Advance game has a bunch of levels in the cartridge, with a few more time trial levels unlockable via connection with the GameCube version of Batman: Rise of Sin Tzu. But the cartridge lacks any save RAM, so players will have to have pencil at the ready in order to save the position...which is a real drag since you'll also have to re-link the GameCube version every time you want the extra stuff. Every other Ubisoft GBA connectivity-compatible game features cartridge save, so it's odd to see Batman end up being the odd man out. Rise of Sin Tzu started out extremely promising, but ended up bland and unexciting because of the lack of any variety in gameplay. It's a mindless brawler with admittedly excellent animation, but very little technique in combat. The platform elements add variety to the bland action, but there's just no innovation or diversity. It's an alright action game in short shots, but eventually the action just drones on and on...it needs more. Much more.", "date": "Nov 13, 2003"}