{"name": "Tomba!", "name_review": "Tomba!", "ref": "https://www.ign.com/articles/1998/08/25/tomba", "text": "Take one part platformer, add two parts adventure game, and you're bound to end up with something a lot like Tomba! Created by the same mind that brought us Ghosts & Goblins, Tokuro Fujiwara, its fresh new approach the platform category is truly one-of-a-kind.  Players control Tomba, a wild jungle boy out to retrieve his lucky golden bracelet from demon pigs that have overrun his land. Along the way, he'll embark on a number of side adventures - and that's where the game truly shines.  That's not to say there isn't a lot of old-school platform action to be had. Tomba has a variety of moves (jump, throw, attack) and weapons (mace, wood boomerang, stone boomerang), and there are plenty of demon pigs, spiders, and other foes to use them on. In this respect, the game truly does play much like the classic 8- and 16-bit games, which inspired it: Ghosts & Goblins and Ghouls 'N Ghosts. Control is spot-on, and fans of those games will eat this one up.  Much more than your standard platformer, however, this game is all about sub-quests. At various stages in the game, Tomba is assigned tasks to complete (rescue trapped villagers, for example), and once he does, he's rewarded with Adventure Points (AP). Certain amounts of AP are needed to pass each area in the game. Here's where it becomes more of an adventure than a run-and-jump action game.  What's truly impressive is that each sub-quest is unique - you never have the same goal twice. Whether it be finding a lost item in the woods, or rescuing a stranded dog, it never gets boring or repetitive. There are also a number of hidden sub-quests, so it really pays to wander off the beaten path now and again.  Tomba!'s mix of 2D sprites and 3D backgrounds works well, and the game is packed with personality. Furthermore, character and stage design are top-notch. Fans of Fujiwara's past works will notice the visual style right off. Better yet, the game has undergone a number of visual improvements over its Japanese release; Gouraud shading on the backgrounds being the most notable.  Control has also undergone some welcome tweaking as well, becoming more responsive, and load times have been noticeably reduced. The only aspect which hasn't been changed in some way if the music, which unfortunately could have been much better.  I'm hard pressed to find any major flaws with the game. It progresses slowly at points, but it's nothing that detracts from wanting to finish the game. It's also not for everyone; hardcore platformer fans will most likely be frustrated with the need to explore rather than just rush through each scene. And if you're looking for 3D platforming satisfaction a la Crash, look somewhere else.  But overall, Tomba! is an excellent addition to the PlayStation's library, and one that the system was sorely in need of. Full of rewarding gameplay, it'll hold a special place in your collection long after other games have come and gone.  Randy Nelson", "date": "Aug 25, 1998"}