{"name": "Jane's USAF [1999]", "name_review": "Jane's USAF", "ref": "https://www.ign.com/articles/1999/11/18/janes-usaf", "text": "Imagine my consternation. I have been asked to write a review on the latest and greatest from EA's Jane's line, USAF. I've played flight sims for many years and while I enjoy World War II the most, I've spent many an hour swapping lead with everyone from the Red Baron to your future Russian Mig pilot. While it doesn't offer the ~mindless~ dogfight fix that we all crave (come on, admit it), it does deliver lots of mission types, numerous planes and the attention to detail that is synonymous with Jane's.  First things first. Jane's USAF features a very smart and clean installation. The entire presentation gives you a feel of a high-quality, professional product right out of the box and this feeling continues once you move into the game's opening sequence. This sequence shows the different aircraft available in various flight and combat situations all accompanied by stirring patriotic/war style music. Sure, the game's the important thing, but crisp and clean installation and presentation shows an attention to detail that bodes well for the overall product.  There are eight USAF aircraft to chose from and they cover the jet era from Korea to the modern day. As such you can't expect the precision of simulation found in a game that concentrates on just one aircraft but there is enough of a difference in cockpit appearance and perceived flight handling that you certainly feel as if you are flying different aircraft. The manual is a good, beefy example of what a manual should be and gives details on all of the aircraft. Each plane has information on the overall program, the variants and details on equipment, armament and avionics. The information for both the allies and enemy, along with details on helicopters, support aircraft, ground units and weapons can also be found in the Jane's Reference within the game. It all seems very complete (although I've never heard a Mig. 17 referred to as a ~Fresco~ before) but if you want to know the difference between an F-15E and an F-15C or the different types of ZSU anti-aircraft guns, then this is the place.  Fundamentally the aircraft fly well and it is hard to do anything particularly stupid in them although I certainly tried. Short of not taking into account the occasional mountain, the only things you have to worry about are flying the plane smoothly and the opposing forces. But Jane's USAF tries for as much accuracy as possible, even on the runway. Other jets are also taxiing their way to the runway and you must move at an appropriate speed so as to not run into them.  Graphically the game seems to have concentrated on the planes and the results are readily apparent. While up high in the air and battling opposing aircraft, Jane's USAF looks great. Closer to the ground there are a few problems with odd texture flickers every now and again. This happens even on my high-end machine which is a little disappointing -- especially during air to ground attacks.  But the most important thing is the planes and the developers have obviously concentrated their efforts here. However it would be nice to fly through a canyon that really looks like a canyon rather than a flat texture map with a couple of trees. Buildings and airfields, complete with runways, hangers and a tower, look very sharp. Once in the campaigns, you'll begin to notice the different terrains in the game. The lush green vegetation of Vietnam contrasts with the searing deserts of Kuwait or Las Vegas.  If you're smart, you'll let the game take you through a number of training missions. These introductory training missions reveal the standard presentation for each mission. As the mission loads there is a nice piece of relevant trivia/information (although knowing that the F-105 was nicknamed the ~thud~ didn't exactly inspire confidence in the airplane!). Just as likely to be imparted though, is a reminder of a button sequence or keyboard keystroke that controls an action relevant to the upcoming mission.  The Jane's Briefing section gives a breakdown of the mission and includes details of common mistakes such as using the wrong radar mode, forgetting to retract the landing gear or, my favorite, ~Accidental~ fire at the tanker. That's the manual's quotation marks, not mine. In fact the In-flight refueling training mission is one of the more enjoyable because your instructor warns you up front not to crash into the tanker. Right. So of course I had to go and crash into it just to see the resulting fireball. It did my overall ranking no good at all but there was a certain visceral thrill to it.  Within the overall mission briefing, the tactical map shows all the mission parameters including such things as waypoints, enemy missile batteries, structures and runways. All of these can be toggled on or off allowing a complete tactical understanding of the mission ahead. As the early training missions take place at Nellis air force base outside Las Vegas, some of the city's more famous landmarks are shown -- including the Luxor, the pyramid shaped Hotel. The buildings are also lit up nicely at night.  First you'll learn how to taxi and take off correctly under the expert eye of one Lt. Col. Scooter Davis. The voice over of Scooter Davis is done in a very even, pleasant voice that inspires confidence. He seems to be an instructor who has seen it all and takes it one step at a time. Curiously, the voice is not synchronized to the action on the screen particularly well and instead expects the rookie pilots to follow along step by step. Therefore, once you have figured out, for example, landing procedures and want to practice a quicker approach, you find that the instructor is talking about items that you have already done earlier in the flight.  Weapons School Training follows the four basic training missions and introduces air-to-air and air-to-ground combat. The myriad of Heads-Up-Displays (HUDs), radar operations and weapon management are a little involved and take some getting used to. The Reference Card lists all the different keyboard commands that are required and as the training missions only use a couple per mission, the learning curve is manageable. The night missions in the F-117 are particularly challenging, partly because of the green on blue graphic choice that makes seeing the HUD difficult.   Once through Weapons School you move on to the Red Flag training -- a series of missions where you take the side of the blue forces against the red forces. Inventive, isn't it? Playing through all of the training missions is definitely rewarded once you move onto the Single Missions and Campaigns. Here there's no friendly Scooter Davis and you are on your own to remember all of the different operations and decisions you must make to be able to complete your missions. I must admit I ended up with a cheat sheet of things I needed to remember in order to accomplish the mission.  Of particular interest in the Single Mission mode is the Osiraq Take 2 mission. In 1981 the Israeli air force bombed the Iraqi nuclear facility, causing international outrage from those that didn't understand that the two nations were still at war (They had never formally signed a peace treaty after 1948). This was, in retrospect, a smart decision as it significantly impacted Iraq's nuclear program. Imagine a Gulf War where the Iraqis had increased nuclear capability. Get the picture?  The Osiraq Take 2 scenario postulates a new USAF strike on the facility. What was so fascinating about the original Israeli strike was that the Israeli planes flew directly below an Irish airliner, therefore masking their signature to radar until they dropped down to attack the facility. I would have liked to try a similar maneuver with F-16 or F-15's, especially with Saudi markings! One of the few missed items in the game is that the mission is set in Jun 2001 yet refers to the Israeli mission of 15 years previous. But the heart of the game is in the campaigns. The historical campaigns of Vietnam and Desert Storm are augmented by a future conflict with a Nationalistic Russia and a hypothetical Blue vs. Red Campaign. Oh, how I hate those evil Blues!  In addition to the missions and campaign mode there is a Fly Now mode for pilots who just want to jump in and start blasting away at enemy aircraft. This is for the more experienced player who has either played a Jane's game before or is very familiar with modern air combat games and can, after a quick look over the reference card, jump in feeling confident that they can access the weapons they need quickly. After a number of training sessions at the Weapons School I felt comfortable enough to try this option. The set up is always the same, although the locale chosen and aircraft involved is not. It's your lot against their lot and away you go.  A rather nice feature is the Quick Mission Editor. Within seconds you can put together a quick scenario including aircraft match ups, location, time of day and weapons involved. Jane's USAF is realistic in that all of the missions that ship with the game are based on realistic objectives. Dogfights for the sake of dogfights just don't happen in real aircraft combat. And yet a straight dogfight is what a lot of us desk pilots enjoy. Along with the Fly Now feature, the Quick Mission Editor allows such dogfights to happen. Better yet the QME is very easy to use, utilizing a number of pull down tabs for very quick decision making. I had a four on four F-117 dogfight at dawn over Germany set up in under 15 seconds. A nifty Random option lets the system pick all the parameters if you prefer.  Jane's USAF features a wide range of player settings. It is with great embarrassment that I admit to taking the dweeb route and used the easy settings to practice landing and aiming. Cheats are also available -- like unlimited ammo and fuel -- and it really depends on your game play level as to whether you need them or not. I found the invulnerable setting invaluable as a reconnaissance device the first time I played a mission to get a handle on what I could expect when I played it ~for real.~ For the real sadomasochists out there I suggest the Realistic Mode against Expert Enemy AI!  All the bells and whistles that I was used to seeing (hearing?) in a flight sim are here (here?). In fact, there are a lot more bells and a lot more whistles than I usually expect. The best test of a game for a reviewer is not whether they enjoy the product momentarily-- although that certainly helps. The test is whether they intend to continue to play the product in their ~spare time,~ after the review is written. Jane's USAF is a fine product with the right amount of learning curve for me. I would have liked even more training missions, especially pure dogfights, but I suspect that is the World War II flight sim fan in me. I can see where die-hard flight sim fanatics might overlook USAF. It doesn't have the excessive detail that they enjoy but by offering something for everybody, Jane's USAF has the chance to be one of the very few flight sims that all flight sim fans pick up. This is a game I will continue to play, long after this review is done and I believe that is the true measure of this product.  -- Dean Austin", "date": "Nov 18, 1999"}