{"name": "Midway Arcade Treasures", "name_review": "Midway Arcade Treasures", "ref": "https://www.ign.com/articles/2003/11/18/midway-arcade-treasures", "text": "Old videogames never die, they just return in classic compilation packs. As gaming hardware increases in power and capabilities, the more it's possible for the programmers to actually emulate the classic gaming hardware. It's nothing new...developers have been emulating system hardware for more than a half decade or more, both as a hobby and as commercial products. Midway was probably the first company to truly capitalize on the ingenious idea of recycling its old arcade games in new packs, and the company again returns to this scene with Midway Arcade Treasures, 24 arcade games released by Williams, Midway, and Atari Games released in the 80s thrown on a disc for less than 20 bucks. The game's presentation is awful and disappointing compared to other classic compilation packs on the market (Activision Anthology has nothing to worry about), but the emulations are spot-on, and the pricetag and value alone is worth the purchase.  For Midway Arcade Treasures, the publisher recruited Digital Eclipse once again to handle the emulation of the arcade hardware and the development of the front end. The 24 arcade games span more than a decade of gaming, from Defender in 1980 to Smash TV in 1990. These games are accurate because they're the exact graphics, sound and programming code that ran in the arcade machines, emulated to run on the specific console hardware and controller.  The full list of games included in Midway Arcade Treasures, in alphabetical order: 720, Blaster, ,  Bubbles, Defender,  Defender II (Stargate), Gauntlet, Joust,  Joust 2,  Klax,  Marble Madness, Paperboy, Rampage,  Rampart, Roadblasters,  Robotron 2084,  Satan's Hollow,  Sinistar,  Smash TV,  Splat! (unreleased), Spy Hunter,  Super Sprint,  Root Beer Tapper,  Toobin', and  Vindicators.  Many of the games on the disc retain their fun and addictiveness, even to today's standards. Robotron 2084 is still a fantastically frantic 8-way shooter that has a great graphical update in the form of Smash TV released almost a decade later. Joust couldn't get any better than its original design...despite being revisited in a slightly less imaginative sequel also on the disk. Defender and its follow-up still offer that intense adrenaline rush when you get into that ~zone~, and Blaster is a little-seen 3D-esque shooter that's a real blast if you can see past the technical limitations. Since Midway purchased Atari Games (the arcade division of Atari established in 1983), there are a handful games under that brand as well. Roadblasters is much like a 3D version of Spy Hunter, also included on the disk.   Just because they're considered ~classic~ doesn't automatically make them ~good~ in emulation form Splat for example, is an unreleased Bally arcade game included on the disk, and when you see it in action, you'll know why you never saw it in your local arcade. Gauntlet was great action game in the arcade, but it just doesn't work all that well on the console since players have the ~quarter~ button freely available on the controls to buy in as much health as they want...making the game incredibly boring as a result.  Many of these arcade games actually utilized specialized controllers that the analog sticks of the console versions just can't simulate. Yes, Robotron and Smash TV are wonderfully representated with the dual sticks, and Sinistar's 49-way control is brilliantly represented in analog form. But some games on the compilation didn't even use the traditional joystick. Marble Madness, for example, used a set of trackballs for the two player game. Super Sprint featured a weighted steering wheel that players whipped and caught to send their cars turning around on the screen. Rampart, an awesome arcade design using a trackball, is near frustrating to play on both the console's digital pad and analog stick. Digital Eclipse did as good a job as possible considering the controller limitations, even offering a way to alter the button layout to customize play...but why can't I assign the right analog stick as the ~tap~ function in Root Beer Tapper? That would have definitely simulated the arcade design much more accurately.    As great as every one of these old arcade games run on the new systems, there are some really odd quirks left over in the conversion. In Rampage, for example, players are forced to play as George the gorilla in a single-player game, regardless of which controller they use. This control oddity carries over to other games as well; Smash TV always puts single player games in control of the blue player (the red player is the second player position, but the arcade let either side be chosen by the single player). The PS2 version did not have this problem; it treated the controllers as separate and specific players. But overall the game runs better on the Xbox than its PlayStation 2 counterpart thanks to faster loadtimes and a perfect emulation of Smash TV. And there's also a very subtle Xbox Live-enabled feature where you can rank your best high scores against other Xbox players...another neat addition.  The strange little quirky gaming elements are just nitpicks compared to the overall presentation of Midway Arcade Treasures. After being wowed by Activision, Barking Lizard, and Contraband with the outstanding Activision Anthology last year on the PlayStation 2, it's a real disappointment that all Midway felt to offer was a basic (and sloppy) DVD movie-style interface for its compilation, as well as basic, boring, and recycled ~extras~ in the form of heavily compressed video interviews that were already included in past Midway compilation packs. The menus for game selection have been laid out in cryptic ~hieroglyphs~ that fail to show the game's title apart from the small, looping video that pops up in the middle of the screen after hovering the cursor over the symbol. The games are also arranged not chronologically, but in alphabetical order, making the menu layout feel incredibly sloppy.  The ~extras~ for the games, what little there are of them, are actually more hidden than they should be. To view these players need to hit a different button than the main ~play this game~ one, and once in this menu there's no guarantee that there's anything worthwhile to watch. Menus are horribly laid out and constructed, with awful choices of fonts used for the text.   The ~gold~ of Midway Arcade Classic's presentation is, of course, the video interviews with the people responsible for the specific games. But most, if not all, of these extremely compressed video interviews were included in past Midway compilations on the PC and Dreamcast, and only about half the games on the disc actually have retrospective video attached to them. Not a single one of them informs the viewer ahead of time A) who they are beyond their name (what they were responsible for would have been key), or B) when these interviews took place...in one Smash TV interview, Mark Turmell talks about really looking into doing a new Smash TV for the arcade, but the viewer has absolutely no knowledge of what year this interview happened. And considering that Midway's now officially out of the arcade business, offering the little detail of ~year recorded~ could eliminate a bit of confusion.   Midway Arcade Treasure's ~bang for your buck~ comes from the sheer amount of games on the disk, and how perfect they're represented on the console. Apart from the difference in controls, these games are essentially what gamers played in arcade when the games were released in the 80s. Don't go expecting anything more than the games, however, as it was the emulation portion that received most of the attention; the developer didn't put much focus in giving players anything more than the basic retrogaming experience.", "date": "Nov 18, 2003"}