{"name": "Go! Go! Hypergrind", "name_review": "Go! Go! Hypergrind", "ref": "https://www.ign.com/articles/2003/11/18/go-go-hypergrind", "text": "Neversoft probably had no idea that they'd unleash extreme sports frenzy upon the gaming world with Tony Hawk's Pro Skater. THPS, with its easy to grasp play mechanics and addictive gameplay, practically created a genre -- which now is home to numerous copy cats including games based on skateboarding, snowboarding, BMX, motocross, wakeboarding, mountain biking, inline skating, and almost every other ~extreme~ sport on this planet. The popularity of THPS has spawned three sequels and even made famous stars like Solid Snake, the Disney crew, and the Simpsons want a piece of the half pipe.   With a ~genre~ so cluttered with sequels and imitators, there really isn't room for a new kid on the block -- unless you can do something revolutionary. While Neversoft has nailed skate mechanics, there's always room for creativity -- which is where Atlus' and Spumco's collaboration, Go! Go! Hypergrind, busts into the park. However, does this zany cartoon skater have the substance to match its style?   The Facts  Skate as one of twelve SPUMCO designed skaters  Use the negative reaction system to link together tricks for more points  Cel-shaded graphics designed by SPUMCO  Includes 60 special moves and a slew of aerials, grinds, and lip stalls  8 movie set themed skate parks  Numerous multiplayer modes   Gameplay  With just one look at Go! Go! Hypergrind, you'll realize that this isn't your typical skater. The obvious reason is because it's cel-shaded, but if you play the game you'll learn that this game rewards you for decapitating your skater, getting flattened by large swinging breasts, and chewed up and flushed out of a hippopotamus. Bizarre is a mild description.     The reason for all this craziness is that traditional cel-animation is being replaced by computer generated graphics. In the hopes of counteracting CGI, the Toon World (a cartoon world that secretly creates many animations) has entrusted its future to SPUMCO -- the creators of Ren & Stimpy and The Ripping Friends. SPUMCO hopes to create an action packed cartoon that features extreme skateboarding. Your goal is to be the lucky skater that lands the lead role in Go! Go! Hypergrind. To do that, you'll have to prove you have more skills than the competition.   You're up against a motley cast of characters. There's a punk wolf, overweight pig, ritzy pharaoh, sexy feline, mummy, samurai tiger, and six other SPUMCO designs. Each has their own line of special moves that are a bit different from those you'll see in THPS. You can see anything from a monkey getting hit repeatedly in the private areas, a robot overheating, the pharaoh throwing cash around, a mummy riding a broom stick, or cat lounging around in a lawn chair and a wolf playing an electric guitar or a tiger practicing swordplay.   Unfortunately, even with these insane moves, your skills on a skateboard feel rather limited. Sure, you've got special moves and a slew of grinds, lip stalls, grabs, and manual tricks, but trick system seems so shallow. This could be blamed on the missing kick flip, but it can also be attributed to the delayed feeling of your controls. Linking tricks together with reverts and manuals is a trying experience because the timing is far too finicky. The controls at times just seem unresponsive, which isn't something you want in a skateboarding title. The other culprit that sucked the depth from this skater is the negative reaction appeal system -- which could be considered the main draw of Go! Go! Hypergrind (besides for the SPUMCO association).    A negative appeal occurs whenever you crunch, pinch, puncture, flatten, paint, set on fire, blow up, cover in poo, feed to a cartoon-eating plant, or decapitate your character (that's about half  of what these twisted minds have thought up). Several negative reactions can be chained together as long as you hit X when it flashes on the screen (otherwise you will get hurt and lose the points for that trick). So, if you light your character on fire, you can then blow him up by igniting TNT, bombs, or gasoline. These linked appeals (they don't have to be the kind that feeds off the previous one) keep your negative appeal meter filled -- which will continue linking together every trick you've performed until it runs out and multiplying it for combo points.     While the first couple times you're decapitated by spinning saws or flattened by a steamroller are pretty cool, once the novelty has worn off the negative appeals get all too tiresome (and make the game way too easy). Your points keep accumulating, even after the time runs out, as long as you're still working on a linked trick. If you can keep hitting appeals, you can continue skating indefinitely. This definitely gives you the competition annihilating upper hand during some challenges.   Instead of requiring players to hit gaps, collect letters, reach a certain max score, or complete various tricks, auditioners will have to do beat their competition in numerous challenges each round. There are five ranked matches -- which give you points for holding a various score. The points you earn by placing highly in the various modes are tallied for a final round score. Whoever is in last place gets bumped out of the audition.   Appeal Champ is like taking part in a skating tournament -- you want to score the highest score possible. This isn't too hard, especially since you rarely have to perform actual skate tricks (you can bounce from negative appeal to negative appeal). One Link Appeal is like Appeal Champ, except that your score is determined from a single run of linked tricks (best score out of two runs). Again, as long as you time your appeals correctly it's almost impossible to lose. However, once you get past the score as many points as you can challenges, things get a little harder.     Race pits you against another auditioner in a battle to see who can find three stars the fastest and return to the goal. Stars are found by completing various appeals (which also afflict status disorders on you and your opponents). The main problem is that the computer always seems to afflict you with the most debilitating status disorders -- the balance feels off. Battle Mode equips you with weapons based on whichever negative appeal you've activated. Simple use that weapon to ~kill~ your opponent. This again is flawed because you aim with the C-stick (which if you're moving and aiming can be disorienting -- but even with a steady rate of fire the CPU can dodge everything, while his attacks seem to home in on you. Mini-Game mode orders you to smash as many pumpkins, get caught on fire, or hop on more turtles than your opponents. These can be hit or miss depending on task. Simon Says round is to perform as many of the indicated negative appeals as possible. The correct appeal flashes at the bottom of the screen -- and it's your job to find it. An arrow will point you in the correct direction, but not necessarily how you have to get there. This leads to a lot of frustration because usually the first appeal is the hardest one to find -- but it also gives you reasons to learn the levels.   Levels are colorful, diverse, and full of great lines. Their themes stem from movie sets like those for a toon town, jungle, haunted house, fantasy land, factory, and a western. There is always something bizarre to be found in each level, whether it's being flattened by giant swinging breasts or shot into a volcano, but the size and layout of levels can make finding your way around difficult -- especially when you're trying to find a certain negative appeal or have to get to a goal but were thrown to the opposite corner of the map.    Multiplayer borrows most of the modes found in the single player game, but lets you play against another human controlled player. As well as Appeal Champ, Race, Simon Says, and Battle Mode, there's also a push mode which is where you try to squeeze your opponent off the screen. Each time you perform a trick or negative appeal, the bar that splits the screen is pushed towards the opposing players screen. Multiplayer can be fairly fun if you're playing with someone else who likes Go! Go! Hypergrind, but it isn't entertaining enough to anything more than a quick diversion.   Graphics  If you like SPUMCO's art, the people behind Ren & Stimpy and The Ripping Friends, then you're in for a graphical treat. All the art found in Go! Go! is produced by SPUMCO, which gives the game a rather unique style. You'll rarely find such colorful and hazard filled skate parks -- or overweight pigs in bikinis doing aerial maneuvers on skateboards. For what are apparently rather simple character designs -- there's no complex texture work or shadowing other than the black outlines, there's a lot of little details. Although solid color, Decker (the wolf character) gives off a very furry feel. Bob, the Pharaoh, is decked out in several gold chains. Sally the Mummy's wrappings gently flap in the wind.   The animation matches the care given to the character designs. Transitions between negative appeals and normal status are relatively flawless (although they occasionally use pre-rendered shots for certain negative reactions). It's too bad it runs at 30 frames per second.   The cut scenes, which depict the general concept of Go! Go! and the stories of the individual skaters, seem rather hastily constructed. There isn't any form of facial animation -- talking consists of heads bobbing up and down. Movement in general seems rather static. Whether this style was intentional or not, it looks very odd and breaks up the flow of the game.   Load times are far too long and frequent. To combat the snooze inducing load times, Atlus has included a small mini game where you score points for jumping on a target. However, this gets old quickly and it makes your waits feel longer.   Sound  Sound is not one of Hypergrind's best attributes. The soundtrack is a very light punk rock track that fits with the skating. However, after hearing it recycled the first or second time, it gets wicked annoying. There isn't enough diversity in the tracks or the overall sound of the music -- which certainly doesn't enhance your gameplay experience. More variety would have helped out the aesthetics.   Sound effects also fall into the generic and recycled category. You hear the grunts of falls, various clangs and bangs when you trigger a negative reaction, and the occasional grating sound of grinds.     Voice acting is pretty bad. It's not delivered with conviction and the dialogue is cheesy and flat -- although that might have been the style. It's too bad that Go! Go! introduced a storyline but didn't put a lot of effort into it.   Go! Go! Hypergrind defines the phrase ~too much style, not enough substance.~ While I want to applaud them for doing something different with the extreme sports genre none of their ideas were executed properly. More attention needed to be paid to the skating mechanics and less to the gimmicks so that there'd at least be a solid base for the wacky gameplay instead of quicksand. I can't deny that Go! Go! looks amazing in all its cel-shaded glory. However, the other gimmick, negative appeals, severely cripples Hypergrind because it makes the game far too easy. With all the appeals, it feels like you're playing a game that simply demands you to constantly hit X instead of a skating game, but without the negative appeals, you find nothing but a shallow shell.  Somewhere amidst the effort to keep Go! Go! from being just another skater, it lost that addictive quality that makes the genre so popular (it's a bad sign when you aren't required to actual perform tricks). Even with the snazzy special moves, the tricks system is neither deep nor responsive. Combine that with the repetitive nature of the challenges and you'll find you're left with something that just isn't all that fun to play. Worthy of a rental, if only to enjoy the artwork and interesting take on the genre, Hypergrind will leave you with a very so-so experience.", "date": "Nov 18, 2003"}