{"name": "Mario & Luigi: Superstar Saga", "name_review": "Mario & Luigi: Superstar Saga", "ref": "https://www.ign.com/articles/2003/11/18/mario-luigi-superstar-saga-2", "text": "Back in 2001, Nintendo and Intelligent Systems created the unofficial follow-up to the SNES Super Mario RPG title in the form of Paper Mario, a wonderful and extensive Mario adventure for the Nintendo 64. For the holiday 2003, Nintendo and Alphadream (the development team behind the quirky Japanese Tomato Adventure) have worked together to create Mario & Luigi: Superstar Saga the unofficial follow-up to Paper Mario. Mario & Luigi is an excellent adventure with as much focus on RPG elements as Paper Mario had on the Game Boy Advance. It's  an incredibly weird and original gaming experience that never takes itself seriously, and it's something that definitely shouldn't be missed on the handheld. Features Control two characters at once. Thirty hours of adventuring Cartridge save (three slots) Rumble support on Game Boy Player Includes Mario Bros. single and multiplayer, compatible with Super Mario Advance titles. Mario & Luigi: Superstar Saga opens with players set off to solve the mystery of Princess Peach's stolen voice. See, as the story goes, a mysterious guest pays Peach a visit...sucking up her voice into a device and replacing it with an explosive (literally) vocabulary. With her vocal chords causing destruction, Bowser cannot rightfully kidnap her or she'll completely wreck his castle. So, in an act of desperation, he recruits the help of Mario and the reluctant hero Luigi to assist in getting her voice back.  Players actually control Mario and Luigi in tandem for about 90 percent of the adventure. Moving one around the map will cause the other to follow, and without one, the other won't move. Each of the two start out with the basics (a simple jump), but eventually their abilities will evolve to accommodate character-specific moves like Luigi's Super Jump to get both characters up higher ledges or Mario's Helicopter Spin to propel across short gaps. A hammer comes into play which adds to the techniques; hitting Mario on the head will make him short enough to get through small openings. Pounding Luigi will drive him into the ground for some subterranean exploration. There are plenty of other techniques in Mario & Luigi which will unlock locations throughout the extensive adventure, but we won't ruin the surprises. Discovery is half the fun in this awesome adventure. The plot of Princess Peach's stolen voice only starts off the action; it's actually resolved in the early part of the game. But don't think this game's short, because there's a good 30 hours of solid and satisfying adventuring in Mario & Luigi.  Granted, much of that time is spent in the combat system, but unlike most Japanese RPGs Mario & Luigi's turn-based battle involves the player at all times that never drags on longer than it should.  Mario & Luigi definitely shares a lot of elements from the N64 Paper Mario title, mostly in its combat system...but it expands on the design to incorporate the two Mario Bros. into the action. Attacks are handled one character at a time, with Mario and Luigi on the one side, attacking enemies on the other. Mario and Luigi can attack by themselves using their standard jump, or later a hammer or their special abilities, and these attacks are enhanced if the player hits the proper attack button at just the right moment. Or, players can spend what's known as ~Brother Points,~ and perform special attacks that put both Mario and Luigi in the action. These attacks are very powerful...but only if the player times button presses at the proper time; players can adjust the power of these attacks by upping the level, but at the highest level the game won't give on-screen indicators of which buttons should be hit and when. And if the player misses the cue, it's a failed attack. If a Mario falls in battle, the other Mario must protect him (or give up a 1-up power-up. Defense is handled the same way; each enemy has an attack that's entirely possible to avoid or counter...but you have to have a keen eye for the pattern.  The other element that places Mario & Luigi in the RPG category is through levelling up the two plumbers. Each battle awards Mario and Luigi experience points that accumulate and, at specific points in the game, cause each of the plumbers to ~level up,~ increasing attack, defense, speed, brother abilities, and other elements...including the ~Stashe~ ability that increases the chance for ~Lucky~ hits for super damage. After each ~Level Up,~ the player can choose one element to increase through a random generator, adding a little bit of custom play to the adventure. I was going to complain about the fact that both Mario and Luigi earn exactly the same amount of experience points in battle no matter how much they were involved, but elements deeper in the game will definitely cause both Mario and Luigi to have distinctly different experience points. Like, if a Mario falls in battle, but the other Mario finishes...he's the one that gets all the experience points. There are plenty more situations, but that's for the player to discover...    And even though the battling system is very RPGish, like Paper Mario there are no random battles in Mario & Luigi. Thank god! All enemies are visible on the wandering phase, and if either of the plumbers collide with one, that's when the game boots to the battle mode. But players can use this to their advantage...by hitting these enemies before a battle, Mario and Luigi will have the upperhand during a fight by either stunning the bad guys or giving them damage. Or avoiding them altogether if these creatures offer too little experience points to matter.   The game requires control over both Mario and Luigi almost the entire adventure, and it's because of this element that the controls seem somewhat awkward than the normal fare. They do their job, absolutely, but there are plenty of situations where your fingers will fumble around trying to select the right character or the proper technique to get through a specific challenge, and failing said challenges is more due to the slightly clumsy control over the characters on the four action buttons. Even after fifteen or twenty hours of adventuring with this control scheme you may still find situations where your fingers are slipping around the system choosing the wrong menu selection...it's a difficult control scheme for the mind to grasp.  And as great as the game looks on the handheld, the choice in viewpoint is just a little questionable. The slightly overhead, angled perspective does wreak a little havoc on the eyes when it comes to portraying where paths are located. Hittable question blocks are well represented with shadows underneath, but the same can't be said for other areas where it's tough to determine if a pathway is going behind a foreground object, or stopping altogether. On the Nintendo 64 this wasn't a problem because the entire screen moved in perspective with the screen scrolling...but the GBA is simply moving around a giant background for its environments.  But this game will definitely appeal to the Mario fan in all of us. Mario & Luigi is a wonderfully Mario game with references all across the board...even knowledge of Dr. Mario plays an important part in some of the gameplay. Luigi's Mansion references come into play early in the game, revealing another level of gameplay in the form of a ~bean quest~ that will reward players with extra clothes and badges, both of which increase the two plumbers' abilities during the frequent battle. The developers even throw in some challenges and puzzles that are very similar to what's involved in a Super Mario Bros. platformer. It's not a true, original Super Mario Bros. game for the GBA, but Mario & Luigi shouldn't be dismissed by fans of the plumbers simply because it's labeled as an RPG.   Paper Mario was a great adventure on the Nintendo 64, and Mario & Luigi: Superstar Saga is an excellent adventure on the Game Boy Advance. The GBA game's an entirely original adventure that shares elements from the past RPG, and definitely does a lot to satisfy that itch many gamers have of wanting an original Mario platformer on the handheld. We're happy to get something Mario related that's not only incredibly fun to play, it's entirely the GBA's own property and opens the door for more in a potential series", "date": "Nov 18, 2003"}