{"name": "I-Ninja", "name_review": "I-Ninja", "ref": "https://www.ign.com/articles/2003/11/19/i-ninja", "text": "Just two years ago, Namco was the kind of company you could totally predict. It brought gamers three kinds of games, racing (Ridge Racer), fighting (Tekken and Soul Blade) and arcade flight games (Ace Combat) -- with rare sprinklings of Klonoa and Tales of Destiny thrown in for good measure. If you had taken a two-year sabbatical and returned to look at Namco's lineup this year, you might find yourself a little shocked.    I-Ninja is the perfect example. A super-deformed little ninja with lots of funny one-liners and attitude, I-Ninja is an original action-platformer for all three consoles, PlayStation 2, GameCube and Xbox. Gleaning game aspects from Super Mario 64 and delivering character design reminiscent of Bomberman as well as simply stealing all sorts of funny anime robot battles and mid-air hover battles, I-Ninja is working blend of Japanese sensibilities with a caffeinated Western wackiness. It's classic platform fun packed with tons of mini-games, explorable 3D worlds and unrealistically giant robot bosses.   Gameplay  Take the idea of a ninja -- quiet, sleek and poised at all times. His senses are alert, he's always ready to slip into the shadows, and he's resourceful. Now add in a double cappuccino and a who-gives-a-damn attitude and watch the fireworks begin. Everything about the traditional ninja myth is exploded here and all with a great sense of humor. Once you start playing the little ninja, whose name is Ninja, you'll just go with the flow too. The little firecracker has a solid set of moves, from single attacks to combos, uppercuts designed for juggles, and vertical chops that split his enemies in twain. Power up his rage meter and watch the enemy scum fly into chunks across the screen.    He can double jump, swim, and use rails to slide on (in what seems like the standard incorporation of a Tony Hawk-style skating), and he can use rings to swing from platform to platform. He can even run sideways along walls (a la Shinobi and Prince of Persia), or run straight up them. In short, the game is designed to enable players to use a solid amount of combat, perform a healthy amount of platforming, and it delivers a generous dose of unique-to-the title mini-games to keep things fresh.      The story is quite silly, but it's so comical it puts a smile on your face. In the beginning we see Ninja sneaking his way past four guards in a secret mountaintop location. He then frees his ~Sensei,~ slays a dragon, and is rash enough to put his hands on a gleaming purple energy mode (a ~Rage Stone~) coughed up by the dying lizard. The energy of the Rage Stone courses through his veins causing him to rocket through the sky and into his master. Ninja then proceeds to decapitate the old Japanese guide. It's comically presented and the old man just turns into a ghost and continues to advise Ninja to acquire all of the power crystals throughout the course of the game. With this simple story premise, the gameplay is laid plain for all to see, the collectibles are there for the grabbing, and I-Ninja seems like every other action-platformer.    To a certain extent, that's true. Players begin their quest at Robot Beach, the hub stage from which Ninja must complete five different worlds. Each world (Bomb Bay, Jungle Falls, Mountain Gorge and Moon Base) offers a smattering of courses inside it, usually about four to five, with a boss battle and the opportunity to use Ninja's cash to buy the chance to earn more stuff. The new missions open up in order, but if you play the mini-games to earn newer belts, you can open them up out of order, giving players that sense of open, go-anywhere control.    The reward and currency systems are clever. Ninja earns colored belts as he beats each new level. (We know, a ninja earning Karate belts? Wha??!!!) He progresses from white to yellow to green and finally he reaches black belt. Each time he earns a new belt he simultaneously opens up a new world too. And by doing so he upgrades in strength and power. Each level can be replayed at any time for the completist in you, also giving players the chance to earn more cash and bonuses.     While the blend of these gameplay elements is all too familiar, what keeps us hooked on I-Ninja is multi-fold. Ninja constantly quips with his master, and tells his enemies to bring it on with a sense of impatience and certainty. He's got this little sneer that's hard to take seriously, but the combination of smallness, toughness and quirkiness is a strangely perfect blend.    If the droll wisecracking Ninja doesn't attract your attention, then certainly the surfeit of Zelda-like mini-games will. Ninja races against time to get through levels, uses cannons to blast ships and hang gliders out the water, and boxes a giant robot. Again, any of these levels or mini-games can be played a second time for higher scores. And all of the mini-games are fun. All of them. In fact, if I-Ninja has a major strength, it's that the level of comic irony and arcade sensibilities are consistent throughout the game's entirety. There is just a ton of little things that make this game unique: Ninja can run up half-pipes, he can meld into a giant ball, which then becomes a mechanism for Marble Madness gameplay and bowling, and more, and he's constantly upgrading with throwable ninja stars and poison darts.    The game runs nearly identically on all three systems. It's simplistically textured, and the size of the levels isn't so big that it pushes any major constraints. Though if offers a solid amount of lasting appeal with re-playable levels and bonuses, the core game is pretty short. For gamers who know their stuff, it can be beaten in about eight to 10 hours easy.    Graphics  What's impressive in I-Ninja are its simple but adorable character designs, zippy framerate, healthy set of physics and great animations. The games look nearly identical on all three systems, with the GameCube and Xbox showing slightly sharper textures, colors and better lighting. But to be honest, the differences are so slight that none of the versions will disappoint.    The texture work of all three games is not meant to blow gamers away. Instead, the distinct super-deformed character design is what catches your eye. The bosses are classic parodies taken from traditional gaming lore, anime, and the like, and range from vicious robotic fish and boxing robots to space knights who battle in intergalactic space duels reminiscent of Dragon Ball Z. The influence of Don Bluth and Gary Goldman are at their best here. Their sense of story telling is kept in check, giving I-Ninja that quirky, colorful personality in design and delivery.   Each of the worlds offers its unique spin on the traditional platform levels, be it the dangerous space levels, lush jungles, rich with waterfalls foliage and green, green, green stuff. Even the mountainside villages of Bomb Bay are pretty. The good use of high contrast and primary colors is very catchy, very pretty. All versions support wide screen capabilities.      Sound  Having graduated from the 16-bit age of simplistic hyper beats and unending synthoid music, the good folks from Namco and Argonaut have reprised the sounds of that time period but have infused the nostalgic tunes with a slightly less frantic set of beats. Instead, these generic, catchy tunes sound like the rhythm sections from good '80s dance bands. A little more tolerable, a little less intense, but still listenable. They beep and bonk, they remain constant, and they keep the happy frenetic pace up.    It's the voices that grab your attention. In the very first set of cutscenes, after Sensei dies and returns as a ghost he tells Ninja what to do. Ninja's response is that of a smart-aleck 14-year old kid. ~Even after he's dead, he's telling me what to do.~ Ninja always responds in some smartass way. Whether it's by saying to Sensei ~Yeah, whatever,~ or to enemies ~You want some of this???!!!~ The lines are no doubt already used, but the magic is all in the delivery. Ninja is cute looking yet fiercely belligerent. He sounds like a little kid acting like an adult. Whichever way you slice it up, the charm is on. And as part of the team's solid effort to remain consistent on all three systems, Argonaut's game supports Dolby Pro Logic II and Dolby Digital on Xbox.If you want a solid little game to give your kids or platform friends this year, I-Ninja is an unquestionably good gift. As far as games go, this one doesn't delivery a design that's terribly different than a slew of platformers you've already played. It's a collectathon that's reminiscent of several popular platformers from the past, including Super Mario 64. But if you're going to copy something, thats the best one to copy. Nonetheless, I-Ninja packs so much personality and attitude into its formulaic design that its charm and personality lift it above the fray of me-too titles. And if the main staples of action-platforming bore you, the mini-games, bosses and the like will keep you playing. This game looks and feels like a playable Saturday morning TV show. It's quick and responsive, maintains a solid framerate and almost always keeps the camera angles in the right positions. It supports widescreen TVs screens and Dolby Pro Logic II for all systems.", "date": "Nov 19, 2003"}