{"name": "NHL Rivals 2004", "name_review": "NHL Rivals 2004", "ref": "https://www.ign.com/articles/2003/11/20/nhl-rivals-2004", "text": "is Microsoft Game Studios' first venture into hockey and represents the second first-party sports game to debut in 2003. Unfortunately Rivals 2004 does for ~The Fastest Game on Ice~ what Inside Pitch did for pro baseball. At least NHL Rivals was good enough to get an endorsement from the National Hockey League. The hockey in Rivals is very mediocre; the equivalent of a real-life hockey franchise that's just happy to be in the league and not intent on pursing championship glory.  Even with online play over Xbox Live, Rivals is out-played and out-featured by the well-tuned ESPN NHL Hockey from the company formerly known as Visual Concepts. Like NFL Fever before it the inclusion of XSN Sports functionality just doesn't help when the basic game itself doesn't inspire you to play more than a few games.   Gameplay  Rivals 2004 has adapted most of the control, gameplay and display conventions of other well-established hockey franchises like ESPN NHL Hockey (formerly known as the NHL 2K series) and EA's NHL series. The problem is that it plays like a knock-off of those two franchises and doesn't go the extra distance to include the best elements of each. Instead you can pass, shoot and check in Rivals, just like you can in every other game, but there's nothing special about pulling those moves in the Microsoft game. Even Midway's Hitz series hit us with an overdose of speed to keep things interesting. NHL Rivals 2004 doesn't play fast enough to be arcadey or demand enough skillful play from the user to compete with the simulation hockey games. You could say the game is trying to split the difference between arcade and simulation but it has none of the most appealing aspects of either school of sports videogame.  There are a few problems with control in this game. The biggest problem we had was with the face-off selection system. When the official is about to drop the puck you're given a little setup scene where you have the option of hitting A to try to win the puck cleanly, hitting B to tie up the other player's stick and X to body block the opponent. We love a game of paper-rock-scissors as much as the next NHL fan but that's not what we want out of our hockey videogames. Success in whatever move you try to pull seems random instead of being based on any kind of player stats or ability.   We're coming into Xbox's third Christmas, yet Rivals has no create-a-deke feature like we see in both EA's hockey title and ESPN NHL Hockey. It didn't have to be on the right analog stick but something that required some skill during the thrill of a breakaway would've been nice. Instead, merely timing the tap of the deke button (B) whilst skating as fast possible will give you the best chance to score on your wrist shot. Leaning the stick and tapping B will yield different types of dekes but the four or five you have don't seem to make any difference. There's no finely tuned control or animation where you set up the defender by leaning and holding the puck to one side only to quickly slip to the other side to setup a shot of your choosing. It all seems rather automatic where you just have to hit deke and then shoot while you're in the slot and the game will determine your success rate based on player attributes. Your role is minimized compared to the right analog puck controls in both NHL 2004 and ESPN NHL Hockey.    Just like the Fever franchise, NHL Rivals seems to mimic the appearance of great hockey by giving you some highlight worth moments but it doesn't demand any skill from the user to create it. In case you're wondering, the right analog stick is used for quick passing and player switching while on defense.  On the positive side, Rivals does let you deliver some nice checks and crushing hits that will rumble the controller in your hand with authority. The power of a player's slapshot is determined by his momentum and positioning on the ice. If he's skating away from the net and gets the puck on his backhand, he's going to have a tough time putting a shot on goal with any kind of power on a one timer. This ties directly into the underutilized pivot system that allows you to change the direction your player is facing without changing his momentum by squeezing the left trigger and leaning the left analog stick. This works very well on defense and on open ice without the puck so that you can always quickly swivel and face the man with puck to deliver a crushing check. It seems like something that could've been adapted for offensive use and been applied as a type of  freestyle control where your momentum and aiming are independently controlled. The truth is you can use it offensively while on a break, but the effect is inadvertent and unrealistic. Your puck-carrier will pivot around and protect the puck with is body while still skating towards the opponent's goal. Effective, but it doesn't happen often enough in the NHL to convince us that this move was intentional.       Online play doesn't change the way the game plays, just how you can play it. You can control all sorts of game options like goalie skill and speed of the game. You can only allow up to six Xboxes and/or ten players to connect to an unranked (one time NHL match) game. This is great if you've got buddies that want to play on one Xbox against online competitors out there in the world. Ranked games can obviously only be played head to head against another Xbox Live players since the results will count towards your ranking. Pickup games are quick contests that allow you to play on non-NHL ice like local munis and ponds but only six players can hop in a game. Microsoft sports games usually do a good job of getting the most online gametypes with least amount of effort and NHL Rivals fits that description as well. Still even with the games you can play online and XSN Sports compatibility where you can set up and run your own custom tournaments with your buddies, the style of hockey gameplay in Rivals left us flat.  Graphics  All hockey and soccer games have the built-in advantage of using wide camera angles that show off all the action yet hide any ugly warts that might appear when you get up close. Rivals 2004 isn't ugly and wart-ridden when you get up close in cutscenes and fighting. The players look decent enough up close and on par with offerings from Sega and EA, but even as a debut product we expected Rivals to look head and shoulders better than the competition.   The animation routines look unrealistic because players will speed through their routines and then suddenly slow down at random points. We're not talking about quickly skating to a spot and then stopping to execute on a move or particular play. They snap from one animation routine to another without enough transitional frames, giving them a herky jerky look that really jars the whole experience. A player can appear to be having a fit on the ice when there's a loose puck and lots of skaters are around scrapping for it.   The faces and the uniforms and little details are all adequate but there's nothing ultra-realistic like shadows and real-time lighting effects.  Audio  The announcers get behind far too often and don't have anything particularly insightful to say. The crowd noises are well done and their reactions to events on the ice bring a lot to the game. Big shots, hits and close plays will get them out of their seats and cheering appropriately.    The sound effects are adequate with the clickety sounds of puck hitting stick and players hitting boards. The controller rumble and bass notes that accompany big checks and crushing hits against the boards are well synched and really make you feel the play.   The surround sound is decent since you're playing above the ice on the default camera perspective, which is the only way to play a hockey game.  NHL Rivals is bringing up the rear in the hockey videogame derby. There's not one thing it does better than any of its competitors. It's strongest features like the pivot mode and shot physics are basic elements of NHL 2004 and ESPN NHL Hockey. The Sega game has a stronger online component because its core gameplay is stronger. EA's hockey title took a stand and went all out for realism even if not every fan could grab hold of it. If Rivals' greatest innovation is right analog passing then you know we're not talking about a revolutionary title. Chalk up another MS sports game that's just content to be on store shelves. There's a ~2004~ hanging off the end of NHL Rivals which means there may be more to come. Good thing there's plenty of room for improvement.", "date": "Nov 20, 2003"}