{"name": "Medal of Honor: Infiltrator", "name_review": "Medal of Honor Infiltrator", "ref": "https://www.ign.com/articles/2003/11/21/medal-of-honor-infiltrator", "text": "The Medal of Honor brand was somewhat tarnished when Destination Software released the absolutely awful Game Boy Advance port of Medal of Honor Underground last year. There were many lessons to be learned from the project; along with ~GBA isn't the best system for first-person shooters,~ Electronic Arts obviously went with ~If you're going to do it right, you gotta do it yourself~ as its credo. This year to coincide with the release of the console Medal of Honor: Rising Sun, EA produced its own GBA take on the series with Medal of Honor: Infiltrator, and the final product is a game well on the other end of the quality spectrum from last year's dud. Infiltrator is an excellent revisit to old-school action gaming, with tweaks added to the style to make it feel like a contemporary game design. Features Five missions Fifteen levels Cartridge save (three slots) Link cable support for two players (multiple cartridge) Connectivity with GameCube version of Medal of Honor: Rising Sun  Last year's Medal of Honor: Frontline on the consoles dropped players in European WWII situations, and this year's Rising Sun puts players in Japanese wartime missions. For Medal of Honor: Infiltrator the game pulls from other World War II missions that put the Allies in Northern Africa, driving the Axis push back up into Europe. Medal of Honor: Infiltrator is not a first-person shooter. There are first-person elements during one or two levels in each of the five different missions, but the core of the game takes place in top-down action that's reminiscent of classic arcade games like Commando or Front Line. It's a perfect perspective for the Game Boy Advance to handle, and the development team at Netherock, a newly created development studio formed from members of the defunct HotGen team, created an outstanding series of levels to put the GBA's 2D hardware to great use.  For about 80 percent of the game players will run through enemy territory in this top-down scrolling perspective, using limited weaponry to take out the Axis threat that will pop out of nearly every corner of the desert-based locations. The soldier has a main weapon and an explosive weapon in hand that can only be swapped out for other weapon combinations in bunkers scattered throughout the battlefield. If you want to carry around the maximum amount of grenades, you'll have to use the standard issue Thompson SMG. If you want to upgrade to a better, longer range Automatic Rifle, you'll have to make due with half as many grenades. Dynamite charges are extremely handy, but they're paired up with the single shot M1 Garande. And if you want serious destructive firepower in the form of a Bazooka, you're stuck with a peashooter-style Colt 45. These weapons can be reloaded with icons scattered over the level or dropped by enemy soldiers...they're even inside some buildings, but in later levels enemies will wait to ambush you since the contents of a habitat are hidden from view until it's entered in a neat ~cutaway~ effect.  These overhead action levels are split up into two designs: balls-out action, and tactical ~sneak around.~ The former is extremely energetic and satisfying thanks to the sheer amount of enemies sitting around to be gunned down. But the level of difficulty is actually on the high side since they can seriously do damage to your soldier in a sneaky ambush while you're trying to reload your weapon. Strafing is your friend, so learn how to move through the levels with your gun facing the action. The tactical designs aren't quite Metal Gear Solid, but they do require a change in strategy if you want to get through them unscathed. Alert the enemy by getting within sight, or letting off gunfire, and you'll have to deal with reinforcements that'll deplete your precious ammo. Sneaking up behind them and bumping them on the noggin is the thing to do here. Of course, in both styles of missions, you'll be able to hop in a great big tank or grab hold of a turret gun and do some real damage. It's good fun, in a tragic, wartime kind of way.  The leftover missions are based around Frontline and Rising Sun's turret-style objectives. In these, players simply gun down enemies from a first-person perspective that looks very similar to the classic arcade game Operation Wolf. These timed missions have only one requirement: stay alive for the set amount of seconds on the clock. There's infinite ammo and plenty of health to grab...you just have to be active on that gun to nab those icons. Medal of Honor: Infiltrator is so fun, challenging, and well produced that the only hard complaint we have about the game is that the single player mode is just a bit too short. Five missions of three levels each just isn't enough to keep the game going; the team put in a Survival Mode that unlocks after the main game's over, but it's not quite the same action that players go through in the main gaming mode. There are additional modes of play for two players via link cable to keep the action going, and the cart even enables an excellent and handy overhead mission map for Medal of Honor: Rising Sun when connected to the GameCube. But we want more single player missions, darn it!  Don't let last year's terrible port of Medal of Honor Underground frighten you away from Medal of Honor Infitrator. The development team got this one right on the money with a game design and technology that's made specifically for the Game Boy Advance, while still retaining the feel of a Medal of Honor game on the handheld. Infiltrator's is just a tad on the short side, but it's an incredible and fun challenge while it lasts...and one hell of a wartime romp on the GBA.", "date": "Nov 21, 2003"}