{"name": "Battlestar Galactica [2003]", "name_review": "Battlestar Galactica", "ref": "https://www.ign.com/articles/2003/11/21/battlestar-galactica-3", "text": "gets instant credibility among longtime fans of the TV series who've been waiting for a modern videogame adventure. We're not sure which came first, the decision to make it a space combat shooter or the decision to have space combat shooter veterans Warthog develop it. Either way, Battlestar Galactica comes off as the best space combat shooter on the Xbox and one of the better efforts available on PS2. The problem is the genre of space shooters doesn't have the same appeal as it used to. Warthog's experience with games like Starlancer ensured that the game would feel like you're piloting a spaceship and not just blasting away in every direction like some wall-less version of Quake but we've done this many times before. The re-envisioned Battlestar Galactica license that puts Adama at the center of the struggle between humans and Cylons may not have the flash and star power of Starbuck and Apollo, but there's enough here to get you all misty-eyed about the search for that bright shining star called Earth.  Gameplay  You're cast in the role of a young ensign named Adama, back when there was a whole fleet of battlestars defending the human colonists from the vile Cylons. If you'll recall, the events of the TV show had Adama as the leader of a ragtag fleet of refugee ships on a desperate search to find a lost tribe of humans, who of course happen to be all of us. The Galactica was the great space battleship at the head of this fleet and week after week through a couple of seasons in the late 1970s, the ship and her crew barely escaped certain disaster. In the game, you're confined to space battles in various ships from the BSG universe. The ships including the Galactica and the beautifully designed Colonial vipers look similar to what you'll remember from the show, but with a slightly retro look.   BSG looks like a simple enough game until you get into the surprisingly deep controls and weapon systems Warthog is known for. Killing all bad guys with mad button mashing will get you through the very first level only. After that your tutorial is over and you have to be fast, accurate and deadly. It begins with the game's clever energy management system that just happens to be tied into your weapons and special navigation moves. Simply put, you can do all kinds of cool things in BSG, but you can't do all of them at once or even repeatedly because your Colonial viper will be in trouble.      Your ship has a finite amount of energy that's used to fuel your afterburner boost, your special navigation moves like the 180 degree snap turn and your missile system. When your energy meter is at 100 percent (it replenishes automatically when you're not draining it) you get the added benefit of automatic repairs to your hull until it too is at 100 percent. This may not sound like a big deal but during the heat of battle when all hell has broken loose, you'll find yourself torn between unleashing another volley of death-dealing rockets and laying off the guns so that your ship's energy meter can fill up and thus repair your ship's tattered hullslowly. There's no damage model but you'll feel the pressure when you've got warning lights flashing all over.   Your weaponry includes regular lasers and enhanced super lasers that you can unleash by holding down the fire button rather than just tapping it. The missile system lets you configure the strength and attributes of your missiles on the fly. You can fire lots of speedy, agile missiles and you can fire fewer but more powerful missiles with huge blasts radiuses or any configuration in between. The only limitations however are that the speed and power rating of the missiles are going to be inversely proportional to each other just like the blast radius and agility are going to be. Tapping your missile button will dumbfire one missile but holding the missile button to ~tag~ enemies in your reticule for a lock-on is when you'll appreciate the various missile attributes. Managing your laser and missile systems is crucial because you have different enemy ships to deal with and they all have unique attributes that will confound you if you're not paying attention.   The game offers several handy controls that you'll have to master if you want to be successful. Toggling through multiple targets is good, but the holding down the primary target button to instantly swing the camera so that you can see your ship and the objective at the same time is very important. We've seen this system applied in Secret Weapons over Normandy and Crimson Skies but with the 360 degrees of battle zone in this space shooter, it's better applied in BSG. The 180 snap turn is crucial to getting swarms of enemies of your back since you can use it to quickly turn around while maintaining your momentum and fire off a volley of missiles. The skilled player will be able do another snap turn after that missile volley and continue on their way. Barrel rolls to dodge incoming fire are also crucial.  We're giving a deep combat system because the AI in BSG is fairly tough. Whole packs of enemies will gang up on you or a ship or target that you're supposed to be defending without mercy. The run of the mill Cylon Raiders aren't as fast or dangerous as their squad leaders and you'll often have to discern one enemy type from the other during the heat of battle. This is where the primary objective button comes in handy. Whether it's a certain enemy you need to blast or another ship you need to protect, it's always good to know where you have to go.      You're given rating after missions that will unlock new goodies including those super precious wingmen. The wingman system in Battlestar Galactica is very well realized when compared to other flight/space combat games. You give them the command to attack a target, defend a target, protect you or pull off their own special move but they're on their own and quite capable when it comes to executing. Their precious commodities because they level up in abilities as they get more experience but if they get blown away they're gone for good and they take their experience with you. They serve a similar purpose as your squadmates in RS3 where things are easier with them than without them, but managing them and your own affairs is a tough ticket. This extra layer of gameplay depth is welcomed.  Getting to man the turrets on the Galactica and fly other ships, including the Cylon raiders, are satisfying because you will have gone through a lot to get there. BSG is tough and this is definitely a good thing but the save system is such that you will have to restart at save points that seem a little unfair. For multi-part missions, you can find yourself getting to the last objective of the last part of that mission only to fail and end up starting the whole mission over again. We're talking 15-20 minutes of gameplay going down the tube at times. Other than this BSG provides a decent challenge even though a multiplayer component of some kind would've made it even better.  Graphics  The deep space exploits of Adama and the young pilots of the Galactica look pretty enough although not quite up to the stunning brilliance of a game like Rogue Leader. This sector of space is dark and distant enemies can sometimes be camouflaged. We've never been in deep space combat before, but it probably looks a lot like what we have here in Battlestar Galactica. Those soft space clouds that pop up from time to time in deep space are all beautifully represented as well as those other brightly colored astronomical bodies that we never bothered to learn in school. Not the asteroids and moons --we know what they are-- but that other stuff like solar flares and whatnot that just look really cool. There's plenty of that in Battlestar Galactica.  The intelligent camera system works the same as the camera in Crimson Skies where it's not locked on the fuselage of the ship itself. Instead it's on it's own course, adjusting and reacting only when it needs to because of your actions as the pilot. This is crucial when you execute the snap turn because you see your ship flip back towards you before the camera swing around to the rear of the ship again to show the standard 3rd person perspective. The benefits of the fancy camera system are obvious when you start using the primary objective button to create a straight line of sight between the camera, your ship and that objective.  The energy and special effects are very well done and really deliver the feeling of deep space combat. At any one time there are missile trails, laser blasts and enemy ships zipping every which way not to mention all of the targeting blips and information that's on your HUD. Everything is bright and easy to recognize so you'll know how much trouble you're in when you see eight or nine comet looking things streaming towards you with blue tails. Those are missiles and you'd better do something quickly. When you hit the afterburner you get cool streaking effects on your ship, not on the camera. The feeling is really driven home when you switch to the in-cockpit view. For the most part the cockpit view is disappointing because too much of the screen is taken up by a cool looking dashboard full of gauges and blinking lights that just happens to block out most of the action on the lower third of the screen. Your targeting reticule stays in the middle of the screen but you can't see any enemies approaching from the bottom.   Sound  The ship and battle sounds of Battlestar Galactica are well done. Even with the cameos by Richard Hatch, Dirk Benedict and Dwight Schultz (an A-Team game must be just around the corner!), the voice acting is a little disappointing. This is mainly because Adama, the star of our show, sounds like a pansy when compared to the rich baritone voice Lorne Greene gave us on the TV show. Back in '78 Commander Adama didn't mix it up with bad guys too much, but you could tell he had been on the winning side of many an ass-whooping by the way he issued commands. This version of Adama, whom you're guiding through his earliest whooping days starts of sounding like one daisy of a fighter pilot.   Under the Galactica  The surround sound is disappointing especially considering that 5.1 Dolby Digital could've really helped a game like this. The subtle sounds of a Cylon raider in the distance at 4 o'clock zeroing in on you is just what BSG needs to get players over the hump and totally immersed. Instead you get a little directional sound when things are right on top of you, but nowhere near the level of sound detail you could have with missiles, lasers and ships flying all around you. In fact, many mission-sensitive bits of information are delivered by voice samples during battles and these clues often got lost in all of that hubbub. It all could've been done much better.   The classic ~Theme from Battlestar Galactica,~ however, is still one of the best sci-fi tunes going. It's up there just ahead of the original Star Trek's theme and a notch or two below Vader's ~Imperial Death March.~   Battlestar Galactica is a decent space shooter that will probably disappoint hardcore fans of the show who would want more of the magic that made the show so endearing. You spend long stretches battling in deep space with a few cutscenes to explain the action, which is the opposite of the original television show. The space-shooter sub-genre has lost some steam lately with many gamers expecting more variety now that such powerful consoles are available. BSG is a throwback, basic space-shooter right inline with a game like Starlancer and nails what it set out do. The intent of this licensed product just wasn't very inspired. You get to fly Colonial vipers after all these years, they come with a few surprises and that's about it. The developers did a good job of adding some appealing tricks to fairly thin sci-fi license but this is game that probably won't be worth much more than just a quick rental.", "date": "Nov 21, 2003"}