{"name": "Justice League Chronicles", "name_review": "Justice League Chronicles", "ref": "https://www.ign.com/articles/2003/11/21/justice-league-chronicles", "text": "Last year, Midway released Justice League: Injustice for All, its first Game Boy Advance title using the Cartoon Network original series as the basis for an action game. It had its moments but it was utterly average and forgettable. It either was successful enough to garner a sequel, or folks at Midway wanted to give the series a second try after a bland first attempt. Whatever the reason, we GBA owners get a completely new adventure in the form of Justice League Chronicles. As forgettable as last year's game was, we're really trying hard to forget we ever put this awful title in our systems. Features Six playable characters Cartridge save (three slots) Link cable support for two players (multiple cartridge)  The original Justice League was a by-the-numbers side-scrolling platformer, with each level featuring a unique pairing of characters from the series. The sequel expands on the pairing element but takes the game design in a completely different direction, turning the Super Friends' second GBA game into one of the worst Double Dragon style brawlers created for the handheld.. The idea starts out promising, we'll give it that much. The angled, overhead view allows for players to move in a variety of directions and deal with enemies on different levels. But a good idea without solid implementation is one that gets lost, and man,  Justice League Chronicles is seriously lost.  There are three ~episodes~ tied together in Chronicles, each one ~starring~ two different superheroes: Flash and Green Lantern, Superman and Wonder Woman, and Hawkgirl and Batman. Regardless of their special abilities, they've been grounded for most of the game where players simply move them with horrible imprecision and beat up on wave after wave of bad guy attacks. In certain situations players will have to swap between the two characters using the Select button...sometimes taking a couple presses to actually get this command to activate.  The bad control is only amplified with a combat engine that features some incredibly loosey-goosey collision detection and next to no combo system to make the punch-punch-punch action somewhat more interesting. The designers actually try to throw in some platform elements during the action, but thanks to the horrible controls it just adds to the overall frustration level. The action is accompanied by this odd, haunting musical score that not only doesn't match the action on-screen, it seems more fitting in a Psycho flick than a superhero videogame.  The game's not all brawler, though. Peppered between the combat are a few levels that plop the specific heroes in 3D challenges, like Flash's run through the arctic or Superman's gunning down of enemy craft in the past. These aren't terrible, but they're far from polished...and feel like they've been slapped together in a few days of development. The team at least stuck in a few two-player options through link cable support...but that would mean two copies of a yucky GBA game. And I wouldn't wish that on anyone. ~Rushed on a budget.~ That's what Justice League Chronicles feels like. This is an extremely sloppy production that's not fun to play, and even if you love the series this game might end up turning you off of the franchise. Maybe not that bad...but it's pretty close.", "date": "Nov 21, 2003"}