{"name": "Cartoon Network Speedway", "name_review": "Cartoon Network Speedway", "ref": "https://www.ign.com/articles/2003/11/21/cartoon-network-speedway", "text": "I'm not going to begin this review, like many of my kart racing reviews, with an analysis on why developers must create kart racing games for the Game Boy Advance. Instead, I'm just going to come right out and say it: Cartoon Network Speedway is one of the sloppiest and most generic kart racers released on the Game Boy Advance. There. Features Twelve Cartoon Network drivers Twelve tracks Password save Link cable support for two players (multiple cartridge)  On the Game Boy Advance, we've already got umpteen character kart racing games already available, with a new one, Crash Nitro Kart fresh on the shelves. But, the powers that be deem it necessary that the market requires yet another one, so Majesco went to DC Studios to create a racer that features several characters from the Cartoon Network line-up of original toons. The concept has been done a billion times before, but in this case Cartoon Network Speedway is just plain awful from start to finish.  First of all, the Cartoon Network license wasn't used for anything other than having characters on karts. That's it. Locations, situations, music and weapons all feel like they were pulled out of a ~Generic Game~ hat...other than the line-up of racers, there's not a single reference to any of the cartoons that they star in. It's almost as if the game idea was conceived first, with the Cartoon Network posse thrown in at the last minute. Heck, a single ~Whoa, momma!~ from Johnny Bravo would have been something...as it is, these characters are completely mute.  Most Mode 7 games run smooth and fast on the Game Boy Advance depending on the techinques used, but in the case of Cartoon Network Speedway the framerate is half of what most other kart racers. The choppiness isn't terrible, but the sense of speed is...there isn't a moment in this racer where the game was ever moving faster than a Sunday drive in the country, even after hitting boosts or the power-up that pushes vehicles to their maximum speeds. This lack of speed definitely affects the handling of the cars, since the slow pace of the race makes it insanely easy to take the sharpest of turns. Tight vehicle handling is definitely welcome, but when it actually reduces the game's challenge down to next-to-zero, there are serious problems. And it doesn't help that vehicle animations are clunky   The game even has a handful of bugs and graphic glitches. One noticeable error pops up during a race where, for no apparent reason, the computer informs you that you're going the wrong way and sends your rank all the way down to last place. Nice testing, guys.  At least the development team attempted to put some replay value in the design by locking away tracks and characters, only making them available by completing races with a certain place and a specific score obtained by collecting stars and utilizing weaponry. This is ruined thanks to the omission of cartridge save RAM, replacing it with the cheaper, but much more annoying password system. And in a racing game, passwords are lousy since they remove a single, important element: the ability to record the best times per track. Any racing game can be improved with a time trial mode, and since this game doesn't feature any sort of time ranking, this mode wasn't even offered. It's clear that the game was made simply to have a box on the shelf that's meant to entice fans of Cartoon Network cartoons to buy it. The actual game itself is just filler. It's an extremely bad kart racer with no strategy, no challenge, and no charm.", "date": "Nov 21, 2003"}