{"name": "Tokyo Xtreme Racer 3", "name_review": "Tokyo Xtreme Racer 3", "ref": "https://www.ign.com/articles/2003/11/22/tokyo-xtreme-racer-3", "text": "The Tokyo Xtreme series has carved itself a nice little niche in the videogame racing world. It doesn't try to do a lot like the massive Gran Turismo games, but it has a few distinct elements that separate it from the rest. Developer Genki has stayed the course with Tokyo Xtreme Racer 3, fine-tuning the gameplay and expanding the playable highways to three Japanese cities instead of just Tokyo.  The world of the highway battle has gotten a little bigger.   If you want the second coming of the racing game with plenty of car tuning options, you'll have to wait for Gran Turismo 4. If you want some decorative car modifications and drag racing, check out Need For Speed: Underground. For a game that combines both with a unique racing system, TXR3 may be the game for you.   Gameplay  If you're new to the series, the defining characteristic of TXR3 is the battle system of racing. Instead of two cars starting together from a standstill and racing to a finish line, here you drive up behind another car on the highway, flash your brights to challenge them, and the race is on from there. At this point health bars appear on the top of the screen, just like in a fighting game.   These health bars will go down for two reasons: lagging behind the other car and running into something else. If one car is leading by more than a car length, the other car will steadily lose health. Crashing into a wall, a barrier, or another car will take away a chunk of health depending on the speed of the impact. The first car to run out of health loses. If you're the one that wins you'll get points that can be used to buy car parts or a new car.   These car parts form the core of the TXR3 experience. As I put more and more upgrades on my 300ZX 2by2, my car performed better in turns and had enough power to blow the doors off the competition and get to the harder competition. Beyond just putting in a bigger engine and suspension, I was able to tweak how I wanted my suspension, alignment or transmission.     Gearheads can tweak the gear ratio to see the different performance and import car enthusiasts can alter the look of the car with aftermarket items. Spoilers, hoods, sideview mirrors, skirts, and fenders can all be added, for a price. There's also an option to customize the paint job to truly get the car of your dreams.    As for myself, I focused all of my points on getting a faster car. I upgraded my engine, cooling system, and muffler, all in the name of speed. To do all this required hitting the highways and racing every other car out there.   TXR3 starts off in Tokyo on a figure-8 shape set of highway track with offramps to switch sections of track. Driving around on these highways are members of car gangs. After defeating all of the lower members of a gang, the leader will challenge you to a match. Beat him and you get a the ability from on to buy his car.    The only drawback to all this is that even though the cars have the names of real cars and car companies on them, the cars themselves are not completely accurate. A disclaimer before the game starts says that the car companies are not associated with TXR3 and that actual performances of the real cars does not necessarily match the cars in the game. A disappointment for car enthusiasts, I'm sure, but at least the cars are close in appearance.   The AI for all of the computer racers were identical, differentiated only by the power of the vehicle. The faster the car you were racing against the better you had to drive or the more you had to upgrade your own car. After learning how to handle the curves in the track most of the work I found in TXR3 was in fine-tuning my vehicle. Then again, you can always cheat.     Each highway track has a set number of entry points to start driving from. Each time I entered the highway from one entry point, I noticed that all of the other cars always started in the same spot. That includes the other cars to race as well as the ~civilian~ vans that drive slow and serve as moving obstacles. Thus, if you drive up to the nearest raceable car and challenge him right after entering the highway, the race will start in the exact same way. One such starting point (Ginza's inner loop) led to a situation where the other car would always run into a divider and be slowed down. Another (Kiba/Fukuzumi CWL) always started with a turn that has two vans blocking the left side. Using this knowledge as a starting advantage and driving without incident for the rest led to a guaranteed series of victories. It was a cheap victory and it would've been more interesting if the starting locations were more random.   One of the big new additions to TXR3 is the new amount highway to drive on. Tokyo has been expanded to include Yokohama. Two other cities, Nagoya and Osaka, have been included as well. After racing almost a hundred cars in Tokyo, I was excited to move on to some new territory only to find out that a lot of the highway in the new cities is straight. The first section I was allowed to drive on in Nagoya is practically a rectangle. Where Tokyo required navigating lots of turns and lane dividers, the new highways involve long high-speed chases where most of the time all I did was change lanes. It was a disappointment to be in a series of drag races after racing in Tokyo and the fact that these new highways were accurately rendered did nothing to make the game any more exciting.   In the end, it's really the appeal of the tuning and decorating of the cars themselves that steal the show. Driving in Tokyo provided for a lot of excitement in the process of going from a bare import car to a tricked-out monstermobile, but the rest of the game provides little more than an accurate Japanese highway driving experience. If you're a hardcore Japanese highway fan, this is perfect, but there could've been at least a few liberties taken with reality to make the game more interesting.   Graphics  The reflections on the cars and on the puddles in the ground during a rain are the coolest effects going on here.  Neon light reflections slide along the cars and car lights shine up from the slick ground. All of this is carried on at a solid pace, never slowing down the game at all.    The only graphical glitch that caused some unease was the issue of buildings popping up in the background. Usually this happened off in the distance, buildings popping up while still a mile off at least, but sometimes it would be a big fat pop-up less than half a mile away.     Sound  The sound effects for the cars sound a little whiny and buzzy, but since these are Japanese cars it's right on track. They're not the prettiest noises in the world and they sound like electric razors on hyperdrive, but they're adequate.   The music here is a compilation of some terrible guitar tryouts. Every time a challenge begins, power chords start chugging out to build up the drama. During the races themselves, endless guitar solos wail about. After a half hour of this torture, I put the music volume to zero and put on my own music. It's two years later and the TXR franchise has not made any significant changes. The cars now have real names even if they're not quite the real thing. The highways are now much more extensive, but tend to be long stretches of straightaway. What's still here is a decent game that features some car-tuning and decorating options for car enthusiasts to test out tricking out their cars. The racing game is fun, but at best a diversion from other titles that are already out there, like NFS:UG, that cover similar ground with better attention to the game. Since Crave is planning to sell this title for only $20, the price could make TXR3 more attractive as a purchase.", "date": "Nov 22, 2003"}