{"name": "Grand Theft Auto II", "name_review": "Grand Theft Auto 2", "ref": "https://www.ign.com/articles/1999/11/19/grand-theft-auto-2-3", "text": "The original Grand Theft Auto was a cult classic of sorts.  People either hated it because of its ultra-violent portrayal of urban mayhem or loved it for its risqu subject matter.  I for one played the hell out of the original, and I've been waiting to see what DMA had up their sleeves for the sequel for a while now.   Not surprisingly, Grand Theft Auto 2 plays very similarly to the original.  There's still the same overhead camera, there's still the irreverent and often puerile humor, and you still play as a car-jacker working for the darker elements of a large metropolitan city.  All of your so-called ~business~ is handled through pay phones scattered throughout the busy city.  You go to a destination, answer the phone, and speed off to spread havoc and bedlam throughout the city.  Missions run the gambit from taking the driver seat in bank heists to detonating bombs in rival gang territories; jacking SWAT team vans to finding a dirty double-crossing rat and, how shall we say, ~taking care of him.~   All of this should sound pretty familiar to you former GTA hoodlums out there.  What is different in the sequel is the addition of rival gangs which add a sense of balance to the game.  All together there are seven gangs (Yakuza, Scientists, Looneys, Rednecks, Zaibatzu, Russian Mob and Hare Krishnas) that have a need for your particular brand of ~service.~ Each of the different gangs have a unique look and concentrate in a particular area of town, so you'll be able to tell which streets to avoid in case you do happen to anger some of the local stiffs.  So now you won't just have to worry about the cops nabbing you for running amuck. Chances are you'll be dodging several hundred bullets from the Zaibatzu if you become a favored runner for the Yakuza, or vice-versa.  There's a price to be paid for nearly every action in this game, which gives the game a much-needed gameplay boost since you're not just running a job for one central organization.  Now you have the option to control who you work for, and who you piss-off in the process.  In addition to the main missions you find at pay phones, there's also a number of minor side-missions that will keep you busy between jobs, like racing from one end of the city to another against a rival ruffian or going on a kill frenzy which rewards you for torching as many innocents as possible in a specified time limit. Okay, sure ... with its portrayal of ultra-violence this isn't a game you'll want to buy for little Johnny, but big Johnny might get a real kick out of it.   The three cities you'll drive around in GTA2 are absolutely gargantuan compared to the first game and, while it didn't take long to get yourself attuned to the city layout in the original, it takes quite a bit of driving to get your bearings in the sequel.  The cities are also much more dynamic and realistic than in the original. Ambulances speed to the scene of a hit-and-run, muggers hold you up on streetcorners, and prospective taxi passengers will even flag you down and hop in if you steal a cab -- which is a great way to earn an extra Hamilton or two.  The police AI has also been given an overhaul, and the cops have gotten much tougher this go-around.  Gone are the days of jacking a car within sight of a civil servant.  Now if you gank a car near a cop you better believe he'll be on your ass with his lights a-blazin'. Likewise, slam into a black and white and the boys in blue come running out with a vengeance.  The police also have a few nasty friends they can call up if you get too out of control: the SWAT team (dressed in riot gear and armed to the teeth) and the FBI (complete with thug-busting tanks).  This makes GTA2 much more challenging than the original -- a bit too challenging if you ask me, especially since you have to spend quite a large bankroll to buy save points.  It is nice to see that DMA did listen to gamers at least and added a save game feature to the sequel, but the way in which it's handled is a throwback to its console cousins.  Graphically, GTA2 still looks a lot like its predecessor.  It's still flat and you're still limited to an overhead view, but it actually works pretty well for the game mechanics.  Some impressive color lighting effects have been added to the game, so ambulances, street lights, and police cars illuminate the city with prismatic displays. Unfortunately, you're still limited to a small viewing area, and since you're usually running from the cops at break-neck speeds, it's often hard to appreciate all of the colored lighting and graphical detail in the game. Regardless, Grand Theft Auto has never been much about stunning graphics anyway, relying more on fast action and solid gameplay to make for an entertaining experience.   Unlike the graphics, however, the soundtrack is one of the hottest features of the game, especially if you have a surround sound speaker system to take full advantage of the 3D sound. The radio stations vary depending on what vehicle you jack, and programming runs the entire gambit of music to ads to public service announcements. And the thumping musical selections are heavy with bass, which makes for good driving music.  I just wish actual radio were as entertaining.  Multiplay in GTAs boils down to little more than games of tag, point collection races, and deathmatch.  There's not much here that can compare to other great driving games like Midtown Madness.  Sure, it's fun for a few minutes, but doesn't have the oomph to keep you distracted for long.  When you boil it down, GTA2 doesn't further the aims of the original game, and it's still as base and sophomoric as ever.  As simple and mindless as it is, though, it keeps me coming back for more.  There's not much here in terms of graphical improvement, and there's really not all that much variety in gameplay, but damn if it's not a fun little game -- just like the original.  There's nothing innovative, nothing that creative, and it's not going to win any awards, but I find it addictive, entertaining, and challenging ... and isn't that why we all play games in the first place?  -- Tal Blevins I appreciate the desire to try and move games from the higher platforms to the Game Boy Color, but geez, Grand Theft Auto 2? The first one was bad enough. I will take this time to plead with Rockstar Games -- just say No to GTA on GBA. The game isn't that good in design to bother bringing to the handheld -- let alone the limitation problems. This is it...no more GTA. Please.", "date": "Nov 19, 1999"}