{"name": "WWF Warzone", "name_review": "WWF Warzone", "ref": "https://www.ign.com/articles/1998/08/29/wwf-warzone", "text": "There comes a time when a game encompasses all of the qualities gamers are looking for, be it in any genre, for any system. For Nintendo 64 it was Goldeneye or Super Mario 64, for PlayStation, there are a dozen titles, the most recent of which are the upcoming Metal Gear Solid and Final Fantasy VIII. WWF Warzone in so many ways is the game that does it all for wrestling.   WWF Warzone on the PlayStation has reached higher than any other wrestler, and because of its developer's goals, the final product achieves gaming goodness in nearly every aspect. Whether you want two- or four-player gaming against real humans; Tag Team with four; Cage Matches; Weapons Matches; or straight-on championship seasons, this game is packed with the players, the weapons, tons of replay value, and amazingly enough -- and this is a biggy for the wrestling genre -- speed and responsiveness.  All of the accoutrements are imbedded in the game -- intro scenes with the appropriate music, special moves and grapples exclusive to the wrestler, fans chanting wrestlers' names, insane full-motion video (not found on the Nintendo 64), and a fully detailed, in-depth Create-a-Player mode. Perhaps this is the best Create-a-Player mode we've ever seen -- it's packed with details, clothes, masks, shoes, shirts, tattoos, eye patches, hair, ripples, you name it, it's in there. In fact (and though it may sound sad), we found ourselves just sitting around on weekends creating players to wrestle. We created one character for each player in the office. What a blast!   But the heart of this game is the wrestling itself, and we are glad to say that the moves are there, and they're fast and realistic looking. On the whole and compared to fighting games, wrestling moves at a much slower pace. WWF Warzone is the fastest wrestling game around. Character response time is quick, and what's surprising is that the characters move like real wrestlers do; it's like they have a human swagger and rhythm all of their own -- it's just short of amazing. When Mankind rears back to crack his opponent, or when Stone Cold cocks his open hand back to smash his opponent's face, the physical motion is dead-on.   It also must be said that the four-player matches are fantastic, bringing multiplayer party game fun to the PlayStation. You will just need a multitap, and four players can have hours of groin-pulling goodness. This feature, paired with the Creat-A-Player mode, provide this game with a long-term replay value that's hard to match (pun intended).  Graphically, the textures shine through best. The detail to the bodies is phenomenal. Yeah the bodies and faces are still polygonal (thus, they're slightly angular), but they are packed with polygons, more than most wrestling games we've seen. And what's really cool is that the Create-A-Player mode seems to never end with hilarious textures and odd looks that keep the players fresh (well...) and different. With all of these textures and polygons, and as many whacked-out additions your've made to your personalized character, the four-player mode suffers little to no slowdown, another pleasant surprise.  WWF Warzone features great sound. The game is packed with individualized killer intro themes, changing waves of crowd chants, boos, and occasionally, some weird eccentric yells. The floor slams sound right on, too.   The only weird thing is that some of the players sound like women (please don't take this the wrong way). In other words, their voices are a little too high and off-kilter; like you never thought you'd hear a massive, grown wrestler sound like that. That struck all of us as a little weird.  Another smart aspect to the game is that Iguana imbedded cheats into the game that must be earned, a highly respectable way of making cheats available without just handing them out.  All in all, Warzone is a great, deep wrestling title that's more fun than a can of whoop-ass. Highly recommended.   Douglass Perry   What does this score mean? View our Ratings Key   (For more of the crazy wrestling goodness that only IGN can deliver, make sure to hit our excellent new wrestling site, called... What else? wrestling.ign.com.)", "date": "Aug 29, 1998"}