{"name": "Culdcept", "name_review": "Culdcept", "ref": "https://www.ign.com/articles/2003/12/05/culdcept", "text": "It's been a strong year for fans of eccentric niche titles -- especially for those of us lucky enough to own PlayStation 2s. And with Nippon Ichi's Disgaea: Hour of Darkness and Agetec's equally unconventional Magic Pengel already established as huge underground hits, there's finally some definitive proof that such bizarrely unique games can make an impact regardless of their stature or budget. But as 2003 comes to an end, the folks at NEC Interchannel and Omiya Soft aim to prove that fact one last time; as the pair's creative mix of Monopoly and Magic: The Gathering known as Culdcept has quietly shipped to retailers across North America.   As quirky and atypical as Culdcept is for American audiences, however, it's actually quite an enormous hit in Japan. Already released for the Dreamcast and Sega Saturn and the passionate subject of frequent world-class tournaments, Culdcept borders on that of a national obsession. So popular with its fans is Culdcept in Japan, that it has already become the subject of an award winning documentary and is one of the most popular merchandising topics in the entire videogame realm. Couples have been married in the moments preceding large competitions and individuals have been discouraged to the point of shooting fellow contestants with a handgun after going belly up in critical rounds.   To say that fans of Culdcept take the game very seriously would be an understatement of large proportions; and while we can never condone the more violent acts of its disappointed protagonists we can certainly understand why they're so dedicated in the first place -- as Culdcept is incredibly fun, deceptively deep, and always entertaining.    Gameplay  Let's just say from the outset that Culdcept is without a doubt the single greatest board game ever created for the console and PC medium. It's worlds better than any of those terrific Sierra ports of popular Parker Brothers tabletop games and most assuredly superior to titles created specifically for television sets (including but not limited to Catan, Hikaru no Go, and others). What makes Culdcept so particularly enthralling, though, is its immense ease of playability and difficulty to master. Play the game only a few times and you'll already have the tools necessary to take on tougher and more advanced players be they human or computer; play it for months, however, and you still won't be good enough to beat intermediate opponents each and every time out. Now that's replayability.   Of course, one of the big reasons for this is Culdcept's dependency on the luck of the draw and of the roll. Structured much in the same way as Monopoly, the game requires players to roll virtual dice before every turn to move the appropriate amount of spaces and claim different properties. In order to successfully claim a property, though, players will need to inhabit it with one of the cards from their deck -- using it as a guard from the other player's own set of mystical cards and thereby protecting the land from a hostile takeover. Just like Monopoly, part of the game's main strategy is knowing when to pursue a property and when to hold off for something a little further down the line. Since players can only hold five different cards at a time, it may not always be in your best interest to use one of your most important cards right off the bat either -- but with the ability to draw a new card before every round, the decisions you need to make are constantly changing.    In fact, it's Culdcept's many variables that make the gameplay so deep to begin with. With three different kinds of cards (creature, item, and spell) players will be able to change their situation on the board and turn the tide of the game in a single turn. There's literally no limit to how many approaches a player can take towards eventually beating his opponent either. Spell and item cards, for instance, can strengthen or weaken allies or opponents in a single stroke, while elemental similarities between guarding creatures and territories they inhabit can mean the difference between life and death (putting a Woodfolk on an earth square makes perfect sense while placing a Heat Imp on a water square doesn't). Additionally, some players may try to buy up as many spaces they can on each and every turn while others may only focus on one particular string of properties in order gain bonuses and increased tolls -- the only limit is their imagination.   Whatever a player's strategy, they'll still need to win their match-ups in order to progress. To do so, players will need to meet that map's given magic goal -- which is a prerequisite of how many magic points need to be collected in accumulation. Gaining magic can be done so in any number of ways: with passing given checkpoints, using bonus cards, or having opponents land on your inhabited square the most common. Unlike the standard ~pay and move on~ setup of its inspiration Monopoly, however, Culdcept offers players the ability to challenge a square toll with a card battle. Once the challenging card has been chosen and the appropriate spell and item cards have been used, a straightforward combat screen pits the two opponents against one another  -- with no user-initiated attacks or interactivity whatsoever. The cards are what the cards are, and part of using the appropriate strategy is selecting the right combination of them in order to win or survive an attack.    Naturally players with stronger decks have a better shot at winning their confrontations in the long run; and regardless if you win or lose a contest you'll continue to gain more and more cards after each battle. Luckily winning gives you a larger selection of more powerful cards to choose from, so if you can get the jump on easier opponents early and understand the basic mechanics you'll have a better shot at beating more difficult opponents sooner rather than later. But with as many strategic approaches as there are and the huge list of unpredictable (and difficult) opponents to choose from, the speed at which you'll reach such a level varies from player to player. There are other things to consider in a contest that can affect your progress too; like the ability to increase the value of your land so that it pays more when an opponent moves to it (i.e., you're adding a hotel to Park Place) or the option of swapping monsters so that they fit their environments more closely. There's more strategy to speak about as well, but it's all part of Culdcept's learning process and better left to be discovered on its own.   Fortunately, accessibility is another one of Culdcept's strong points -- making it very easy for players to jump right in and start devising individual strategies from the outset. The entire printed manual is available as a separate menu inside the game as well and can be accessed at any time. There's a plethora of customizable options that can be used to supplement your play style as well, giving players full control of their card books and complete control over the behaviors of A.I. opponents or the rules of a particular game. You can even play with up to three opponents at once and trade cards with other human beings via the memory card. Omiya Soft obviously worked very hard towards making Culdcept as playable as possible.    Unfortunately it's Culdcept's multiplayer aspects and customization options that work against it -- leaving us to wonder why certain elements weren't included for the final product. The most obvious omission of which, is the complete lack of online play or downloadable maps. And in an age where practically every head-to-head videogame for the PlayStation 2 seems to support the Network adapter, we were stunned to learn that Culdcept boasts no such convenience. It's a real shame too, as online play and additional maps could have literally extended the game's life by a number of years. At the very least Omiya Soft could have included the option to allow players to design their own maps to be traded and imported for exhibition games -- but as it is, we're left playing with the same 28 over and over again. That's not to say that they aren't fun (because they are), it's just that we would have loved the option to always have something new on the horizon. Oh what a missed opportunity.   Graphics  Similar to Atlus' Disgaea: Hour of Darkness, Culdcept's visual style is reminiscent of late-era Super Famicom and early PSOne graphics. Using a combination of bigheaded lightly animated character sprites and a plainly presented isometric view, the game isn't going to win any visual achievement awards by any means. And though Culdcept does offer a better selection of backgrounds and environments when compared to its closest rival Disgaea, the provided surroundings still boast almost no animation whatsoever. At least the team at Omiya Soft was kind enough to include a limited amount of hand-drawn shadow and lighting effects, though, as they definitely add depth to an otherwise dated ocular presentation.    One visual aspect in which Culdcept excels, however, is the design of its many cards. Painted by such renowned Japanese artists as Yuji Kaida, Katsuya Terada, Yuri Hanayama, and Ayano Koshiro, the playing cards look absolutely terrific. Representing practically every mythical beast ever conceived, each of the 400+ paintings provide some of the best still-life renditions of succubae, manticores, and dragons that we've ever seen. These images are truly marvelous too, and are so richly illustrated that they even inspired a coffee table book in Japan. We only wish that there were a better representation of these beasts during the battle phase -- as the limited special effects and occasional CGI cut scene used to represent them just don't do the paintings justice.   Speaking of the CGI cut scenes, they aren't anything particularly impressive and we've definitely seen better showings in other products over the years. But to their credit, the movies are a nice little diversion from the old-school sprites and some of the included pyrotechnics make them worth watching every now and again. On the whole, though, we can imagine that most Culdcept players will come to embrace the game's unique and simplistic graphical approach despite its many shortcomings. As it certainly has a distinct personality and reminds us a bit of the old Konami game Vandal Hearts had it been done in a higher resolution.    Sound  Not surprisingly, Culdcept doesn't offer much by way of current generation audio standards. Dolby Pro Logic, Dolby Digital, and other such receiver-friendly sound technology have been pushed to the wayside in favor of good old-fashioned stereo. To be fair, the lack of hi-tech audio support isn't too painful as Culdcept isn't exactly the poster child for envelope-pushing presentation anyway. Happily, the musical score is actually quite rich and was enjoyable enough to make us wish that it were available separately to listen to in our cars and workstations. As despite the noticeable MIDI-like quality of the music, it's mix of action-heavy battle tunes and melodious soft ballads made for some of the most pleasurable musical tracks of the season; our sincerest compliments to the composer Kenji Ito (Secret of Mana, SaGa Frontier).   Unfortunately the sound effects aren't nearly as impressive. Low quality animal growls, common weapon slices, and familiar crunching noises pretty much round out the average-sounding Foley selection. Occasional voice-overs during cut scenes and battle screens were an unexpected treat to listen to, but we've definitely heard higher quality acting in a plethora of other PlayStation 2 videogames.Much like every other niche title in the videogame universe, Culdcept isn't going to appeal to everyone. With its heavy reliance on luck and backwards presentational approach it'll likely put off a great number of people -- even those who have decided to give titles like Rez and Magic Pengel the old college try. It's just too different from the typical American-style game to catch on here as powerfully as it did over in the Land of the Rising Sun.That said, fans of titles like Disgaea, Romance of the Three Kingdoms, and Bombastic should find Culdcept to be just what the doctor ordered in this banner year for gamers with specialized tastes. Between its multiple layers of deep strategy and straightforward combat system (not to mention its personable style and terrific level of accessibility), Culdcept can be an awful lot of fun. And while we're definitely a little bitter that Omiya Soft chose not to include online play or a map creation tool, we're not going to look a gift horse in the mouth. Culdcept is the real deal and it deserves to be in any hardcore strategy or board game fan's library -- and with only a scant 30,000 copies printed for American audiences, it has a nice collectability about it too.", "date": "Dec 5, 2003"}