{"name": "Freedom Fighters", "name_review": "Freedom Fighters Original Soundtrack", "ref": "https://www.ign.com/articles/2003/12/10/freedom-fighters-original-soundtrack", "text": "Jesper  Kyd is something of an anomaly within the ranks of those who create music for video games. Riding the line between bombastic film composition and the electronically inclined ties to classic video game soundtracks, Kyd has carved out a distinct niche for himself thanks to his opulent and epic scores for games like Hitman 2 and his more ambient and dance oriented electronic scores for games like Messiah, in addition to many others that have combined elements of both. Kyd's latest excursion into video game scoring is the original soundtrack for IO Interactive's action game Freedom Fighters and it builds upon Kyd's love of eclectic electronicism and reverence for ominous orchestral movements.   With Freedom Fighters Kyd continues his use of Eastern European choirs, which he first explored on the Hitman 2 soundtrack. Whereas that score utilized the talents of the Budapest Symphony Orchestra and Choir, this time around Kyd has enlisted the services of the Hungarian Radio Choir. The results are incredibly gothic, lending an air of eerie militancy and twisted pomp and circumstance to seven of the tracks used in the game (the album consists of 18 songs, two of which are bonus tracks not included on the game).    The soundtrack begins with the almost ethereal ~Main Title~ theme, which prominently features the members of the HRC, emphatically singing over pounding drums before a pinging electronic rift washes over the track. Despite the mechanical stiffness of the synth portions, the choir dominates the track, lifting it into the realms of epic post-Gothicness.   The choir again feature prominently in ~~Invasion Of The Empire,~ beginning the track with a soaring female dominated a cappella burst that swells and expands to include militaristic male chanting before dissolving seamlessly into the next track, ~March Of The Empire,~ which has grown into an almost paramilitaristic chant adrift in oozes of chugging electronic pulsations that pong and shift with repetitive elasticity as the female voices gradually rejoin the chorus, adding an extra layer to the already hauntingly ominous atmosphere. In fact, contrary to the game, the music evokes images of nefarious cults plotting word domination via ancient, demonic rituals of sacrifice. In fact, many of Kyd's tracks would fit nicely into a new installment of the Omen should someone be inclined to kick start that franchise again.    The swirling vocal symphonics continue on ~Betrayal At Rebel Base,~ a short, channel shifting wash of lite operatic proportions that leads into ~The Battle For Freedom.~   Following this turgid entry, the choir disappears for several tracks and the music takes a more stripped down, less intense reprieve on tracks like the sprite, yet melancholic ~Isabella - Leader Of The Resistance.~ Dominated by piano it begins as a bittersweet interlude only to have snare drums kick in a militaristic cadence while synth treated voices flit in the background like disembodies souls. Bizarre scratching and other sundry noize (some of it sounding like croaking frogs filtered through layers of tinfoil) burble in and out of the mix. At about the 3-minute mark surging electronic bass kicks in, giving the track a subdued dance vibe.    Some areas of the score, especially tracks like the uber short (it's only 1:03!) ~Flag of Freedom,~ owe obvious nods to Vangelis' darkly lit electronic score for Blade Runner, albeit  Kyd has fleshed many of the tracks out with the Hungarian choral ensemble, who favor quasi-Gothic chanting to create a brooding and dense atmospheric mood (in some cases his electronic/classical hybrid also brings to mind machine music in James Cameron's original Terminator film).   Still other tracks, like ~Final Battle,~ drift into upbeat Georgio Moroder territory via the use of steady electronic pulse beats augmented by haunting choral chanting  The result is more futuro Gothicism than anything, producing an atmosphere that would be comfortable residing in any word crafted by William Gibson.   The rest of the album continues to flit between the two disparate worlds of stripped down, emotive vocals and various amplitudes of electronic ambiance, from dance oriented rhythms to more sedate washes of synthetic calm, such as on ~Rebel Base,~ which sounds like it could have been lifted from a not too distant romantic epic. ~Sabotage~ further explores the realms of white space and ambient toneology, becoming more of a drift of temporal sound than anything really concrete. The same can be said of ~Governor's Island,~ which uses ebbing and flowing expanses of ambient noise to create an almost snow blown sense of isolation and emptiness.   ~Infiltrator~ is one of the few tracks on the album that literally shifts modes and breaks out of the otherwise somber, militaristic tone that pervades the bulk of the album. Granted, it begins with slow build hammering drums, but there's churbling electro ripples lurking behind the mock industrial beat. They grow and mutate to include squiggling shards that flit from channel to channel before transforming yet again into phaser on stun pierces of whirr and hum. These noizes then all combine into an almost Gary Numanesque down tempo mesh of eerie synth.    The album's two additional, bonus tracks, ~Zero Hour~ and ~Flag Of Freedom (Original Version)~ dip back into the almost minimalistic electronic terrain, presenting almost somnambulistic shifts of soniference that serve to lull you out of the album in the most calming of manners. Once again the aural machinations of Vangelis are evoked, especially on the original version of ~Flag Of Freedom.~   Surprisingly, especially for a game score, Freedom Fighters works well outside the confines of game play, proving to be a rather enveloping aural experience when listened to on its standalone merits. While undoubtedly suited for those cold, dark nights when brooding is imperative, it also works rather well as background noise at work or for inspiring flights of fancy during daydream escapades.Freedom Fighters is a game that gets better the more you play it. The challenge increases at the same rate as your skills and abilities so that you're really appreciating the level of control you've got toward the end and the cool action you can create because of it. Obviously an online component would be a wonderful addition but for what it is Freedom Fighters is pretty satisfying. You just wish your running, gunning and commanding skills, once developed, could be applied in other ways against online competitors.Even fans of super rich tactical simulations will get a kick out of Freedom Fighters's easy interface and well developed AI. It occupies that area between all of the other games in the genre by limiting you to one character to control, offering a third-person perspective and using only three basic commands. Even without a fancy license like Red Dawn or some other Russo-American themed movie or show, Freedom Fighters works as a change of pace.", "date": "Dec 10, 2003"}