{"name": "Sensible Soccer 1998", "name_review": "Sensible Soccer '98", "ref": "https://www.ign.com/articles/1998/08/31/sensible-soccer-98", "text": "Since EA wrested control of the sports game crown back in the eighties, many companies have tried to compete with the corporate giant by concentrating all of their efforts on just one sport. Accolade has their Hardball series, Virgin specializes in hockey, and now the old-time development house Sensible Software is taking on the company with the newest iteration of their venerable title, Sensible Soccer '98. Electronic Arts has nothing to worry about. Although Sensible's design may appeal to die-hard fantasy league fans who don't plan to ever actually play a game, most U.S. gamers will find Sensible Soccer to be somewhat of an anachronism in today's sports game market.  First, let's take a look at what the game does have to offer. From the main screen, Sensible offers three different modes of what it calls  ~arcade~ play: a single player instant match that picks two random international teams and gets the game started, the Sensible International Chellenge in which the player jumps into a tourney against 20 progressively harder teams, and  head-to-head play where players take on each other sitting at the same computer. For those who want more depth from their game, Sensible '98 offers four more advanced competition types: Friendly, in which the player selects any two teams and the computer take on one of the sides, Cup, which allows up to 64 teams to compete in a large tourney, League, which pits 24 teams after each other in a run of games, and Tournament, another 64 entry competition that contains elements of both Cup and League play. The tournament table is kept in an easy-to-read format, and players who are unfamiliar with the way these types of tourneys are run (I was one of them) find that they get the hang of it after only a few run throughs.  Hard-core fans will want to create their own teams with the game's amazingly thorough Custom Teams mode. From here, would-be coaches edit players (right down to their hair and skin color) and create their own teams. Tactics can go to the coaches screen and select from a stunning number of different choices of exactly how the team is going to play. Coaches can even instruct individual players on tactics they want them to use during the game. After everything's set just right, it's time to jump into the game itself.  To put it simply, Sensible Soccer's on-field graphics and playability are amazingly outdated. FIFA soccer not only looks better, but controls better and more realistically on every single front compared to Sensible. Sure, it's great that players can affect the curve of their shots, but when was the last time you saw a player curve a shot to the left, and then have it change direction in mid-air and start flying right. In Sensible Soccer '98, this is a very real option. Control, if playing on the keyboard, consists of four directional keys, and two buttons, one for kicking and tackling, and the other for speed. Joystick control takes a little bit of the frustration out of play, but not much. It's still basically the same. The game doesn't have any multi-player options other than head-to-head on the same computer. And even if it did, it would be impossible to tell, because the game's manual is one of the most vague and unhelpful I've seen in years. Since I'm running short on space, I'll sum up a few more problems that players are likely to run into in their first five minutes of play - team members won't pass the ball in a direction that they're not looking in, the characters on-screen are so small that they're nearly invisible, and hitting the slide-tackle button causes your man to go flying about thirty yards across the field. It's simple horrible, and no person who has ever played another soccer game will find any joy in the actual play aspects of this title at all.  I could go on about Sensible Soccer '98's faults, but there's really no point. The truth is this: if you want a really good fantasy league soccer title, you really should check the game out. With that said, if you plan at any time to actually pick up and play with the teams you've created, get as far away from this title as you can. There are far better ways to spend your time, and your money.  -- Trent C. Ward", "date": "Aug 31, 1998"}