{"name": "Unreal II XMP", "name_review": "Unreal II: The Awakening XMP Review", "ref": "https://www.ign.com/articles/2003/12/18/unreal-ii-the-awakening-xmp-review", "text": "We're not gonna beat around the bush here.  Unreal II disappointed a lot of people.  There was a lot of promise: build on the well-remembered game play and beauty (well, for its time, at least) of the original Unreal, but give it the visual polish of Unreal Tournament 2003.  It didn't quite turn out that way.  The beauty was there, sure, but the game play was rather lifeless for all its visual splendor.   It may not entirely make up for things, but there's some redemption here.  Legend Entertainment and Atari have just released Unreal II: The Awakening XMP (which stands for Expanded Multiplayer).  XMP is available as a free download for those who already own Unreal II, and also as part of a new Unreal II Special Edition.  And what do you get?  A rather fine multiplayer experience, and certainly much more than Unreal II gone deathmatch.   Think of Unreal II XMP as a halfway point between standard Capture the Flag and the huge map-spanning control point-grabbing action of Unreal Tournament 2004's Onslaught mode.  Players vie for control of energy, deploy points, defenses, and four artifacts (think flags).  The result is a surprisingly slower pace than the frag-fest typical of the Unreal franchise, but this isn't necessarily a bad thing.   Here's how it works.  Each of the two teams begins the game with two artifacts, housed at their respective bases.  Ultimately, the goal is to control all four artifacts (or as many as you can at a time).  Between you and the opposing team's artifacts is a rather huge landscape, strewn with power sources, deploy points, stationary turrets, and various structures.  You can traverse the area by foot or by one of several vehicles.   But to do any of this requires energy -- a contestable resource in the game.  Vehicles won't start, defenses will remain offline, and even your movement will be limited until you take ownership of various power sources on the map.  Power is shared by the entire team, and the other side of this is that the opposing team can be incapacitated by taking over its generators.  (Teams gain control of generators, deploy points, entryways, turrets, and basic defenses by hacking them, which means being vulnerable until the hack is complete.)   When a player is killed, he has the choice to respawn at one of his team's deploy points, or wait in the field for a teammate to revive him.  Not all teammates are equally capable of doing this, however, which brings us to a nice place to introduce classes.      Each player when deploying chooses to be one of three classes, each with its own strengths and drawbacks.  The Gunner is the thug of the group, all brawn and firepower, but slow-moving and not particularly good at hacking or healing.  The Tech is the heroic geek, with medium speed and firepower, but a very high hacking aptitude.  Finally, the Ranger class combines stealth and sniper abilities with healing skills.  Not only is the Ranger a bad-ass with the long-range attacks, but he can fully revive teammates who have fallen.  He's weak in close-range combat, however.   In addition to the vehicles -- to which we'll give a little spanking in a moment -- players can also place portable turrets at strategic points on the map.  Once a team has enough power, these turrets go online and automatically fire at enemies.  Handy to have around.  Each team's base also has lockable doors and force fields which can be used to deter the opposing team.  These, too, are vulnerable to enemy hacking or loss of power.   Once your team is drawing enough power, a range of vehicles are activated.  A few smaller, Jeep-like vehicles do well for fast transportation, if not offense (though they can certainly run players down), whereas the slower-moving tanks feature multiple gunner positions in addition to the driver's seat, letting several teammates hop on for a frag-alicious ride.  To be honest, the vehicles take a lot of getting used to, as the controls are touchy and a little awkward.  XMP is brand new, so most of us playing were hardly driving masters, but the few players who piloted tanks with aplomb hinted that the tough controls may be purposeful, and that the vehicles can be effective once mastered.  Regardless, it's tough not to compare them to what we've seen of UT2004's vehicles, which are instantly fun to speed around in.   The weapons in XMP are taken from the Unreal II arsenal.  Each player class is pre-assigned a set of weapons (the Gunner gets a rocket launcher and flame thrower, for instance, while the Ranger has a long-range sniper rifle in his array of guns).  Gone, though, are the health units and ammo which are usually scattered inexplicably around an Unreal multiplayer landscape.  Instead, each map has a number of stationary Health and Ammo stations.  To recharge, you make your way over to one and step inside.    All of the power-grabbing, defense-snagging, and vehicular manslaughter in the game is just the means to the ultimate end of grabbing the other team's artifacts, as well as protecting your own.  As I mentioned above, this is ultimately a glorified game of Capture the Flag (though ~glorified,~ in this case, is not necessarily a bad thing).   Fans of the Unreal franchise may find XMP awkward at first.  Its pacing is far more deliberate than a classic Unreal Tournament deathmatch, though certainly this isn't a cautious tactical operations game either.  The hugeness of the maps adds to the feeling of slowness, as many of the distances are obviously meant to be crossed by vehicles, not on foot.  This would be fine if vehicle control was more accessible, but it's not.  That will leave many players frustrated, especially when what you're looking for is a bunch of tasty fragging.  (Fragging can be had, mind you -- it's fun to run rampant killing any enemy you see.  But that alone won't win the match.)   Those willing to spend a bit more time with the game, though, will likely adjust to the pace and have a lot of fun.  This does mean learning the maps, which can take a while, as well as getting a sense of what element (power, deploy points, artifacts) is most crucial at any given time.  But a higher learning curve doesn't make this a bad game.  It just sets the title apart from what players expect of the Unreal franchise.   Happily, behind its stately pace, XMP features the same quick-responding, intuitive controls (apart from the vehicles) of the whole Unreal series, so when it gets down to duking it out with a nearby opponent or two, you won't be shouting at the game, only the other player's superior quickness with a grenade.   While playing, it also struck me that this is exactly the sort of game which would improve many times over with a reliable communication system between teammates.  Yes, you're able to issue quick orders, but they're generalized and not particularly helpful if nobody's nearby.  XMP begs for the voice-over-LAN support which has worked so well for team-based Xbox Live games.  As it is, even past the learning curve, there is a frustrating feeling of uncoordinated chaos in a game that requires team coordination.      While all of this keeps the game play from being immediately likable, there's no doubt that this is one purty-lookin' game.  The latest Unreal engine is in full force here, and even if it's not cutting-edge, it still produces some beautiful sights.  As mentioned, the maps in the game are huge, and many feature dramatic canyons and vistas.  Player models are adequately detailed for this type of game, and the whole thing runs smoothly, given a nice low-lag server.   Sound in XMP is not particularly noticeable, which is another way of saying it's neither excellent nor especially bad.  There are times when a disembodied cry of ~I need a medic!~ or some other order comes from no particular direction, and it's here you'll wish the sound better supported the game's reliance on teamwork.  Thankfully, the player making the request is shown on your mini-map, so the issue is ameliorated.   It's not clear yet what support Legend will provide for user-created XMP maps and modifications, which would obviously help the longevity of the game.  As it is, XMP includes enough maps to last for quite a while, and given that it takes a while to master each one, this is a game which will provide plenty of playability for anyone willing to make the investment.If Unreal II XMP were a stand-alone product, it would be fair to hold it under harsh light and wish for better team coordination, more accessible game play from the outset, and much-needed headset support.  But given that XMP is meant as an expansion of Unreal II, and available as a free download, the whole package is rather impressive.  Adding online support to Unreal II might have produced a stale rerun of Unreal Tournament Deathmatch modes, but instead Legend Entertainment has given us a class- and resource-based experience with surprising depth.  It may not tear everyone away from Battlefield 1942 or even Unreal Tournament 2003, but it's certainly a nice way to pass the time before Unreal Tournament 2004 appears.", "date": "Dec 18, 2003"}