{"name": "X2: The Threat", "name_review": "X2: The Threat Review", "ref": "https://www.ign.com/articles/2003/12/18/x2-the-threat-review", "text": "Sometimes, the first games in a subgenre (space trading adventure, in this case) are so good and memorable that the followers never quite come out from under that shadow. Elite came out in 1987 and popped out two sequels. Privateer emerged in 1993, quickly followed by an expansion pack, then an adventure-oriented sequel many years later and the semi-sequel Freelancer earlier this year. Unfortunately, Privateer and Elite still stand head-and-shoulders above what came after. X2: The Threat comes closer than Freelancer in some respects, but is held back by a few fundamental issues.  But first, the good points. This is a huge game world full of dozen upon dozens of different kinds of vessels you can buy. It looks great, with bump-mapped textures, real-time shadowing and gorgeous starscape backgrounds. Every sector feels distinct, and each alien race has it's own unique look, a special set of ships, and a few unique goods to trade. Plus, in addition to being able to buy your own ships, you can even buy your own space stations, satellites, laser towers, and remotely control a fleet of trading vessels and fighter ships.  But the devil in the details. The most immediately evident is the ridiculously steep financial barrier to entry. Let me put it this way: Early on in the game, you'll get a free trading vessel with a large amount of cargo space. The most lucrative good is the energy cell. The most you can expect to make on one shipment is about 5000 credits. The cheapest space ship is about 60,000. Doesn't sound so bad in theory, does it? A dozen shipments, then you get your ship. But the devil is in the details. You won't always be able to buy very low or sell very high. This ship I speak of flies horridly, horridly slow, even when you have the game on fast forward (more on that later). You can upgrade the engine to run faster, but that costs money. It also doesn't come without any shields or weapons, and the hull is even damaged. The hull repair costs about 20000. Add some shields and a gun, and it's 25000 just to make the thing presentable. Then there's missiles, which cost about 1200 a pop.    The next cheapest ship is around 100,000. After that, it's 200,000. After that, the next level up is 400,000. It's possible to spend 85 million credits on a vessel--without giving it any upgrades, which you will need. You see, in order to remotely operate one of your vessels, you will need to upgrade the ship's computer. Want to make it buy something? That's the Trade Extension. Want to make it dock somewhere. Sorry, you need the Navigation Upgrade. Want one of your fighter ships to escort you, and attack pirates? Yeah, that's extra. It costs money to make money, I guess, and nowhere is it more evident than at the dockyard.  Once you've bought your space station, you have to hire a guy to take it where you want it go (and placing that station strategically to make the most money is a completely separate issue and isn't covered in the tutorials or woeful documentation). This costs around 5000 per sector you have to fly through. The shipping vehicle also moves at a snail's pace.  As you can see, for every aspect of the game, there seems to be a potential aggravation. It's takes very patient and dedicated person who's devoted to this genre to get past a lot of this stuff.  For example, there's the corrupted saves games. The save games take up at least 25MB apiece and grow up to 50MB each by the time you near the end of the game, but there's this issue where your entire computer can lock up anywhere from five seconds to a minute after loading the save game. So you don't know it's corrupted until your computer locks up. The game auto-saves every time you enter a base, and if you've been relying on this mechanism to keep your progress up to datebe ready to start from scratch 8-10 hours into the game, when the problem usually starts popping up.      Second, there are some strangely documented features that I found immensely helpful. When I say ~strangely documented,~ I mean that that some keyboard shortcuts are displayed a little squished together in the manual, so it isn't always clear what does what. However, Shift+D is listed as ~dock at my target,~ which implies that you can only target a actuality, you can press the ~.~ key to bring up the sector map, scroll down to your destination, press ~T~ to target, and Shift+D to automatically fly over and automatically dock. Docking manually in this game can be arduous and suicidal, since keyboard and mouse control are extremely floaty--until you've made significant financial investment in upgrading flight ability.  Once you actually dock, you still have to fly into a moor before you can access the space station network. This is where a truly undocumented feature comes in: the Esc key. Press this, and you automatically go to the moor and plug in to the network. Press Esc to exit the network, then press Esc to automatically shoot out of the base, instead of finding you way awkwardly to the exit. In fact, once you start using Esc, Shift+D and J to fast forward, you can fly for hours straight on autopilot--or tear you hair out of your scalp because you haven't stumbled upon these things. It's too bad the game is almost completely keyboard-driven dock from the cockpit, rather than from the sector map. In instead of mouse driven. I have a lot more appreciation for Freelancer's interface at this point.  Pressing J enables the Singularity Engine Time Accelerator (SETA), which you will need to drastically shorten the wait time between space stations, even with a fast ship. It's set at 6x by default, and you can take it up to 10x, but these CPU-intensive calculations produced significant stuttering even on a Pentium 4 2.4GHz with 512MB of RDRAM and a Radeon 9700 Pro. The intensive part comes in making all ships in the sector operate ten times faster without knocking into each other. Still, your remotely-operated vessels will still occasionally fly into an asteroid or another ship, no matter what speed the game is running at. Even on 6x the rig described above had a tough time at 1280x1024, until I turned real-time shadows off. While the bump-mapping does make the game look nice, and the ship and space station models are fairly detailed, I never got the feeling that the game should have been that sluggish, from what I saw. In fact, setting autopilot too quickly when coming out of some space stations will cause you to slam directly into them, because parts of them stretch out well beyond the docking bay entrance. One hit, and your ship can explode. Since you auto-save whenever you land, this isn't so big of a deal. But it is when you end up losing a lucrative mission as a result.    You see, every base has a Bulletin Board with anywhere from a half dozen to 20 posts. Most of them are just news updates, but there are always a couple missions available. They are randomly selected from a pool every time you land. Unfortunately, the selection is a little too random, because in my play-time, most of the missions required me to be at a higher rank than I was, or to possess a ship I didn't have. Some are taxi cab missions, but most of them are trading missions. Goods are separated into separate ranks, so one unit of Energy Cells takes up one unit of cargo space. But other items can take up as much as five units of cargo space for every unit of good, and only specific ship types can carry the ~XL~-sized cargo.  For better or worse, it doesn't matter much, because the only good worth trading seemed to be the Energy Cell. It had far more price variance than anything else in the game. You could buy 1500 units at 6 credits a piece and sell them nearby for as much as 25. That's a huge profit, and no other good came close to that. So, as you may guess, the only space station that was really worth building was the one that makes those cells, the Solar Power Plant, which will run you a cool 275,000, not including shipping.      But you can't just buy a station and plunk it down wherever. You'll have to find a sector that has a high demand and low supply. But the huge outlay is buying more ships to dedicate to selling your energy cells to other stations (although your base is set by default to sell to all comers). And space stations also require Crystals to make the Cells. Almost all of the bases have this system, where they require resources to make products. They won't sell you what resources they have in stock, too, and they also won't buy something you have if it's a product they already sell. You'd think they would accept it at a discount or sell you resources at a premium, because you will need energy cells for that Jump Drive (101,000 credits) which allows you to skip right over to the sector of your choice without having to fly through all the jumpgates in the chain.  This resource balance doesn't seem to be very well balanced from system to system. While this means you have all kinds of opportunities to provide the needed base yourself, it also means fruitless searching for a product when all the bases you come across aren't getting the resources they need. Plus, since the SPPs are by far the most worthwhile stations to build, it isn't worth the effort to close the gap and get production running in that sector. The Red Light Sector has only one SPP and a several bases that always desperately need energy cells. They can't get them because they're competing against several other bases, and the supplies always dry up. It's practically a trading dead zone, then, because for some reason these AI-controlled bases don't seem to send their vessels to SPPs in other sectors, at least on a regular basis.  There is a story amidst the trading simulation. While the story itself may be somewhat interesting to follow, and the rewards you get along the way, like free ships and a free jump drive, are worth winding your way through it, in my opinion. The voice acting is actually quite good throughout, as well. But character animation is decidedly robotic, the scenes are incredibly long and involved, and the camera is distractingly drifty. You can press the Esc key to plow through most of them and view the Mission Briefing later at your leisure, but instead of being able to view it in the form of a clear, concise set of bullet points, you have to sit through another long-winded animated presentation, with the crucial points usually stuck at the end.   When I find myself writing a review that may be unfairly negative, I will take a break, or just stop writing it and come back the next day, if I have that luxury. But on the second go, I only thought of more negatives. To be fair, a lot of what I see as drawbacks are mostly taste issues, such as the pricing scheme and the actual shallowness of the trading system. But what still stands out is the sluggish flight model that makes it nearly impossible to continuously target and hit an enemy vessel; the corrupted save games (which is supposed to fixed in the patch), and the general slowness of the design that feels like it was designed to pad length. Some may find this immersive, and there is a certain odd addictiveness to running back and forth between stations, buying low and selling highBut I could do that in earlier games that don't have X2's other issues. There are better places to go for trading simulations, and better places to go for space combat. X2's ambitions in trying to meld both themes ended up falling short of what most people would find entertaining. Although it got a lot of buzz as a Freelancer-type game, but it is a trading simulator at heart, and not a very satisfying one, unfortunately, since its complexity is wasted when the money is really made with only one type of product.", "date": "Dec 18, 2003"}