{"name": "Red Faction", "name_review": "Red Faction Review", "ref": "https://www.ign.com/articles/2003/12/18/red-faction-review", "text": "The N-Gage can officially be crowned a 3D machine with the release of the portable version of the popular first-person-shooter Red Faction. Home console versions of Red Faction have become a favorite of many fans and critics and have become synonymous with ~Geo-Mod~ technology, where players can blast holes in level environments creating their own path to victory.  Unfortunately the series' signature ~Geo-Mod~ technology is practically absent from the new portable offering, but what is left is a classic playing FPS that is sure to please fans of the early DOOM and Quake titles.  Features Twelve destructive weapons Two-player wireless death match Fully 3D Twelve major levels, broken down into multiple missions Classic FPS gameplay   The portable Red Faction  follows the same premise as the original game for PlayStation 2 and PC; a group of miners toiling under the surface of Mars are suffering from atrocious working conditions and a strange plague. You play the role of Parker to lead a resistance against Ultor. You must fight your way through hundreds of armed guards and machines for a chance to escape the Red Planet with your life.   While Red Faction  isn't going to win any awards for its original story line, it is the perfect setting for a bout of instinct-driven survival. Seeing as you are grossly outnumbered and in the pit of the enemy's stronghold you are going to need some serious firepower to make it to freedom. While there is no shortage of deadly weaponry in Red Faction --including a handgun, machine gun and rocket launcher-- there is however a limited supply of ammo for the higher-powered weapons, which will force players to strategically choose when to bring out the big guns. Those hoping for a carefree bullet-fest are in for a disappointment, others who are up for more of a challenge and a bit more calculation are in for a treat.  First-person-shooters are infamous for controlling poorly by any other means than a keyboard and mouse. If you have had past experience with a FPS you will no doubt approach the N-Gage's tiny D-pad and foreign button layout with skepticism, and while it is no substitution for the precision of a keyboard and mouse or an analog controller, Red Faction  makes the most with what the N-Gage offers. After a bit of practice, most players will find it fairly simple to navigate the treacherous Martian environments and go gun-to-gun with the numerous enemies.   Controls, while for the most part are excellently implemented--considering the limitations of the N-Gage platform--can still be problematic. The small size and close proximity of the N-Gage's buttons make pressing the wrong one (usually the fire button) a common and frustrating occurrence. Aiming is a process that is far from precise, and without the aid of the enemy lock-on feature would be almost impossible. Red Faction also suffers from clumsy jumping, which afflicts even the best FPS titles.  Red Faction  is one of the more visually impressive N-Gage titles available. Your character flows through the 3D environments very fluidly, and for the most part without slowdown. Environments and textures aren't flashy but do a good job in creating the gritty atmosphere. Character models are decent looking, but sport limited and robotic animations. Death animations are slightly over the top, as even a simple riot shield bludgeoning results in a water balloon-like explosion of bodily fluids.   The eerie soundtrack works great with the game's tension and desperate mood. Sound effects are generally good, providing solid-sounding gunshots, the pitter-patter of enemy footsteps and the electronic whur of mechanical doors opening, but cheesy enemy heckling such as ~Die miner scum!~ will have players searching for the mute option in record time.  In addition to the fun single player game, Red Faction  serves up a healthy dose of multiplayer action, giving players the option of going head-to-head with a friend in five different death match maps. Multiplayer maps aren't extremely elaborate or versatile, but these are minor gripes considering it is one of the finest FPS multiplayer experiences available on a portable. Red Faction  delivers one of the most satisfying single and multiplayer gaming experiences on the N-Gage to date in addition to being one of the most impressive first-person-shooters made portable. The only thing holding it back from being a must-buy is its touchy controls, and slightly steep learning curve. Those looking for some intense action, and are not afraid of a little challenge owe it to themselves to check out this memorable game.", "date": "Dec 18, 2003"}