{"name": "Chameleon: Mysterious Journey 2", "name_review": "Mysterious Journey II: Chameleon Review", "ref": "https://www.ign.com/articles/2003/12/19/mysterious-journey-ii-chameleon-review", "text": "A while ago, Detalion Software developed a title that failed to achieve or amount to anything. That game was called Schizm:  Mysterious Journey.  It was a point and click adventure that featured attractive graphics, but little else of value.  The puzzles were insanely difficult and the story which often makes these games worth playing was drab and dismal and offered very little value for your efforts. Well Detalion is at it again, with a second attempt at the puzzle market and they have learned (somewhat) from the mistakes of the first. Mysterious Journey II: Chameleon now has an incredible story - one that makes you want to see the very end - but unfortunately the puzzles are far to difficult for any person except maybe the most dedicated gamer to work through.   You play as Sen, a mysterious man who awakens after over 200 years of sleep on a space station.  You are greeted by a hologram which tells you that this is a punishment for your betrayal of the people on the planet.  You discover that a lone valley remains and everything else was destroyed by your acts.  In 16 days, the station is scheduled to fall from orbit, basically sentencing you to death.  Something else is supposed to happen in 9 days as well, but before you can find out what that is, the hologram is destroyed.  As you venture beyond the chamber into the space station, you are greeted by a companion, a large mechanical being.  You will repair him and thus, start your adventure - trying to discover the truth of the past of which you don't remember anything.     The heart of any adventure game is its puzzles and Mysterious Journey II is no exception.  Unfortunately, the difficulty level of many of the puzzles is such that most players will either use a walkthrough to complete it or stop before they even start.  Many puzzles require you to use mathematics understand various number systems.  Others will call for a certain level of patience that many humans could never possess, as the solution can be discovered only by attempting the puzzle over and over again.  There are a couple which aren't painful and even verge on entertainment, but they are rare.  The story is engrossing and compelling enough, though, that using hints to find your way through the game is worth the price of admission - if you are a fan.     The controls are basic enough and take seconds to get used to.  Mouselook and WASD is the system of the moment, but there is a level of customization for those not comfortable with that.  The camera angle is 1st person throughout, except during cutscenes where you get a glimpse of your true self.  Jumping is possible, but there are no jumping puzzles to speak of - so it has no real value.  Manipulating objects and moving around is done with a click of the mouse button, and the inventory system is basic - while there is one, there is no using of objects in the inventory unless it pops up when you approach something.  Dying isn't a concern, but it is advisable to save before beginning a puzzle in case you need that valuable hint to complete it (once you start a puzzle, it saves what you have done with it).  There is no quick save or quick load options, but its not really to the detriment of the game.   The environments are full 3D graphics, allowing for exploration of every nook and cranny reachable.  The graphics are visually beautiful, but its no Uru: Ages Beyond Myst.  The water needs some work, but otherwise, it's a very attractive game.  The character animations and cutscenes are done well enough to add to the story.  The sounds and voice acting are adequate as well.  There is some haunting music at times, which sets the mood in various areas.  Overall, graphics and sound are good.  To be honest, I had very low expectations when I was asked to review this title.  I played Schizm and was less than impressed.  It scored a fabulous 3 out of 10 from me.  I cited the impossibly difficult puzzles and a lame story as my reasons for slamming the game so hard.  The developers did a great job improving the story in Mysterious Journey II, but I was still left as frustrated with the puzzles as I was in the original.  While a beautiful, deep and interesting world awaits on this Journey, I would still not recommend this title unless you play adventure games for the stories they tell and no other reason.", "date": "Dec 19, 2003"}