{"name": "RC Cars", "name_review": "RC Cars Review", "ref": "https://www.ign.com/articles/2003/12/23/rc-cars-review", "text": "A glance at the box for RC Cars will probably leave you with the impression that this is just another budget racing game that may be just good enough to kill some boredom, but won't really suck you in. However, this little remote control car racing game has a lot going for it: nice graphics, a fun soundtrack, some impressive physics, lots of track variety, and more. Unfortunately, as you dig your way in, you'll find a few design decisions that will drain your batteries pretty quickly.  First, let's get to the graphics, the most immediate thing about this game. It looks damn good for a budget game. You'll get lots of nice textures, detailed car models, mobile obstacles like crabs, dogs, people, and vehicles, and fairly realistic water effects (most of the racing takes place on or near the beach). This is one of those games with enough shine to it that people will stop and watch you play. Also, the cars bounce and jounce and go flying just like you might expect. They're also quite powerful and will rear up when you slam on the accelerator and get low around the corners. The antenna bounces around, your booster pushes out smoke, and cars kick up long trails of sand behind them.  The environments all work to emphasize the fact that it's just a teeny little car--the tracks aren't specifically designed for small cars. Instead, you'll be weaving in and out of vehicle traffic, around tourists and beachcombers, through military bases, mines, and more. Although there isn't any damage modeling, your car will become progressively dirtier as the race progresses.  Sound, however, is pretty basic. The RC cars sound like RC cars, and the music, although pretty pumpin', doesn't vary much. It would have been great to have some positional audio support, so you could hear how close someone was behind you, and some more environmental audio to immerse you into the locales.    As you progress, the ten tracks will become more and more complex, with multiple shortcuts, potential pitfalls and sections that have you looping right back in the same direction you came from (making for some tense games of chicken). Instead of being linear and walled in, you can go flying off cliffs and into the ocean. However, you rarely get lost. The map keeps you oriented, and an arrow in the bottom-middle of the screen will always point to the next waypoint. A counter in the top left also keeps tabs on how far behind or ahead the other cars are, and will time your laps. There's plenty of info available, if you can flick your eyes over long enough, and it doesn't clog the screen either.  Unfortunately, the track has such an incredible amount of hazards that your eyes will usually be glued to your car from start to finish. You have pylons, potholes, missing bridge sections, and various debris litters the road. You get points for hitting the debris, which gives you extra boost points, but often it just slows you down. Still, the variety of the tracks is laudable. Every one of them has unique challenges and the geography is pretty imaginative. You can tell a lot of work went into making each track fun, challenging, and different.      The boost is a nice feature. It may seem kinda unrealistic to have an afterburner of sorts, but RC Cars isn't trying to be a simulation. You can lay it down for several seconds before you run out, and it will slowly recharge as well. In addition to hitting debris, you can also get points for hitting cars, although this is pretty risky as it can send you clattering around for precious seconds until you get your bearings back. And if your car ends up facing straight down or straight up, you're in a bad way. However, if you land upside down, you can just hit left or right to right yourself.  When you get stuck, though, you have to hit ~R~ to go back to the last waypoint. Yes, instead of just setting you up where you crashed, you have to go a potentially race-losing distance back, then desperately catch up, which usually leads to reckless driving that insures a last-place finish. This can really get aggravating, especially since you can't simply start the race over from scratch without paying the entrance fee again. In other racing games, entrance fees are usually a pittance, or something you can save up for relatively quickly. Not so here. Each competition race is five laps, which was one or two laps too long, in my opinion. Depending on the length of the track, it may take you as long as ten minutes to finish a race, and there's no telling if you'll actually place high enough to get some money.  You get bonuses for how many things you hit and how much faster you get to the finish line ahead of the next guy, but there's a hard limit on that for each track that's painfully low. If you find yourself eating sand one of these tracks, you just have to take the hit and hope you still have enough money left to try again. If not, you're forced to re-race the next track down, which you've probably already done several times. Since each entrance fee is a multiple of the previous fee, it takes a while to work your way through, and not for the right reasons.  You can do a free, 3-lap training race on each track you're qualified for, and you'll have to do this in order to figure out the in-and-outs, since the competition race, being without any free restarts, is do-or-die. So by the time you finish a track, you just may be pretty tired of it, unless you got lucky the first time around, which happened for me a few times.    There's a Garage, which gives RC Cars a pleasing amount of depth. Although you only have three cars to choose from, you can buy better tires for stability, better boosters for increased acceleration, and better engines for increased top speeds. However, you can only upgrade one level at a time. That Is, you don't have the option to buy Level 3 boosters until you've purchased Level 2 boosters. Also, a higher level costs many times more than the previous, but you're getting diminishing returns. The first level gives you a 10%, but the next one only gives you 15% percent. This probably won't bug some people, but it would have been nice to skip a lower level upgrade when you have enough money to buy the better version, especially when money isn't easy to come by. However, you can trade in old upgrades, and even your car, for not much less than the selling price.      Another laudable item is the manual, which weighs in at a hefty eighty-eight pages and exhaustively details just about every feature in the game, from what each menu choice does, to how to adjust specific graphics levels to suit your computer's performance, to how much each upgrade, to recommendations on how to make for a smooth multiplayer experience, to driving tips. Anything this game does can be found and explained in the manual.  Speaking of multiplayer, you have a good amount of options here, from split-screen two-player play to LAN and TCP/IP Internet games for up to six players, depending on the quality of the connection. Notably, you can set the maximum lag a player can have. The server queries them before they connect, and if the player's ping time is too low, they aren't allowed in. You can also specify what cars you'll let join you, and what specific upgrades you want, to set a lowest common denominator. Furthermore, a player doesn't have to connect to the server to see these details. It's all listed in the server parameters. Sadly, not many people have picked this game up so far, so you're likely going to have to convince some friends to grab it if you want some multiplayer action. So as you can see, there's a pretty satisfying amount of content, and it's not too bad to look at, either. Besides all I've mentioned above, you can also insert custom driver portraits, race against ghosts, and export your profiles to other computers. So why is the score not higher? Well, I learned quickly why the popular mode of racing games is to simply place 1st, 2nd or 3rd to unlock the next track--and to maybe pay a nominal fee to enter as well--and why it's popular to be able to restart a race from the beginning once you've plunked your money down. The expensive and all-or-nothing nature of each race forces you to go through the training session motions each and every time, which can drain a lot of the fun from a competitive race. It's much better to get a feel for the track and have the option, however slim, of winning something if you do well and moving on, instead of eating the cost of entry if you suck. It's also aggravating to finally master and fly through a track on a practice session, only to bungle away your hard-earned money when it's time for the real deal. RC Cars does so much right, but it stumbles badly here, in a fundamental aspect of gameplay that turns out to be a real buzz kill. That and having to retrace your steps to a potentially distant waypoint when you're forced to reset your car. It wouldn't be so bad if these two negatives weren't intertwined. Together, they bring down the notch from ~Great~ to ~Pretty Good.~", "date": "Dec 23, 2003"}