{"name": "Dell Magazines Crossword", "name_review": "Dell Magazines Crossword", "ref": "https://www.ign.com/articles/2003/12/28/dell-magazines-crossword", "text": "There are fewer mind sports more decidedly Sunday-morning intellectual than doing the crossword. The New York Times' puzzle has been deemed the world's top brain-number, but Dell Magazines certainly is no slouch, either, regularly delivering oodles of teasers and pleasers to the literary minded. Now, Blue Lava Wireless has teamed up with Dell Magazines to unleash Dell Magazines Crossword, a go-go version of the print puzzles so you can satisfy your crossword hubris whenever, wherever.  Features:  Downloadable puzzles Easy-to-use interface  Dell Magazine Crossword is, hands down, one of the best puzzle games you can download on your phone right now. The reasons are twofold: Not only does the game presents the player with an incredible number of puzzles, but it also has a great interface streamlines the crossword puzzle for the mobile experience, but without sacrificing anything.  Naturally, you cannot see the entire puzzle while playing. Rather, you move around the board with your touchpad. Also, Dell Magazines Crossword jettisons the numbers assigned to each word. Sounds like it should make it more difficult to find and solve specific lines, but the opposite is true. While you scroll around the puzzle, the clues for each answer (down and across for that specific space are listed below the puzzle. It works fantastically. And if you absolutely must see all of the clues, pressing * or # calls up all of the across and down prompts.  Even though the puzzles in Dell Magazines Crossword are difficult, if you stick with it, you will eventualy finish them. But don't delete the game from memory just yet. Dell Magazines Crossword features a very slick download system that allows you to reach online and pull down new puzzles. As long as you're paying the subscription fee for the game, you'll always have a fat supply of puzzles.  Now, Dell Magazines Crossword doesn't sport the latest graphics on your handset. But it does offer a very clean font so you can always read the clues. Typing in your answers (via the number pad, natch) is also easy and clean. Gamers that enjoyed Blue Lava's previous word puzzler, the excellent Blue Babel, needs to pick up their Sprint PCS phone and make with the downloading. Dell Magazine Crossword is an irreplaceable puzzler for anybody in love with words.", "date": "Dec 28, 2003"}