{"name": "Test Drive 6", "name_review": "Test Drive 6", "ref": "https://www.ign.com/articles/1999/11/23/test-drive-6-4", "text": "Published for the first time by Infogrames, Test Drive 6 is the latest in this long running and fairly successful racing series. The Test Drive series has always managed to turn out run of the mill games that are neither top of the line nor substandard and Test Drive 6 follows this trend.  Gameplay Test Drive 6 has a variety of single player and multiplayer gameplay options that should please most racing fans. The game is setup where the player begins with a set amount of cash for which he or she can use to buy a car from to use in the races. One can compete in single races or tournaments for which you must place bets on to enter. Other modes include cop chase, where the player tries to arrest other cars (or the other player in two-player mode), and Pink Slip, where the two players race for ownership of the other's vehicle.  The driving physics are actually quite realistic and are different for each of the numerous licensed vehicles in the game. In addition, the player can customize the car's engine, brakes, tires and suspension, which all significantly affect the control and handling of each vehicle. While the driving physics are pretty much true to life, the crash physics are definitely not. There are massive crashes that create flips and wrecks that just wouldn't happen in real life. This, of course, isn't necessarily a negative feature because it helps create a fast-paced arcade-style racing game.  The artificial intelligence of the computer-controlled cars is pretty good overall. The cross traffic will swerve to avoid accidents (unless you turn that feature off) and the racing opponents react realistically to most situations. Opponents will get into accidents and huge pile-ups on their own, as well. Graphics Given the fact that the PlayStation has been out for over four years in the U.S., one would expect that developers would know how to push the system to its limits. Not only have the developers of Test Drive 6 failed to get the most out of the PlayStation, they've proven to be unsuccessful in creating a graphical engine that would be impressive for a first generation PlayStation title.  The game's framerate is smooth in both single-player and split-screen modes, but the background graphics are so grainy that it actually deters from the gameplay. Many times during the course of a race it can be hard to determine where you need to go because you can't see the road because of the graininess of the graphics. Moreover, Test Drive 6 does not do a stellar job in producing a great sense of speed. When driving through a narrow city street at 80mph, it should move much faster than it does. Sound The audio in Test Drive 6 is pretty good overall. It has a nice upbeat-racing soundtrack that includes Fear Factory and a remake of Gay Numan's Cars, which is sung with Gary Numan. Most of the tracks are really nice, but a few of them get really repetitive. The sound effects of the engines, crashes, sirens and background noises are all done nicely and help support the overall feel of the game. Test Drive 6 has a lot of good features, such as the realistic driving physics (which many will overlook because of the arcade-style crashes), variety of tracks and the numerous licensed vehicles. But the game lacks a great sense of speed and the horrid background graphics actually hurt the gameplay. It's okay for a track to have blind turns, but it shouldn't be something that is caused by the grainy graphics that don't allow you to differentiate separate background elements. Test Drive 6 isn't necessarily a bad game, it just doesn't contend with the likes of Gran Turismo, Need for Speed, or Ridge Racer. It is an improvement over Test Drive 5, but I gave it a lower score because more improvements were needed considering its current competition.", "date": "Nov 23, 1999"}