{"name": "Sonic Heroes", "name_review": "Sonic Heroes", "ref": "https://www.ign.com/articles/2004/01/06/sonic-heroes-9", "text": "Sonic the Hedgehog, like Nintendo's fat, Italian plumber, has been around forever. He blasted through loops and sped through corkscrews on Sega's 16-bit Genesis console and has delighted hordes of fans ever since. But not everybody's been happy with the mascot's transition to 3D. Sonic Adventure 1 and 2 for Dreamcast (both of which were later ported to GameCube) proved to be fast and pretty, but also lacked polish. Drawbacks included play styles with less emphasis on raw speed and more on exploration; clunky, underdeveloped camera systems and in-game bugs and glitches.   There is a light at the end of the tunnel though. After a too-long hiatus, Sega and Sonic Team are back with an original new installment in the Sonic the Hedgehog franchise. Sonic Heroes seems to have gone back to the roots of the franchise in many ways, the most important of which relates to level design. The worlds that Sonic zips through are ultra-entertaining, unpredictable thrill rides. The game is faster than its Dreamcast ancestors and it's a lot prettier too. Plus, there's an entirely new play dynamic -- the ability to switch between three characters in-game -- and this adds some degree of strategy to the experience. The end result is far more enjoyable.   Yet, some of the same old problems, many of them technical in nature, are back for one more round and these again put a dent in the complete product.  The Facts  The first wholly original 3D console Sonic the Hedgehog game since Sonic Adventure 2 for Dreamcast Play as one of four teams including Team Sonic, Team Chaotix, Team Dark and Team Rose; 12 combined characters total Control three characters in-game: switch between them at any point and utilize their unique strengths Story, Challenge and Tutorial modes included Battle mode includes two and four-player split-screen action 14 unique stages View unlockable CG trailers and listen to music in the theatre section Progressive scan mode supported Dolby Pro Logic II compatible   Gameplay Developer Sonic Team seems to have covered all of the bases so far as Sonic Heroes' presentation is concerned. The game doesn't feature a single storyline, but four intertwined ones. We won't give away the specifics, but each -- full of trademark characters and goofy, over-the-top style -- is illustrated through the use of crispy clean full-motion video sequences that set up the action and then help drive it throughout the course of the title. Heroes revolves around team play and though the make up of levels remain the same, placement and challenges are varied depending on which of the four unique teams that are chosen. There are even different degrees of difficulty that relate to which group is selected. For instance, beginner players will want to go with Team Rose, which includes recognizable Sonic stars Amy Rose, Big the Cat and Cream the Rabbit,  as it's designed to be more forgiving; it even starts off with a traditional tutorial. But pros will want to go with Team Dark, featuring Shadow, E-123 Omega and Rouge the Bat, because maneuvering them and completing their objectives is harder and requires more skill. Team Sonic falls somewhere in the middle. It's very well thought out and equally well implemented.     In Heroes, gamers control a team of three characters with individual strengths. Though the players on each team are different, the same basic rule applies. One mascot is used for speed, another for flight and the last for power. Players can intuitively switch between the characters by using the Y and X buttons to cycle backward and forward. Though it initially takes some getting used to, especially since the game moves at such a fast pace, the process is easily mastered with a little practice. This new dynamic beefs up the strategic element of the experience some, but it's not used in enough clever, challenging ways to really change the overall experience. True, there are brick walls that only the power character can break through, but there is always a sign nearby that explains what to do or who to use, which cuts down on the difficulty considerably, a disappointment.      There are a variety of satisfying maneuvers between the teams and characters and many of them require the cooperation of three mascots in order to function. Sonic can speed dash, zip along walls, create wind tornadoes that suck up enemies and allow him to swing up poles, while Knuckles can demolish walls and naturally Tails can fly. More impressive, though, with Knuckles in the lead all three characters can lock arms together and then soar on the tops of wind funnels. Or Tails can throw his friends at hovering bad guys and knock them out of the sky. And on top of everything else players can hit the Z button when a group's energy meter is charged and perform a Team Blast, a devastating and dazzling move that eliminates all of the enemies on the screen. The selection, which is commendable, keeps the battle elements from growing stale.  We like these new additions. But we have to be honest here, and the truth is that we're simultaneously disappointed by them because we simply enjoy the thrill-ride elements a great deal more. Sonic Heroes does an absolutely sensational job of re-creating the intensely fast and unpredictable looping, corkscrewing stages from the classic games in 3D. Gamers who make it to the title's Casino Park stage, where the characters become virtual pinballs and bounce through chaotic, psychedelic casino environments, will be absolutely amazed at the speed and unpredictability of the areas. In Rail Canyon, the following set of stages, the heroes zoom along a series of 360-degree loops, unbelievable drop-offs, zigzagging turns, and more and it's so frantic and fun that there's barely enough time to blink. Sonic fans are going to be very pleased. These elements are done so well that every time we have to stop racing, or bouncing off pinball-like buzzers, jumping over landscapes, zipping around curves and more, we find ourselves disappointed. We would rather not break from the adrenaline rush.  It's also when the heroes stop zipping along that the game reveals one of its technical shortcomings, the same drawback that has nicked the presentation of previous Sonic the Hedgehog titles. The camera system seems to work when the characters are corkscrewing through environments, but when the action slows, especially during arena-styled battles, it sometimes goes haywire. It occasionally frames the play from behind doors, or so that players are unable to see what's ahead of them. It can be frustrating.  The title delivers some 14 levels, which are large and varied. But it won't take players a terribly long time to beat the adventure one time through. Luckily, Sonic fans can go through again and again with the four different teams and experience slightly altered scenarios as well as unique story offerings.  On top of everything else, the title features various battles modes for up to four players. The problem is that the framerate takes a noticeable hit, even in two-player split-screen mode. We tested several scenarios in which the fluidity was cut from 60 frames per second to noticeably under 30, a big let down. Gamers who can ignore this oversight, however, will find a number of play styles to enjoy from races to battles.  Graphics Colorful. Vibrant. Cheery. And entirely Sonic the Hedgehog in design. Players familiar with the franchise will recognize not only the characters, but also many of the locales. The saturated green world with blue water backdrop from the original game. The brown and tan tiled loops and runways. The crowded pinball machines and the casino themed courses. They're all back and looking good.    The game spits out large, moderately detailed locations that hold up to some scrutiny. Textures are usually crisp and clean, not to mention detailed, but up close they don't always maintain detail. The worlds are brightly lit. There are faked environmental shadows and gorgeous shimmering, transparent water effects. Meanwhile, the 3D models in the game are detailed and varied. Sonic's shiny surface looks fabulous up close. The characters are well animated; be it the Hedgehog's quick spin or the heavy movement of E-123 Omega, it all looks fluid and realistic.       The game's framerate is perhaps one of its most impressive feats. It runs at 60 frames per second without fail in single-player mode, an impressive feat given just how fast the game speeds along at some points. Unfortunately, the framerate does not hold up in multiplayer mode. The title also runs in progressive scan mode, a welcomed benefit for high-definition television owners.  Sound The Sonic the Hedgehog franchise has never featured our favorite brand of music and this latest installment is no different. Heroes returns with cheesy 80s-style guitar riffs and all. But the quality is at least very pristine. Meanwhile, the sound effects are perfectly implemented, from the ding of pinball buzzers to the nitro burst noise that accompanies Sonic's speed binges. Better, it all runs in Dolby Pro Logic II. However, only a die-hard Sonic nut could appreciate the horrendous voice work that is meant to colorize characters. Our suggestion to players: turn down the volume during cut-scenes.Sonic Adventure 1 and 2, to me, were two seriously flawed 3D outings that did little to further the franchise. But Sonic Heroes is a big step in the right direction. Sega has for the most part gone back to the roots of the franchise, taken a good look at what made the original games fun and applied the same formula to a 3D game. Some of the stages in Heroes are downright amazing. They're so fast, so unpredictable, so completely chaotic, that I can only compare them to a rollercoaster thrill-ride. And it's during these levels where the teams are zooming along and tearing through corkscrews that Heroes is everything Sonic fans could hope for.The problem is that I never wanted to slow down. Not because the battle or exploration scenarios are poor, but because they're just not as entertaining as the speedy parts. As if to add insult to injury, some of the technical issues that have always been with Sonic's 3D offerings, like a clumsy camera system, occasionally act up during the more free-roaming situations.With only 14 levels, Sonic Heroes isn't the most difficult title to complete one time through, but luckily there are four compellingly different ways to play it -- a truth certain to enhance replay value. I only wish the multiplayer mode was more polished.Still not perfect, but it's fun and there are moments in the game -- admittedly more short-lived than I'd have liked -- where the action, speed and sheer intensity approach a state nothing short of mesmerizing.Recommended.", "date": "Jan 6, 2004"}