{"name": "Blade & Sword", "name_review": "Blade & Sword Review", "ref": "https://www.ign.com/articles/2004/01/07/blade-sword-review", "text": "Ever since Diablo blew the doors off of action-RPGs, we've seen a slew of imitators and emulators. Darkstone, Lionheart, Anachronox, Asheron's Call, Neocron--the list goes on for a while. Some owe their origins more to Japanese console titles, and others at least offer a first-person perspective. However, it's been a while since a title came along that cut so closely to the original blockbuster.  Beyond being a 2D, sprite-based, isometric clickfest, Blade & Sword also chooses to incorporate the Horadric cube (here referred to as a ~Spyragic cube~), town portal stones you can activate along the way, town scrolls, (called ~homing portals~), a village with a healer who will refill your mana and health for free (a red meter and blue meter), socketed weapons, 800x600 max resolution, and a rather similar skill point system. In fact, B&S is so much like its predecessor that it plays like a mod rather than something built from the ground up, to a certain extent. However, where it manages to deviate, it does so with decidedly mixed results.  There are a couple welcome innovations in combat. You can block by holding down the Alt key, for one. This drains your stamina, however, and when it empties you won't be able to sprint. You can also dodge, which scoots you to one of four points circling the target, but the tactical advantage is minimal when you're fighting solo. You have combo moves as well, but it gets tedious since the fourth hit always knocks the target down and you can't hit them while they're prone. This wouldn't be so irritating if it didn't take so many hits to kill even an entry-level grunt. Some may find this difficulty ~challenging,~ but it ends up being a time-padding feature that drags the game out a lot longer than it deserves.  I prefer difficulty to be a matter of dealing with unique tactics, rather than sheer hitpoints. Area bosses will typically take five to ten minutes of monotonous clicking before they go down. This is primarily because they hit so hard that you'll be running back to the village for more supplies or reloading a save game. Combating them is a lot more like a standard beat-em-up game, where they flash before they unleash a move or combo, and can grab you and toss you around at their discretion. Each area is also dotted with a dozen or so ferocious creatures and mobs of tough groups. To make matters more entertaining, the map gets refilled when you exit the game, forcing you to make a run for it to get to the next section.    The most effective way to fight is to use your special skill moves. Each time you level up, you get one point to spend on one of several progressively more advanced attacks, and you can also choose to upgrade a previously chosen skill, but it uses a lot more mana (excuse me, ~chi~). In fact, for several hours into the game, the fighter-class character will have about a thimble's worth of chi at his disposal, making for only a few nice moves until it's back to the monotonous clicking. You can also do a ~Super Attack~ that drains all your power and takes forever to regenerate and usually doesn't kill the enemy right off. Your health and mana regenerate regardless, but this separate meter is a trickle to their gentle flow.      And your only save option is ~Save and Exit,~ which quits you out of the game. Suddenly make a mistake and lose some precious loot? Game freezes up on you? Too bad. There weren't any stability issues, but there was a graphical bug that created a ghost of my character standing around at the area starting point.  Perhaps the most disappoint aspect is the lack of lootable weapons armor, rings, etc. Sure, dying enemies drop money, potions, scrolls, and jewels, but those are secondary to the real treasure readily available in most every other RPG you'll come across. Shiny swords, cool-looing armor and fancy rings are the staple of this genre, and they are pretty much non-existent. You can upgrade your sword with jewels, but it would be nice to switch to a bow for ranged combat, or to don a shield or helmet. The embeddable jewels give you defensive as well as offensive capabilities, but it's a bummer of a system.  Visuals and audio are another strike against the game. B&S looks like it came out in 1997 or '98. Very minimal frames of animation, slightly cheesy spell effects, and repetitive sound effects. Yet even Diablo featured audible dialogue, rather than reams of tedious scrolling and often misspelled text that can't be sped up or paused. And not only are there numerous typos, but it appears to be translated awkwardly in many sections (rather than rewritten), although it's not so bad that you lose the thread of what's going. There's also some obvious text corruption that you'd think would've been caught before release.  As mentioned earlier, sound effects are repetitive. In fact, every time my fighter made the final combo hit, he would shout at the top of his lungs. This was happening so often that I had to turn the volume down to a whisper. Thankfully, the music is on a separate slider, and it is some great stuff, actually--It captures the ancient Chinese theme well.  In the long run, there's nothing here to recommend over a good Diablo mod. And a mod can be gotten for free and still allows you to upgrade individual stats like strength, dexterity and endurance. The advertised 140 hours of play is mostly thanks to the incredible amount of hit points possessed by even the lowliest of creatures (even on the medium difficulty setting), rather than loads of content. That and the fact that the damage they can deal out will force playing through the same section several times.   A style of play is only fun for so long before it becomes ~fun.~ Add tedious combat and many derivative elements--while taking out decently-written dialogue, the ability to save anywhere without having to exit the game, resolutions above 800x600, and lootable weapons and armor--and it's more than a little puzzling to pin down the appeal of this game. Especially when you can download Diablo mods for free.", "date": "Jan 7, 2004"}