{"name": "Tiger Woods '99", "name_review": "Tiger Woods '99", "ref": "https://www.ign.com/articles/1998/09/01/tiger-woods-99-3", "text": "In many ways, golf games are a lot like flight sims. You've got your high-end ultra-complex titles like Links LS and you've got your quick-action arcade jaunts like Golden Tee Golf. Fans of games like Links want to make sure that all of the features of real golf are included, and so avoid the simplistic action-oriented titles, while fans of the arcade games just don't have the patience to spend four days just trying to hit the ball straight. For years, companies have been trying to make a title that could make everyone happy. With their newest sports release, Tiger Woods 99, EA may finally have reached that goal. While it's certainly not flawless, this game may stand a closer chance of pleasing everyone than any game that has come before.  The first things you're going to notice about Tiger Woods is that it looks great and moves fast. Unlike so many other golf sims on the market, Tiger Woods presents a photo-realistic environment without forcing you to wait five minutes as each screen redraws. Every course in the game looks a lot like its real-world counterpart, and objects on the courses (trees, grass, rocks and the like) all look about as realistic as you could hope for. After a golfer hits the ball, you watch it fly through the air from a number of different camera angles just like on Sunday afternoon television. There's a lot of action on the green as well. When Tiger Woods sinks a crucial putt, he dances his way across the screen, and when Mark O'Meara just misses by a few inches, he shakes his head in dismay. If you're playing the game from your hard drive (which sucks up around 500 MB of hard drive space but allows you to play without the CD) all of these digitized sequences load up completely fluidly and blend perfectly with the game. If, however, you decided to save your computer's storage space for more valuable things, you'll usually see a few jerky movements as the CD catches up with what's taking place on screen. While it's not all that noticeable at first, after a few plays, you'll probably starting looking for the option screen after a few plays in order to just turn the movies off.  Fortunately Tiger Woods has plenty more to offer than just pretty pictures. The game comes with three different courses, Pebble Beach Golf Links, TPC at Sawgrass, and TPC at Summerlin. You choose to play as an existing tour champion (besides Tiger and O'Meara, there's also Brad Faxon, Peter Jacobsen, Lee Janzen, and whole load of others) or design your own golfer and watch your stats slowly improve as you get better at the game. When creating your own player, you're prompted to make decisions on the flexibility of your clubs, which clubs you're going to carry with you, and which ~cheat~ options you want allowed with your character. You also choose between using a simple three button click swing or a more advanced (and frankly, incomprehensible) swing that gives you more control. Once you've got your player, you're ready to decide on one of the nine different play options available. Options include practice, stroke play, tournament (my personal favorite - you get paid at the end), skins, shoot-out, match play, four ball (er, kind of weird... it's a team game), foursomes (another strange variation of match play) and a driving range. All of the different games are thought out, based on types of play that you typically see at real golf courses, and presented in an easy-to-understand fashion. Oh, and while you're playing the game, you can select a button at the top of the screen where Tiger himself steps out in an FMV and talks about the current situation you're in (although this can be pretty annoying since Tiger speaks only about real golf and not about how you should extricate yourself from the leviathan sand-trap in game terms). But hey, that's not enough to get up in arms about. Right? Sadly, Tiger's got a lot more wrong with it than unhelpful instructionals.  For all of its looks and player options, Tiger Woods still has quite a few things that keep it from being the game it was intended to be. Once you get out on the links and start smacking the ball around, you're going to notice that the ball physics just don't feel anything like real golf. The fairways and greens are all ridiculously fast and it's almost impossible to determine whether or not a ball has hit an object or not. Then there's the putting. PGA Tour golf had a putting system that, while not up to that of some other systems, works pretty well. In Tiger Woods, it doesn't. In addition to the fact that the game's math never seems to work out right for you (hit a putter that goes a maximum distance of eight feet at half strength and your ball travels about three feet on a flat surface), reading the lie of the green is next to impossible, even with the grid lines turned on. Despite the fact that you're supposed to be playing at the pro level, missing 22-inch putts is a regular occurrence. Most of my par fives boiled down to - get it on the green in two and then five putt my way to a double bogey. The bottom-line? Even after three weeks of play, I never found the ball mechanics or putting quite believable, but eventually I learned how to make it work. The physics never actually keep you from wanting to play the game, but you always feel as if you're fighting the game, and never completely enjoying it. In all fairness though, I did talk to a few others in the office who never had any problem with the system. This is one case where it's all about individual taste.  All in all, Tiger Woods is still a pretty impressive piece of software. The game plays quicker than most golf sims, and I found that I could make my way through an entire tourney in just under an hour, and could get in a quick nine in just under half that. The special effects are cool, even if a bit goofy - every time Tiger slams a perfect shot, he's covered in an electric glow and a voice straight out of Mortal Kombat would yell ~Tiger Shot!~ Best of all, Tiger has all kinds of cool multiplayer options, from modem head-to-head games to Internet play with its own leaderboard web site. The sad thing is, that no amount of special options and flexibility can overcome the frustrations within the game itself. My advice on this is to hold on 'til next year when EA will almost certainly offer up a Tiger Woods 2000 with as many options but improved gameplay.  -- Trent C. Ward Video golf is the guilty pleasure of the videogame industry. No one wants to admit they play them, but many, many do. Including me. I love Hot Shot Golf, and was looking forward to a more realistic game of golf. And while Tiger Woods is certainly not a game without flaws, it's good nonetheless.My biggest gripe is with the 3D engine. It doesn't seem very optimized, since there's not too much going on except for a few sprite-based trees and gentle slopes of the fairway, yet the game doesn't have a very strong, smooth framerate. EA Sports' PGA Tour Golf on the PlayStation was the same way  Tiger Woods 99 has a cleaner, sharper look, but for some reason the EA guys working on the PlayStation golf games just can't seem to iron out smooth animation.The interface is also a little troublesome and awkward. Including the swing-meter  instead of the traditional, generic thermometer-style graphic, you're presented with a goofy, top-down image of Tiger swinging, and you time the shot with the location of his golf club backswing. It just looks like EA Sports didn't put its best interface guy on this project.I'd rate Hot Shots Golf higher simply because its designed a lot better. But since the game does play a good game of golf (and more realistically, too), I'm tilting the scale in Tiger Woods 99 favor, too. I just wish EA Sports could have ironed out the ugliness.", "date": "Sep 1, 1998"}