{"name": "Slave Zero", "name_review": "Slave Zero", "ref": "https://www.ign.com/articles/1999/11/23/slave-zero", "text": "Slave Zero is similar to movies like Under Siege: it sticks with what it does best -- action -- and steers away from what it does worst -- plot.  There's always been something great about being a few clicks away from absolute mayhem. This style of game satisfies the need most gamers have, that of instant-gratification only adrenaline filled (and sometimes mindless) action games can provide.  Slave Zero works on this principle, and is a solid example of how a hybrid console/PC doesn't have to blow. Sound unrealistic? Here's the proof...  Slave Zero's plot is a textbook example of a science-fiction giant robot story, with a little bit of anime thrown on the side. Slave Zero takes place 500 years in the future, in a mammoth metropolis run by an evil dictator -- SovKahn. Slave Zero is a 60-foot tall, bio-mechanical, roof-jumping robot that's been stolen by a group of rebels to overthrow SovKahn. There's a little more to the plot, but not much. Like I said, its strong point isn't story telling and plot development, it's all about the action.  Gameplay, for the most part, is fluid and packed with thrills. Though, the game is a little short for my tastes -- about 15 levels, with each level split into two or three sub-sections. The level design is strikingly unimaginative, and a majority of the levels had the exact same look and feel. Much of the game has the look of a bad Godzilla movie set, everything looks small although you appear normal sized. Even the cars and trucks driving on the ground that you can pick up, throw, or squash -- touted as a major selling point for Slave Zero -- are actually pretty lame and look like moving cardboard boxes. In essence, don't buy Slave Zero because you like giant robot games; buy it because you like good action games. There's this undeniable magnetic draw to this game, and I found myself having a blast playing it, mostly because the control and agility are superb. With a bit of practice you can get the robot thundering around corners and flying off ledges straight out of a scene in an anime film.   Most of the missions comprise of the standard tried-and-true features -- you enter a level, shoot up a load of guys, fight a mini boss, shoot up some harder guys, and find a nasty-looking boss at the end. Repeat cycle again and again. As boring as this has become for some gamers (including myself), it's the foundation of this genre, and it certainly works to Slave Zero's advantage - mainly, because they do it well. The bosses themselves are the standard affair, but they aren't poorly done.   Game performance was great, and if you have a 300Mhz+ processor and a decent 3D accelerator the game should run smoothly. I must report, though, that Slave Zero did lock up and crash a few times, and there were a few minor clipping errors, which was frustrating. But the remainder of the game has a very polished feel.  In a good action/FPS game, coming up with a slew of unique and exciting weapons is absolutely crucial. This is one place where Slave Zero really shines. While there are not as many weapons in the game as I'd have liked, the weapons that do appear are unique and well designed. The stronger weapons project a real sense of power, as the whole screen shakes and enemies are torn apart by sheer force. This effect is quite satisfying. The available weapon pickups are separated into three categories: missile, energy, and projectile. A player can only carry one of each at any given time. This feature makes Slave Zero particularly unique, as some weapons are better suited for different situations, and the limited number of carryable weapons forces the player to think strategically. On top of the three weapons, Slave Zero can also use his fists or pick up steel girders from destroyed buildings. Administering a good, wholesome beatdown to enemy robots with a steel girder is simple but quality entertainment. The Slave unit has the ability to stomp and roar as well, but these features are more or less useless - aside from looking undeniably cool. One common and annoying trend among action games these days has been to severely limit the amount of available ammunition to make the game more difficult. I'm glad to report that this isn't the case with Slave Zero, as there's always plenty of ammunition around -- even in the later levels. Finally, you can chew through enemies incessantly -- just like Steven Seagal and those handy endless ammo clips!  The graphics are, for the most part, respectable, but nothing revolutionary. The city and high-rise backgrounds do look pretty good, though, and it's great fun running around obliterating small buildings, local businesses, and screaming pedestrians. The attention to detail is nice -- streetlights illuminate the roadways, bullet holes and craters mar the landscape, and buildings display the occasional cliche futuristic neon sign ( la  Bladerunner). The explosions are a mixed bag. While the small ones look a bit dated, the bigger ones are cool enough to get even the most grizzled FPS veteran a little steamy. The real graphical strong points of Slave Zero are the weapon effects and the in-game cut-scenes. The weapons look great, and their effects are all unique, and most of the in-game cut-scenes are outstanding, and add a great deal to the overall package.  In fact, the only thing that separates this game from being completely anime style is the lack of Japanese voice with English subtitles, and the curious absence of those classic anime general purpose fighting/jumping/posing sound effects (like shwiiiing! and skaaang!). Slave Zero's sound effects and music are actually quite standard, with the usual techno backbeats (which I found quite tolerable), and the normal gun and explosion sound effects. The sound work is definitely quality, but it's nothing to get worked up about.  Everything about Slave Zero just screams multiplayer. Giant, agile robots and earth-shaking weapons in a city of towering skyscrapers are the perfect fixins' for an amazing multiplayer experience.  But, unfortunately, Slave Zero is equipped with no multiplayer support. Apparently, the multiplayer support was scrapped just before the title went gold because it wasn't up to snuff. The fact that they refused to put in a poor quality multiplayer should be commended, but it's a real tragedy that they couldn't get it working right, as it would have improved the replayability of this title tremendously and could have made it a real contender.  All in all, Slave Zero is a quality title -- and I thoroughly enjoyed it. It's a solid single-player experience, and it's a shame they couldn't find a way to include multiplayer support. Everybody needs a title in their library that they can just pick up, jump right in, and hit the street shooting. Slave Zero is one of those games, and it's worth the purchase for that alone. Consider it the Steven Seagal film of action games; it may not be the deepest and most plot driven title (~Please... I'm just a cook~), but they both have sensational action - and that's what counts in an action title.  -- Erik Peterson", "date": "Nov 23, 1999"}