{"name": "Wildlife Park", "name_review": "Wildlife Park Review", "ref": "https://www.ign.com/articles/2004/01/16/wildlife-park-review", "text": "is a wildlife refuge simulation by Encore and JoWood. Lions, tigers, dolphins and elephants abound, as players will be charged with building natural habitats for wild animals and keeping both the animals and the people who visit these parks happy. Future zoologists or fans of sim games will find some entertainment here.  There is a five part tutorial which will take you through all the basics of using the interface and taking care of the animals. The manual has a lot of good information as well.  There are two ways to play Wildlife Park. First, there's the Campaign Mode, which will give you different objectives to meet in each level, like achieving a certain percentage in customer satisfaction or gaining a balance of x dollars. As you complete a campaign, additional ones are unlocked. The second type of play is Free Play, which allows you to select various options and lets you loose to do what you want. Locales include exotic locations from the Serengeti to Australia. There are three levels of difficulty, which affects the ability to overdraft funds and for demonstrators to picket the park or animals to go on a rampage.  Each animal has its own needs, from what it eats to the types of plants it desires in its proximity. Breeding of animals is an important part to Wildlife Park, and they won't breed unless they are ~Completely Happy,~ so meeting their every desire is important. Some experimentation will be required to find the perfect habitat. Also, gardeners, handymen and animal keepers are very important to keep the animals well-fed and their environments in good shape.  I do wish there were a little more to the breeding process, though. Once your animals are happy, they start the copulation process--then suddenly appear pregnant. After a gestation period appropriate to that species, a baby abruptly appears by the mother. I'm not asking for a deep visual of the animal giving birth, but just something a little more spectacular for the effort of actually getting animals to breed.    The interface is pretty easy to get the hang of, even though it looks daunting at first. You can zoom in and out and pivot the angle of view in order to get a good look at whatever  you fancy. You can also follow animals or patrons around, seeing what they see. The game is played in top-down isometric view and that can't be changed. There is the ability to alter the speed of time passing and to pause it, but the fastest speed sometimes doesn't feel fast enough. Also, it may have been nice to add in the ability to move some of the windows, as you may want to inspect a certain activity in the game at the same time you are watching your financials change--and the window in the middle of the screen can make this difficult.  The graphics are nice, but nothing spectacular. When zoomed in, they become quite blurry. You can make your park nothing short of spectacular by choosing plants that will accentuate the park, but you can't change the colors of walls or customize buildings in any way. While most of the detail is very well done, the ability to view the detail close-up is limited, and that detracts from the game. There are many different environments and there exists the ability to change the environment artificially, with a snow blower for example, so your park can look any way you want it, no matter where you are.  The sound effects are nice - you can hear the birds chirp and the call of the elephants. Each animal has its own sound and when you are over its particular habitat, that is what you'll hear. The music can become quite overbearing, though, and is too repetitive to be interesting. You will probably find yourself turning that down or off.What this sim boils down to is a numbers game. Constantly watching your numbers--that of satisfaction of animals and customers and your income and debts--is critical to being successful. Once you have set the park up, there's little to do but wait until you can expand some more because your income is going well or follow the little people around seeing what they are partaking of. I think that people who love this style of game will get a real kick out of being a wildlife refuge manager. It may also have some benefit as a teaching aid, as the care of the animals seems very realistic. The average gamer probably won't find much of interest here, though.", "date": "Jan 16, 2004"}