{"name": "Baldur's Gate: Dark Alliance II", "name_review": "Baldur's Gate: Dark Alliance II", "ref": "https://www.ign.com/articles/2004/01/21/baldurs-gate-dark-alliance-ii-3", "text": "Back in the dark ages of 2001, Baldur's Gate: Dark Alliance emerged like a knight in shining armor to bring together action and RPG games in a hackfest that could be played with two people. Time has passed and fans have been eagerly awaiting a sequel to get some more dungeon time in on their consoles. A couple years later and Baldur's Gate: Dark Alliance II is finally here to satisfy the masses hungry for a post-Christmas treat. So what is there to show for all of this waiting? A solid sequel that keeps up the pace of the original and adds a couple extra touches for flavor.   Fans should be happy to see that what made the original work so well, the hack'n'slash action and the easy to use system, have returned along with much of the look and feel. The biggest change, however, is invisible on first glance. The developer of the original game, Snowblind, has moved on to work on Champions of Norrath and Black Isle Studios has picked up the work for the sequel. No slouches themselves, Black Isle Studios have made an appropriate continuation of the story, but don't create enough changes that some may feel a sequel deserves. Still, it's a hackfest, and a good one at that.    Just like the original, BG:DA2 is much more about the action than the RPG. The camera gives an isometric perspective of one or two heroes as they fight through 80 levels to save the day. Gold, trinkets, weapons, and armor are all gained by killing monsters and raiding their treasure chests. As you gain experience and go up levels, you can buy new skills and enhance the character. The odd magical item that burns up the trolls doesn't hurt either.    So that's enough about the basic gameplay. What's really important here is what's new and different, the new characters and the workshop.     New Characters  The three characters from the original are not available in BG:DA2 because they're captured and thrown into a dungeon in the intro. The Onyx Tower is back and still causing problems as an evil vampire (is there any other kind?), Mordoc, seeks to use it to destroy Baldur's Gate. This can't happen so five new adventurers are here to save the day. That clears the way for five new adventurers to choose from. Two of these characters are essentially brawlers: a human barbarian and a dark elf monk who's best at fighting with her hands and feet. There's also a dwarven rogue is a stealthy character that can break into chests, disarm traps and lay down explosives. Rounding out the crew are a couple of magic users: a moon elf necromancer and a human cleric.    Where most of the new characters are pretty standard and don't deviate a whole hell of a lot from the typical set of adventurers, the necromancer stuck out the most as being the most distinctive of the bunch. With the ability to bring a skeleton to life to fight for him, the necromancer has an automatic fighting buddy. While he can't call up whole armies of skeletons like in Diablo II, it's still an effective device. Once the skeleton is wreaking havoc in the front, the necromancer can go nuts with the spells from the back.    The necromancer spells include fire arrows, acid arrows, chill touch that freezes enemies and, my personal favorite, Dark Possession. Casting this will temporarily cause an enemy to fight for your side. Casting it on one member of a group creates an effective diversion while the skeleton keeps on fighting and the necromancer can zap them with lightning, drain their life, or poison them. Of all the characters, the necromancer creates the most possibilities and uses the biggest variety of spells. All of this almost makes up for the fact that he insists on walking around with a book in one hand at all times (didn't they memorize stuff back then?) and choosing armor that shows off his nipples.    As for the rest of the characters, they're fleshed-out enough to have fun with and are no slouches in their own right, but they don't do anything that stands out in the genre either. The fighters are for button tappers, the rogue is a bit stealthy, and the cleric is there to back up someone else. Good enough, but they almost feel like they were created in some random character generator. And then there's their names: Dorn Redbear, Vhaidra Uoswiir, Ysuran Auondril, and Allessia Faithhammer? Allessia sounds like the name for a new acne medication. But I digress, the characters are all still effective and fun to play, just not as cool as the ol' necromancer.   Workshop  One of the new features here is the weapon creation system. Once you've met the acquaintance of the local shopkeeper, Bartly, you can use his workshop to build your own weapon, piece of armor, or piece of jewelry. To do so, you need two things: an object of better-than-average quality (normal items can't be upgraded) that has not yet been enhanced and a rune stone. The rune stones enhance the power of the item such as increasing the armor class (AC) of armor or the power of a weapon.     To make the items even more special, there are two slots for other gems. There are 14 different kinds of gems in BG:DA2 and each has its own property. For example, adding Jade to a weapon gives an additional acid damage that eats away at enemies after they've been hit. With two slots for gems, it's possible to combine effects so that there is fire damage as well so that enemies will be eaten away by acid and on fire. Find, or buy, enough different gems and all sorts of possibilities come up.   To make the items even better, it's possible to put up to 16 gems or rune stones in each slot. One rune stone increases the AC of a piece of armor by one point, two increase by two, four increase by three, eight increase by four, and 16 increase by five. A nice exponential progression. To max out an item, 16 rune stones can be put in the first slot, 16 of one gem in the second, and 16 of another in the third.   While being able to create my own weapon and armor was pretty damn cool, there's a hefty price to pay for doing it yourself. Without any extra bargaining or forge skills (unique to the dwarf), the act of creating an item can be more than the sum of the prices of the parts. It's not easy to try out one weapon for a while and swap the gems to another, either. To get the gems out of an item, you need to pay Bartly to break it down, and all of the rune stones get lost in the process. Then you need to pay him another large sum to put it back together in a new combination or with a different base item.   With such a high price on the workshop feature, there's none of the ability to quickly put gems into items or swap them around to try out different effects. Even worse, I once blew my wad pumping up a crossbow only to get a much better bow a couple levels later that I couldn't afford to put all of my precious embedded gems into. I was stuck with my weaker version when a much better weapon was in my hands, but tens of thousands of gold pieces away.   Gameplay  Tap, tap, tap, tap.... That's the sound that you'll hear for the whole game. The brawler characters will always be in the thick of it while the others will typically hold back and cast spells constantly. This is a hackfest so there are tons of monsters to plow through and this is the core of the game. There is also some conversation and some storyline to follow, but it's really the massive bloodletting and looting that keep the game going. If this sounds like your cup of tea then this is perfect. Sure, not much has changed in the genre since the days of Diablo, but it works well and is still a lot of fun.     The only drawback is that it is difficult to play as a melee fighter and juggle spells at the same time. Since the shoulder buttons are accounted for with blocking and essential health and magic regeneration potions, the spells are accessed with the d-pad. Since the thumb is already occupied in combat by moving the left analog stick for movement, the only option for using multiple spells in combat is to run away, change a spell, and run back. After playing for a while, it becomes a lot easier to have one spell that works well and stick with it, using the others occasionally. This is not a big factor for the heavy magic users since they're usually set off from the main action, but takes some strategy away from the melee fighters. For example, the monk can't easily stun one opponent and then do a sweep to clear the area right afterwards. It takes time to switch and a lot of damage can be done in that time.    There is one other feature of the d-pad and that is the ability to quickly swap weapons. Fighters can set up a ranged weapon, a two-handed weapon, and a one-handed weapon (or bare hands if it's the monk). Tapping right on the d-pad allows for a quick cycling through. The advantage over the spells is that these three weapons are for different ranges of attack and don't need to be mixed up as often within battle. There are also only two or three options as opposed to the spells where there can be five or more options.    As for the difficulty of the game, it holds at a pretty consistent level for the game and then shoots through the roof as incredibly tough in the very end. There are a few subbosses to fight in other worlds towards the end that are surprisingly easy and then the last six levels the game decides to be extremely difficult all of a sudden. This added to the complexity of the game, but if the developers wanted the game to be a challenge it would've made sense if they had ramped up the action gradually rather than keep it consistent and then launch into the stratosphere.     As for the game itself, as a whole and all that, even though this is a more than capable sequel, I can't help but feel like there could have been something more. There is still all of the dungeon crawling action that has worked well in the past and still works here, but there's still not enough that's new to truly keep pushing the genre forward. There could be more weapons and more characters, but the real issue is that the world is still a fairly linear adventure with a steady pace towards the end. There is still a good story involved, but yet little to develop each individual adventurer. We've seen two years pass, but it's still the same game. There is no online option like there was with Lord of the Rings: Return of the King.    If there are going to be more games in this series, and the ending does more than hint at the possibility, then more needs to happen. Branching storylines would be a plus as well as a wider world to explore and truly become more of an adventure than an action game with an adventure skin. If the game wants to become more than a button masher it needs to mix up the action more than just fighting waves of enemies. Maybe then it can truly become a great title.    Graphics  BG:DA2 uses the same engine that Snowblind created for the original. Along with Fallout: Brotherhood of Steel and Champions of Norrath that's being developed by Snowblind, this makes three games coming out right next to each other that are based on the same engine. Of all of these, BG:DA2 is the most ~faithful~ of all of them. There are the same lighting effects, the same water ripples, the same camera even. It's still a quality engine and looks great, but it would have been refreshing to see something new.     Sound  The sounds here have been well done to create its own world. The sound effects are all appropriate and have enough variety to be able to really hear what's going on in the screen. The voice acting is equally as good with all of the sinister voices of the enemies and gravelly voices of the heroic characters. It's almost as if every grizzled war veteran tries to sound like Alec Baldwin these days.Any fan of BG:DA who wanted more adventuring to go through will find it right here. The action keeps up through the 10 or so hours it will take to play through. The workshop feature creates a bit of an added experience and some new weapons to play with, but if the system was opened even further to make the weapons and armor more fluid, it would have been a better choice. The biggest change is the new characters, especially the necromancer who brings some different strategies to the game. If you haven't played the original, don't worry about missing anything since the story doesn't require any previous knowledge. All you need to know is that this game is easy to pick up, easy to play, and a great excuse for wading through legions of monsters by yourself or with a friend.", "date": "Jan 21, 2004"}