{"name": "Delta Force: Black Hawk Down -- Team Sabre", "name_review": "Black Hawk Down: Team Sabre Review", "ref": "https://www.ign.com/articles/2004/01/21/black-hawk-down-team-sabre-review-2", "text": "As cultural tastes change, our entertainment has to keep in step. Arguably, video gaming deals with the most rapid changes of all the industries, since technology moves numbingly fast. We've seen the Doom, Warcraft, and Super Mario franchises move from completely 2D in one release to completely 3D in the one right after. There are subtler changes as well. NovaLogic started out in the realistic tactical action realm with the Delta Force series, and has now found itself far more in the pure action spectrum. Team Sabre, the expansion pack to Black Hawk Down also takes us from narrow, claustrophobic, dense urban combat the jungle and desert.    Sometimes change comes too fast.   One of the primary faults of Black Hawk Down was the lackluster enemy and teammate AI. They didn't take much evasive action, didn't aim very well, and didn't attack with a sufficient degree of self-preservation. However, these problems were mitigated by the immediacy of the enemymeaning, the AI didn't have enough opportunity to show its flaws. They didn't have much room to roam. Urban obstacles had a way of protecting your teammates from getting cut down unceremoniously, and those same obstacles prevented you from doing the same to the enemy. Plus, BHD was set in a hotspot we were already pretty familiar with and the ~hook~ benefited greatly from a high-quality movie and a book.   Unfortunately, Team Sabre has nothing to do with Mogadishu. It also takes place in the near future. It has far, far more to do with the ~Delta Force~ moniker than the Black Hawk Down universe. This is almost like taking the expansion pack to Warcraft III and setting it in Middle-Earth. If you were looking to an addition to the actual BHD experience, you won't find it here.   What you will find is the same game style adapted to open-ended terrain and some New Stuff. There are a few new weapons like the G36E and the PSG1, a semi-auto sniper rifle with 12x zoom. I found the G3A3 assault rifle to have too slow of a rate of fire, but it still packs quite a punch. There's also a new infiltration-oriented chopper, a RHIB (Rigid Hull Inflatable Boat) and a French light armored recon vehicle. None of the vehicles in Team Sabre are controllable, however, in single player or multiplayer. However, there are about 40 new NovaWorld-only maps designed specifically for Team Sabre.     Actually, the game is only semi-open-ended. If you stray too far from the path of your objective, HQ will ask you what's up and request you go back. You have about 5-10 seconds to get back on track. If you do not, the mission automatically ends. There were many times when I wanted to get up on a ridge to scan the area with my scope, as I figure most elite soldiers would want to do when walking through a canyon that's probably dotted with hostiles. But time and again, I found myself having to run back in order to prevent the ~Mission Failed~ screen from appearing. There was another time when I opted to flank a potential ambush zone, and I was skirting right along the outside wall of one of the buildings when I got a warning. Seriously, though, the approved zones were sometimes amazingly limited.   Another problem with adapting the BHD style to an open-ended universe was the length and depth of my sight lines when coupled with a complete lack of scope drift. Armed with a PSG1, a semi-auto sniper rifle with a massive scope and about 200 rounds of ammo, I was virtually unstoppable. I would just creep along open stretches or dash from cover to cover, depending on the habitat, taking my time and watching all the potential angles of approach. When you start firing, they won't really come after you. They won't really home in on your position. They will only call for backup in pre-scripted situations. Shoot one guy, and the one standing next to him crouches down a bit and scans slowly from left to rightlike a sitting duck.   There were two major threats throughout the game, however: fifty caliber gun emplacements and guys with RPGs. Only when armed with a massive dispersal of damage could they make me hesitate and force me to use one of my limited save slots. Interestingly, however, neither heavy rounds nor rockets could seem to penetrate the numerous shanties made of corrugated metal and plywood. Trees were similarly impossible to punch through.    There's another threat that comes with the poor AI, and that's bullets flying at you out of nowhere. Since an enemy who hasn't sighted you has a habit of staying stock still until you're close enough to trigger their proximity awareness, it's easy for them to cut you down just by hiding behind a building or vehicle and waiting for you to pass by without you checking the corner or flanking it far and wide. And I saw a lot of them tucked away in this fashion, when they weren't standing in open ground in the middle of a firefight. Saying that the Colombian foot soldiers aren't good fighters because they aren't professionally trained only goes so far when you find them right in front of you and not firing, blowing themselves up by firing right at the fuel barrel in front of them, and running into a hail of bullets without a flicker of hesitation or fear. When the campaign moves to Iraq, the AI shifts to large numbers of trained soldiers swarming towards you, so the end result is different but not better.   For your teammates, the verdict is even worse, as they are not only professionally trained, but the best of the best. I had one Alamo-type segment where an elite soldier manning a .50 cal on a technical (a pickup truck modified to support a mounted weapon) was firing right into the ground because there was an enemy on the other side of a rise in the road. I had teammates shooting each other at point-blank range because they were targeting hostiles directly in a friendly's path. With the huge number of sight lines that comes with an open-ended environment, this happens all the time. And there are many missions that will fail immediately if too many of your men go down. Like the Alamo level.   I was almost always relieved when their poor pathfinding had them stuck behind a boulder, fallen tree, or building, as I wouldn't have to deal with their poor aim alerting enemies who would turn and fire while I was busy with someone else. I wouldn't have to watch them switch to their sidearm because they'd run out of ammo firing in all directions in near-aimless bursts. Plus, to ensure that your teammates weren't so good that you would find yourself watching the game play itself, their damage capability was reduced to one-tenth of what you could do. As I said before, these problems were evident in BHD, but they were contained by the geography of the battlefield. Not so here.    Another problem that makes previous irritants genuinely frustrating is all the quality military games that have come out in the past year, from Call of Duty to BF1942: Secret Weapons of WWII and Commandoes III, we've seen how entertaining challenging AI can be, and have witnessed how far some games still have to go until the enemies start acting like people. Other games like Hidden and Dangerous II had their fair share of problems, but at least your men wouldn't bum rush into certain death. In BHD, there's no way to tell your men to be cautious or aggressive. In fact, in one early mission, you can't give them any commands at all, for some reason. You can usually tell them to hold, or space themselves farther out or closer together, or to clear a room, and those things are handy when you need to keep them alive.   There were a few times when I had to travel on foot because the vehicle (which is on rails) would proceed to go suicidally through a shooting gallery. The vehicle itself would never explode, even though I could destroy any truck or boat with a few rounds hitting in virtually any area. But my men would be cut down in short order because of their poor aim and the sheer number of people shooting at them. So I was forced to hoof it sometimes long distances, with my elite soldiers sometimes bitching about it like boot camp recruits. The occasional dialogue did help a lot to humanize my squad mates, but it also generally characterized them as trigger-happy Okies. Phrases like ~We'll take care of it~ were delivered with somewhat unsettling eager menace.     The sound overall, however was pretty good. All the weapons were distinctively different, from the cracking rattle of the G3A3 to the echoing punch of the PSG1. Radio dialogue kept me in the role, in addition to the occasional squad chatter. The .50 cal guns and grenade launcher emplacements felt properly powerful. I could have done for some more environmental sound, especially in the Colombian jungle. In fact, this was one of the most curiously quiet jungles I've played in. You'd think it would be nutty with parrots and other birds squawking and chirping, growling predators and hooting monkeys. Of course, too much of this and you'd look around wondering where all the noise was coming from, but a little bit would have gone a long way.   As with Black Hawk Down, multiplayer is the saving grace. Although longer sight lines give you a huge advantage against AI that varies from underwhelming to retarded, the openness of the terrain tends to balance things out when you're facing real people. There are now many more angles and elevations of attack. You can't just climb on top of a building, zoom in on a chokepoint, and wait for the fur to fly. Plus, the minimal recoil on all weapons and lack of drifting aim means people with assault rifles and machineguns can chip away your health from a distance. In the long run, though, the sniper is still too powerful, especially with the addition of the semi-auto PSG1 with a 20-round clip and 200 rounds of ammo.   Plus, with about 40 maps only available on NovaWorld, stat tracking and chart tracking, and up to 50 players per game, Team Sabre has the potential to be pretty darn fun, online. I played dozens and dozens of 32-player BHD games last spring and into the summer, and it was quite addictive. Multiplayer includes deathmatch, team deathmatch, and King of the Hill (where the winner is determined by which team can occupy the Hot Zone the longest). Progressive spawn points are also quite cool, although of course this isn't a new idea, just well-implemented here. The PSPs are well-placed and challenging to take and defend. Maps can also be flipped so that the Red or Blue team doesn't always start on the same side. Team Sabre doesn't quite have the frenetic pace of Call of Duty or BF1942, though that has a lot to do with map design. These are much larger, more tactical maps where it's possible to flank an entire group if you find yourself outmatched or outgunned.   Yet, although the expansion pack is competitively priced at $19.99, there are a couple installation hurdles right out of the box. If BHD wasn't installed in the default directory on the C: drive, the install app will require you to browse your computer for it. Then it asks you to select the game executable in the game's main folder. This last part isn't a hassle, but it is a little confusing, as the app should recognize the file, by all rights. And there's also a required patch you need to see the Team Sabre servers on NovaWorld, but it's accessible through the built-in updater located off the Windows Start menu in the BHD folder.   Basically what you're getting here is some fun, diverting online and LAN multiplayer for $19.99 (for the expansion pack alone, not the full package including Black Hawk Down). The lack of controllable vehicles is a downside, but you also get dozens of maps that can be tons o' fun with enough people. The longer sight lines make for more challenging gameplay, and the large servers allow a dynamic that makes every round a different experience. The single player game, however...it needs work.", "date": "Jan 21, 2004"}