{"name": "Game & Watch Gallery 2", "name_review": "Game & Watch Gallery 2", "ref": "https://www.ign.com/articles/1999/11/24/game-watch-gallery-2", "text": "Before Game Boy there was Game & Watch, a series of calculator-sized single game handheld game machines that often could double as a watch and an alarm clock.  Much of Nintendo's gaming literature in the pre-NES days can be found here.  With Game Boy's continued success, Nintendo was savvy enough to re-release these vintage classics on Game Boy.  After various delays, Game & Watch Gallery 2 finally made it out Nintendo's doors as a launch title for Game Boy Color.  Features:  5 classic Game & Watch games  All-New ~modern~ variations of the original titles  Secret surprises, including a 6th game  For Game Boy and Game Boy Color    Graphically, Game & Watch Gallery 2 can be judged quite simply between two times.  Since the game feature a ~classic mode~ and a ~modern mode~ The graphics from the classic mode, are essentially the same thing as what Game & Watch games release more than a decade ago.  They are primitive, uncomplicated and minimalist in their approach.  The simplicity however has its advantages.  The simple graphics are in fact very stylized and look good enough for you expect them to pop up in a music video or an advertisement.  On the other hand, the color version features a completely overhauled graphics engine.  It has some amazing color graphics, smooth animation and characters from the Mario universe.   Gameplay is when the game starts to jump out at the gamer.  In a time of complicated, emotionally driven games, returning to basics is a breath of fresh air.  There is a save function that allows gamers to shut off their Game Boy system and continue at a later time.  Clearly, Nintendo had the casual gamers in mind.   What's neat is that these Game & Watch title are based largely around a simple task, making the five games (Chef, Helmet, Vermin, Donkey Kong, and Parachute) incredibly easy to pick up on but with the varying difficult levels, they are also difficult to master. I have yet to unlock the hidden sixth game (ed. note: Shame on you, Dex).  Often times, color versions add a significant twist to the original ~classic~ versions to keep the same game fresh.  In Chef for example, gamer takes on the solo role of a chef in the ~classic mode~.  The chef uses pans on both hands to flip chunks of meat, and fish, making sure they don't fall on the ground (where the rats are waiting) or stay for too long in the air (where a pesky cat waits in a green basket with his fork ready).  In the color version, there's a twist.  Yoshi and Princess Toadstool join forces to flip the food.  However, the game demands the gamers switch roles frequently.  Having the Princess flip too much of the food will cause them to overcook and players will lose a turn.   Furthermore, players are encouraged to get high scores and master each individual games.  For every 200 points earned, players earn a star.  Accumulated, these stars can open up ~special~ modes in the game that includes museum, sound tests and the secret sixth game.  To help beginning players, there's even a message board system.  Toad will send gamers hints on how to play each of the games.  After mastering games to a certain point, Toad will also provide tips and hints on the secrets in the game, and when gamers receive these features, he'll send messages explaining their use.    All of the hints given will then be archived in the game for future reference.   Music wise, the game recreates the blips and blops of the ~classic~ Game & Watch games in all their glory.  And with the new colorized versions, a whole new set of composed music is present.  The new music has a nice textured feel that is rather light-hearted and upbeat in nature and helps gamers get into the playing the game.    Overall, I am satisfied with Game & Watch Gallery 2.  I grew up playing the original Game & Watches, and have several original Nintendo Game & Watch games still in my collection.  For me, playing Game & Watch Gallery 2 was a trip down memory lane, but for a whole new generation of games, it represents a returning to the simplicity of past games.  There's no need to sit for that extra five or ten minutes to finish a level, or to reach that difficult to find save point.  Gamers can turn off their Game Boys when they want it, making this title ideal for short trips, or for people who simply want to be entertained and not feel like they are locked into the game for a certain period of time.", "date": "Nov 24, 1999"}