{"name": "Silent Storm", "name_review": "Silent Storm Review", "ref": "https://www.ign.com/articles/2004/01/28/silent-storm-review-2", "text": "Just when you thought you couldn't possibly be surprised by another World War II-themed, along comes on that knocks you on your ass. Such is the case with Silent Storm. It's certainly not the setting that does it; there are far too many games dealing with this period already, as any quick glance at the release list will attest. No, what sets Silent Storm apart is the comprehensive modeling of small-scale tactical action in a turn-based format. In a way, it's not unlike X-COM or Jagged Alliance and the things to like about those titles are the things to like about Silent Storm.   Silent Storm comes with two campaigns, one for the Allies and one for the Axis. Each campaign begins with a single character who serves as your surrogate in the world. Once you complete the first mission, you'll have the option to recruit more soldiers and snipers and medics and engineers from your headquarters. You can equip them with all manner of weapons and upgrade their abilities as they gain experience in missions.   The missions are often of the special operations variety although they include lots and lots of intense firefights. In between grabbing secret documents and hunting down traitors within your own ranks, you'll find yourself involved in lots of shootouts with your enemies -- be they German, British or other. The story itself is a bit silly at points but there's a slight tongue-in-cheek approach to most of it so you won't mind most of the silly parts. There is one aspect of the game that really stood out as ridiculous to me. Since it's kind of integral to the plot, I don't want to spoil it. Just watch out for the suits.   Though the game takes place in turns, you'll proceed in real time as long as there are no enemies nearby. This greatly speeds the pace of the game as you're not constantly having to hit the end turn button just to get back across the map at the end or beginning of a scenario. Once you find an enemy the game enters a turn-based mode while you resolve combat. The characters all have action points that they spend to move, manage inventory, manipulate the environment and make attacks. Characters with enough action points at the end of their turn have the chance to ~interrupt~ an enemy turn and take their actions then. Saving enough points for opportunity fire isn't as easy as it is in a game like X-COM but the wise player will find ways to save a few shots worth of action points between rounds in case an enemy pops up in front of them.   And the AI offers a reasonably tough challenge anyway. AI opponents will frequently take cover and, once things start to go against them, even camp a bit. I thought I was all slick in one mission as I sidled up against a wall and prepared to toss a grenade at the enemy soldiers gathered on the other side. Imagine my surprise when one of them tossed a grenade at me instead. These moments where the AI starts to show some real human ingenuity and initiative make the game particularly challenging and uncommonly rewarding. There are the odd pathfinding problems here and there but overall the AI in Silent Storm is quite good.    Remember the big deal everyone made over Red Faction's destructible environments? Well, Silent Storm takes much the same approach allowing players to completely demolish everything around them. Like X-COM before it, Silent Storm requires you to watch out for (unintentional) collateral damage. Fire blindly into a warehouse full of oil barrels and try not to look so surprised when the whole structure explodes in front of you. Grenade explosions and rifle fire will rip the leaves off of trees, sometimes leaving your target more exposed than before. Toss a grenade against the back wall of a building to make a convenient back door entrance for yourself. Just hope that the enemy doesn't happen to be looking at that back wall when it blows. This even works on a smaller, more detailed level. Puffs of smoke and dust erupt from bullet impacts and, if you shoot enough, you can even shoot small holes in building walls.     Nice ragdoll effects make give the death animations an ironically lifelike effect. Rather than relying on pre-scripted death animations, the game renders each death dynamically based on circumstance depending on what weapon you're using and where the enemy is hit. Seeing loads of bodies laying about in different poses helps give the game a more natural, if slightly macabre, look. On that last note, the game includes toggles for blood if you're concerned that your kid sister might be warped from seeing the consequences of combat.   While we're on the subject of animations, I should mention that most of them are quite good and very natural. Running, crouching and a whole suite of other movements are modeled here. Character models will even climb through windows and over fences as they move around the environment. These extra animations add a sense of spontaneity and personality to the game that would be missing if you could only pass obstacles through doors or gates.   And since it couldn't possibly be one of my reviews without a bit of nitpicking, I'm compelled to point out some of the things that really bring the title down. For one thing, though the overall performance isn't too bad at higher resolutions (at least not for a turn-based game, it isn't), there is a certain choppiness here and there, particularly when you have a lot going on at once.   There's also a serious delay between the time you move the mouse and the time the cursor starts to move on the screen. Dan and I joked that we hadn't enabled the ~Please keep mouse from lagging~ option in the menu screen. At least, it seemed like a joke until we found the ~reduce mouse latency~ option in the menus. A quick check on the ol' box and we discovered why the option was to ~reduce~ rather than ~eliminate~ latency altogether. Even with the option on, the mouse feels much too loose. Since the game is based on reflection rather than reaction, the mouse lag is merely aggravating and not completely disastrous as it might be in a real-time game.   The only other serious frustration comes with the rather long AI turns. I could easily finish ordering my squad of six guys around and then have time to take a pee, grab a drink and check my mail before the AI would finish resolving its own turn. Since this is a turn-based game, the AI opponents have to have their own time to act, and since it's a tactical game you want to see all that they're doing. Still, the lengthy waits between turns are a bit of a bore, even for a turn-based vet like me.    I could go on about the comical voice acting and sometimes monotonous script but, at this point, I'd just be looking for something to criticize. Not like that's my job or anything.  It's great that turn-based strategy games are starting to come back. Sure, it's not a huge renaissance but it's something at least. Given that most of us got into PC gaming based on our love of X-COM, Civilization, Master of Magic, et. al. I think we're all happy to see some quality titles in this vein. That's particularly true on the tactical side of things where the roster of good games is limited to old standards like X-COM, Jagged Alliance and, to a lesser extent, Fallout.I'd put Silent Storm just a step behind those other titles purely in terms of its overall ease of use and the fact that the World War II setting is getting kind of tired. The destructible environments and nice 3D graphics go a long way towards bringing this genre up to speed in terms of technology, of course, and that definitely works in its favor. Since most turn-based gamers aren't as concerned with particle effects and such, the real selling point is the strong and sophisticated tactical system.", "date": "Jan 28, 2004"}