{"name": "American Idol", "name_review": "American Idol Review", "ref": "https://www.ign.com/articles/2004/01/29/american-idol-review", "text": "In a shameless attempt to cash in on the American Idol phenomenon, Codemasters releases a game with the same name and logo, but little of anything else that relates to the show. What's left is a mess that loosely brings together some elements of a game and slaps the logo on top. Fans of the show are better off singing karaoke and watching Simon on TV.   Gameplay  There are three main parts to the American Idol experience: the board game, singing songs, and making a video. After creating a character, playing the board game will help you buy more clothes, sets, and dance moves to use in making a video. Once the video is made, it can be uploaded to the American Idol web site to be voted on by others.   The board game is for one or two players that incorporates simple rhythm games with the quest for being the American Idol. Money is gained by completing a lap around the circular board, doing an interview, or helping out with a charity event. In American Idol it's good to give, but it's even better to give if you're going to get a few thousand dollars. This has got to be one of the first times ever in a game where doing a charity event is a money-raising proposition.   Once you've gotten the money, you can buy better clothes, gear, sets, choreography, or camera angles for more style points. They can also be won by entering into rhythm competitions. Once a thousand style points have been reached, it's off to the American Idol show for the final competition with a final rhythm game showdown. Let me backtrack a bit first and explain this ~rhythm~ stuff. There are a few variants, but they're almost identical. Icons for different arrow directions move around on the screen. When they move into the green rectangle, hit the right button and make points.    After the board game has run its course, and there's little reason to play it more than once, it's time to remake a song. An included microphone allows you to sing your own vocal tracks for one of the 21 songs in the game. There's no scoring for skill here, just the ability to add your own voice. It's a watered down karaoke function that allows you to share your version of this limited selection of tunes.   To bring everything together, it's time to make a video. Dance moves, lighting, special effects, and camera angles can all be laid down on a timeline to create the perfect. Once that's done, it can be uploaded and rated. After that, there's little else to do except for check in on the online American Idol community and rate other videos.    It's all slapped together quickly and the only skill of the game itself is tapping arrow buttons. This can be mastered in about two minutes, making the game repetitive. The sound recording section has a limited selection of songs that will soon be dated. There's also a music video section, but only the most devoted will get to the end of taking care of all the variables. Despite that, a quick look through the videos on the web site didn't show a lot of variety.   Even though this game is named American Idol there is no appearance of any of the celebrity judges from the show. There aren't even the famous Simon Cowell comments that make the show fun to watch. What's here is not much but a sloppy and ugly karaoke game that's bound to be pushed off to the side within an hour.   Graphics  The graphics are low-resolution and surprisingly basic. A 3D graphics card is required to see the character you create dance around the screen. There are a large variety of dance moves here, but they come off looking pretty comical as both the female and male characters are rail thin and look as if they're about to fall apart from flinging their arms and legs about.   Sound  There is some color commentary by the voice actors that could easily be done without. The main appeal is the music as the 21 tracks here are the done by the original artists. Even so, during the board game, only one track is used the entire time. Even though there is a somewhat decent library here (although how James Brown fits with 98 Degrees is beyond me) it gets wasted during a game which could use some more variety. With one track being played and every dance routine being done to that song, it's possible to hear the same song at least a dozen times.The only real function here is the ability to add your own vocal track to some music. With only 21 songs to choose from, this is pretty limited. The rest of the game is repetitive and boring and will only last about half an hour. Save yourself the money and just buy some new CDs to sing along with.", "date": "Jan 29, 2004"}