{"name": "R-Type Final", "name_review": "R-Type Final", "ref": "https://www.ign.com/articles/2004/01/30/r-type-final", "text": "Despite a general lack of excitement in these past months leading up to its release, R-Type Final's February swan song is a sad day for the thousands that grew up with it. Dominating the arcade shooter market since 1987, the series has always been one of the true legends in the videogame world and has gone on to inspire plenty of imitations, clones, and wannabes in the generations since (c'mon now, you didn't really think that Katakis, Abadox, and Xexex were spawned out of nowhere did you?). Needless to say, this last shot at R-Type is quite a big deal -- even if the greater part of today's mainstream may never even have heard of it.   But for those of us who fondly remember our days debating which was better between this and Gradius, the shot to tackle a Bydo legion one last time is a bittersweet responsibility; though its one that's will likely entertain you almost all the way through.   Gameplay  Part of what makes R-Type what it is, is its particular approach to the shooting genre. While it's nowhere near as speedy or varied as the Gradius and Parodius franchises, it's not as frantic and populated as Ikaruga or Mars Matrix either. Instead, R-Type uses a pretty straightforward formula that has rarely strayed from version to version. In short, it's a moderately paced shooter that tests both your reflexes and memory with big bosses, smarter enemies, and plenty of opportunities to embrace the concept of trial and error.   Not surprisingly, R-Type Final stays true to that foundation and provides many of the same experiences here. In fact, other than its visual presentation there's very little new in terms of its gameplay. One fresh aspect that we did notice, however, is that there's a lot more freedom when navigating the stages. As not only will you no longer die when grazing the borders of a narrow structure (with some key exceptions), the levels also offer a multitude of alternate paths and routes. Found only by playing through with particular ships or by destroying specific targets, this environmental variation is a smart way to handle the admittedly underwhelming number of stages (which is only six). Depending on which path you choose, some of these courses provide incredibly quick shortcuts too, while others send you into enemy territory for quite a long time.    For the most part the stage design is decent, though it has definitely seen better iterations in R-Type's past. Other than the third stage when you're fighting the enormous Bydo warship (yes, THAT Bydo warship), however, there are very few opportunities to navigate difficult crevices and cramped spaces. The result is a smaller challenge than what we were expecting (at least in terms of ship control) and veterans with quick fingers will likely sail through it in 90 minutes or less on the normal setting. It's not necessarily a bad thing if you're a newbie to the genre or are playing on the higher difficulty settings mind you (the ferocious enemies definitely pick up the slack), but having to navigate some truly perplexing mazes have always been one of the most rewarding skill-based challenges in the R-Type universe.   As we mentioned earlier there are multiple ships that players can select from before starting a mission with more than a 100 in all. Taken from previous R-Type titles, created from scratch, and poached from other shooting games (which ones we'll leave as a surprise), these extra craft add a lot of strategy to what's primarily a reflex-heavy exercise. Granted, some of them are extremely similar in how they handle, move, and look, but no two ships are exactly the same and offer slightly different advantages from drive to drive. Further separation between the vessels can be achieved by customizing it at the launch menu -- as cockpit color, chassis pigment, secondary weapon type, and helper bit (satellite) can all be changed and manipulated based on what you've unlocked and what the limitations of that particular ship may be. This aspect alone adds a lot of replay value to the experience and guarantees that everyone will find a ship they like; regardless of tastes.   The only real problem with finding the ship they like, however, is taking the time it takes to unlock them in the first place. Requirements for uncovering them can get pretty steep and there aren't any hints or clues as to how to find them. This could put off players who want to get everything and get it quickly pretty easily, but at least the game itself is a blast to play; offering challenges for users no matter what their skill level is (the enemy A.I. in the higher stages is both smart and merciless). Strangely, there are some instances in several areas where there's a 10 to 15 second lulls in the action where nothing happens at all. It's a bizarre little crimp in the action, but on the shooting fans will no doubt enjoy the game anyway.    Graphics  Irem has spared no expense in taking advantage of the PlayStation 2 hardware, and R-Type Final proves it. Practically everything on the screen has some kind of lighting effect, with explosions, animations, and even morphing effects constantly happening. The backgrounds especially are particularly inspired with some great interpretations of the future and plenty of subtle touches to keep you noticing hundreds of times. And while Final isn't as colorful as the upcoming Gradius is, its varied palette makes terrific eye candy. Epileptic fits could be a possibility.   Unfortunately all this color and action comes at a price: slowdown. Particularly bad in the third stage but noticeable in all of them, the lagging framerate can get pretty troublesome. We know that it's always been a trade-off in this genre for sure, but with the advent of new technology and games like Bangai-O and Mobile Light Force proving that slowdown isn't always the rule, it's pretty disappointing to run into it here.   Sound  While the music is definitely solid (especially the slow, symphonic bits) R-Type Final's soundtrack is still surprisingly weak compared to some of the other games in the series. Mostly electronic in nature, it seems to lack the organic energy and proper mood that drove the prequels along so strongly. Some might be interested to know that In some areas of the game the score boasts the song ~Piano Smasher~ from Blue Man Group (more information on which, can be found in this article at IGN Music), but even that didn't particularly strike us as a defining moment. Though we do have to mention that Stage 3's ominous Goth tune fit right in and stands out as the best track on the list.   Sound effects fare much better and offer up a nice variety of different gunshots, explosions, and metallic clangs. The sheer number of different audio snippets is pretty impressive really, and is probably the most we've heard in a game of this type in a long time -- if ever. Too bad it doesn't support Dolby Pro Logic or another form of current-gen encoding, though. The sound effects would have sounded even better if it had.Shooting fans and old school gamers are likely going to fall in love with R-Type Final the moment they play it -- even if its gameplay aspects aren't exactly cutting edge. But cutting edge isn't really what it's supposed to be. In all truthfulness, it's designed to be an ode to the games that came before while being as faithful as possible to the fans that helped make the series what it was in the first place. Except for the slowdown part. We're pretty sure the team didn't want to bring that particular aspect along with them.Technical hitches aside, R-Type Final has plenty to offer its interested parties. From the game's alternate paths and armada of ships, to its in-depth information gallery and bizarre CPU vs. mode., shooting fans have just about everything they're looking for. It's not a perfect game by any means, but it's a deep and entertaining tribute to one of the greatest shooting games of all time. We're glad that Irem couldn't say goodbye any other way.", "date": "Jan 30, 2004"}