{"name": "Shark Hunt", "name_review": "Shark Hunt", "ref": "https://www.ign.com/articles/2004/01/31/shark-hunt", "text": "Sorrent's initial catalog was chiefly comprised of sports offerings, but in recent months, the prolific publisher has diversified. It's latest effort could technically be considered a sports game -- that is, if you considering hauling in 400-pound sharks a sport.  Features:  Several coasts to fish from Six different sharks to catch Surprise hauls  Shark Hunt is not the first fishing game we've seen on a cellphone, but in our market, it is by far the best. Instead of trolling shallow waters, lazily hunting bass, you're sent out into seawaters to pull in the most vicious quarry: sharks.  Choose from a few different coastlines to start the hunt: Sydney, San Francisco and South Africa. Each location looks decidedly different, as you can always catch a glimpse of the coast off the horizon. Then you're given a weight and time requirement. To win, you must haul in the heaviest sharks during a specific time limit.  Once you hit the water, the clock starts ticking. The game challenges you to haul in all of the different sharks before time's up. And doing so is easy in one regard, yet difficult in another. Shark Hunt is ~easy~ because the control is so spot on. There is a crosshair int he bottom corner of the screen with a small dot in the center. As the shark fights, you must use the touchpad to maintain the dot's position in the center. If it strays too far for too long, your line breaks.  Now, here's where it gets hard. These sharks have no intention of rolling over and taking it. They fight and thrash, working overtime to prevent you from meeting your weight goal by the time limit. And that's even if you get one on the line. You must bait the sharks properly and chum the waters if you want their toothy attention. And if you like, you can turn on your phone's vibration so you really feel that nibble.  Of course, it's not just sharks you can bring in. If you're lucky, you just may catch a rare mermaid. Or you may land a prehistoric shark that turns your boat into kindling.  Shark Hunt certainly is a pleasing boat trip. Sorrent did a nice job with the shark renders, and the mermaid ain't too shabby either. The coastlines look nice, too. There is a great little theme that starts the game out, but then it fades into ambient sounds -- such as waves and casting.A very amusing distraction, this Shark Hunt. While I doubt Sorrent is going to pull in anybody other than the angling crowd, non-fishermen might still find some good entertainment here. After all, I'm sure it wasn't just hardcore sportsmen that bought SEGA Bass Fishing on the Dreamcast.", "date": "Jan 31, 2004"}