{"name": "Bottom of the 9th 1999", "name_review": "Bottom of the Ninth '99", "ref": "https://www.ign.com/articles/1998/09/03/bottom-of-the-ninth-99", "text": "The final PlayStation baseball title for the 1998 season comes from Konami under its own Bottom of the Ninth series. This new version doesn't introduce anything spectacularly new to the genre, instead being a very standard, uneventful game.   Bottom of the Ninth 99's batting and pitching engines are pretty intuitive, and in fact it really isn't that different from all the rest. Pitchers select a throw, and aim into the batter's box by sliding around the cursor. Batters must move their own cursor to match where the ball will end up. And if powerhitting is selected, the cursor shrinks, making it harder to make contact with the ball.  Fielding is performed a little differently than the rest of the baseball games out there  the buttons on the pad have been mapped as bases. For example, if you wanted a runner to advance from first to second, you'd hit the triangle button (corresponding to Second Base). Same thing on defense  simply hit the circle button to hurl the ball to first, the X to home, etc. It's a little awkward if you're used to the one-button action of most of the other baseball games.  The biggest deal about Bottom of the Ninth '99, obviously, is its lack of MLB license. The game has the Players Association, but it doesn't have the real Major League teams  just the name of the city they play in.  Stadiums are rendered as closely as possible to their real-life counterparts, but without the license you can't really play at Fenway, Wrigley, or the Vet  it's the generically named Boston, Chicago, or Philadelphia. Luckily each of the parks have the stereotyped features that make them their own (like the Green Monster, for example), but they're not as detailed as they could be.  On the plus side, the framerate keeps up at a very smooth pace, and players flow with excellent motion-captured animations. But it's not a surprising feat, since the graphics really don't seem to be pushing the PlayStation hard at all.  Play-by-play is always a great little gimmick that adds to the atmosphere of sports games, and surprisingly Bottom of the Ninth '99 has impressive commentary. In fact, it doesn't distract or call attention to itself, either.    The commentary blends in nicely with the gameplay, never repeating hokey catch phrases or lagging behind in a quick play. Crowd noises, on the other hand, are pretty substandard, almost to the point where you'd describe them as ~white noise.~ Occasionally you'll hear a random whistle or cheer from out of nowhere, but don't expect to be whisked away to the ballpark through the audio effects.  Bottom of the Ninth '99 does have a few features of its own, including Scenario Mode. Konami picked 20 different games in progress to jump into, and they each range in difficulty from one to five stars. You can take over for Atlanta at the bottom of the Eighth when they're down by two runs, or hop into a SF-LA game gone into extra innings.  There's also a pretty cool practice mode where you can hone your batting, fielding, and pitching skills without worrying about screwing up a season game. Baseball games have always had a place in my games library, and it's always great to play a new one to see what innovations game designers have come up with. But in Konami's case, there's just nothing terribly exciting here. It doesn't have the real teams or real fields (but accurate depictions of them). It's slower than the rest.The computer's offensive AI is terrible  it sometimes gets snagged up because it didn't make the runners stay behind on a fly ball. Sure, it makes for an easy couple of outs if you're in the field, but this kills the realism of the game and makes single player sessions less palatable. The game isn't very fast-paced, and it just doesn't have a certain spark of energy that makes it fun. The first time I played this game, my game went into extra innings without scoring a single run. We all know baseball isn't the most exciting sport around, but that session was downright dull..  There really hasn't been an end-all baseball title on the PlayStation this season, unfortunately. Bottom of the Ninth '99 isn't terrible, but it could have been much better.", "date": "Sep 3, 1998"}