{"name": "Airport Tycoon 3", "name_review": "Airport Tycoon 3 Review", "ref": "https://www.ign.com/articles/2004/02/06/airport-tycoon-3-review", "text": "Every once in a while, a game comes along that makes me miss the features of another game in the genre--features that I took for granted or hardly ever used. I found myself reminiscing fondly on the Sim City games, pretty much the franchise as a whole, as I ~played~ Airport Tycoon 3. Although AT3 gets points for actually having an interesting setting--in theory--the execution not only leaves something to be desired, but is often downright numbing.  I imagine the makers of better tycoon sims wrangled extensively over the matter of price scaling and chronological pacing, or at least didn't apparently go with the first scheme that popped into their heads. AT3 is a rather slow game. In fact, it wouldn't be too far of a stretch to call it ~completely static.~ It takes about a half an hour with AT3 at the ~fastest~ setting to go through one year of game time. Of course, this kind of thing is relative if a lot of things are going on, right? So what if AT3 is modeling every single minute of every single day of every single month, as long as we're kept busy?  Unfortunately, there are not a lot of things to do. You will be offered a few airline contracts a year--it varies anywhere from two or three a year to nearly one every month, with no apparent pattern I could detect and thereby massage to my advantage. Once you have secured the airline contract, you will arrange sub-contracts for each individual plane. Actually, ~arrange~ is an overstatement with the subcontracts, as you cannot negotiate terms (and your counter-offer seems to be almost always ignored every time they return to offer again). You can adjust how much you want to charge the airline for general cargo shipments, passenger flights, and live cargo, parking and landing fees, plane maintenance, and you can even charge parking and landing according to the size of the plane, distributed among five weight categories.  But the airline doesn't care what you want. If you decline the offer, they return soon enough with the exact same original terms, take it or leave it, no matter if you're a podunk, backwater airstrip or a mighty international transit hub. Plus, the airline contracts stretch across several years and the game is set by default to auto-renew, so you can be stuck with them for hours of playtime. Want to start attracting bigger carriers to make more money? You have to make room by denying older contracts and losing money in the short term. And once you've completely shifted over to a higher grade of contracts, you can't get rid of the old airstrip. You have several to choose from as the game progresses, and they are not cheap, and each one only supports a certain grade of airplane. God forbid I consolidate all my flights onto the newer airstrip, clear off some space, and get some partial money back from demolishing, as you do with all other buildings. Oh, except for the passenger terminals, you can't demolish those either. Or the cargo terminals.    Speaking of space, many objects like the airstrip and terminals appear to operate on a different, invisible building grid that doesn't line up to such a fine degree as the other objects. Sorry, you cant build your new terminal so that it lines up perfectly with this new road. But if you wiggle your mouse a little more this way, where you don't want the terminal, then its bracket goes from red to green. Yay. Oh, and with many buildings, you have to lay the road down before you place it. Don't ask me why. Many buildings can only be placed on ~apron~ roads, the employee-only paths inside the airport itself, except for the police station. That doesn't need a road at all. You can place it in the far corner of the map, miles away from anything, and it will still be completely functional. Same with the administration building you need to create in order to get your contracts in the first place. The fire station, however, must be placed on an apron road.  When I spoke of Sim City earlier, I was talking about longing mostly for the coverage maps that showed you how well your police and fire department were covering things. In AT3, if you don't keep an eye on how many stations you have (and it doesn't matter where you place them), then disaster strikes. It's an extremely frustrating black-and-white division between hunky doriness and a bomb going off in the airport that makes every single customer at the airport immediately disappear, only to trickle back at AT3's customarily agonizing pace.  But let me get back to price scaling and the larger strangeness of the game's economic model. It costs $20,000 to plant a palm tree. Yeah, it's a big palm tree, but still, it just feels wrong. Especially when you must pack these things in everywhere to increase your airport's rating, depicted by to arcane symbols on the upper left-hand corner of the screen. One is a happy face with a number next to it. The other is an icon of a control tower, with another number. There is no indication in the pamphlet-sized manual or non-interactive slideshow ~tutorial~ of what scale the score is operating on. 1-100? 1-1000? How do I improve it? How do avoid making it dip? According to the tutorial, I need to build things, increase air traffic and raise customer satisfaction. Hey, thanks for clearing that up!      As with other poorly-documented games, success is a matter of often frustrating trial-and-error, rather than ~discovery.~ What I discovered is that I had to spend $1 million on a ~plane maintenance building,~ which gave me access to refueling and catering contracts. I assume ~catering~ refers to the food served on the planes, but one can never be too sure, as you could also adjust the price for ~catering~ in the terminal. As the game ~progresses,~ (i.e., as I force it to give me more options by ~discovering~ how to play it), I get more and ~better~ refueling and catering contracts rated by stars and differing in price. I need at least two star-rated refuelers and caterers to attract the bigger airlines, and three star-rated outfits to bring in the heavyweights. But there is a big problem here.  The prices mentioned don't seem to be what I am actually charging the airplane for refueling catering, but rather what the provider is charging me. As I upgrade the providers, my profits, generally at a pace that resembles a melting icicle in Spring, begin to dwindle to invisibility and things will even creep down alarmingly. If I go back to cheaper contractors, my big, expensive airlines start dropping off like flies, leaving my airport empty in short order. So what is a guy to do?  In the long run, there is no point in bait-and-switching an airline in order to keep money coming in, due to the price scaling and time scaling which, in Voltron-like combination, come together to create a force of mighty boredom rivaling that of a C-SPAN oversight committee marathon. I was lucky to pull down ten thousand dollars in one day, which is not impressive when you're two and a half million dollars in the hole and must thereby sit and do nothing but stare at the screen for the next 20-25 minutes if you want to see positive numbers.  The funny part is that you can be two and a half million dollars in the hole and still buy things. Three and half, four and half, et cetera, but it stops arbitrarily at five. It's as though the game is saying, ~You owe four point nine million dollars? Hey, we've all been there. Here, go buy a palm tree. But five million? That's outrageous!~ Why not make it so that I can't buy things when I do not have money? Or at least allow me to take out a loan like so many other tycoon games do.  Anyway, let's talk about other things, such as graphics and sound. AT3 pimps the Renderware engine, which produces some fairly impressive effects for a budget-oriented title. You get night/day cycles, rain, fog, and vehicles running around all over the place. The three speed settings have no effect on vehicular movement, however. In fact, the vehicles seem to exist only as pre-scripted events that go along with having a specific building. If you lay down a bus stop, buses will go in and out--even if the building stats reveal that no one is actually using the bus stop. Speaking of bus stops, the game seem to be eternally dissatisfied with the number of stops I laid down. I put down about fifteen of them at one point, close to the airport entrance and all properly connected to the road, no one used them, no one continued to use them, and the game constantly complained that I didn't have enough of them. The cargo terminal, even when completely empty, had trucks going in and out of it at all hours of the day.  Sound was pretty basic. You get one techno-ish track that loops inconspicuously enough but eventually becomes pretty monotonous. You can turn it off, but the game becomes almost completely silent as a result. Putting the camera close to vehicles, terminals and planes produces the proper environmental noise, but it all consists of short loops. I really can't recommend AT3 on any level. It's mildly diverting at best, but is mostly just irritating and monotonous. Most of the time, I felt like I was playing a project rather than something that was meant to be a game that people would want to buy and play and not use as a coaster after a few hours. The game does a surprisingly decent job of keeping you updated on the things you need to do to grow your airport, except when it's telling you that you don't have enough bus stops and not telling you that your police coverage is so insufficient that a crime is about to occur that will cost you hundreds of thousands of dollars in damages and will make have of your clientele immediately disappear and not come back for another year or so of gameplay. The building upgrades are unveiled begrudgingly and seemingly conjured by satisfying a number of vague and tediously-achieved conditions. The economic outlay is painful, as even the most basic setup will leave you barely in the black, and profits come a long so slowly that it can take hours to make enough money to buy even the cheapest building. If only this game had gotten some kind of independent assessment before it was feature-complete, we might have had a compelling addition to the tycoon sim genre.", "date": "Feb 6, 2004"}