{"name": "IHRA Drag Racing 2004", "name_review": "IHRA Drag Racing 2004", "ref": "https://www.ign.com/articles/2004/02/07/ihra-drag-racing-2004", "text": "With the arrival of IHRA Drag Racing 2004 on Xbox it instantly became clear to us why this sport has been banished to the wee hours of the morning time slot on your second or third favorite all sports television network. Whereas NASCAR videogames at least give you the periodic thrill of turning left as you make your way around the track, the sport of drag racing keeps it real by only demanding that drivers be able to manipulate a high performance vehicle in a straight line. Right now you're saying to yourself, ~Self, that sure doesn't sound like fun.~ And we're here to tell you both you and yourself are absolutely correct. It's not that IHRA 2004 doesn't capture the essence of the motorsport. It's that there are so many exciting things you can do with an Xbox controller than play an unappealing videogame representation of this sport. There's a reason why most drag racing we've done in videogame to date have been isolated modes built into more full featured big-time racing games like Need for Speed Underground and Test Drive.  IHRA 2004 features licensed drivers from the drag racing circuit and real auto manufacturers. It's developed by Super Happy Fun Fun, or SHFF for short. We can't help but be a little disappointed that the company's full name isn't Super Happy Intelligence Team after playing a few hours of IHRA 2004. It's that bad.   It's rare that an Xbox game of this era would be handicapped by visuals since Microsoft's machine is capable of pumping out some of the most beautiful graphics on any console. The ugliness of IHRA 2004 is the beginning and end of its problems because we simply can't bear to look at its cars, tracks or game menus for more than a few minutes at a time. We've seen better looking games on Nintendo 64 and PSOne and the playable content was a lot more interesting than drag racing too.   To its credit, this is the most accurate presentation of drag racing as far as we can tell because you have to manage your dragster's engine, tires and other tunable elements to give yourself every advantage in events, seasons and single races. Shifting is obviously crucial, because otherwise there'd be nothing to do in this game other than hit the throttle. Learning to line the front wheels of your dragster onto the starting line with perfect precision is like trying to hammer a nail with a pile-driver, it's that tough. Burning rubber and warming up your tires to the proper tackiness is another skill you'll have to master as you get ready to race head to head. We have no doubts that we're getting plenty of drag racing authenticity with this game, it's just not fun and not pretty enough to matchup with other Xbox games.      If you happen to get caught in a videogame box tossing fight in your local retailer/videogame rental center and IHRA 2004 ends up ricocheting off of your drooling chin, you'll notice the Xbox Live logo strapped across the top of the box. And we're not talking about the crappy little Xbox Live sticker that showed up on Prince of Persia either. It's the full blooded ~Live Online Enabled,~ which in this case means you can download new dragsters into the game. Mike Janis and Terry McMillen have their dragsters waiting for you out there in Xbox Live download land and that's got to be a good thing.   So to recap: IHRA Drag Racing 2004 is bad because of its ridiculously bad graphics, lack of track variety and extremely simple gameplay (because of its adherence to the authenticity of the sport). It's good because there are a lot of cars that shoot fire out of their exhaust pipes, the parachutes that deploy at the end of races and the name of the developer is Super Happy Fun Fun.   Graphics  Blurry and terrible. Most racing games get over visually because there's so little animation with basic car shapes scooting around flat surfaces. These SOBs drive straight so really all you're doing is changing the camera perspective at high speeds. So why in the hell does IHRA 2004 look like a finger-painting flipbook during races? That's a rhetorical question, don't answer. All of the recent technical advancements in videogame graphics like bump-mapping, lens flare or even 32 color paint palettes are totally absent  This doesn't look anything like an Xbox game and that's unforgivable.   Sound  The music is about as appealing as the game's visuals. Mullet-rock is alive and well somewhere in the world apparently and that audience must love drag racing. The engine sounds are basic and the disembodied public address announcer sounds like something from a Capcom fighting game. Blech. Lifting your dining room table two inches off the ground and watching whatever's on it slide off the end would produce more thrills than anything in this game. Don't think about it anymore after you read this review.", "date": "Feb 7, 2004"}