{"name": "Secret Service: Security Breach", "name_review": "Secret Service: Security Breach Review", "ref": "https://www.ign.com/articles/2004/02/10/secret-service-security-breach-review", "text": "When a budget game is a bad one, it usually has problems across the board, from visuals, sound, level design, AI, and gameplay--no painful stone goes unturned. Even great games can stumble in one or two of these categories. The fascinating thing about Secret Service: Secrurity Breach is that it has one of the best graphics engines I've seen, in a budget game. You got bump mapping, per pixel lighting, and stencil shadowing. The lighting actually looks pretty nice. Rays of light peek through some Venetian blinds onto your gun and onto other people,  and flashlights cast convincing shadows. The textures are surprisingly sharp, with brick walls looking fairly realistic even at point-blank range. The character models appear normal mapped, and compare favorably to the grunts in Far Cry. And sound isn't so bad either, for that matter. You get different echoes depending on what surface you're walking on, shell casings rattle onto the ground. Each weapon sounds distinct, if a little underpowered.  Unfortunately, things break down quickly, as we run into the same old FPS problems gamers have been dealing with for years.  First is the AI, which consists of running directly at you, and occasionally running away if they get nicked. They will stand and fire at you at close range and will sit their like sitting ducks while they casually reload their weapons. There's no pretense of intelligence, really, just run-and-gun. They get stuck behind doors, and their weapons will clip through. You can edge around the door and hit them in the arm to kill them. Often they will whip around like ninjas even though you'd given no indication of your presence. Their appearance is generally triggered by proximity, making stealth nearly impossible. A few times you will be ambushed as people jump out of doors that you couldn't open moments before.  The world of Security Breach is full of doors. You'll wander through office buildings, hospitals, warehouses, hotels and more, and the level design seems fairly realistic, if depopulated by innocent bystanders and ridiculously overpopulated by thugs. It's a problem when you want to put a player in a realistic environment, then give them a linear path determined by doors that will not open and windows that will not break. Some doors open into rooms that are completely empty. No enemies, no health, no armor, and no ammo. Why bother?    Aside from a few breakable vases and shot glasses, the world is mostly non-interactive, despite its realistic visual sheen. You can't push a chair, knock over a box, flip a light switch, shoot out a tire, or dent an aluminum garage door. I can't expect a budget game to have a realistic physics engine, of course, but by creating a visceral environment yet making almost all objects static and invincible, the end result is a little unsettling, like going through a bad dream. Plus, the latest ATI drivers had a conflict with the game that produced some massively ugly texture corruption to the point of making the game impossible to enjoy. The 3.9 Catalyst drivers worked flawlessly, however, and our GeForce cards had no problems using their latest set of drivers.  The worst part of the bad dream, however, is a complete lack of game saves. You cannot manually save even a limited number of slots, and the game doesn't auto-save at certain points of the level. Some levels are broken up into two parts, but even those parts can be grueling. Security Breach is difficult, but it's difficult for the wrong reasons. One is how supernaturally quick the enemies react to you, combined with their dead aim and the fact that they will keep shooting at you even while going through a recoil animation that snaps their head back and makes their gun weave erratically. It's nearly impossible to get the drop on anyone, and it's aggravating to go through the same area time after time and take damage even though you know exactly where they are going to pop out and when. These guys are hip-shooting cowboys. The only sure way to drop someone quickly is a headshot, but this is difficult: As you exchange fire, every hit they register on you makes your aim bounce wildly. To be fair, health and armor are spread liberally throughout each area, but the sheer number of people you will face and their quick draw will still ensure monotonous repetition.  The first several levels of the game also put you into an escort mode, and your charge has little survival instinct, and apparently the idea of him arming himself instead of wandering around like a big, fat target never crosses anyone's mind. I wish I could at least given him one of the numerous body armor suits that littered each map, so that he wouldn't stand in one spot like a gibbering idiot while someone beat him to death with a baseball bat in the midst of my frantic reloading.  The achingly slow weapon reload wouldn't be so bad if I could switch weapons in the midst of it. It also wouldn't be so bad if my character didn't refill the pump shotgun with eight shells every time, no matter how many shells were actually already loaded. And although it's convenient to pick up a full clip of ammo every time I pick up an enemy's gun, it feels a little fake, as does the fact that I can fire my pistol as fast as I can click my mouse, and the fact that the submachine gun rattles off the [i]sound[/i] of three shots at a time, even though I'm only down a single round. Also, grenades can't be held for a certain amount of time, nor thrown a specific distance. Weapons also clip into vertical surfaces, which is pretty noticeable since I'm running up to almost every door to see if it will open. Although Security Breach certainly looks nice with it's surprisingly advanced eye candy, it falls short in nearly every other respect, with the lack of save games being the decisive nail in the coffin. Many levels will climax with a difficult battle introducing new enemies who are tougher and/or carrying meaner weapons that require new strategies. The rocket launcher is especially painful, as one direct hit (or two indirect hits) means you'll be starting from the beginning of the level. As AI pathfinding is also simplistic, often I had to go back all the way to the beginning of the level to grab the guy I was escorting in order to trigger mission success at the other end of the map, since he was often stuck behind a door or another obstacle. You'll wash your hands of him eventually, but the escort section is a long and tedious section of the game. In the end, there's also an overall problem with the game--shouldn't an FBI agent be doing this? Why am I running through this like Rambo? Wouldn't it be a good idea to call for backup? Where are all the bystanders? But the game offers no compelling answers, only waves of simple-minded enemies amid an inability to save your progress.", "date": "Feb 10, 2004"}