{"name": "NFL GameDay 1999", "name_review": "NFL GameDay 99", "ref": "https://www.ign.com/articles/1998/09/05/nfl-gameday-99", "text": "GameDay plays decently on the field, and it's the first football title to do action play across the Internet, but beyond this, it's a pretty spartan port; far too thin to fill PC gaming's glaring lack of a good all-around football game.  The biggest feature of NFL GameDay 99 is its Internet play. Unlike all the other football games out there, with this one, you play across the Internet against other people in action mode, which has never been done before. (Other games have let you call plays in multiplayer mode, but you can't actually control the players on the field.)  Unfortunately, whoever acts as the server has a bit of an advantage. As always latency is a really big hurdle. The best solution is probably for the laggier player to run the server, and hope that evens things out a bit. Even so, the seamless integration of the free server into the game along with the fact that you can play in action mode on the net at all, is a significant achievement for a PC football game.  The game looks fine where it counts--with the players on the field. The players are smooth and believable, and the stadiums are also accurate and attractive. The playing surfaces themselves, though, leave a lot to be desired. The detail seems smeared and watery, and on one computer, a graphic glitch drew big ugly patches around each of the yard numbers painted on the field. The extra players standing around on the sidelines also look poor--a hazy mob of pixels.   The play-by-play commentary by Phil Simms is on target for the most part (considering that most play-by-play commentary in sports games is mediocre at best), but Simms' limited repertoire of pre-recorded insights quickly becomes repetitive.  Playing on the keyboard is pretty useless--you'll want to use a gamepad. Controlling the players is a bit sticky, with players moving off at the wrong angle too easily. If you hit the directional button only slightly in an unintended direction, your player will take off a full 45 degrees askew. This can be frustrating to say the least. Worse, there are also too many arcade-y ~special moves~, things like jukes, stiff-arms, spins and the like--too many, in fact, to even map them all on a SideWinder.  Control deteriorates even further when you're passing, as GameDay PC has one of the more poorly-implemented passing interfaces anyone could come up with. It simply doesn't give you enough information about where the receiver is going to meet the ball. The manual (the worst manual I've seen all year) does nothing to explain this important part of the game. This passing problem comes really close to ruining the game.  Apart from the passing problem though, GameDay feels and plays like a real game of football. The statistics generated by a game--simulated or played out in full--are pretty spot on. The number of turnovers and penalties feels a little low, but there are no glaring holes or inconsistencies in the computer's play calling. And the game is tough. It takes a while to learn how to win. The AI seems to get a lot of help in pass receiving, but not to the point where it completely feels like cheating. These features make GameDay a good title, and if the passing worked, it'd be a great title.  Still, it's no Front Page Sports. All of the teams use the same playbook, for example. This game is definitely not for would-be coaches or dynasty-builders. It is completely lacking in almost all of the real PC sports game options, things like a career mode, Hall of Fame, a modifiable playbook, or even an AI that will accept or reject your trades.  But GameDay never sets out to do that. It's a football action game, with little to no strategy involved. It has gameplay, an authentic feel, acceptable graphics, and for something new, Internet play. For many gamers, that'll be enough.  -- Jason Bates", "date": "Sep 5, 1998"}