{"name": "Raiden", "name_review": "Raiden Mobile Review", "ref": "https://www.ign.com/articles/2004/02/18/raiden-2", "text": "There was a brief window in time where every other game released was a shooter. Whether a side-scroller like Darius or a top-down blaster like Xevious, there were plenty of vids to numb the thumb at a mere quarter a throw. But one series has long stood the test of time -- and even though the fan-fave has not received a proper update a la R-Type Final, it has made the move to mobile: Raiden. It's always nice to see old friends back in action -- especially on the handset platform where classic games can spring back to life in good form. That is, provided the developer has the talents to dust off old faves while retaining the original spark.  Therein lies the main problem with this Raiden re-launch. While it certainly has the bells and whistles going for it -- plenty of enemies, great soundtrack, colorful visuals -- it is nearly struck down by some nasty control issues. Namely, the arcane art of zooming and booming.  See, the way most handsets are currently set up, the phone cannot receive more than one button input at a time. If you're pressing ~7,~ tapping ~3~ does nothing. The same goes for using the touchpad and the number/action keys. If you're pressing up on the touchpad, the phone will not register that you tapped ~OK~ or ~Select.~  Needless to say, if you cannot shoot while moving around the screen in a shooter, there's really no point in playing. In Raiden, the only way to squeeze off a shot is to come to a dead stop -- leaving yourself wide open for enemy fire. This is absolutely deadly to game play. Com2Us tries to offer an alternative, though. Pressing ~5~ turns on a rapid fire mode, where a steady stream of bullets erupts from your nose cone. It's a step in the right direction, but experienced shooter fans actually want control over when they blast enemy ships. It's too bad the control is such an issue, because the rest of the game is excellent. The graphics are very, very nice -- we're not talkin' GBA here, but this is an accurate repo of Raiden. The colors are bright and vibrant, and the sprites are incredibly well-done, from the Raiden ship to the beach-bound tanks.  Also impressive is the game's constant soundtrack. Normally, you get about eight bars of theme music before settling in for the requisite ~beeps~ and ~boops~ of handset sound effects. Raiden just keeps the music coming, preferring to jettison disappointing blaster and explosion sounds. Good choice.  Com2Us also included all of the weapons found in the original, including the basic shot, spread weapon, and laser beams. Of course, you receive these power-ups by blasting the appropriate enemy ships.  There is also good continue feature that allows you to pick up at the level you last completed. And considering how difficult this version of Raiden, what with the control buggering, it's a welcome addition.~Huzzah!~ I exclaimed when I saw Raiden in my hone's line-up. ~Poopy-trim,~ I cried when I played it. The ~can't shoot while moving' problem is a disaster. The rapid fire option helps the healing process begin, but I would rather have full control over my shot placement, thanks. It's sometimes best to blast power-ups when they come in close. Sigh. Hopefully, the next gen of phones will allow multiple command inputs, as that's what really upsets this apple cart, not any negligence from Com2Us, who did an amazing job on everything else.", "date": "Feb 18, 2004"}