{"name": "Caesars Palace II", "name_review": "Caesars Palace II", "ref": "https://www.ign.com/articles/1999/11/25/caesars-palace-ii", "text": "You might have walked into the electronics department of some large shopping complex and notice a game called Caesar's Palace II.  If you don't know what it is, sit back, relax and continue reading. And if you know what it is, sit back, relax and get your wallet ready.     Features: Eight games of chance  Includes several variations Authenticated odds and pay-outs Video Poker, Black Jack, Keno, Mini-Baccarat  Only for Game Boy Color    Visually, it is hard to find fault with the game.  The slot machines, card tables, roulette wheels were rendered with as much detail and as much clarity and color as the Game Boy Color allows.  And you heard right, Caesar's Palace II is Game Boy Color exclusive, allowing developer Runecraft to pack in some nifty digitized and hand drawn art for the menu screens.  This is something that would simply never work on a four shade black & white Game Boy.  In the gambling mode, everything right down to the detail on the cards, the lighting on the roulette wheel and the designs on the slot machines look as good as you would image.  The colors are vibrant and solid.   Everything look as real as you can get on a GBC hardware. The weaker point of visuals was the needless inclusion of an overhead RPG style exploration mode that essentially asks gamers to move from one area of the casino to another.  The casino environment itself was uninspired and proportions were seriously lacking.  Combined with a generic color palette, the overhead mode really brought down, by a notch, the beautifully crafted game screens and interface system in the other parts of the game.  As for gameplay, the fact that the game had this out of place idea of having gamers walk around in an empty casino didn't help.  What would have been more sensible is a menu driven gambling game where gamers can switch between different games with the press of a button, something that will definitely speed up the pace of the game.   The total lack of gamblers in the casino also hurt the gameplay. There is an utter feel of emptiness. There's no one there to talk to, except for the receptionist and security that blocks gamers out of the ~expert~ area of the casino. It is as if the gamer is visiting Caesar's Palace after the Atomic Bomb is dropped on Vegas. The game should have included computer-controlled characters that pop up from time to time to ask for help or a favor.  Like the HAL developed Vegas Stakes for the Super NES, these people could be con artists or just gamblers.  By helping the their computer characters, gamers can get quick cash rewards, or lose cash.  I'm sure the design team can elaborate on this simple role-playing concept and come up with an even more complex system.  The bottom line is that an element of interaction with other characters alone adds a level of immersion that could have made a world of difference.   Moving on to the good side of things, I found that the betting/playing interface in the ~gambling mode~ works extremely well.  There are icons at the bottom of the screen with options such as Bet Unit (let the player set a cash amount for all his/her future bets) and Quick Bet (after setting the bet unit, simply click this button and the computer with place a bet for you).  In addition to these basic buttons, each game will have its own game specific buttons to help gamer carry out other tasks.  Gamers with little experience in icon-based games might need some time to get used to the set up, but in the long run, it shouldn't be a big problem.    Another nice feature is the inclusion of a battery-back-up that allows gamers to save up to eight files.  Quite a nice feature especially if several people in the family are sharing the same game.  However, don't believe what the back of the game box says.  Interplay (the publisher) claims Caesar's Palace II arrives with ~19 games of chance~, well, its actually 8 different games of chance with several games (eg: Slot Machines, Video Poker and Poke Challenge) containing upwards of 4 different variations of the same game.  A nice marketing gimmick, but if gamers can look past the loss, some of the variations are actually pretty neat.     In terms of sound, the game features elevator music.  This is not slamming the game, not by a long shot, but it is undeniable to anyone who listens to a minute of this stuff that the music feels derivative, and lacking.  However, what the sound effects department more than makes up for the shortcomings in the music department.  Everything from the spinning of a wheel to the shuffle of cards were rendered with as much faithful detail as the Game Boy Color's sound chip would allow.  There were even several ~Player Win~ voice samples recorded with different voices to simulate different people.   In conclusion, Caesar's Palace II is a thoroughly enjoyable gambling experience on the Game Boy Color.  While there are gambling games in the Game Boy library, Caesar's Palace II is the first game to truly support Game Boy Color.  This is particularly helpful because there's little need to squint in order to see the screen, and the addition of color makes it easier for gamers to spot cards and speed up playing time.  I'm not a big gambler myself, well, except for Blackjack and maybe the hypnotic gaze of the slots, but I'll have to say this game is well worth your money.  The odds and pay-outs were even ~authenticated~ by an expert!  At least that's what the box says.  Regardless of how real it is, it doesn't hurt to brush up on your gambling skills, especially if you're planning a trip to Vegas or any number of casinos in the reservations.", "date": "Nov 25, 1999"}