{"name": "Wars & Warriors: Joan of Arc", "name_review": "Wars and Warriors: Joan of Arc Review", "ref": "https://www.ign.com/articles/2004/02/19/wars-and-warriors-joan-of-arc-review", "text": "First things first: Trevor Chan isn't known for action games and Wars and Warriors: Joan of Arc isn't likely to change this impression. Though it offers us a type of hybrid of action and strategy that we haven't really seen before (on the PC, at least), the overall execution of the title tends to highlight the incompatibility between the two genres. Since the title is merely the first in a series (the Wars and Warriors bit in the title is a dead giveaway here), there's definitely a lot of room to grow here.   For those who haven't heard, the game offers players the chance to take on the role of Joan of Arc and lead her and the French forces supporting her to victory against the English. The game plays out in a third-person action format, with Joan slicing through hordes of English soldiers, charging through their ranks from horseback, or raining arrows down on them from the top of a lofty battlement. Throughout this adventure, Joan will also have a number of subordinate commanders and rank and file troops as back up.   I genuinely like the concept. Though it's familiar enough to fans of Dynasty Warriors, there's little precedent for this kind of title on the PC. Where titles like Tribes, Battlefield and Savage allow gamers to take on the role of a single soldier in a large melee, Joan of Arc stands out in simulating that same sort of experience in an offline, single-player format. With that in mind, we need to see two things happen here. First, we need to see AI that offers a reasonable and realistic challenge. We also need to see a more focused story than you find in the rather generic conflicts of the online battle simulators.   But that consideration must come after the basic mechanics have been worked out. Joan runs through this world, down city streets, through hilly forests and along sandy shores armed with a sword, a bow and a few friends as backup. The combat system offers two types of melee attacks, light and heavy, with various combinations of each linking together to form combos. Since there are only these two attacks, the combat gets repetitive before the first mission is barely over.   Even the intensity of wading through dozens of English soldiers gets old after a while. For one thing, the enemies are placed so that they swarm you at a moment's notice, placing you squarely in the middle of fifty or sixty enemies. Rather than presenting a challenge in terms of behavior, these enemies are only dangerous to the extent that they can all get together in one giant group and attack you from all sides. The boss characters scattered through the game are similarly uninspired, offering a challenge only to your ability to recognize and then avoid their attacking patterns.    Though there are only eight missions in this game, they're more than enough to fill up a long weekend. The early missions take upwards of an hour or so each to complete, while the later missions can run as long as four or five hours. And it's not like a lot of that time is taken up by puzzles or excessive backtracking. Though there are plenty of objectives within each mission, I'd prefer to see the missions broken up into smaller, more easily digestible chunks. As it is, settling in for yet another three-hour mission is a pretty daunting prospect.   I will say that this approach allows players to approach the various objectives in a much less restricted manner than you might if the individual objectives were part of separate missions. Where you're tasked with taking over a number of towns, you get to pick the order you take them in. The choice to go for one objective before another is definitely compelling but there's rarely enough incentive to make the decision meaningful within the context of the game. I want my decision to go for this particular town to come at a cost.    The levels themselves often arbitrarily limit the paths that a player can take. Small ledges and foot-high fences seem insurmountable to Joan. While I imagine it's hard to manage a two-foot high jump in a suit of plate armor, the fact that Joan can't even cross these seemingly small boundaries just feels wrong. On a larger scale, the objectives are usually connected via thin corridors. Running down city streets is fine, but when the outdoor areas are defined by the same sorts of tunnels and alleys (this time bounded by hills and trees), it seems somewhat artificial.   Though Trevor Chan's real-time strategy game Seven Kingdoms is one of the more original offerings the genre has seen, the real-time strategy aspects of Joan of Arc leave much to be desired. They don't really come into play until the latter half of the game and, even then, it's not the preferred way to play the game. Trying to manage all your units from this high level perspective just means that Joan herself isn't going to be as effective as she might be and, given that she's pretty much the only force that the enemy can't stand up to, you're basically shooting yourself in the foot whenever you switch to the RTS view.   Likewise, the roleplaying elements seem somewhat light. There are four main attributes here -- one for damage, one for defense, one for accuracy and one for the number of troops you can have under your command. Other attributes include hit points and power for your combo attacks. This rather spare approach ensures that anyone who hates roleplaying games won't be turned off by the title but it also ensures that anyone who wants to develop their character in a unique manner will be left feeling cheated. Since the game rewards generalization, it makes no sense to create a character that's just good at attacking or just good at ranged combat.   The game looks pretty but suffers from a lack of lighting. Though lens flares abound, the sense of real lighting is definitely missing from the title and each level seems to take place on a completely overcast day, sunny skies aside. Still, the character models are relatively detailed and distinct. Separating the footmen from the archers is easy enough (one shoots arrows at you, which is a dead giveaway) and there's a distinct difference between the forces of the English and the French. The environments are surprisingly pleasant, offering a fairly compelling sense of reality throughout.    While we're on the subject of the way the game looks, I should also mention that the camera causes a bit of aggravation here, particularly when you're on horseback. And while we're on the subject of horses, the horse itself seems too much like a car, being unable to turn around while stationary. Performing a three-point road turn just to get turned around the other way is simply ridiculous.   Add sound, particularly the voices, to the ridiculous column as well. While the sounds of battle are relatively impressive, their greatest strength comes in their ability to completely drown out what the main characters are saying. The martial music is quite good but it, like the gameplay itself, tends to get repetitive after the first few levels.  I like the concept a whole lot better than the actual finished result. We PC editors have really enjoyed the time we've spent with Dynasty Warriors where the emphasis is more squarely on action and the levels are more comprehensible. Joan of Arc definitely offers something new (or at least rare) for the PC market. As with most new things, there are definitely some significant birth pangs. Given that this is the first in a projected series, we're hopeful that Trevor Chan's team refines the current model and offers up a tighter sequel.", "date": "Feb 19, 2004"}