{"name": "Castlevania", "name_review": "Castlevania Mobile Review", "ref": "https://www.ign.com/articles/2004/02/24/castlevania-4", "text": "Tecmo Mobile proved that with the right programmers on the payroll, a properly-equipped cellphone can indeed serve as NES-emulator. And if UpStart Games can get the right deals in place, they'll soon prove that they, too, have the goods with an incredible recreation of Konami's classic Castlevania.  Features:  NES classic Action platformer Secondary weapons Boss encounters  UpStart currently has one of Konami's classics on North American carrier AT&T Wireless (er, make that Cingular): Frogger. But Frogger is not nearly the tech feat of porting over the multi-level platformer Castlevania. Because that's exactly what this gothic side-scroller is, a tech feat.  Castlevania is a wildly successful, almost freakishly accurate port of the NES classic. The color scheme is dead-on, the control feels right (even the jumping) -- even the trademark whip action is in place. Two of the things we expected to be dropped to fit the game on the phone, boss encounters and secondary weapons (holy water, daggers), are indeed fully in place.  For those who have never ventured into Dracula's castle before in the boots of a Belmont, this wireless wonder is a great place to start. Latter-day Castlevania games have become sprawling affairs where you must juggle items and map out major castles. The original is just pure run-jump-and-whip fun. Simon Belmont is turned loose in Dracula's castle to square off against the undead, like zombies and bats, in a quest to find the great vampire's lair and whip him into submission.  UpStart and Konami have done a superlative job bringing this classic to the itty-bitty screen. Very, very little was sacrificed to get the game in good working order. The handset we tried it on showed off the great visuals and sound. While Castlevania certainly doesn't have the unforgettable tunes of the SNES Castlevania, these are certainly hummable jingles. Wait, is this music and sound effects in the same game? Lordy, we may have the vapors... somebody fetch us the swooning fan.  Control could have been a major issue, considering that you need a button for each weapon -- whip and secondary. Now, you must press up to jump, and while it somewhat limits movement options, the game is set up so that no enemies are just waiting for you to attamept a tough jump to zing you. In short, Castlevania plays fair.  The major change between the NES classic and this port is the lack of real estate on the screen, versus a regular telly. Because Simon has to be big enough to see against the backdrops, as well as his enemies, there is less ~happening~ on the screen. This isn't to say the game is dull or easy, but because there is less room to fit enemies and keep everything in decent perspective, slight aspects of game play have been slightly altered.  Castlevania is remembered for its spectacular boss encounters, and they are faithfully shrunk down for the small screen. Check the screens included for a shot of the Medusa's head battle. There it is, waiting to be cracked upside the head. And the populous color palette separates it from the stained glass window backgrounds.Hopefully, UpStart Games will get an agreement in place so more gamers can get their mitts on this current Europe/Japan exclusive. It's an incredible play that truly advances the ball in the wireless gaming arena. Sure, it's not an original title, but it is a superlative port, proving that if a programmer really wants to squeeze something special out of a handset, he/she can. Castlevania is one of the best wireless games I have played in some time, and I hope you get to play it, too.", "date": "Feb 24, 2004"}