{"name": "DoDonPachi", "name_review": "DoDonPachi", "ref": "https://www.ign.com/articles/2004/02/25/dodonpachi", "text": "Atlus' DoDonPachi does not have the name recognition of say, Ikaruga, Radiant Silvergun,Gaiares, or even Gorf -- but for any shooter freak that has imported this stunning series from Japan knows, this manic blaster is just as good. And now, thanks to publisher/developer Cave, the importer's best-kept-secret is about to be unleashed... in yo' pocket.  Features:  Two difficulty settings Top-down shooter action Auto-fire feature  DoDonPachi is an outrageously difficult top-down shooter, where pattern memorization is all that stand between you and fiery oblivion -- just the way classic shooter fans like it. Your mission is simple: make everything on-screen go boom. And should you accept this mission, you better have the thumb fortitude to go the distance, because the foes of DoDonPachi are nothing if merciless.  The thing is, I just described the arcade and PlayStation versions of DoDonPachi. When this shooter was shrunk down for the small screen, a little something was lost in the translation. All of it can be pegged on two problems, though -- neither of which are Cave's fault. You know 'em, you love 'em: screen size and button inputs.  As we've discussed in other reviews, most handsets cannot accept more than one button input at the same time. They just can't. So you offset this dilemma, DoDonPachi comes loaded with an auto-fire feature. Sure, it puts a band-aid on the problem, but the incessant pounding on the fire button is one of DoDonPachi's charms. You can get away with auto-fire in Gradius because the enemies are a little more spaced out and they don't spit obnoxious amounts of bullets at your ship. DoDonPachi, though, is all about the balance of shooting and expertly dodging bullet volleys. At least, it was.  Now, about the hindrance of the smaller screen. At least handset screen are vertically-oriented, which alleviates the problems associated with porting over side-scrolling shooters. But with less room, you have fewer enemies -- and even less room to dodge bullets. As a result, the game is either too easy or too hard, it depends on how many bullets the enemy craft starts vomiting up.  Neither of these problems absolutely ruin the game. They just prevent this version of DoDonPachi from being the game it could be. And is, in the arcade. But on a handset, forgiveness is forthcoming, and pretty soon you start giving into the game. Because even with these shortcomings, DoDonPachi is still a lot of fun.  When you begin the game, you must pick between two weapons: lasers and scatter shot. Both can be augmented with power-ups (tiny ~P~ icons). When you are struck down, some of your power-ups are released back on-screen, and if you have the thumbs, you can jockey for them again.  DoDonPachi is about combos, too. There is a green meter in the upper-right corner of the screen that monitors the frequency of your hits. Every time you blast an enemy, the meter pops back up -- but immediately starts to drop. If you can keep the meter always lit, you can rack up incredible bonuses.  The boss battles are still quite spectacular, with half of the screen filled with a giant enemy cruiser. A power bar appears on top of the screen, showing how must life the enemy has left. Don't let your retina wander up there too much, though, as the bosses issue forth almost incessant streams of bullets. To survive, you must maneuver your ship through the occasional breaks in the patterns.  This being a shooter, the real judge of skill comes from racking up a high score. The possibilities for points are many in DoDonPachi. Many enemies leave behind little gold stars that add big bonuses to your point total. Naturally, you're going to want to collect all of the stars you see. Problem is, not only is the screen constantly moving, but the enemy ships know exactly where to fire -- death comes quickly for a greedy player.  DoDonPachi looks quite good. It's not the stunner of, say, seeing Gradius on your handset -- but it is certainly better-looking than Square Enix's Brave Shot. Colorful with nicely-sized and identifiable sprites, DoDonPachi is a contender. And Cave also managed to squeeze both a great soundtrack and sound effects into the game -- something that many programmers seem bizarrely unable to do. Also impressive is that soundtrack actually changes when you enter into a boss encounter.", "date": "Feb 25, 2004"}