{"name": "MTX: Mototrax", "name_review": "MTX: Mototrax", "ref": "https://www.ign.com/articles/2004/03/05/mtx-mototrax-3", "text": "Spring is almost upon us and it's time to start thinking about butterflies, ice tea, and dirt. Motocross racing in the dirt, that is. Developer Left Field Productions, Inc. has been hard at work at MTX: Mototrax to provide a down and dirty motocross/supercross/freestyle game. With plenty of experience working on Excitebike 64, Left Field is back to update the genre for the Xbox.    Taking elements from all across the motocross world, MTX: Mototrax provides a comprehensive look at the genre and keeps the action fast and fun. The supercross races have plenty of tight turns to keep things interesting, the motocross tracks have the big big jumps that drive the fans wild, and the freestyle levels provide plenty of opportunities to try out a few of the 100+ tricks in the game.   A couple of the major additions are the clutch that provides plenty of pop and the online racing capability. An even less tangible positive aspect of MTX: Mototrax is the visceral sense of speed that makes the racing that much more worthwhile. With plenty of old and new school music tracks to back it up, MTX: Mototrax is a solid title that deserves to spin for hours in your Xbox.   Gameplay  With bikes that have an effective clutch and the ability to preload and simple controls for both, mastering the basic skills of using the bike takes just a few minutes. Learning to mix up these skills and adjust them for the different races is another story entirely and that's where the skill and the addiction to racing comes right in. It's all about getting the physics of flight down pat and learning the courses so that the hills can be used as launching pads rather than crash pads.     Preloading in MTX: Mototrax is using the suspension of the bike to get a better pop off the tops of ramps and hills. By leaning forward on the bike, the suspension gets compressed and pulling back gives more boost to get more height. This is done by pushing forward and then back or by holding down a button to compress and letting it go to launch. With a preload meter on the screen you can see just how much extra pop you have in the suspension. While it's easy to do full preloads before every jump, getting a slight preload or just compressing half of the suspension is much more useful when timing hills.   Almost as useful, but a lot more fun, is the clutch. By holding down the left trigger, the clutch disengages the gears so that the engine can rev without providing any power. By gunning the engine and then letting go of the clutch, the bike will shoot forward. Speeding off from a standstill is useful for the beginning of a race, but it's the turns where the clutch truly shines. By disengaging the clutch on a turn, the engine keeps going and when you release it at the end of a turn, the gears connect and the bike shoots out into the straightaway.   With the clutch as a powerful tool, MTX: Mototrax provides more options for turns. Normally, riding the berm, the angled edge of a banked turn, provides the fastest route by using the berm to run the bike and prevent any loss of speed from skidding in the dirt. With the clutch there's the option to use the berm halfway or avoid it completely. This adds to the excitement of the turns by giving racers an option if the racer ahead of them is already riding the berm and can't be passed. It's possible for several racers to take the turn at the same time with different methods and makes the threat of a turn becoming a bottleneck a lot less likely.    Beyond the technical aspects of the racing, the feel of MTX: Mototrax helps to deliver the sense of speed. The riders look like they have weight to them and the jumps don't feel like long jumps across the moon with the floaty feel in other racing games. When taking turns and sliding the back tires out to get through faster, it really does feel like dirt is getting kicked up with all the spinning tires.   To get the most personal feeling of all, there's a first-person mode that includes the sight of the handlebars. This avoids the feeling of hovering along the track by showing some of the bike and it also gives a visual cue to show how much the bike is being turned. The most intense experience for the first-person view is doing a backflip and seeing the whole world spin around. In races, the backflip can be used to do a quick look behind you, but for the most part it's a way to add some style to the run and keep the jumps entertaining.    In the Freestyle competitions, the tricks obviously take on a much larger significance. There is a combo system in MTX: Mototrax, but it has nothing to do with manuals or wheelies to connect jumps together like the Tony Hawk Pro Skater titles. Here, completing a succession of aerial tricks will increase the score multiplier. Crash the bike and the multiplier goes back to x1. Repeat tricks and the multiplier starts to go down, along with the value of that particular trick.    The fancier the trick, the longer it will take to execute and the more points it will give. The shorter tricks give less points but more of them can be strung together on a single jump. This way, it's best to get a couple big jumps with a few tricks in each to ramp up the multiplier and then bust out with the big point tricks for a huge score. Just don't get too cocky or you'll end up with a face full of dirt and the 1x multiplier.   Each trick is mapped to a button and directional combo and MTX: Mototrax requires some quick tapping on the controller to pull them off. There is no way to tweak a trick by turning with it or holding it longer, but there are a couple of modifiers. One modification turns the tricks into a one-handed or a one-footed variation while a ~lander~ modifier makes the rider get back on the bike, but with his hands off of the handlebars. Both of these modifiers add more points to the trick's value.     One of the biggest tricks in the game is the backflip and variations upon it. While the instructions told me to push forward and then pull back right before launching off of a ramp, this never worked for me. Instead, right after getting in the air a quick up-down tap and a trick button is what was required. Similarly, the ~lander~ modifier is explained as requiring a trick button to be hit just before landing, but instead it needs to be done right after the trick. After figuring out these tricks on my own, they were easy to pull off, but it left me wondering why they would be explained otherwise.    Races  As for the different aspects of the gameplay there are two different sections that only intersect by contributing bikes and tricks to each other: the races and the freestyle modes which I'll get back to a little later. The races are fairly straightforward with supercross (arena competitions) and motocross (outdoor competitions) tracks. There are eight tracks and four series' for both supercross and motocross, making 16 tracks and eight series in all.    Moving up in the races and getting some first-place finishes rewards you with offers from potential sponsors and new teams. Some sponsors will want you to wear their clothes, while other will upgrade your current bike. Even better is the offer from a new team to race with that will offer you an upgrade to a better bike entirely.    The tracks themselves are pretty straightforward for the supercross tracks that start off with plenty of straightaways and escalate into complicated messes that look like a wet noodle dropped on the ground when seen from above. They provide plenty of work and twists and turns to hone one's skill on for plenty of technical action, but it's the motocross tracks that are where the most fun are.    The motocross tracks are all about the big jumps that require plenty of speed, rhythm, and skill with the preload. There are twists and turns here, but it's timing of the jumps that will launch racers off into the distance towards the finish line. With dramatic launches and  opportunities to fly past a competitor, there are plenty of chances to      Freestyle  There are two parts to the freestyle experience: the Free Ride tracks and the Freestyle competition tracks. Each section contains four tracks. The Free Ride tracks are open areas such as a bayou or a quarry, that have challenges within them that are unlocked by finding different people in the map and talking to them, like in the Tony Hawk Pro Skater games. These challenges can be races through the map, a trick challenge, or a challenge unique to an area, like jumping from boat to boat or riding through pipes.    All of these challenges will award points that go towards unlocking the next map, but it's the trick challenges that introduce new tricks into your library that can then be used in freestyle competitions or the races for fun. Other tricks can be unlocked by finding specific ramps that will make a new trick flash on the screen. Complete that new trick on that jump and it's in your library as well.   While these Free Ride tracks educate the rider about the new tricks and provide a little stomping ground for practicing, they felt too small in terms of overall size and range of exploration. I was hoping for maps that would have plenty of secrets and challenges, but they were over way too soon. After learning the new tricks and unlocking the next map, there was little incentive to keep on riding around.   The Freestyle competitions contain a closed in arena with lots of dirt humps and ramps to launch off of. Each Freestyle map has four challenges as well, but except for the high-score challenge, the other challenges are tutorials that teach new tricks and help with timing jumps. Overall, the Freestyle mode left me feeling a little let down as well, providing only the challenge of getting a new high score, but after placing first for that challenge there was little left to go on.      After completing all of the Free Ride and Freestyle challenges, I wanted to have more to go after, but there was little left to dig into. In the end, the Freestyle and Free Ride modes were one large tutorial mode. While it's great to break in players with this introduction, which wasn't really an introduction, I couldn't help but feel like there could have been so much more.   Graphics  MTX: Mototrax sets a pace of 60 fps and sticks to it. There are a couple of moments, especially on the supercross races, where the framerate will briefly drop for a fraction of a second when the view opens up to a large environment, but since this usually happened during large jumps it's not an issue. For the rest of the time, the 60 fps is a beautiful thing and keeps the action flowing along nicely.    The graphics are clean and colorful and it's easy to make your way around the track and see what's coming up. With the smooth framerate and the easy to read textures, the only thing left to complain about is your own lack of skill as you crash into another hill.    Sound  The nasally whine of the different bikes has been accurately portrayed and that's what you're going to hear for the entire duration of your MTX: Mototrax experience. The crashes have some appropriate thuds and there are some audio cues to let you know if you're not doing the moves just right. That is, if you couldn't tell already by how far you're slipping behind the competition.     The soundtrack is filled with aggressive tracks to ride along with than span the past few decades. Slipknot and Jet provide a couple of modern tracks, but there are plenty of other songs that should make any fan of punk rock happy. The Misfits have a track, Pennywise has a track, even The Stooges are included with their legendary track, ~Funhouse.~ Younger players may not understand what all these old songs are doing here, but they fit right in. Even if they didn't MTX: Mototrax has the option of modifying the playlist to exclude songs that get on your nerves. MTX: Mototrax excels where it really needs to: providing that sense of speed and creating a fun driving system that rewards racers with plenty of skidding and massive jumps. The riders look like they have a sense of weight to them and the tricks look fantastic. With a well-executed online system, racing others on the Internet is a user-friendly experience.The tracks themselves have plenty of twists, turns and jumps to master, but a total of 16 racing tracks is a little small, especially if a gamer strongly prefers either supercross or motocross racing. The Free Ride areas and the Freestyle course give a nod to the world of freestyle racing, but MTX: Mototrax doesn't flesh them out enough to make it a completely worthwhile addition to the game. Overall, MTX: Mototrax provides one of the best places for the experience of racing in the dirt and having it online makes it even better. The racing tracks are fun to ride and with online stats there's a compelling reason to keep shaving seconds off your time. If only there were more tracks to race on.", "date": "Mar 5, 2004"}