{"name": "The Suffering", "name_review": "The Suffering", "ref": "https://www.ign.com/articles/2004/03/05/the-suffering-3", "text": "As if prison weren't bad enough, with hazing in the yard, shanking on the row and brutality in the shower room, imagine having to put down a horde of monsters from the bowels of hell in your spare time. That's exactly what you're charged with doing in The Suffering, a brand new title from Surreal Software and Midway Games.    Touted as an action horror game, The Suffering is the story of Torque, a man sentenced to death for slaughtering his family. The moment he arrives in the prison, as the tagline says, ~all hell breaks loose.~ Torque must fight to stay alive in a pitch black penitentiary crawling with grotesqueries, the whole time exploring the events that led to his incarceration.    When The Suffering was announced, those of little faith were already preparing headlines that equated the name of the game with the experience of playing it. But those premature thoughts are far from being true of the final product. In short, The Suffering is a great game, not just a great horror game. It does effectively what all story-based games seek to doto suspend your disbelief and transport you into the realm of the game. There are jump moments and creepy thrills here that will affect most gamers on a physiological level, and tons more to chew on psychologically.   Furthermore, The Suffering proves that games can be made with thick atmosphere, creepy events and tons of gore without having to cinematically focus your attention on each and every detail. You are able to look around at almost any time (there are only a handful of cut scenes, as most of the story unfolds real time). The game does a good job of leading you where it wants you to look, but if you do happen to miss actually seeing an event, you will certainly hear it, and that makes the experience more realistic, and sometimes even scarier.   The game is not without its problemsvoice acting is spotty, textures are sometimes weak and the frame rate can be suspect at timesbut overall The Suffering succeeds as both a horrific thrill ride and fun action experience.   Gameplay  As we've mentioned, the main idea behind the game is survival in a grueling environment full of phantasmagorical creatures, and the emphasis is on action. It doesn't jump right into the splatter, though. The opening half hour or so of the game is thoroughly eerie, with danger lurking around every corner, and hints of the horrors awaiting you. More than any other part of the game, the beginning grabs your attention and cranks the tension to eleven.   That is, once you make it past the opening cut scene. For some reason, the very first thing we see in The Suffering is the most unfortunate. The obscenity-tainted opening movie is the worst part of the game, mainly because the voice acting is so wooden. More on this in the Sound segment of this review. The problem with the opening scene is that it sets up the back story, a mysterious tale of Torque's previous jail encounters and the savage murders that led to his imprisonment. A better presentation would have made the game even creepier. As is, however, gamers will be left thinking, ~what the hell was that?~ before they delve into the real meat of the game.    Luckily, there's plenty of meat waiting. When the game really gets truckin', it's a frantic, guns-blazing affair through the darkened and decaying corridors of one of the scariest settings in gaming history. The halls of the pen are crawling with evil of every description, and all of it bleeds copiously.    The creatures were designed by Stan Winston Studios, the company responsible for bringing the monsters to life in the Aliens and Predator movies. Each beast in the game is based on a means of torture, and each has its own attacks and AI. The creatures are imaginative and truly frightening for the most part, especially the Slayerwhich looks like Marilyn Manson's head and torso with arms and legs made of swords. This monster has the ability to walk upright, jump high in the air, scuttle on the ceiling, and surprise attack from above with a swinging blade attack. The variation in attacks makes for some pretty intense fights, and trains you to look at every surface in a room.    Other nasties include the Mainliner, a beastie that emerges from puddles of water and blood to attack Torque with needles. Taking a direct hit from one of these lethally-injected monsters will knock the health bar down considerably, and make you temporarily woozy. These chaps are pretty nasty and will have you on your toes whenever water is near. There is also the Marksman, who carries a collection of rifles imbedded in its back, the Burrower, who emerges from the soil and whips Torque with spinning chains, and the Fester, a corpulent monstrosity whose stomach opens, sending rats scurrying at its target. The creature design is definitely cool, and the AI associated with each is unique, which forces you to approach each group differently. The best of the lot, though, is the first you encounter.    There are two options of how to playthird or first-personand gamers can switch between the two at will. This makes the experience doubly rich, and makes control easy to manage. In the midst of a firefight, if you want a little more precise control over the carnage, switching to first person view helps do just that. Likewise, the third person view is most helpful when exploring the surroundings.   The camera is decent, providing a nice range of view without getting trapped behind textures, or tweaking out. Since the gamer controls the look function on the right analog stick the entire time, it feels very natural from the get-go. In addition, the camera maintains a general position behind the character at all times, so it's impossible to get too turned around.   Both modes do a good job of handling combat, which occurs a lot in the game. Fortunately, there is a wide array of weapons available to help you tear through the prison's minions. In addition to the standard shotguns, grenades and such, you can wield dual pistols, tommy guns and TNT. In addition, tying into the story of the game, Torque can enter what is called ~rage mode,~ where he transforms into a muscle-bound beast capable of easily ripping through most of the enemies put in your path. Originally, it seems like a rather cheesy idea, but it feels pretty righteous the first time you hack a monster to bits.   True to its claim of action horror, The Suffering alternates between an atmospheric creepshow and a full-on rampaging shooter. This affects the pacing of the game slightly, and makes it feel uneven at times, especially in the middle portion of the game. Luckily, some cool story elements drive you through some of the down moments.    There are a couple of story lines playing out at once. Bit by bit, the mystery behind the monsters in the prison unfolds. This story gets slightly convoluted and hard to understand at times, but does introduce some eerie villains, including the ethereal baddie Dr. Killjoy, who appears via film-projected images throughout the game. At the same time, Torque is learning more about the circumstances that put him in prison, through snippets of flashbacks and haunting hallucinations. This story element is much stronger, possibly because it is more rooted in reality, but probably because it deals with such a horrific crime.     Getting to the bottom of the crime is partially up to the gamer. How? All of the NPCs in the game contribute to Torque's morality, or lack thereof. At any moment, you can choose to kill someone you're supposed to be helping, and this will help piece together just what kind of person you are. At certain points in the game, especially early on, you are given the option to torture and kill your captors, and this too affects the outcome. Likewise, later in the game you will have the option of showing mercy to some severely wounded men, and this all helps to determine your moral position. Overall, these story elements are the most compelling and the biggest reason (aside from the glee you get from capping monsters) to finish the game. There are several possible endings, and they depend on the choices you make in the game. In addition, once you beat the game, there is an alternate beginning the next time you play through.   For the most part, The Suffering does a decent job of pointing you to the next objective to help you complete the story. However, since there is nowhere in the game to quickly look and see what the next objective is, often times when you leave the game and come back, it's difficult to figure out exactly where to go next. Also, if you happen to miss a vital piece of information, you could be wandering a long time in order to ~guess~ your way toward the right path.    Of course, sometimes the thing stopping up the works is a puzzle. The Suffering generally does a really good job with puzzle elements. Instead of placing gems in statues to open doors, this game provides some realistic problems and solutions to deal with. For instance, in order to put out a fire in a doorway in one section of the game, you have to first turn on the sprinklers in the room, and move a cabinet over the drain in order to flood it and put the fire out. The solution is not always obvious at first, but what fun are super-obvious puzzles?     Overall, the gameplay in The Suffering is varied and compelling enough to keep you playing through the entire ten hour affair. And since you can play many situations differently, and affect how the ending unfolds, it's worth the effort more than once.   Graphics  Graphically, The Suffering is a mixed bag. Some of the better elements have already been touched on in the previous section, most notably the unique creature design and good camera. In addition, the lighting is superb. Since most of the game is set within the prison walls, much of the game is rather dark. Like the Silent Hill games, much of the illumination here comes from a small flashlight attached to your character. This creates a cool ~cone of light~ effect that ramps up the scares.    Of course, a flashlight doesn't last forever, so managing it is one of the gameplay challenges. However, if you do run out of batteries, you will either have to play in the dark (it's a brave game that lets you do this), or throw flares to create pools of flickering light in the darkness. All of these effects are handled beautifully, with realistic shadows that create the dense, untamed atmosphere. Other effects are equally cool. Bullet holes stay in walls, blood sprays from wounds, and Torque gets covered in several layers of crimson after a particularly bloody battle.    What's really important about the great effects, however, is that they help mask some of the graphical problem areas. The textures throughout the game, with the exception of some cool decaying wall and rock effects, are ho hum. While the inside areas are pretty impressive, some of the outdoor landscapes look average. They are better on the Xbox than the PS2, but then again, Xbox fans are used to a bit higher graphical standard.   In addition, all of the human character models except Torque are pretty strange looking. Even the cool creatures, which have unique and horrific designs, are not as well-realized as they could be. And while most of the effects are spot-on, water and fire effects are a tad on the weak side.    Given all the things going on graphically, the game runs fairly smooth, but there are some frame rate hiccups when a lot of enemies are onscreen.  In addition, the game chugs a little when there are water effects, most notably in a shower sequence in the prison.   Still, graphics add up to more than a collection of pixels. Really what they do is form feelings and sensations, and in this case, they help form the experience of this spooky game-- sweaty palms, heightened heart rate, and short breathing.    For those who are interested in specs, the Xbox version of The Suffering supports 480p with a widescreen ratio of 16X9. It looks quite crisp in this mode, and the lighting effects especially look extra-yummy.   Sound  One of the coolest moments in the game occurs in a dank basement hallway early in the game. Although we've already been introduced to the uber-creepy Slayer, a spider-walking humanoid with blades for arms and legs, its arrival in the basement is as cool as horror gets in a video game. Before you can even see the beast, you hear its sword arm dragging against the wall, making a characteristic metal-on-stone sound as it approaches.    When it finally steps into the light, trailing a line of sparks on the sweaty brick, there's a moment of chilly revelation before the fight commences. It's this kind of atmospheric sound that defines the game. Since a lot of The Suffering is about ~things that go bump in the night,~ the sounds have to convey a lot of dread, and they do. All of the sound effects are good, from the chatter and bang of weapons fire, to creature noises. The ~jump moment~ strikes and sounds that accompany the flashing hallucinations that occur are also well done.   The game supports surround sound via Dolby Digital 5.1, and it does a great job of enveloping you in the action. The whole point of the game is to be immersed in this horrific world, and the surround kicks up the thrills another notch. Since much of the sound is directional (facing a person will make their voice louder, for instance), it's quite handy to play in this mode, and also quite a bit scarier.      What isn't all that great about the sound is the voice acting. Especially in the opening cinema, the acting sounds stiff and forced, and the extensive swearing calls too much attention to itself. As the game settles in, and you have only NPCs to interact with, the voice acting gets better. The Dr. Killjoy voice actor gives a delightful performance, and several of your prison buddies also sound authentic. But the language remains ultra-rough throughout, so this is definitely not a game for the under-M set.    Like some of the graphical stumbles, the minor voice gaffes do not ruin the whole experience. Turn the lights off and crank your system, and as with cinematic horror sound, this game will do its work.  In a genre that's overrun with sequels and lame attempts at horror, The Suffering is a breath of fresh death rattle. The action is intense, the creatures are actually creepy, and the story does not shy away from truly macabre elements. One cannot say enough about the horrific world that's been created here. Everywhere you look, every little thing you do, has been placed there to ratchet up the suspense and put you in an eerie state of mind. Technically, the game is fairly sound, but beyond that, something else comes through. These guys know how to scare people, and they're committed to doing so. They've done their homework and applied it to yield an impressive work of terror. What's more, they do it all without fixing the camera, and without shying away from buckets of blood and adrenaline.", "date": "Mar 5, 2004"}