{"name": "Turok: Rage Wars", "name_review": "Turok: Rage Wars", "ref": "https://www.ign.com/articles/1999/11/25/turok-rage-wars-2", "text": "The gameplay of Turok 2: Seeds of Evil is still the subject of many debates to this day. Did the marvelous animations and high resolution graphics make up for the fact that the game chopped up considerably when the action intensified? The whole thing may just be a moot point now that Acclaim's dedicated four player deathmatch game based in the Turok universe is here. Acclaim has come right out and  told us  that Turok: Rage Wars is the multiplayer deathmatch game that they had intended for Seeds of Evil but couldn't manage. Perhaps it was hurt feelings or maybe it could've been simple pride. Whatever the motivation, Acclaim Studios Austin has delivered a nice lean multiplayer shooter that's fun for one or more players and it should be enough to carry FPS junkies through the holidays.  Features  Four multiplayer modes: Bloodlust, Team Bloodlust, Frag Tag and Capture the Flag. Trial (Scenario) Mode -- acts as a glorified training mode for players, catering to the new gamers and challenging the veteran. Play and unlock 14 different characters and mission trees. Two-player cooperative Trial Mode -- play with a friend and choose your battle path. Time trial mode -- players test their skill against the clock. Frag Fest Mode -- players are given specific requirements to meet in order to proceed (you are the Fireborn, achieve five frags -- and you only have a shotgun). 19 Ranks to achieve. 25 player skins to unlock. 50 medals to attain. 17 Playable characters: choose from Turok, Adon, Fireborn, Raptor, Mites, etc. Computer Bot AI allows for up to six-on-one action. Three difficulty levels of Bots. Bot customization (choose character, skill level and team). Weapon selection screen allows players to customize their arsenal and play with weapons they like. Save and load up to four different player stats per Rage Wars game save. Four brand new ~Bot-boss~ characters. 16 weapons including the scorpion launcher, shotgun, crossbow, inflator. Five pick-up weapons, including the infamous cerebral bore, bear traps, mines and even robot sentries. Universal power-up pick-up gives players one of 13 different abilities including invisibility, teleport, stone skin and force empathy. 36 unique multiplayer maps. Gauntlet mode allows players to partake in several maps in a series of instead of one-by-one.   Gameplay Perhaps Rage Wars is so enjoyable because it doesn't try to hide what it is. Like Clint Eastwood's character from Unforgiven, this game, rather than trying to ignore its violent nature, goes the other way and revels in it and uses it to its advantage. Many games encourage you to kill and avoid being killed. RW teaches you that killing his exactly how you avoid being killed. After all, if your enemies are off somewhere re-spawning, then they can't be shooting at you now can they? There's no puzzles to solve, doors to unlock or keys to find in this one. Just put your crosshairs on 'em and squeeze the trigger.   You'll recognize the controls from previous Turok games and that only helps you jump into the game even faster. One slight difference is the use of secondary weapon functions with the B button. Even with all of the Turok 2 framerate problems worked out in this one, it still would've been awfully boring with the same old weapons and powerups. The secondary weapons are a wonderful addition and add a whole other level of strategy to the game. Expect to see secondary weapon functions in many console first person shooters to come.    The Tools of Destruction  Mag Pistol: Made popular by super constable, Robocop. This weapon fires conventional bullets in short controlled bursts. When you use its second function, a laser targeting system with automatic tracking will snipe anybody nearby. The only catch is you can't move when you use it.  Plasma Rifle: Superheated energy rifle that did wonders against those aliens from the original Turok. The second function is a rapid fire sniping mode that can even the score very quickly. Minigun: Jesse Ventura's favorite. The spinning barrel of this harness-mounted machine gun has become a familiar and treasured sight in most shooter games. The second function gives you a shield for a limited time that you can still shoot through, but the enemies can't. As Bill Duke said in Predator, ~It's time to let Ol' Painless out of the bag.~ Shotgun: Great rate of fire and powerful shots will make this a trusted favorite. Its great second function feature will allow you to pump and load 4 shells at once and shoot them rapid-fire style. Only thing is, while you're standing there pumping the handle you can't shoot. Freeze Gun: The regular shot ricochets and cools your opponent  down so that they move a little slower. The second shot will freeze an enemy directly or, if you miss, it will place a freeze mine on the wall or other surface that will freeze bad guys on contact. Assault Rifle: This quick machine gun isn't powerful, but its rapid-fire second shot function is great for bombarding your opponents with countless shells. The regular shot is a semi-automatic one-shot-at-a-time attack.  Crossbow: Rage Wars version of the old bow and arrow set up. The crossbow looks really neat when it fires it's primary charge. The second function attack is a focused sniper beam.  Flare gun: A dandy little weapon. Not only do the charges stick to walls and light up dark areas with a cool green light, but they'll give off a slight dose of radiation to anyone that comes close. Shoot a couple of these on the wall while someone is chasing you and they'll be off your tail soon enough. Its secondary function is a bigger pinker version of the primary function except it really lingers for a long time after you set it. Scorpion: Oh, yes. The rocket launcher we love to hate is back and bigger than ever. There's only one rocket at a time now and your character actually moves slower when you're carrying it but it packs the most devastating punch in our opinion. The secondary function is actually two in one. You can place a magnetic marker on a wall or other surface that will either attract or repel a launched rocket. The flight pattern will be affected but only slightly. Boomerang: Another conventional blade weapon to go along with the crossbow. The three pronged 'Krull'-looking weapon of course returns to your hand after you throw it. The secondary function allows you to send your enemies into slow time where they move extra slow but the rest of the world continues on in real speed. Warhammer: This rocket propelled hammer lets you whack the snot out of bad guys. This is a default weapon that all players will have and although its regular attack isn't too powerful, the secondary ~charge~ attack makes a nice, frightening sound.  Grenade Launcher: This will be another weapon that will frustrate your opponents. These grenades move very quickly and ricochet all over the place. With the tight confines of Rage War levels, mastering this one will be key. Its secondary function simply has the grenades blowing up on contact instead of being timed.  The Napalm Gel: This gun has its primary and secondary functions fully integrated. Squeezing the trigger shoots explosive canisters that will immediately stick to whatever surface or enemy they come into contact with. Hit the B button and they explode. So charming. The Inflator: Think Dig Dug without the cable. You can use this wicked thing to make your opponents grow in size. You can shoot them continuously and cause them to explode, or just make them really huge and let them live as the biggest targets in the game. One of the ~humiliating~ class of weapons. The secondary function automatically pumps the bad guys up as big as they can get without killing them.  The Emaciator: This looks like the Firestorm from the original Turok. This vile device will shrink your enemies by draining all of the juice out of them. The primary function when used quickly is quite effective. The secondary function does the same thing faster and in a bigger area. The Chestburster: Ah yes, another Aliens inspired gun. You check your gun and see that there's a little critter in blue liquid loaded in the chamber. You aim, fire, connect and forget about it. Meanwhile your victim knows he has been hit, but hasn't lost any health and so continues on his merry way. That is, until a few seconds later when an extraterrestrial embryo fights his way out of the confines of his body towards sweet life-giving light. The embryo shot is actually the second function of the weapon and the only one that matters. The primary shot is just a quick little blue stinger shot that you probably shouldn't even bother with. Why use that wimpy shot when you can shoot an alien embryo for crying out loud!? The only reason why you wouldn't use the Chestburster early and often is if you haven't taken the time to earn it in the scenario mode.   All of those weapons can't be used at the same time in Rage Wars. This is by design because the game forces players to learn all weapons, become proficient with them and develop their own fighting style. In the multiplayer games you only get to pick five and they're grouped into rough categories of energy, explosive and bullet round weapons. The ammo types are located in set areas through out the levels and you will have to visit these spots often if you want to succeed. You will have to make some tough choices about whether to take the flare gun over the plasma rifle. Each has its advantages but the function of each can also be duplicated in both the bullet and explosive round weapons. Layers of strategy like this are just so valuable especially in a game that could've easily degenerated into a mind numbing shoot 'em up.   That's quite a line up of weapons -- but Rage Wars also includes Power Core pickups that will give you a variety of temporary powers like invisibility, slow time (it's like the Twilight Zone where everything slows down except for you) or regeneration. The Power Cores are extremely valuable and frustrating because you never know what you're going to get. Also they're one of the ways that you can avoid having your chest ~bursted.~  Also, reports of the demise of the Cerebral Bore have been greatly exaggerated. It's a one time, one use pickup just like the Iron Claw (beartrap), Sentry Turret (very effective booby trap), and PFMs (like the ones you know from Goldeneye). Like the Power Cores these items are usually only found in one place within a level and they usually re-spawn after someone has finished using it elsewhere in the level.   The variety of ways to play Rage Wars is definitely a strength. The one player missions start off easy enough but the test here is one of persistence. The whole goal of the single player game is to unlock stuff. All of the weapons and powerups and such are available in the multiplayer games right off the bat. You'll have to unlock stuff like the Scorpion and Chestburster along with hidden characters and new skins for old characters in the one player mode. Likewise you'll earn medals and talismans of achievement in the single player mode that can be saved to your controller pak and displayed on your own little trophy screen. This is the kind of stuff that will keep you at Rage Wars even when your buddies aren't around to play with.   Your player's stats screen is basically your trophy case where you'll display one of the 19 ranks and some of the 50 medals available in the game. The game also keeps track of your total number of deaths and kills and overall victories. The cool thing is that you're even awarded special trophies for kicking ass in the multiplayer deathmatches. If you get really good at the game, this page will be the proof you can use to throw in your buddy's face when he or she comes over ready to talk trash. It's a simple addition to a simple game but it all works very well together to get you to play often and play well.   If you don't like achieving alone then you can always do the two player trials mode with a friend. It's just like the one player mission with medals and talismans available except there's two of you. Each level will have different requirements like ~acquire 10 total team frags using 5 lives ,~ or ~acquire 7 team flag captures using 3 lives.~ When the Frag Tag missions aka Monkey, Chicken or Compy Tag come up, you'll roll your eyes and the thought of running around as the helpless creature, but its actually one of the most entertaining modes of play. This mode is even more fun when you're playing with one other friend because the two of you will usually end up ignoring the bots when they've been randomly assigned to be the monkey and focus on screwing each other over. There's few things more frustrating than finally finding the monkey ~purification~ spot only to be blasted to bits by your friend who's either been waiting in a corner or surrounded the area with Napalm canisters or radiation balls. Bad news for campers: Acclaim has added a new retaliation icon for the monkey to pick up. This will turn all non-monkey players temporarily into monkeys and ensure that someone doesn't simply sit on the purification spot and wait for you.  The multiplayer game itself is fast and furious. There's not much appreciation for individual lives in Rage Wars because your character will die and die often in a variety of ways. One way RW keeps it interesting in all game modes is by limiting the amount of ammo you can carry. There's no loading up with 1000 shotgun shells and just setting  up camp. You will run out of ammo often and that default Warhammer weapon will pop up much to your dismay. This is all part of the game's efforts to keep you moving. You simply cannot stay in one place for too long. Even if you do engage an enemy and come out victorious there will either be another one of your buddies right around the corner ready blast you, you will be extremely low on health or dangerously low on ammo. Whatever the case is, you better get moving! On the way towards that elusive power up or health or ammunition stash you will more than likely encounter another player and it may be time to kiss your ass goodbye.   It is in this way that Rage Wars keeps the action intense because a premium is placed on making the quick kill. If you can take out an enemy you've just engaged in say 8-10 seconds with a couple of Napalm canisters or Mag pistol shots to the dome, then you will be that much healthier and well equipped for the next challenge, which is always right around the next corner.   Likewise the multiplayer game has increased levels of strategy because eventually you will become a good player and you will need new challenges. You can jack up the time limit or the number of frags needed to complete a level or even start limiting yourself to the least effective weapons in the game. Or, if you're really into major achievements, you can start focusing on the humiliating class of attacks. The Inflators and Freeze Guns are neat but they don't clear the room like a good old shotgun or rocket launcher.  The bottom line is that Rage Wars' four player game rivals that of the all powerful GoldenEye. There, we've said it and it can't be taken back. The variety of levels, the variety of weapons and powerups and the forced intensity of the action make this game a nonstop thriller, much like the movies starring that British secret agent with a license to kill.  Graphics Rage Wars is a dedicated deathmatch game and so with framerate issue in mind, we gave it a workout to see how bad things would get. The game only showed a severe slowdown in rate of frames when we gave it the maximum amount of stuff to keep track of in a four player game. We're talking about four guys running around using Chestbursters on each other while there are Napalm Gel canisters, PFMs, Iron Claws and Sentry Turrets all deployed and attacking or exploding at the same time. Other than this the framerate with four players is less than 30, like in GoldenEye, but it stays consistent for the most part.  The one, three and two player modes are surprisingly smooth and don't miss a beat. When you first start a four player mode you will notice some chop as compared to the two and three player games but, trust us, after a few minutes the bullets will start flying and you won't even notice because you will be having a blast. We hate to keep bringing this up but if you can tolerate the slowdown in GoldenEye's four player game then it won't bother you here.  It uses the Expansion Pak and it seems Turok has come a long way since its pioneering days of using the extra 4MB for higher resolution graphics. There's the option for low res and letterbox hi res but don't even bother. The game was meant for ~hi-rez~ and Acclaim has pulled it off.  Hi-res graphics are easier to come by when you keep the backgrounds and levels nice and simple. There are walls and hallways most of which are at nice tight right angles to each other. There's a few 45 degree angles in there and a few ramps to get you up and down when you need, but you'll be hard pressed to find a curve of any kind anywhere in a Rage Wars level. It's a clever trick but one we don't really mind because it keeps the game fast and it's tough to hide behind curved walls and such. Also those sharp angles provide a lot of nice dark shadows -- another way to cut back on level of detail-- and those are great hiding places too.  The enemy and weapon animations are definitely a step backwards from what they were in Seeds of Evil. Everything had to be streamlined to keep the game's speed up but the guys, girls, critters and their guns actually look pretty good. Even when you only  manage to catch a glimpse of them running by, they will be holding the appropriate gun with limbs moving correctly and everything. Some characters like the Teddies and Mites are actually made up of several little animated critters moving and behaving as one.  Sound The game's audio elements don't try to do much more than let you know what's going on. You'll hear bullets being fired and all kinds of weird sounds associated with powerups and other attacks but nothing to really catch you off guard.   Even with all of the attack sounds and death cries and zooms and bleeps going on, Rage Wars doesn't lose track of any of them, even in the multiplayer games. There's no lag or slippage that we noticed, though the grunts tend to get a bit repetitive (especially when you suck at playing and fall into lava). One cool sound effect that'll be great for anyone with a big subwoofer is the Warhammer. The charge attack includes a steady bass note that'll rumble the entire room until you let it go. But the most frightening sound in the hole game is the thumping heart beat that accompanies the successful implantation of an alien embryo. You can't help but get nervous when the beat gets faster and faster -- and you're still not able to take out the guy who presented you with the creepy curse.  Each gun has it's own sound signature. The automatic fire of the minigun sounds completely different from the automatic fire of the assault rifle. Likewise the explosion of the Scorpion's rocket is totally different from the Grenade Launcher's explosion. This is surely a corner that could've been cut. It wasn't, and we're glad.  The music of Turok is nice and familiar -- but very low key. The tribal chants and drums are just what you'll need to get familiar with this series of games. The background music that's going on while you're battling it out is subtle enough not to get in the way, yet you'd miss it if it wasn't there. Because of Turok's history of framerate problems, this is the first thing we went after when we played it. After we found nothing to be worried about in the one, two or three player modes, the slight chop in the four player game was almost a relief. This game is fun if you like getting together with friends for a straight up smack talking session over a deathmatch or two. Nothing gets in the way of this. Not the sound, not the graphics and not the lack of a ~true~ quest mode. The point of the game is to shoot and kill the enemies and I've had a blast playing it. The one player modes get you ready for the multiplayer games which is where this game is meant to shine. Don't expect more from this game that what it is intended to be. All you have to figure out is where the trigger is, how to use the second function and the intricacies of the Turok-style control and you're on your way to a sure fire kick ass multiplayer experience.", "date": "Nov 25, 1999"}