{"name": "Corvette", "name_review": "Corvette", "ref": "https://www.ign.com/articles/2004/03/12/corvette-2", "text": "When Chevrolet decided to go with a fully branded racer, it did not consider two things: 1) All Corvettes does not equal all fun for all people. 2) Selling a title for $10 means getting exactly $10 worth of game. This new budget racer -- that can set a man back approximately one half a restaurant steak -- may technically be worth $10 simply because it's cleverly priced at $10, but that is not a testament to its quality. What Corvette boasts, no other well-produced racer bothers to. What Corvette doesn't offer, however, every other well-produced racer implements as a de facto standard.  Waiting is the hardest part. For races so simple, graphics so passably mediocre, and sounds so astonishingly awful, Corvette sure does like to load a lot. Seeing the menu is an exercise in patience. Waiting for the load of a track necessitates a mental game of Tic-Tac-Toe be played with a friend, imaginary or not. And doing something as simple as saving or loading requires Tic-Tac-Toe and patience, as it's impossible to save without moving back to the menu, since complex functions like saving and loading are apparently beyond the newfound realm of automation.   If you can manage what Tom Petty couldn't, you'll find yourself posed with one hell of a question: to career or to arcade? The simplest way to correctly answer this two-sided Corvette question is to arbitrarily pick one of the game's two modes and play. Whatever your choice, you will experience the breadth of Corvette, guaranteed.   Arcade differs little from career, less you count race completion specific upgrades that offer no visual or aural cue to prove their worth an ~offering.~ It's a sort of low-brow experience system that bundles car advancement into progression. If you beat this, we award points that can purchase this. As alluring as it may sound, there is no real choice to be had here. If success is what you desire, just buy what it lets you buy and pay no heed to anything other than the blurry road ahead and the uncannily obtrusive speedometer in first-person.  Yellow Means Go  For $10, Corvette is no looker, but it does admirably drop its library of nearly 100 Corvette's from 1953 and beyond into the midst of typically race-ish desert, urban, and forested locales. None are particularly engaging venues, but all serve the purpose and diligently provide us a track upon which to drive.   The driving is what bothers. Once you start moving over closed-circuit or traffic-riddled roads (with an occasional cop in pursuit), you'll not only discover that all Corvettes control eerily loose -- despite the many decades that lie between them -- but also that the world Chevrolet has built tends to blur and bleed out into the peripheral. The sky washes out colors and fogs hardened objects with nauseating glows. The screen itself appears to be filtered by a digital rag that imposes some horrendous banding issues onto a matted, less than inspiring backdrop. It's an odd, almost 16-bit reminiscent effect that markedly harms the otherwise acceptable aesthetic quality of the title.   While training yourself to cope with the sore visuals and forcing yourself to acclimate to an oddly done physics and steering schema (that even manages to completely deplete the sense of speed when in powerslide), you'll find the management of your ears to be even more trying. It's not that every Corvette has to sound different, it's that they all should -- and should be recognizable by ear, to the trained at least. It's also not that we must have music, but rather that we shouldn't have this particular kind of improper, inappropriate, canned ass-rock and techno. Not only does the score not fit either racing nor Corvettes in general, it is appreciably bad in a way where the repetition of riffs can be distinguished and the bass and percussion feel muted, indistinct.   Should you feel so inclined, you can bother to torment a friend with your $10 wonder in a rousing bout of uninspired, obligatory multiplayer. Naturally, the viewpoint here is fixed in the first and the menu system is unsurprisingly inadequate. ~It cost me $10!~ You could yelp in glee. Would you bother with a substandard title when you can purchase something like Gran Turismo or Hot Pursuit 2 for a scant few dollars more? No, you wouldn't bother, which is good because you shouldn't bother. When looking at Corvette -- marveling at its shiny box and inoffensive price tag -- remind yourself that quality costs. Then, turn left and sift through the Greatest Hits rack until you find something substantially cheaper and only marginally more expensive.", "date": "Mar 12, 2004"}