{"name": "Seven Samurai 20XX", "name_review": "Seven Samurai 20XX", "ref": "https://www.ign.com/articles/2004/03/12/seven-samurai-20xx", "text": "Once upon a time there was an amazing Japanese director who went by the name of Akira Kurosawa. He made some amazing movies that still hold up today, one of which was Seven Samurai. Over in America, this was remade a few years later by John Sturges into The Magnificent Seven. Now, fifty years after the original movie came out, we have Seven Samurai 20XX for the PlayStation 2. Much has changed since then and now the tale has been reworked into a hack-n-slash game set in a sci-fi future. While the story remains more or less intact, the action has not held up its own end of the bargain.   Gameplay  First and foremost, the title Seven Samurai 20XX is not quite appropriate since there is only one playable character, Natoe, and he always fights alone. While there are other samurai in the group and they fight in their own cutscenes there is never any assistance from them. It becomes a bit of a joke in the game because many battles are introduced with a cutscene that features one or more other samurai who are able to fight, but run off to do something else or Natoe tells them to leave it to him. With a game title that begs for multiple characters, it's odd that only one is available.   The fighting is set within a series of ~arenas~ in the game that get set off within the levels when green glowing walls appear. The gameplay is based on the hack-n-slash and moving through the levels is a tour through these arenas that provide new places for hordes of enemies to pour into for some group combat. With the exception of the boss battles, Seven Samurai 20XX is all about hacking up the thugs and racking up some serious combo points. Keep the swords hitting flesh and avoid getting hit and watch the numbers soar.   The fighting is mostly button-mashing action that will wear out the square-button on the controller. To make the action go out of control, Natoe has a Nitoh-Ryu Mode that he can enter which makes him able to spaz out with two swords in a blur of light effects. By rapidly tapping the square-button and moving the left analog stick towards the next enemy, I was able to slaughter groups all the way up to the very last few battles where a little bit more strategy was required.     To spice things up a little, there's the art of the guard and the dodge. The Nitoh-Ryu ability has a time limit and it must be charged up again in order to use it. This doesn't take too long, but by doing an effective guard move by guarding right before an attack the meter will fill up instantly. Getting a good guard in during a battle will reset the clock for the Nito-Ryu power. Dodging works along the same principles and instead of guarding, the skill here is stepping behind an enemy during an attack. This gives a smaller Nitoh-Ryu bonus, though, so it's really about the blocking.    By using these skills effectively and by racking up large combos, Natoe will improve over the course of the game in terms of hit points and attacking and guarding abilities. Killing bosses will put various weapons into Natoe's weapons list, but these can't be used until the game has been completed. For the first run through of the game, there's only the two swords that Natoe starts with. While this helps with the replayability, it's disappointing that there is little feeling of steady advancement over the course of the game. After completing the game there are plenty of options to keep playing through with another difficulty level and some boss challenges that become unlocked, but the main game feels limited. The main strength here is for gamers who really want to have some arcade-style action and those who want to see a reworking of Akira Kurosawa's classic story.     The storyline is practically entirely separate from the rest of the game. With tons of story elements lifted almost directly from the cinematic original, the plot follows the formation of a group of ragtag samurai as they all gather to defend a small village and get closer to their samurai ideals. With a strong inspiration, many moments jump out more than normal video game storylines. Themes of loyalty and being true to one's self stand out and help to elevate the overall experience beyond the arcade gameplay.   The overall effect is like seeing two different experiences in one game, the hack-n-slash action and the reworking of a classic film. Unfortunately, both elements serve to hamper each other's efforts. The gameplay is limited by having to follow a story that is well-loved by many and the retelling of the tale is limited by the graphical capabilities of the PS2. It would have been amazing to see a modern sci-fi version of Seven Samurai like the anime version of Metropolis that came out in 2001, but this is not the case here. While there is fun to be had in the slicing and dicing and the story that makes it through is a great primer for the original, Seven Samurai 20XX does not reach the heights it strives for.   Graphics  The character design is one of the strongest elements in Seven Samurai 20XX with plenty off oddball characters and very bright outfits all around. The main character showing off his abs is a bit of an odd choice, but I'll let that one pass. The general look is reminiscent of the Cirque du Soleil, the Canadian circus troupe, with plenty of bright colors and odd hats.   The rest of the graphics are just as visually interesting, but the strain on the graphics engine takes the look down a few notches. Townspeople and enemies appear out of nowhere to save the engine some work, but there is still a fair amount of slowdown when multiple characters get on the screen.    The battles have multiple effects going off which makes the action look more exciting, but combined with the slowdown it makes the action harder to make out. When wading into a group of enemies, this makes it harder to even see what Natoe is doing and makes it even more difficult to time the guards or dodges. The only camera control is to reset it, so that doesn't help either. The result is pretty, but frustrating.    Sound  The opening track is a haunting tune, but the music inside the game is a techno mashup that creates the feeling of fighting inside of a nightclub. It's an appropriate soundtrack for the arcade action that goes along with it. With so many enemies on the screen, you're mostly likely going to hear the constant sound of swords slicing into enemies and thuds of enemies hitting the ground. The total effect is a frenetic pile of sounds that helps to keep the action interesting.  Seven Samurai 20XX is a modern retelling of a classic tale with heaps of hack-n-slash thrown into the mix. Neither one truly takes off and reaches for the heavens, but both have some interesting quirks in their own way. The story still holds up and the sword-action is an easy way to while away a few hours. More if you're willing to keep digging for secret bosses to fight and secret weapons to fight with. Overall, its worthwhile for those who want to spend a bit of time whaling away on their controllers.", "date": "Mar 12, 2004"}