{"name": "Harvest Moon: A Wonderful Life -- Special Edition", "name_review": "Harvest Moon: A Wonderful Life", "ref": "https://www.ign.com/articles/2004/03/15/harvest-moon-a-wonderful-life-2", "text": "Farming simulation. That isn't exactly a phrase that makes you want to run to the store with your hard earned cash in hand. And yet Harvest Moon, a franchise based on nothing more than owning and operating a farm, has developed a huge fan base. The reasoning? Perhaps it's because Harvest Moon sends a purely positive message, especially compared to other games in the market place. It's all about growth and building something successful -- instead of wanton violence and destruction.  Traditionally, the Harvest Moon series turns mundane tasks like planting crops, raising animals, and talking to townsfolk into addictive gameplay (strange, but true). Rarely would something like potatoes finally blossoming or your sheep growing enough wool to sheer excite you, but in Harvest Moon it's what you live for.  Your rewards come from your hard work, which is why these ~little~ things are so greatly appreciated. The longer you play it, the more rewarding it gets.   A Wonderful Life is Natsume's first stab at a Harvest Moon on GameCube. After the success of Harvest Moon 64, A Wonderful Life has a hard act to follow. Does it live up to its namesake? Is it worth the hefty time investment? Are its simple themes still able to survive in a world that craves complexity in videogames? Read on. The Facts First Harvest Moon game on GameCube 40 New Characters New marriage system Raise your child New event system that spreads over six chapters, which spans 30 years New animal rearing and crop growing systems New seeds and animals GCN/GBA Connectivity  Gameplay A Wonderful Life is unlike any Harvest Moon before. Your father's lifelong dream was to be farmer.  He and his best friend Takakura squirreled away funds to buy a farm in remote Forget-Me-Not Valley. Sadly, your father never lived to till his land. After his passing, you find yourself drawn to the valley to fulfill your father's wishes and escape the urban bustle. Here, you learn that Takakura scrounged together enough cash to set you up with a house, basic tools, a cow, and a small farming fund. Sure, it sounds like the typical Harvest Moon -- but your main goal isn't to save your town or your family's farm. Your goal is to lead a successful life. You need to balance your farm's needs with those of your family and social life.    A typical Harvest Moon day requires you to wake up around 5 AM, eat some sort of food, and then take care of your daily chores. This might mean moving all your chickens outside and collecting eggs, milking your cow, and watering your crops. These are things you have to take care of -- if you neglect your crops, they'll whither. If you don't take care of your animals, they'll die. What free time you have left can be split among a couple activities. You could go fishing, help the archeologists at the dig site, visit the Harvest Sprites, or visit Vesta's farm for needed seeds. Of course, the most important use of your free time early on in the game is to woo one of the town's three lovely ladies. As with prior Harvest Moon's, marriage is one of your primary goals. But, in AWL, it's a bit more urgent. Since this game revolves around raising a family, failure to marry within the first year ends your game.  But, those that manage to bribe a girl with such things as fish or watermelon to marry him, will be well on the road of Harvest Moon life. This time around, annual festivals don't break up your year, instead your 30-year life is divided into six chapters -- all equally important. They range from getting married, to having a kid, and finally seeing what your child will do with his life. Raising your child is dependent on spending time playing with him (whilst juggling farm work). The ultimate goal is for your kid to grow up into a well-adjusted adult and choose a career. Whether it's following your footsteps or heading to the city, is entirely dependent on whether you spent a lot of time with him or neglected him.    Also, your relations with the townsfolk determine your child's available careers. It's almost like you have to court them as well -- talking with them and giving gifts will improve your relations, which eventually opens up new career paths for your kids. The downside to this is that it isn't always exciting to talk to townsfolk. Most people spit out the same phrases over and over again, which makes you not want to spend any time with them. However, constant exploration will reveal links between people in the town you wouldn't have suspected -- and as the years pass people move in, move away, die, and grow up.   A Wonderful Life is all about managing your time correctly. Too much time at the farm means you're neglecting friends and family or vice versa. Finding the balance is hard, and you'll usually have to settle for a compromise. What makes things even more difficult is that Natsume has added complexity to several of the core gameplay systems so that you'll experience less ~dead time.~  The most noticeable change is that the town is almost entirely residential. There aren't any blacksmiths, supermarkets, chicken farms, or wineries. Instead, seeds are purchased from a rival farm. Van, the traveling salesmen, will buy items and sells rare products. Everything else, whether it's tools, housing additions, or animals, is bought by mail order through Takakura. While this adds some strategy since Van is only in town twice a season, you can always open a farmer's market in the square. Also, the mail order system eliminates the need to level up tools.  Animal care now requires more than a hug and enough money to buy the animals you need. Timing events (like birth) is extremely important. Cows can only give milk for 40 days after birth, so you have to figure out when's the right time to have your bull or miracle potion impregnate her. You can also crossbreed the  different cow types (brown, star, marble, etc.) to get different kinds of milk. More steps have been added to the process too. You have to isolate the cow before it gives birth and raise the calf inside a cow hatch. On the chicken side of things, you can now own roosters. If you want running amok, you'll need roosters to fertilize the eggs.   Crops are handled in similar fashion to the other games --  you have to pay attention to season and water level. But, now you also have to worry about how fertile the soil is. Some crops won't grow in poor soil -- and fertile soil is farther from your house. You have to juggle the importance of healthier crops vs. free time.  There are a few other upgrades to be found in town, like breeding your own seeds (tomamelon?) or making milk and butter in a food processing room, but most don't have a huge impact on how you play the game.      We know it sounds crazy -- why would anyone want to do these chores in videogame form? -- but you'll have fun. Just as Animal Crossing sucks you in, so will Harvest Moon's day-to-day activities. You'll want to grow your business, to take care of your animals, to meet and marry, to raise a child, and you will be mostly entertained and satisfied along the way.  While some things have been added to A Wonderful Life, other things have been lost. The most noticeable is the lack of festivals. These were what really broke up your game in previous Harvest Moon titles, and the absence is missed. AWL  gives you a lot to think about. Usually you don't have enough time to get everything done before dark, but you'll always encounter days where you can't find enough things to do. There never seems to be a way to keep yourself busy all the time. There are times when you'll be absolutely sick of watering crops or you don't care what happens to your chickens. But...then you encounter a special cut scene, whether it's between you and your sweetie or you and a neighbor, that makes it all worthwhile.   The other problem is that the control is too sensitive. Most actions are context sensitive. You're trying to water the hexes on your fields and a slight tap of the analog stick will water the wrong square. If you're trying to check up on your cow, you might accidentally start milking her because you weren't standing absolutely still when you hit the action button. It can be annoying, especially when trying to clear your field and you keep explaining what a sickle is instead of cutting grass.   Game Boy Advance Connectivity does do some neat things for Harvest Moon fans. If you own Friends of Mineral Town and hook it up to A Wonderful Life, you'll get new items and hear gossip about Mineral Town. In FoMT, you can go to the library to read up on AWL's citizens. Or, in AWL, Van might have some new rare items that you wouldn't be able without the connectivity. Does it make the game? Not really. But it's a small extra for avid fans.   Graphics A Wonderful Life is the best looking HM game. But, of course, that isn't saying much. The biggest change, an improvement in our book, is the franchise's switch to full 3D. Instead of sprites we now have polygons and believe it or not the engine Natsume has created impresses on some fronts. It draws big worlds with little slowdown. There are some added bells and whistles like transparent and reflective water, shimmering light sources and casted shadows. The camera system works well, turning foreground objects transparent so as to not block the view and the view can be manually controlled, an intuitive addition.    On the other hand, the game doesn't feature detail character models or overly crisp textures. Indeed, the models in the game, be them persons or horses, or everything in between, lack roundness and are dented by basic animation. Textures can be bland and repetitive. But, if you're willing to look past the technical aspects, you'll find a charming art style.  What's is really well done, especially since these aren't the best graphics out there, is  Harvest Moon's use of light and shadow. Watching the sunrise and set or shadows (including individual leaves) stretching and contorting as the sun passes over head is truly breath taking. The trees and water also look amazing. There are also a lot of neat little touches, like snow fall, a single leaf dropping to the ground, or even random animals like lizards, raccoons, or turtles roaming around the wild bring Forget-Me-Not Valley to life.   Sound Harvest Moon's sound fails to impress. There really isn't a lot going on. Most actions are represented graphically and all dialogs take place in text boxes. Sound is reserved primarily for a song that's endlessly looped in the background (fortunately you can buy new discs) and sound effects. These are the most spartan use of sound effects in a game. You'll hear your feet pound the ground, water pouring from your watering can, your hoe digging dirt, or your hook catching a fish, but that's practically it. It doesn't help that most effects are only two sound clips -- which makes for a lot of audio monotony. I love Harvest Moon. It's a wonderful change to actually be doing something constructive -- something that's focus is growth and nurturing rather than mindless killing. Besides for the fact that playing Harvest Moon always puts a smile on my face, I'm truly addicted to the simple play mechanics. Even the moments that were agonizingly slow (sometimes life on a farm really doesn't move fast enough) and forced me to break from the game -- I'd usually find myself booting up the GCN a few minutes later. I had to know if it was almost time for my cow to give birth. The more you play it, the more it grows on you. It's quite easy to fall in love with the world Natsume created. Still, as much as I like the new focus on family, I'm not a big fan of needing to establish good relations with all my neighbors. There also needed to be festivals in this game -- something to break up your everyday life. As infrequent a role as festivals played -- they were a big part of Harvest Moon and I miss their absence. It'd also be nice if there were more mini-games and the tool experience system was reinstated, but the animal and marriage system upgrades (and the corresponding cut scenes, more than make up for it.This game isn't for everyone. Some won't be able to handle its plodding pace (even some seasoned HM fans will encounter moments of boredom), but sticking with AWL is a rewarding experience. If you can't devote the needed time, you won't get much out of it. But, don't be turned away just because it's a farming simulation. It's quite endearing -- and similar to Animal Crossing. For those that like to walk on the farming side, A Wonderful Life is recommended.", "date": "Mar 15, 2004"}