{"name": "FireStarter", "name_review": "Firestarter Review", "ref": "https://www.ign.com/articles/2004/03/15/firestarter-review", "text": "Sometimes we as gamers luck out. It doesn't happen often, especially when it comes to bargain titles, but there are times when a game exceeds the price of admission. The developers behind Firestarter decided to make their budget FPS shooter worth every cent of its 20 bucks. Seriously, we've all spent fistfuls of cash on games unworthy of their packaging, so it's a real treat dropping 20 clams on a game and getting hours of bloody fun in return.   Truth be told, I expected the worst. The opening cinematic failed in conjuring any sense of excitement and told me nothing regarding storyline or characters. Playing through the game reveals little more in terms of plot. Actually, staring at the box art for a few minutes will likely give players more ~story~ than blasting through the game.   Basically, the player assumes the role of an unnamed avatar trapped within a virtual reality game gone haywire. A virus has infected a futuristic game and altered the rules, transforming a simple arcade game into a real life Valhalla filled with monsters borrowed from id's DOOM. The player has 48 hours to blast through the game before the computer virus binds his human consciousness into the virtual world forever.   Firestarter makes no apologies for its shallow story. Like Serious Sam before it, Firestarter embraces its simplicity and runs with it. Yet where Serious Sam dished out swarms of brain dead enemies and wildly hectic gameplay, Firestarter delivers smarter enemy AI, interesting weaponry, six playable characters, upgradeable skills and some of the nicest eye candy ever to grace a budget title.       The game mainly revolves around a campaign mode, which takes you through all of the game's levels as one of the six characters. Choosing campaign mode brings up the character selection screen. Gamers pick among the beefy Marine, the agile Agent, the four-armed Mutant, the super-accurate Gunslinger, the heavily-armored cyborg, and the fair-and-balanced Policeman.    Fortunately, gameplay varies depending on what character you decide to pick. More than any other feature, the ability to choose different characters effects gameplay most. Character selection could have been a gimmick, yet the developers made the most of it -- you really want to play the game over as different characters because the system works so damn well.    For example, the Agent's speed allows for quick getaways when gun fights turn sour. On the other hand, you won't need to run away from enemies when you're wielding two miniguns as the four-armed mutant. Some of the game's sequences allow mere seconds for players to complete an objective (more on that later), so characters with a greater speed attribute benefit greatly. The choice is yours to make.     Each character has three basic attributes: Armor, Health and Speed. While each of the six characters starts off with an attribute bonus depending on their expertise, each class gets a +10 Health bonus for each completed area. You can also make minor cosmetic changes to each character during character selection, but this only makes a difference when using the third person camera. Sadly, the third person camera is next to useless and actually hinders your aim and response time. Not surprisingly, you'll want to use the default first person camera unless you want to die very, very quickly. Of course, that might happen a lot anyway. Firestarter starts easy enough, but dishes out quite a challenge in later levels. The difficulty feels unbalanced, throttling players from easy gunfights to insanely hard ones in just a few stages.   Thankfully Firestarter gives you five settings, ranging from 50% (easy) to 200% (wildly difficult) which can be adjusted at the beginning of each new stage, letting you sell-out and take the easy road to victory if needed. This feature is sorely missed in most games, especially the ~smash your controller~ type, yet thankfully shows up here. I can't stress enough how much you'll want to hug the developers of this game for including such malleable difficulty settings.    You'll start off each level facing no more than one enemy. Each level starts the same way. The lowest level enemy will spawn first, giving you a much needed breather before the poop sails into the fan. After you've dispatched a number of lower enemies, a harder enemy will appear, and so-on. Overall, the enemy spawn rate keeps the game lively while not overwhelming the player...at least in the early stages. In later stages, enemy spawn rate increases to a point of lunacy, leaving you to fend off hordes of enemies with little time to replenish health or pick up ammo.      As you're laying the holy smack down, you'll soon find yourself battling several classes of enemies, because the harder enemies buddy-up with the simpler ones you slaughtered earlier. Then things get interesting as enemies start spawning at a faster rate, and the game throws in a little timed sequence I'll dub the Annoying Yet Gameplay Enhancing Artefact(sic) Collection Sequence, or A.Y.G.E.A.C.S. for short. The A.Y.G.E.A.C.S consists of an item, called the ~Artefact~, which appears during key sequences of the game, say after you've killed a certain number of enemies.   Depending on the difficulty chosen at the beginning of the stage, players will get anywhere from 10 to 60 seconds to reach the ~Artefect.~ If you don't reach it time, the game ends. Simple as that. No matter that you've just unleashed holy retribution against a mob of demonic fat men, you're game will end if you fail to reach the ~Artefact.~ Now, I understand how this was meant to enhance game play, and it does to an extent, but it's just plain annoying getting a rocket launched up your ass while running away from an enemy in hopes of reaching the ~Artefact.~    Each ~Artefact~ you pick up contains a skill that draws upon the characters ~psycho energy,~ which the interface presents as a gauge on the upper right hand of the screen. These skills can be even cooler than the earlier set. The Time Jumper skill for example, lets players travel back in time five seconds. The Mind Controller skill turns a targeted enemy into a regular Judas and forces it to attack nearby enemies. The Annihilator skill devastates all enemies on screen. My favorite, the Terminator skill, forces enemies to gang up on a target of your choosing until dead.   After each stage, you'll also get a chance to upgrade your character through 27 different character skills. Each skill has four progress degrees: basic, advanced, master and expert. Like the different characters, these skills greatly effect how the game plays out. While each of the skills enhances your characters abilities, some deserve special recognition. The Vandalism skill increases your experience points for desecrating dead bodies. The Vampire skill transfers hit points dealt to an enemy and adds them to the players overall health. The Stability skill lessens weapon recoil; very handy when using the minigun or rocket launcher.     The game splits 16 levels into four episodes, each with a varying graphical theme. The Industrial Zone shows off snazzy angular architecture and heavy lighting. The Empire level takes a totalitarian approach and features looming cityscapes with large outdoor areas. The Space Station level has dim lighting and several obstructions throughout, making it easier for enemies to corner you. The Arena is a crumbling structure divided between a gloomy interior and several outlaying corridors. While the four stages do in fact differ in layout and style, they feel similar and slightly repetitive some hours into the game. Still, Firestarter has good graphics that don't require a supercomputer to run well.     As stated earlier in this review, the enemies look like they're on loan from id's seminal Doom series. Most look like genetic freaks of some kind or another, with one or more limbs replaced by a really big gun. The developers even threw in the requisite fat man. Only this time, he's bleeding from the mouth, carries a huge axe and sports a pentagram etched on his belly. Unfortunately, character animation suffers from a lack of polish. Most enemies run like their legs are partially frozen -- adequate, if not totally convincing.   The music in the game is standard techno -- we've all heard these tunes 100 times before. The sound effects do a nice job of rumbling your speakers, yet won't blow your socks off. It gets to a point where you don't even notice the music anymore, and I suppose that's far better than noticing for the wrong reasons. Speaking of noticing things, there are some minor nuisances you'll notice right away when playing Firestarter.   For starters, the game employs a form of bullet time. While this effect worked wonders for Max Payne, it can really hinder gameplay here because the game engine triggers the effect automatically when an enemy is nearby. Thing is, enemies are always nearby, forcing you to play in a near perpetual state of malaise. Imagine Max Payne with bullet time turned on throughout the whole game and you'll know what I'm talking about. Thankfully, this option can be turned off in the options menu.   I commended the developers for creating some pretty decent AI earlier in the review, but sometimes the enemies in Firestarter just plain cheat. At least it feels like they're cheating. Enemies shouldn't be able to dodge my rocket fire as if I were chucking softballs at them. Later on in the game, this problem grows worse, as enemies gleefully dance around your shots. Again, these are minor issues and nothing to make you throw your monitor out the window.In the end, there's nothing like getting your money's worth. Firestarter initially comes off as unabashedly shallow -- a budget title hell bent on delivering nothing but the bare minimum. Yet the game expands its simple 'run and gun' action through a satisfying skill system, yummy graphics, and a handful of playable personas. Firestarter delivers rich action without raping the wallet -- not much else to ask for in a game.", "date": "Mar 15, 2004"}