{"name": "Battlefield Vietnam", "name_review": "Battlefield Vietnam: Official Soundtrack", "ref": "https://www.ign.com/articles/2004/03/15/battlefield-vietnam-official-soundtrack", "text": "Few would refute the statement that the music of the '60s has been mined to the core in terms of it's relation to historical events. One historical period that continues to be intrinsically tied to the music of the same period is the Vietnam War. From the plethora of films ranging from Apocalypse Now to Platoon, Hamburger Hill and television programs like China Beach and video games like EA's Battlefield Vietnam, music has played an integral part of recreating the infamous Southeast Asian invasion. To this end, the folks at EA have compiled a rather by-the-books soundtrack to accompany the game play of their most recent installment of the Battlefield franchise. Visiting the official Battlefield Vietnam website, one can access a media player and actually hear a 16 song selection of classic rock tunes from the '60s (plus one chunk of classical Wagnerian epicness) that captures the attitude of the day and features prominently in the game play. For those who managed to pre-order their copy of the game, they'll be treated to a 12 song CD that features a selection of songs that appear in the game. The soundtrack focuses on the years between 1964 and 1970, with the bulk of the inclusions being between '66 and '68. As can be expected from the subject matter, the selections range from the routine (Deep Purple's ~Hush~)  to the mildly ironic (Creedance Clearwater Revival's ~Fortunate Son~ and Edwin Starr's ~War).The album commences with CCR's ~Fortunate Son,~ the first of the ~ironic~ inclusions. Ironic in that since the many who were drafted to the war were far from fortunate and those that did manage to make it through the event often were scarred for life, both physically and emotionally. The mood is shifted with The Trogg's rollicking ~Wild Thing,~ then the album shifts into the wop-bop-a-luma shim-sham of ~Surfin' Bird~ by Trashmen. Then ironic track #2 cuts into the mix in the form of Edwin Starr's ~War.~ This is perhaps the most overplayed song ever within the context of Vietnam war movies, if you think about it. It's kind of like hearing a Gary Glitter tune at a football game: you anticipate it coming with a sense of routine excitement, but then you also find yourself wishing that someone would come up with a new tune to play. Deep Purple clock in next with ~Hush~ which kicks up the psychedelic aspects of the period a slight notch before the album immerses itself full-bore with Jefferson Airplane's ~Somebody To Love,~ a staple not only of the period, but also of Vietnam movies in general. Another San Francisco based band, Canned Heat, delivers the eccentrically loopy blues sound of ~On The Road Again.~No sooner have the Summer of Love vibes of the album kicked in then they fade away as the early '60s sound of the Bobby Fuller Four slide in with their seminal ~I Fought The Law~ track. The ST sticks to the early '60s with the early Guess Who track ~Shakin' All Over,~  before dipping back into the thick soul vibes of Rare Earth's 1968 classic ~Get Ready.~ The final two tracks on the pre-order exclusive CD are no doubt meant not only to be historical, but somewhat ironic. ~The Letter~ is perhaps the most seminal Vietnam War era pop song ever written and as such it's both poignant and  clichd. Martha and the Vandellas' ~Nowhere To Run,~ while a cool blast of femme fatale R&B has the dubious honor of being a double entendre in terms of irony: no doubt American troops wished this upon their NVA and Vietcong enemies, but the truth, as history has shown us, was often the opposite. Interestingly enough the ~radio~ on the official Battlefield Vietnam website features a grand total of 16 tracks, shuffled up into a different play list order than the CD. I actually prefer the way the ~radio~ plays the tunes over the CD ordering, if the truth be told. The ~radio~ soundtrack unfolds with a better sense of transition and manages to become a relevant and entertaining mix tape compilation. The truncated and different song order of the Official Soundtrack just doesn't have the same fluidity.The biggest drawback to the Battlefield Vietnam: Official Soundtrack is that we've heard all these tunes before in different Vietnam recreations, whether they be movies or television. And the ironic inclusions~War~ and ~Fortunate Son~have been used so many times that the irony is all but lost. Still, these are minor quibbles. In terms of game play, the soundtrack adds to the overall ambiance of the battle scenarios and lends a distinct sense of realism to the proceedings. As a stand-alone CD, however, it's kind of like those Freedom Rock collections: a not-so-essential greatest hits package that won't cause you to lose any sleep if you didn't get it with your copy of the game. It's", "date": "Mar 15, 2004"}