{"name": "Breakdown", "name_review": "Breakdown", "ref": "https://www.ign.com/articles/2004/03/16/breakdown-3", "text": "Don't you hate it when a movie trailer is ten times better than the movie? There's nothing worse than being hyped for a flick four months in advance only for the finished product to be a poorly assembled mess. Namco's Breakdown is the case of a video games to totally astound with its trailer (which got much love at Microsoft's E3 2003 press conference) only to come up very short with the finished product. It's a great idea, to create a true first-person experience with a smart sci-fi story that truly absorb gamers into ~the experience,~ but Breakdown never really amounts to anything more than the idea. From mindless AI to boring and generic level-design, Breakdown plays out more like a bad Schwarzenegger flick (repetitive, unfunny, and without soul) than a work of staggering genius. Yet still, this is one of those bad games I couldn't help but enjoy, even as I cursed its very existence.   FeaturesTrue first-person perspective offers a unique gaming experience Smart sci-fi story begins as typical but turns into a classic by games end Unlockable galleries, but no bonus modes Dolby Digital 5.1 480p support  Gameplay As studly Derrick, you begin Breakdown waking up in an antiseptic lab room with no memories of your past and no idea where or even who you are (sort of like freshman year in college). The rest of the game (which should take you about seven hours to complete) follows Derrick's journey to discovery as he tries to save the world from the mutant menace known as the T'Lan. Yeah, an amnesia patient with hidden gifts who's destined to save the world isn't exactly new, but Namco has done a nice job of taking a cliche story and flippin' a bitch two-thirds of the way through to make for a truly captivating ending. It's that one big twist that makes the story not only fresh, but also helps to redeem some of the game's lackluster design.  Breakdown is a first-person action game in the truest sense. While there are a half-dozen guns in the game, the majority of combat is done hand-to-hand. This is a risky choice, because the history of games that have tried to do melee combat in the first person (see Maken X or Hexen) shows a lot of games with more ambition than execution. What sets Breakdown apart is that it's a true first-person perspective. Get socked in the jaw by an enemy and the camera flies backwards with the snap of Derrick's head or do a backflip and you earn the sensation (and confusion) of a world turning upside down. This can offer for some very cool moments (like a scripted scene where you are grabbed by the throat and smashed into a wall) and some serious motion-sickness. It really drives home the fact that some brute is tossing your salad when you see everything exactly as it happens to your character.    Those sweet moments come in stark contrast to the majority of gameplay, however, which is about as uninspired as it gets. Combat is designed for one-on-one battles. Using the Left and Right Triggers (left hand/foot and right hand/foot) in combination with the Left Thumbstick results in a variety of attacks from one-two punches to powerful uppercuts. Fighting a baddie mono-y-mono can be exhilarating. It feels like a fight and can be fun, even though it's easy to become disoriented as your view switches radically depending on the type of attack. But when it comes to fighting multiple enemies, you're screwed. And, unfortunately, you are often fighting multiple enemies.  The AI in Breakdown is mind-numbingly simplistic. Enemies basically just come right at you, all at once, without any tactics. So if you come into a room with three enemies, they often all descend on you, punching in unison. You can only block what's right in front of you so blocking all the attacks requires that you shift yourself to constantly keep all enemies in sight. However, most of your own attacks carry you forward and so when you have three enemies in front of you, a punch at one baddie will almost always put the other two at your backside. This leads to cheap hits in the back, which then throws the camera wildly as Derrick flops to the ground.       For this system to work, Derrick needs to be able to attack enemies behind him or at least block them, but that's not an option in Breakdown and most of the fights feel incredibly unfair. To fight, you have to run around and try to separate enemies, which doesn't always work, but even when it does, it's hard to imagine that's intentional. The best option, it turns out, is to simply run away from as many enemies as possible. Fun, huh?  As you progress through the game, Derrick begins to uncover new powers that allow him to perform some nifty energy attacks, including a very handy shockwave attack. This helps to offset some of the melee combat woes, but not by much. To add to the disappointment is the ranged combat which uses auto-targeting (and no hit locations) to take down enemies. The point of having first person should be that you have a perfect way to manually target enemies in specific locations -- apparently Namco didn't get that memo. Honestly, though, the ranged combat isn't nearly as bothersome as the obnoxious hand-to-hand AI. At least when enemies are shooting at you, you can block the bullets with your arms a la Wonder Woman. Even though the combat is frustrating, I still found myself able to get past it, simply for the fact that, from time to time, it's fun. I just wish those fun-fun happy times came around more often.   Breakdown would have earned a great assist if the level design were inventive in the least, but the majority of the game is filled with boring gray walls. Even when you get free of the walls, you're traveling through generic greenery or a ~been there, done that~ alien hive. And still, despite some of the pedantic gameplay (you will unlock countless doors and wander through endless empty hallways), I couldn't help but play Breakdown to its conclusion. There are some games that, despite being bad, you still enjoy. And for all the times I grumbled about how badly Namco dropped the ball, I still played. And I bet most people will. At least, I hope they do, simply because the story (particularly the great twist) is really one of the better ones on Xbox, right behind Halo and KOTOR.     In a lot of ways, Breakdown feels like a great sci-fi movie made into a weaker video game version. The story and the first-person perspective play a role together that you won't really understand until late in the game. It's a smart idea and a good story, but no attention seems to have been paid to other important details like level-design and playability. Still, the story almost redeems this game. Almost.  Graphics At a quick glance, Breakdown is an attractive game. The animations look great, Derrick's powers have some cool Minority Report-like visual flare, and there are some nice particle effects, including dust kicking up off the ground. Where the game is weak is the environments, which are very plain. The textures are weak in just about every single area and there's not a single environment that will stimulate your eyeballs. A single moment in Breakdown could fool you into thinking, ~very pretty,~ but run by the same gray walls for three hours and that view changes. Though Namco was able to utilize a cool heatwave effect for Derrick's powers, they didn't bother with dynamic lighting or rich colors (unless gray is considered rich). Oh, what might have been with a little more imagination.    Sound The English dub is pretty good, surprisingly, even if most of it is used for long exposition. The sound seems like an attempt at replicating Halo, with soldiers offering various chatter during battle and a sweeping orchestral score that seem like bonus tracks from a Halo Special Edition. Bad voice acting could have hurt the story and an average score would have killed some of the emotional touches later on, but Namco did its job with the sound this time out. The sound effects are the only real weakness here, with explosions and splattering enemies sounding a bit canned, but that's forgivable.Breakdown has a lot of problems. The level design is boring, the textures on the environments suck, the AI is simplistic, and some moments will have you reaching for the airsick bag, and yet I still liked the game. Breakdown has some smart ideas and none of them really go anywhere. There are some games where you can play them and realize that with just a couple more months of development time, they could have been something special -- Not Breakdown. The design overall is far too weak to have ever made this one a classic without some major revisions. However, Namco had plenty of time to tweak the AI to make battles more enjoyable (or at least not so frustrating), but instead they made no real improvements over the Japanese release. The story does a lot to make the gameplay issues more forgivable and, in fact, is why I give this one a recommendation -- as a rental. You'll have no reason to replay this game, but considering that it can easily be finished in under eight hours, this is one gamers can rent for a rainy weekend during the spring. The deeper into the story I got, the more I enjoyed it and there are enough enjoyable moments (the final boss battle is fantastic) to make the obvious weak points a little more acceptable. Definitely not worth forfeiting 50 bucks on, but a rental for sure. Despite its problems, I still liked the damn game.", "date": "Mar 16, 2004"}