{"name": "All-Star Baseball 2005", "name_review": "All-Star Baseball 2005", "ref": "https://www.ign.com/articles/2004/03/23/all-star-baseball-2005-2", "text": "All-Star Baseball is like the Inside Drive of baseball games. It might not knock you out with an abundance of flash or highlight showstoppers, but the more you play, the more you realize and the more you respect the level of depth and intelligence behind the engine. In fact, All-Star Baseball 2005 features the most intelligent managerial engine of any of the baseball games this year. Hardcore fans will love the fact that the computer not only subs in the right pitchers and pinch hits lefty for righty and vice versa, but will even go so far as to pinch run late in games in order to push ahead for the lead.   And while the smart AI and awesome feature set, including an incredibly deep franchise mode, win ASB some valuable points, it's what's billed as the games biggest innovation, fielder cam, that's ultimately its biggest irritation, and really holds the game back from making a championship run against MVP Baseball 2004.    The Game   One of the deepest baseball experiences your money can buy, Franchise mode will have you playing for hours, without necessarily even playing a game, and that's a good thing. You can take your team through Spring Training and earn points to improve your squad by completing a series of objectives from hitting two homeruns in the same game with one batter to hitting for the cycle, and the more difficult the task, the more points earned. Each year you raid the free agent pool, trade and create players, call up youngsters from the minors, watch are inducted into the Hall of Fame, and even attend the Winter Meetings where even you participate in the Rule 5 Draft. ASB forces you to learn the financial game of baseball as well, as you must go to arbitration with some players, you're in charge of the budget allotment (medical, training, and coaching staffs), and your franchise is even assessed a value of points that you can check to see how you're progressing.   If you're not a fan of any current team, you can always create your own team and launch into the Expansion part of the franchise. Here, you select a city and mascot, choose your stadium, then participate in an expansion draft and select from a variety of veterans left unprotected from their teams. Once your team is put together, you can then compete to become the fastest expansion team to ever compete for a title.      Other great features include a pickup game where the computer randomly selects the players available and you select your team just like you did back in the playground, as well as batting practice and a home run derby. There is also a This Week in Baseball challenge where you can try to ~do-over~ some of the most memorable moments from the 2003 season, including changing the fortune of the Cubs and taking control of Alou just in time to leap up toward the stands and catch the most infamous foul ball in Chicago history.    On the field, ASB's behind-the-pitcher cam makes for one of the most enjoyable pitching experiences this season. The perspective really lets you see the breaks of the ball, not to mention when the ump blows a sure strike. It also helps you see the fatigue in your pitcher's throws as gradually your big breaking curve starts to hang and the next time you throw it might cause you whiplash as its smoked over the fence.     At the plate, you have a variety of options, from simple timing and zone batting (no cursor) to both 2D and 3D cursors depending on the level of difficulty and control you want with your stick. Even at the highest speed option, however, pitches don't seem to whip in with enough force. The speed isn't horrible, but it's not quite up to what you'd expect. Get fooled at the plate, though, and you'll see some cool animations like your batter loosing his grip on the bat and the bat flying down the third base line. Sure, it's a little thing, but to baseball fans, little things like this mean a lot when trying to capture the feeling of a big league game.   Other cool little things you might notice: The first base coach shaking his head and looking down after a close play at the bag. High heat causing the computer to charge the mound (your pitcher gets into Karate Kid stance before the scene is cut). There is mid-game trivia and even a schedule of your upcoming games in between innings. First basemen will jump for bad throws and try to tag the runner racing toward him. If your pitcher gives up too many homeruns, he'll actually fall down in disbelief.   Unfortunately, while all of these instances add to the fun, there is plenty of bad that goes along with it, most glaringly fielder cam. When the ball is hit into the field, the camera immediately switches to an angle behind the fielder who should make the play. The ball glows like the old Fox hockey puck to make it easier to spot as you run to the spot on the field marked with a series of circles. While the perspective might sound interesting to try, it's really disorienting, especially when the ball gets by the infielder, then the camera jumps to the outfielder to make the play. The balls fly in at you so fast, it's hard to tell where to go fast enough to make plays that in other games would seem routine. The problems persist when you're at the plate because when you hit the ball, you see it through the fielder cam, making it tough to judge how far away the outfielders are and whether or not you can tag up and take the extra base. This is also an instance where MVP's PIP running would come in handy, as the dots on the diamond just don't cut it anymore.    To make matters worse, when the computer is fielding, they will occasionally show you the wrong fielder, making it extremely difficult to comprehend what's going on. There was one instance where the camera was focused on the center fielder while the ball was really being caught by the right fielder in the distance. The center fielder they were showing was playing shallow, while the ball was caught in deep right. Since the camera was on the shallow fielder, I didn't send the runner tagging from third even though he would've easily beat the throw from deep right. Another instance took place on a chopper off the plate. The camera was positioned behind the shortstop even though the pitcher was making the play. The pitcher bobbled the ball and the runner was safe, but I didn't actually see what happened until I looked at the replay.   Speaking of replays, ASB's replay system is horrible. You can't focus on specific players, just the ball, so forget trying to see what your favorite star was doing if he wasn't around the play.    Graphics   ASB's players seem a lot stiffer than the ones featured in MVP and the transition animations are nowhere near as smooth (you can really see this from the camera options other than Fielder Cam). The throw to first might get the runner by a step, but instead of stepping off the bag, the first baseman goes into the All-Star crouch that all fielders get into after each play, and even faces toward the outfielder instead of checking back toward the other runners on the bases. You also won't find the same number of batting stances or pitching motions, taking away from the realism of the game. On the plus side, the stadiums look fantastic and feature incredible details from the train in Houston down to the finest blades of grass.    Sound   There are times where ASB's atmosphere really makes you feel like you're sitting in a ballpark. The ump will blow a call and you hear some guy yell ~What are you watching? What are you looking at blue?~ and it really makes you laugh (and think that they need to cut off the beer sales). But at other times the crowd really seems dead. Sure, they might cheer when you hit a homer, but as soon as the next batter steps to the platesilence. The home crowd also doesn't boo or heckle the opposing team when the knock one out, instead giving them the same silent treatment I was just talking about.  Sometimes the most fun I have playing All-Star Baseball 2005 is when Im not actually playing a game, but running my franchise or my expansion team, looking for free agents, and deciding whether or not to pickup a player off of waivers. Now, that's either a great compliment to the depth of the game or a slap in the face to fielder cam, I haven't decided yet. Fielding is such an important aspect of every contest that it really negatively affects my overall take on an otherwise enjoyable game. Some people might like the new challenge the camera provides, but I for one don't. The more you play, the more you get used to it, but that never makes the mode fun and in the end takes away from the overall experience. And even when you switch to a different camera angle, that's when you really miss the smoothness of EA's game. If you're a hardcore baseball fan, you can look past it and still find plenty to get excited about, but the casual gamers will find their best times with MVP.", "date": "Mar 23, 2004"}