{"name": "Wade Hixton's Counter Punch", "name_review": "Wade Hixton's Counter Punch", "ref": "https://www.ign.com/articles/2004/03/23/wade-hixtons-counter-punch-2", "text": "Whenever a Game Boy developer releases a boxing game on the handheld, it's almost always followed up in review with, ~Game X is all right, but it's no Punch-Out.~ After the release of Super Punch-Out! on the Super NES, Nintendo has left a hole in the market that many Game Boy teams have attempted to fill with their own take on the arcade boxer. But as hard as they try, these designers miss the boat on what made Nintendo's series such an amazing videogame and come off second or third rate boxing designs...especially when compared to Nintendo's true classic. Inferno Games and Destination Software, on the other hand, recognize just how great the Punch-Out! design really is, and pay tribute to it in Wade Hixton's Counter Punch. The core gameplay of Counter Punch is absolutely, one hundred percent inspired by Nintendo's game, but tweaked ever so slightly with its own graphic style to make it at least feel like an original design. The result is a great arcade boxing experience on the handheld, even if it's lacking just a bit in variety. Features Eight characters (one hidden) Cartridge save (three slots) Counter Punch follows the mishaps of Wade Hixton, forced to fight when his car breaks down. The town of Big Piney's full of colorful characters, and Wade must prove himself in the ring in order to get his car back and skedaddle. It's like the movie Doc Hollywood, if Michael J. Fox put on some boxing gloves.  At the very least, Counter Punch has an absolutely fantastic graphic style with some amazing, classic cel-style animations for each of the game's characters. Though the cutscenes between matches are entirely static, in the ring all of the fighters move with incredible fluidity. Like Punch-Out, the attacks in Counter Punch are quick, two frame animations, but they look stunning in action. These attacks are accompanied by silky smooth idle animations, a clear indication of just how talented Inferno Games' art team is. There are some animations that could have used a bit more ~flair,~ more specifically in knocking down the opponents. All of the characters, with the exception of Wade himself, collapse to the canvas in an unimpressive heap with very little style. Unless, of course, they're knocked out with a Super Move, something that we'll get to in a bit.  The game doesn't stop at its pretty looks. Counter Punch's core gameplay is completely lifted from the Nintendo classic boxer. Much of the fighting involves dodging or blocking the opponent's move and following it up with a series of punches of their own. The idea is, of course, to whittle down the opponent's stamina by watching for the move that indicates which side the punch is coming from; if it's coming from the left, dodge left. From the right, dodge right. This is directly opposite of what's required of Punch-Out's gameplay, obviously changed up so that veterans of Nintendo's classic won't blow through the game right from the get-go.  The differences between Counter Punch and Punch-Out's gameplay are subtle but plentiful. For example: players can, and should, take their fight winnings and purchase super moves that can be activated when a special power bar fills up. Activating them should be a simple matter of hitting both A and B buttons together with a control pad direction, but this control scheme needs to be so precise that it's sometimes difficult to mash the two buttons together in order for the game to recognize it. Still, with a little practice players can pull off some great finishing moves to send the opponent to the mat. Counter Punch's challenge is a rising and falling curve; at the start, it's tough to get a handle on what's required by the player. After recognizing the patterns, though, it's just a matter of timing in the dodge, blocks, and counters. All of the fighters in the game have similar attacks, but it's up to the player to familiarize themselves with the poses that indicate the High or Low left and right punches. All of the characters also have a series of special moves that must be avoided or they'll cause some serious damage. Once they're learned, though, the game doesn't get much more difficult; as players progress through the humorous storyline, they can fight and refight the same line of characters, and though they might get faster, the animation patterns never change. It's a similar issue that the original Punch-Out design had, but it's made even more clear in Counter Punch.  That's the game's one shortcoming: variety. With only eight characters to fight, the game doesn't have a whole lot of lasting value. The roster may match what Nintendo offered in the original NES game, but it's half the amount of characters from the 16-bit sequel. I guess it's the downside for having such detailed graphics and well-animated characters. At least the designers recognized this and threw in some extra modes to bump up the variety; players can fight characters in special challenges where they can only dodge, or block, or avoid getting it a certain amount of times. These unique modes do add a bit more to the gameplay, but not nearly the same amount had there been an additional number of characters in the game's roster. As Nintendo lets its Punch-Out franchise slip through its fingers, it's great to see fans of the game design step up and finally offer a title that brings back that classic gameplay. Wade Hixton's Counter Punch sticks to the formula already established by Nintendo, but bumps it up a notch with extra options and a fantastic graphic style. The entire package is a very impressive effort that's a whole lot of fun to play, but it's definitely a limited design. The designers put in a few extras to keep the action going after the final boss, like using spare cash to buy goofy hats for the referee, but that's honestly not enough to keep it evergreen.Still, even with that said, Counter Punch is an absolute blast as long as it lasts, and its bargain pricepoint set by the publisher shouldn't scare anyone away: it's a steal at 20 bucks.", "date": "Mar 23, 2004"}