{"name": "Samurai Jack: The Shadow of Aku", "name_review": "Samurai Jack: The Shadow of Aku", "ref": "https://www.ign.com/articles/2004/03/24/samurai-jack-the-shadow-of-aku", "text": "The samurai known simply as Jack has finally made his way into a videogame. Making Shadow of Aku a reality was as daunting a task for developer Adrenium as Samurai Jack's eternal battle against the evil shape-shifter Aku. While the episodes are fairly formulaic -- Jack usually has to defend innocents from Aku or some other evil whilst searching for a time portal that will transport him back to his own so that he can save his people from slavery -- the real allure of this cartoon is its stylized presentation.   With simple designs and straight lines, the use of color, choreography, and overall unique visual style makes Samurai Jack a unique viewing experience. Samurai Jackis a show that needs to be seen to be understood, which makes translating its powerful presence into a videogame is no easy task.   With this in mind, Adrenium began development of a game featuring a time traveling samurai. However, shortly into development, Samurai Jack: The Shadow of Aku's publisher BAM! Entertainment cancelled the title. Adrenium had so much love for the property that it continued to work on the project with its own funds. Luckily, its dedication paid off once Sega picked up the title for publish. However, even with Adrenium's hard work and love for the series, was it able to realize Samurai Jack in videogame form? Is Adrenium's 3D translation of a highly stylish 2D world work? Read on to find out.   Gameplay  Shadow of Aku isn't based on any one episode, nor is it a conglomeration of existing adventures. Adrenium worked with Genndy Tartakovsky (the show's creator) to create an original storyline for The Shadow of Aku. Each world Jack enters has its individual story (Jack has to help various people in order to find the time portal), but the stories are all connected via Jack's ongoing search. However, even with Tartakovsky's influence, the story is barely touched upon. Occasional cut scenes and interactions with villagers reveal snippets of uninteresting story that ultimately isn't a compelling reason to play through Samurai Jack.     As with most license-based software, the reason to play through Samurai Jack is because you'll finally be able to take on the role of this time traveling warrior. To create this illusion, Jack will have to fight Aku's minions and overcome environmental hazards in basic brawler/platformer fashion. The combo system is fairly simple -- Jack has a weak and strong attack, which is augmented by different button sequences. While they don't require skill to perform, it will mix up Jack's animation sequences by spinning him around in a whirlwind attack, throwing a few roundhouses into his slicing and dicing, or smashing the ground with an aerial attack.    Of course, faith is occasionally as strong a tool as your sword, so Jack comes equipped with a Zen Meter. Zen powers Sakai Mode, which is similar to bullet time (slows down time and makes Jack's attacks more powerful). This helps you tackle basic puzzles or destroy large groups of enemies (or enemies that have specific weak spots). Zen also powers Jack's elemental swords (like fire or lightening) that will boost Jack's destructive power. Zen is also drained when Jack performs Sakai Combos. These are the most powerful moves Jack has -- and once triggered via the required button presses throw the game into a stylized letterbox mode for better viewing of Jack's finesse with the blade.    For ranged attacks, Jack can use shurikens or a bow and arrows. Blocking is done simply by holding down the L trigger. This deflects all but the most dangerous of enemies' attacks and reflects all projectiles back to their source (killing the enemies) Star Wars-style. If you want to employ skill, projectiles can also be deflected with a correctly timed blade swing.   While there are a fair number of combat options, Shadow of Aku does not require you to know Jack's move set, nor skillfully pull off combos. The game can be easily navigated using the ~button mash~ technique. Even if the combo system isn't complex, it still trips over Jack's ~dress.~  Why? Because it essentially plays the game for you. In Samurai Jack's attempts to exhibit style, it pulls you out of the game. Performing Sakai induced combos basically shows you a cut scene. Deflecting enemy projectiles simply requires holding down the block button.   Once triggering a normal combo, there is no way to stop Jack from going through the entire animation. Even if all the enemies are destroyed, he'll still continue the combo string. Also, Samurai Jack features automatic lock-on (in the form of giant arrows over enemies). While occasionally helpful, it also hinders. If you need health in the midst of battle and Jack is locked onto an enemy, he'll swing in its direction instead of breaking open a crate for some delicious sushi.     Challenge can not even be found in boss battles. When simply hacking away at them until they die doesn't work, you simply have to dodge their attack patterns and enter a ~rest~ period before you attack. While they don't follow the same pattern, none are complex. Once you wait long enough for them to complete the cycle, it's obvious when you need to strike.     While the platforming elements are far from as annoying as the combat -- especially after witnessing chasing enemies disappear as soon as you enter a new room, they aren't with out problems. Primarily, Jack tends to get caught on objects, whether they're enemies he's maneuvering around or boxes he's trying to destroy. The rest of the platforming elements, besides for negotiating treetops or lava flows, involve simple puzzles like getting keys from fallen enemies or cutting ropes to make a statue fall.    Throughout his adventure, Jack will also have the opportunity to rescue imprisoned villagers. While rescuing will garner elemental swords, it's rarely worth watching the same animation of a cage being freed and some captive screaming ~Hooray!~ over and over again. Also, Jack can pick up statues scattered throughout environments that can be exchanged for increased strength, health, or Zen meter.    While the six hour adventure that is Samurai Jack: Shadow of Aku has a lot of faults, there are a few endearing traits that are worth noting. While they don't improve gameplay, they are things Jack fans will appreciate. If you let Jack sit through his idle animations, he'll begin to weave a straw hat. If you let him finish, he'll wear his trademark hat until he takes damage. Jack can also acquire various sets of armor. As he gets hurt, the armor will appear dented, broken, and flap in the wind. Or, if Jack gets hurt enough without armor, he'll lose the top of his kimono and show battle scars on his body. When almost dead, he'll limp around levels. It doesn't make the game, but there interesting to see and help make Shadow of Aku bearable.    Graphics:  Adrenium, for all its love of the series, has created one of the greatest travesties. Shadow of Aku fails to capture the style of Samurai Jack. In fact, it's an ugly game. Making Samurai Jack a 3D game was a bad idea to begin with because the art style isn't compatible. And, Shadow of Aku has admirably followed through with this notion. While the environments are fairly simple, much like the show -- it doesn't carry the same presence in 3D and makes for a rather bland presentation.    Small nuances in animation, like Jack's armor flapping against his body, are excellent, but the actual combat seems far too stiff. Again, the animations are in some way mimicking the style of the show, but it doesn't feel like you're controlling Jack -- especially once you trigger a combo animation. However, there are some nice particle effects for explosions and destruction of enemies. Some vanish in wisps of smoke while others are smashed to smithereens. Far from exciting, but it is a noticeable inclusion.    The saddest part of this whole affair is that even though the artists consulted on Shadow of Aku, the cut scenes don't reflect the shows art style. Instead, they're in full 3D, like the game, and actually look worse than the in-game graphics. Everything is incredibly angular and the only way to describe it is awful. It's just sad that in no way was the show's incredible presentation translated into the videogame.   The other big concern with Shadow of Aku, besides for frequent load times, is the abominable frame rate. At first, you might suspect the slow down is due to lots of enemies on screen. But, then you realize the game will move at a snail's pace when Jack rounds corners or abruptly changes directions. It doesn't happen all the time -- its onset usually appears to be completely at random -- but it is certainly enough to upset your game.    Sound  Sound is perhaps the best portion of Shadow of Aku. The show's composer has helped with all of the score -- including the Sam Jack theme. While overall there isn't a lot of variety, the music does change to a hectic tempo when you're fighting hordes of robots. All the voice acting is done by the original cast. Sadly, there isn't that much of it besides for Jack occasionally shouting out ~Sushi!~ or the infrequent cut scenes. Sound effects are also taken from the show, including all the known clashes, slashes, explosions, and whir of projectiles -- but after hearing the same sounds throughout the entirety of the game they tend to get old. At least everything is authentic. Overall, it's a decent job.I'm a huge fan of Samurai Jack. It's one of my favorite cartoon's (behind Aqua Teen Hunger Force). The notion of a Samurai Jack game immensely excited me. Then, I played it. The fact that the game in no way captures the essence of Samurai Jack, even though Cartoon Network provided so many resources for its creation) is incredibly distressing. And sad. I could forgive a lack of story, or even a resemblance to the show's fantastic sense of style. But, the fact that the game is extremely easy, boring, and annoying is beyond forgiveness.Shadow of Aku is generic in the extreme. While it's hard to recommend it to people that actually play games, I would usually say that most licensed games are worth a look if you're a fan of the series. Shadow of Aku is perhaps even worse to be played as a fan because its faults are even more glaring. If you're curious to see what it's all about, give it a rental, but the six hours of mediocre gameplay and few unlockables (background art, sketches, and character models) don't justify a purchase -- even if you are a die hard fanatic.", "date": "Mar 24, 2004"}