{"name": "Dune 2000", "name_review": "Dune 2000", "ref": "https://www.ign.com/articles/1998/09/17/dune-2000-2", "text": "Dune II was one of the greatest games of all time. Not only did this classic introduce players to the real-time strategy game, but it also managed to deliver all of the feel of Herbert's Dune universe in the process. The units were well balanced, the missions helped players ease into this strange new world by teaching them the basic skills they'd need to survive. Unfortunately, that was a very long time ago. Since then the real-time strategy world has taken off, first with Warcraft and Westwood's own follow-up Command & Conquer, and later with waves of rip-off titles. This new surge of releases added a great deal to the genre, from multiple unit selection, to waypoint control, and more recently, 3D units and terrain. Knowing this, I was extremely eager to get my hands on Dune 2000, Westwood's remake of their early classic. What I found instead was a title that seems to be outdated already. Dune 2000, while certainly better than its predecessor is lacking many of the features that are absolutely vital for a real-time strategy game to compete in today's market.  First let's cover what's really cool about the game. For perhaps the first time in my life, I have to admit that I absolutely loved the FMV footage in this game. All of the game's characters look as if they crawled straight off the set of Lynch's film, and the acting is superb throughout. As the game continues, you'll be treated to movies that help push along the plot, which in the case of the Atreides and Harkonnen pretty much follows that of the books and movie, but with the Ordos actually offers up an entirely new race and story. All of the graphics within the game are similarly entertaining  each of the different buildings and units looks exactly like you'd imagine it would. In fact, the entire feel of the game is excellent which makes that much more disappointing that the game is so damn dated.  For the most part, Dune 2000 seems to be frozen in time somewhere around the release of Red Alert, which makes sense, seeing as that's the basic engine that the company used. Players have all the basic options that you'd expect from that era, from unit grouping and map location hot keys to a scatter hot key and a guard building option. Like any other game, players receive a briefing at the beginning of the game, most of which involve mining a certain amount of spice or utterly eliminating an opponent, and then they go to the play screen to actually tackle it. These single player missions are fairly well designed, and once completed offer gamers a couple of choices over which mission they're going to take on next. The whole structure is very simple and even the most basic strategy gamer should have no trouble at all sorting out what they're supposed to be doing. Does all of this sound familiar? It should. It's almost exactly the same game Westwood released as their original Dune II.  If you play a lot of real-time games in a multi-player mode, you've probably already realized that there are a lot of features missing from the above list. To keep things simple, I'm going to pick on just three areas  the lack of waypoints, the lack of any sort of escort option, and the horrible, horrible AI. Okay, the first area is easy. There is no option for players to set or use waypoints. Want to try and sneak around to a back entrance? Want to try and cross the sands on several different rocks instead of over open sand where you can be eaten by a giant worm? Then you'll have to hover over your units and guide them every step of the way. Welcome back to the golden age of gaming. Let's move on to the escort option. In a world where every person the player meets offers conversational tidbits like, ~the Spice is life,~ and ~the Spice must flow,~ you'd think that some one would have worked out a way for units to patrol alongside a harvester. Instead players can expect to hear, ~your harvester is under attack,~ and scroll back up to find his nearly destroyed spice miners fleeing the scene of attack while a group of combat units sits idly by presumably talking about the charms of Freman women and the fact that while it may be hot, at least it's a dry heat. Which brings us to the last of my big issues, the game's AI. Here's how it works. If a player has a group of seven units clumped together, and an enemy unit comes within range of one of them, those two units will get into a firefight while the rest of the units sit there. This one simple problem keeps popping up again and again and makes guarding the main base very difficult to say the least. There is a guard option that will make sitting units converge on an attacker, but the fact that protecting your own isn't a default setting just seems ridiculous to me. The problem doesn't make the game unplayable, but it does make the whole exercise seem a lot more like work than play. Having to tell each one of your units to enter a battle separately is a real pain in the ass. Period.  The multi-player mode can be summed up in two words  Trike rush. That's right, like many poorly balanced multi-player titles, all a player really needs to do to win Dune 2000 is to manufacture a few trikes early in the game, and immediately destroy the enemy's harvester. Since there's no escort option, and the trikes are so fast, there's almost no way to protect them. The only way a player can try is to generate a similar number of trikes and constantly surround his harvester, a task that will almost certainly keep him from being able to build his own assault. While I'm sure that there are players out there who are kind enough to keep from doing this to you, I didn't find any of them here in the office. Let me assure you that it didn't take long for most of us to go back to playing Rainbow Six.  Dune 2000 could have been fantastic. But one gets the feeling that Westwood didn't really want it to steal any thunder from the rest of their lineup. What's left is a game that has loads of atmosphere and vision but can't compete with any of the games that have built themselves on Dune II's legacy. By the end, I found that I was putting up with the game to get to the FMV sequences, and that's just scary. A very basic real-time strategy game that is recommended only to die-hard Dune fans and perhaps beginners who are still learning how to play real-time games.  -- Trent C. Ward Overall, while Dune 2000 may be worth playing to some on the PC, any good aspects or ideas are completely wasted on the PlayStation incarnation. The main problem is definitely the difficulty in micro-managing via a game controller -- As a play experience, this alone takes away any reasonable playability, and the poor graphics and uninspired theme round off the overall bad gameplay. Steer clear of this one.", "date": "Sep 17, 1998"}