{"name": "Jagged Alliance 2: Wildfire", "name_review": "Jagged Alliance 2: Wildfire Review", "ref": "https://www.ign.com/articles/2004/04/06/jagged-alliance-2-wildfire-review", "text": "Jagged Alliance first appeared a decade ago. It was an alternative to the X-COM series, a squad-level tactical game whose distinction lay in its roleplaying elements. The mercenaries you hired didn't simply have stats--they also possessed quirky personalities. It was up to you to figure out what those individual quirks were and how to best manage your bizarre collection of associates as you worked in non-linear fashion towards both small and larger goals.  Five years later, Sir-Tech released Jagged Alliance 2. It was really the breakthrough title for the series. Though it reduced the distinctive personalities of mercs to nothing but voices and images, the game's clever mix of tactical combat, strategic juggling of resources, random enemy movements and heavy dose of roleplaying made it extremely popular at the time. I reviewed both games positively in national magazines when they first appeared, but ignored JA2: Unfinished Business, which showed up a year later. It was a very minor add-on with no new features.  And that's where matters have remained, until now. Sir-Tech is a very small company these days, with limited resources. As a result, the latest release in the franchise hasn't turned out to be a new game done by the home team, using JA2's aging but acceptable engine. Instead, it's a third-party mod.  Some games have developed entire modding communities, such as Morrowind, Neverwinter Nights, and the Total War series.  I've been particularly impressed with some of the BG2 mods, because the modding tools provided by the developers to their gamer communities in the other titles simply weren't offered to BG2 players. The efforts of people to create new party NPCs with their agendas and quests, or even (in one spectacular case) rewrite the entire game, gets a thumbs-up from this crotchety old fart. Time was when the best of youth put such ambition and knowledge into robbing banks, but creating ingenious game modifications isn't a bad second-best.   Wildfire, then, is a mod, not an expansion, much less a new game, and comes from a part of the modding sub-genre we might call ~game machismo.~ If you've ever haunted game boards before, you probably know what I mean--that portion of the gaming community which feels a particular title, any title, is nowhere near tough enough. Typically, strategy games are the main target for this input, though it's a theme elsewhere, as well. This kind of player complains that weapons don't act realistically and that there aren't enough varieties.  Explosions don't look real, and the animated destruction of body parts seems phony. Army attrition rates and weather patterns are off.  hile most people might find it difficult getting through a game on a moderate difficulty setting in 80 hours, these folks are ticked at same title's short game time. It took them only 15 hours on a hard setting, with one arm tied behind their collective backs, one eye closed, while being forced to listen to boy bands. Sure, that's a deliberate exaggeration, but not by much.  The first clue that we're dealing with a Wildfire mod coded according to this philosophy is the fact that, of all the things which could have been redone from the original, it was the weapon sounds that were singled out. There was nothing wrong, per se, with the batch of weapons sound found in JA2, except that the modders felt they weren't authentic. (The main difference, to these uneducated ears, is that the new weapons' sounds distract in an annoying way, like a very short, distinctive piece of music played over and over.)  And just as you'd expect, there are more weapons, and all of them have been rebalanced to cause more realistic damage.    The visuals haven't changed much in this mod. Grass has been added to some areas to provide more cover, and objects have been moved around to supply a greater strategic challenge on a number of screens--but that's it. There are no new mercs, structures or resources. Nor is Wildfire a rewrite of JA2.   new subplot involving the Mafia has been added, but it's  main purpose seems to be driving down loyalty for your side among the populace, thus creating more enemies and less money for you (see machismo, above). It takes a lot more effort to convince people, especially important NPCs, to trust you in Wildfire than in JA2. Key people who can provide access to guns, talent and money are simply very suspicious of your small group of mercs. Starved for resources, you may occasionally feel while playing the title as though you were Steve Jobs and Apple trying to defeat the evil occupying forces of Bill Gates' Microsoft.  Or, more than occasionally, because enemy numbers, skills and fire power have been drastically ratcheted up to increase the difficulty level of Wildfire, in lieu of AI improvements. Where the dictator Deidranna's forces appeared in reasonable numbers before, they now show up for the same combat situations in overwhelming numbers. It's only a slight exaggeration, too, to state that many enemies are walking arsenals, even in the early scenarios designed to ease your entry into the game. The original JA2 provided a subtle advantage to your enemies in the form of weapons and supplies that were usually just beyond what you could find or afford yourself at any given time. But in Wildfire, many ordinary soldiers wear and shoot stuff that gun collectors' dreams are made of. Freebie goods that JA2 placed in local buildings you liberated have been cut back, and it seems that locks are much, much harder to break even on the flimsy shacks that pass for Arulco's Home and Garden Network. One of my mercs had a rating of 78 in lockpicking, and the skill was pretty useless.      It all adds up to the fact that Wildfire is harder on its novice level than JA2 was on its hardest level. This will probably suffice to enthuse some JA2 veterans, but I ended up wanting new gameplay. And you'll look in vain for anything approaching that in Wildfire.  I had some issues, too, with bugs that weren't noticeable in the original JA2. The game repeatedly crashed down in Arulco's mines, a few scripted events froze, and the bodies of killed enemies vanished at odd intervals. There were a couple of instances of crashes involving the use of specific weapons. I've also gotten in the habit of saving a game before sending any mercs into a room, simply because many doors close on my team and lock forever.  Most of these weren't problems that occurred in JA2. And just to be sure, I did a second installation of both titles on my old system used back in 1999. Nothing changed. JA2 still ran fine, with occasional minor glitches, and Wildfire still stopped me dead in my tracks. Bundling the games together puts a different spin on matters, however.If you've never played JA2, it's still worth getting, despite its 640 x 480 resolution, for its intriguing combination of strategy and RPG, rich humor and ever-changing challenges. But if you know the title well, we recommend taking a pass on Wildfire. This earnest but unimaginative release makes the game much tougher, but no more interesting.", "date": "Apr 6, 2004"}