{"name": "Desert Rats vs. Afrika Korps", "name_review": "Desert Rats vs. Afrika Korps Review", "ref": "https://www.ign.com/articles/2004/04/08/desert-rats-vs-afrika-korps-review", "text": "In the real army they spend months training individuals to instinctively react to changing conditions in a way that supports the goals and objectives of the army as a whole and the other individual allied soldiers. Everyone, from tank drivers to artillery spotters to supply officers to riflemen, understands the overall mission at hand and how their separate role fits into the overall plan. A strong hierarchy of command ensures that company-level commanders can direct their platoons into battle without necessarily leading each of them by hand.   I bring this up to make a point, namely that the guy leading his rifle squad in an assault on an enemy position doesn't necessarily need to worry about whether or not the supply trucks are able to reach a friendly platoon of tanks who are sweeping around the enemy flank. This is a roundabout way of saying that the concept of historical battlefield realism doesn't necessarily jibe with the traditional presentation of most real-time strategy games. Where gamers might have to juggle a dozen or so different unit types in Command and Conquer or Warcraft, these World War 2-themed games often require the player to manage upwards of a hundred different types of units.   This is typically where games like Close Combat and Sudden Strike bog down for some players. Not only do they have to be aware of what each unit's purpose is; they also have to coordinate those purposes in the most efficient way possible.  Combine that with distinct and dissimilar unit rosters for each side and you've got a game that's much more intimidating than that found in most other RTS games.   Most gamers are comfortable with the rock-paper-scissors approach of Age of Empires where certain unit types trump others. The historical battles represented in Desert Rats follow a similar approach but the number of units involved are much higher. Infantry, tanks, AT guns, artillery, reconnaissance units, supply and repair trucks, off-map resources like air strikes and a host of other toys are here. Though the game doesn't go out of its way to point out where and when each asset should be brought to bear, the scope of the battles, particularly the early ones, are small enough to let the player get used to a few unit types at a time. Still, managing the different kinds of infantry (and even telling them apart on the battlefield) is one of the game's biggest challenges.   Though most games of this type eschew resource management and base-building, Desert Rats does have a few new interesting things to manage. The game offers pre-built forces for each mission but you can use points to buy additional or different forces. Though a neat feature in theory, the force balance is usually pretty good to begin with and you run a real risk of leaving large gaps in your army if you just start buying the units you think you'll need (not that the game gives you much to go on in this regard.)   A prestige system gives you access to super units if you manage to complete hidden mission objectives. While it's a hell of a reward and a real enticement to explore all of your options within a given mission, the fact that you don't know what's being asked of you can make searching for these hidden objectives quite frustrating.    If not exactly smart, the enemy units are positioned on the map in such a way as to present a challenge to you. Every once in a while you can exploit the enemy's ~intelligence.~ More than once I was able to attack enemy units without triggering them to look for me (or even retreat -- or move at all -- in a few cases). Pathfinding can be a real problem for your units as well, with units sometimes going the long way around certain obstacles or, on the other side of the coin, plowing right through minefields you've already identified.    The game fails to model things like command and control or morale which seems at odds with its otherwise authentic modeling. You do have hero units, however, who can give bonuses to nearby troops. Better still, you can load the various types of infantry into the vehicles and gain unique benefits. Put a scout in your Sherman and it will enjoy a longer sight range. Put a machine gunner in your Bren and its lethality will increase. This is a really neat way to customize your army but it only adds to your micromanagement woes.   Strangely, there are two ways to experience the campaign in Desert Rats. You can opt to play through either mission at the start or begin the Story mode which merely puts the two campaigns in order. Sure, there are a couple of extra missions in the Story mode but the distinction between that and the Campaign mode still escapes me. In any case, the 20-mission campaign is best enjoyed in the Story mode which starts the player with the slightly easier German side.    There's much more of a story here than in other war-themed games. Where most other games in this genre try to pass off operational briefings as ~backstory,~ Desert Rats tells the story of two men, former competitors at the Olympics, who now find themselves on opposite sides of the war. The cutscenes driving the story are okay; they still play out according to scripted triggers and yank control of the game out of the player's hands. The fact that the two opposing commanders can talk to each other locked within their tanks at opposite ends of the battlefield is a bit contrived. The story comes through much more strongly in the between-mission journal entries.   The mission types run the full gamut. Some will have you seizing a roadway and escorting a convoy from one side of the map to the other. Others will have you leading an assault on fortified enemy positions. Still others will have you rescuing or supporting other troops on the battlefield. In one case, you have to support for a beach landing already in progress and keep the casualties for the landing force below a certain number. There's a nice variety here.   Once you're done with the campaign you're pretty much done with the game. The lack of a skirmish mode definitely hurts the title and may indicate that the AI isn't savvy enough to build its own armies or simply can't read random maps. Beyond that there are a few interesting multiplayer modes. One has the two teams alternating between attack and defense as each receives waves of fresh reinforcements. The trouble is that there are only a few multiplayer maps and there's no simple way to browse for matches within the game itself.   Compared to other wargames, Desert Rats vs. Afrika Korps is gorgeous. The small details on the landscape are what impress me most. Sand is whipped up by vehicles and hangs realistically in the air. There's even a sandy haze that passes over the screen from time to time and it really sells the environment. Weapons fire demolishes nearly every structure on the map and vehicles knock trees to the ground as they pass through them. Small tire tracks behind the vehicles and the burned out hulks of destroyed tanks and trucks help the map tell the story of the battle. The units are great too, with all manner of details. The issue of performance is worth noting here as well. Even with the glorious explosions and palm trees and fully animated Tigers, the game still runs quite well.   My only gripe on the issue of graphics (apart from the fact that the foot soldiers are all pretty much indistinguishable, that is) is that the camera doesn't tilt enough. Though you can zoom and rotate to your heart's content, you can only lower or raise the angle of view by about 5 degrees off of the vertical.    Also on the subject of presentation, I have to say that the accents are pretty terrible, particularly those of the Americans. Whether this is the result of some Hungarian misconception that all Americans sound like Quaalude-popping Brits or simply a matter of not being able to find an American actor who needs a job isn't yet clear. While we're talking about it, there are a few odd translations in the game. Troops landing on the beaches are said to be ~ashoring,~ for instance. What the hell is that? I'm from the South and even I don't say things like that. (I do however, entreat people to ~cut off~ lights when they're not using them.)  Hitting the balance between historical authenticity and compelling gameplay is very hard. Desert Rats vs. Afrika Korps walks this line pretty well but still suffers from too much specialization, particularly among infantry units, to be easily comprehensible. The few shortcomings in terms of pathfinding and AI certainly add to my frustrations. Still, after the staid dryness of games like Sudden Strike and Blitzkrieg, it's nice to play a game that has bit more personality.", "date": "Apr 8, 2004"}