{"name": "Bejeweled", "name_review": "Bejeweled Multiplayer", "ref": "https://www.ign.com/articles/2004/04/10/bejeweled-multiplayer", "text": "PopCap Games has created a monster. You know what we mean if you've ever played Bejeweled on a handset, PDA, or the PC. It will initially remind you of SEGA's Columns, but with the intensity ratcheted up a good nine notches. Try it for a few minutes and you're a hopeless junkie.   And now you can find other junkies to challenge in a contest to determine just who is the ultimate Bejeweled nerd.   Features:  One-on-one competitive play  Scoreboards  Special bombs juice up multiplayer games  Watch your opponent's game, live!   Bejeweled Multiplayer is the natural evolution for the PopCap neo-classic. The game does indeed include the regular single-player game, where you are tasked with rotating pairs of colored gems, trying to line up three like-hued stones. Match 'em up and the jewels vanish, causing other gems to fall into their place. If you're lucky or smart (or both) you can start racking up some impressive combos that result in huge scores.   But it's the latter half of the title in Bejeweled Multiplayer that has us hooked. There really is something to be said about playing against another person, even if you cannot see or talk smack to them while dropping a horde of gems into place. However, JAMDAT and Demivision, the two companies behind this mobile edition, almost do you one better. You may not be able to see your opponent, but you can see their game in the lower part of the screen. Trust us, nothing gets you fired up faster than peeking down to watch your faceless opponent raking up monster screen-clearing combos while you struggle to make a single match.   Now, just competing with another person is cool, but there are new ~explosive~ stones thrown into the mix that really take the contest to the next level. These special weapons possess game-effecting (although temporary) powers, such as Freeze and Crazy Pad, Here's the run-down on the special gems:   Crazy Pad: Reverses controls  Cave-In: Obliterates all gems from the board  Freeze: Gems don't vanish after getting matched  Zero-G: Gems do not fall into place after a match is cleared   Evil, yes? And man, are they ever fun to unleash on an unsuspecting opponent. Bejeweled Multiplayer is one of those games that must be played to be believed -- and we cannot recommend you make with the downloading soon enough.  Bejeweled is making a very serious run for Tetris, and Bejeweled Multiplayer may just cement the puzzlers status as best-ever in my book. There is nothing like smashing an opponent's pride from afar -- well, except maybe doing it to their face, but that's not very gentlemanly, is it?", "date": "Apr 10, 2004"}