{"name": "Painkiller", "name_review": "Painkiller Original Soundtrack", "ref": "https://www.ign.com/articles/2004/04/12/painkiller-original-soundtrack", "text": "The Painkiller original soundtrack is a mind numbing expulsion of industrialized grindcore pop metal with slight infusions of ambient and techno tainted turntable fluctuation. Skidding from shredding guitar blasts--that owe more than a small debt to both the incendiary excursions of Joe Satriani, albeit slightly more amateurish and the shredmatic propulsion of Buckethead, sans the irony --into chugging electronic emersion, it unleashes a skirmish of instrumental flurry that probably works best when one is immersed in game play.   The album commences with ~The Painkiller,~ which shuffles looped scratches into a guitar/bass/pounding rhythm melee to create a skirling mess of industrio guitar spasm. It's a metallic mish-mash of varying styles and ideas that starts to repeat itself, but thankfully wraps up just under 2-minutes. It's immediately followed by ~Morph in,~ which kicks up the guitar rampage several notches, jacking the BPMs up a few levels, as well, while adding in some synchronized electronic shuffle rhythms underneath. Subdued waves of electronic synth grooves lurk underneath. The overall effect is that of a robot manned heavy metal band playing at a futuristic backyard BBQ after downing far too many quarts of unfiltered oil.    ~Banshee~ starts out with fuzzed out machine hum-rush, then slips into liquidic keyboard fills that are augmented by looped scratches. Yet the generic, repetitive guitar skirl can be heard running rampant underneath. ~Playing Tarot~ returns to the guitar dominated format, again using what sound like the exact same scratch samples as heard on the previous songs. The song devolves into a piercing, orgasmic guitar solo close to 2-minutes into the track, succumbing to '80s flashback paranoia something fierce.   By the time you hit the ominous synth saturated ~Lokhi,~ the album has already started to melt into an indiscernible coalescence of glammed-out metal shtick, light-fisted industrial scourge, and slapped-together ambient toneology. ~sWitch~ keeps the guitars skirling and chugging in a blas expedition of head banging excess. ~Corus Dei~ continues the formula to the point of being almost indistinguishable from the previous tracks, as well as the remaining 8.    There are a few moments of visionary brilliance, spots where some cool licks shine through and elevate the music beyond the thresholds of genericism. The whammy sprongs on ~Bear me the Light~ are kind of cool, as is the cymbal crashing clash injected into ~Kill my boss.~ But these moments are not only too far between, but also incredibly brief when they do occur.    In the end, perhaps the greatest letdown of The Painkiller Original Soundtrack is that there really isn't any delineation between the 15 tracks that have been assembled on the CD. Each track keeps a breakneck, up-tempo pace; speed licks churning and chugging into relentlessly repetitive rhythmic outpourings of quasi metal. Additionally, it reeks of obvious nods to Trent Reznor's industrial metal soundtrack for Quake combined with chunks of late '80s/early '90s Los Angeles glam metal (think Motley Crue's Dr. Feelgood with all it's chugging, rhythmic 4/4 bass and guitar interplays and you're on the right track).    In a nutshell it sounds incredibly dated, more like a paint-by-numbers exercise in metal than anything fresh and vibrant. As a result, it really doesn't work that well as a stand-alone album, unless of course you love you some of that acid washed, hairspray infused metallic glamarama. If that's the case, then this album is perfect for the closet shredder and wannabe metal meister, otherwise it's just aggressive music that will slip into the background during game play, possibly instilling a minor sense of aggravation and intensity, but otherwise becoming just that: background music.", "date": "Apr 12, 2004"}