{"name": "Painkiller", "name_review": "Painkiller Review", "ref": "https://www.ign.com/articles/2004/04/13/painkiller-review", "text": "and Operation Flashpoint represent completely different ends of the action gaming spectrum. The key issue of separation here is that there are some people who don't like to think while they're being entertained. These are the people who watch daytime TV and buy Kenny G records. And there's a special class of people, and I'm talking about first-person shooter fans here, who gravitate towards games that offer a wealth of physical challenges and no mental ones. These are the so-called ~twitch~ gamers, gamers whose only concern is moving through a target-rich environment without the messy complexity of crouching, reloading, or exploring. That's Painkiller.  It's not that crouching or reloading or exploring have any value by themselves. Still, when combined with a particular context, those extra moves can do a lot to increase the player's options and limitations. There's more choice involved, I suppose. While games don't necessarily have to go as far as the unwieldy and overly cerebral Operation Flashpoint, I tend to like my action games to have a little more depth and complexity than I found in Painkiller.   There is a story here but you probably won't care. Heck, you might not even notice it expect for the lengthy and tiring cutscenes between the game's chapters. As near as I can tell, after your character dies, he's kept from going right to Heaven and instead recruited to take on the forces of Hell, combating all manner of seemingly random demons and four gigantic bosses. There's also a topless girl whose hair falls chastely over her nipples. She's your wife here and serves as, well, not much -- she's just topless.  The actual enemy and location types are almost as incidental as the story. Fighting undead versions of friars, asylum inmates, ninjas and doughboys just seems too intentionally random. I get that we're fighting the inhabitants of hell here but jumping from blasting ninjas in an opera house to gunning down World War I era zombies at an airfield seems to indicate that the developers had no clearer plan in mind that simply throwing a bunch of random things together. The enemies themselves are dangerous in exact proportion to their numbers. Unless they've been told by the designers to stay in one, pre-scripted sniping location, they generally just run straight for you.  In most cases, they don't have too terribly far to go. The areas you fight in are relatively small, ranging from a single room to the area outside of a city block. After a few hours the spaces open up just a bit, allowing you to fight enemies in a large theater or a sprawling airfield. Still, each location is isolated from the others while you're fighting and the game quickly develops a rhythm of walking into a room, killing everyone there, and then repeating the process until you reach the end of the level. A handy system of regular checkpoints keeps you from having to backtrack much (or thinking about saving the game yourself -- more brain power saved!).   In those rare moments where the next waypoint isn't immediately visible, you'll have a handy compass to point you in the right direction. It even tells you if you're above or below your waypoint, saving you lots of running around. A few times, when enemies still needed to be killed before moving on, the compass seemed to stop working altogether but it always led me to my next waypoint once I dispatched the lone, straight-jacketed, electrified, hellish lunatic lurking in some out of the way corner. In killing these enemies, you release their soul. These small green wisps can be collected to gain health (one soul equals a measly one point) but regaining health isn't the primary point here. Once you get enough souls together, your character enters a brief demon phase in which he becomes an amazing killing machine.  Beyond Hell's rank and file, you'll also have to take on each of Hell's main generals. These boss fights present a challenge initially but, once you figure out the gimmick, they're relatively straightforward. The trick here is in finding out what to do, not in actually doing it. I will say of the bosses that they're just about the biggest thing I've seen in a game. They dwarf your character and really inspire a sense of urgency and fear. Fighting an enemy who's 30 to 40 times as large as you is pretty daunting -- until you realize, of course, that you just have to shoot them in the [blank] in order to take them out.      There are five weapons in Painkiller but with the alternate fire modes, they seem like ten weapons. The pairings themselves are a bit odd; having a grenade launcher attached to your wooden stake shooter or having a laser attached to a handheld, spinning blade makes as little sense as the rest of the game does. Still, it's through these combinations that Painkiller begins to offer some interesting complications. Some enemies are more easily dispatched with certain weapons. The shotgun/freeze ray combo is probably the clearest example of this; some enemies simply won't go down until you've shot the hell out of them -- a quick blast with the freeze ray and the next shotgun blast sends their body parts scattering. In keeping with the simplicity of the title, you'll never need to reload any of the weapons. You just keep firing until your ammo is gone.  In terms of firing, the weapons here seem quite substantial and (with the exception of the bosses) offer a fair amount of feedback when you hit your targets. This is best seen through the use of the physics engine. Point blank shotgun blasts send your enemies tumbling away in a Havoc-powered twirl. Better still, the stake gun can actually pin enemies to the walls, allowing you to get some really grisly visuals. Other objects in the world respond to physics. Loads of barrels and crates can be knocked around (and exploded) and things like carts lying in the street can be manipulated as well. Nowhere are the physics more impressive though than when a giant enemy is knocking pillars and columns down around your ears. Beyond a few odd touches (like frozen enemies hanging in mid air) the physics are reliably believable.  Unreal Tournament 2004 has done a lot to maintain a twitch-like feel while also giving gamers some interesting strategic complications too. So in the age where one of the reigning twitch shooters has been able to maintain supremacy in that area and add a thinking man's game to it all, Painkiller's ~been there, done that~ approach to multiplayer won't raise any eyebrows. The relatively small number of maps makes multiplayer a very monotonous affair.  There are a few different modes here but, apart from the rocket tube modes, you've seen it all before. The rocket mode seems more an outgrowth of the developer's name, People Can Fly, than any suggestion that such a mode might be terribly fun. This particular game takes place in a small, high-ceilinged room. Players only have rocket launchers in this level and can only kill other players in the air. The complications of managing this mechanic are relatively engaging but even this gets old after a few matches.  The visuals of Painkiller are honestly good enough to make up for the one-dimensional gameplay. Even if the washed out sort of look isn't necessarily your thing, you have to appreciate the details, layout and overall character of each level. Though some of the locations are somewhat non-descript by design, the individual details are remarkable. That the team could achieve this with such a wide variety of locales -- hellish tunnels, dilapidated mansions, military bases -- is a further testament to their abilities. Enemy design is almost uniformly great with lots of details on each model. The World War I gas victims are particularly nice. Animations are relatively solid and each model has a real sense of weight and substance.   What's even more impressive is that this game runs great. Much like Serious Sam before it, Painkiller offers a visual feast out of proportion to its system requirements. Even on moderately powered machines and even with dozens of enemies on screen at a time, the game runs remarkably smoothly with nary a snag or hitch in sight. In a day when pushing the boundaries in terms of graphics is synonymous with running like crap, we hope Painkiller's engine will be put to use in plenty of other places. The only hitch is that the code isn't openly moddable, so it may take time before other developers are convinced of its potential.  Musically, Painkiller is the exact opposite of its title, offering a terribly generic metal soundtrack that seems to hit one tone and stick with it for the entire game. The only sense of contrast here comes from the switch between ambient organ sounds and the aforecriticized butt rock. Weapon sounds are pretty good and enhance the impression of violence and damage that the visuals offer. Voice work (only found in the cutscenes) tends to be somewhat mediocre but, as I've said, the story isn't the point.It's the old debate about quantity versus quality. There's an episode of Frazier where Frazier is writing his own theme song. When his brother realizes that it's become a little complicated, he reminds Frazier that less is more. ~Ah,~ says Frazier, ~but if less is more, think how much more more will be.~ That comment pretty much sums up this game. In the first sense, rather than presenting us with individually challenging enemies, Painkiller opts to throw dozens of enemies at you at a time. On the other hand, since Painkiller focuses just on twitch play, it's free of the distraction of puzzles, plot and, for the most part, personality.For some gamers, bored with the slower pace of games like Far Cry or Rainbow Six, this is a very attractive approach. Gamers who found Serious Sam or Will Rock either shallow or monotonous will definitely find Painkiller to be equally boring.The basic premise of the first-person shooter is as pure and refined here as it possibly could be. Even with the inclusion of exploding barrels and Tarot power-ups, this game is about nothing but putting the reticle on the scary thing and pulling the trigger. Now I like Doom when it first came out and I definitely appreciate Painkiller's roots, but, having said that, games that are simple aiming exercises seem to lack a little substance when compared to more recent shooters.", "date": "Apr 13, 2004"}