{"name": "Rayman Golf", "name_review": "Rayman Golf", "ref": "https://www.ign.com/articles/2004/04/17/rayman-golf", "text": "Golf is a natural fit for handsets -- it's an admittedly slow-paced game of skill, the kind of game that works on the limited tech of current cellphones. However, which several golf games already on the decks, Gameloft needed a hook for their duffer. Why not turn to the ultimate sufferer of phantom limb syndrome, Rayman?   Features:   Complete 18-hole course  Thirteen clubs  Official rules   Rayman Golf may star the charming goofball hero of Ubi Soft's platformer franchise, but this is a real golf game, complete with the same rules and features you would expect from a real-deal duffer. The eighteen-hole course isn't littered with Lums or tended to by Globox -- the sports water hazards, sand traps, and trees.   The game plays like you would expect. You can manipulate the camera to see the entire hole before getting started. Once you're familiar with the hazards and visualize the best path to hit the ball along, you select from your clubs and choose the direction you wish to knock the ball.   Once you are ready to take your shot, press the # key to access two meters along the bottom of the screen. The first meter, on the left, represents the power behind the shot. The meter on the right represents the amount of ~mustard~ you put on the ball, determining a hook or slice. Always consider the wind when making a hot, as it can severely affect where your ball lands.   This being Rayman Golf, the whole thing is presented in day-glo colors -- the greens can't possibly get much more vibrant than this. Rayman himself appears on screen when you hit the ball, following through with his limbless stroke. There are other little animations in the game, such as a frog that appears when you smack the ball into the water.   Overall, the game is very cute -- making it something of a sheep in wolf's clothing because the game is not easy. It requires practice to get good at Rayman Golf, despite its friendly front-end.Rayman Golf is a pretty slick little golf game. It's not quite as engaging as JAMDAT's Tiger Woods game and I did prefer Tiger's swing meters over Rayman Golf's interface. But if you are something of a golf fan, Rayman Golf is certainly a decent download for several afternoons worth of digital duffing.", "date": "Apr 17, 2004"}