{"name": "Serious Sam: Next Encounter", "name_review": "Serious Sam: Next Encounter", "ref": "https://www.ign.com/articles/2004/04/21/serious-sam-next-encounter", "text": "In case first-person shooters have been getting too complicated to keep track of, Serious Sam: Next Encounter could be just what you're looking for. Continuing the series' tradition of piling on the enemies and keeping the ammo supplies high, Next Encounter brings the fun of big, stupid action to the GameCube. It's not a masterpiece, but now GCN owners can see the mayhem that's been running rampant on the PC and Xbox.   Next Encounter is just as serious as the previous games in terms of extreme fighting situations. The closest equivalent in terms of gameplay would be Smash TV, the old top-down arcade title that featured rooms filled with attackers. In a similar way, Next Encounter follows the same formula for every level: enter a room, kill all the enemies, move on to the next room. After going through most of the doors, they'll shut behind you and creatures will appear in the room. A big yellow 'X' will cover the exit until everyone else is dead. Lather, rinse, repeat.   The enemies literally appear out of thin air as they often teleport into the level with a sparkly effect. This can quickly turn a safe-looking room into another den of warfare. During the process of clearing out a room, many enemies will pop in behind you. This means that you need to constantly keep moving in order to avoid any attacks and make sure that you keep scanning the whole room for new attackers. Circle-strafing is usually the best tactic to use for all of the enemies.   With so many enemies coming at you, some serious ammunition is needed and Next Encounter provides plenty of it. Aside from the basic handguns that have infinite ammo, the other guns don't need any reloading. To streamline the killing, holding down the fire button will provide a constant stream of firepower. With the chaingun equipped, it's entirely possible to keep it running for well over a minute as hundreds of rounds get fired and dozens of creatures get dispatched.   There are a few other situations where some platform elements or driving is involved, but for the large, large majority of the time, it's all about the warfare. The platforming is best forgotten since it involves jumping across moving and spinning objects that are suspended over lava and is quickly passed, but the driving does deserve some mention. For the first time, Sam gets to jump into a Hummer-like vehicle and kill enemies by running them over or firing missiles at them. It's possible to blow up the jeep, but running out of gas is usually the bigger threat. Some of the best moments in the game involve charging straight at a group of headless zombies and sending body parts flying as you plow them over. It sends the game into a fever pitch before the gas runs out and it's time to go by foot again.    The other new addition to the series is the Super Combo Mode which sends Sam into a killing rampage. Getting a combo of 20 kills in a row activates the Super Combo Mode and for 10 seconds Sam moves faster, his weapons become more powerful, and the points for killing each enemy doubles. It's a novel new addition and creates a frenetic feeling, but there's no way to keep it going. Strangely, it just dies even if you're in the middle of mowing down a crowd of skeletons. There's no way to triple or quadruple the points for even larger levels of combos.   While Next Encounter provides plenty of thrills in terms of keeping the non-combat parts of the game to an absolute minimum, it still lacks the chaotic feeling it feels like the game is reaching for. The biggest fright that the game provides is the uneasiness that a few more monsters have zapped in behind you, but this is such a cheap trick and it gets old way too fast. With monsters just zapping in whenever they damn well please, there's no reason to really look out for possible ways for enemies to come into the room. Where in another FPS, thugs might pour in through a doorway or a blown-open hole in the wall, here it's just a matter of shooting until monsters stop dropping from the ceiling or teleporting in.    Next Encounter's biggest asset and liability is the sheer brainlessness of all the action. The gameplay is very arcade-like and rewards running into rooms and shooting constantly. Barely any planning is ever required for any of the battles. The only thing to think about is what weapon to use and except for enemies that will get very close the best choice is to use the most powerful weapon on you. This makes it easy to jump right in, play a level and walk away, but any extended session quickly becomes too repetitive for comfort.    For a game that is also so serious, there is a moderately difficult, but rarely serious, amount of enemies to deal with. It would be more satisfying to have hordes of screaming headless soldiers running at you rather than a group of three or four. Occasionally, there will be a large group that can be reason for some concern, but it's usually a stream of teleporting enemies that will be the opposition. It can also be tough to get a good solid Super Combo going and slaughtering dozens of creatures to rack up the big points. Too many times, I got a Super Combo only to run out of anyone to kill.   With so few elements of the gameplay besides the shooting standing out, there's little to nothing to hold any interest once that gets old. Multiplayer provides some co-op and one-on-one action, but the graphics are too rough to look at for extended sessions.    Graphics  The world of Serious Sam is garish, bright, and pretty much godawful. Both the monsters and the environments run on dangerously few polygons and are covered with simple textures. This helps the framerate stay solid, but the look is barely much better than the PS One. This makes it all the more disappointing that the amount of enemies never gets into the ridiculous range with a few dozen on-screen at once.   The best part of the graphics is easily the character design. There's the classic headless screaming guy who holds a lit bomb in each hand as well as Romans on chariots firing rockets, huge brains with robot legs and plenty more. The sight of such bizarre creatures are enough to make you want to get risk death to get a good look before you get down to business of blowing them to bits.     Sound  Speedy techno metal fills in the gaps when you're not quite sure that the action has gotten more intense and the sound effects complete the video game feeling. The best part is the screaming of the headless bombers because as soon as you hear it, you know that you need to find where they are before they run into you and explode. Aside from that, there are no special sounds that particularly stand out since the weapon sounds and music drown most everything else out.Next Encounter is not the most complicated of games, but it does have a few charms. The enemies are ridiculously goofy and there's plenty of action. If you miss the old days of DOOM or just want a cheap thrill, then Next Encounter will help pass the time even if it may make your brain feel like it's shrinking. With a planned retail price of $19.99, this will be a quick fix for bargain hunters or those who just can't wait until the next shooter comes along.", "date": "Apr 21, 2004"}