{"name": "Marcel Desailly Pro Soccer", "name_review": "Marcel Desailly Pro Soccer", "ref": "https://www.ign.com/articles/2004/04/26/marcel-desailly-pro-soccer", "text": "While hardly a mainstream sport in this corner of the globe, video game soccer continues to sell well -- consider the success of EA Sport's FIFA franchise. Gameloft has taken on the unenviable task of bringing this sport to handsets, but the end result is quite a surprise. While certainly not the deepest game of footie we've ever played, this is one of the most comprehensive sports sims on any go-go platform.   Features:   32 international teams  Tutorial  Play Exhibition matches or get into the Gameloft Cup  Penalty kick pratice mode   Marcel Desailly Pro Soccer is quite the encapsulated sports experience. The game offers up thirty-two different teams to play with, each team with individual stats like Power and Speed that definitely affect play. Sure, you may want to chose a particular country of preference, but if you want an extra push toward winning, consider putting border bias behind you and picking a high stat club.   Admittedly, despite Marcel Desailly Pro Soccer's excellent controls, the game does take some getting used to. We highly recommend you spend the time with the in-game tutorial that will take you through the basics, from passing to penalty kicks.   Once you're comfortable on your feet, select the length of game -- three, five, and ten minutes -- and hit the field. From kick-off to goals, you will be pleasantly surprised by the level of detail Gameloft put into this little sim. Everything from passing to kicking is smooth, not unlike a console game. And the opposing team's AI is a beast. Not an unfair beast, mind you, but the game does not roll over and take it. Players will chase you down and steal the ball with no mercy, should you ever give them a chance.   The star of the game is the Gameloft Cup mode, which pits you against the rest of the teams -- each with a ten minute game. Sure, it will take serious time and dedication to finish (and win), but for mobile game maniacs, this kind of longevity and replay value is rarely seen. For a real fan, Marcel Desailly Pro Soccer is something that could linger on a phone for months, not weeks.   Marcel Desailly Pro Soccer looks decent enough. The visuals and animations won't blow you off the couch, but they definitely look the part of handheld soccer game. The players are easily identifiable with their different colored jerseys. The fields are bright and green. And the penalty kick sessions, which switch the action behind the player (rather than above, like the rest of the game) look really nice. There isn't much of a soundtrack, save for penalty whistles and whatnot.Marcel Desailly Pro Soccer is an excellent addition to any sports gamer's handset. It offers up a complete soccer experience, including international teams and varied game play modes. Whether you seek a quick footie fix, or the hooligan in you wants an all-day soccer session, Gameloft's game has you covered.", "date": "Apr 26, 2004"}