{"name": "War Times", "name_review": "War Times Review", "ref": "https://www.ign.com/articles/2004/04/27/war-times-review", "text": "Another week, another real-time strategy title set in World War 2. This week's offering is Legend Studios' War Times, a game that makes use of the standard conventions of the genre sparsely peppered with the spirit and personality of its WW2 setting. Legend has managed to create a game here that won't surprise anyone who's played an RTS in the last five years. You should have a pretty good idea of where this game is coming from based on this one ~hint~ provided during the campaign: Build a vehicle factory to create vehicles. It's certainly not a statement that inspires confidence. I guess this ~Light Tanks Factory~ builds, what, ice cream trucks?  There are two campaigns here, one for the Axis and one for the Allies. Throughout the course of the twenty-some missions here, you'll be leading the forces of each of four nations -- British, American, Russian and German -- into battle. Although there are some key differences between the sides (Germans have great tanks, for instance), the units for each side are largely interchangeable.   You'll be given the chance to fight through a number of key battles from the War but they all be presented with a traditional RTS twist. When the Germans invade Poland, for instance, they'll no longer need to worry about the tactics of the Blitzkrieg. Here they simply have to find and kill the Polish general unit in order to claim victory. On the other side of the hill, the British forces will have to evacuate Dunkirk early on. Rather than managing the evacuations, you'll simply have to hold off German attacks until a number of AI-controlled British soldiers appear and race, lemming-like, to the coast.  In most cases, the tried-and-true RTS notion of gathering resources to build barracks and pump out units is inconsistent with the World War 2 setting. Seeking out the oil required to maintain units in the familiar RTS model causes much more of a disconnect for me than, say, having to protect existing oil supplies in order to maintain your vehicles' effectiveness. It's not that I mind having to harvest oil or build new tanks, but the traditional resource and barracks model here feels like a ~Let's just do what everyone else does~ kind of solution rather than an attempt to try to fit the subject matter with the game's format.  The base building wouldn't be so bad if it didn't seem so incidental. You can build any structures in the game without assigning workers to the task. You don't even need workers to initiate construction. Just click the HQ structure in your build menu and place it wherever the hell you want. Lay down a Pump Jack, some Supply Stores and a Barracks and you can start supplementing your starting forces. As you can see, the base building takes a while to get going and it'll be a few minutes before you're able to start cranking out the units. And though it tends to delay the actual fighting, maybe that's a good thing.    Once you get your force built, it's time to explore the game's lackluster combat. Take enemy targeting priorities, for instance. Enemies (and even your own troops when you're not holding their hands) seem to fixate on particular targets without any regard for circumstances. Imagine my horror when German forces poured out of the forest and started attacking a guard tower I was currently constructing. Imagine my disappointment when all seven attacking units were gunned down by one of my riflemen. Rather than focusing on my soldier and then turning back to the completely non-functional, partially built tower, these idiots simply pounded away at the guard tower as my lone rifleman gunned them each down in turn. There are plenty more examples of this kind of singleness of purpose and it makes the AI fairly easy to beat.      And even if you're not that great on the attack, the guard towers make it damn hard to lose. Since they can be repaired as they stand (without requiring engineers or worker units), you can safely place two or three of these towers around every chokepoint you can find and count on withering the enemy forces as they trickle past. The AI seems unable to concentrate their forces effectively and you'll be able to defeat them in detail without really even trying to isolate elements of their armies. The AI seems incapable of staging unscripted counterattacks. In missions where you have to capture enemy installations, nearby enemies will quietly man their posts, completely oblivious to the fact that you're currently holding one of the victory locations with a lone infantryman.   Pathfinding in this game is about as bad as I've seen in a long while. Units collide with each other, causing your vehicles to skate around as if on ice. Trees, buildings and other obstructions cause no end of problems for groups of units. And the horrid pathfinding is only outdone by the almost completely useless formation controls. Units uniformly fail to fall into place, even when moving across level ground. The individual soldiers bump into one another all the time and, after a few seconds of jostling just stop altogether. I've yet to see anything in this game that comes close to resembling the lines and columns I ought to be seeing.  Speaking of seeing... The graphics in this game are definitely dated. The units are very blocky and have terrible coloring. Why are my units peach-colored? The everyday objects scattered around the map look okay -- bushes sway in the breeze, for instance -- but the foliage model for the trees uses a bizarre, twinkling pattern that hurts my eyes. Weapon effects and explosions are passable but only when considered next to the substandard unit models. The camera controls allow for some pretty intense close-ups but, given the way the game looks, it's best viewed from as far as away as possible.  There is a multiplayer component to War Times and, while this does away with the problems exhibited by the enemy AI, the other issues that hold this game back simply can't be overcome long enough to really enjoy playing against a tougher, smarter opponent.   Ultimately, War Times is a pedestrian real-time strategy game that barely manages to offer up the basic mechanics that define the genre. Add its failure to deliver the spirit we'd expect from the setting and there's very little to separate War Times from dozens of other all-too-predictable real-time strategy games. It feels too much like generic RTS mechanic #3 married to generic RTS setting #4 with little thought put into innovating or even integrating the two.If you're looking for serious WWII tactical action, it's still hard to beat the Combat Mission series...at least in multiplayer. Still, the format of those games isn't always appealing to the RTS fan. Those players may find games like Blitzkrieg or Desert Rats vs. Afrika Korps to be more enjoyable. They'll also find that the Patton campaign in Empires: Dawn of the Modern World offers much more personality and polish.", "date": "Apr 27, 2004"}