{"name": "Serious Sam Advance", "name_review": "Serious Sam", "ref": "https://www.ign.com/articles/2004/04/27/serious-sam-4", "text": "It's been more than three years after the debut of the Game Boy Advance hardware, and we're well beyond the novelty of seeing first-person shooters on the system. After well more than a half-dozen attempts at the genre on the Game Boy Advance, we're way past the point where we question if it's possible; now we're at the point where we have to ask: was it necessary? In the case of Serious Sam on the handheld: no. No it wasn't. Features Ten different weapons Twelve levels Password save Link cable support for four players Serious Sam has enjoyed moderate success on the PC and consoles as a poor man's FPS. The development team responsible for the series makes no promises for deep gameplay. In place of depth, the developers simply gave action gamers a fast-paced, energetic arena in where they play as a bad-ass sent through time to kill a huge assortment of baddies. It worked well for the series, and it caught on due to its modest pricetag.   For the Game Boy Advance, Climax's handheld team worked on the GBA version as its console team worked on the PlayStation 2 and Xbox port. The handheld team at Climax is remnants of the familiar, but no longer existing Crawfish development team, a studio that's had its fair share of first person shooters on the GBA. In fact, Crawfish was the first studio to really capitalize on a raycasting engine, with the first real public demos of the technology running on the system nearly a year before the GBA ever shipped.  So, the team set out to faithfully reproduce the look and feel of the original PC version of Serious Sam. At the very least, it does look very much like Serious Sam. Unfortunately, in game design the Serious Sam style isn't tailored very well for a raycasting engine on hardware that has a hard time keeping a smooth framerate in 3D engines. A good portion of Serious Sam's gameplay takes place in open arenas to allow for more wild and intense action, but raycasting engines are tailored more for the tight confines of corridors and mazes...open areas cause this technology to chug on hardware (i.e. the Game Boy Advance) that can't quite cut it.  With a bad framerate comes Serious Sam's serious problem: it's incredibly difficult and frustrating to enjoy what the game is supposed to be: a balls-out action shooter. The idea behind the PC version Serious Sam is that it's anything but serious, and that it didn't take a whole lot of effort or skill to get enjoyment out of it. With the Game Boy Advance version, the sluggish animation and controls make targetting enemies an absolute nightmare. There seems to be a slight delay between pressing the directional pad and getting Sam to move in the environment...and when it comes to pinpointing an enemy, there's a lot of correcting and overcorrecting when aiming left and right. The developers attempt to fix this problem by allowing for more precise movement with the B button. But since this shares the in-game ~change weapon~ function, attempting to slow down Sam may mean losing your selected weapon when you need it most.  But, if it's possible to overlook the framerate and control issues, Serious Sam does have a bit of mindless challenge that can be enjoyable in short spurts. But since this is a budget game Global Star Software removed the ability to save the game in progress in favor of the cheaper password level-save route. What this means, unfortunately, is that any score amassed in Serious Sam vanishes from memory the second the power switch is flipped. It's pretty obvious that this was a last minute decision since the game features a now useless high score leaderboard. What's the point of getting listed if it's just going to disappear? On the plus side, the game features some exciting deathmatch for as many as four players via the link cable. And since the game has been budget-priced at 20 bucks or less at retailers, it's a little more financially feasible to get into the multiplayer support placed in the Game Boy Advance version of Serious Sam. Taking the Game Boy Advance version of Serious Sam into the first-person realm just doesn't work. FPS games on the GBA are old hat, and more of a bragging right than a real gaming necessity.. The overall result isn't entirely a bad effort, and it's far from the worst FPS game to hit the handheld. But it's definitely a step backwards from what's already been done on the system. It may have been more beneficial had the designers worked with the GBA's strengths in a significantly different style of gameplay for Serious Sam's first Game Boy adventure.", "date": "Apr 27, 2004"}