{"name": "Rise of Nations: Thrones and Patriots", "name_review": "Rise of Nations: Thrones and Patriots Review", "ref": "https://www.ign.com/articles/2004/04/28/rise-of-nations-thrones-and-patriots-review", "text": "In some ways it's harder to develop an expansion for a great game. The original Rise of Nations offered a compelling but approachable mix of turn-based concepts and real-time gameplay that garnered critical awards as numerous as they were well-deserved. Figuring out how to expand on a game that offered the chance to conquer the world, from ancient times to the present day, as one of 18 highly unique but remarkably balanced nations has got to be a hard task.   Thankfully, the big, huge heads over at Big Huge Games have found a way to add more to the title in terms of numbers and features. The team has added six to the existing 18 nations, incorporated a Civ-like concept of governments, and narrowed the focus of the Conquer the World campaign to make it more approachable. Though undeniably attractive, these additions aren't necessarily tied together around a central theme -- unless you count ~some different new stuff we've added~ as a theme. Even the title, Thrones and Patriots is relatively generic.   Still, there is a method to this madness. The inclusion of three new North American nations -- the Lakota, Iroquois and Americans themselves -- helps to offset the European and Asian focus of the previous game. The three South American nations can't hold up an entire hemisphere, after all. Persians and Indians give Big Huge a chance to reintroduce the elephant units that were cut from the first game. The Dutch seem harder to reconcile but nevertheless offer a nation that's reasonably balanced across land and sea.   As with the core game, the nations here are all remarkably distinct but evenly balanced. The Indians are able to build larger settlements more cheaply and have four different versions of the war elephant. The Persians also get elephants but differ from the Indians in having a second capital and some unique economic bonuses. The Lakota and Iroquois are different as well but both a penchant for guerilla war and raiding tactics. The Dutch have some significant economic bonuses not least of which are armed caravans that can fend off enemy attacks. The Americans, one of the most requested of all nations (we rock, after all), have some interesting economic bonuses and some killer military units in the later ages.    But while the new nations seem plenty cool, it's the new Conquer the World campaigns that really sell the expansion. While the open-ended, conquer as you please model of the previous game was engaging, it was a bit too open in my opinion and suffered as a result. This time around, you'll have four more localized campaigns that use the same Conquer the World mechanics in a much more comprehensible scope.   There are four new campaigns here. Most allow gamers to conquer a smaller slice of the world: Alexander the Great wrestles with the Persians and other Mediterranean powers, Napoleon fights back against the European allies, and the European nations battle with both natives and colonists in the New World. You can pick any of the sides in these conflicts but some of the players (the Persians or the American colonists, for instance) offer a bit more fun than others. The only truly worldwide campaign pits the Americans and Soviets against each other in a Cold War scenario.   There's a range of choices to be made within each mission as well. As Alexander tries to subdue the city-states of Greece, he's given the choice of razing or incorporating conquered capitals. Razing them might just steel your remaining enemies against you. Then again, it might give them cause to question their motivations in this war and switch their allegiance to you automatically. While these types of choices aren't present in every mission of every campaign, they do allow the player to guide their own experience through the game.    The Cold War scenario is probably the most sophisticated in terms of new gameplay. (While the others are interesting, they follow the general trend established in the core game.) The game of nuclear brinksmanship is played by both the Americans and the Commies and, if you're not too careful, you can find things getting quickly out of hand. Even so, the game almost forces you to take it slowly, requiring massive tribute layouts for the more direct conflicts. In addition to fighting over territories directly, you'll also have the chance to get involved in a few espionage activities that, while interesting, tend to distract me from what I really like about the game -- moving armies on the world map and leading them in the field.   Beyond the campaigns, there's one other notable gameplay-specific addition. By adding different government models to the game, the developers now allow players of any faction to shift their advantages in the middle of the game. The six new governments are polarized a la Civilization (and perhaps real life?) along the axis of military and economic development. In the early game, you can opt to go with Despotism, which reduces the cost of barracks units and military research, or go with Republicanism, which raises your overall commerce limits. Rather than being an ~extra~ feature, this concept of governments factors heavily into the game and can have a dramatic effect on your development. Each government switch also spawns a leader who has his own unique abilities, further enhancing their usefulness.   Apart from these additions, this is the same Rise of Nations you know and love. The interface is just as smart and helpful as you remember it and the citizens and caravans of your empire still operate with intelligent autonomy. Sadly, damaged units still won't find opportunities to heal themselves, preserving the game's only really obnoxious micromanagement challenge.    Little has changed in the way of multiplayer either. Naturally the new nations and government types are available now and this goes a long way towards reinvigorating the core experience but, for the most part, multiplayer is what it was. And since what it was wasn't bad...  A great game gets better. That's the final verdict here. The new nations fit well with the 18 existing nations in terms of abilities. I know a lot of gamers have been interested in playing as the Americans, so their inclusion here is pretty attractive. Still, as intriguing and unique as they are, it does seem a bit like a ~mere~ quantitative addition. The new campaigns and the new government system actually change (or at least reorient) the gameplay in some interesting ways, allowing gamers to shift the focus of their society and take on meaningful challenges that offer a stronger sense of direction. Honestly, I would have loved to see a tighter connection among the additions and a bit more balance. Some nations, like the Americans, get lots of playtime. Others, like the Lakota, don't seem to have as much opportunity to shine, at least in the single-player campaign. It seems more like the team had three different directions for the sequel and, rather than tying them around a central theme, decided just to throw everything into the bag in the hopes that it would seem coherent. Even if it is kind of scattered in this regard, the additions are most welcome and go a long way towards making a great strategy game even better.", "date": "Apr 28, 2004"}