{"name": "Bomberman Jetters", "name_review": "Bomberman Jetters", "ref": "https://www.ign.com/articles/2004/04/29/bomberman-jetters-3", "text": "The title Bomberman conjures images of groups of hardened gamers gathered around a television, half-empty soda cans on the table, an overwhelming scent of thick body odor in the air, and all in the name of entirely fun, addictive multiplayer matches. The franchise, a favorite by the ~hardcore gamer~ for many years, has in recent times gone through something of a transition. Developer Hudson has downplayed Bomberman's famously compelling multiplayer mode, in which up to four gamers set bombs in unique and clever ways in too-often-futile attempts to blow up their opponents, and instead delivered enthusiasts single-player oriented platformers based on the license. A strange move to be sure, especially since these platformers -- Bomberman Hero, anyone? -- have failed miserably to compete with the platform kings like Mario and Crash -- or even, for that matter, the sideshow acts like Gex.The bad news for GameCube owners is that the budget-priced Bomberman Jetters, which retails on Nintendo's system for a mere $19.99, again features a platformer-style single-player experience. The good news is that it also brandishes a fun four-player arena battle mode complete with different themed levels and play styles. The platformer side of the game is as stale and uninventive as ever, but the multiplayer offering, which smells of nostalgia, will definitely please Bomberman fans too long denied the ability to blow their friends up.The FactsSingle-player story mode complete with platforming and character building elementsPlay as Bomberman or Max and switch between the two characters at any timeFour-player multiplayer mode for classic Bomberman arena style battlesMini-games and multiplayer gamesAnime-style cut-scenes tell the story of the single-player experienceRequires three memory blocks for savesGameplayBomberman Jetters doesn't feature the most innovative of storylines, but we have to give some credit to developer Hudson for at least trying to tell a story here. The game opens as the infamous Hige Hige Bandits are up to no good again. The gang has set out to crash an artificial world called Dark Star into Planet Bomber, our hero's home. It's up to players to assume the roles of Bomberman, also known as the White Bomber, and his friend Max, and journey on a platformer-ridden quest to spoil the plans of the enemy. It's simple and all-too  clich, but the title does employ a wealth of cute and colorful anime-styled cut-scenes which highlight major plot developments.But the story elements do not make a ho-hum platform experience good. Bomberman's single-player side is at times ridiculously simplified, a wee bit slow-paced and in today's gaming world extremely primitive. These are not good traits. Players move Bomberman at what is initially a snail's pace through a somewhat barren, linear-designed 3D world, set off bombs to explode enemies, pick up items like health and fruit which build the characters strengths, and progress onward. It's Platforming 101 and we saw this all before, and better, on Nintendo 64 eight years ago. On the other hand, we wouldn't go as far as to call any of it sub-par or flat-out bad, either. The experience falls somewhere in the middle. Bomberman controls well enough, there is the rare environmental puzzle that provides some degree of challenge, and the character-building elements will encourage gamers to keep playing. The Charboms, creatures that help Bomberman and Max on their quest, are particularly intriguing because their abilities can be advanced throughout the adventure and this provides an RPG-like element to the title. Build the abilities of your Charboms and advance through the single-player mode Maybe it's because we're ~old skool,~ but Jetters' classic four-player-ready battle modes provide the far superior play experience. The setup, based on the old design, couldn't be simpler or more addictive. Up to four players are placed atop a 2D-style arena where they use bombs and item pick ups to trap and explode the competition. Not much to it, we know, but the strategies hidden beneath the surface of this mode are significantly deeper and more rewarding than the entire single-player experience combined. A wide range of arenas (eight-plus standard and a couple more on top of that), as well as a good amount of different arena styles and setting, keep what is basically a static play experience fresh. But while all of this is true, we can't forget that we've played this before -- ages ago, and it does feel dated.GraphicsHudson has stuck with the cel-shaded look of previous Bomberman games and as a result Jetters looks largely the same. Visually speaking, we're in average territory here. Nothing stand out and then again nothing impressively poor either. Character models are slim on polygons and feature basic animation, but the levels are varied in design and colorfully pleasing. The multiplayer mode, which resembles the battle offering in classic Bomberman titles, is not pretty -- never has been and probably never will be. On the upside, the cut-scenes are well-integrated and the anime-quality is acceptable.SoundAgain, not a whole lot going on. A standard mix of low music with generic sound effects and extremely high-pitched, over-the-top voice work. To the game's credit, there is voice work. This is more than Nintendo can say for the presentations of some of its biggest games. Unfortunately, that voice work is occasionally piercing and oftentimes disruptive. Basic stereo configuration. Don't expect anything above and beyond the call of duty here.Bomberman Jetters has two things going for it. The first is the budget price. It's only $19.99 -- less than half the price of some GameCube software. The second is its multiplayer battle mode which, despite its dated look and the fact that we've played it before, is still fun and addictive. For these reasons alone I can recommend the title to longtime Bomberman fans. But if you're thinking about picking this game up for the single-player experience, think again. It's simple, primitive, and frankly, boring, a description that adequately illustrates the title's visuals, too.", "date": "Apr 29, 2004"}