{"name": "Circuit Breakers", "name_review": "Circuit Breakers", "ref": "https://www.ign.com/articles/1998/09/19/circuit-breakers", "text": "Pint-sized racing games haven't really been in vogue since Micro Machines raced onto the 8-bit scene, but that game's recent return on PlayStation (and subsequent success) has obviously sparked renewed interest in the category. Case in point is Circuit Breakers, a game from an entirely different developer, but with surprisingly similar play mechanics.   It's a simple premise: races tiny vehicles around a track. But contrary to most other racing games, you can actually fall off the course and loose mucho time in the process.   You've got several car styles to choose between at the outset, ranging from sporty hotrods to jeeps. As the tracks progress, you'll hop into marine and submergible variants of your choice wheels too. Courses themselves are numerous, and go from desert to jungle to Venice-style canals.   Unlike Micro Machines, the camera always follows your vehicle from behind, meaning that control is always relative to the direction you're pointing rather than reversing as you go 'round the track.   Like the aforementioned game, there's support for one to four players simultaneously. Rather than go the split-screen route though, all contestants are present on-screen at once. This means that if you get left behind, go off-screen, or crash, every one gets reset on the track and the races continues. Cause this to occur eight times, and you're out. The winner is the one who survives the entire race, or comes in first if everyone survives. It's definitely a different concept.I loved Micro Machines, but I could never seem to fully come to grips with the control scheme. Circuit Breakers fixes all that, plus adds better graphics, more courses, and a better single-player experience. As a result, I like it even better.I found the control spot-on, the 3D engine solid, and the course design simply brilliant. And to top it all off, it's got one of the most addicting multiplayer modes I've encountered in a racing game.It's a definite change from the norm, so I'm sure not all racing fans will like it. But if you're a Micro Machines fan, or looking for a simply awesome party game, this'll be right up your alley. It's a blast.", "date": "Sep 19, 1998"}