{"name": "Syphon Filter: Omega Strain", "name_review": "Syphon Filter: The Omega Strain", "ref": "https://www.ign.com/articles/2004/04/29/syphon-filter-the-omega-strain", "text": "The Syphon Filter series made a name for itself on the PS one in 1999 and kept the series on the same console even after the PS2 launched in 2000. Syphon Filter 3 was released in 2001 and ever since then, developer Sony Bend has been working on updating the franchise for the next generation of PlayStation. Two and a half years later, the Syphon Filter series is arriving a little late to the PS2 party that's been raging for the past few years, but it's bringing some new party favors in the form of some fresh new online capabilities. It's taken some time, but Syphon Filter: The Omega Strain is here and is providing some new ways to play.In The Omega Strain, the gameplay is designed for replayability. There's a steep learning curve and it can be rough going for the first few missions, but by learning how the game works, the game opens up into some deeper gameplay. This can get even more intense when the action moves online with players working together. There are still flaws that detract from the overall effect of the game, but this is worthy of the attention for gamers looking for something different.GameplayGabe Logan, the hero of the past three games, has taken on a more managerial role this time around and players get to create their own agent to play through most of the missions. Out of 17 missions in the whole game, nine of them can be played with others online, four are solo missions for the created agent only, and four are solo missions with in-game characters including one mission reserved for Mr. Logan himself. Each of the missions has a list of objectives that include both primary and secondary goals. Hitting all the primary goals will get you through to the next missions, but getting the secondary objectives and getting a 100% completion rate will unlock more weapons and the four solo missions for the in-game characters. The solo missions provide some extra gameplay, but it's the weapons that will really make life a whole lot better and more fun in the world of The Omega Strain. Of course, one of the objectives is a par time that requires agents to spare absolutely no time in getting everything done.  There are checkpoints in the missions, but there is now way to save the game during the mission itself. Dying in the game zips the player right back to the last checkpoint and keeps the game going the whole time. This way, if an objective gets missed along the way, the only way to get a perfect score is to restart the whole level and try again. One bit of frustration is that there is no option to restart the level in the game. If you want to go for a better score and get more objectives, you need to quit to the level selection screen and choose the mission all over again. Starting out in The Omega Strain can be extremely frustrating with little direction and barely any tools to use. New agents are given a rather pathetic handgun and a stun jack and that's it. The best tactic right away is to kill some terrorists and grab their guns because they've got you outgunned in the beginning. After completing a mission, the picked up guns get taken away, but, if the level was done satisfactorily, another weapon is unlocked to use from the beginning of a level. Inch by inch and gun by gun, each agent will acquire a healthy arsenal and be ready to do some serious damage from the get go. It takes some time to build up the momentum, but once you have the proper gear and a trusty rifle for headshots the game gets a lot smoother.    In addition to the growing arsenal, each agent gets more and more options for customizing his or her look. All the agents are clean-cut to start with, but they get new shirts, pants, boots, haircuts, hats, and even tattoos to choose from as more objectives get hit. This is funky in terms of creating a character with more style, but the big advantage is that others can see your characters details online and instantly know how advanced you are.The big change-up to the series is the online portion of the game where up to four players can join up and play online together. After choosing a server, players choose a mission and then can see if others are playing or start a game themselves. Only missions that are available in the single-player are the ones that can be played online as well. However, it's possible to unlock missions by playing through the earlier levels either online or off. The lobby system is a bit confusing since it requires gamers to choose their mission first and then look for an open game. Later on in the game, when more missions are unlocked, this can be a tedious process of going in and out of missions to find people to play with. The fact that the option to see all of the open games on a server is isn't here is frustrating. This can also lead to many players not getting a game going because people hanging out in another mission screen can't see the other games that are ready to go. If there is a small number of people on a server, the problem gets even worse.Still, once a game does get going, the lobby for each individual game is well-laid out with a spot on the screen for each of the four players. Here, players can talk to each other to set up plans for the mission as well as see what weapons others are bringing. If a couple of people are going with more of an emphasis on sniper rifles, then the other two can pack some machine guns.   All of the missions have a variety of objectives in different parts of the map and this lobby is crucial in deciding who is going to take care of what. While the single-player missions have their own par times, the online par times are even smaller fractions of those. In one mission there are a few different targets that need to be destroyed with C-4 explosives, but there is only one location to pick them up from. Where doing the mission solo requires a little back and forth action, a coordinated team can make one trip to the stash and split up for the different demolitions.A few of the missions have objectives that can only be done with a group of people. This can include an area that can only be reached when one team member lifts another up to an out-of-reach location. Other times, there will be a need for coordination and communication to do different things at the same time. The very first mission includes an objective to pick up a laptop that is inside a burning bank. A hundred feet away from the bank is a water main that can be turned on to activate the sprinkler system, but by the time a single player can run from the water main to the laptop it will be ruined by the water. The only solution is to have one teammate wait by the burning bank and run in as soon as the water turns on. In this way, the only way to completely finish all of the objectives in The Omega Strain is to get online and work together.    In our own experiences with the online gaming, the voices worked out well, but the key to using them is knowing the map and what needs to be done. Otherwise there will be plenty of confusion and miscommunication as players bumble about. Once again, there's a definite learning curve to figuring out what needs to be done and who needs to be where. To completely rule the online maps with a group and nail the par times will require some serious amounts of practice and preparation.The appeal of the extensive missions in The Omega Strain is to play through a variety of missions both solo and in a group and become a master in the art of headshots and getting everything done nice and quickly. Unlike Resident Evil: Outbreak where the game quickly goes downhill once players have figured out everything they need to do, that's where The Omega Strain actually begins. Figuring out the objectives and how to get through them is the first step in beginning to get them all done quickly.While the overall ideas of the game and the implementation work great, there are still problems with the control and other elements of the game. One of the strangest and most frustrating aspects here is that enemies will respawn in certain areas. There are a few spots that will constantly pump out a new enemy as soon as the current one in the room gets killed. The excuse that this provides more excitement is pretty meager considering that it makes the game much more annoying. In one underground level, there are sewer pipes running into a large room. In a few of these pipes, enemies are taking shots at the agents, but if they're killed another one will pop up in a few more seconds. To make things even worse, this is a room that requires an agent to move hand-over-hand across a bar that spans the entire room. Killing everyone is useless since by the time you can move ten or twenty feet, all the enemies have respawned and are taking potshots at you.  The main problem with this is that it takes the logic out of clearing an area. It's nice to know that once a hallway has been cleared out, it can be moved through without a hassle upon returning. To have to fight more enemies just drags out the game and slows the action down at the expense of providing more of it. This also takes away from the feeling of having a singular logical adventure and instead adds some chaos to the game.Another hurdle to get over is the control scheme which can be more than a little confusing. Every button on the controller is used and there's no way to customize them for personal preferences. One particular gripe is that the Select button is used for changing weapons. Since the left analog stick is used for movement, this rules out the possibility of running and changing weapons. Even weirder, the L3 button is used to activate the microphone so this makes moving and talking difficult as well. Overall, The Omega Strain is flawed, but there's still enough action and missions and online options that if these hurdles can be overlooked, there's plenty of gameplay to be enjoyed. What holds the game back is the steep learning curve and the respawning of the enemies. With an awkward control, this doesn't get much easier. Still, it's the sheer scope of the game with the missions and the online capabilities that keep it entertaining.   GraphicsThe environments in The Omega Strain run the gamut from gray urban environments to a jungle to sunny Yemen The details are well done, but in general, the environments tend to be a little simpler and without too much detail or a high-polygon count. The majority of the detail has gone into the characters that are running around. Upon getting the sniper rifles, it's a pleasure to see the detail in the enemies' faces before they get a bullet in the face The camera is a little slippery in action, but the weirder thing here is the movement of the agents. Where the previous games featured agents that looked like they were running around with a full load in their adult diapers, here the agents look as if their torso is leading the way and their legs are struggling to catch up. Overall, the movement feels very ~floaty~ as the agents almost glide through the levels. SoundThe music is solidly done and has diverse elements going on for the different levels. The sound effects have been given a good polish as well for the different weapons, explosions, and people running around. Where the graphics can occasionally disappoint in terms of detail, the sound is where the game shines even more.As for the voices, they're done well enough, but still tend to sound a little hilarious in their action-movie style. Gabe Logan was always hard to take too seriously and here The Omega Strain does not disappoint. All of the agents are gruff and to the point and even though they may sound  clich, it still provides a good backdrop for the action.  With a new variation of online gameplay, The Omega Strain makes a name for itself by providing a fun area for groups of people to get together and coordinate for some group action. With 17 missions and hundreds of objectives to take care of, there's enough to dig through for quite a while. Fans of the series should be able to jump right in and find a good new variation of the older games.Still, with the control issues and the respawning and the floaty movement, The Omega Strain is kept in check from becoming a more immersive experience and is instead more of an arcade-style shooter. These flaws in the game show that there's still room to grow after this experiment in online gameplay is concluded. Hopefully, Sony Bend will learn from these mistakes and hone this style of gaming into a more refined system.", "date": "Apr 29, 2004"}