{"name": "Beyond The Law: The Third Wave", "name_review": "Beyond the Law: The Third Wave Review", "ref": "https://www.ign.com/articles/2004/04/29/beyond-the-law-the-third-wave-review", "text": "You know, I heard a statistic the other day that 90% of all major music releases don't make a profit. I suspect gaming isn't too different. It's a tough market. If you don't go into it with a good deal of financial backing, your choices are limited. The Third Wave in particular has some tough hurdles to overcome, from dated graphics and sound to problematic design elements. It has a tough time throughout holding up well against Jagged Alliance, Commandoes and other titles in the team-based, tactical stealth niche.  You encounter the first hurdle when you get to the game menu. There are no options to select a different resolution, or to adjust specific sound sliders--there's no ~Options~ sub-menu at all. You're stuck at a fixed 800x600, which doesn't hold up well on a monitor larger than 17 inches. Even Fallout hurts on a big screen. It also would have been great to reduce or eliminate character commentary, because every time you select one of the team members and execute a command, they say something like, ~Right away,~ or ~On my way~ or ~Before you can say, 'Organized crime!'~ Every time you click on a part of the screen you want him or her to go to, every time you click on a body you want them to hide, a switch you want them to pull, et cetera. It gets pretty monotonous and grating after a while. Like Blade and Sword, I eventually had to turn the volume down to a murmur because of the repetitive dialogue bits and sound effects.  But the problems extend beyond issues with audio and visuals. I can handle not playing a bright and shiny, full-3D game with all the DirectX 9 bells and whistles--I don't necessarily dock points for that. But the 2D isometric view won't win any new converts, as it feels like a time warp back to six or seven years ago. I take issue with other things, like character selection.  Missions occur in multiple stages, first on a tanker ship, then moving on to other places like an old hotel and a warehouse. Before each of these stages, you hand-pick a squad featuring separate types of characters, like a technician to disable security devices and place tracking gadgets, a ~tactical~ character who can move quickly even while crouched and is handy with a knife, and a ~bodyguard~ type who's good to have in a straightforward gunfight. You'll have a certain amount of money with which to hire them, and you can get a more skilled mercenary it you're willing to spend a little more money. However, it isn't always clear what types of people you will need, and the objectives change over the course of the stage. There's a timed mission where you have ten minutes to re-enabled two bombs, and you'll need the technician to do it in a reasonable amount of time. But he's only armed with a knife and he moves slower than molasses even when running. You'll need to bring along a bodyguard, who wasn't truly useful until this point, essentially just tagging along.    Complicating gunplay is the fact that the guards throughout the level have incredible aim. Apparently they've practiced from-the-hip headshots, because it usually takes no more than three hits before one of the team members is dead, despite the fact that they're presumably wearing body armor and the fact that the guards aren't often close enough to hit with such deadly accuracy. One, two, three shots can mean one, two, three dead team members. And if you could only afford three people, that'll send you right back to the last quicksave, again and again.      As with Commandoes, you can see a guard's cone of view, but their ability to spot you doesn't always seem on the mark. The same goes with security cameras. Sometimes you can just crouch down and crawl past, using boxes or other obstruction. Other times, you can stand up straight behind a box that's a few feet taller than you, but the camera behind it will still spot you and activate an alarm. While I'm willing to bend the logic rules for a game in order to create suspension of disbelief, it doesn't make sense to immediately trip an alarm or to have someone shoot at you the instant they see you, since in this context the team member doesn't automatically stand out as an intruder. I like the Hitman system a lot better, where the guard will hesitate for a moment before they decide they're going to feed you lead salad. And the fact that the guards in The Third Wave are so debilitatingly accurate doesn't help either.  Instead of doing the stealth thing with mostly knives and one guy with a submachine gun when things get hairy, it was just a lot easier to go in with an arsenal--just some bodyguards and a sniper. The guard AI isn't so hot, as you can pop someone indoors and only one or two other enemies will investigate, even though half the people in the area should have heard it. And after a few moments, the guards will go back to their rounds, even when they find a dead body. You can ~hide~ bodies, which consists of nothing more than conjuring a tarp to cover them with, which somehow renders them completely invisible. But more often it was just more efficient to mow your way through without stopping to cover your tracks. The guards have that deadeye aim and you can't manually reload weapons, and grenades aren't an option, so it's still a tough row. But it's more doable than inching your way along, especially when the mission is timed.When there isn't a lot of dev money to go around, compromises have to be made, and the presentation definitely reflects this. However, you can still provide compelling gameplay no matter how few resources are available. The Third Wave doesn't manage to achieve consistent entertainment, though, and is challenging for generally the wrong reasons. It never quite reaches the bar set by other games in the genre that debuted years ago, so it ends up feeling like the last game to fall out of a time capsule.", "date": "Apr 29, 2004"}