{"name": "Mission: Impossible", "name_review": "Mission: Impossible", "ref": "https://www.ign.com/articles/1999/12/01/mission-impossible-3", "text": "Developed by X-ample for the PlayStation, Mission: Impossible is based on the popular license of the same name and is an upgraded version of the Nintendo 64 version that was released last year. The game puts the player in the role of Ethan Hunt, a top Impossible Mission Force agent, in a world of covert operations and espionage.  Gameplay Mission: Impossible encompasses five missions and 20 dynamic levels that vary in depth and complexity. In each of the levels, the player is given specific mission objectives that need to be accomplished with many including special objectives that only come to the fore when previous objectives are first met.  The specific objectives in the various levels and missions are not that varied in their goal as they mostly just consist of finding a specific person, item or weapon, escaping from an area, or killing a specific enemy. However, they do differ in the way they are carried out and in the difficulty of each.   The game is somewhat challenging and presents the player with covert mission objectives that will please Mission: Impossible fans, but it isn't successful in offering the challenge and stealth in a way that will please the game player. The problem with the game's challenge is that a large amount of it is caused by the poor control. The game is played with several different perspectives; Cross-hair mode, Interior mode, and Exterior mode. The idea with the different modes is to give the player the best possible view for each situation, but it is unsuccessful in achieving the desired effect.   While in Interior mode, the camera follows the character from behind and the game is played from a third-person perspective a la Tomb Raider, Tomorrow Never Dies, and the Duke Nukem PlayStation games. In this mode the player can move forward, rotate left and right, crouch, and use items or weapons. The problems with the Interior mode are that the player doesn't have the ability to strafe or sneak around, which significantly decreases the stealth capabilities of the player.   With the Exterior mode, the camera is positioned much further away from the character and offers a control scheme that is similar to games like Super Mario 64 and Metal Gear Solid where the character moves in the direction where the control pad is being pushed. In terms of moving the character around the 3D environments, this mode offers the best control. The problem is that it's pretty worthless when the player enters a hostile environment and needs to do some killing. Much like the Interior mode, the player lacks the ability to strafe in the Exterior mode. This omission, as well as the lack of a lock-on feature ala Zelda 64, makes shooting and killing enemies a laborious task.   The cross-hair mode places the camera behind the player's semi-transparent head in order to the best possible view of his target. Whilst in this mode, the player can zoom in and out on the target (amount of zoom depends on the weapon being used) and can even side step to the left and to the right.   There is a sufficient amount of weapons and items that are available for use, and they do an excellent job of putting the game player into the Mission: Impossible universe. The most used and most functional gadget at your disposal is undoubtedly the Face-Maker. Just as it's used in the movie, this item allows the player to take on the identity of another person in order to achieve specific mission objectives. Other items that the player will get to use include the following: blow pipe, dart gun, silenced gun, 9mm hi-power gun, Uzi sub-machine gun, mini-rocket launcher, Electro-stunner, plastic explosives, sniper rifle, electric magnetic scrambler, night-vision glasses, infra-red contact lenses, spy cam, and a fingerprint scanner.   On the whole, it can be reasonably entertaining using each of the hi-tech tools and weapons in the player's arsenal, but in most cases there isn't really much of a choice in what to use. In most instances, the weapon or item that is needed to accomplish a mission task is the one that the player has just found or has been given at the start of the level. There's not really any challenge in figuring out what's the best course of action needed to accomplish your goal; all of that decision making has already been done by the game.   Graphics Graphically, Mission: Impossible doesn't offer much that will impress anyone and is plagued with a lot of minor glitches and graphic problems. For those that have played the N64 version, there's a lot different, but not that much different. The PlayStation version has the same horrible framerate problems that plagued the N64 version and the character models in this version are equally as bad.   While each character is composed of about 350 to 450 polygons, they're just modeled poorly and don't animate that well. The 3D backgrounds are diverse and the PlayStation version features more background textures than what was found in the previously released N64 version. In addition to the new textures, the PlayStation Mission: Impossible comes packed with additional lighting effects and FMV cut-scenes that weren't available in the N64 version. While the effects and cut-scenes aren't too inspiring, they do add a small amount to the game's overall atmosphere and presentation.  Sound The audio in Mission: Impossible ranges from excellent to downright revolting. On the excellent side of the spectrum is the game's music. Starting with the classic MI theme song, the player will get to experience an engrossing musical soundtrack that does wonders in creating a mood befitting the current situation of the game.   While the music was excellent, the character's speech is rather nauseating. The majority of the voice-overs are horrible and what's worse is that most of their lines are poorly written. Characters will often say things that will bring you to laughter when it's not meant to be funny. The inclusion of voices is a generally a good idea because it can help bring the player more into the game's virtual world, but in this case it just lessens the quality of the game. Despite the fact that the movie came out more than years ago and the game has been out for over a year on the Nintendo 64, Mission: Impossible has managed to garner a lot of attention from PlayStation owners. Whether this phenomenon is the result of the upcoming sequel or just the raw popularity of the Mission: Impossible license, I can't really say. The bottom line is that the game doesn't deserve the attention that it has been given. On the whole, it's better than average, but it lacks a lot of features that keeps it from excelling. If you're looking for a stealthy game, you'd be better off getting either Syphon Filter or Metal Gear Solid. Those two games represent how stealth-based games need to be made. If you're a huge fan of Mission: Impossible, the game is worth a single play through. But, only a single play through. After going through the game once, there's really no need (and you'll likely have no desire) to play the game again.", "date": "Dec 1, 1999"}