{"name": "Unholy War", "name_review": "Unholy War", "ref": "https://www.ign.com/articles/1998/09/29/unholy-war", "text": "Given form by one of the same gentlemen who designed the now-classic Star Control, Paul Reiche III, the latest console offering from Crystal Dynamics presents an uncommon mix of action and strategy, that, as it were, owes at least some inspiration to its space-based predecessor and a little game called Archon.  Assuming control of either the technology-driven Technos or the magic using Arcanes, your goal is to gain control of one world through whatever means available. In this case, that means moving your ~team~ of warriors around a hex-based terrain map a la turn-based strategy games and battling it out in a realtime setting.   Each warrior has its own inherent attributes, including agility, strength, health, and, most importantly, arsenal. Each is vastly different, and each has access to two special moves (be they a shield, missile attack, and more) that are coupled to a power meter that recharges during play.  But that's not the game's entire scope. In addition to the default strategy-meets-action play (plus storyline), there's an all-action gameplay variant called Mayhem Mode. Essentially a ~lite~ version of the game, it's comprised entirely of one-on-one bouts powered by the game's battle engine. As with the strategy mode there's a one or two-player option; you'll hear more about the latter in a moment.As a huge fan of the Star Control series, I've been salivating with anticipation for what  unrelated by name and publisher as it may be  could potentially prove successor to those superb games. Now that it's here, I find myself both elated and disappointed.I'm in the dumps because of the basic strategy portion of the game. While not awful in any sense, it's definitely not as deep or engrossing as I had expected. Instead, it's a purely no-frills affair that ultimately strays into the boredom zone. Snore...But as large a part of the game as the strategy element may seem, its shortcomings certainly doesn't spell doom for the experience as a whole. It's when you bypass this portion of the game entirely and grab a friend (or a few) that The Unholy War truly starts to shine.In short, the two-player Mayhem Mode is simply brilliant, delivering one of the most addictive ~party gaming~ experiences in recent memory. Requiring a equal amount of action game alertness and fighting game smarts, it's easily one of the most engrossing, yet simple to grasp fighting systems around. Lots of characters, plenty of arenas, and fine-tuned control ensure that you (and friends) will be at it for hours.It's ironic that The Unholy War's least-touted aspect ended up being its best, by far. And while it's certainly not the action-strategy match made in heaven I was anticipating, I'd highly recommend it to anyone who in search of a top-notch multiplayer game that'll keep them playing through the night  and the next day too.", "date": "Sep 29, 1998"}