{"name": "Sonic Advance 3", "name_review": "Sonic Advance 3", "ref": "https://www.ign.com/articles/2004/05/27/sonic-advance-3", "text": "As Sega and Sonic Team continue to work their hedgehog heroes into the world of 3D platforming on the consoles with games like Sonic Adventure and Sonic Heroes, the Game Boy Advance keeps getting quality side-scrolling designs that better suit the character's origins. Sonic Advance 3 keeps the series rolling with the traditional run fast, collect rings gameplay with subtle design that tweak and improve the fun of the speedy platformer. The addition of a second character may seem familiar, but the two-character element is far more realized in Sonic Advance 3 than it was back in the 16-bit game. Features Seven worlds Five playable characters Single player and co-op modes Link cable support for four players (single and multiple cartridge support) Cartridge save (one player slot)  It's hard to imagine getting ~more~ in a Sonic Advance, especially with what Sega and the GBA development team put into the sequel released last year. But Sonic Advance 3 is definitely a full-fledged sequel that expands upon all of the established platforming elements from the past Sonic Advance games. Even the storyline's fleshed out a little bit (but just a little, with cutscenes that explain that Sonic and Co. are once again up against Dr. Eggman and his plans to take over the world.   Level designs, utilizing the same stylized graphics from the previous Sonic Advance titles, are laid out in clever fashion to balance both traditional platform hopping and exploration, as well as pedal-to-the-metal speed. Players will zoom through loops, pipes, gutters, and corkscrews, grind down rails and flip off poles, all in the name of speed. The layout of the levels are now established in an ~overworld~ of sorts that ties them all together, and makes the entire game design feel less rigid than it did in the past games.  Like Sonic Advance 2, the sequel has five playable characters, and their vastly different abilities significantly change up the way each level is played. Sonic is balanced as a fast and furious runner, which makes him prime to beat the game quickly with the minimum requirements. But since this design puts a lot more focus on exploration and discovery by hiding little ~chao~ creatures in strategic locations all over the map, it's impossible to see everything without playing through each level multiple times. Sonic and Tails are available from the start, and between the two of them players can definitely complete the game 100% since the two are distinctly different in capabilities. But the fun is to open up the game with the three ~hidden~ characters Knuckles, Amy, and Cream.  The hook this time is that characters pair up with another from the familiar crew. At the start, players can only choose Sonic or Tails in the lead, with either the hedgehog or two-tailed fox playing second banana during the action. The secondary character, controlled by the computer AI in single-player mode or by another player in cooperative link play, is used to supplement the main character's progression; he'll collect missed rings, or take out enemies that the other player couldn't quite nail. But the second character also enhances the gameplay by giving the player additional moves and abilities in what's known as a Tag Action. For example, Sonic can use Tails to boost upwards for a quick highjump, or fly upwards to reach the platforms. Tails with Sonic will send the fox on a blast of speed across the platform.  Having five different characters means twenty different ways to play the game, since each pairing offers significantly different actions and abilities to complete the different challenges.  As much as the developers evolve the Sonic game design for Sonic Advance 3, the level designers still resort to the same tried-and-true cheapness of the past Sonic games. So, yep, you'll find those cool and awesome stretches of road to pick up a ton of speed, only to get stabbed in the foot by a set of spikes that no human eye could ever see. And most of the characters have absolutely no defense when hopping off items like springboards; and without the ability to tuck into a ball after hitting these bouncy platforms, it's impossible to defend against hovering enemies that are placed near these springboards.  But the good in Sonic Advance 3 definitely far outweighs the bad, and even with these little annoyances, the challenge from level to level is balanced well enough.  The game's strengths also lie in its excellent multiplayer support. Along with the excellent cooperative two player design, gamers can also compete against other GBA owners in a single-cartridge ~collect-the-chao~ four-player tag mode, as well as a multi-cartridge ~race through the levels~ four player mode. The Sonic Advance series has always excelled in pushing the Game Boy Advance's link cable feature, and Sonic Advance 3 keeps this tradition alive in a big way. True, the Sonic Advance series hasn't changed as drastically from game to game as, say, the Super Mario series, but in each incarnation Sega has tweaked and updated the game design with a significant amount of items that makes each experience better than the last. The addition of two tag-team characters in Sonic Advance 3 definitely changes things up considerably, as do the much larger and more expansive level designs. Though I'm still a bit irked that the little cheap annoyances are still in the game, I can overlook them in favor of all the really cool things that have been included in the new game. It's a great continuation of the 2D Sonic design.", "date": "May 27, 2004"}