{"name": "Ultimate Card Games", "name_review": "Ultimate Card Games", "ref": "https://www.ign.com/articles/2004/05/28/ultimate-card-games-2", "text": "Just a little more than a year ago, Telegames and GBA developer Cosmigo paired up to produce a collection of standard and familiar table games, Ultimate Brain Games. Even though each game could be found cheaply outside of the package, it was the sum of its parts that made Ultimate Brain Games such a fantastic and highly recommended collection of challenges for the Nintendo handheld. Just a little more than one year later comes Ultimate Card Games, a title that calls it exactly as it is: quite possibly the most complete package of single and multiplayer card games ever seen on any videogame system to date. It's a brilliantly implemented Game Boy Advance package that offers a gaming experience that perfectly suited to the Game Boy Advance's unique ~instant gratification~ market. A must-have? Without a doubt. Features Eleven single/multiplayer card games Fifteen Solitaire variations Five Video Poker games Cartridge save (four player slots, instant save for each game) Multiplayer support (single cartridge) Game Copy mode    It is a little pretentious to title a collection as the Ultimate anything, but Telegames' Ultimate Card Games can really stake that claim. The package features is absolutely loaded to the gills with gaming options, having more than eleven different multiplayer games played with standard decks of cards. The list include (deep breath): Hearts, Spades, Bridge, Euchre, Cribbage, Canasta, Gin Rummy, Go Fish, Crazy Eights, Five Card Stud Poker, and Blackjack, each of which can be played with multiple players via link cable (single or multiple cartridge), or single player with some very capable computer AI opponents. On top of that, Ultimate Card Games also features fifteen Solitaire games, including the version included in Windows that can be considered the most popular game ever: Klondike. If that weren't enough, the designers also include casino-style Video Poker, and though Telegames claims five versions, it's really just five machines of slight variations of the same game.  To give the game a bit more personality, Cosmigo has included an enhanced version of its ~Face Maker~ mode it utilized in its original Ultimate Brain Games GBA title. With this mode players can create as many as four different on-screen personas in pseudo 3D (the head can be rotated in limited fashion, but not beyond simply looking up, down, left or right), and while the artwork available is rather simplistic, it does allow for a wide range of different people.  These are the players' ~avatars~ of sorts, and become scaled down icons in each game, both in single and multiplayer sessions.  The package wouldn't be all that without the presentation, and Ultimate Card Games has this in spades...no pun intended. Each game features a brief background and history, and each game has its own statistics tracking, saving general information such as the number of games and time played, or unique elements like best hand scored in Cribbage. Within the game itself, players can control the look of their game, from a choice of photo backgrounds to the artwork on the back of the deck of cards. And, most importantly is the game's cartridge save function: each and every game can have a game in progress, saved directly to the cartridge's save RAM. That's an incredible amount of data that's being stored, and because of it, players can comforably whip out their GBAs for quick Ultimate Card gaming sessions at any time without worry of losing their position in Poker or Bridge.  It's true that most of these games have been available at one time or another on other platforms, and if you've owned a Palm Pilot or Pocket PC system chances are you've probably been able to download complete versions of at least one of these games...for free or otherwise. Card games fit the direct-control platforms (mouse, touchscreen stylus) extremely well, but on the Game Boy Advance system the developers had to utilize the more limiting D-pad and button controls for each of the card games in the package. The team did a wonderful job with what they had to work with, though, and all of the games control excellently...not as great as a point-and-click interface, but great nonetheless. It does make us excited for the potential of this game compilation on the Nintendo DS platform.  The only real criticism in Ultimate Card Games is that there's not a whole lot of rules customization in any of the card games. It's clear that the development team kept each game simple and straightforward, and as the game menu states: ~there will be occurrences where the game may not play as you normally play.~ We're incredibly satisfied with most of the card game renditions in Ultimate Card Games, except for one: a potential goof-up in Klondike's rules makes it difficult to actually win the game. Players can't manage and reuse their cards in the ~foundation~ pile. Once a card's been dropped in the stack, players can't touch those cards ever again.  The most exciting feature in this compilation is its ~Game Copy~ option. It's a brilliant way to give friends a taste of Ultimate Card Games, since every single one of the games in the package can be sent over to a cartridge-free Game Boy Advance system for free, portable play. That GBA owner can keep the game in his system as long as it remains powered, and it doesn't need to be connected to the host system once the file's been transferred from it. Of course, the version that's sent to the cartridge-free system won't be as feature-filled as the cartridge-based version, which means no music soundtrack or high resolution photo backgrounds. But it does feature Sleep Mode, so players could keep the specific game in their systems near indefinitely. And that's not all: that player can then, in turn, send that specific game to other Game Boy Advance systems as well. In essence, Cosmigo has created a clever, almost viral way for GBA owners to ~advertise~ and enjoy its latest product. Bravo, guys! Ultimate Card Games is, without a doubt, one of the very few games that can be considered an absolute must-have Game Boy Advance title This incredibly complete game package is brimming with so much replayability, you probably wouldn't even care if someone permanently superglued this cartridge into the slot. While it may be true that the features list for the games included in Ultimate Card Games are a bit more limited than existing versions on other platforms, this package is so jam packed with game variations and multiplayer features that the developers had to draw the line somewhere. It's a no-brainer, folks: Ultimate Card Games is the ultimate portable game for your GBA.", "date": "May 28, 2004"}