{"name": "Spyro Orange: The Cortex Conspiracy", "name_review": "Spyro Orange: The Cortex Conspiracy", "ref": "https://www.ign.com/articles/2004/06/02/spyro-orange-the-cortex-conspiracy", "text": "and Crash Bandicoot Purple are known as ~cross-over~ games for the Game Boy Advance: two independent games developed side-by-side that directly interface with each other. The storyline pairs up the two characters' nemeses in an attempt to take over the world, causing Spyro's and Crash's universes to tear and link together, and the dragon and bandicoot now must work together in order to save the two worlds from Ripto's and Cortex's evil plans. Spyro Orange: The Cortex Conspiracy offers a much different style of gameplay compared to what's been available on the system before, but its weak platforming elements overshadow its focus on gameplay variety. Features Play as Spyro the Dragon Several dozen mini-game challenges More than a hundred trading cards to collect Cartridge save (three slots) Link cable support for up to four players (single and multiple cartridge) Connectivity with Crash Bandicoot Purple  Spyro the Dragon on the Game Boy Advance isn't new. But Spyro the Dragon as a side-scrolling platformer is. The dragon critter's fourth adventure on the GBA is a drastic change from his past three, since developer Vicarious Visions is the team responsible for his latest handheld exploits. Season of Flame, Season of Ice and Attack of the Rhynocs used the GBA's 2D strengths for the console game's 3D design, but for Spyro Orange, Vicarious Visions opted for a side-scrolling platform design to mirror the experience that it was simultaneously creating for Crash Bandicoot Purple.  And it's not just the side-scrolling design that's the huge change for Spyro. The focus of the gameplay has now changed to offer players a wide variety of different challenges and mini-game assortment. Since Spyro's a winged dragon, much of these challenges are of the old-school vertical and horizontal shooter design where players blast through a forced-scrolling perspective. Others are suitably non-dragonish, including one where Spyro controls a magnetic walker that can stride both normally and upside-down. Officially, Vivendi estimates more than 25 different mini-games in Spyro Orange, but many of them are recycled versions of the same game in a different package. Even though they do repeat (and a few are ~borrowed~ from Crash Purple), most of these games are fun and challenging that get tougher as players get deeper into the adventure.  But the variety of the gameplay gets overshadowed by the weaker element of actually getting to these mini-challenges. The designers of Spyro Orange have created a set of platform levels that force players to use Spyro's run, jump, and flame attack in order to discover the locations of the next challenge in the area. This was the element that dragged down the fun of Crash Bandicoot Purple, and it's again the loose bolt of the entire machine in Spyro Orange. Admittedly, the platforming elements are slightly more interesting in Spyro because they require a lot more skill to control the looser controlling dragon, but the engine created for the game can't seem to handle the effect of Spyro's flamebreath without chugging in places. That, and the level designs couldn't stand on their own if they didn't have the gazillion mini-games to support 'em.  And, like Crash Bandicoot Purple, Spyro Orange suffers from the same feeling that the game ends a bit too soon. It's not as bad in the dragon adventure since the difficulty is slightly higher here, but it doesn't take more than a few hours to complete the game with the bare minimum requirements. Admittedly, there's a lot more to see when players take advantage of the trading card quest that will unlock additional challenges.  It also has a lot going for it in its focus on multiplayer gaming. Many of the challenges in the title can be played with up to four players, either with a single cartridge or a cartridge per system. And players can interface between the same game or with Crash Bandicoot Purple for competition. Additional games become available as players collect the hundred or so trading cards in the adventure, and this task is enhanced by a trading element between the two different Crash/Spyro games. Vicarious Visions' first Spyro game for the Game Boy Advance is a neat departure, but it doesn't come close to feeling as tightly designed an adventure as Digital Eclipse's past three titles on the handheld system. The idea of competing in dozens of mini-challenges would have been much better realized had the team offered a better way to tie them all together. Spyro Orange is definitely better than the average Game Boy Advance fare, but it is a significant step backwards from what Vivendi Universal gave GBA owners in the past.", "date": "Jun 2, 2004"}