{"name": "Clu Clu Land", "name_review": "Famicom Mini: Clu Clu Land", "ref": "https://www.ign.com/articles/2004/06/04/famicom-mini-clu-clu-land", "text": "is one of the most obscure games that ever saw a release in the US during the debut of the Nintendo Entertainment System. Even though it made it in the NES' library back 20 years ago, I've never known anyone who actually had it in their system's collection.  That doesn't matter, though, as the game has been relegated to ~classic~ status simply because it's an ~ancient~ design, at least in videogame terms...not because it's any good. It is a unique design where players maneuver an spherical creature in a grid to uncover a picture by weaving in and out of the gaps between the posts. Players don't exactly have direct control over the character...more like control over his right and left hand. And when he latches onto a post, players can guide him around in a circle until he's facing the proper direction. Guide him through the proper post and a gem will appear. Then it's guesswork to find the rest.  As far as game designs go, this is definitely among the weaker lot of Nintendo first-party games, and probably sprouted to life in a NCL board room twenty years ago when a designer thought he could come up with the next Pac-Man. As a whole it's not a terrible game, but even if it was released for free on the web as a Shockwave download I couldn't see people giving even two squids about its existence.  And it's been available for free (or at least on-the-cheap) in two different formats on the Game Boy Advance: as a furniture download from Animal Crossing, and as a package of five e-Reader cards available for less than five bucks. This makes Clu Clu Land's availability as a 20 dollar standalone cartridge a little hard to swallow, even with its fun collectible Famicom Mini packaging.  Different? Yes. Classic? Debatable. Fun? More like clunky and frustrating. But it's a quick diversion, and that's exactly what Nintendo's going after for its Famicom Mini series. It's good for a free or super-cheap giveaway, but twenty bucks? That's a bit much even when it was first released.", "date": "Jun 4, 2004"}