{"name": "Excitebike", "name_review": "Classic NES Series: Excitebike", "ref": "https://www.ign.com/articles/2004/06/04/classic-nes-series-excitebike", "text": "is full of firsts. Not only was it one of the first games released for the Nintendo Entertainment System back in 1986, but it also shipped as one of the first games in the premiere batch of NES games on e-Reader, and as one of the first NES games unlockable and GBA downloadable in Animal Crossing. It was also quite possibly the first NES games emulated on the Nintendo 64 as an unlockable in Excitebike 64. Now, it's among the initial titles released in Nintendo's Classic NES Series, emulated perfectly, again, on the Game Boy Advance. We've been down this road before several times, but the game never seems to lose its fun.  So what is it? It's a racing-slash-action game that puts you behind the wheel of a dirtbike, racing against the clock and other opponents through several different side-scrolling dirt tracks. Players must angle their airborne bike off of jumps and inclines, wheelie over hazards in the road, and rear-wheel any opponents to knock them off their bikes...all while making sure their engine doesn't overheat by using their turbo acceleration for too long. By running over specially-positioned arrow icons on the track, players can instantly cool down their engines without having to let go of the acceleration.  If racing through the set challenges isn't enough, players can make their own in the track editor, and this simplistic editor gives anyone the ability to create tracks that look and play just as good as the ones supplied in the game. The problem with this inclusion was simple: once the power of the NES turned off, the track gets wiped from memory. Not an issue on the Classic NES Series version, since Nintendo offers save RAM in every game's cart. Developers, like Konami, have tried to copy its design on the Game Boy over the years in games like Motocross Maniacs and Disney Motocross, but they don't come close to the real deal of Excitebike. And though the game's pulled off really well in the Classic NES Series version, the game has already been available twice on the GBA...so the air's been let out of the tires just a bit. It's still a worthy and amazingly fun addition to the classic collection if you haven't scored the game in the other formats, especially for the cartridge save.", "date": "Jun 4, 2004"}