{"name": "Donkey Kong", "name_review": "Classic NES Series: Donkey Kong", "ref": "https://www.ign.com/articles/2004/06/05/classic-nes-series-donkey-kong", "text": "Before Mario became the videogame spokesman of the world, there was simply Jumpman, a mustached carpenter dedicated to rescuing the fair Pauline from the clutches of a massive ape with a fetish for rolling barrels. This was Donkey Kong, and it was one of Nintendo's earliest attempts to hit the arcade scene back in 1981. Boy, did the company succeed.  Back before console systems eclipsed arcade machines in power, programmers struggled to get this game to be ~arcade perfect~ on the current generation of home videogame systems; the Colecovision was the closest in its conversion, at least in the US. In Japan, however, Nintendo's own Famicom conversion came this close to mirroring the arcade experience, with cartridge sizes and costs keeping the port from bringing all four of the game scenes from coming home. Donkey Kong's already been issued on the Game Boy Advance in two flavors: a free download from Animal Crossing on the GameCube, and as a pack of five e-Reader cards sold for less than five bucks. Nintendo has once again issued the game one more time in its Classic NES Series, and it's extremely nice to have it in plug-and-play cartridge format...it's just lost a bit of impact since the previous two re-issues let the wind out of the sails.  The drill's the same: Donkey Kong kidnaps Pauline, Mario goes after the ape in three different levels of jumping and ladder-climbing challenges. Leap over barrels, ride up and down elevators, and finally, remove rivets to make the big guy fall. Even though you save the girl at the end of level three, the game starts right back up again with increasing difficulty. Since the emulation is based upon the NES game, the ~conveyer belt~ level from the arcade isn't in the game.  But even though the game's been available a few times before shouldn't keep any classic game collector from the Classic NES Series. This new re-issue features the most up-to-date Famicom/NES emulation, which not only gives it Wireless Adapter and Link Cable support for two players (not a necessary addition since it was an alternating two player mode), but it also features high score save, recording it to the cartridge's save RAM. The game may not have a huge variety of levels in its design, but Donkey Kong retains its fun through challenging simplicity. It's admittedly a shame we're missing one additional level from the arcade, and twenty bucks is a bit much to ask for a game that's been given away before this series' release. But I pretty much guarantee that if this game's in your collection it'll see a lot of playtime.", "date": "Jun 5, 2004"}