{"name": "Sabre Wulf", "name_review": "Sabre Wulf", "ref": "https://www.ign.com/articles/2004/06/07/sabre-wulf-3", "text": "Back before Rare was Rare, it was a small English gaming outfit known as Ultimate, creating games for the Spectrum Sinclair computer platform. The computer flopped hard in the states but had a strong following in Europe, and many of the great European game creators got their start on that platform. Sabre Wulf was one the team's early efforts for the Spectrum. The game saw a port to the popular-in-the-US Commodore 64 system, but even with that conversion chances are if you grew up playing games in the states, you probably never even heard of the game.  The Game Boy Advance version of Sabre Wulf brings back the Sabreman and Sabre Wulf characters to the scene, but the game itself is an entirely unique creation that puts heavy focus on old-school platforming and simplistic gameplay elements. Many of the in-jokes and references may be targeted to the European side of the pond, and the game's difficulty and challenge seems to fluctuate a bit much from level to level. But overall, Sabre Wulf is a game design you've never played before, and its originality alone is well worth the price of admission. Features Dozens of platform challenges Challenge Mode for each level Cartridge save (two slots)  When Sabre Wulf begins, the storyline hints at prior events leading up to Sabreman's arrival in the village. Apparently, it was Sabreman himself that banished the vicious Sabre Wulf years ago, and his services are required yet again to save the town after the evil Dr. Doolittle-Goode (ugh!) set the vicious wolf free in his plans to, what else, take over the world.  Bad puns and lame ~RPG~ story elements aside, the meat of Sabre Wulf is in its specific platformer tasks where players must steal a specific treasure guarded by the blue wolf. By bringing back the treasure, the wolf will skip off and reveal another challenge that players must complete. And on and on. Sabre Wulf shines because of its unique simplicity. Sabreman, like the classic Jumpman Mario in Donkey Kong, is a simple hero who can really only do two things: run and jump. The level designs themselves put to use the player's ability to jump from platform to platform and avoid dangerous obstacles by jumping over them or timing a dash underneath. But the level designs also have a ~build your own solution~ element that comes in the form of Sabreman's ~friends:~ collectible creatures that may seem like refugees from a bad Pokemon clone. These guys can be used pretty much in any situation the player can uncover: Blubba the bear's bouncy belly will give Sabreman that needed boost. Serpent's airborne abilities makes for a perfect portable platform. Boomer (definitely the most viciously adorable creature animation in the game) is a self-destructing critter that will blast away harmful elements away. There are a number of different creatures to put to use in order to get through the level designs.  The player's challenge is to utilized these creatures (either collected or purchased) to figure the fastest route to the treasure. The faster players get to the treasure, the better the chance of snagging a ~gold~ treasure. More time and the treasure's value reduce to silver, then bronze. Once the treasure's snagged, all bets are off. Anything the player did with his creatures at this point is nulled by the howl of the wolf, and players simply have to run like hell before they get mauled by Sabre Wulf. This portion's much more simplistic and less demanding, as all it requires is players backtracking through the native level design to get to the safety of the tent. Fast-paced platform skills only need apply here.  The game's difficulty doesn't top out until much deeper in the adventure. In fact, a lot of Sabre Wulf's issues come from the strange balance in challenge from one level to the next. In one mission, players may have to use all of their creatures, followed by the next level where a single creature may never need to be utilized. Instead of giving players a steady uphill climb in difficulty, it just jumps around from place to place. And though Rare gives the impression of adventure and RPG elements in Sabre Wulf,  aside from busy-work wandering, or chatting with non-player characters, or buying new creatures for the challenges, this game's nearly 100% action. The adventuring elements are admittedly the weak link of the Sabre Wulf chain, sloppily tying together the different platform challenges together. Many of the jokes and conversations make references to Rare's history, much of which took place before the NES days. So don't be surprised if a lot of the humor goes woosh right over your heads.  On the technical side of things, Rare still knows its stuff on the Game Boy Advance. It's pretty clear that the team's using the same engines it created for past games like Banjo-Kazooie and the Donkey Kong Country series, because Sabre Wulf shares a lot of the same ~feel~ from both those games...in looks and in gameplay. Most of the imagery is of the CG rendered type that Rare itself pioneered on the Super NES. And though the technique's lost a bit of impact due to its standard use in the gaming industry, Rare can still show off its artistic skill in this department with some wonderful creature and character animations. The design team stayed away from GBA hardware effects for Sabre Wulf, but there are still some subtle visuals going on. Watch for the slight lighting effects when Sabreman moves close to a light source.  The game also doesn't suffer from being a ~short~ adventure like the company's last original GBA product, Banjo-Kazooie. Sabre Wulf has a finite number of levels, but each level also has a Challenge Mode attached to it. It's here where players will stumble onto some tricky little challenges where they must solve the platformer and beat the clock by only using the creatures available in that specific design. This doubles up the game's length with additional ~collectibles~ to complete the game 100%. Sabre Wulf definitely feels like a welcome throwback to the NES days when the team created wonderfully original and fun game designs that didn't focus on familiar branding...games like Snake, Rattle and Roll, Solar Jetman and Wizards & Warriors. The team has offered up a fun action game that's easy to understand and get into, and feels entirely like its own. Even with its loose, sloppy ~adventure~ elements and strange difficulty balance. And with its debut back at E3 2001, it was a long time coming...but Sabre Wulf was worth the wait.", "date": "Jun 7, 2004"}