{"name": "Spartan", "name_review": "Spartan Review", "ref": "https://www.ign.com/articles/2004/06/09/spartan-review", "text": "The Spartans were a tough lot, running about the Mediterranean in their skimpy togas no matter how cold those Greek winters got and fighting anyone who dared cross the line into their territory. Indeed the Spartans were the best Greek clan when it came to physical prowess, fighting off an entire Persian army with less than a hundred men according to historical legend surrounding the battle of Thermopylae. Being such hard men you'd wonder whether they'd even understand the concept behind a turn based strategy game let alone be able to play it. I'm not quite as tough as the Spartans, but at least I was able to have a look at their game instead.   With all of this proud history you'd think a fighting game focusing on the exploits of the Spartans would be a bloodthirsty and macho affair. Well you'd also be wrong. This game is a fairly tame, if at times interesting, city management affair which has a little (oddly bloodless) real time combat.   The game delivers a sense of variety in that there is a strategic world building element, a touch of diplomacy and technology development, some map management and conquest as well as the tactical combat.   On the eye candy front the game is pretty Spartan too. The graphics are colourful with lots of lush green tones, but there is no 3D wizardry to speak of and little variety in the town management screen. The troops are also not animated particularly well. They look decidedly average compared to great (and older) games like Stronghold or Total War. They also don't have as much variety in their movement when it comes to animation so they are less interesting to watch.    However the main reason why the tactical combat mode isn't that much fun to look at is its simplicity. It's virtually devoid of any interaction. You can set up your deployment at the start of a battle and you can assign formations and give basic orders, but once you have begun the battle itself your troops pretty much are on their own. This is made worse by the fact that these guys have a habit of doing pretty much what they damn well please, thus the battle quickly deteriorates into a chaotic affair where sheer weight of numbers seems to do the trick.    Using superior troop types and keeping your missile formations away from melee range can have an effect. That said, being unable to control your men after the battle begins means it is pretty much pot luck whether your men actually do what is asked of them.   You can rally your troops while the battle is in progress, but this is close to all you can do (you can also retreat). So the tactical mode quickly becomes a chore which is far from enjoyable. Thankfully you can skip it with an option which lets you resolve combat automatically.      This is what you'll probably do in most fights when you realize you are likely to win -- the game presents you with troop strength scores which make it clear how likely a victory will be. So effectively the real time combat is not a part of the game for most of the time and this is a shame, as Medieval has proved that this sort of thing can be hugely enjoyable and blend well with a more strategic game engine which looks after the big picture once the battle is over.   The economic system in the game is a mixture. There are good elements, but also many holes in the model which aren't explained in the tutorial and take some time to get a feel for.    You can assign men to various buildings in any of your towns and these can be drawn from the population. This boots building effectiveness. However you might also want to keep a number of people unemployed, as it tends to help them stay happy, and of course idle hands are also quickly and easily pressed into military service, all in the name of your glorious empire expansion.   The GUI is for the most part logical, with rollover help and most menu elements in logical places.  Because there can be a lot to do in managing each of your cities it the game can sometimes get bogged down by micromanagement. It is also easy to forget to use a turn properly by ensuring that each city is actually doing something useful. Both of these problems aren't major, but will annoy some of you.    The way Spartan sees you engaging in some duplicitous diplomacy is intriguing. You can send diplomats to cities which are a part of a rival nation, and for the most part they get up to no good, stealing information, inciting resentment and stirring up trouble in other ways. However you have to be careful as the rival government could choose to do some pretty nasty things to your bloke under cover. Boiling in oil is probably the nastiest fate, but it isn't the only way you can see you diplomat perish.   Trading is pretty simple. The basic trade table screen you can manipulate lets you select quantities, set up arrangements and always keep your eyes on their cost. It is all quite effective, even if trading feels like a database management chore rather than good gameplay.   Another aspect of the game which doesn't make sense is the way you cannot construct new towns or villages. You are pretty much stuck with the existing settlements on the map and you will either have to develop those you have or capture new places which are current ruled by your enemies. You can't build anew, which might make sense if you are looking to replicate real world history, with accurate topography, but it simply isn't fun as you feel constricted in your choices.    Being unable to build new towns has another drawback too, as each town has unique resources and you can't overcome a resource imbalance by simply building a new town in an area where you might find a scarce resource. For example you might need wood and so building a town next to a forest would make sense if it were possible.  But it is not and this is annoying as you have to again work with what is on offer for no good reason.   The research system works pretty well with sliders and seven research domains for you to concentrate on. You can allocate your research points as you see fit. This is straightforward enough with you having that age-old dilemma of wanting to research science enhancing advancements, so you can research faster, while not hurting your military development, just in case you are embroiled in a war. You will get closer to your research goals turn by turn, with each turn representing a month of scientific work.     A lot of the research relates to building upgrades and many of these don't feel very different or interesting, usually just adding incremental performance or output gains. It is fair to say that you wouldn't expect research to be that earth shattering though, as we are looking at a limited time in human history and a time when science was pretty much in its infancy, so you can't really fault the technology system for being basic, as this is how things were back then.Spartan isn't a total shambles, but it also has a few ill-conceived elements and doesn't manage to really shine in any particular area. If you are a fan of ancient combat and strategy then this game will probably appeal, but don't expect it to deliver much that is new. The game has some aspects which are amusing, but they are for the most part overshadowed by shoddy design and unoriginal gameplay.The real time stuff is woeful and the turn-based management only has a few elements that can be considered in any way interesting. The use of emissaries for diplomacy is intriguing, but the rest of the turn-based stuff is pretty much what you have seen many times before.", "date": "Jun 9, 2004"}