{"name": "Smash Court Tennis Pro Tournament 2", "name_review": "Smash Court Tennis Pro Tournament 2", "ref": "https://www.ign.com/articles/2004/06/09/smash-court-tennis-pro-tournament-2-2", "text": "In 2002, Smash Court Tennis Pro Tournament established itself as both being the first real tennis game on the PS2 and also having one of the most ridiculously long names ever created. Soon after, however, Sega Sports Tennis came along and showed how tennis games should really be done. As a follow-up, Smash Court Tennis Pro Tournamet 2 makes the name just a little bit longer, but also provides several enhancements to try to reclaim the throne.     So does it get there? Is this the new king of PS2 tennis games? Does it rule across all consoles and redefine the genre? A lot of questions indeed and sadly the answer is no. Don't worry, though, because it still provides a fine alternative and offers a new tennis title in a market that sees no competition.    Updates  Some of the biggest changes to the game are the graphical upgrades to the overall experience. The framerate holds solid, the characters are better defined and look more like the 16 real-life pros that lent their likenesses to the game. The courts have more detail as well, especially the grass courts with the worn out areas. The only thing missing is a change of the audience from 2D cutouts to polygonal characters.    Another key change is that shot control has been improved, especially with the serve. Careful analog control lets players nail shots into the side or slam it right down the center. With some practice, I was able to pull off successive aces off of Ivan ~No Chair Can Hold Me~ Sulic. With careful control, it's possible to play a complex game with plenty of back and forth against an opponent. This especially helps with more shots to choose from than before.   Where the original Smash Court only included the topspin, the lob, and the slice, Smash Court 2 introduces the flat shot and the drop shot. There is also the ability to run for a shot by holding down the R1 button. The new shots are wonderful to work with and deepen the game, but the run feature brings some problems with animation that can get in the way of maneuvering quickly and easily.    Control  The players in Smash Court 2 have lots of set animations for the different movements, especially the shots and often these need to be carried out before anything else can be done. This makes the game more realistic and simulation-based, but it also makes the game a little clunkier to play. The run feature shows just how a feature can get in the way. Should you decide mid-stride to stop and go for a shot, the character will take a few more steps to stop and miss. The only way to make it work is to perfectly time the run and shot from the beginning.   The same thing happens with many of the shots. It's not a Shaq-Fu level of problem where it takes a few seconds to get the right shot, but it still breaks up the flow of the game to be more in favor of the realism. There's no problem with being realistic, but it does make the game more difficult to get into. This increasingly becomes a problem with the difficulty in judging the depth of the field, especially when playing on the far side of the court.    Without any graphical touches that help to explain the height or location of the ball, it can easily be a bit of a problem figuring out just where the ball is. Often, the ball is flying overhead and impossible to hit, but it barely looks any different from a ball that's coming in at a regular height. With one of the options activated, it's possible to see the landing spot of a lob, but all the other shots are harder to spot.     Pro Tour  As for the game modes themselves, there's the Arcade Mode for a quick solo game, the Exhibition Mode for one to four players, Tutorial Mode, Challenge Mode, and the Pro Tour. Most of these are self-explanatory and drop into the action pretty quickly. The Challenge Mode features some tennis mini-games that help players hone their serve and rallying skills. These are all well and good, but the one real mode that helps pay the rent is the Pro Tour.   In the Pro Tour, you create your own tennis player from scratch and run him or her through training rounds and tournaments in the hopes of becoming the top ranked player in the world. The selections of faces and hair are pretty limited, but the different playing styles will have a large effect on the way the game can be played, at least initially.    By successfully completing practice mini-games and winning tournaments, the player will level up and get more points to upgrade the characters different attributes. Each of the characters will have an initial strength in their own areas, but by advancing along, gamers can choose even more how they want to play the game.   There are two ways of playing through the tournaments: the hard way with the regular mode or the easier way with the mission mode. The regular mode involves beating opponents through regular play, but the mission mode has an odd twist. Instead of a normal round, there will be a challenge to complete in order to win the rest of the set. This helps to change the game up and speed gamers through the tournaments, but so many of these challenges are just silly or annoying.   One of the more difficult challenges to pull off is the one that requires that the player serve an ace. This can be difficult to pull off and if a gamer wins the point without getting the ace, then the set is lost. In these situations I found it frustrating that I had to keep the game at deuce while I kept fighting for the ace. This grew even more annoying in the later levels with better opponents. Overall, the whole experience grows tiresome and the challenges get too repetitive.    Still, the game is a major asset for those who want to play through the regular matches since it provides a ton of games to play through and a multi-year career to experience. Fortunately, you can save mid-tournament so that each individual time commitment is measured in minutes and not hours. This makes this title an excellent choice for tennis lovers interested in the long haul.    Before I get to my closing comments, let's hear a bit from Ivan first.   Ivan's Comments  Life sucks, but tennis games make it a little better, unless you're playing Ed ~Cheating Swine~ Lewis, IGN's resident tennis bastard. He ruins the glorious experience of whacking green balls around a variety of courts by capitalizing off Smash Court Tennis Pro Tournament 2's many animation errors. When I play old Super Cheat the miracle server, my characters seem to twitch around like unresponsive monkeys who have just succumbed to a properly done flogging.      Nearly three out of every five of my return attempts is a dismal failure simply because Anna doesn't know her damn left from her stupid right. It's as if the computer cannot decide which animation to play for certain situations because your character is not in exactly the right spot so it just picks one at random and sees it through to the bitter end, which is incredibly frustrating.     Still, upon closer inspection of Smash Court the original, this sequel is a supreme achievement. It ups the graphical quality, the animation quality, the depth of play, and the presentation levels, but that doesn't mean this is the best tennis title on PS2 -- it does not make it Sega Sports Tennis. What it does mean is that Smash Court was overrated, and while this outing qualifies as a substantial improvement, it still deserves little more attention than any other passing tennis title that doesn't have Sega stamped on the front of the box.    If the animation were smoothed over, controls were about 85% more responsive, the game offered online play, and didn't boast some of the most crap-tas-terrific bass guitar driven ~tennis videogame~ music on the face of the earth, I'd highly recommend a purchase. Because none of this true, Smash Court is an above average, solid title, but not worthy of a recommendation over that game which still sits comfortably at the top of the genre. Smash Court 2 makes some much-needed improvement on the original and looks much, much better. The new Pro tour mode provides an incredible amount of play time and the Arcade and Exhibition matches make quick games solo or with friends a snap. Put the two games side to side and it's clear that this one trumps the previous entry. Then again, there are still the problems with the depth perception and the slightly wonky control that can leave characters locked in a little animation. This is more realistic, but hinders the game from being more of a game. Overall, it still isn't the best thing out there, but it's definitely a solid update and holds rather strongly by itself.", "date": "Jun 9, 2004"}