{"name": "Mario Golf: Advance Tour", "name_review": "Mario Golf: Advance Tour", "ref": "https://www.ign.com/articles/2004/06/11/mario-golf-advance-tour-2", "text": "One of the few Game Boy games to receive the highest marks on IGN is Camelot's Game Boy Color rendition of Mario Golf released more than three years ago. It exceeded what was expected on the 8-bit system, offering an incredibly deep, thorough golfing experience despite the system's obvious technical limitations -- Japanese development house Camelot Software Planning worked within these limitations to produce a handheld equivalent of its console editions, and the team succeeded admirably. With the release of Mario Golf: Advance Tour it's clear that the team has outdone itself with its second handheld golf game, easily making it the best portable golfing experience ever conceived. The Game Boy Color Mario Golf laid the foundation, but the team drastically improved on the design in almost every conceivable way for the much more capable Game Boy Advance system. Features More than 14 playable characters Six full courses, both normal and ~Star~ versions Full RPG story mode to level up players abilities Wireless Adapter compatible Link cable support for four players Single system multiplayer Cartridge save (one player slot) Connectivity with Mario Golf: Toadstool Tour  Like the Game Boy Color version of Mario Golf, Advance Tour is a parallel golfing experience that supplements the current console game; in this case, the GameCube Mario Golf: Toadstool Tour. In its core golfing engine, Camelot sandwiched the excellent golf mechanics of Toadstool Tour to the Game Boy Advance's button configuration, and even with fewer buttons players have just as much control on the portable links. As good as the GameCube game is with its slick 3D environments, though, Advance Tour absolutely trounces it in features, options, and pure gameplay.  The golfing mechanics utilize the same tight and intuitive control that Camelot's golf team established on the GameCube. Players aim via an overhead map of the course, plotting their point on the fairway by selecting a club and adjusting the distance that club can handle. The game engine offers a rough ball trajectory (a feature that can be turned on and off in the handicap menu options), but it's up to the players to time their swing in order for the ball to travel along that predicted path. Of course, when wind or fairway/green speeds change, players will have to adjust their aim and swing to accommodate for the varying conditions. Players have additional control via ~typing in~ button combinations to pull off a backspin or top spin, giving players the same wonderful control as created in the console game.  It wouldn't be a ~Mario~ game without Mario elements, and even though the game lacks the same amount of playable Mario characters than the GameCube game, Mario Golf: Advance Tour features far more Mario-isms in gameplay. You might not see it from the start, but every hole of every course has an unlockable ~Star~ version that features elements like rubber Mushrooms or Warp Pipe shortcuts, Mario Kart zipstrips that give the ball an extra boost of speed or Question Blocks that reward players with additional experience points...or simply change the direction of the wind. The specific Mario courses also go ~extreme~ with Pirahna Plants that spit the ball back out onto the fairway, Chain Chomps that'll munch the ball into an out-of-bounds status. There are even triggers that players can land on that'll alter the course's layout. These little elements spruce up the game with tons of surprising elements that add to the overall fun of Mario Golf  Of course, the fact that the Game Boy Advance's hardware capabilities aren't anywhere close to what the GameCube can do means that Mario Golf: Advance Tour has to look significantly different than its console brother. For the golfing engine, Camelot utilize two different game engines. For the freeflowing view, the game features a Mode 7 environment that, at first glance, might not have been the best choice for a golf game. Trees, hills, and other 3D obstacles are actually painted on a flat graphic that's then tipped at an angle, making everything appear awkwardly squished and skewed; it's initially difficult to read which directing hills are going because of the camera's angle. But this view does allow for a viewpoint freedom of movement; it's possible to zoom in and out of the course all the while seeing more of the fairway in the distance. And even graphical limitations, all of the objects act exactly as if they were 3D: balls will hit or travel behind obstacles depending on their position, and the balls will roll up, down and bounce against hills in true physics. And though the majority of the game features that Mode 7 engine, when players move to the ~swing~ view, Camelot has established a behind-the-character view that accurately renders the environment to display exactly where the ball's positioned.      Even though players can simply jump into golf with a small selection of characters, Advance Tour's central presentation revolves around its RPG design. The RPG design simply ties the golfing elements together, offering far better continuity in its presentation that simply offering a bunch of menu selections. Players will feel more connected to the game's world and characters because of the required interactivity between them. And even if somehow you didn't realize it before, you'll know right from the start that the Golden Sun team was directly involved in this golf game's design. Advance Tour utilizes the same technology, engines, and art style created for Camelot's Golden Sun RPG, which isn't a bad thing considering just how outstanding, at least in visuals that series is on the Game Boy Advance. Describing Mario Golf as ~role-playing golf~ might be a mistake, though, considering the target audience should be golf fanatics and not the fantasy adventurers.   See, it's not simply about playing the courses. It's about improving your character's abilities through earned experience, and it's this experience that builds up not just the character's skills during the actual golf matches, but also the player's ability to control them and their skills. Participating in mini-challenges teaches the various nuances of the golfing mechanics, and if these tasks are performed successfully the game rewards the player with experience points that must be transferred to the two characters. Each point threshold triggers a raise in golf ~level,~ and players can then upgrade the specific abilities with that additional level, from driving distance to ball control. So, while players can earn points in standard golfing competition, the real points come from finding all the extra putting, approach, and driving challenges in the different environments. There are even some hidden events, like Koopa Troopas requiring some help, or a gopher taunting players to hit it. These events reward players with items that'll increase their characters' attributes.   Players control only one character through the RPG, but they actually have to take care of this character's partner since much of the game revolves around ~Doubles~ play. In Doubles, teams of two players compete against each other, and each player alternates their turn after each shot. If your secondary player hasn't been leveled up properly, there's no way you'll be able to compete against the higher level characters in the game. So there's a lot of strategy in figuring out when to send over your earned points to the other player. So much so that it may (and will) affect your standard singles play.  And while leveling up is important to complete all of the challenges in the Game Boy Advance game, it also comes into play when you take advantage of the connectivity between GBA and GameCube. There are certain elements (like hidden characters) that seem to unlock only when downloading the accumulated data from Toadstool Tour, so to get the full experience you'll have to track down and play through much of the console title to get everything out of the Game Boy Advance version. But wait until you see just how much of an upperhand you have in the GameCube rendition when you send over your leveled-up GBA players. 350 yard drives? Woo!  Overall, players can put in about 10 hours and complete the standard amount required to get through to the Mario Tournament, but even reaching that point you won't have seen everything. With all of the unlockable items (clubs, Star Courses, characters, challenges), on top of the near endless gameplay of the standard stroke, skins, singles and doubles challenges, this game just keeps going and going and going. Video golf might not be everyone's cup of tea, but no one can deny the amount of effort that went into the creation of Camelot's latest Game Boy Advance game. From its single player elements to its GameCube connectivity, to its Wireless Adapter support, it's impossible to list every single one of the elements that make Mario Golf: Advance Tour such an amazing GBA title; everything that made Mario Golf: Toadstool Tour, sans the 3D graphics, good has been improved upon for the portable rendition. The GBA game is far more realized a golfing design than its console brother, offering an immense amount of challenge in its wonderfully constructed gameplay. Its mechanics are easy to grasp for those just looking for plug-and-play action, as well as incredibly deep for those who want a lot more control in their virtual swing.", "date": "Jun 11, 2004"}