{"name": "Shining Force: Resurrection of the Dark Dragon", "name_review": "Shining Force: Resurrection of the Dark Dragon", "ref": "https://www.ign.com/articles/2004/06/14/shining-force-resurrection-of-the-dark-dragon", "text": "The recent release of the Classic NES Series has proven that the GBA is not only a great system for portable gaming, but the best (and in most cases, the only) system to play through those golden oldies. Former Genesis fan boys, such as myself, eagerly await the re-release of games from the 16 bit era and our prayers have been answered with the arrival of Shining Force: Resurrection of the Dark Dragon The game is an updated version of Shining Force: The Legacy of Great Intention which is remembered fondly as being one of the first console games to fall into the now popular ~turn based strategy~ category. The core gameplay and story line are intact, but Atlus was kind enough to make some minor updates and additions to the game which will be discussed later. For some gamers, the novelty of playing an old favorite will be enough to give this game an instant 10. However, a lot has changed since the Shining Force series first appeared in the early 90s. Especially in the field of turn-based strategy.    Features  Three Cartridge Saves  New Card Battle System  New art and updated graphics.    Resurrection lets gamers control a hero suffering from amnesia and his army of companions as they attempt to stop the Dark Dragon from taking over the world. Granted, this storyline seems slightly generic, but back in the day it was primo stuff.  Players do battle with 12 warriors out of a possible 30 characters in the game. Collecting the odd assortment of characters is half the fun. Each person who joins your team has their own personality.   If you are new to the realm of turn based strategy, Shining Force is a good place to start. This showcases the genre in its most pure form. The game play is very straightforward and the first couple of battles are easy enough to be considered a tutorial. Players are guided through the more complicated aspects of the game by a mentor character that also dishes out advice for each battle. When they reach the battlefield, players maneuver members of their army over varied terrain and attack the enemy using magic, close range melee attacks, and long range assaults. Team members have varying abilities that determine their position and strategy. Typically, healers, mages, and archers are less skilled at hand to hand combat and should be kept off the front lines, while the tougher dwarfs and centaurs can charge into battle. Beyond close range attacks (1 space), long range attacks (2 or 3 spaces), and magic (multiple spaces), there is little else to be said about the battle system. Some characters have greater movement on the map screen and there is some crossover between warriors and mages, but for the most part the game's battle system is fairly limiting.    The game has a number of RPG elements, such as characters that level up with every 100 experience points gained in battle. There are also the requisite weapon and item shops where the force can upgrade and repair their arsenal. However, the battle fields and towns in the game are broken up by chapters, and cannot be revisited once the storyline advances. The skills of each character also increase automatically so while players can choose who they take into battle, they cannot influence which abilities each soldier develops as they gain levels. While the RPG elements are there, gamers should be aware that Shining Force is mainly comprised of turn based battle, not character management.      Another important aspect of Shining Force is that unlike Advance Warsor Fire Emblem, you can play with the same group of characters for the entire game. When a character is defeated in battle they are labeled as ~exhausted,~ and can be made battle ready for a small fee at the next priest. The battle will only end if the main character is has exhausted of his hit points. This means that there is relatively little punishment for mismanaging your troops. In fact, some of the weaker characters are most useful as fodder that lure the enemy closer to your front line. It also means that in the more difficult battles players must become overprotective of their main character, keeping him almost completely out of the action.     Many of the changes Atlus has made to this game are cosmetic tweaks that will welcome with open arms by fans of the series. For example, in order to converse with a character you no longer have to select the ~talk~ icon, you can simply press the A button. You are also given the option to change your team members at the start of each battle as well as at your headquarters in each town. Extra items that don't fit into your inventory are instead dumped into an item box that is accessible from any menu screen outside of battle. All of these changes help to streamline game play and make the game more accessible. My only complaint is with the process of exchanging and equipping weapons. The menu screens feel clumsy even after a few hours of play. There are some slight graphical upgrades although the game still maintains it's slightly dusty, early Genesis looks. There have also been some minor changes in the battlefield layout and character balancing. Overall, these changes are very minor and will be unnoticeable to all but the very hardcore Shining Force fans.     There are also three new characters in the series who are introduced via a side story that parallels the main adventure. These added battles exist as prologues and epilogues to the early chapters. One problem with the new team is that they don't have access to the towns after their solo battles. This means that if they are defeated, the game simply advances without any penalty or explanation. Of course they miss out on experience and some items on the battlefield, but did the enemies simply evaporate after declaring victory? Minor issues like this cause the added story line to feel slightly tacked on.    Another new feature is the card battle system. One of the three new characters is a card master who appears at the beginning of the game to inform you that magical cards have been scattered about the land and it is your duty to collect them. He can later use these cards to summon a 13th warrior on the battle field, imbue characters with special abilities, or mimic another class of fighter. This is an interesting addition to battlefield tactics, especially considering the limited class abilities of the other characters. Searching for cards also encourages players to fully explore the environments and hold conversations with townspeople. Overall the extra content is a positive addition to the game and I feel that even more could have been done in the same vein.    As stated earlier, the graphics of Shining Force have been upgraded, but they still feel dated. Even with the ability to promote characters at level 10 (which changes their appearance and attack style) the battle animations become tiresome halfway through the game. One of the most attractive elements of the game is that each character that joins your team has their own personality. They will issue comments at the beginning of a battle and have some limited interactions with each other. Unfortunately, one element of the game that seems to be completely unchanged is the music. There is one bouncy battle hymn and a short town ditty that become tiresome quickly. I switched off the music by the third chapter.With excellent titles like Advance Wars,  Final Fantasy Tactics Advance, and Fire Emblem, the Game Boy Advance is already well represented in the turn based strategy genre. Shining Force is not quite as deep or visually interesting as these newer entries into the genre. However, I did have a lot of fun revisiting one of my favorite games from the 16-bit era. I would highly recommend this game to fans of the original who are seeking to replay one of the classics. One can only hope that a remake of Shining Force II is in the works.", "date": "Jun 14, 2004"}