{"name": "Ground Control II: Operation Exodus", "name_review": "Ground Control II: Operation Exodus Review", "ref": "https://www.ign.com/articles/2004/06/16/ground-control-ii-operation-exodus-review", "text": "A few years back when I was still a fledgling editor here at IGN, Massive Entertainment and Sierra Studios released a new property that helped to usher in the new age of fully 3D real-time strategy games. The crazy thing is that they managed to do this with quality and style. The camera worked, the units were balanced well, the 3D environment made a big difference to gameplay, and the story was interesting. Four years later, Massive and Vivendi are bringing out the sequel to that first game. With some new ideas and the same philosophy of quick thinking tactical gameplay, Ground Control II: Operation Exodus revives the series with just as much style and polish, a beautiful new engine, a good story, and a lot of frantic fun.   Ground Control II: Operation Exodus jumps forward in time from the original game by a few hundred years into a time when the Crayven Corporation and Order of the New Dawn don't even exist anymore. Instead, we're introduced to the Northern Star Alliance, a group of planets that were Earth colonies cut off from the center of human space back during the corporation wars in the first game. Sadly for them, their independence was to crumble when the Terran Empire, the new rule in human space, decided to come back and bring the lost colonies back into the fold. Rather than let these planets defy them, the Empire begins to purge them, killing millions and destroying whole cities from space. In a last ditch effort, the NSA raises energy shields to block the bombardment so the only option left to the Empire is to bring in the ground troops and take each city from the planet surface.   The story begins as Captain Angelus steps into command of units defending cities across the planet of Morningstar Prime. The story moves forward through short CGI cutscenes, objectives and updates on the battlefield via quality voice-overs. The story certainly won't give anyone a coronary from the less than surprising twists, but the whole package is presented well enough with fairly likeable characters and decent writing.   Visually, this sequel does not disappoint. The upgrades made to the engine help to build detailed environments that range from swamps to winter wonderlands. The environments are only made better thanks to some terrific lighting and gameplay-altering weather effects. Various environmental additions such as flocks of birds and geysers also help to build the fantasy. Units have been deftly modeled and textured. As with the first game, parts of each of the vehicles move and track targets, creating a much more lifelike battle. And once those fireworks start flying, you'll know the game has really begun. Flashy explosions and effects increase the hectic and confusion of some very fast-paced battles.     Ground Control was a different beast than its new sibling. Missions were completely tactical, leaving players to both careful planning and quick response. The units that started the mission were the only forces available to that mission. Each unit became exceedingly important, which in most cases helped make the game better, but occasionally helped to slow the game down to a crawl. Ground Control II keeps the tactical strategy, but adds a couple of great features that speed the experience up and make it feel much more like a futuristic ground war.   The fact that reinforcements can be called into battle certainly helps the situation. Not only does it allow you to customize the forces you're using, but also allows players to make some mistakes without being punished so harshly. Now you can feel free to move your units with impunity and be much more aggressive than the original title allowed.   Reinforcements can be purchased with victory points which are gained over time by capturing victory locations and through the destruction of enemy units. Instead of sitting back and harvesting in order to build up an invincible army, you're forced to move into the field and make good use of what you're given in order to have the opportunity to build your army. Even better, the enemy will be actively trying to reclaim these areas for their own use and trying to hurt your chances of bringing reinforcements into the fray.   These extra troops are dropped off with the next big addition to the Ground Control series. Dropships were actually used in the first game, but only at the beginning and ending of a mission. Now, you'll have to call your dropship in to drop new units off from time to time, but will also be able to take advantage of it as a weapon. To this cause, dropships can be outfitted with upgrades to the weapons, armor, speed, and so on. The flying fortress can then move around the battlefield dishing out death to important targets. The big catch to this is that if you lose the dropship, you also lose your opportunity to call down reinforcements.    And you'll need those reinforcements, as there are some seriously aggressive enemies waiting for you in the single player and co-op games. The AI is under orders to kill you, and they'll try their best. The artificial intelligence could still stand for some improvement, as their tactics are sometimes baffling. But for the most part, it manages to create enough of a challenge to keep things interesting, although I'd recommend that RTS veterans play the game through on the most difficult setting. I was also glad to see that pathfinding was improved from the recent beta copy we received. It still isn't perfect, and you'll find units getting stuck at times and will notice an irritating habit units have of switching positions in a formation when told to move from place to place.   Units are very well balanced and have pretty varied uses. Each of them has a secondary ability that you'll find yourself using quite often. For instance, the NSA rocket launchers fire rockets at vehicles in their primary mode and generate a defensive shield against rockets and artillery in their secondary mode. Both modes are extremely useful, and balancing the uses of each is a trick in itself. Add in the Viron race's ability to meld units into a different unit altogether, and you have a very active and organic battlefield that's likely to change at any moment.   While some of the units are similar, especially between the NSA and Terran forces, the Viron bring a much different style of play. Some of the units will have similar uses to their human counterparts, but many of the secondary uses of the units are buffs and debuffs, making them a bit harder to understand and use. It will undoubtedly take most players a while longer to master their uses than the more conventional NSA army.   Multiplayer was a strange mixture in Ground Control. It was a deathmatch-style affair that allowed players to jump into the battle at any point into timed matches where reinforcements would be sent in when all of a player's units were completely destroyed. It didn't really hold my interest. Certainly, the introduction of victory locations, drop zones, and reinforcements helps the issue tremendously. Defense is now a real consideration, as is a planned offense. The pace of these matches tends to be pretty fast, and conflict over zones continuous, which can create an awesome atmosphere.     Unfortunately, the multiplayer is still fairly limited from where I wish it was. Why there isn't an option for objective based multiplayer where one side has to defend a goal is confusing to me. They have all the tools there and could create some brilliant scenarios. But on the other hand, Massive has done something with multiplayer that I wish more developers would embrace. The entire single player campaign can be played cooperatively with a friend or two. Players can trade units back and forth on-the-fly, and each will be in command of their own dropship to call in reinforcements. It certainly adds more interest and replayability. I do have to wonder why a human couldn't take an AI's place in the missions where AI has a significant presence in the single player missions... It seems like a natural thing, but maybe it just didn't work with the story progression and scripted events. It does seem stupid that in some missions you actively have to hand over units in order for your friend to even play before a landing zone has been captured. I've had a blast playing Ground Control II: Operation Exodus. It's fast and fun and was certainly one of the most entertaining games that I've played in quite some weeks. The single player campaign is designed well, as are the maps for each of the scenarios. Units are balanced excellently and have enough variety and uses to keep any strategist thinking about useful combinations. AI could be a bit more creative in their tactics, and pathfinding could also be better, but it's good enough to keep the game interesting.Both the sound and graphics are done quite well and complement a decent story that may not have you on the edge of your seat but will certainly keep you entertained. Presentation in general seems to have been a high priority, and that always makes me happy.The new victory locations, reinforcements, and faster pace of play improved both the single player (both campaign and skirmish) and multiplayer portions of the game. Cooperative play also is a great addition and will add to an already impressive amount of replay value.RTS fans haven't had anything to really be happy about in a long time. Ground Control II will definitely fill the recent void nicely. If you're looking for a new strategy game, definitely give this one a look.", "date": "Jun 16, 2004"}