{"name": "MLB SlugFest: Loaded", "name_review": "MLB SlugFest: Loaded", "ref": "https://www.ign.com/articles/2004/06/18/mlb-slugfest-loaded", "text": "There are two outs in the bottom of the fifth inning. It's a tie game, and the bases are loaded. Derek Jeter is at the plate. ~Let's go Jeter!~ I say to myself, my palms sweating as I try to untie the game with one swing of the Yankee all-star's bat. Wait did I just say what I thought I said? I wasn't just rooting for the Evil Empire, was I? Unfortunately, I was. No matter how much I hate the Yankees, I still hate to lose and it's still just a game. Jeter swings and hits a hard liner to centerfield and takes off to first base. I couldn't be any happier as I am about to take a one run lead over the Minnesota Twins. All of a sudden, an on-fire Torii Hunter fields the ball in shallow center and throws Jeter out at first base. Inning over! So much for the one run lead, and that's what I get for playing with the Yankees.   MLB SlugFest: Loaded, a new arcade-style baseball game, created by Midway as part of their arcade-style sports series, along with NFL Blitz, NHL Hitz, and NBA Ballers, brings Major League Baseball into harmony with senseless violence. In fact, the game is so violent that it is the first game licensed by Major League Baseball to attain a Teen rating. In that spirit, there are even classic Midway characters like Sub-Zero and Scorpion that you can unlock and use in the game. The game rewards a hard-nose, aggressive style of play that would even make Charlie Hustle wince.    Gameplay  If you're looking for a game with realism and features indicative of a true Major League Baseball simulation, then SlugFest is not the game for you. However, if what you want is a fast-paced, extremely fun, hard-hitting arcade-style game, then this is right up your alley.   Click for more images The ~SlugFest~ mode is the arcade-style playing mode in the game. Every pitcher has a set of regular pitches, i.e. fastball, changeup, slider, curveball, knuckleball, sinker. Along with those pitches, there are a set of trick pitches that correspond with each regular pitch, i.e. fireball, eephus, Mr. Snappy (the pitch that Randy Johnson used to shatter J.T. Snow's jaw), sweeper, whizzer, and bouncer. These pitches tend to be a bit more extreme than their regular counterparts. For example, the fireball is just a fastball that can go 20 mph faster than a regular fastball and also has a bit more movement and the eephus pitch is ridiculously slow. Once you get the opposition to swing and miss or take for 5 total strikes (it doesn't matter how long it takes you to get this), you get a special pitch which is basically unhittable. There are a few of these, but they all basically jump around and even can move off the screen and still drop in for a strike. Once you try to hit one of these, you'll be begging for baseball to re-instate the spitball. Hitting the turbo button when you release the pitch will also make a pitch a bit more extreme, at the expense of accuracy. You can also choose to hit a batter, causing one or more of his attributes to decrease. For example, if you hit a batter in the legs, then his speed will go down significantly.   After the ball is put in play, don't get too lax out there. Baserunners are fully capable of punching your lights out and advancing a base or two while your player is still seeing stars. You can also hit back, by approaching and then slugging any player while he is standing on a bag. Although this apparently has no impact on gameplay, senseless violence is always fun.    Batting in the SlugFest mode is extremely easy once you get the timing down. If you get a few (it's kind of frustrating, because this number is completely different for every player) consecutive hits with any single player, then he will be on fire. When a player is on fire, he will run a little faster, hit the ball a little better, and throw the ball a lot harder. An on fire outfielder can gun out almost any player at first base. The trickiest part about offense is baserunning. Although the runners will automatically advance on a groundball or obviously uncatchable ball if they are being forced to do so by runners advancing behind them, the definition of ~obviously uncatchable~ is extremely tight. You really need to pay attention to what the runners are doing because if you don't, someone's getting thrown out by an outfielder.   Beyond the SlugFest option, new this year there is also the MLB Classic mode. This is more of a real baseball style simulation. This mode eliminates the trick pitches, the turbo button, and the ability of players to go on fire. There is also an accuracy meter that shows up while you are pitching. It is very similar to the kicking meters in most football video games. If you click too early on the meter, the pitch will stray high, if you click too late, then the pitch will fall low. Other than that feature, the simulation style game and the arcade style game run pretty much the same.   There is also a homerun derby mode in which you can choose from the top hitters in baseball to compete in a homerun derby. It is done in the same style as the homerun derby over the all-star break in the MLB. You get ten outs, whoever hits the most homeruns wins. Ties are broken by cumulative homerun distance, so whoever hit the ball the furthest on average wins the competition.   Click for more images The franchise mode is powered by the popular baseball simulation software called Baseball Mogul. In it, you can track league stats, make trades, call people up from the minors and send them down if they aren't performing well. One really cool feature is the News Pages section where you can look up stats, view the standings and view newspaper headlines from around the league. You can also change your team's pitching rotation, batting order and coaching strategies for simulations. With the coaching strategies, you can change how aggressive the manager is with changing pitchers and making other substitutions. You are also able to play your franchise in either SlugFest or Classic style of play.   I encountered a few problems with the game while playing it, however. Firstly, defense in this game is pretty hard to control. The computer selects the wrong player to go and catch the ball way too often on short fly balls, so it can be very hard to catch a duck-snort. Also, when you are playing in a National League ballpark, if you select a pinch hitter for a pitcher (you need to immediately select the pitcher that's going to sub-in the next inning), then pinch run for the aforementioned pinch hitter, you will actually need to make two pitching changes because when you pinch run for the pinch hitter, even though he's no longer the pitcher, the game once again forces you to change pitchers. So be careful and make your substitutions very carefully.    Graphics  SlugFest's graphics are Okay at best. The player face detail is really good, but everyone in the game is built like they are on steroids (even though many of the players may be). The crowd is visually unresponsive to things that happen on the field. If you leave the game idle for an hour and get back, the crowd will still be jumping up and down like they just witnessed a walk-off homerun in the twenty-third inning of the seventh game of the World Series.    There are a few different ball trails for homerun animations, including trailing butterflies, fireworks, and smoke, and if you hit the ball into the scoreboard, you can watch it explode like a scene from The Natural. On the field, most of the diving animations could use some improvement, as they don't look too fluid. Also many pitchers who throw sidearm in real life throw with a regular motion animation.   Sound  InSlugFest, you get everything you might expect from a baseball arcade-style video game. All of the baseball sounds are excessive, but more in the way that South Park is excessive, not in the way that Carrot Top is excessive. When a ball is smoked, it sounds like 50 tons of TNT just exploded in a bankrupt Las Vegas hotel. The punching sound is as true to life as one in a Bruce Lee movie. Those are great positives, but unfortunately there are many more negatives. Midway brings you the voices of all Midway sports games: Tim Kitzrow and his ~color commentator,~ Jim Shorts. Their witty and in-your-face commentary is about as played as Lil Jon at a basketball game (YEEEAAAAEEA!). I would die a happy man if I never again heard the phrase ~the mayor of baseballville, Jim Shorts.~(And if the ChiSox got off their asses and finally won something)   Online  As far as online gaming goes, SlugFest is excellent. I experienced very little lag and had a very positive experience. Other baseball games that I've played in the past have been very laggy and very disappointing. Playing online doesn't mess up your timing for hitting at all. The MLB.com stat/score ticker is also really cool as it actually provides scores of real games while you play. Anyone with a passion for the game of baseball like mine will appreciate it a lot as it eliminates the need to check the scoreboard while gaming. The online tournaments built in to the game are easy to set up and enable you to play against the best gamers in the world.MLB SlugFest: Loaded is a game for anyone that enjoys the game of Baseball and wants to satisfy that need for aggression at the same time. Once you get the timing down, you will enjoy the fast-paced, high scoring gameplay. The game is not so hard that you will get overly frustrated. Conversely, its not so easy that youll have the computer AI figured out in a matter of hours. You want my opinion? Hit the mute button, put on a good CD, and play this game to death. Bonds single season homerun record will be short lived once you take the stick.", "date": "Jun 18, 2004"}