{"name": "The Price is Right: Cliffhangers", "name_review": "The Price is Right: Cliffhangers", "ref": "https://www.ign.com/articles/2004/06/22/the-price-is-right-cliffhangers", "text": "There are a few television shows still in production considered institutions. ~60 Minutes.~ ~Meet the Press.~ And, of course, ~The Price is Right.~ The Bob Barker-hosted game show has enjoyed decades of success as each new generation of television watcher gets hooked on the happy go-lucky charm of the show, as well as friendly TV-grandpa aura of Barker.   Mobliss is capitalizing on the show's continued momentum by bringing a selection of ~The Price is Right's~ mini-games to handsets -- including Cliffhangers.   In the simple game, players must correctly guess the price of household items -- such a pizza cutters and baby books -- to send a lederhosen-wearing climber up the side of a mountain. Guess too low and the climber will barely move. Overshoot the price too often and the poor hiker will step into oblivion.   Cliffhangers is actually a really solid game for handsets -- despite its admittedly shallow premise. However, the game doesn't cost too much to download and Mobliss has a whole server-full of product updates to send to your phone. You'd have to play a lot of Cliffhangers to get the same peppermill twice.   Does Cliffhangers look like a million bucks? No. But it looks like the game show and the product illustrations are crystal clear. The music is right on, too, which is extremely important for this specific mini-game.Cliffhangers is what it is. If you're a fan of the show (and it seems there are plenty -- I passed a group of people in their Bob Barker worshipping t-shrts and trademark yellow nametags sitting on the patio of the Cheesecake Factory while walking to the gym), this is an easy gotta-have. Especially since you can upload your scores to a leaderboard and see where you rank amongst other Barkerheads. Sadly, Barker isn't in the game itself, but including his mug probably would have made the game's price not right.", "date": "Jun 22, 2004"}