{"name": "Star Trek: Hidden Evil", "name_review": "Star Trek: Hidden Evil", "ref": "https://www.ign.com/articles/1999/12/03/star-trek-hidden-evil", "text": "Right off the bat I'd like to make one thing perfectly clear.... I will not, repeat will NOT utter even one bad Star Trek  clich.  Do you hear me?  NOT ONE!!  With that said, it's time to get down to business.  With their first foray into the world of 3D (or pseudo-3D ... whatever), Presto studios, who are best known for their Journeyman Project series, brings us Star Trek: Hidden Evil ... and we wish it would have stayed hidden for a few more years.The game is set in the Next Generation universe, with Patrick Stewart and Brent Spiner (AKA Data) doing the voices for their digital counterparts, you can't help but get sucked right in.  You play as a young Ensign Sovak, who has had a lifelong dream of serving under Picard on the Enterprise.  Sovak also just happens to be the only non-Vulcan to master the famous neck pinch.  The game follows a story that unfolds after the events in the movie Insurrection, and without going into a long explanation of the plot, Sovak gets assigned to fly a shuttlecraft carrying Picard and Data to a planet within a vital area of Federation space known as The Briar Patch.  Everything starts out quite normal (for Star Trek anyway), but you soon find that there is an evil plot brewing (always with the evil plots these Star Trek people...sheesh!) and you are quickly thrown into a rich storyline, thick with interstellar shenanigans.The pre-game interface is very easy to navigate and looks a just like a computer panel that you would find aboard any ship in the ST universe.  This title is chock full of cut-scenes that are well done if a bit grainy.  Some of them feature FMV from the Insurrection movie, and I found that to be slightly cheap.  Moving Sovak around the levels is quite intuitive, especially if you are familiar with the control of other 2D/3D games like Resident Evil.  For those of you who are not, let me explain.  The characters themselves are all 3D, but the actual environments are pre-rendered 2D backgrounds.  That's what makes the wonderful graphics in these types of games possible.  As with all games of this nature, the camera is in a fixed position, and changes as you move from area to area.  This can be confusing if not done right, and for the most part, Hidden Evil gets the job done, showing off their wonderful levels from multiple angles.  Occasionally though, this can get annoying as you can get lost fairly easily if you don't pay attention to where you're going.The inventory is also fairly easy to use, and features some items that Star Trek fans will immediately recognize such as the obligatory phaser, tri-corder (this is well done, and comes in really handy), hypo-spray, and of course the communicator/ensignia thingie which allows you to contact Picard and Data pretty much at will.  Sometimes they will give you valuable clues to completing an objective, but I didn't find them of much value.  More of a novelty actually, but it sure is a cool one.  Along the way you will pick up other items such as the Romulan Disruptor, and a DNA sampler, but not too much else that is worth mentioning.This ain't no Quake frag-fest; it's a pure adventure game with a good mix of combat to keep things interesting.  The puzzle elements are fairly well thought out, and kept me wanting more.  Unfortunately, they were too easy for my superior intellect (yeah ... right).  I hate to burst my own bubble, but the puzzles could probably be figured out by a two year-old on Ritalin.  The sounds are just what you would expect from this game, and it sounds as if they were sampled from the movies and shows, right down to that annoying swoosh that all the doors of the future seem to make.  One would think that with all the technology around there, they could make a quieter door than the ones at Wal-Mart.  Before I get to the bashing, I think there are some things you need to know.  First of all Activision (who recently acquired the entire Star Trek license) hired Presto Studios to make this game with a few major goals in mind.  One goal was time dependent.  They had to have this game shipped for the holiday season of '99, and that gave Presto precisely one year to complete this game.  As far as development time goes, that's not much.  They also wanted a ~mission based game with step-by-step hand holding instructions to appeal to casual gamers.~   Apparently Activision did some research and found that out of all the fans who owned a PC capable of running games, only a very small fraction had ever bought a Star Trek game.  They found that the number one reason for this was that the games ~look too difficult.~  So Presto had to make a game for the non-gamer, and also make it fun.  I don't envy them one bit.  So Presto, (after tackling some major development issues) delivered exactly what they promised ... a game for my dad.With that in mind, here comes the slam.  Great demo guys, but where's the game?!  I don't mind telling you that I was having a blast playing this game, but when the end came, I had to pick my jaw up off the floor, and shove my bulging, vieny eyes back into their rightful sockets.  It is just way, way too short!  Maybe if they doubled the amount of game here it could have been a hit, but instead I was left shaking my head at the sheer lunacy of it all.  I know what you are saying, ~but Jef, with your superior intellect and gaming skills, you throw the curve off!~  Unfortunately this isn't the case.  A friend of mine, (who is by no means a gamer) beat it in around five hours (that's right, I make my friends do my job when they come to my house ... just like Tom Sawyer).  I don't know about you, but paying 30 bucks U.S. (which translates into about $2000 Canadian) for something that you will get Christmas morning and be using for a coaster by the time you break out the eggnog is just plain wrong.  -- Jef Shoults", "date": "Dec 3, 1999"}