{"name": "Legends of Wrestling: Showdown", "name_review": "Showdown: Legends of Wrestling", "ref": "https://www.ign.com/articles/2004/06/23/showdown-legends-of-wrestling", "text": "The more we think about it the more we realize that 2004 is the most crowded year we've ever seen for wrestling videogames. From THQ's Smackdown vs. RAW and Konami's Rumble Rose, to Eidos' Backyard Wrestling 2 and EA's Def Jam: Fight For NY, the sheer number of grappling titles out there is really quite amazing. But with the majority of those franchises not due out until the autumn or winter seasons later in the year, it's Acclaim's Showdown: Legends of Wrestling that's first to hit store shelves just in time for the summer.   Now for those of us who grew up watching wrestling on our local television channels rather than on a big time cable network, the fact that Legends is first to market should come as good news. After all, from the moment it was announced that the franchise had an all-new developer and expanded its roster, fan expectations and their anticipation had reached an all-time high. Throw in the fact that Acclaim was focusing on streamlining the grappling system while adding plenty of historically accurate goodies, and there was early hope that this third iteration of the series could finally overcome its storied bout with mediocrity.   But while dedicated fans of the previous Legends titles will no doubt find it easy to get excited over the game's large number of wrestlers and apparent bevy of visual improvements, we can't justify doing the same. Especially when considering just how much of a backwards step Showdown really takes.   A False Sense of Security  Perhaps what makes Showdown's downward spiral all the more heartbreaking, is the fact that at first it doesn't seem very busted at all. Boasting what can arguably be called the best lineup in the history of the genre, Legends of Wrestling sports an absolutely incredible list of historically significant ring generals. With a grand total of more than 70 personalities, the catalog of big-time names here is staggering. Haley Race, Andre the Giant, Hulk Hogan, Ricky Steamboat, Randy Savage, and Terry Funk are just a few of the Hall of Famers that join guys like Jerry Lawler, Paul Orndorff, Jimmy Snuka, and Kevin Von Erich in full retro glory.   In this shot, Hogan tries the old  There are dozens of other big names to toy around with in here too, with representatives from practically every organization imaginable somewhere in the mix. Fans of old-school regional grappling federations should take note, however, that they'll see a lot more NWA and AWA superstars on the roster than our beloved ~in-betweeners~ from the USWA and Pacific Northwest (Billy Jack Haynes, where for art thou?).   Another impressive feature for Showdown is its considerable list of fantasy and real-life venues. Extremely accurate and very different from one another, the various stadiums and arenas provide an assortment of locations like Dory Funk's Gym and the Pontiac Silver Dome in addition to Madison Square Garden, the Mid-South Arena, the Boston Gardens, and several others. There's a lot of wrestling history to be found in these locales too, so historians of the sport should go hog wild over the prospect of hopping into a Cow Palace ring before smashing their opponent into oblivion. Though sadly, Pepper Gomez and Crippler Stevens have not been included.   On paper, this assortment of game modes sounds rather enticing with de facto staples like Quick Play and Versus options joining the meatier Showdown Challenge and Create-A-Wrestler selections. Cage matches, First Blood competitions, Ladder contests, and table and hardcore bouts make up the majority of the available match types, with other popular modes like Battle Royale, Iron Man, and Best of Three adding further weight. Bret ~The Hitman~ Hart even has a built-in tutorial that shows you how to play the game, and the developers have included a special memoriam section for deceased wrestlers that populate the roster.    The Reality of Wasted Potential  Unfortunately, like most of the WWF grapplers from the early '90s, Showdown's gimmick is a lot more pronounced than its actual level of talent. Though the game obviously boasts a good deal of features and extras, the longevity that gamers may find with these options is questionable. One of the most obvious examples of this, for instance, is the terribly scaled down career mode. Now just referred to as the aforementioned Showdown Challenge, the career option is nothing more than a shadow of its former self.   In 2002's Legends of Wrestling II, players were given the opportunity to travel through various territories to earn and unite those titles into a single U.S. belt. Along the way, they'd meet up with a large number of jobbers, mid-carders, and main eventers before eventually winning the strap and hitting the world circuit with all the best names in the game. In many ways, this career mode was the best we've seen on the current generation of consoles (with last year's WWE Smackdown! Here Comes the Pain the only real competition), and it left us with the hope that we'd see it again with a little more polish and accessibility. Instead we're left with a glorified exhibition mode that boasts a measly three-era/ five-bout setup.   In simpler terms, the Showdown Challenge offers players the opportunity to wade through the 70s, 80s, and 90s in an effort to earn the titles from each decade before meeting up with Hulk Hogan in 1999. And while this particular feature could take up to two to three hours to complete on the hard setting, there's really no incentive to play through it other than to unlock the remaining hidden characters (maybe?). None of the matches you engage in have much of a setup or back-story to them either (they just sort of happen), and the anemic storylines that do exist will often repeat themselves match after match within the same decade (how many times will ~wrestler X~ mess with my supposed lady friend anyway?).   Sammartino vs. Koloff changed the wrestling world. But you'd never know it in this game. Throw on top of that nonsense the fact that the championship belts are never seen or worn (only talked about) before they mysteriously disappear when traveling to the next decade, and you have little reward for competing in this mode at all. Even the ending for the Showdown Challenge feels cheap -- providing you with nothing more than a ~Congratulations~ photo of Hulk Hogan praising you for beating him. That's right. There's aren't any in-game cut scenes, celebratory cinematics, or even an animated GIF; it's just a picture of Hogan making a face with a little bit of text on it. Gee thanks.   Keeping up the haphazard theme, the one mode we really liked is way too short and under developed. Known as ~Classic Matches Mode,~ this particular feature allows players to participate in some of the great match-ups of yesteryear so that they can rewrite history and change the outcome of popular bouts. Old school followers will recognize that most of Hogan's main events from WrestleManias 2 through VI are in here, in addition to the classic Steamboat vs. Savage and Owen vs. Bret Hart matches. Unfortunately, you can't play these bouts from the beginning (you're always thrown into them from a specific point in the action), and there just aren't enough of them to last for the long haul. With a roster as big as this, you'd think that Acclaim would throw in the Muraco vs. Snuka cage contest or the classic Steiners vs. Road Warriors bout from Starcade '89, but none of that is in here. Not even 1971's sport-shattering conflict between Bruno Sammartino and Ivan Koloff is represented and both of them are in the lineup. Come on now, how could you overlook that one?    Grapples, Ghosts, and Apparitions  As any fan of wrestling videogames can tell you, however, career modes and other such bonuses are only icing on the cake if the gameplay system is enjoyable. Because at the end of the day, how the title handles and how fun it is to wrestle with various personalities is all that matters. It's a great philosophy to adhere to (especially if you're a fan of Aki's old grapplers from the Nintendo 64 days) and one that we fully support. But in the case of Showdown: Legends of Wrestling it doesn't quite live up to that possibility.   That's not to say that the game doesn't offer up some good ideas, because, it does. And though it has definitely been reworked to be a slightly different animal from the last game, Showdown's mechanics are essentially a simplified version of the IPS system that powered Legends of Wrestling II. And while we definitely liked Part II's ability to chain maneuvers into complicated combos for some realistic scrapping, the timing of that system was so unbalanced that it didn't take long before players could completely dominate the CPU opponents with ease. This time around, Acclaim has taken the Smackdown approach and simply assigned different moves to the buttons that correspond to which direction players press on the pad. If a gamer presses the grapple button and then presses grapple again in conjunction with 'up' on the d-pad, for example, they'll execute a different move than what they would have done had they pressed 'up' and strike after the tie-up.   Unlike the Smackdown series, however, there aren't multiple kinds of grapples to choose from beforehand. So while Here Comes the Pain allowed gamers to choose from power, submission, quick, and signature tie-ups prior to their move selection, Showdown offers up only one type -- limiting the amount of moves that can be performed accordingly after the tie-up. What Legends has over last year's WWE game, though, is that it brought back the momentum meter that proves so important at the end of a match. Just like as it is in real-life contests, the roar of the crowd and the forward motions of a wrestler is what dictates what they can pull off. At WrestleMania III, for instance, Hulk Hogan would never have been able to slam Andre the Giant in the middle of their contest if he hadn't ~Hulked Out~ first and perform all of his setup moves. Showdown works on that same principal. Taken at face value, it's an intuitive and entirely acceptable system.   We don't care what anybody says. The El Matador gimmick sucked frijoles. Despite its charming simplicity, there are still a couple of other specialty buttons worth mentioning too; like the cheat-specific key, the ready attack button, and the special finisher that's activated via the flick of the right analog stick. But despite all these tools at the player's disposal, what ultimately destroys the game is the fact that the game is incredibly broken. In fact, we haven't seen a finished videogame this buggy since -- well, since the first Legends of Wrestling.   To begin with, the collision detection is way off. Though the player models and arenas are definitely the best the series has seen so far, neither of them have boundaries that make sense. When grappling on the arena floor, for example, there's an invisible wall that you can often bump into if you get too close to the walkway and it can literally stop whatever move you're performing dead. Additionally, player geometry is all screwed up and we've seen wrestlers literally phase through one another to create bizarre two-person amalgamations that defy all logic and precedents of human physiology.    To make matters worse, certain animations of wrestlers continue uninterrupted despite obvious clipping issues. In fact, we've experienced several instances where we countered an attack from our opponents with a good foot or two of space between us only to watch our foe react as though he hit an invisible wall with his elbow before being knocked backwards by a punch that we never threw. This isn't an isolated incident either; it literally happens in every match with every wrestler. Submission holds, body slams, and pile drivers -- it doesn't matter. Any of them can land with an entire ring full of space between opponents under the right circumstances.   Things get even more bizarre when playing specialty matches or tag bouts. The more wrestlers that are in the ring at the same time, the more likely they are to literally teleport to different spots in the ring. During one tag match, we saw two guys literally switch places in the blink of an eye while performing a simple grapple move. Another time one of our wrestlers (Terry Funk to be exact) mysteriously blinked in and out of existence before phasing through the ropes completely right before he fell thanks to a time-delayed drop to the floor. This kind of thing just shouldn't be.   Missing Spots Over and Over Again  As frustrating and comical as the above gripes may be, they're actually not as bothersome as the pacing priorities and gameplay hitches marring the action. To be quite blunt, the enemy AI is absolutely retarded with no idea how it's supposed to wrestle. And while it still has the impeccable reversal timing that it showed in Legends of Wrestling II (expect it to successfully counter a lot of your moves), it doesn't have the aggressive behavior to capitalize on it. Regardless of what type of match players are engaged in, the AI will spend most of its time just staring at you or taunting while waiting for you to make a move. Admittedly it does improve when playing on the hardest difficulty setting, but even then it's a relative push over with next to nothing to do with itself other than counter your own aggressive behavior.   As far as we can tell, Owen's old Blue Blazer gimmick is nowhere to be found. Send all your thank you letters now. Another big gripe is the canned nature of aerial maneuvers. If by some chance you're not directly next to the post when your opponent climbs the apron, you might as well wait for them to give up and come down on their own before going towards them -- as moving at them from across the ring affords you no leeway to escape their attack. Or to put it more bluntly, entering within a certain invisible danger zone literally locks you in place; allowing your opponent to land their aerial move unopposed.   There are other strange decisions that take away from a match as well. Your momentum meter, for example, (an imperative facet of surviving and finishing your opponent) is influenced by unexplainable factors. Simply stomping your opponent while he's on the ground raises the momentum bar faster than a series of double power bombs or a toss over the apron to the arena floor would. Additionally, the CPU can stun your character with the simplest of attacks -- a medium punch or a random body slam, while it will take an absolute barrage of offense from your side to do the same to them. And tag team AI is so non-participatory that it's almost as if you don't need partners at all. Where's the fun in that?   Luckily for fans of multiplayer games, Showdown: Legends of Wrestling does manage to redeem itself a bit with its multiplayer capabilities. A lot more fun when facing another human than when facing the limited A.I., it's simple setup and moderate pace allow just about anyone to pick up the controller and play (Hell, the Xbox channel's Douglass C. Perry who never plays wrestling games even managed to figure it out and that's saying something!). Obviously, this is where Showdown will see the most play from owners and it's rightfully so. But even if it is more fun and challenging this way, it doesn't stop any of the other issues we mentioned above. Graphical glitches, teleporting, phantom headshots, and all the other problems will still show up and haunt you.    All the Little Extras  To its credit, Shodown does have a couple more redeemable qualities to it. Its Create-A-Wrestler feature in particular is rather solid. And while it doesn't offer the same customizability as THQ's WWE franchise (the only objects you can change the color of here are a character's hair and skin), it does offer up a nice array of customization options for would-be Frankenstein creators. Whether you want to make a man, a woman, or a 7'6~, 500 lb behemoth, the option to do so is here. You can even edit existing wrestlers by cloning them to create warped doppelganger versions for your own twisted purposes.   Also quite enjoyable is the commentary supplied by Tony Schiavone, Larry Zbyszko, and Bobby ~The Brain~ Heenan (aka, The Man). Though it's not as smooth or as vast in its observations as some of the more recent titles from EA Sports, it's still the best we've seen in a wrestling game so far. There's a good amount of trivia about each and every wrestler in the lineup too, so newbies to the Legends series are bound to learn something. It may be a little rough around the edges, but it's not bad at all.   Musicphiles should also be pleased to learn that the authentic entrance themes to some of their favorite wrestlers have made the cut as well. So while you're not going to hear the WWE-owned ~Real American~ theme song for Hulk Hogan, you will hear Jimmy Snuka's personal theme in addition to Roddy Piper's, Rick Steiner's, and several others. As an added bonus, ring announcer Gary Michael Capetta even announces every wrestler by name -- even your created guys; which is a touch we've been asking for forever in other wrestling series.   In terms of differences between the Xbox and PS2 builds, there's really very little. Both of them support progressive scan for high-definition TVs and both of them have Dolby Pro Logic II for the audio nuts. Of course, the Xbox versions of the game have slightly better filtering effects and moderately faster load times, but the PlayStation 2 edition supports twice as many human players as its Xbox counterpart (that's eight PS2 players to the Xbox's four). The good news is, is that at first we didn't think the Xbox version supported custom soundtracks, but it actually is in there -- buried in an option menu during a match. The hitch is, you can only use it for the match -- not CAL intros.It's too bad that Showdown: Legends of Wrestling didn't learn from its past mistakes (come to think of it, it didn't learn from its past successes either); as it really could have been a much better game than it turned out to be. With a roster as prestigious and storied as this, it's hard to imagine it not being fantastic right out of the gate; especially for an old-school wrestling die-hard like your author here. But when you consider how buggy and backwards the gameplay and feature sets are, it's hard to forgive the game based solely on the merit of its license alone.Because the reality of it all, is that Showdown is a game meant for fans of wrestling and Not for fans of wrestling videogames. Despite what some may think, there is a difference. As fans of wrestling will no doubt enjoy the nostalgia and history of the wrestlers involved with Legends, while fans of wrestling videogames will likely find it too clunky, damaged, and dumb for any long term value. We still can't believe that Acclaim took out all the cool interviews it had with the wrestlers in Legends of Wrestling II for crying out loud; let alone removing the career mode and ability to chain moves together. Just imagine how everyone else who liked those options are going to feel too.We suppose the real question is whether or not this franchise can be saved in time for the fourth iteration which will undoubtedly materialize somewhere down the road. We'd like to remain optimistic and hopeful that it will; but until its creators are willing to spend more time refining the product so that it plays more acceptably, the challenge of catching up with bigger licenses like Smackdown and Fire Pro will forever be in its way. Recommended for loyalist wrestling fans only or for curious weekend rental jockeys. Everyone else should steer clear and wait for the probably superior wrestling games later this season.", "date": "Jun 23, 2004"}