{"name": "Way of the Samurai 2", "name_review": "Way of the Samurai 2", "ref": "https://www.ign.com/articles/2004/07/02/way-of-the-samurai-2-2", "text": "When Bill Murray relived Groundhog Day hundreds of thousands of times on end, we laughed at his plight and the comical way in which he dealt with it and that annoying insurance salesman. It's an interesting prospect: to be stuck in some sort of eternal temporal loop and to find yourself repeating the same set of time over and over and over again until you've experienced absolutely everything there is to experience. But how would that translate into a videogame and what would that game be like if there were all kinds of crazy samurai in it? Golly, look at what we have here!  This is where Way of the Samurai 2 comes in. It's not a typical videogame -- it's Groundhog Day played from the third-person! Somewhat more precisely, Way of the Samurai 2 is an uninteresting 30-page Choose Your Own Adventure book we're asked to reread dozens of times on end.   Any given round through can be one and a half to five hours long, depending on how it's played. The goal is not to beat the game, it's to beat it a thousand times in a thousand different ways to attain 14 endings, see every branch of every conversation, to acquire some 60 useless swords, and to unlock a few sets of totally superfluous clothing and faces for the next time through the loop. Unfortunately, like Groundhog Day and every Choose Your Own Adventure book, it always starts the same.  The first section is a plodding exercise in self-discipline. A small child attempts to help our stumbling samurai selves out of a starvation slump by feeding us rice balls. After eating the rice, a set of choices is presented. Will we ask the child her name, thank her kindly, or ward her off with a swift scold? Be good and the hero will soon find himself presented with another choice: protect the child from some belligerent goons, or leave her at the mercy of the samurai clown posse. Please don't be good anymore. Don't decide to help her. Don't decide to follow her. And, whatever you do, don't decide to teach her how to read and write.   Son of a What?  To be noble, a samurai must endure pain. This game's noble pain is not of the physical variety, but rather of the soul obliterating, mind destroying super boredom variety. Goodness here involves finding an impressive multitude of kidnapped babies who were lovingly discarded on the streets. After this, we'll boringly have to teach the giddy mute girl how to read and write. Yes, that is our heroic objective. Should we have the tolerance to sustain this level of decency and nobility, we'll soon find ourselves completing the game and being presented with an altogether unfulfilling text-driven end sequence. Maybe the next 14 times through will be different?   I've beaten Way of the Samurai 2 about 12 to 14 times now (lost track after my eyes started bleeding). Every single time, I've met boring enemies, experienced some excruciating conversations, and have been painfully directed from one scripted checkpoint to another until the game's culmination that just follows a festival that just happens to almost always end in a just barely satisfying brawl.   This poorly laid out, incredibly linear game set within the confines of a seemingly nonlinear space wouldn't be so terribly tiring if two things happened... 1) It'd be damn nice if Way of the Samurai 2 made some kind of damn sense. 2) It'd be nice if there were a degree (any degree) of challenge associated with combat.   Plot is revealed in small segments. But even after repeated plays, the game never manages to form any kind of cohesive whole. It's just a lot of random stuff. There're some Shogunate spies, an evil gang that used to be good, a disenchanted magistrate's office, a prostitute's mute slave, and some poor townsfolk. But, I never once cared about any of them, and rarely ever unraveled the intricacies behind their stories (if there are any), which makes playing the game over and over (as intended) more tiresome than fun. Of course, there's always the spray of blood.      The biggest combat ~improvement~ over the original Way of the Samurai appears to be the addition of a potentially lethal counterattack. The counterattack is so easy to perform, however, that instantly killing people (even 100 people consecutively) doesn't even remotely come close to a challenge. There are harder characters in the game that take more damage and won't fall after sustaining a direct counterattack, but only the leader of the game's evil faction (the Aoto gang) is of any real threat to the player. One of the biggest draws is to accumulate newer and more powerful weapons. Hey, when I can kill nearly everyone with the default sword while rarely incurring a bit of damage, why should I care about better weapons?  Even if the instant kills were not in place, Way of the Samurai 2 would still be incredibly easy, given that every non-player controlled character suffers from complete and total idiocy. Not only do they neglect to add any diversity to their attack patterns nor do they anticipate actions or even cease performing attacks that consistently do poorly, they'll run into trees and walls, cheaply flee into load zones to prevent their own deaths, attack one another for no apparent reason, hit their own comrades consistently due to poor aim, and just generally convulse until they die by your sword. This motley crew of samurai and thuggery is utterly pathetic.  For as dumb as they are in combat, they make even less sense out of it. Characters within the game are always performing odd tasks, saying profoundly inane things, and leading the player into conversational roadblocks where the only conclusions are accidental. It is sometimes impossible to detect which response in a branching conversation will yield a specific result because the responses are too vague to decipher, so just pick at random -- it doesn't even matter.   Cling-Cling  Of course, if challenge of any kind is not your thing, feel free to venture about slaughtering people and partaking in the very few random challenges that -- aside from picking up babies -- involve fetching truant employees and hitting up locals for cash. Of course, you'll tire of this monotony in about twelve minutes, at which point blood will be spilt. Too bad killing innocents or neglecting to pay for services forbids the player from purchasing goods at stores and using the blacksmith (who can also be killed). Since I'm evil, it'd be nice to strut into a store, take what I want and then leave. Instead, the clerk urges me to depart and I do so automatically. Why in the heck I'm I running from a store owner? What's going to happen if I don't? Is the clerk going to call the magistrate on me? Good! I have to murder 20 magistrates before my evil mission is complete, so call 'em already. It makes no sense and is no fun.  Now that we've set the groundwork for how this particular title is boring, tedious, nonsensical, and still manages to depress and make little sense even after the 14th freaking time through, what good can be said about Way of the Samurai 2? Well, it doesn't look all that bad...even if the animations are a bit suspect, the map sections are incredibly small, and the game does require an unprecedented amount of quick loading and unnecessary menu navigation to get through. It also doesn't sound all that bad...even if it features a bizarre-o combination of some Fifth Element blue-girl opera, a lot of Japanese whistles, some rehashed sound effects, and an assortment of predictably atrocious actors. ~Tee-Hee! Wha?!! Hey, you! Wha?! Tee-Hee! Ah! Wha? Ahhhhaha!~ I hate them so much. I hate these voices all so very, very much. If I were Anakin and they were the Tusken Raiders (those damn dirty sand people) I would not cry after slaughtering them like the animals they are with my trusty light saber. I have beaten this game 12 to 14 times, honest. 12 to 14. Let that sink in. There are few games I am pressed to review that I can and must say this about. Unfortunately, repeated completion of Way of the Samurai 2 wasn't out of love, but rather out of necessity. This is a title with a unique, but completely backward design, you see. It's mediocrity, to be sure. Still, there is some truly strange allure about Way of the Samurai 2. Mysteriously, it's enjoyable for a short period. See if you can collect that most powerful of powerful swords (assuming you don't lose it by forgetting to put it in your sword safe), you know? It's also enjoyable to see just how many people can be killed without ever taking damage. The game does additionally offer some interesting gimmicks, like a lifecycle that ends at a preset time, every time. There's also the way that it manages to deliver the occasional surprise, and the way dying people can be endlessly juggled. So what does this all mean? You've read a string of complaints followed by brief bits of decency. Well, it means rent this one and appreciate that it's not completely broken. Then, return it knowing you needn't waste another day beating it an additional 10 times to get anymore out of it. In fact, the more times you beat it, as we are encouraged to do, the worse it gets. Just rent and leave.", "date": "Jul 2, 2004"}