{"name": "Spider-Man 2", "name_review": "Spider-Man 2 Review", "ref": "https://www.ign.com/articles/2004/07/07/spider-man-2-review-2", "text": "Spider-Man 2 was an amazing movie. My affection for it goes beyond that of my family and friends, moving into the realm of a pure white hot love that only a geek can truly understand. Now take that glorious feeling and reverse it. Turn around at the speed of light and head in the opposite direction straight at the dark red ball of evil. You'll find the Spider-Man 2 video game for the PC waiting there to say hello in a garbled and mutated voice. ~I'm for kids,~ while pointing to the E at the bottom right of its packaging. ~And by 'I'm for kids' I mean I control badly, look like crap, make little sense, have no free roaming like the good version of this game, and have an 'easy-to-use point and click system' also known as the mouse, because kids are stupid and hate good games with fun features.~ If only Activision had planted some sort of similar explanation on the box of this bastardization... no, worse, annihilation of the console Spider-Man 2 game, maybe many gamers would have been able to save themselves from experiencing one of the worst PC games of this year so far.   For those that are a bit confused, let me clarify. Spider-Man 2 for the PC is a totally different game than Spider-Man 2 for the GameCube, PlayStation 2, and Xbox. Do not be fooled by the boxes that, aside from minor differences such as the E rating and slightly different screens on the back, look the same. Get the console version in whatever form you like. Even if you're a child. If you're shopping for a 4 year old, go buy something different altogether. The marketers for this should be ashamed of themselves. We've already received several emails from disgruntled customers complaining that they didn't know the difference. It isn't surprising considering we didn't know there was difference until a few weeks ago when a demo was accidentally released onto the Internet.   Moving away from my revulsion at the business side of the PC version of Spider-Man 2 we can now run head on into my revulsion of the gameplay side. This is one of those titles where you just don't know where to begin cleaning up the slick layer of crap stuck to your skin. Probably because it didn't really seem like developers themselves  knew where to begin. The first cutscene is chopped into a messy confused blob of misdirection straight from about a half-hour to forty-five minutes into the movie. There is no build-up to the action, it just begins with no pretense at story or drama. Just some crappy FMV and a short tutorial. The only good part of this is that Bruce Campbell once again does the voice-over during this tutorial, even if it's nowhere near as thorough as the console versions.   Video Head-to-Head With our Spider-Man 2 Video comparison you will be able to get the best possible idea how the GCN, PS2, and Xbox versions differ. You won't find this anywhere else. Plus, we throw in a look at the PC version, which as far as we're concerned, is easily worth the price of admission on its own.  Get it at IGN Insider now. And check out our other Spidey coverage too!  Links :: Video Head-to-Head | Video Review (Consoles) | Head-to-Head |   From here, you quickly learn the ropes. This is mainly because there are only about four or five ropes you have to learn. This is simplification at it's heaviest and worst. You can swing around the levels by aiming at set markers around each level, waiting for them to turn green, and then clicking the mouse button.      This may be easier for kids to figure out, but I'm not convinced, nor do I really see what's so hard about the console version. These simplifications degrade any of the real freedom of movement that you would find in the console version. Well, that and there's no fully modeled version of New York to swing around... but who really cares about being able to swing around New York saving crime and exploring a huge environment and city? That sounds horrible. What gamer wants to have that much fun? What with the risk of excitement, increased heart rate, and enjoyment... kids hate those things too, I'm told.    In any case, Spidey can also aim at surfaces shoot out a strand and zip over to stick to them or stand on them. This process seems easy, but in practice it can be an effort in frustration trying to figure out which surfaces this will actually work with and why it doesn't work at all sometimes. And when you do zip over, half the time the camera flips this way and that in a dizzying assault on your senses.   The usual round of jumping and double jumping is also included, though there is no power-up for the jump. Spidey can also climb up walls easy enough, though there's a roof on the world so Spidey can be seen frantically scrabbling towards the highest building stuck behind an invisible ceiling.   All of these movement controls together allow some basic acrobatics and you get the bare minimum sense of what it might be like to be Spidey-lite, but the camera, fussy controls, bad collision detection, and inability to climb to the tallest building kill the mood even before you become sad from the realization of the real lack of freedom of movement.   Fighting is also disappointing, probably more so than moving. You can punch. Then punch again. And if you're feeling adventurous, you can jump and then kick. Once you get your meter up, you get all glowy and knock enemies out with one punch. If you're at range from any enemies, you can shoot web at them to pull their weird little ray guns away, tied them up, or shoot little web balls to break certain objects. That's it. No combos. No real challenge. In the 3 hours it took me to finish the game (I admittedly didn't find all of the lame hidden objects and prison escapees) I never got knocked out in a fight. Every enemy drops health and all of them have AI that would probably make a two year old feel brilliant. Even better, holding the hand of every player out there, the game actually shows the solution to each boss fight before the fight begins in an Ikea type instruction page. The only ~dying~ I did was from the crappy controls in the jumping puzzles during the Mysterio missions.   I don't want to spend all of my time comparing this version with the console version, but it's almost unavoidable. There are so many more cool manuevers and possibilities for movement and fighting in the console versions that you can't help but feel completely and utterly ripped off by the PC version.     There's really not much positive to say about the game, so I'll keep it short and simple. The Mysterio levels were the only ~good~ part of the game. It's not like the levels were really that fun or exciting (in fact there were some terribly stupid and inane enemies here), but they did look much cooler than anything else in the game. It's not like everything looks technically terrible (though there is a fair share of that) but there's so little artistic fun or detail that you wonder what comic books these developers grew up reading. Animations are also almost uniformly bad with Spider-Man being the best and Dock Ock being the God-awful worst.I guess Activision and Fizz didn't listen to Spidey's mantra. With great power comes great responsibility. Unfortunately, there will be little culpability to go along with that. Even Tobey Maguire sounds bored and horrified during most of his cutscenes, even though his part was almost positively done before he ever saw the game. Maybe his Spidey-senses were tingling.I could probably say more bad about the game and go into detail about the bad and some of the ~high points~ but what's the point. Spider-Man 2 for the PC is a piece of crap. If you want a real Spider-Man 2 game, go pick up one of the console versions. If you don't own a console then consider yourself out of luck. You won't find any amount of web slinging fun that could come close to matching the fun and frolic of the movie. After three hours (if you can make it that far) of crappy controls, mediocre visuals, and boring and generally unimaginative gameplay, you'll actually be glad to have finished the game so you can return it or burn it and move on with your life.", "date": "Jul 7, 2004"}