{"name": "NYR: N.Y. Race", "name_review": "Fifth Element", "ref": "https://www.ign.com/articles/1998/10/02/fifth-element", "text": "The Fifth Element, the game, is -- yes that's right -- based on the movie that appeared over a year ago to the mixed delight and horror of many movie-goers. Some loved it, some hated it. But all agreed that it packed good action, and therein lies the videogame rub.  With The Fifth Element the game, fans of the movie will get a title that's based on the third-person adventuring style of Tomb Raider, plus the choice of at least two players, one that looks like Leeloo and one that looks only a smidgeon like Bruce Willis.  Unfortunately, The Fifth Element isn't any better than Tomb Raider. Using a set of puzzles in which your character runs back and forth looking in each mission, you must find your way out of the outside or inside of this generally good looking game. In fact, the outside levels are quiet stunning in a several ways, and a few are reminiscent of that infamous, stomach-churning taxi scene.  With a dozen or so levels that increase in difficulty as you progress, the inside levels are packed with annoying little autobots and semi-smart drones that meant to kick your ass. Packed with weapons and different fighting abilities, your characters can punch and kick your way out of the fray or blast your way out. Compared to Tomb Raider, this game is far more action based, really mixing each aspect equally.  The weapon selection is quite good, as are the several combat combos. But some of the control between the two may perplex or annoy gamers more than they want.   The puzzles are a mixture of obvious and really annoying, not so obvious aspects that may sent you to your grave early, or just mildly upset you. Either way, they are not wildly fresh or brilliantly new or complex.   All in all, this adventure/action game does what all of the other games in the genre do, but not in any way better.I can't say that I really felt one way or another about The Fifth Element. I wasn't a giant fan of Tomb Raider, but I slogged through it, and learned a lot about how it could be better. With The Fifth Element, the puzzles struck me as the same old same old. I will admit that the action itself is far more interesting than the first Tomb Raider, but I fear the puzzles suffer a serious dose of mediocrity.I can't recommend this game for a buy. Rent it first, if at all.", "date": "Oct 2, 1998"}