{"name": "MTV Music Generator 3: This is the Remix", "name_review": "MTV Music Generator 3: This is the Remix", "ref": "https://www.ign.com/articles/2004/07/19/mtv-music-generator-3-this-is-the-remix", "text": "With no worthy competitor in the game market and an unusual product that fairs better in Europe than in the US, Codemasters has again taken up the task of re-creating the third unique yet addictive music tool MTV Music Generator 3: This is the Remix. Naturally, this time there is a new set of twists as Codemasters has sought out new developer MixMax to orchestrate Music Generator 3 into an easier-to-use tool that an amateur DJ, musician, or music aficionado might be interested in.    The biggest changes will please followes of the series, as the music reads from right to left, not top to bottom, the sample slate is far heftier than before, and players get a far broader range of studio finishing techniques. The other big improvement in this year's edition is the video tutorial, which supplants the former game's massive text manual that was just a little too cumbersome to be useful for this medium. So, if you're new to the series, will you love this PS2 and Xbox music tool that happens to be on a console? The real question is how serious are you about making music? This $50 music-making gizmo will prepare you in many ways for the real thing for an incredibly low price compared to any similar professional PC product. And once you get in the swing of things, you know, make a few songs, you'll be hooked solid.    Gameplay?  There is no gameplay here whatsoever. This is a music-making tool that enables gamers to sample from hundreds of pre-set sound clips to create original songs. The fun part is making the songs, remixing real songs from popular artists, and going into the studio to finish them.    The previous Music Generator games had a jam session where multiple users could play around with sound sets together and make a racket, but that's been dropped. We'll never miss that feature, which seemed great on paper but was an absolute bore after five minutes. Another missing function is the music video arrangement. Since it was really more about sequencing different screensavers in time to the changes in the music, it was a vestigial tail that this latest phase of evolution has thankfully shed.   Is it too bad that these are gone and people are getting less value for their money? Not one bit. Coinciding with this extra clutter, the previous versions had a lot of features, but the user interface was a rough, requiring too much time for a gamer of any age. The approach before was in trying to mimic a PC program, all the way down to using the left analog stick to control a cursor like a mouse. The learning curve was steep and worth it, but only for the diehard and persistent.    Slanted BeatBox What Is It?  This year's model is constructed with a slightly different idea in mind. It's aimed at the techno junkie and DJ wannabe. The game interface is sleek and streamlined; it's almost so barebones that it can be a little confusing. Players can dig right in, using Studio to create their own songs using the styles of a variety of musicians and DJs, or they can tap into Remix, which enables players to tinker with 10 different songs to mess with from artists such as Sean Paul, Outkast, Snoop Dogg, Carl Cox, and six others. The styles of music represent a variety of beat-based club-style music. There is no rock or funk or punk or anything guitar-based, representing another change in the format. It's really about building solid rhythms, and looping and layering tracks. There's also hip-hop and some dancehall, but there's also the strong club contingent with house, trance, drum 'n bass, and breakbeat.    By jumping into the Remixer mode, users can look at the 10 included songs and do some basic changes such as tweaking the sound levels or the styles of drums, but the real game is in the Studio. Here is where the magic happens. All the songs get 24 different tracks to lay down music and all of the elements of the song are represented by squares or rectangles that sit on the different tracks. These shapes represent a length of audio that's one to four bars long on the timeline. By choosing the different audio clips and placing them down, a song is formed, piece by piece.    By loading up one of the songs in the Studio, users can see the song in a visual way and start to tweak the elements or rip it apart completely. Since each song has hundreds of associated samples that fit in the same key and style, each one is also a launching pad for creating other songs in the same genre. It may look simple to begin with, but the process becomes very powerful and sophisticated with practice. With the previous titles, this has been done before, but the left-to-right format, the huge palette for samples, and lots of little improvements like indicators showing off how much space you have left and speedier transitions from menu to menu make this third game the charm.   That Awesome Interface  The overall look of the user interface here is so clean and easy to read and navigate that getting around is a little dumbfounding. Most importantly, the Studio is also easy to navigate. Samples are broken up into four categories (Drums, Bass, Riffs, and Vocals) and each category has a box on the side of the Studio. Pulling in elements requires only a couple button taps to choose a sample and then a couple more to drop it in. The timeline can be easily navigated and even cut and pasted to repeat multi-track chunks. The whole process ceases to be a process at all and really just an intuitive experience.   This theme spreads into the other areas where users can create their own sounds. Drum loops and melodies can be quickly created, tested, tweaked, and endlessly warped. In the process of making a track, I found myself getting lost in the process of making multiple drum loops and forgot that I was working on a song at all. The melody maker is a little more difficult for those who aren't as familiar with that crazy musical notation stuff, but it's still a breeze to play with.      The most intricate aspect of the audio clip creation is the ripping of samples from CDs. Of all the processes, I found this to be the most problematic at first. On the PS2, there were occasions where the program would rip an eight-second sample incorrectly and put in short silences in the middle. By re-ripping it, I was able to get a clean sample, but it was a curious thing. After that, it takes some finesse to get the samples in correctly to come out clean. The PS2 and Xbox versions differ slightly in the ripping department. The PS2 version enables you to rip music straight from the CD itself. The Xbox version offers you the choice of ripping any music saved on your Xbox hard drive, providing more musical selection and a cleaner, faster process.   This is a place where the nifty new tutorials came in extremely handy. The slick tutorial runs through the whole program and breaks down the major features, but it's the always available help that makes this title rule. For every function, there is categorical help that can be immediately accessed; it darkens half the screen to provide info about every aspect from creating a sample from a song to figuring out what the filters do. If anything, this title deserves a medal for making this whole experience accessible for everyone.   Even after learning the basics and mastering the sampling technique, the timeline still has some cool effects in the Mastering Studio with which to play. Filters, reverb, flangers, and delay can all be thrown in for some more extensive tweaking. It's all thrown in and even these are as fluid as the rest. They'll be more used by the more devoted users, but it's great to see that even these haven't been forgotten about.    It may sound vague, but the overall feeling Music Generator 3 provides is of something welcoming and helpful. It provides so many kick-ass elements that it's hard to really find fault with it. Of course, it's not a game, which should be apparent at this point in the review, so the fun is had in a different way, but if you want to make music, this is the starting line. Aside from many limitations that are really inherent to the consoles themselves, such as unlimited memory, storage, or a larger screen to see more tracks, it almost seems pointless to start picking faults. But hey, that's our job.   Green Channel Menus What's Missing?  There are a few drawbacks. It would be better if the drum loops and melodies could be two bars long or more so that longer builds could be created. It's also curious as to why there's no sequencer for creating bass lines either. Both of these can be sidetracked by creating pairs of one-bar loops or creating melodies with base-like instruments, but these would have been welcome additions. There could also have been more samples and more music and more genres and, well, the more you play, the more you want so let's hope that these guys make a sequel.   Still, it's a shame that there's no online component, but with all the samples I can imagine that that would become a massive legal nightmare within the first day of release. After making a song, the only way to share it with others is to load it up or record it out to another device via the audio cables. It would have been amazing to download remixes or new creations from around the world. Maybe next time.   One small thing: The Studio menu is a little perplexing at first. I originally thought that you could only play the music from the list of 10 artists, since the only thing you see is their name. Initially, I was a little horrified. The menu in this case is so slick that anyone could make the mistake is thinking this. But once you get into the Studio and mess around, the realization dawns on you that the artists represent a musical style, and the vocals of that style are all from the artist you've selected.There may be more powerful tools available for making music on a PC, but these start at around $100 and move on up to at least $300 for a copy of Reason. That's not even including the cost of the PC itself. To be able to pick up Music Generator 3 for a console and have a system that is cleanly designed and easy to make music on is pretty much amazing. Sure, the music styles may favor the more electronic music sounds and if that doesn't appeal to you then this could be a problem, but other than that, it's hard to find much that really went wrong here aside from some small issues. This is recommended for all those creative souls out there.", "date": "Jul 19, 2004"}