{"name": "Crimson Tears", "name_review": "Crimson Tears", "ref": "https://www.ign.com/articles/2004/07/21/crimson-tears", "text": "You have to give Capcom's PlayStation 2 philosophy some credit. Because unlike previous examples, when the company would continually focus on a long stream of sequels rather than original IPs, the Japanese giant has tried its best to create an abundance of unique new games. Titles such as Auto Modellista, Chaos Legion, Glass Rose, and The Gregory Horror Show may not have set new standards in their respective genres, but at least its producers have made the attempt at creating products its fans haven't expected before. That's got to count for something.   In it's latest original experiment, the Dream Factory and Spike-developed Crimson Tears, Capcom hopes to finally cash in on the same cel-shaded success that SEGA achieved with its Jet Set Radio franchise. Applying the rarely used technique to a traditional hack and slash action model, Capcom's distinctive beat 'em up definitely has some merits. Challenging, attractive, and very Japanese, it could certainly find a market with the dedicated US otaku. But while most of Capcom's other little tests have failed because of a lack of replayability and gameplay issues, Crimson Tears manages to hit the mark in at least one of those particular areas -- its replayability. In fact, the game's level of repeating potential is so great that it actually takes away from the overall experience. How can that be? Well to be truthful, that's a bit complicated...   Set in Japan's future in the year 2049, Crimson Tears is essentially about coming to grips with who and what you are, how to ascend beyond your own expectations, and understanding that fine line between good and evil. Now like many of you other typical gamers out there, we didn't think that such an action-heavy project would contain a storyline as multi-layered as this one. And at first, the game does a great job of hiding its message and purpose through a collection of vague but beautiful cutscenes near the beginning. But by the time the chronicle comes to its conclusion, it'll be realized that not only was the plot much deeper than anyone would have given it credit for, but that it was one of the main reasons to keep going.   Kadie, Tokio, and Amber are truly half-naked badasses. To set things into motion, our story begins with the infiltration of the labyrinthine city of Tokyo by a trio of bioengineered weapons. Developed by an organization called A.R.M.A., these three barely-clothed humanoid badasses can do practically anything they want and serve as the player's means of interaction. Known as Amber, Kadie, and Tokio, each one of them has a personal stake in the events that follow throughout their adventure; and believe it or not, provide some of the more believable drama we've seen so far this season. And while the plotline may not be on the same level as higher profile RPGs or fully developed adventures like GTA or Onimusha, the group's struggle to solve the mystery of weird dimensional disturbances has an addicting quality to it. Whether it's the half-naked nature of its characters, the shrouded motives by the game's bad guys, or the unbelievable quality of the cutscenes that make it this way we don't know -- but regardless of the reason, it works.   The gameplay itself offers some pretty interesting little elements as well. Structured similarly to High Voltage Software's Hunter: The Reckoning Wayward, Crimson Tears has a loose, almost RPG-like structure that allows players to build and enhance their team of bioengineered Mutanoids. But rather than give each of its heroes their own set a dozen or so attributes, the game keep everything simple and straightforward. So while players continue to gain experience and rise up in levels, they'll only have to worry about three specific elements: their health, their power, and their defense.    Of course, there are a number of other appreciated customization options too. So the more that players continue to find advancement items scattered throughout the underground dungeons, for instance, the more they'll be able to increase their repertoire of combat moves. But not only will they increase their amount of options available for combo maneuvers, they can also upgrade and enhance their special attacks. Gamers will even be able to donate money to the local mayor to upgrade the various merchant shops located throughout Tokyo. Paying a visit to each of these shops as they continue to grow yields newer, more powerful weapons, and players will even have the opportunity to create new ones out of existing pieces of their inventory.   Whatever type of customization approach players may take, they'll still need to contend with Crimson Tear's slightly stiff gameplay mechanics. When using guns or performing particularly long combos, for example, characters will frequently pause at the end of their animation and stay vulnerable for attack. On a similar note, shooting guns in general can prove to be quite a hefty task when surrounded by multiple enemies -- as targeting all your foes at once is labored by the taut nature of the aiming. Sissified gamers may also find themselves frustrated by the challenging nature of Crimson Tears in general. As even on the easiest of settings, it's relentless wave of enemies can test your mettle in more ways than one.   Even so, there's a lot of satisfying combat to be found throughout the game's multiple stages. Players who enjoyed fighting their way through the aforementioned Hunter: The Reckoning or Spawn: Armageddon should find the battle system infinitely better than in those titles with as many as 100-plus moves per character. Lending itself well to personal tastes, Crimson Tears also provides gamers with three uniquely different characters with their own specific uses. Amber the Twin Blade Samurai is without a doubt the most useful character (with affinities towards knives, blades, and swords), while Kadie the Mechanical Eradicator uses her martial arts knowledge and various claw weapons to keep things up close and personal. Gun users who don't mind the game's stiff aiming, however, would do best to turn their attention towards distance expert Tokio; as his ability to use multiple firearms keeps him deadly at a distance.   Capcom combat rule #1: Thongs equal unstoppable. Unfortunately Crimson Tears runs into several snags that keep it from truly realizing its full potential. The most immediate of which is its repetitive nature. Remember earlier on when we said that the game offered too much replay for its own good? Well we meant it. As players will literally have to repeat each and every stage a minimum of three or four times just to advance to the next level. When stacked on top of each other stage after stage, you're looking at 30-plus trips to the underground; and with each trip taking about half an hour to an hour to complete, that's a lot of time eaten up before you can reach the end.   Perhaps that wouldn't be such a big deal if it weren't for the reasons that you have to repeat stages in the first place. Which is primarily because of the brittle nature of your weapons. These suckers break -- and they break a lot. Using them too much against the wrong opponent can result in a quick and decisive loss of your arsenal; while fighting hand to hand with everyone but Kadie not only proves tedious but way too hard in comparison. The only way to get your weapons working again is to travel back to the surface and visit a shop to get your damaged weapons repaired, or you could always try it the smart way and bring extra weapon along with you.    But therein lies another problem -- your inventory. Your maximum allotment for items at one time is a mere 24; a number you'll probably reach before leaving the first level of a dungeon. Because of this, you'll have to travel back to the surface once again and drop off your extra goodies in your warehouse or sell them to a merchant before you can travel back and repeat the process again. Eventually you'll make it far enough into the labyrinth to battle against the cool and difficult bosses, but the trips you've taken beforehand will likely exhaust you by the time you get there.   Part of what makes the journey worthwhile, though, is the excellent level of presentation. As mentioned earlier, the storyline in Crimson Tears is definitely above average. But other than that, another aspect that really adds a lot is the unbelievable level of graphical quality. While lacking in animation, the models, backgrounds, and cel-shaded cutscenes are all absolutely phenomenal. Not to mention the fact that the game is highly stylized and drenched with a moody, futuristic personality too. Giving us a much stronger reaction to its approach than what we had in other titles like XIII or Capcom's own Auto Modellista .    Acoustically, the presentation isn't quite as strong. Granted, the voice acting is acceptable and the music is moderately effective, but the metallic sound effects and Dolby Pro Logic II encoding isn't quite enough to get us hopping towards those volume buttons. But at least there isn't a specifically bad element to it, so that's good.Despite its shortcomings, Crimson Tears remains an addictive and entertaining diversion from your typical action title. While obviously not for everyone (recommended for immediate satisfaction junkies this is not), it still has a unique enough feel and deep enough combat engine to grab players with a forgiving nature and lots of time on their hands.Even so, we'd still like to see Capcom give Crimson Tears another try somewhere down the road. With a better approach to dungeon crawling, less fetch questing, and a better inventory system, the sequel could definitely blow some doors off. The base ingredients are here, after all, but with a little more time and a dash of that Capcom magic, it could be even better.", "date": "Jul 21, 2004"}