{"name": "FlipIt!", "name_review": "FlipIt!", "ref": "https://www.ign.com/articles/2004/07/23/flipit", "text": "Handset games are becoming increasingly more complex as the market matures. What began with the deliriously addictive Snake has bowed to games like Gameloft's Rainbow Six series. G3 Studios, which recently released the 8-bit-style platformer, Cleopatra, has returned to the scene with Flip It! This simple puzzler reminds of the early days of cellphone gaming, when all it took was an addictive concept to hook the gamer.   And trust us, we are hooked.   Features:   50 puzzles  Auto-save  Replay any completed puzzle   Flip It! takes place on a very Go-like board, where you must reverse black and white tiles to mach patterns laid out by the computer. Only after completing a pattern are you rewarded on how quickly you mastered the puzzle, and shuffled on to the next brainbuster. The first few levels are an absolute cakewalk -- a genius trick to lure you into the game's maw. Later levels are borderline evil. Evil, we tell you!   Here's how it's played: You control a cursor that rolls over the board. When you press the action button, all of the adjacent tiles flip over to reveal the opposite color. To solve puzzles, you will need to often flip tiles over repeatedly until you have managed to manipulate the board to match the required pattern. This is most maddening. But fun.   The game employs only the visuals it needs. A simple, clean game board makes play easy. Very readable text helps out with instructions and between-round information. The game has a pleasant soundtrack, too, so you're not flipping tiles in dead silence. (Although, there would never be dead silence while playing Flip It! You will fill the airwaves with cursing. Believe it.   Flip It! is a simple, effective puzzle game that will appeal to fans of Bejeweled and other popular handset brainteasers. The 50 puzzles will keep you entertained for some time, and if you're really into games like this, you may find yourself replaying specific puzzles to beat your previous time or solve it in fewer flips. G3 Studios has a great game here, reminding us that it takes far more than pretty pictures to make a great game.", "date": "Jul 23, 2004"}