{"name": "Mr. Nutz", "name_review": "Mr. Nutz", "ref": "https://www.ign.com/articles/1999/12/04/mr-nutz", "text": "Let's face it  the Game Boy Color doesn't have much ~oomph~ when it comes to system power. Which is why you see so many side-scrolling action games on the handheld  it's where the system excels. Unfortunately, as you can easily see on the retail shelves, there seems to be way too many of them, and a good majority aren't exactly of the quality fare. Mr. Nutz from Infogrames may seem like a generic action platformer on the surface, but it's actually a pretty slick addition to the genre. Features Six Worlds Multiple hidden levels Only for Game Boy Color  I have to be honest  Mr. Nutz really doesn't add much to the whole side-scrolling platform genre, and in fact the game is pretty stereotypical in design. Your character is a cute little furry creature, you attack enemies by hopping on their heads, you collect coins for extra lives  all the traditional elements are here. But what makes Mr. Nutz a decent game is simple: the controls are tight, the levels are full of variety, and it looks like a lot of time was spent polishing the game design. It wasn't rushed, it wasn't made to capitalize on an existing, out-of-place license. It's just a simple, fun-to-play game.  The game is based on an existing Mr. Nutz game that was released on the Game Boy system years ago. The Game Boy Color version is simply a vibrant, colorful rendition of the game that was released on the black-and-white systems. It was a decent game then, and it's a decent game now. There's really not much to report on how Mr. Nutz advances the sidescrolling platform genre, because it doesn't. It's just a Game Boy Color game that does the genre right. Don't let the somewhat-unrecognizable character (meaning lack of license) scare you away from this title. Mr Nutz isn't absolutely phenomenal, but it's a solid game that's definitely worth a look. There's really not much to report on how Mr. Nutz advances the sidescrolling platform genre, because it doesn't. It's just a Game Boy Color game that does the genre right. Don't let the somewhat-unrecognizable character (meaning lack of license) scare you away from this title. Mr Nutz isn't absolutely phenomenal, but it's a solid game that's definitely worth a look.", "date": "Dec 4, 1999"}