{"name": "Hamtaro: Ham-Ham Games", "name_review": "Hamtaro: Ham-Ham Games", "ref": "https://www.ign.com/articles/2004/07/27/hamtaro-ham-ham-games", "text": "Okay, I admit it. I'm nearly 32 years old, and I have a hard time hating Nintendo's Hamtaro series. At least in videogame form, that is. Don't get me wrong, I can't stand the anime series when it pops up on Cartoon Network; its syrupy-sweet storylines and dialogue is enough to send anyone -- even its target audience -- into a diabetic coma. But for some reason, there's something engrossing about these little furballs in gaming form, like some devious subliminal effect tapping the pleasure center of the brain. The latest addition to the Hamtaro series, Hamtaro: Ham-Ham Games is the third handheld game starring the family of hamsters, and once again, the development team manages to push through the forcefully saccharine nature of the characters and offer up a surprisingly fun set of Track & Field and sports challenges that fit the handheld market way more than you might realize. Features 15 different mini-game challenges Unlockable Free-play mode Cartridge save (one player slot) Link cable support Wireless Adapter support   Apparently Nintendo thought that three sickeningly cute adventure games might've been a bit too much for the Game Boy audience. After the original Hamtaro: Ham-Hams Unite on the Game Boy Color and its Hamtaro: Ham-Ham Heartbreak follow-up on the Game Boy Advance, it was clearly time to take these hamsters into something a bit more challenging and faster-paced than a 20 hour adventure through the hamster world. So, the previously announced Hamtaro: Rainbow Rescue has taken a vacation in favor of a significant departure in game design. Enter Hamtaro: Ham-Ham Games, a series of decathlon and sports games strung out in a ~tournament~ presentation that mirrors the same style of game as the previous two adventures. There are fifteen different challenges that take place in seven days of game time, and the team that wins the most gold medals during the tournament session ends up with the championship banner.   Anyone who dug Mario & Luigi: Superstar Saga should take note: Hamtaro: Ham-Ham Games was designed and developed by the same team. And the Alphadream influence is clear when you see game in motion, with Hamtaro featuring the same skillful simplistic pixelart-based style that definitely benefits the GBA's graphical capabilities. Though the game does look a heck of a lot like Hamtaro: Ham-Ham Heartbreak, it's pretty obvious that it's not a recycled engine -- Hamtaro and crew are drawn and animated as much larger sprites this time around, and...oh yeah, the sport challenges themselves are totally unique to the franchise.  I'm a Track & Field nut, so it's pretty apparent why I appreciate the direction the development team went with the latest Hamtaro game. But even I can see that the handheld market isn't suited for the rapid-fire button gameplay; it's impossible to hold the system and tap those buttons as fast as possible, and still be able to see the screen clearly through the violent hand shaking. Which is why it's a good thing that not a single one of the fifteen games in Hamtaro: Ham-Ham Games is based around button-mashing speed. Oh, sure, quick buttonmashing's a skill, too...but on handheld systems, it just doesn't work, and these challenges aren't missed -- leave the rapidfire gameplay on the console and in the arcade.  All of the decathlon and Track & Field inspired games in Hamtaro: Ham-Ham Games are actually timing based, and in most cases, the control creations for these events are very clever and successful challenges. In the 100 HM dash, for example, players must time the button press to a quickly moving powerbar, hitting the command at the right point on the indicator. Successfully hit the mark and the character's speed will increase, but so will the speed of the timing bar...so to keep the speed up, a quicker reaction time is required. The diving portion is a tough button-recognition challenge where players have to hit the button sequence as the character jumps into the pool. And, probably the most clever timing design is the Marathon, where players must play a rhythm game where the measure's beat changes at each relay point. And the music gets faster as the player does better, making it tougher to time the button presses to the tune's beat.  There are also a couple of impressive sports games, including Tennis and Volleyball, that are much better designed than you may expect a mini-game compilation to have. Tennis, for example, despite having hamsters in the athlete's roles, is quite possibly better than the original Tennis game on the black and white Game Boy. And Volleyball features nearly the same amount of control as the classic Super Spike V'Ball on the NES system. Not bad for hamster sports.  As cool as most of the challenges are in the compilation pack, there are a couple of design duds in Hamtaro Ham-Ham Sports. Sailing, for example, is a mess, requiring players to cruise on choppily animating Mode 7 waters as the wind mysteriously changes during the race. And the Chicken Race, a take on reallife Equestrian horse jumping, just isn't a whole lot of fun due to its clunky control.  Though skilled players can romp through the tournament mode in a couple of hours, the ~adventure~ design keeps the game going well after the first tournament ends. There are at least three different tournament flags to score, which means players will have to go through the multi-day structure three times to win it all. And it wouldn't be a Hamtaro game with out silly little collectibles, including costumes players can discover and purchase, and assign to their own personal ~player card~ that can be transmitted, either via link cable or Wireless Adapter, to other players of Hamtaro: Ham-Ham Games.  But even with the heavy emphasis on the link aspect, they completely missed the boat: Ham-Ham Games features connectivity between two GBA systems, sure, but there's no multiplayer support in any of the challenges. Most of these challenges are simultaneously team competitive, and they would have seriously benefited from multiplayer options. Simple data transfer between games just doesn't cut it. Roll your eyes all you want...Hamtaro Ham-Ham Games is a fun little package. Buying this game is about as damaging to your masculinity as holding your girlfriend's purse, but don't think for a second that it's a bad thing to actually have it in your collection. Despite its cutesy appearance, Ham-Ham Games is a clever evolution of the Track & Field design that fits the handheld market better than the rapid-fire buttonmasher ever could. The missing multiplayer aspect is more than a little disappointing, especially when seeing that it does support link up for other reasons. But it's the only severe blemish against yet another solid and satisfying game design featuring those sickeningly adorable furballs.", "date": "Jul 27, 2004"}