{"name": "Digital Hitz Factory", "name_review": "Funkmaster Flex's Digital Hitz Factory", "ref": "https://www.ign.com/articles/2004/07/29/funkmaster-flexs-digital-hitz-factory", "text": "As the consoles and PCs keep doing the convergence mambo thing, the consumers are getting more products that blur the lines. The MTV Music Generator games that were put out by Codemasters on the PSone and the PS2 created products that weren't games at all but were music tools that allowed gamers to make their own tracks. We've recently seen the release of the elegantly designed MTV Music Generator 3: This is the Remix and now there's Funkmaster Flex's Digital Hitz Factory. While it manages to provide a deeper experience, this factory still takes a backseat to the generator's smooth user interface and relegates itself more to the sidelines.   Let's just back up a bit before we get really started with this review, though. Development team Jester Interactive was the force behind the first two MTV Music Generator titles for Codemasters. Apparently, Codemasters wanted a different approach and went with developer MixMax for This is the Remix. Jester Interactive still went and made a third product which was called Music 3000 in Europe. Upon coming to the States, XS Games picked up the title and renamed it Digital Hitz Factory. In a way, this makes this title the unofficial, but spiritual, successor to the first two MTV Music Generator titles.   While Digital Hitz Factory manages to create a PC-style music program like the ones before it, this brings up some good and bad points. The good side is that it provides plenty of room for dedicated users to dig around in and find new uses for it. The downside is that the user interface is that of a PC program that begs for a USB mouse. The text is tiny and all of the features are represented by cryptic icons scattered acrtoss the screen. A large part of the navigation involves moving a cursor around the screen to select musical elements and place them in the timeline.    Thankfully, there is now an option to choose whether the timeline goes top to bottom or left to right. While MTV Music Generator 2 switched to the top to bottom format and the default here sticks to it, having the option is a welcome sight. There are also some different skins, but this time they make more sense and fit with the action than the tacky choices from before. Say goodbye to sequencing tunes on a vintage radio.   The problem with the rest of the setup is that it blatantly ignores the strength of the PS2 controller and instead forces mouse control schemes on the situation. Instead of hopping from track to track with quick, controlled movements, this setup provides plenty of hunt-and-search sessions where getting the pointer in the right area can be a task in and of itself. It's also an issue that some of the buttons can only be selected when the pointer is right in the middle of it. Get the pointer on the side of an icon and sometimes nothing will happen.    While it's possible to remap the controller in order to make things work a little better, there are still a couple of things that show off just how messed up things can get. The default action button is the R3 button which makes sense most of the time, but can cause other problems. Creating a riff involves opening up a screen that shows off a timeline with each column representing a different note. Creating a one note sound requires tapping the R3 once, but creating a longer sound involves hitting the R3 button, moving along the timeline with it held, and then releasing it. This might work logically with the control scheme, but it makes the whole process much more difficult than it needs to be.   So instead of mapping the screen with controls that can be quickly selected with the d-pad moving around them, this mouse-style control just causes a lot of hassle. It doesn't help that there's very little to help beginners figure out what the hell is going on. The manual is completely useless and devotes all of one paragraph to the making of a song. The rest of the help is provided by the tutorials that only cover the basics of music and video features, which I'll get to in a minute.      There are lots of little features here that tweak the music in several different ways, but the in-game help basically tells you to ~go and discover it for yourself.~ Well thanks a frickin' ton for that. In other words, unless you're a hardcore music geek, go and take a long walk off and berate yourself for your own inadequacies.   There are two vestigial tails here and they're the video segments and the live music remixing. Gamers can make their own videos to go along with the music and there's a timeline for that as well, but since most of the visual options are little more than screensavers, this is barely more than a bullet point. The same goes for the live music playing which is more messy than fun. Players can tweak six different tracks of music and drop in effects, but this quickly grows old. The music program is really where it's at.   The basic music editor here is as strong as ever with 64 tracks for the music and some 16,000 samples in half a dozen genres to play with. If the daunting interface doesn't bother you then this will be your playground with plenty of options for creating some new tunes. The only problem is that by providing such disparate genres as metal, rap, indie, and such is that the program becomes all-inclusive and loses any strength in specializing.    While it's nice to see that indie rockers can organize the strums into new patterns, why would Funkmaster Flex be chosen as the cover boy if when his music is one sixth of the total? Next time around the designers should focus on one genre and blow it out. Call it Music Generator and Ya Don't Stop and focus on hip-hop and really make the program more powerful and appealing.   With the USB interface it's possible to sample music from an outside source or even sample yourself for a little personal flavor. Be warned, though, because this does not mean that you'll be able to sing an entire song and put it in. Everything needs to be stored on a memory card which limits gamers to just a few bars of personalized vocals.   The truly cool new innovation here is the Voice 2 Music option. Players can hum, whistle or sing into the USB microphone and the program will be able to convert a sample of this into musical notes. Instead of manually entering in every note, this can take care of an entire melody in one go. Well, one go if you're extraordinarily talented that is. Getting the right melody through the mic will require some talent, but by being able to edit the notes players will be able to clean up the sound and shift it about. So even if you don't know a whole lot about creating a melody, this is an invaluable tool.    By unlocking the music-making process to those who don't know about flats and sharps and such, the Voice 2 Music breaks new ground. If the rest of the program had been able to keep up in terms of providing a user-friendly interface, this could have been a title for the ages. As it is, it's an interesting update on a program that is increasingly showing its age.For those who understand all too much about the process of timelines and multiple tracks and filters and such, then Digital Hitz Factory is an excellent cheap option for some new software. In fact, the Voice 2 Music feature is enough to merit that purchase by itself. As for those other folks who want to have a smooth entry point into music sequencing, this is not the place for you. The interface still pretends to be running on a PC monitor, complete with tiny text, and will make for an aggravating situation.", "date": "Jul 29, 2004"}