{"name": "Tomb Raider: The Last Revelation", "name_review": "Tomb Raider: The Last Revelation", "ref": "https://www.ign.com/articles/1999/12/04/tomb-raider-the-last-revelation-3", "text": "At the time of its release the original Tomb Raider was considered a revolutionary title by many because it featured a lead female character, a third-person perspective, innovative 3D graphics, and level design to die for. With Tomb Raider II and III, very minute enhancements were made to the game's graphics and the only slight alterations were made to the game's design. In crafting Tomb Raider: The Last Revelation, the developers looked to meld what they've done right in the previous games and create the finest of the series.   Lara's latest adventure actually begins before the previous Tomb Raider games started, as the player will start off the game with a 16-year-old Lara Croft. In the first part of the game, the player will take young Lara through a tutorial section led by her mentor Werner Von Croy. Unlike the practice sessions in the previous games led by her butler, in The Last Revelation the tutorial sessions is required and is essential in setting up the game's plot.   The plot is, in fact, the best we've yet seen in the Tomb Raider series. In all of the previous games, we were given very little on Lara's background and the game's plot was always inconsequential in the whole scheme of things. The games did have stories and plot lines, but they just weren't developed too well and weren't that important to the game. And that's putting it nicely.  The Last Revelation gives the player a little more background on Lara and the basic plot is much more interesting. It's basically the same Indiana Jones-esque storyline as we're used to, but it develops much better than in the previous incarnations. On the other hand, it still isn't developed well enough and the story in the game pales in comparison to other titles, such as Resident Evil, Soul Reaver: Legacy of Kain, etc.  Gameplay Last Revelation is more of the same, mixed with some new alterations worth noting. The menu system is the best that it's ever been. It is much easier to navigate through and provides the player with new abilities, the most significant of which is the ability to combine items. The player will need to combine items to solve puzzles and also will be able to put a laser site on some weapons, such as the crossbow and the revolver. For instance, with the Laser Site combined with the Revolver, Lara can zoom in on enemies and target specific body parts. This is somewhat useless on many enemies, but it does kill some of them quicker and enables the player to get rid of a few creatures that seemed invulnerable. This may seem relatively insignificant for any other game, but in Last Revelation, it adds a lot to the game's depth.   Other new play mechanics offered in The Last Revelation include the ability to swing on ropes and vines, move around corners when hanging from a ledge, and the ability to climb and crawl into areas above ledges otherwise too small to walk onto. Lara can climb on a lot more surfaces than ever before, such as vines, cobbled walls, and grass-covered walls. For better or for worse, Lara's basic control is exactly the same as it has always been. So, if you have issues with the controls, you will have issues with them here. Pressing the control pad forward will make her run, pressing to the left or right will make her rotate in the direction, and pressing down on the pad will make her hop backward. Lara can also walk, sprint, crawl, jump sideways, flip around, hang from ledges, swim, and climb walls.   The control problems that plagued the previous Tomb Raider games are still present in The Last Revelation. For instance, Lara still rotates around much too slowly and the problem of her not jumping exactly when you press the jump button is still exactly the same. Furthermore, the camera problems are still abundant and will cause plenty of frustrating situations for the player throughout the game. Players will find themselves running into walls and falling off ledges to their doom many times in the game as a result of the problematic camera work.   One of the most significant changes to the game is the addition of new puzzles that stray from the normal ones found in previous Tomb Raider games. There's still heaps of puzzles that simply require you to explore a huge area in search of a switch, lever, or item to set off a switch, but there are a lot of new and ingenious puzzles that add a great deal to the overall challenge and appeal of the game.   The game is still all about adventure and exploration. Core Design has taken the exploration aspect to a new level in The Last Revelation. For the first time, players will be required to backtrack from advanced levels to previous levels to solve puzzles. This is somewhat frustrating to do at times, but it does create a feeling that you're in a huge interconnected world. While the backtracking isn't always enjoyable, the sensation of exploring a new and fascinating world is undeniably fun. The creatures are few and far between, so those looking for a lot of shoot-'em-up action won't find it here, but that's not what the Tomb Raider games have ever been about. It's all about the exploration and that aspect has been done better than ever in The Last Revelation.   The areas vary in size from small to huge. Just beating Tomb Raider: The Last Revelation will take upward of 30 hours and fully exploring every crack and crevice, finding all of the game's secrets, will likely take many weeks to accomplish. The game is as challenging as it has ever been with the addition of the new puzzles and the game's level designs are inspired and imaginable.  However, some of the areas are unbelievably arduous and seem like they would be impossible to figure out without the use of a strategy guide. It's the very essense of Tomb Raider, deep and involving, but frustrating as all hell. In that sense, Last Revelation hasn't changed one bit.  Graphics Aside from everyone's initial fascination with Lara Croft herself, the graphics in the original Tomb Raider was one of the primary reasons that people seemed to flock to the game. At the time, it was one of the most technically impressive videogames on the market and that fact was appreciated by the masses. Tomb Raider II and III each only featured minor aesthetic improvements over its predecessor and were often considered to be lagging behind the competition in terms of technical achievement.   As with the case with II and III, The Last Revelation does not offer any vast improvements over its predecessors. It is undeniably the finest looking game in the entire Tomb Raider series, but the improvements are not at all groundbreaking in 1999, and are pretty minuscule on the whole, compared to say Final Fantasy VIII, Soul Reaver, or Metal Gear Solid.   Lara's appearance is the best that it's ever been. Her face and skin are both completely smooth and don't feature any of the jagged edges that hindered her previous incarnations, thanks to newly implemented texture skins. She doesn't have as many different outfits as in some of the previous games, but the player will get a chance to check out a younger and less voluptuous Croft at the start of the game. She only has a few new character animations and still performs many tasks rather awkwardly (like how she climbs ladders with her legs spread so wide apart), but I guess that's the sama Lara that many have come to know and love.   The background models are also the best ever in the series, as they are comprised of better textures and more rounded objects. Most of the backgrounds in previous Tomb Raiders consisted of background objects and structures that had sharp corners and were very blocky in appearance. The Last Revelation still has a great deal of blocky background objects (Lara needs to have something to grab on to), but it features more rounded background models than previously seen in this series. Overall, the backgrounds just appear a little more detailed and realistic than ever in the past.   While the characters and backgrounds do look better than ever before, the game's graphics do have faults. The game appears pretty grainy on the whole and there are a lot of clipping problems that pop-up throughout. And while some of the textures are very detailed and look fantastic, many of them have an awkward appearance. The game is also very dark, much darker than in any of Lara's previous adventures. It does help create a sense of really being in tombs and catacombs, but it lessens the graphic appeal of the game. It also creates an ominously frustrating time when you're looking for a little tiny key that can't be differentiated from the floor textures. Ughhhh! Sound The sound always has been a strong point in the Tomb Raider games and The Last Revelation lives up to its forerunners. There's not a lot of music, but when it does appear it's always at key points in the game and it always fits the situation perfectly. When something important is happening, the music lets you know it. In that same way, it feels a little canned and old-school. You'll know when some kind of action happened, which is good but you'll also know that an enemy is about to attack.   The background sounds also do a great job of immersing you into Lara's universe. The footsteps, sounds of the monsters, and other ambient noises are all done well. By and large, the voice acting in the game is pretty good. Some of the characters have horrible accents, but the lines are acted out well.  Tomb Raider has received plenty of negative attention because of the hype that the game has been given over the years. In fact, it's kind of en vogue to knock the game. A lot of the negativity toward the game is deserved because it's obvious that Eidos has been milking the license by putting out the game every year without making major improvements. It could be said that the same thing has been done this year with Tomb Raider: The Last Revelation because there's not really that much new here. Lara can do plenty of new things that add to the gameplay and the new puzzles add a great deal to the game, but there's nothing revolutionary. Nevertheless, I really enjoyed playing the game. The game's slow pace seemed to bother onlookers (people passing by my desk at the office and my roommates watching me play at home), but it didn't bother me at all. On the one hand, I was frustrated by having to backtrack to previous levels to solve puzzles, but on the other, I loved exploring the immense 3D environments. These days it seems like it's not cool to like Tomb Raider, but I have to admit that I thoroughly enjoyed playing through Tomb Raider: The Last Revelation and it has nothing to do with some kind of sick fascination with Lara or her voluptuous figure. If you hate Tomb Raider or are really bored with the series, this doesn't offer anything that will break new ground and make you change your mind. But, if you do enjoy the Tomb Raider games, this is the best one yet and is a must have game for Tomb Raider fans.", "date": "Dec 4, 1999"}