{"name": "Dragon Seeds", "name_review": "Dragon Seeds", "ref": "https://www.ign.com/articles/1998/10/07/dragon-seeds", "text": "If you've ever delved into Tecmo's Monster Rancher, you've got a good idea of what to expect in Jaleco's Dragonseeds. It's very similar to the recent Virtual Pet craze -- you raise, train, and battle your dragon until it dies.  Basically, there's a new sport in town, and you get in on the ground floor by creating a dragon. First, you select from six different types of creatures (winged, saurian, crustacean, wasp, beetle, Natura), and then assign it a random string of text that will determine the creature's specific attributes. Then, send it out for a little training to build up its strength and power, and enter a few tournaments to win money to buy new weapons and pay for more training.  Battles are of the simplistic, rock-paper-scissors breed. At the beginning of each turn, you choose two moves from a library of six -- advance, retreat, block, slash, special, and taunt. Retreating avoids your being slashed, blocking avoids being hit by a Special move, and your creature can only slash if he's on the inside of the three-ring battle arena.  There's one catch, though -- if your creature dies at any time during a fight, that's it. Game over. Start from square one.   One of the more interesting features of Dragonseeds is its instant-action battles between two players. It will build creatures based on data on any PlayStation memory card. Want to see how your Tekken 3 files stack up against your Crash 2 save games? Plug 'em in, let the game build the creature, and duke 'em out.I'll admit that I have a soft spot for virtual pets  I own a Tamagotchi, a Giga Pet, and a Godzilla VMS, and I wouldn't mind having that cute Pocket Pikachu that Doug used to carry around with him. Sure these things are simplistic, but what the heck? I'm curious on how I fare taking care of these things.Dragonseeds is very similar to these virtual pets. You need keep it fit and strong, otherwise it dies and goes away. Don't expect a Tekken-style fighter here, folks -- the battles are simple, yet obviously more complex than the look-left-look-right games of those handhelds. And the animations of the dragons as they fight it out are sweet.The only problem I have with the game is its lousy AI when fighting against the computer. All you need to do is block at the beginning of each round until the opponent wastes all his special attacks, then go in for the kill. That's it. You can rack up a strong character pretty easily this way, and that kills the replay value a bit.But as it stands, it's not a bad little game. Just don't expect much more than a virtual pet, and you'll have a bit of fun with it.", "date": "Oct 7, 1998"}