{"name": "NFL Blitz", "name_review": "NFL Blitz", "ref": "https://www.ign.com/articles/1998/10/07/nfl-blitz", "text": "NFL Blitz may be many things, but it's not football, at least not football as we've known it on the PC.   The first time I saw Blitz in the arcades, the football purist in me recoiled in horror. Seven players on a field? Thirty yards to make a first down? This ain't football, this is Arena-ball. But it wasn't long before I was completely drawn in.  So think of Blitz as the highlight reel of football games--it's nothing but big plays, huge hits, lots of action, no penalties and you're always near the two minute warning. But be warned--it's such a great game and so much fun that it can actually destroy your enjoyment of all other football games, making them look sloth-like and convoluted in comparison. Worse still, I was recently playing Blitz for about an hour, and then walked over and looked at a real NFL game on TV. Even the players on TV looked sluggish, sloppy, and unenthusiastic. The half a minute fiddling around with huddles and lining up between plays seemed like an interminable wait. It was a weird experience.  At any rate, the game's controls are relatively straightforward, and pretty much have to be played on a gamepad. Different buttons let you hike, pass, jump, spin or leap over the line of scrimmage.  Multiplayer is a two player head-to-head game played on a single PC, and it really is the best way to Blitz, since the computer opponent obviously is a lot more predictable. There's no network option in the retail release, but Midway promises a patch for this later. The problem with head-to-head is that sometimes it's a little too easy to see exactly what the other player intends to do. There is a method that lets you hide your play selection from your opponent, by making the selection box invisible, but since it makes the play selction indicator invisible it's sometimes a little too easy to accidentally call the wrong play.  Speaking of play calling, that aspect is pretty limited--eighteen plays for the offense (though they can be flipped) and only nine for the defense. But with a little creativity (moving players around before the snap), you can vary the plays enough to work in a surprising amount of strategy.  Blitz is primarily a passing game--there are virtually no running plays, although having the quarterback break to the weak side and run around the end while your three receivers are lined up on the other side is usually a pretty good money play against the AI. Passing involves hiking the ball, going into passing mode, and then choosing one of the three receivers with the directional pad; again, this can cause some problems because you'll often throw the ball in the wrong direction until you get enough practice.  For those of you who know Blitz from the arcades, rest assured that the PC edition is nearly a picture perfect port. Some of the audio has been toned down (for example, I've never heard the announcer yell, ~What the (bleep) (bleep) was that!~) and a few animations seem to have been added (there's one kindly one of a player helping an opponent up), but otherwise, it pretty much is the arcade game, right on your PC.  In fact, Blitz is almost too perfect a port, as a lot of annoying baggage from the arcade and console versions is left in. For example, you have to click through a bunch of useless screens every time you want to play a new game, the game can barely remember anything, and to turn on options like fogging, night games, or even ~Smart AI~ you have to enter stupid cheat codes with a gamepad--rank kids stuff, and a failure to capitalize on the PC's strengths.  On the other hand, the graphics are stellar, especially under GLide (it can also run under Direct3D), blowing away the same game on the consoles, and running faster too.  -- Jason Bates", "date": "Oct 7, 1998"}