{"name": "Rainbow Six 3: Black Arrow", "name_review": "Rainbow Six 3: Black Arrow", "ref": "https://www.ign.com/articles/2004/08/06/rainbow-six-3-black-arrow", "text": "When Ubisoft's Rainbow Six 3 shipped a year ago, no one knew it would become the most popular game on Xbox Live. Sure, we could all tell it was a good game with great potential, but no one expected that ten months later RS3 would remain the first choice for online play among the IGN editors. We have been obsessed with Rainbow Six 3 and now we are about to gain a new obsession. Rainbow Six 3: Black Arrow may be more expansion than sequel, but it fixes many of the original's problems while adding three new modes, offline split-screen functionality, Xbox Live 3.0 support (the first game to do so), and a plethora of new maps. It's bigger, it's better, and it will carry us through to November 9, without a doubt.  Introducing Black Arrow If you never played Rainbow Six 3, you should be ashamed of yourself. But just for context, Rainbow Six 3: Black Arrow and its predecessor are first-person tactical shooters. The tactical aspect comes from the ten missions, where (when playing alone) you'll command three AI comrades. The commands are very simple. You can tell your teammates where to go, get them to follow and cover, and use several options to breach doors and clear rooms. The commands remain as simple as in Black Arrow and your AI teammates aren't any smarter. It's when you go multiplayer that Black Arrow truly comes alive.   With the exception of the new Lone Rush mode, every game mode in Black Arrow can be played cooperatively. The missions can be tackled offline with a buddy in split-screen, with up to four players through System Link, or with four people over Xbox Live. Terrorist AI is still pretty basic and with no armor it's a snap to take out the baddies. However, they are smarter than in the first Rainbow Six 3 and will sometimes run off to get backup and generally try to take cover, though some will still run straight at you, guns blazing.  Video Review Available! Interested in seeing what Rainbow Six 3: Black Arrow offers you in the realm of tactical combat and team-based multiplayer? Check out our full video review on IGN Insider to see what Tom Clancy's franchise brings to the table.   Links :: Video Review ::     Perhaps the best improvement -- even over the constant use of tear gas by the terrorists -- are the screams and yells from your enemies. The gurgling sound made in RS3 by a burning terrorist has been replaced by a much longer and more agonizing scream. New phrases have been added and terrorists are a lot less likely to announce their presence before you enter a room. I wish the AI had seen some true improvements, but the missions are definitely more enjoyable in Black Arrow. The maps are better designed, more linear and a bit easier, but also more fun. And by more fun, I mean that this time they are actually fun. Sorry, but I didn't care for the RS3 missions, but Black Arrow missions feature better execution and turn me from hater to lover.   Play Alone If you're a fan of playing alone, I recommend playing through the ten levels of Lone Rush, a new mode added for Black Arrow. In Lone Rush your goal is to get to the extraction point before time runs out. Extra ticks are added to the clock for taking out terrorists, freeing hostages, and defusing bombs. You're all alone (hence the name), but this more arcade all-out-shooter is a hell of a lot more fun than the missions. That is, if the missions are a turn-off to you, you have a second option. Unfortunately, each Lone Rush map must first be unlocked by beating that corresponding mission, so you will have to play through all missions before you can tackle all ten maps of Lone Rush. It's worth it, because Lone Rush is really a joy -- even more fun at times than the brilliant Xbox Live play.  Tune-Up Along with upgrading the enemy AI and adding Lone Rush, the Ubisoft Montreal team made some important fixes from RS3. The leaning bug, which allowed players to lean around corners and be almost impossible to kill has been fixed and the kill zone has been tightened, requiring a little better accuracy for headshot kills. But the biggest improvements are with the targeting reticule. The principles of targeting remain the same. Each gun has its own unique reticule size and anything within the zone will get auto-targeted. The zone shrinks considerably when moving, so much so that when moving you will usually have just a small red dot for aiming.       The difference with Black Arrow, is that recoil has a slightly greater affect on what you'll hit. As you fire, four dashes (north, east, west, south) spread out from the reticule to show how wild your fire is getting. This is essentially to show that your shots have a margin of error, so that if you are holding down the trigger on an M60, even if the reticule is right over the target, the recoil may force your bullets to spread and miss. This was a factor in the original RS3 but the new markers show you how off your aiming will be. So if you use short, controlled bursts, your aiming will likely be true, but running and gunning will lead to wild shots.  This is what will continue to cause bad close quarters combat. When two people run into one another, the tendency is to hold down the trigger and run in circles. This totally jacks your aiming, so you may just run around each other firing like idiots. It's not a fault with the game, it's a fault with your tactics. Standing still and using short bursts allows for more accurate shots, and running and holding the trigger down will have you shooting wildly. That's no bug, that's you sucking.  None of the weapons have seen significant tuning, but the .50 cal -- the bane of the original -- is gone, replaced by the Dragunov. The difference between the guns is relatively minor. The Dragunov has a 100 damage rating, but the range and accuracy have been toned down from the .50 cal. The biggest difference for all sniper rifles, however, is the removal of a targeting reticule. When not scoped in, there is no aiming help whatsoever. This means that if you want to run through a level and try and gut-shot players with a sniper rifle, you'll have to guess where you are aiming. The only way to assure aiming with a sniper rifle is to zoom in. This is a major help to cut down on the jackasses that ruin Rainbow Six 3 online. Yay to the demise of jackasses!    Play Together The main appeal for Black Arrow is the multiplayer. Yes, the single-player has seen some improvements (I mean, I actually wanted to play through all ten missions this time), but the multiplayer remains the focus. If you don't have System Link or Xbox Live, Black Arrow is certainly reason enough to get hooked up. Featuring two-dozen maps, plus more downloadable maps in the future, Black Arrow offers all of the same multiplayer modes as its predecessor -- Sharpshooter, Terrorist Hunt, Mission, Survival, and Team Survival -- but also adds two fantastic new modes geared towards team play.   Total Conquest and Retrieval work very well on the new maps -- all of which tend to be larger than the maps from the first RS3 -- and will likely be the focus for most gamers. These new modes are founded on old-school multiplayer principles. Total Conquest is essentially Domination, where you have multiple satellites and your goal is to gain control of all of them and then maintain control for 30 seconds. The other team, of course will be trying the same. With re-spawning and a lot of movement throughout the big maps, you'll actually run into enemies quite often -- even in a four-on-four game. In fact, while I always hated the giant maps in Rainbow Six 3, they work very well here. It's too bad you are stuck with these big maps for Team Survival, because with a smaller group, that just becomes a big pain to find any adversaries at times.  Retrieval, the other new mode, is a one flag version of Capture the Flag, with a toxic canister acting as the flag. Each team begins on opposite ends of the map with the canister in the center. Your goal is to grab the canister and place it in your drop box, which is usually located close to your enemy's spawn point. Whoever scores the most points before time expires wins. And if you're tied? There's now sudden death offerings for every adversarial online mode so that you never have to hear that cold-hearted English broad claim, ~The round is a draw.~ Man, do I hate that line.       Retrieval is my favorite mode overall, more so than the old modes or Total Conquest. It's fast, but requires teamwork and you benefit from knowing the map. While spawn locations never change, this is gonna be the mode that will hold IGN's attention the longest, with new strategies being developed over several weeks.  The online bugs aren't all gone. The problem is, it's really difficult to tell what bugs still exist at this point, because many online bugs from RS3 -- like the inability to throw grenades -- happen when the servers are full and with Black Arrow just released, there hasn't been a chance to experience all of this in the real Xbox Live world. So I'll offer an update in a week or so, just in case major bugs are appearing. But that really doesn't mean anything regarding the score. Why? Because there were a ton of bugs in RS3 and you know what, we all still loved it. Hell, we laugh at the bugs and we play and play and play. Despite all of the flaws, it's just a damn fun online experience.  Join the Clan Rainbow Six 3: Black Arrow is the first Xbox Live game to utilize the Live 3.0 features. Clan support (called ~squads~ in Black Arrow) allows you to invite several dozen people to join your created team. Every squad has a unique name, emblem, even its own motto. In a squad, you can enter tournaments and find your friends more easily than ever. Taking your squad against another online is gonna rock. Sure, you can stay within your squad and play each other, but it's really about having your squad -- The Hamhocks -- take on another squad -- The Goonies -- in a variety of game modes.  The future of Xbox Live has finally arrived.    Ooh, Prettier Though the graphics engine hasn't be retooled, there are some definite visual upgrades to Black Arrow. Bloom lighting is all over the place, and Black Arrow overall looks sharper. There's still some clipping, but it isn't nearly as prevalent this time out. The rag dolls have also been weighted heavier so that they aren't as ridiculous in death as before -- but they still end up in some silly positions.  Those who are going with stereo sound are gonna be at a disadvantage, because directional sound with 5.1 is very helpful in locating enemies. There are new terrorists screams and the narrator for online games is more detailed (but that same heartless female voice). Thankfully the menu music has also changed. Yeah, the original track was very good, but after almost a year, I just can't stand hearing it anymore. The new score is more interesting, more varied, and more enjoyable.While Rainbow Six 3: Black Arrow doesn't provide major changes to the original, it's an excellent expansion. For only $40, this is a must-have for any Xbox Live gamer. Those who play alone will still find a solid game, but perhaps more of a rental. This is a game that is made for multiplayer, even the campaign missions are much better with friends instead of AI teammates. Black Arrow has bugs and other minor annoyances, but that doesn't matter. This game is a kick and a half. The fun of playing online and the addictiveness of Lone Rush far outweigh any lingering problems. It's better than the original, but then Ubisoft has had 10 months to crank this out. It's great to see four old maps brought over -- Peaks, Presidio, Garage, and Airport 1 -- but I wish Presidio and Airport 1 had not been altered. Some map changes to these old maps ruin the best conflict points. Only Peaks offers solid play for the new online modes, because the others are just too small for their own good. If you have Xbox Live, go buy Rainbow Six 3: Black Arrow right now. It will certainly tide you over until Halo 2 in November. The new modes are great, the new maps are really fun, and clan support will be all the rage.", "date": "Aug 6, 2004"}