{"name": "SEGA Superstars Tennis", "name_review": "SEGA Superstars Tennis Review", "ref": "https://www.ign.com/articles/2008/03/18/sega-superstars-tennis-review-2", "text": "It's pretty obvious that, with SEGA Superstar Tennis, SEGA's trying to do the self-celebratory ~Hooray for us!~ thing that Nintendo's been doing with its Super Smash Bros. franchise. SEGA has all the rights to do it  it's one of the few companies out there that has such a huge gaming history, a large assortment of intellectual properties and a vast library of memorable, trademarked characters. The big difference: Nintendo's game  a four player fighting design -- is something unique and extraordinary, and SEGA's game is nothing more than a stripped down rendition of Virtua Tennis.   Naturally, if you're going to do a character-based tennis game, Virtua Tennis is a fantastic foundation to build off of. And in the three-plus years of life the Nintendo DS has been without that property, the appearance of SEGA Superstars Tennis is, at the very least, something noteworthy on a system that hasn't really excelled in the sports department.   If you replaced the traditional tennis courts with ones taking place in such SEGA universes as Sonic the Hedgehog's Green Hill Zone, the Nights dreamworld Nightopia, and House of the Dead's Curian Mansion, and then replace the professional athletes with Sonic and Tails from Sonic the Hedgehog, AiAi from Super Monkey Ball, Beat from Jet Grind Radio, and Ulala from Space Channel 5, you'd get SEGA Superstars Tennis. And that's exactly what Sumo, the developer of Virtua Tennis, has done for SEGA.   It's Virtua Tennis, but...not.   It also feels like the team has stripped down the simulation aspect of Virtua Tennis in favor of a design that'd appeal to players who might be turned off by a realistic take of tennis. That's not to say that SEGA Superstars Tennis doesn't play like tennis; it definitely does. You can place hard shots, lobs, play the net and overhand smash the ball with a well positioned shot. You can aim your serves tight or loose to the line to ace your opponent. You can dive for an out of reach ball, even if the animation plays out the character's personality (Sonic does a forward flip instead of sliding to the ball, for example).    But compared to other tennis games, it feels more automatic than it should be. The Nintendo DS version retains that ~charge up the shot before it gets there~ mechanic of the Virtua Tennis design, but even if it truly has variations in shot and timing, it really doesn't show it. Pressing the shot button or buttons early or right on time seem to have the same effect. Charging shots makes it easier to hit the ball, and there's really no strategy in using the character's charging strength to really powerhouse the ball over the net.     This ~charge early~ control negatively affects the game's more over-the-top arcade element: special shots. As you successfully volley the ball, you're building up your special shot represented by a star below your character's feet. When it's fully illuminated, tapping the shoulder button will activate it and enable your character's over-the-top tennis playing abilities. On the console game, the characters will perform moves that'll throw trash on the court, or teleport the opposition to remote positions. On the Nintendo DS, they're nothing but crazy shots that zig zag and corkscrew, zipping in different locations. Here's the problem: while the ball is whizzing all over the court, since the ball has a pre-determined landing position, players can simply stand in the middle of the court and start charging their swing. 90 percent of the time the player can blindly hit these shots this way, making the reason for these shots pretty much pointless.   And the less said about the stylus controls, the better  the developers included this clearly as an option and not the way to play SEGA Superstars Tennis. Skip it and play the traditional D-pad and buttons way. It works and works well.   As an arcade-style tennis game SEGA Superstars Tennis certainly isn't a bad one. Even with its slightly watered down tennis mechanics there's a good amount of control and challenge, especially against a human opponent who doesn't play as predictably as the computer AI routines  the single player tournaments are surprisingly easy all the way up to the final ~Special Challenge~ against Dr. Eggman who has some wicked capabilities compared to the line-up that led up to his challenge. The developers had the good mind to apply single cartridge multiplayer support so you can give the multiplayer mode a taste-test; granted, you'll have to sit through a surprisingly long load time, and then play as Sonic vs. Sonic in the Sonic stage. But it's a decent advertisement for the full four player experience if you can track down three other players with a copy of SEGA Superstars Tennis. Shame the developers couldn't get Nintendo Wi-Fi Connection support in there  online tennis would have definitely given this game a boost in final score.     The Nintendo DS version lacks a bit of ~oomph~ in the presentation compared to the console game. Even with a 3D engine that's running ultra smooth and fast, the Nintendo DS version's courts don't have nearly the same environmental energy, and the single player campaign is a lot more straightforward and barebones due to the lack of the Planet Superstars menu and level progression that the console games enjoy. On the flipside, some of the DS exclusive extras are pretty cool: playing tennis renditions of Space Harrier and ChuChu Rocket is a lot of fun on the Nintendo DS. On the whole, while the core gameplay's still here, the DS game loses some console elements but gets a bit of its own. Perhaps Mario Tennis on the Game Boy Advance has spoiled us. We appreciate all the little nods to past SEGA titles, but these little things aren't really tied into the core tennis experience. As solid a tennis game SEGA Superstars Tennis ended up on the Nintendo DS, it feels far more hollow than a celebratory ~Yay us!~ game should be.", "date": "Mar 18, 2008"}