{"name": "The Sims: Bustin' Out", "name_review": "The Sims Bustin' Out Review", "ref": "https://www.ign.com/articles/2004/08/13/the-sims-bustin-out-review", "text": "Nokia's N-Gage platform seems to love the Game Boy Advance ports. The question is whether or not the Game Boy Advance ports love the N-Gage back. For the most part they're rife of flaws and chunkiness that really shouldn't plague a system that is technically superior to the Game Boy. Some games, however, make the transition with little missing --others, well, let's not get into that.   One of the latest entries into the increasing N-Gage library is The Sims. In this case, it's a direct port of the Game Boy Advance game, The Sims: Bustin' Out. Like the GBA version, the N-Gage game is loosely based on The Sims universe and play mechanics with one major difference, you're in full control of one sim versus in passive control of many.    Features   Create-a-Sim (Male or Female)    1-2 Players with Bluetooth   Eight mini-games    Sim save (no pun intended)    Over 20 locales   25 NPC Characters   The shift from Populous-style, multi-avatar to single-character gameplay makes Bustin' Out feel more like an isometric adventure game than a mock life-simulation. Yeah, you will do most of the stuff you did with The Sims on PC and gaming consoles, but building environments isn't nearly as complex--you'll arrange and re-arrange furniture, but that's about it. Most of the time you'll spend doing chores, keeping your character clean, fed, and happy all around.    As you progress through the game, you'll encounter various non-player characters that you must befriend to advance further in the game. Some might offer mini-quests or side jobs like fixing a motorcycle or spying on the local auction house. Other gigs are re-occurring like mowing the lawn or tending the bar at the local pub. Just as you're about to lose interest in one job or event, the game adds something else. We won't say it doesn't get slightly monotonous, but if you're at all into The Sims, you know what to expect.    Visually speaking, Bustin' Out is on par with its GBA counterpart. Strictly a 2D, isometric game, The Sims runs smoothly for the most part, but chunks up in areas where the GBA didn't. But maybe EA and Nokia are onto something. The Sims spanks the pants off pseudo-3D games and maybe this is a better way for the phone to get cool games without subjecting gamers to limited  hardware still in the infancy of growing pains. Even the typically-annoying vertical LCD doesn't do much to affect gameplay.If you read our review of the GBA version, you might remember we stated, ~[It] isn't quite as extravagant as the upcoming console games because of the standard limitations of the Game Boy platform. But as comparatively limited as the GBA version is, it's still a well-designed, casual game, and it definitely fits the bill for an on-the-go version of one of the most popular game franchises around.~ The same goes for the N-Gage and we'll take it a step further; it's probably one of the better games on the unit.Still slightly marred by chunky horizontal-scrolling issues, the game remains fun and is a really easy one to pick-up, understand and play through. And since the game isn't action-heavy it's really easy for us to overlook the occasionally drop in frame-rate. The added bonus is that the game is ideal for the on-the-go-playing-with-the-phone-on-the-subway gamer. You can play it for a few minutes, quickly turn it off (the game won't reset until you turn off the phone) and pick up from where you left off. Multiple saves let you create more than just one Sim.", "date": "Aug 13, 2004"}