{"name": "Madden 2005", "name_review": "Madden NFL 2005", "ref": "https://www.ign.com/articles/2004/08/18/madden-nfl-2005-4", "text": "Every year EA's Tiburon studio manages to pull a worthy update to its Madden series out of its collective hats, throwing together a wide variety of new features that justifies a new version for the season. The series, while just as frequent, hasn't been nearly as flourishing on the Game Boy Advance. But the deja vu is over. Madden NFL 2005 is an entirely new product on the Game Boy Advance, and while it still can't come anywhere close to what the console team's doing on the Xbox, PlayStation 2, and GameCube, the GBA rendition is a good match for handheld gaming that at least offers the core of what makes the Madden series so darn good. Features All NFL teams and players New Madden Challenge rewards system Season and Exhibition modes Player trades Team statistics tracking Link cable support for two players Cartridge save  When you're the only game in town, and when you've got a namebrand as strong as the Madden franchise, it's easy to slack off in development and provide the minimum experience. It's certainly true (and just a little disappointing) that the past two Madden GBA games were basic retoolings of Madden NFL 2002, which, in turn, was a port of the Genesis and Super NES designs of years prior. But that didn't happen in Madden NFL 2005. For the latest game, Electronic Arts and Tiburon went with UK development team Exient, whose previous GBA efforts include the stunningly good FIFA 2004 release last year. The team also provided those few N-Gage owners with last year's NCAA Football 2004, and it was that experience that's given the Madden NFL series a real shot in the arm for the new season.  Not a single asset has been recycled from Madden NFL 2004; this game is a brand new experience for Game Boy Advance gamers. The team has taken the engine it created for the N-Gage football experience and moved it over to the (apparently) weaker GBA hardware. But even if the Nintendo hardware isn't as state of the art as Nokia's system, the team's engine looks and runs just as slick on the GBA. The updated engine, still entirely sprite-based, features sharper character graphics, smoother and more versatile player animations. Which inevitably leads to a wider and deeper field of view -- ever important in a football game. The framerate does tend to take a dive every now and again, but on the whole the engine keeps everything moving at a playable clip.  I, however, cannot emphasize this enough: this game is not made for play on the GameCube Game Boy Player. Obviously if you're going to play on the NGC, you might as well grab a copy of the GameCube version. But Exient is pulling off a few graphical tricks on the Game Boy Advance to sharpen up the imagery, including an interlacing effect that gives the impression of a higher resolution field on the small screen. Now, on the GBA's LCD Madden NFL 2005 looks extremely crisp. But up on the big screen, the field shimmers like a vibrating bed at a seedy hotel. Do yourself a favor and keep this game on the system it's made for.  Even with the new look and direction, most of the gameplay nuts and bolts that make Madden the top video football franchise have been translated over into the new engine. The control and player AI (artificial intelligence) routines, already pulled off well in GBA games' past, retain the quality and fun the Madden series is known for, and in fact, the AI seems to be smartened up this year. Luckily there are plenty of slider options to tweak the game's difficulty if it seems like it's a bit too challenging to find the pocket. Of course, when you start seeing the patterns the slider function comes in handy to make it a bit tougher to score. Naturally, the game's best played against a human opponent, and Madden once again offers up link cable support for two players.  The new version even adds the Madden Challenge points this year, an element that rewards players by performing specific tasks during play; it's a feature that seems trivial on the surface, but in practice this rewards system really adds to the overall experience. As far as gameplay goes, Exient got Madden NFL 2005 right on the GBA.  Outside of the game, however -- that's a different story. Cartridge limitations, or rather, EAs insistence of a small EEPROM save means that the portable Madden game, again, only offers combined team statistics during a season; no individual player statistics. Also, while the actual in-game graphics look great, the user interface -- for anything from player trades during a season to viewing all of the NFL records -- are designed with absolutely no flair. And a few features that were actually great to see in past Madden GBA games, like the player camp mini-games and the create-a-player mode, have been removed entirely out of Madden NFL 2005. It's pretty clear that the GBA game's made for the armchair quarterback and not the armchair statistician...or even the rotisserie/fantasy football fan.  The GBA series can never come anywhere close to what Tiburon's pulling off on the console side of things, and if you want the true football experience you're not going to get it here. But as a cheaper and more portable compromise, there's a lot to like in Madden NFL 2005.", "date": "Aug 18, 2004"}