{"name": "MLB Slam 2004", "name_review": "MLB Slam 2004", "ref": "https://www.ign.com/articles/2004/08/20/mlb-slam-2004", "text": "Though baseball season is in full swing (get it?), carriers continue to host new batting contests. THQ Wireless steps up the plate with MLB Slam 2004, an officially licensed ballgame with console-quality features squeezed into an itty-bitty download.   Now, is this game going to win prizes for its visuals? No. The game is about as pretty as Mike Piazza after somebody questions his sexual identity. (Dated reference? Maybe.) Baserunners are animated with precious few frames, the field has zero texture to it -- it's either green or brown. The menus and stat sheets are clear and readable, but are presented with little flair.   However, once you get past all that, what you're left with is a very playable game. And since we all know that handsets cannot quite pull off GBA visuals (although some are getting close), that's what counts when it comes to wireless titles. Real baseball fans will be pleased that THQ Wireless spent the extra cash to get a full MLB license, meaning all pro teams, players, and uniforms are in this little game.   MLB Slam 2004 offers each pitcher a different selection of pitches, all easily selected and thrown. Conversely, the batter has a convenient, more than split-second, window to choose a swing. Go for power? Or bunt to just advance the baserunners? Control is very simple and easy to use, especially if you have a handset with a sizeable touchpad.   Its the extra touches of MLB Slam 2004 that elevates it above some of its decidedly weaker competition. The fact that it has over 550 actual players from a complete, updated 2004 roster is excellent. But even better is that when you challenge that computer, you can expect similar performance out of those AI-controlled players that you would in real-life. So when Bonds steps up to the plate, expect a far greater chance of hitting a homer.  If you've been holding off on picking up a baseball game, MLB Slam 2004 is a pretty good purchase. True, it's certainly not the prettiest game you'll ever see (CBS Sportsline Baseball trumps it handily), but it certainly has enough pro touches to satisfy ardent fans. Whereas CBS has only four teams, MLB Slam 2004 has them all. And to a lot of people, that's all the difference in the world.", "date": "Aug 20, 2004"}