{"name": "Predator", "name_review": "Predator", "ref": "https://www.ign.com/articles/2004/08/26/predator", "text": "There is no escape from the Predator. He's stalked Arnold. He's terrorized Danny Glover. And in the new ~Aliens Vs. Predator~ movie, he eviscerates a cast of B-list actors. Who's left for the big lug to hunt? How about an anonymous cast of jungle operatives in Indiagames' new action game for handsets, Predator?   The game certainly piggybacks on the hype of the current flick, but this Predator is based on an original story. The year is 2000. The Predator race has been observing humans for centuries, waiting for us to hone our war skills enough to be suitable prey. Well, thanks to our amazing gift for inventing new and more depraved ways to kill each other, the Predators have decided that time is now.   You slip behind the helmet of a high-ranking Predator, an esteemed hunter looked up to by his brethren. You must stealthily slip into a jungle military outpost and start collecting trophies for the Predator Shrine, and monument to the greatest and most dangerous sport in the galaxy.   Indiagames has granted players full use of the Predator arsenal, from a cloaking device that allows you to blend into the jungle to those massive claws that tore Billy from limb to limb in the original movie. Probably the most favored weapon in the game is the Jesse Ventura-ventilating plasma cannon. You can tag and track your prey with a red targeting beam, and when the time is right, unleash a fat blast of energy that tears him in half.   The game is somewhat bloodless, but there is still plenty of action. The side-scrolling action will remind gamers of a sci-fi Splinter Cell, where stealth is key to disposing of maximum targets. The platforming elements remind us of Prince of Persia, what with the jumping on piles of barrels, leaping over spike pits, and activating triggers. Splinter Cell and Prince of Persia? That's pretty good company.   The game's side-scrolling action is pretty straight-forward, but includes just enough ~Predator~ touches to stand out from crowded decks. Pressing ~9~ on the number pad cloaks the Predator, but there is a limit on the amount of time you can go camo. During that time, though, you can slip up behind soldiers and rip 'em apart with your claws. Should you need to target enemies from a distance, it's time to pull out the shoulder-mounted plasma cannon. When confronted with multiple enemies, you must dig deep into your bag of tricks and unleash razor-sharp discs that slice up entire platoons -- as long as they're standing in a line. There are traps to beware of, too, such as a sentry gun that's triggered by a red laser beam. If you are caught in the beam, the gun goes crazy, riddling you with bullets.   Control is pretty responsive. When you start moving left and right, the Predator must take a couple of steps before he gets going -- there is no dead run. Jumping is handled a lot like Prince of Persia; pressing up causes the Big P to make a forward leap. Our main complaint? The Predator cannot shoot while ducking under things. The cat has super weapons that blow holes through chests. He traveled across the galaxy to get here. His guns and claws are disabled anytime he bends his back? Please.   Indiagames has paid a special amount of attention to all the little details that make the franchise what it is. For example, the game opens with a shot of the Predator craft coming in for a landing above planet earth. The plasma cannon looks just right. And best of all? When you take out a human, stand over him and press ~5~ to bend down and rip out his skull and spine. After all, you have to bring home souvenirs from your big trip, right?   Predator looks pretty solid. We tested the download on an N-Gage QD, and the screen brightness helps since the game is appropriately murky. Lots of jungle greens, browns, and grays -- all appropriate colors for a Predator game. The levels are nicely detailed and varied, from human complexes to dense jungle. Animation is smooth -- especially yanking out that spine.Predator is a nice little surprise. Indiagames' last two licensed titles, Garfield and Day After Tomorrow were disappointments. Predator reminds us that this is a talented developer capable of delivering nice bursts of handheld entertainment. The designer's attention to detail is also key to the game's success, as this is an established franchise with lots of ~Predator~-specific things that fans will demand. From the plasma cannon to stealth to skull-collecting, Predator is the go-go human-hunting experience you've been looking for.", "date": "Aug 26, 2004"}