{"name": "Astro Boy [2004]", "name_review": "Astro Boy", "ref": "https://www.ign.com/articles/2004/08/27/astro-boy", "text": "Dr. Tenma's son has died. Instead of shedding more tears or seeking out some ladies to procreate with he opted to replace his boy by creating a robot... in black vinyl underpants. We suppose that's what any good futuristic scientist in mourning would do.   Astro Boy, the red-booted, nearly naked artificial child, also found himself inexplicably endowed with a variety of heavy weaponry and advanced technology. Now he can fight to protect the city, or at least initially fight so that he can later talk things into submission. When your son dies and you create a robot replacement, why not put him in jeopardy?   Astro Boy is a third-person action game with many, many problems. Despite featuring a loveable, if freakishly underdressed robot-boy overflowing with sappy emotion that pours out from his gigantic owl-eyes, it also manages to feature a sloppy camera, poor controls, uninteresting gameplay, and a storyline so short and unfulfilling you'll wonder why you even bothered.   At first, the premise behind this one seems almost sublime, at least on paper. There's this character that evolves through the completion of missions, earning new powers and undertaking greater challenges. His first gift is that of flight, which allows him to careen about a futuristic metropolis at his leisure. Add in some lasers and arm cannons and jet-powered feet and a bunch of giant bosses and you have a good mix, right? Sadly, no.   Stop Staring at My Pants! Under this thin facade of greatness lies a sinister, wicked truth... The city Astro Boy feels about as constricting as a large backyard and with little that's interesting. And all these wondrous superpowers we can use to further our incredibly mundane gameplay experience are only delivered in succession to make the beatings of six simplistic bosses possible. The bosses, unfortunately, make up about 90% of the game. There aren't even the in-between brawls, platforming, puzzles, and the other fun elements that we've come to expect from SEGA. At least we get new powers, but we'll never use them unless we're forced to.   The x-ray vision lets Astro see stupid invisible baby with big bomb attached to it. The laser finger lets him hit a multitude of enemies at once, and the blast cannon is for taking down the bigger, badder enemies one at a time. But why bother when just punching and throwing seem to suffice? Progression is absurd. Basically you fly to and fro, beat a boss, fly to and fro, win the game. Each boss should theoretically require more skill to master and more powers to triumph over, but this is not the case. In turn, the game becomes so short, so straightforward, and decidedly invaluable to most players.   As a children's title, and taken strictly from that loveable three-foot high vantage point, Astro Boy has some definite appeal; primarily, the art style that's intentionally simplistic, features a lot of high contrasting color schemes, and vivid imagery replete with authentically animated characters. The story, while maddening to a point that would make the Bananas in Pajamas reel over in undying agony, still offers enough child-appealing nonsense that it could pass as entertainment between dinner, some scheduled spankings, and bedtime.   Unfortunately, voices pulled from the cartoon and a likeable style that was not even the doing of the game's creators don't help an experience without a shred of excitement. Add in an unworkable camera and a confusing flight dynamic and you'll likely find youths more confounded than elated. Should you endeavor to hand this over to junior, perhaps as it was intended to be (it's impossible to say for sure), first ponder this: Should you?So, should you...endure...Astro Boy? Well, there is virtually no gameplay present -- at least none that warrants completing the title and suffering through an excessive Easter Egg hunt to discover a lot of meaningless collector cards -- and it is a brief experience. Thus, what value can be found? Hardly any, sadly.This is more an attempt at selling a stylish name to a trend-ridden hipster generation fueled by retro love than it is a title worth playing. If you're under the mistaken belief that ring races at imperceptibly slow speeds and boss battles with little to no challenge are a sort of endearing quality in games we've never been able to fully appreciate until now, buy this and fulfill your lifelong dream of attaining four straight hours of unrivaled unhappiness. NiGHTS this is not. Don't pretend. Don't buy-in proclaiming your adoration for the character and his origin so long ago. Open up your eyes and pray Osamu Tezuka doesn't come back as a very angry zombie to vengefully slaughter us all. Better still, go buy the GBA version and have yourself some honest to goodness fun.", "date": "Aug 27, 2004"}