{"name": "WWE Day of Reckoning", "name_review": "WWE Day of Reckoning", "ref": "https://www.ign.com/articles/2004/08/27/wwe-day-of-reckoning", "text": "Talk to a Nintendo fan about wrestling games and they're bound to reminisce about the Aki-developed WCW and WrestleMania titles for N64. These games even today are fondly remembered for their arcade-quick play mechanics and user-friendly grapple systems. The combination sounds simple enough, but successfully re-brewing the formula has over the years proven next to impossible for developers. However, last year Japanese studio Yuke's gave GameCube owners the closest copy of those classic play styles yet with WrestleMania XIX, a game that seemed to have the fundamentals in place -- solid control, decent grappling system, and passable speed -- but sorely lacked in extras. The game was sadly completely without a real story mode and most of the action took place off-stage, a truth that disappointed many wrestling fans.  So Yuke's went back to the drawing board and WWE Day of Reckoning is the result. This is in many ways the game that WrestleMania XIX should have been. Controls have been polished, the speed quickened, and the grappling system finely tuned. On top of that, the graphics have been overhauled. Just as important, though, there's a new and fairly deep story mode, an impressively expanded create-a-wrestler feature, and for the perverts a Bra & Panties option too. Exactly what everybody wanted. Except, there are some unfortunate omissions, particularly where the roster is concerned, that are once again sure to have hardcore fans sticking their noses up.  The Facts  Yuke's-developed sequel to WrestleMania XIX Features more than 40 WWE superstars, divas and Legends New story mode -- start from the bottom and work your way to stardom Deep create-a-wrestler option Play in 12 classic venues from Raw and Smackdown to No Way Out and Summerslam Single, Tag Team, Triple Threat, Fatal 4 Way, Handicap and Royal Rumble Exhibition modes Choose your play style: everything from normal matches to TLC, Hell in a Cell, Ironman and Bra & Panties Features blood and knockouts Four-player support Buy stages, weapons and extras for the create-a-wrestler in the Shopzone Tutorial mode   Start at the Bottom WWE Day of Reckoning features a wide selection of traditional Exhibition modes, including Single, Tag Team, Triple Threat, Fatal 4 Way, Handicap and Royal Rumble, not to mention sub-styles like Hardcore, Ladder, Table, TLC, Steel Cage, Hell in Cell and Ironman matches, but the guts of the game can be found in the welcomed new story option. Yuke's has spent a lot of time here and it shows. You can play through the story mode with your uniquely created wrestler, or using a stock character supplied by the developer. Unfortunately, you cannot play through the story section with a Superstar, Diva or Legend, a truth that will no doubt frustrate some wrestling fans. But we can't really fault Yuke's for the omission because playing with one of the established stars simply wouldn't make sense as the entire story mode is meant to drive one point home: that you start as a nobody and have to work your way up the ranks.    That said, the game's stellar create-a-wrestler feature, which is as deep as we've seen on a Nintendo console, will enable you to design just about any beauty or beast that your heart desires. You can create male or female stars or Divas, naturally, and you can sculpt and alter their every last facial feature, fight styles, strength attributes, ring entrances and more. You can change body and skin types, add density and width to jaw lines and chests, choose from an impressive selection of different eye wrinkles, and so forth and so on. We could write for hours on the feature alone, but for the purpose of brevity we'll keep it short and simply state that the create-a-wrestler option in Day of Reckoning runs circles around the one present in last year's game.  Once you've got your future Superstar, the story mode begins and we learn through a series of basic cut-scenes how this epic journey from nowhere to somewhere will unfold. It turns out stars aren't born overnight. You'll have to earn your dues. WWE president Vince McMahon invites you into his office and lays down the smack: you'll do what he asks whenever he asks and if you're lucky, you might move up the ranks. But in the meantime you're to see the Coach and prove yourself. Which more or less means that the first couple matches pit your wrestler against no-talents and wannabes. And the story evolves from there.    These are not dazzling cinematics. The story sequences unfold in real-time using the game-engine graphics. Yuke's might have a knack for bringing together a good fight, but the developer could use some help with presentation. While the convincingly detailed character models show facial emotion and animate fluidly, a total lack of any voice work means that you'll be reading everything they have to say and not hearing it. It's disappointing given that so much of the color and ambiance of wrestling comes directly from the lips of the Superstars and those who manage them. It's doubly disappointing when we consider that some other wrestling games on competing consoles do feature voice work.  Nevertheless, the story mode is enjoyable and engaging for a number of important reasons. First, it simultaneously teaches you the ropes and offers helpful guidance. It also sets goals for your character. In one match, you might have to perform two finishers. In another, you might be called upon to thrice bring some pain from the turnbuckles. Other times, the Coach, former WWE general manager Mr. Heyman or McMahon himself might suggest that you take advantage of a pro's publicized weakness. These simple goals successfully help distinguish one match from the next, which in turns keeps the fights fresh week after week.       We do have one related, minor gripe that we just can't let go unmentioned. There is disappointingly no indication in-match to let you know if you've accomplished your goals correctly, and because of that you might occasionally believe you've done the job when, in fact, you haven't. A simple chime or a text overlay would have done the trick. Hopefully next year's version will correct the oversight.  The play itself is fast and fun. The solid grappling system from last year's version is back and polished, which means that there are hundreds of moves mapped intuitively to a surprisingly simplified control scheme. Heavy and Light attacks and grapples go hand-in-hand with Heavy and Light counters. There are reversals and counter reversals, just as there are several different variations for each move, all based on something as instinctive as whether or not you tap or hold the buttons. The system works very well and what it all boils down to are frenzied matches with arsenals of moves available to those who take the time to learn the intricacies of the palate. You can go pull off combos. You can go on the ropes, outside of the ring, have at it with weapons and much, much more.  Meanwhile the unqualified button mashers will be able to hold their own... for a little while, anyway. If you're wrestling fan, you're going to be entertained, if not addicted, especially if you play with friends.  Yuke's has added some graphic and audio bells and whistles to spruce up the intensity of each match, too. A cinematic camera system dynamically shoots the action from multiple angles depending what's happening in the ring. Yes, the ref occasionally gets in the way, which is bothersome, but for the most part the battles look great and some of the zoomed-in angles show off the gorgeous character models up close. Meanwhile, there are brief new fight-pausing animation sequences for special events: if you bust up an opponent's face, a quick cut-scene will show the character clutching his nose as blood gushes about; and similarly the finisher moves are surrounded by sweeping camera angles and nicely done filters. And to top everything off, most of the wrestler ring entrances closely mimic those of their real-life counterparts complete with identical theme songs, pyrotechnics, background video and trademark entrance style.  In addition, the game itself looks vastly superior to last year's version. Character models are constructed with a great many more polygons and as a result are rounder and more realistic looking. Crisp, clean textures skin each pro believably, and there are new lighting, specular and particle effects that go a long way. You will be able to see the sweat glistening off the skin of overworked fighters. Unfortunately, the game does not run in progressive scan mode, nor does it support a 16x9 option. This year's version, however, does feature a strong mix of licensed rock and rap music, which adds a certain flair to the overall presentation.    So What's Missing? Some of the key wrestlers, unfortunately. And that's not to suggest that Day of Reckoning is without any talent because that's simply not true either. The game, in fact, features more than 40 playable characters with the selection of Superstars, Divas and Legends combined. You'll find everybody from Triple H, The Rock, Undertaker, Kurt Angle, Kane, Matt Hardy, Shelton Benjamin, and Charlie Haas to Rhyno, Hardcore Holly, Val Venis, Danny Basham, Garrison Cade and Mark Jindrak. You'll also find Divas like Trish Stratus, Stacy Keibler, Victoria and Molly Holly. And more, Legends such as Roddy Piper, Andre the Giant and Bret Hart. But the selection is still lacking, especially when compared to other wrestling games on the market. Not included in Day of Reckoning are some of the WWE's biggest stars, from D-Von and Spike Dudlee to JBL, Maven, Lita, and Paul London. The game boasts a new Bra & Panties mode, but lacks many of the Divas meant to fill it. It meanwhile includes a mere five Legends. The Superstars, Divas and Legends in place will undoubtedly keep wrestling fans busy regardless, but the slimmed roster is discouraging all the same. Indeed, it's this reduced selection of wrestlers that, more than anything else, knocks the game's review score down.  Thankfully, most of the big venues are included. You'll be able to brawl through Raw, Smackdown, Summerslam, Unforgiven, No Mercy, Survivor Series, Armageddon, Royal Rumble, No Way Out, Heat, House Show and, of course, WrestleMania. Day of Reckoning is a worthy sequel to last year's enjoyable, but flawed WrestleMania XIX. The game's intuitive grappling system is still fast and fun, and once you get the hang of counters and reversals you'll really gain an appreciation for the depth hiding underneath the simplified control scheme. The new story mode doesn't overwhelm with presentation -- a lack of voice acting hurts -- but it's well designed and engaging all the same. Plus, it works hand-in-hand with the game's excellent create-a-wrestler option. The biggest problem with Day of Reckoning -- a pretty sizeable, rather unfortunate oversight -- is the lacking roster. While many of today's biggest Superstars, Divas and Legends are included in the title, so are a dozen or so major ones missing, and that is extremely disappointing. That noted, this is still far and away the best wrestling game available for Nintendo's console. If you can live without a handful of Superstars, Divas and Legends, you're going to have a lot of fun bringing the pain to the opponents that are in the game. And it only gets better with friends.", "date": "Aug 27, 2004"}