{"name": "Spy Fiction", "name_review": "Spy Fiction", "ref": "https://www.ign.com/articles/2004/08/30/spy-fiction", "text": "The traditional spy games that have been on the market have favored stealth over gunfights. While this is more realistic, Spy Fiction aims to provide a game that has more action than hiding around in shadows. Instead of waging a war against light bulbs like in Splinter Cell: Pandora Tomorrow, gamers can get some more fistfights and gun battles. The result is a game that merges elements of more arcade-style games with some clever puzzles and wraps the whole thing up with a spy sheen. It's an interesting experiment that has its faults, but provides a pretty solid experience nonetheless.    The plot of Spy Fiction involves two spies, Billy Bishop and Sheila Crawford, that are part of the Special Execution Agency (S.E.A.) as they try to get their way to the bottom of an international terrorist agency. Upon starting the game, players can choose from either of the characters and play through with slightly different paths. Both will play through the same enemy bases, jungle environments and airships, but there will be slightly different branches for each to explore. Still, no matter which character you choose, the game will involve plenty of shooting, puzzle solving, and stealing of identities, which is the core of this game.   Stolen Identities  There are over a dozen gadgets to play with in Spy Fiction, but the one that gets the used the most here is easily the 3DA Cam. By zooming in on a subject and taking a picture that shows both the outfit and the face it's possible to create a disguise that can fool enemies from a few feet away. The way it works is this: take a picture of anyone in the game, make sure nobody can see you, then duck into a closet or a barrel in order to change into the disguise. A few different disguises can be stored in memory at a time so that the spies can choose who they want to be at any time.    Being able to choose a disguise from a selection is crucial since a particular disguise can be ~ruined~ if the enemies suspect you're actually a spy. By walking too close to a guard, the guard will suspect that something is wrong and check you out. If this happens too many times, that disguise becomes wanted and anyone seeing it will attack. While there is a set number of guards that are roaming the halls, there are also doorways that lead to guard stations that will open up for support. This means that one slip-up can lead to four or five guards running up and launching themselves at you. At this point the game provides two options: sneaky or aggressive. Are you a spy or are you a fighting superstar? The option is yours, but we'd really recommend the fighting route mot of the time.   Don't Get Caught  Suppose you wanted to play the game in a sneaky way and after being spotted you hid out. The two safest methods of hiding are to either crawl into a duct or to crouch against a wall and go invisible with the optic camouflage suit. If nobody sees you go invisible, then you're safe as long as nobody bumps into you. After being spotted, the guards are on alert and if you run away from them, they'll then be on search mode. The upper left corner counts up a percentage of area scanned. When this reaches 100% the guards are still in caution mode and another percentage counts from 100% to zero. This is still dangerous as all of the extra guards that were called out are still on the floor. Once everything has finally gone back to normal the extras will go away and the floor is safe for sneaking.     While all of this is sneaky and accurate, it can take a very, very long time to wait through. If I wanted to wait for the heat to go down after being spotted, I would be waiting for over a minute in a duct or crouching against a wall. After trying this several times, I found a new technique for dealing with it: I'd leave the room. Upon being spotted and hiding out, I'd go out for a glass of water or talk to a housemate and then return when the coast was clear.    While the whole search and caution phases for the guards lends some seriousness to the game it does feel like it could have been sped up or even gone without the caution stage altogether. If we'd successfully evaded a search it does figure that we've found a good sot and won't be found. To have to wait for the slow caution meter to count down is a bit excessive. It also pushes one to the more aggressive style of play.   Duking it Out  Instead of hiding from the guards, the other way to deal with them is to take them on and leave them as a whimpering pile of flesh. A few different flavors of grenade are provided for this as well as a few guns. With an auto-targeting system, this style of gameplay features a run and gun style of running around and shooting at as many people as possible. It's possible to swap to a first-person view for headshots, but there's rarely any time for that here. The key is mass-destruction and the grenades are the best form of first attack with a gun for mop-up.    Strangely enough, there's only one button that's mapped for a weapon and both the guns and the grenades are used here. Instead of using one button for shooting in a fight and one for lobbing bombs, it's necessary to go to a menu (which pauses the game) and then throw the grenade. It would've been helpful to have an ~expert~ mode that used more of the buttons on the PS2 controller, but this approach seems to favor a form of play that doesn't try to confuse players with lots of buttons.     Overall, the battles in Spy Fiction have an arcade feel to them with a dizzying camera thrown in that can make the shooting more difficult than it needs to be. Of anything that can make the fighting difficult in this game, it's trying to figure out what's going on when the camera snaps to different directions with each auto-target of the weapons. By constantly shooting, all of the targets will get hit and you'll be reaching for the Dramamine before too long.    Puzzle Fighter  Where the big battles are large and confusing and the sneaking can take too long, the rest of the game excels in terms of the overall storyline and the puzzles presented by the disguises. Many of the obstacles in the game require a clever use of the camera and using the right disguise in order to access blocked areas of every level. When the game focused on this aspect and provided opportunities for us to take pictures and snipe enemies it truly hit its stride.   While the puzzles can sometimes be a bit abstract or random, for the most part they logically follow along with the story and instead of being a tacked-on addition are integral to what's going on. By getting close to a target it's possible to then imitate the target's voice as well. One of the best scenes in the game involves impersonating both sides of a secret meeting so that the spies got to get intel from both enemies while they still thought they had a conversation with the real other person. It was the clever touches of enacting a spy operation that makes this game stand out.     There are other puzzles as well, but these are of the more of the obstacle course variety. These involves jumping from box to box, navigating sinking logs in a swamp, or even walking through a minefield. These help to ensure that the action doesn't become too stale and repetitive. These were mini-games off of the main action, but they really show more of the creative spirit that is shown by the identity theft.   Taken together, the mini-games combine to form a part of a game that goes in many different directions and provides a wide variety of challenges. While never terribly difficult, they provide for a good flow and keep the game moving. The only thing I could ask for is that the puzzles had become even more complex and tricky in their execution. And yet the balance is good with the rest of the sneaking and the shooting.   Style is the Message  While the storyline in Spy Fiction has plenty of twists and some sick characters that one is truly satisfied at their demise, there's an odd graphical treatment to the whole game that makes it looks like an almost anime-style spy game. Characters have wacky hair and large eyes and an almost cartoon, but not cel-shaded, scheme to them. Even though the graphics are smooth and well-lit and textured, the Japanese origins of the game show themselves everywhere and it prevented the game from having some grittiness that I felt could have made it ~feel~ better.   Having said that, I need to say that while this game does look good and there's no problem with the engine, aside from the camera, it's a bit disconcerting to see a game that deals with so much double-crossing and vaguely adult themes given such a lighthearted look. It could be personal, but I do feel that with a darker look and feel this game could have had a bit more impact with the same gameplay intact.   Spy Fiction has plenty of action, but the best parts of it come when there aren't a ton of guys to shoot. Sad to say, the times when there's some quick-paced action to take care of, the game doesn't quite handle it so well and it's a damn shame. With a clunky camera and a slightly awkward weapon system the battles consist of throwing grenades and hoping to clear the area as fast as possible. In reality, the game goes much smoother when it deals with one enemy at a time or really just solving all of the puzzles.When the spies need to don several different disguises and weave their way through the enemy complexes with a mix of braveness and creativity the game takes on a life of its own. The whole process of pretending to be someone else is unique and lends itself to several different situations to get through. With some physical puzzles to back it up, Spy Fiction provides a good ten hours of solving the challenges contained within. It's a shame about the action and the camera, but if you're willing to look past that there's definitely something to see here.", "date": "Aug 30, 2004"}