{"name": "Indiana Jones and the Infernal Machine", "name_review": "Indiana Jones and the Infernal Machine", "ref": "https://www.ign.com/articles/1999/12/07/indiana-jones-and-the-infernal-machine-4", "text": "It's no secret that the folks at Core gathered a lot of their inspiration for the Tomb Raider series from movies like Raiders of the Lost Ark.  So how fitting that this year Indiana Jones returns to steal right back from Lara.  The previous Indiana Jones titles from LucasArts were all traditional point-and-click adventure games, with few action sequences.  So it did come as a bit of a surprise that Indy's latest adventure, the Internal Machine, would stray from its roots a bit and morph into an action/adventure game in the vein of Tomb Raider.  Of course, the series was just screaming for a makeover, and I must admit that overall I'm fairly pleased with the end results.  The intricate and intriguing storyline in Indiana Jones and the Infernal Machine starts off in 1947 in the dusty canyon lands of Utah.  Indy has given up his life of high adventure for the more sedate (and safer) endeavor of hands-on research through site excavation.   Well, the exploring bug has burrowed too deep under Indy's sun-dried skin, and he not going to be satisfied with digging up pottery shards for the rest of his life, especially after Sophia Hapgood shows up in Utah and tells Doctor Jones about the Russians digging near the Tower of Babel. As he soon learns, the Russians are close to uncovering the Infernal Machine, a mysterious mechanism which allows inter-dimensional travel.  Well, Indy's not one to turn down a good quest, especially when it involves ancient artifacts.  The game would be pretty damn boring if you just roped off depth grids and washed pottery shards.  Like all good action/adventure games, Indiana Jones and the Infernal Machine is full of puzzles and brain-teasers for you to solve in order to progress through the game.  While games like Tomb Raider have strayed away from the more heady conundrums in favor of ~pull this switch~ and ~find the jade monkey~ types of chores, Indiana Jones and the Infernal Machine features a wide variety of puzzles to test your logic skills.  One of my favorites in the game was a huge switching mechanism used to change tracks in the mine cart level.  There is even a lighted map in the control center that changes when you activate a new portion of the track.  Only when you figured out the entire sequence could you travel to all parts of the mine.  All said, though, none of the puzzles are too difficult, and Indiana Jones should be easy enough to complete even for novice adventure gamers.  And even if you do get stuck on a particularly difficult puzzle, you can use the in-game help to point you in the right direction.  This provides a nice balance between testing your mental aptitude and keeping you from bashing your computer into smithereens because you're stuck in the game.  In an effort to reward you for a job well done, the game does keep track of the number of hints you use.  The less help you need, the higher your Indy Quotient (IQ) is at the end of the game.  It doesn't really equate to anything in the game, but it is a nice way to compare overall results if you know others who are playing the game.    The Infernal Machine uses the Jedi Knight graphics engine, which is, unfortunately, starting to show its age.  Like every other action/adventure game out there, the natural environments still look blocky and jagged, and the character animations are mechanical and stiff.  Of course, the engine is over two years old and was built to utilize a first person perspective, while Indiana Jones uses a third person view.  This, of course, changes a lot about how the engine operates.  The good news is, as compared to other games in the genre, the Infernal Machine is at the top of the heap.  The textures look really nice and well detailed and, while blocky, the game environments display a lot more personality than the Tomb Raider series.   Speaking of environment personality, let me just say that the level design in Indiana Jones and the Infernal Machine is some of the best ever in a game of this type.  Level design is simply fantastic.  You'll travel through 17 absolutely huge levels around the globe (that includes one bonus level which you'll have to read about in our preview if you're interested in learning more about it), from the Utah canyon lands to the heights of the Tibetan mountains and through a maze that's completely underwater.  As I said before, each of the locations is absolutely huge, but there's plenty of visual variety in each to keep you from getting bored while exploring.  And, although extremely square, the natural landscapes actually make you feel like you're outside, while the indoor settings feel tighter and encapsulating.  As with every LucasArts title, special care has been taken to insure that Indiana Jones and the Infernal Machine provides a solid audio experience.  Doug Lee returns from Fate of Atlantis as the voice of Indiana Jones, and the recording is crisp and clean.  The soundtrack is by far one of the best features of the game, and you'll find your favorite tunes from the movies in the Infernal Machine.  The sequence-specific musical bits are a nice touch that really add a dramatic feel to the game, and who would expect anything less from a game starring the archaeologist that Hollywood made famous?  The only problem on the sound front was that the soundtrack and environmental effects were sparse.  It's not a big issue, but it would have been nice to have an ongoing soundtrack throughout the game (especially since the pacing can get rather slow at times), at least to keep players humming a tune in their head while they try to figure out the next puzzle.  The one big downfall if this game is the same thing that plagues every action/adventure game: a quirky control system. It just seems unnatural to play this game with a keyboard, but there are too many keys to map onto a gamepad.  Quirky controls mated with stiff, choppy animation are a recipe for disaster, especially when you're at the top of a 500 foot escarpment and have to jump to a precarious ledge to progress through the game.  You'll inevitably fall and break your neck on the last jump in a series, cursing your family and all of the saints in the process.  The motto ~save early, save often~ has never applied to a game as much as it does to the Infernal Machine.   Since you take on the persona of Indiana Jones, you can expect to use his trademark whip in a variety of situations.  Not only is it a handy weapon, but it's also makes a perfect swing to help Indy traverse precarious pits and treacherous trenches.  However, using the whip to grab onto posts and other outcroppings can prove to be a very frustrating process since you must be standing in the exact spot to get the camera to change views so you can use it.  This can eat up a lot of time since you'll be sidestepping, turning, and taking baby steps in order to find the perfect place.  I truly enjoyed most of Indiana Jones and the Infernal Machine, even though I think the control system needs a complete overhaul.  It's certainly not an original endeavor, and it won't keep Quake-addicted action fans happy for long, but it's sure to satisfy anyone who likes slower, puzzle-oriented adventures like Tomb Raider.  It's obvious that the design team was just as focused on telling an intriguing story as they were with creating an entertaining game, and they've succeeded on both fronts.  In the end, Indiana Jones and the Infernal Machine is slow and frustrating at times, but ultimately rewards you with brilliant level design and a finely crafted narrative.  -- Tal Blevins Indiana Jones and the Infernal Machine is the Tomb Raider that Nintendo 64 owners never got. It's a complex, sometimes downright difficult puzzle-filled action-adventure with beautiful visuals and a fun storyline. Thankfully, the title is also much improved over its PC predecessor. LucasArts and Factor 5 have reworked the control scheme greatly so that it's much more intuitive and fitted toward console gaming. In addition, visuals have similarly been enhanced to allow for better lighting and particle effects, not to mention a spectacular degree of texture detail for a 64-bit cart. But not everything is happy and swell. The control scheme, while definitely fixed in many ways, still bears some resemblance to its PC forefather and because of that is still on the clunky side -- slow and very familiar to those who have controlled Lara Croft in her countless adventures. This is a shortcoming that's easily dealt with, though, and in fact it's one that some gamers have even grown to enjoy if sales of Tomb Raider are any indication.The bottom line is that if you've ever found yourself even remotely interested in Tomb Raider, Indiana Jones, or puzzle-solving action-adventure games, this is the best one Nintendo 64 will ever get, and it's a fine one to have in any library. Nab it before it's too late.", "date": "Dec 7, 1999"}