{"name": "Running Wild", "name_review": "Running Wild", "ref": "https://www.ign.com/articles/1998/10/09/running-wild-2", "text": "Forget the cars, these animals want to run. But these aren't just any animals  since when did you ever see a bipedal zebra sporting a leather jacket and a stylish mohawk?  Running Wild is an on-foot racer featuring six unique characters: a zebra, elephant, ram, panda, bunny, and a bull. These upright animals have their own special abilities, so choose your persona well. There are six different tracks (two of which are hidden), and the obvious goal is to be the first across the finish line after three laps.  But it's not just about running really fast  where's the fun in that? It's all about finding secrets and utilizing powerups. Each track has its own shortcuts hidden that'll shave precious time of the clock, and there's also a load of icons that will help and hinder you. Zip strips, when run over, will increase your running speed substantially. Some items will speed you up, others will slow you down. One will even make you huge, enabling you to stomp on your opponents. Can we say Mario Kart, boys and girls?  The most exciting feature of Running Wild is its four-player support. The frame rate does take a substantial hit when there's four independent screens moving at the same time, but it's certainly playable and makes for an exciting party game.This racing game certainly has a unique look and feel, but it's a shame it doesn't control very well. Because of the very loose controls, it takes a lot to get your character running without smacking into a wall. What's worse is you have to be spot-on when running over the needed power-ups. There's really not much to the game  it's just about running really fast. The biggest problem:  it's really easy on the easy mode, but very hard in the later levels, and this makes it difficult to say that it's made for kids. It's a graphically impressive game, and it scores points for an original style as well as including a four-player mode, but that's about all I can say good about Running Wild.", "date": "Oct 9, 1998"}