{"name": "Worms: Armageddon", "name_review": "Worms Armageddon", "ref": "https://www.ign.com/articles/1999/12/07/worms-armageddon-4", "text": "Simple games rule!  I don't think I'm alone in that sentiment, what with Tetris taking up the top spot on ~Best Game Ever~ lists worldwide, Bomberman following close behind, and game's like Chu Chu Rocket receiving rave reviews from most anyone lucky enough to have played it.  These define games in the purest sense of the word, as their charm isn't based in story or character, but in actual gameplay, and they don't need crazy billion-polygon-per-second graphics engines or lighting from the heavens.  They're probably cheap productions, too - in fact, one of the best such games, Death Tank, was included as a freebie in Lobotomy's DC conversion of Quake. Worms Armageddon is the first such game to hit the US Dreamcast.  It's one of those games that you and a group of friends will start playing at around 9:00PM and won't stop until the clocks hit 3:00AM the following morning.  Along the way, you'll laugh, cry (I swear I almost cried when I dropped that dynamite onto myself for the third time), and maybe even break off into a few real-life brawls here and there.  An instant classic in multiplayer gaming?  You bet!  The game, actually a port of the PC title of the same name which was released in July of this year, takes the basic idea of the original Worms games, worm-based warfare, and adds new weapons, levels, and features.  If you've played the original titles, though, you'll be instantly familiar with what's on tap here.  You take control of a team of worms and attempt to blow the goo out of all other worms in 2D, turn-based combat.  You have available to you a group of weapons and moves, ranging from shotguns to grenades, to baseball bats and parachutes, and your goal in the end is to have one or more of your boys be the last worms standing.  It's fun . . . trust me!  Once you get past the initial humor value found in the antics, voices, and animation of the individual worms, you'll find lot of strategy to be had as you go about determining how exactly you can best deal death to the enemy worms.  That's not to say that only tech-heads need apply hear, though, as the strategy is simple and easy to come to grips with.  And even if you can't quite get the hang of things, that's all the better, as the real fun of Worms Armageddon comes about when people make careless mistakes rooted in human error.  Screwing up an attempt at firing dynamite (We were all in hysterics after my third try!), and tossing a grenade and having it bounce off a wall right back at you, are two examples that come to mind, but there are so many possibilities to the game that you could play day and night and still be surprised.  A friend of mine launched a sheep in the hopes of collecting some items.  The sheep pranced back and forth around the screen, never managing to actually come into contact with any item boxes, and as my was friend was about to throw his controller down in frustration, BAM!  The sheep exploded, striking three worms in its wake.  One of the worms died, resulting, as with all worm deaths, in a massive explosion, which knocked the other two worms into the water, ending their lives, and ending the game for one unlucky player.  Who would have thought that this sheep, who's purpose initially was to collect items, would wind up taking out three opponents?  This form of occurrence is commonplace in Worms Armageddon, though, and it will keep you coming back for more.  You can play up to four players, with each player controlling one team.  Thankfully, you don't need four controllers, as the game can be played with one controller, with each player switching off.  Unfortunately, this is the only way to play the game.  You aren't given the option of using multiple controllers, a feature that would have been welcomed.  So, Worms Armageddon is a brilliant multiplayer game, but does it fare well in single player mode?  Sadly, the answer is a firm no.  The single player mode allows for you to battle against a computer controlled team or take part in a series of missions, but both have problems.  The actual missions, which require you to complete various tasks with your worms are quite enjoyable, but the experience is ruined somewhat by severe load times, something that should have been cleaned up before the final release.  If you have patience enough to endure a game where you're watching a loading screen as much as you're actually playing the game, though, then you may find some fun here.  The problem with battling against a computer is, sadly, rooted in the nature of the game itself.  A CPU opponent just isn't any fun, as the CPU seems to either hit its target exactly, or do the very opposite by completely screwing up.  Furthermore, the CPU takes far too long to actually make its moves.  You may be tempted to turn off the console while waiting for the CPU to decide a move.  This is actually a big problem with the PlayStation version of the game, apparently, but it seems that the DC should be able to think a bit faster . . . that is Sega's slogan for the system, afterall, isn't it.  But, then again, just as Mario and Sonic do fine as single player games, Worms Armageddon does fine as a multi player game.  You'll have countless nights of fun in two, three, or four player mode.  The weak single player mode, unfortunately, forces me to make the following suggestion.  If you have a group of friends, make sure that one of you, and only one of you, has a copy of this game.  -- Anoop Gantayat, IGNDC", "date": "Dec 7, 1999"}