{"name": "Test Drive 5", "name_review": "Test Drive 5", "ref": "https://www.ign.com/articles/1998/10/09/test-drive-5-2", "text": "This age-old series just keeps chugging along. This time it's got a little competition by the name of Gran Turismo, and you can see the designers eye-balling that racer when they went to work on this sequel. Test Drive 5 features a massive load of licensed vehicles from Dodge (Viper), Chevrolet (Camaro, Corvette), Aston Martin (Vantage), and Jaguar (XKR). There's also a few muscle cars for those who love the power of the late '60s and early '70s, like the Dodge Charger, Chevrolet Chevette, and the massive Pontiac GTO. There's more than 40 cars, some of which are hidden.  As for courses, Test Drive 5 includes 18 tracks, some of which are point-to-point races through locations such as Moscow, Hawaii, North Carolina, Japan, Scotland, and Australia. There's also a few circuit tracks as well, located in places such as Jamaica, Italy, and England.  The 3D engine has been tweaked from last year, giving the cars more detailed highlighting through reflective environment mapping. There's now alternate paths in most of the courses  though you're still forced down the road, the track will fork in places, letting the player see more of the sights as well as increasing the replay value of the game. The developers also worked on the physics to make each car react as they would in real life. Gran Turismo this isn't, but Test Drive 5 has evolved quite substantially over the years. The graphics engine is very smooth, very crisp, and very fast. My major complaint is, though the physics of the cars on the road are pretty accurate (as far as I can tell, anyway), when these cars take to the air, either by a jump or crash, it's like the tires are filled with pure helium. I mean, they float worse than the cars in San Francisco Rush!The controls are a little on the touchy side, but thankfully you can adjust the sensitivity in the game's option screen. It's also very difficult to discern at a distance who's a computer opponent and who's simply an innocent jam car. And if you flip the car facing the wrong direction, you'll be placed back on the track facing the wrong direction. Super annoying.Variety is the name of this game, and with all the cars and tracks available in Test Drive 5, you'll be playing it for quite some time. I'd still rather play Gran Turismo because of the better graphics, faster speed, and overall playability,  but  Test Drive 5 is a good alternative for those looking for something else.", "date": "Oct 9, 1998"}