{"name": "Demon Stone", "name_review": "Forgotten Realms: Demon Stone", "ref": "https://www.ign.com/articles/2004/09/16/forgotten-realms-demon-stone-3", "text": "Atari's latest ode to the alternative Dungeons & Dragons universe known as Forgotten Realms: Demon Stone certainly has a lot going for it. Not only is it developed by the same team responsible for the original Two Towers Lord of the Rings game by Electronic Arts, it also boasts some of the most powerful production values we've seen for quite some time. Scripted by the legendary Forgotten Realms author, R.A. Salvatore (of Icewind Dale fame) and voiced by Patrick Stewart (Star Trek: The Next Generation, X-Men), it's already blessed with a better pedigree than that god awful Marlon Wayans D&D movie from a few years back.   Presented as an old-fashioned buddy story done in a fantastical setting, Demon Stone tells the tale of three distinctly different heroes who have banded together to fight a common foe. Rannek the Fighter, for example, is trying desperately to escape the sorrowful memory of his destroyed village, while Illius the Sorcerer found himself overly compelled to travel to Damara after being disowned by his family because of his choice to peruse spellcraft. The most interesting character of them all, however, would have to be the Rogue known as Zhai. Headstrong, badass, and sarcastic, she's a half Elf/Half-Drow whirlwind of one-liners that keeps the dialogue between the trio fresh, funny, and motivating.   The whole reason that these heroes come together in the first place is thanks to the return of two deadly enemies from a century ago. Powerful leaders from two opposing demonic armies, Githyanki General Sereka and Slaad Lord Ygorl, were the only things that kept each other from taking over the world of Faerun for years. Without rest, the two malevolent forces did battle with one another to earn the right of invading the human realm for their own diabolical purposes. Luckily for the non-demon folk, the traveling wizard known as Picard... err... make that Blackstaff, stumbled upon the duo while in a forest and sealed them up in a magical Demon Stone for the world's protection. Without a winner in their eternal battle, neither could invade the land and therefore humanity would be safe.   Click For More Images Over a hundred years pass by, and as these things often turn out, our trio of heroes accidentally frees the evil pair of uglies shortly after their fated meeting. Determined to set things right again, and strangely compelled by an unknown force, Rannek, Zhai, and Illius begin their journey to put a stop to the world's biggest mistake and make a pact to seal them back into the Demon Stone forever. It's almost RPG-like isn't it?   Veterans of The Two Towers and Return of the King should recognize Demon Stone's gameplay right out of the gate -- it's definitely not an RPG. Though it does feature a few likeminded elements to that genre scattered throughout the experience here and there, Forgotten Realms is at its heart an identical game to the aforementioned EA Lord of the Rings titles. In the land of Faerun, it's all about action, action, and more action.   Yet despite its list of familiar ideas when compared to The Two Towers and Return of the King (namely its hack 'n slash combat, upgradeable characters, and cinematic presentation) Demon Stone still aims to take a few steps forward in a progressive direction.    The most obvious improvement is the need to switch between the three characters on the fly and to use them as a team. Done with a tap of the digital pad, cycling through your allies is as easy as it sounds, and each one presents a unique approach to advancing. Rannek, for instance, is the best all around character to use because the man is a biological tank that thrives on carving up his enemies. He's perfect for close-up fights and can be extremely helpful when swarmed. Illius, on the other hand, is the ideal distance fighter -- with projectile attacks and protection spells that can do a lot of good in the later levels (and he's absolutely essential to defeat the Queen Spider boss). Finally you have Zhai, who is the in-between character best left for stealthier missions or desperation attacks. And while she may be the most interesting character to watch and listen to, she's probably the least useful in combat.    That doesn't mean that she isn't useful in other ways, however, as Zhai has a couple of unique abilities to master should you want to find some of the game's hidden secrets. Since she's the only character in Demon Stone that can jump, for example, she can find hidden platforms and discover secret treasure chests that have additional money or bonus unlockables. That's easily her primary benefit. Of course, Zhai can also walk over special ~darkness patches~ so that she can become invisible too. This proves to be very helpful for pulling off stealth kills in less populated areas or to cut down on damage when going into boss fights. Rannek and Illius have their own special techniques as well (the ability to smash objects or blow them up with magical bombs), but unfortunately these powers are nearly identical to each other and just aren't as cool to use as Zhai's.    However, those individual abilities are just the side aspects of the gameplay, as the player's main focus will be simply to survive. Following the trend of Atari's last action game -- Terminator 3: The Redemption -- Demon Stone offers a higher than usual difficulty curve, which will probably earn it a lot of brownie points in the eyes of veteran gamers. Even on the easiest setting, the last three or four stages in particular will really test your constitution, and force gamers into realizing that they'll need to switch between characters if they want to succeed.   It's this asset of Forgotten Realms that I really admired most, as all too often, a lineup of extra characters is good for little more than eye candy; and a means to break up the monotony of playing with the same dude over and over again. But here, you'll need to make smart decisions in various situations -- like using your rogue to fend off the seemingly endless wave of monsters while your sorcerer uses his projectile attacks to defeat nuisances in the distance. All the while, you'll need to send your fighter up against a more difficult enemy so that he can slash his brains out -- making sure to pay attention to the rest of the team so they can accomplish their goals.   Click For More Images Sadly Demon Stone runs into a few key problems that overshadows the strategy of using multiple team members. Most importantly, the artificial intelligence of your allies is severely underdeveloped and, for the most part, pacifistic. While players are in control of their main character, the other two seem to do just enough to keep their opponents off their backs and not much else. It would have been a lot more helpful if there was some kind of option to allow the player to set behavior scripts for characters they aren't in direct control of (like those of most tactical shooters or RPGs like .hack and Final Fantasy XII). That way you wouldn't have to constantly baby-sit your buddies in the heat of a battle. Because this option isn't available, we're left hoping that the AI does what it's supposed to do.   Another key issue is the importance of your attacks, as there doesn't seem to be much encouragement for mixing it up. When upgraded as far as they can go, each character has a moderate amount of maneuvers that utilize a range of different button sequences. But truthfully, most of them aren't even needed, as simply pressing X-X-X is enough to gain you the victories you need in a melee. In fact, almost every enemy we faced was taken out with two or three 'Triple X' combos every time, with little need to diversify our technique in combat.    It was great when we were finally forced to mix it up in Chapter Seven against the Ice Trolls -- which is probably the best overall level -- but once Chapter Eight began, it was back to our old tricks again and the same repetitive mechanic took over. The best hack 'n slash or beat 'em up games always encourage the player to diversify their bag of tricks in order to survive; but why bother to do so if you don't have to? You're just making things harder on yourself for the sake of doing something different, and where's the fun in that?    Of course, the biggest oversight of them all is the fact that Demon Stone has no co-op play whatsoever. It's really quite strange, as a game like this is just begging for it. Even more baffling is that Stormfront's last combat title -- The Two Towers -- was well received by our readers in 2002 with one major caveat: the lack of some kind of multiplayer mode. And that's why I'm surprised to see that the team didn't remember that very vocal feedback and implement it into Forgotten Realms, as the inclusion of a two-player mode and Internet play is what made Return of the King such a strong sequel to Two Towers late last year.    Demon Stone does make up for its gameplay shortcomings in other areas, though -- most notably with its presentational aspects mentioned earlier. The artists here have done a terrific job at capturing the Forgotten Realms universe in a realistic 3D space, and have really helped to create a truly beautiful looking game. Shadows, lighting effects, animations, and textures are all top of the line, with an extremely diverse use of color and environment types that are much better than what we saw in The Two Towers. Admittedly, there is some occasional slowdown here and there (mostly in a few crowded areas from Chapter Seven onward), and the fact that we can't control the camera ourselves is a bit bothersome. Even so, the overall look of Demon Stone is fantastic.   The audio is almost as strong; with a soundtrack that ranks right up there with the best of the year (think a Lord of the Rings inspiration minus the Celtic instruments and you'll get the basic idea), while the vocal work performed by Patrick Stewart, Michael Clarke Duncan, and the rest of the supporting cast is all top notch. Our only issue here is the sound effects -- which seem to be drowned out by the music and voices and come across a little muted. Overall, though, everything sounds quite nice.It's no stretch of the imagination to say that Forgotten Realms: Demon Stone is one of the best-presented games this year. Its high-end production values, talented voice-over crew, and beautiful fantasy visuals provide an epic cinematic experience that will likely hook fans of the books and tabletop games. In fact, it's one of those rare pieces of software that can make up for its gameplay mishaps because of its strong visceral appeal, joining the ranks of games like Luigi's Mansion, The Getaway, and Clock Tower 3.But that doesn't change the fact that Demon Stone still gets rather repetitive, and can often be frustrating because of the poor decision making of your AI colleagues. Battles seem to last twice as long as they're supposed to, simply because your human-controlled character has to do the work of three more often than not. And finally, the lack of multiplayer really hurts its long-term replayability. A two-player mode in this game would have been a blast.Yet strangely, Demon Stone can still be disturbingly addictive in its own quirky way -- much like the other games we mentioned above. That's the beauty of having a strong story and powerful aesthetics; it can make the tedium of repetitive gameplay more tolerable. Hopefully, though, we'll get to see a sequel to Demon Stone somewhere down the line, because with the right adjustments made in the appropriate areas (and you know what those are by now), it could really be something special. We'll see what happens.", "date": "Sep 16, 2004"}