{"name": "Donkey Konga", "name_review": "Donkey Konga", "ref": "https://www.ign.com/articles/2004/09/24/donkey-konga-4", "text": "In the past, video games requiring any kind of physical exertion have either tanked or sold remarkably well. Just look at Alpine Racer and Top Skater. Both games siphoned mounds of quarters from the pockets of hapless gamers. But for some of the best examples, take a look at Japan. Its arcades brim with all manners of manual oddities.   Just look at Taiko no Tatsujin (Taiko Drum Master,) where players bang away at large drums to popular tunes. Better still, look at Inu no Osanpo (Walk the Dog,) a dog walking ~simulator~ combining a treadmill and fake puppy. Where does this place Donkey Konga? Well, this rhythmic collaboration from Nintendo and Namco fits in the slot currently occupied solely by Konami's Dance Dance Revolution series. Both titles look as though they barely escaped the clutches of a Japanese arcade.   No one could have predicted the success of the DDR series in the US. And while Donkey Konga may not achieve the same level of success, either critically or commercially, one thing's for sure: Konga delivers the goods. It may be simple. It may be short. But what it lacks in ~extras~ and depth it makes up in pure fun.  For the uninitiated (or just plain curious), Konga bases its gameplay on rhythm. The game package comes packed with a controller resembling a miniature set of bongo drums. Essentially, players need to match the beats displayed on-screen for each of the game's 30+ musical numbers. Konga represents each on-screen ~beat~ as either a red half-circle, correlating with the right bongo or yellow half-circle, which correlates with the left bongo.    A pink full-circle requires you to beat both drums simultaneously. A colored bar (pink, red or yellow) calls for rapid tapping of the appropriate bongo. The last control option, represented by a light-blue explosion symbol, means a player will need to clap. The controller features a small sensor on the top, capable of picking up sharp sounds. Of course, snapping, coughing or tapping the sides of the controller register as ~clapping.~ And that's it regarding control. Depending on what time you strike the controller, you earn one of four possible scores: Bad, Great, Miss or Ok. The interface records each ~hit~ on the top of the screen.   A collection of such beats make up any given song, with a number of selections achieving more than 200 beats. While that may sound pretty arbitrary, it makes the game wildly difficult during later levels, where gamers need to memorize notes to clear given stages. Absolute madness. But we'll save all that brain-heavy stuff for a little later in the review.  The Facts  Play along with your favorite tunes using the all-new DK Bongo controller.  Over 30 songs, ranging from classic Nintendo tunes to popculture hits. Simple controls incorporate drumming and clapping.  Connect up to four DK Bongos for multiplayer jam sessions. Clear stages to purchase several mini-games and song arrangements.  Memorize notes and play the game in special ~jam~ sessions for advanced players. 1 Bongo Controller included in game package.    We'll stick with the simple stuff for now. Konga splits into six basic game modes, the most basic of which is ~Street Performance,~ where gamers simply pick a song and drum away to earn gold coins. This mode breaks into two different sub-categories: one letting you choose difficulty by selecting Monkey, Chimp or Gorilla, with Monkey being the easiest and Gorilla being the hardest. The other mode contains Monkey Jam, Chimp Jam and Gorilla Jam. These ~Jam~ modes feature the same songs as in the regular modes, only in Jam you don't see any beats.       In their place sit ambiguous barrels, meaning the only way you can clear stages in ~Jam~ mode is to master each song in regular mode and memorize all the notes. Obviously, gamers who stock their medicine cabinets with Ginko Biloba and other memory supplements needn't bother with ~Jam~ mode. Unless of course you want to test the limits of your patience.   It's frustrating. Very frustrating. There's a strong possibility most gamers will tear apart their controllers long before the completion of most songs. As far as bragging rights go, well, there aren't many worth mentioning. Unless you consider praise from other Konga addicts as particularly satisfying. Jam Mode is just one of those things only true Konga nuts could appreciate.  Stick to the normal modes (Monkey, Chimp and Gorilla) under ~Street Performance,~ and you should be just fine. Selecting any of three difficulty settings takes you to the song selection screen. Each song title has been engraved on a wooden plank with a specific number of bongos on the upper right-hand corner. Depending on the number bongos, the song will either feature an easy string of beats or a maddening melody requiring rapid-fire thwacks to the controller.     Just like any other melodic game, the outcome of Donkey Konga's fate in the marketplace will depend on its selection of tunes. While the selection may not be the absolute best, it gets the job done by offering a wide selection of tunes ranging from ridiculously easy to moderately challenging.   For the rhythmically challenged, the game offers a tweaked version of Queen's ~We Will Rock You~ and Willie Nelson's ~On the Road Again.~ You can also drum along to remixed versions of ~Happy Birthday to You~ known as ~Ditty's Ditties~ in the Konga universe, and Drew Allen's ~Right Here, Right Now.~    Konga aficionados can tackle ~All the Small Things~ by Blink-182 and ~Louie, Louie~ by Richard Berry. With a total of 33 songs, Donkey Konga provides enough songs to entertain a gaggle of party-goers for hours on end. Of course, the single-player experience suffers a bit. Fans of any particular genre may feel disappointed by the game's lack of musical focus. Still, this is a Donkey Kong game and not a member of the dance-happy DDR family.    Having said that, the game could have used a greater variety of songs, not to mention more of them. While 30 tunes may suffice for awhile, each eventually wears out. And after mastering each tune, which shouldn't take long for the average gamer, there is very little reason to play. You can always bust out the old bongos during a party, but the lack of a longer, more varied song roster make the single-player portion of Konga quite short.  Also, it's worth mentioning that none of the original artists performed their songs for the game. Music buffs may find this a little offensive. Fortunately, the original Nintendo songs included in the game sound great. While it may seem strange drumming to the ~Mario Bros. Theme~ and ~The Legend of Zelda Theme,~ you won't deny that each song still holds that special something that's made each so memorable. Of course, the game includes both the ~DK Rap~ from Super Smash Bros. Melee and the Donkey Konga theme, and they both rock.      Construction of the bongo controller feels sturdy enough; dropping a pair won't send tiny pieces of bongo flying around your living room. Of course, they still feel like what they are: small plastic bongos. Unlike the standard Cube controller, using these babies as projectiles will most certainly result in irreparable bongo-damage. And costing 30 clams to replace, you may want to keep them on your lap. The package does include a pair at the MSRP of $49.99, but you'll need to fork over serious funds for multiplayer action.      And multiplayer is definitely where Konga shines best. After all, drumming in a darkened room all by your lonesome may be fun enough, but nothing beats four friends (or complete strangers) frantically wailing on mini-bongos. The first of three multiplayer modes is called ~Challenge,~ which uses every song in the game in a type of jungle marathon.   The player who clears the most stages in succession wins. Challenge works best with a drumming partner well-versed in the way of the bongo. Where skilled players make for lengthy bouts of drumming goodness, those lacking experience will quickly give up, negating much of the appeal.  The bulk of Konga's appeal resides in ~Battle~ mode. Here, players simply choose a song from the list and duke it out. What's more, multiplayer employs special beats. For example, a ~POW~ block reduces your opponents score when triggered by hitting the bongos. Unlike normal beats, requiring a player to perform a specific action, ~POW~ blocks react to anything. The inclusion of such blocks adds a nice little jolt to the game for novice and advanced players.  While Konga suffers from a lack hidden tracks, you can take coins accumulated in ~Street Performance~ mode and use them in ~DK Town.~ The town is just a menu, not a real town with huts and coconuts, although that would have been pretty cool. You can purchase harder versions of each song through ~Jungle Jams,~ chance controller settings (including mic sensitivity) through the ~Electric Hut,~ and buy mini-games in the ~Monkey Shines~ shop. You can also pick up different sound sets in ~Bongos A-Go-Go~ and check out record scores in the ~Hall of Records.~    Unfortunately, the mini-games don't add much to the overall experience. To be fair, they dish out a little fun. Each varies the rhythmic drumming of the single and multiplayer modes, but not by much You'll get to slam King K.Rool in a ~Whack-a-Mole~ style game and catch falling bananas in ~Banana Juggle,~ to name a few. Again, they're fun, but you'll just want to get back to drumming.   Konga's graphics mirror its simple play mechanics. Much of the animation looks as though it could have been ripped from a N64 title, and the backgrounds are static images of palm trees, caves, etc. Menus look equally plain. Cycling through songs is as unexciting as this game gets. Although some stages feature rain and other minor environmental effects, there is a near total lack of special effects in the game. But it's hard to criticize such an aural experience for its lack of visual pizzazz. Once you start drumming, you only need to see the beats; nothing else really matters. Donkey Konga packs hours of fun. Its a good single-player experience and a great multiplayer one. If you can round up four buddies and four bongo controllers, youre set for the evening. All thats missing in a room with this game (and four bongos) is booze and a bowl of Tostitos. A somewhat limited song selection is the only thing keeping the multiplayer aspect from being the greatest thing EVAR, so to speak. The graphics, while bland and lacking several layers of polish, get the job done without causing too much of an eye-sore. The mini-games offer a little fun, but your best still sits in Kongos primary game modes.", "date": "Sep 24, 2004"}