{"name": "Tiger Woods 2005", "name_review": "Tiger Woods PGA Tour 2005", "ref": "https://www.ign.com/articles/2004/09/27/tiger-woods-pga-tour-2005", "text": "Fans definitely got their money's worth with Tiger Woods PGA Tour 2004. Whether they opted for the sim-oriented PC version or the slightly more arcade-like approach of the console version, Tiger was a big hit across the board last year. While EA's policy of yearly iterations may seem more palatable in sports where rosters change and mechanics are freely reinvented, the esteemed PC golf series has to find other reasons to bring players back year to year. Tiger Woods PGA Tour 2005 may not necessarily have owners of 2004 lining up outside of the stores but there are more than enough features and enough content here to make it the game to own for PC golf fans.  Rather than changing the gameplay, the team at EA have maintained the more sim-like approach that separates this title from its console counterparts. A host of new customization options let you create your own golfing persona, complete with performance statistics you can upgrade through play while new challenges and lessons can be found all throughout the game at a variety of skill levels. If you're completely new, the game takes your hand and leads you through a variety of skills you'll need to learn. If you're an old hand, the game offers some massive challenges.  At the heart of the game is the TrueSwing mechanic. This system uses mouse movements to simulate the golf swing and it really allows for a level of fine control that you just don't get in the two- or three-click systems that many of us grew up with. Assuming you're using the vertical method of TrueSwing, you simply pull the mouse back for the backswing and push it forward to connect with the ball. (The horizontal method works the same but seems less natural as you're moving the mouse left and right instead.) There are all sorts of nuances here and you can put fade, draw, hook or slice action on the ball if you divert too far from the line of your swing.   No golfer starts off perfect, of course, and an instant analyzer provides feedback on how you're swinging. You can add more power by drawing the mouse back even further and you get better drives if, on the downswing, the mouse hits the spot where you began the backswing. Tempo and angle analysis also lets you know if you're going too far to the left or right or waiting too long at the top of your backswing. By making adjustments based on the analyzer, you can find your shots improving hole to hole. Fans of the more relaxed approach may be disappointed that the PC version of the game doesn't allow you to cheat with the consoles' ~Tiger Vision~ feature. About the most help you get here is the small grid overlay that shows the slope of the green.  It seems like every game in the world is now using some kind of outrageously flexible face and body creation tool. The one in Tiger Woods PGA Tour 2005 is plenty good. While it's not quite up to the level of the one we saw in The Sims 2, there are still a seemingly endless array of sliders that let you get just the right brow height and chin texture you need to recreate virtually any face, from your own weathered and worried countenance to the wide-eyes and trusting smile of an EA PR intern. With that said, I find it odd that there's not a single hairstyle in the IGN office that's represented in the game. Come on, EA; ducktails and tonsures never go out of style. And they look especially hot together.  Sue me, I think tonsures are cool.      A variety of game modes let you pick the way you want to play, either in one-off pick up games or in more lengthy tournament play. In place of the World Tour of last year's version (which was the Tiger Challenge in the 2003 version on the consoles), this time around we have the Legends Tour. You progress through a variety of scenarios, picking and choosing which matches to play, until you take out the biggest names in golfing, from Palmer to the mighty Woods-man himself. To help you reach a level where you can compete with these greats, you can even take on a few lessons or try out your own Tiger Proofed courses.  Despite the prevalence of these modes (and your own asocial attitude which, by the way, will never make people like you more) there are times when you'll want to try the game online. This time, thankfully, you can do it for free. You can even bring your own golfer online with you to compete in the various tournaments and one-off games. Private clubs even allow you to act all exclusive, just like the real golf clubs do.  If you find the courses too easy, the game also features the all-new Tiger Proofing mode. If you earn enough Legend coins during the game, you can spend them to make some of the courses even more difficult. (It doesn't seem like much of a reward to me but then I'm not the brand manager for an award-winning golf franchise.) Tiger Proofing enables you to up the difficulty of a course by tightening up the good lies and expanding the hazards. While it makes a nice way to test your Zen-like patience, it also makes the course much more challenging for the game's ace golfers. Presumably this will eventually include you.   Considering the range of courses and players here, the visuals are simply stunning. Each environment is convincingly real and the small ambient animations each player has show that developers can do more than just analyze golf swings. Hell, even the fans look good this time around. I did notice some odd glitches during as the camera followed the ball in flight. White lines would sometimes tear across the screen and certain objects in the environment seemed to phase in and out at random.  Keeping with the quality of the graphics, the sound is also excellent. The commentaries are spot on, even if they do get a bit repetitive after a while, and I really appreciate the voiceover advice that the game throws out. The actual world sounds are just as nice, from the sound of your club cutting through the high grass, to the customary golf fan cheer that follows on a particularly well played shot. Like I said, owners of last year's versions don't necessarily need to rush right out and buy the updated version. Tiger Woods PGA Tour 2005 comes with plenty of new options but there's nothing here to make last year's version obsolete. Nevertheless, hardcore fans will definitely profit from the additions made here and gamers new to the series will find that 2005 will likely last them a long, long time. At the very least, it's more update-proof than last year's. Without the added challenge of the new modes and the customization options, this latest edition would simply seem redundant. If you're already happy with Tiger Woods PGA Tour 2004, but find yourself craving an bit more challenge, then the 2005 version will totally fit the bill. If you're not as accomplished at PC golf or are simply more used to the console versions' more relaxed controls, you'll find that the game has many options to help ease the transition to the more sim-focused gameplay on the PC.", "date": "Sep 27, 2004"}