{"name": "Evil Genius", "name_review": "Evil Genius Review", "ref": "https://www.ign.com/articles/2004/09/29/evil-genius-review", "text": "After Elixir's somewhat serious Republic: The Revolution comes Evil Genius, a tonge-in-cheek 1960's flavored spoof on James Bond (Sean Connery era, that is) villians allowing players to build and maintain an evil empire by establishing a lair, sending out minions to perform sinister deeds and eventually take control of the underworld. From the start, Elixir sets the mood with a cheeky intro movie, campy spy music, funny menu screens and a set of wonderful tutorials narrated by a foxy sounding English woman who explains the 'ins and outs' of how to play. Instantly, most players will begin to feel a strong vibe for the game. Evil Genius is presented very well -- but how does it actually play?  The first thing your aspiring Evil Genius does is estabilish his top secret island underground lair. The construction process is fairly simple; using the mouse as a tool, you carve out passageways in a mountain which cost a certain amount of cash per square unit then fill in the rooms. Each room in your base fills a certain need -- barracks for housing your workers, a control center to keep an eye on the rest of the world to recreation centers to keep the troops happy, etc. As you progress, new options unlock enabling you to build more. Ergonomic contruction is key, as not only do large rooms and broad hallways cost large amounts of money, but they are harder to defend against snooping agents looking to gather evidence and / or sabotage your base. Installing clever traps is the primary defense against the prying eyes of goodness, which range from simple doors, to security cameras, sirens, dummies, explosives, gas chambers and oh much more. Dare I say robotic sharks with laser guns on their head swimming in a pit of lava around your inner sanctum? Okay, maybe not -- but you get the idea.   To pay for such a lavish top secret island underground lair you sent out 'away teams' which can either steal, go on the lamb, or look to uncover acts of infamy which raise your notoriety among your peers and the law enforcement community. The various classes of minions all serve certain roles on these away teams: The military minions and henchmen are the best at bringing in the cash, while the social minion keeps the heat off them. Once an area gets over-exploited, the agents of goodness step in to stop your lackies, so it's a good idea not to wear out your welcome in one region for too long. Scientists are key to help uncover acts of infamy, which once performed, will allow you to capture NPCs, bring them back to your base for interrogation to unlock new toons and do more stuff. Different areas in the world are worth more money per day stealing, like Europe, Japan, Hong Kong, the oil rich Middle Eastern States and parts of the US and other wealthy regions. They seem to be the best policed also. Balancing your minion population between your lair and abroad is one of the more challenging aspects of the game. With a constant flow of snooping do-gooders on your island trying to infiltrate your base, you can't really sent out a huge percentage of your workforce to farm resources, or they come back to a gutted out fire-charred base. On the flip-side,  if you keep everyone at home you can't afford the really nice amenities a ~lavish top secret island underground lair~ should offer a person of your evilness deserves, so a balance needs to be struck.   Henchmen are the only characters in the game which you can directly control, and are some of the better base defenders as you can actively move them around in real-time to kill or capture intruders. Minions, on the other hand, will just walk merrily around performing their every day tasks oblivious to any danger until you set the alarm. Then, they run to get weapons or try to subdue the threat in hand-to-hand combat. While I can appreciate the minion's dedication to perform the job at hand, the lack of control over them is one of the major drawbacks in the game. From a gameplay perspective, the lack of control and overall bad AI of your minions is extremely frustrating. Especially when they keep walking into the traps which enemy agents set off, killing them off lemming style. I've had better luck trying to herd cats...    Visually, the game is a bit blocky for my taste, but for a sim the graphics really aren't that bad. You can pan the camera around, zoom in and out on your minions to observe them, and the art style is rather nice. The frame rates can become a bit clunky with so many minions on screen at once  and I did have some crash issues, but overall it wasn't too bad. Nothing a patch or two can't fix. In the end, Evil Genius is a fun, yet frustrating game. Fun in how it's presented, frustrating in the lack of direct control you have.    Scoring:  Audio - 8  Gameplay - 7    Graphics - 8  Presentation - 9   Stability - 7  Overall Score - 7.8/10 (Good) Evil Genius is carried by presentation. The art is witty and very detailed. Animations are wonderfully diverse, humorous and skilled. Music and sound are extremely good throughout. And the ideas behind the game are something that I can sit down and take a meaty bite out of. Unfortunately, the gameplay doesn't hold up to it's end of the bargain. Had there been more interactivity with during acts of infamy on the World Domination Map, less micromanagement for taking care of enemies, more information passing between the map and the base screens, and more useful information about why things happened the way they did, Evil Genius really could have been genius... but in a good way.", "date": "Sep 29, 2004"}