{"name": "Vietcong: Purple Haze", "name_review": "VietCong: Purple Haze", "ref": "https://www.ign.com/articles/2004/10/01/vietcong-purple-haze", "text": "As the Vietnam shooter ~wars~ finally crystallize game by game, our worries have proven true: So far, none of them are worth your hard-earned money. VietCong: Purple Haze proves to be an under-par, run of the mill first-person shooter providing gamers with the vantage points of a semi-functional squad, a few excellent hand-picked tunes from the era, and, for the PlayStation 2, no online capabilities. If you want a good, solid Vietnam shooter for the PlayStation 2, you may just be out of luck.   Gameplay  Developed on PlayStation 2 by Coyote Developments (Die Hard Vendetta, Zoocube) VietCong: Purple Haze is as awkward as it is dull, and as ordinary in design as it is uninspired in effect. Many things could be presented better, ranging from the simplest of things to the most obvious ones: From handling bombs to managing your team to disengaging trip wires. Your men bump into each other regularly, or forget their commands too quickly, or they get stuck on a tree branch, or behind a rock.   As an FPS with a semi-working squad, VietCong: Purple Haze functions relatively well, but it's clumsy and slow. You start out as a soldier with little personality who's dropped in and out of hot areas of the Vietnam jungles, enabling you to experience a swell of level types from stealth and attack to rescue, track and destroy, and more. You can jump into a Quick Fight, start a Single-Player Campaign or...well, that's it. On the Xbox and PC, you could jump online, but on the PS2, those modes were nixed. The title's core mode is, of course, the Single-Player Campaign, wherein, after each successful mission, you'll open up new weapons and missions for other modes.   It's all real pretty when nothing much is moving. As far as the controls work, the game offers quick drop, crouch, and prone positions, as well as jump and lean. The lean function is OK, and the jump button is rather clumsy, as collision detection isn't worked out with much polish or precision. The range of squad commands is broad, but actually commanding them is very awkward. You'll hit two buttons to pull up commands, then using icons, you tell them to attack, disperse, stop or follow. You'll have to pick a command and then tell that specific character to take the action. There are two levels of commands, but the weakness here is that when you just want them to do something as a group, it takes far longer and far more work than necessary. After playing a little Rainbow Six 3 (even the PS2 version), this experience is quite painful. In one level, I simply wanted my team to stay clear of the enemy Howitzer, but it took far too long just to get them clear of the thing, and they aren't smart enough on their own to recognize when a nearby bomb will blow. They also bump into each other, get stuck on objects, and will not always complete their tasks.     Though not horrible, the controls are cumbersome and slow. I found myself getting caught on all sorts of objects, stuck in between trees, and when caught in enemy fire, finding myself trying desperately to turn around and run for cover, but everything from simply turning around to actually running takes so much time. It's not like the game is non-functional, and I passed through numerous levels without dying. The issue is that all these little things add up and detract enough to notice and grumble about.    Play TimeSplitters 2, Half-Life, or even James Bond: Everything or Nothing and then play this, and it's all very clear. The framerate is relatively stable at 30 FPS, though it often dips without any clear reason. And the game is not badly polished (there are issues such as anti-aliasing, animation flaws, and some in-game cutscene glitches), and on their own, they're so bad. But added up, all of these little things quickly result in sucking the modicum of fun out of VietCong: Purple Haze before you'll get very far.    While it's cool that there are different types of characters in your squad, your medic and radioman are annoying and they may actually get you killed. You might be walking forward and accidentally be near the medic and suddenly you're being stitched. You might actually be in enemy's range, and being stitched simultaneously. Not so smart.   Although you can command your point man to lead the squad, this tactic turns out to be A) boring, B) slow, and C) inconclusive. Also, almost all of the levels are forested hallways anyway, so 90% of the time it's not like you have a second or third branch to follow. It's faster to blow up at each trip wire and start over than to wait for your point man to pussyfoot around. Plus, he's apparently got a short attention span. He'll actually forget his command, and be wandering around for minutes before you realize you'll have to repeat the command.    Also, the team might take minutes before catching up with you. In a game that's actually slow paced, due to traps and Punjis, waiting for your team is surprisingly sleep-inducing. Of course, you can skip the radio communication, and you can avoid the medic, and it's better that the squad moves slower than faster because of the level's traps, but functionally, squad AI and pacing have been handled better in many other games.     Enemy AI doesn't hold up well either. You can disintegrate their wire traps and just around the leafy corner, just 30 feet away, they'll be completely oblivious of your loud thrashing sounds. It's as if their ears are filled with cotton. They run slowly from cover to cover, and they often look down at their feet while shooting at you. Heck, they shoot you while their large rice hats are covering their faces. Because the collision detection is a little out of whack, you'll often see them jumping six feet straight up in the air as they ~climb~ an obstacle in their way. You'll also shoot enemies with three to four bullets to the chest, and they might still recover and run away, anyway. No wonder it was so hard to win the Vietnam War. And, as an added bummer, opposed to the slightly tighter analog controls on Xbox, the spongier PS2 controller actually hinder precise aiming.   Still, VietCong: Purple Haze does some things pretty well. For instance, the placement of wire traps is excellent. Each one is well hidden, and each one is marked beforehand, so if you're paying attention, you won't instantly blow up. When you shoot them, you'll hear a loud ringing, etching a little more realism into your brain. The PS2 textures are detailed enough and texture resolution when up close is clear and clean. The PS2 version has a softr edge to it, producing a strange rosy effect that's pretty but perhaps not so realistic for the jungles of Vietnam.    Sadly, there is no online play, no cooperative play nor any split-screen matches, so don't get excited about any kidn of multiplayer action.   Graphics and Sound  Take-Two's first-person shooter is not a bad-looking game, and while it's generally a run-of-the-mill looking game in most areas, there are little effects, little touches, that help it along. For instance, the jungles are dense with foliage, and the result is in fact a feeling of actually being in a jungle. You would think this has to be a fundamental goal for each developer making a Vietnam game, but...no. So, these work well. These jungles actually work to hide, provide cover and to surprise. The leafy corridor effect is very transparent, but at least the textures are better than average.   Aurally, Take-Two has probably had a great time culling 1960s music tracks, with a tendency to lean on Jimmy Hendrix's-style rhythm guitar in the menus, but oddly, there are only four licensed tunes (none of which are Hendrix tunes), and the rest are 12 different songs by about 10 different relatively unheard of bands. And instead of Hendrix playing ~Hey Joe,~ it's Deep Purple. And I could be wrong here (though I did check the credits), but I never actually heard the song ~Purple Haze~...which I kind of expected to, since the title...is...ah, nevermind.If you're interested in a playing a game that does the Vietnam War justice -- gosh, that sounds weird -- then Take-Two's title is just barely above par, and is, at best, a rental for a dull day. From every angle, Vietcong: Purple Haze barely cuts the mustard. It's not a great shooter, it's not terribly pretty, it's slow and has average to poor AI, the squad mechanic is meh, and so it's just very, very difficult to like. To love it, you'd have to be desperate or suicidal. The big plus is the range of weapons you'll use (though you cannot always select the ones you want). The deleted multiplayer and online modes (originally in the PC and Xbox versions) provide even less reason to buy the PS2 version.", "date": "Oct 1, 2004"}