{"name": "Marine Heavy Gunner: Vietnam", "name_review": "Marine Heavy Gunner: Vietnam", "ref": "https://www.ign.com/articles/2004/10/01/marine-heavy-gunner-vietnam", "text": "Hot on the heels of Marine Sharpshooter II: Jungle Warfare comes Marine Heavy Gunner: Vietnam, from the same publisher and featuring artistically indistinguishable box art. The best thing MHG has going for it is that I reviewed MSII right before, making its faults a little more forgivable but making its similar weaknesses stand out that much more. In the long run, these two factors cancel each other out, and Heavy Gunner is just another budget shooter, although it's not without some perks amid the quirks.  You start out as Grant, a hard-bitten heavy gunner (natch) who's been in the trenches of Vietnam for a year now, apparently because he has nothing to go back to but a nine-to-five working stiff job and a wife who wants to divorce him. Me, I'd take the gavel over a pungee stick any day, but that would make the game kind of short. Instead, we wade through the ~police action~ Medal of Honor-style, with mostly seamless level design, squad-based combat and a series of scripted sequences.  You'll start out mowing down the VC and NVA from a helicopter with a mounted gun with unlimited ammo, flying a pre-set route and dealing with infantry and RPGs as you make your way deeper into the jungle. Inevitably, you'll have to crash land, which is where the real fun begins. Once you're on the ground, you'll have the sergeant delivering your orders and swearing like a longshoreman, a medic who can patch you up to full health by standing next to him and pressing the action button, another with an infinite supply of ammo, and a couple of mostly useless grunts who would be certified Star Trek redshirts were it not for their habit of being able eat an endless amount of lead.  Everyone but you is pathetically ineffectual, often letting enemies run right past them on their way to you. I'm all for taking the bulk of the action, but there's another complication: even on default difficulty, I can only take two or three hits before I die. Since the enemy AI tends to home in on me, this is a bother. Confusingly, once I mount my heavy gun somewhere, I can take serious punishment. This is good, because the enemy always comes in hard and fast, but when I stand up and immediately get half of my health taken off from a stray bullet, it kind of kills what little mood Heavy Gunner can muster.    Adding to the realism schism is the fact that the ammo guy can re-supply me for any type of weapon I find in the field. Since the mechanics are such that I can only scrounge weapons and not additional ammo, and I lose whatever rounds were left in a clip when I reload, this is mostly a good thing. But it's good for the wrong reasons. I can also swap weapons with Sarge and the two redshirts, taking a ~blooper~ (one-handed grenade lobber) and swapping it with an AK-47, and they don't complain much. Theoretically, I could arm them all with bloopers and watch the fur fly, but that would put me in harm's way, considering the level of AI we're dealing with.  Heavy Gunner also repeatedly touts the Unreal engine rendering the visuals, but aside from some occasionally solid texturing, it all looks decidedly dated. The character models are decent, but what really puts a dent in their claim to fame is that the model animation is decidedly weak, with everyone looking like they're navigating through syrup in some kind of dreamy slow-motion. Your main character also runs decidedly slowly, and there's no sprint key to dash from cover to cover. And you can't toggle crouching. And you can't lean. Let's just say that mobility and flexibility are not strong points here, which is especially frustrating considering the unforgiving damage model.  Putting the scales back in your favor is a compass displaying all the incoming enemies with red dots (although elevation is still guesswork). It makes it much easier to pop the guy as he's coming at you, but often the enemy is firing on your position as soon as he clears the doorway or other obstacle. Even with constant quick saving, I was forced to monotonously repeat certain segments as random enemies got lucky from altogether suspicious distances, while running laterally, no less. Adding insult to injury is the distinct impression that the average enemy could actually take more damage than me.  Last but not least is the sound. All the weapons could have used some more low end, and the AK sounded more like a silenced MP5 than an assault rifle. Voice acting was hammy but bearable, although I would recommend not using a Canadian to voice a guy from Jersey. Watch out for that guy on the ootcropping!All in all, Heavy Gunner is a respectable attempt to echo good game design, but it ends up reminding people of the better games they'd rather be playing. If you've already played and gotten tired of every single shooter available, and have exhausted your excitement for all the demos of the upcoming fall games, and still can't get enough, only then would I recommend Heavy Gunner. Otherwise, there are better things to do for the money.", "date": "Oct 1, 2004"}