{"name": "Mario Pinball Land", "name_review": "Mario Pinball Land", "ref": "https://www.ign.com/articles/2004/10/04/mario-pinball-land", "text": "There's absolutely no denying the production value of Mario Pinball Land. The game initially looks like it's one of the most graphically marvelous and energetic Game Boy Advance games yet released for the system. But unfortunately, all this glitz and glamour is all a front, almost overcompensating for a flawed game design. It becomes clear pretty early on in the challenge that Mario Pinball Land is an absolutely frustrating series of pinball challenges that does a better job at annoying the player way more than it amuses. Features More than 30 different pinball tables Power-ups like ball shrink/grow, invincibility, and multiball. Time Attack mode Cartridge save (one slot)  Mario's been shoehorned into many situations in his two decade career, but none feels more forced than his role in Mario Pinball Land. Apparently in the Mushroom Land there's this device that can smoosh anyone, safely, into a ball. This really awkward and out of place plot device is used to send Mario into a pinball adventure through five themed areas of several single-screen challenges to save Princess Peach who's been kidnapped (in ball form) by Bowser and his goombas.  It's just doesn't make a whole lot of sense, and just seems like an extremely unnatural role for Mario to assume. We can accept Kirby as a ball because he's already spherical. Pokemon? Sure, they use the Pokeballs. But a spheroid Mario? It's just hard to accept.  So set your suspension of disbelief on high for a moment, and just assume that it's a perfectly natural scenario. In its presentation, Fuse Games created an extremely visually appealing game on the Game Boy Advance. Granted, the cutscenes that tell the story are awkward, still renders that jump from one to another...sort of like those ~flippies~ cards you'd get in a box of Cracker Jacks. But the actual gameplay imagery is a stunning combination of rendered backgrounds and fluidly animating sprites, and look fantastic on the GBA screen. The music is actually quite peppy and uses the GBA sound hardware (or lack thereof) pretty well.    But then the design goofs set in. Each individual, non-scrolling screen features a single task to score a Star, which can be accumulated to open up Star doors...much like the level progression in Super Mario 64 and Super Mario Sunshine. But it's up to the player to figure out what to do in this situation, since there's no real indication of what will score that coveted Star beyond whacking all the targets on the screen. To be fair, that's really all that's needed to win the board, but some are a little more complicated than that, and the mystery element does work against the game...especially later in the adventure.  The table designs aren't your typical pinball layouts, and in fact, as good as the ball physics are in Mario Pinball Land, the table designs in the game actually work against the physics model. Most real world tables have ~stuff~ to at least slow the ball down, like rails, slopes, or ramps. Most of the tables are ~open fields~ in Mario Pinball Land, which makes it difficult to actually control the ball as if it were a real pinball machine...there's far more ~random~ bouncing going on which detaches the game design from its pinball routes. And the lack of a table nudge just takes it one step further away from that real pinball feel.  The developers admittedly do attempt to put as much variety into the board designs as possible; along with the standard Star quest, players can also try their hands at the now-typical ~red coin~ challenge, in this case it's something that appears after an area's boss battle. The task is to trigger the coins in a given area and try to grab them in a 90 second countdown. There are also Yoshi Egg triggers; Mario Pinball Land does feature two and three ball ~multiball~ function, and getting a Yoshi Egg (the game's second and third ~ball~) in a specific area triggers a special Yoshi Egg ~tower~ that, if knocked down, will score serious points for the player.  But what makes the game unbelievably irritating is its insistence of resetting the playfield  if the ball (Mario) ever leaves the area. In other words, if the player was one target away from earning that screen's Star, and they accidentally shoot the ball through the gate into another board, the previous board will be completely reset as if it was the player's first appearance in the area. This happens a lot in Mario Pinball Land, and it's absolutely unfair to the player since there are so many instances where the ball will leave the playing field...either by the hand of the player or simply due to a random bounce on the board. It's this element that artificially inflates the difficulty and length of the game, and what's more, it really makes Mario Pinball Land an absolute chore to play. If it were a memory restriction we might be able to forgive it...but the game seems to have no problem tracking Yoshi balls when a player knocks it into another board in a given area.  A game can't live on pretty looks alone. Mario Pinball Land is a graphically amazing title, but the gameplay itself is far more flawed and annoying than it is fun to play. And considering Nintendo already successfully hit the pinball genre last year in Pokemon Pinball: Ruby and Sapphire, Mario-branded game is a large step backwards in game design. This game may have more pinball ~challenges~ than Pokemon Pinball, but when players have to struggle through some of the frustratingly bad design implementations, it's almost not worth the playtime.", "date": "Oct 4, 2004"}