{"name": "Tribes: Vengeance", "name_review": "Tribes: Vengeance", "ref": "https://www.ign.com/articles/2004/10/05/tribes-vengeance", "text": "Gamers always complain. Give them a stellar single player game like Grand Theft Auto 3 or Pirates! and they'll bitch that there's no multiplayer. Give them a fantastic multiplayer game like Starsiege Tribes and they'll moan endlessly about the lack of a single player mode. While we'll still have to wait for some sort of solution for those first two titles, that last gripe has safely been put to rest by Irrational Games' Tribes: Vengeance.   The Tribes series has had legions of fans since the first Earthsiege title was released over ten years ago. (To stave off hundreds of irate emails from longtime fans, we are aware that some trace the series goes all the way back to the Stellar 7 games but, for us, Tribes starts with Earthsiege.) With the unfortunate dissolution of Dynamix three years ago, gamers were understandably worried about the future of the franchise. Thankfully, Vivendi decided to place their hopes for the future of the Tribes universe in the reliable hands of the folks at Irrational Games.  As the developers of Freedom Force and System Shock 2, it may seem that the choice was somewhat, well, irrational. But that's only until you consider that Vivendi wanted a really good single player experience out of this newest game. Given that the setting and mechanics were already firmly in place, Irrational was the perfect choice to craft a compelling plot for a single player version.  The game takes place hundreds of years before the original Tribes when the Tribal War was first heating up. Players will already be familiar with the Blood Eagles and Phoenix when they appear here and will come to appreciate the ideology and aesthetic of the Imperial faction as well. Though I won't spoil any of the plot points here, I will say that the story has you playing as several different characters on different sides of the conflict. You'll get to experience two idealistic royal princesses, a pair of grizzled Tribals, and a cold, mysterious assassin of uncertain allegiance.   I normally hate it when games force the player back and forth between multiple viewpoints. Too often the shifts in character merely muddy the events and motivations that are required to build interest for the player. Here the motivations are almost always comprehensible despite the fact that they're never really stated outright. This approach really serves the game well; you get the sense of why the characters are fighting without any awkward explanations. The ideologies come about through the actions and situations rather than through deliberate declaration.  The one really weak part in the story is that the sequence of events isn't very clear. With two halves of the game each taking place twenty years apart, it can be tricky to piece together the cause and effect that drives the relationships here. You eventually get a pretty clear picture of who kills who but I think the game would have more emotional impact if those links were better established early on. Some of that is, of course, preserved for the sake of mystery.  One thing the story does exceptionally well is prepare the player for multiplayer. While you can spot the places where the multiplayer tutorial starts to creep into the single player game, it's always introduced very naturally as part of the story. When you make an assault on an enemy base with a squadmate in heavy armor, you'll see how differently equipped players need to interact tactically. When you're sent on an assassination mission, you learn how to use the sniper rifle effectively. When you compete in the arena, you become familiar with the various game types and objectives. These are just three examples of a technique that's smoothly employed throughout the game.  Again, I'd be spoiling half the fun of the single player game if I merely summarized the sequence of events but I should at least give you a sense of the types of things you'll be doing. I've already mentioned sniper infiltrations, base assaults and arena combat but the game has much more to offer than just that: you'll have to drive a buggy through city streets while fighting off enemy ambushes; you'll have to set up defensive turrets and mines while holding off enemy assaults deep in the heart of a massive base; you'll have to search an enemy prison to rescue captured comrades.  The levels are as well designed as the missions. There are definite focus points where you can predict conflicts, but there's also a lot of flexibility in how you approach your objectives, particularly when you're playing outdoors. Many of the missions that take place outside will give you multiple objectives and you'll have to plan out how to come at each one. If you're persistent and stealthy, you'll almost always be able to find a way to strike at your enemies from behind. The enemies are fairly mobile as well and you can expect reinforcements to come pouring in from almost any angle once the fight begins. Though the AI isn't anywhere near as challenging as a human player, it does use its jetpacks and weapons effectively in whatever context the terrain dictates.     The interiors are just as exciting in terms of layout. Though there are the inevitable succession of corridors to be found here, the rooms they connect with are usually quite large with some interesting options for vertically-minded players. Quite often you'll find yourself at the top or bottom of a large cylinder or box with a variety of platforms granting access to the upper or lower areas. The jetpacks make fighting in these locations a real treat.  The weapons deserve their share of credit for making the combat exciting. There's a satisfying weight and sound both to the weapon itself as it fires and to the projectiles when they hit. The animations are great both on the recoil and on the impact. When you send a group of enemies flying into the air with a well-placed disc launcher shot or when you go flying across the room as a grenade explodes behind you, you'll definitely appreciate the physics behind it all.  The old arsenal is still here but, apart from the ubiquitous disc launcher and the grenade and mortar launchers, most of the weapons have been tweaked a bit. The chaingun, which was always my weapon of choice in previous games, now does a bit more damage than it used to. Sniping is now a little more complicated as the sniper rifle now requires bullets as well as energy to fire. This helps to balance the weapon a bit as it keeps players from skirting the edge of the map taking out an endless succession of enemies. The blaster pistol has been replaced with a blaster shotgun which adds another option for players who like to mix it up at short ranges. The shots bounce off the walls as well, making it a good indoor weapon.   There are some new weapons this time around as well. An energy blade serves as a handy melee weapon but, in my opinion, it's more of a last resort weapon when you're completely out of ammo for everything else. A burner gun shoots out massive fireballs that linger a while burning any enemies caught in their area of effect. It's good for groups and the fast projectile makes it a useful weapon even at medium ranges. Steered rockets from the rocket pod launcher are good for dealing out lots of damage. You'll eventually get the hang of steering them around with your aiming reticle but they really have to be used against large or very close targets to have any hope of hitting at all.  A new grappling winch is also included but, outside of a few scripted uses during the single player campaign, this seems to be more of a novelty than a practical tool for fighting, at least in the single player game. You can use it to latch on to other players so it ought to have more applicability in multiplayer.  Some new vehicles have been added as well. The Rover is a nice little ATV that acts as a mobile inventory station and spawn point. The physics on this baby aren't quite at Warthog level yet, but the feeling that you're in contact with the ground steering a multi-ton vehicle over dips and bumps in the road is still very strong. The Jump Tank is a bit heavier but compensates for this with some cool jets. If you want maximum attack ability, you have to go with the aerial assault ship. With a pilot, a gunner and two guys sitting in the window seats, you can unleash a lot of damage all at once.  By far though, my favorite new vehicle is the Fighter Pod. This little baby is so quick and agile in the air that you can get in and out of trouble almost at will. They're lightly armored and don't have great armament but they're still worth their weight in gold. Once you start zipping around launching rockets at those poor Podless scum, you'll be hooked.  The modified Unreal technology that powers the game's visuals and physics is simply fantastic. In terms of physics, you get a real sense of weight as you fire your weapons or as your jetpack lifts you off the ground. The sense of momentum and inertia you feel when flying through the air or the water is brilliant. You'll even have some control of your direction even if your jetpack isn't firing which gives you a lot more flexibility in the air.  Skiing is largely automated this time around. This technique, which was an exploitation of the code in the original game, is now a full on feature. It allows players to preserve and gain momentum when sliding down the slopes in the game. If you time your jetpack use just right, you can use this momentum to ski down one hill and launch yourself off of the next upslope. To ski in Tribes: Vengeance all you have to do it hold down the spacebar and hit the jump jets once you hit the upslopes.  There are a few problems with the physics though. While I like the ragdoll effect, it seems like heavy armor types are much too light when you knock them around. If you can manage to push them over an edge, you'll be shocked to see how they almost float down to the ground. I don't expect them to fall faster than the light armors of course (I did take physics in college) but they just don't seem to weigh anything as they fall. The other obnoxious aspect of the physics system is that water and air seem to function exactly the same. The water is less transparent of course, but movement and weapons fire isn't really impeded by it at all.     Visually the game is great. The level of detail in the characters and environments is commendable. The cutscenes really show off the range of expression and emotion the characters are capable of and also allow you to get a closer look at the armors. The armor designs are great. Each faction has a unique aesthetic that's instantly identifiable. Better still, the armors don't look brand new; each suit has a worn and weathered look to it that further enhances the realism of the world.  Lighting effects and shadows are also handled well. Though subtle, the shadings in the game world help add depth to the characters and objects. The bloom that bleeds out from the light sources make the moon and sun seem like more than just brilliantly lit basketballs.  Irrational has set a high bar for themselves in terms of sound and, while Tribes: Vengeance has good sound by any standards, the overall sound design doesn't allow for the types of effects that were put to such good use in games like System Shock 2. This is a different sort of concept, of course, and one that doesn't necessarily lend itself to that type of audio but, given the studio's previous efforts, I kind of wish that sound had played a bigger role in the game. The weapon effects, the roar of the jetpack and the footsteps of the soldiers as they march around are all good enough, but they're just sort of predictable.  Since the game just came out today, it's hard to offer a decisive opinion on the multiplayer. We've played the demo and we've participated in a few Vivendi-sponsored multiplayer sessions but, more than almost any other title, Tribes is a game that's owned by the community and they're sure to put their own spin on the game. Witness the near total rejection of the economic system in the original Tribes.   We can say a few definite things about the shape of multiplayer though. For one, the maps aren't as large or as numerous as they were in Tribes 2. This game also seems to lack the large fortresses that made base assaults so fun in the original games. In another departure from the previous games, vehicles don't need to be purchased. Instead, they'll simply spawn on their own like they do in Battlefield 1942 or Star Wars Battlefront. This will definitely lead to more camping here.  There's a lot more versatility in terms of game types though not, sadly, the option to include bots). There are already a whole passel of games to choose from here well beyond the requisite flag capture and deathmatch varieties. Keep away, a new Tribal ball game, and a new fuel cell collection and delivery game spice things up nicely.   Just as we'll have to wait to see what shape the core game takes once players begin setting up their own matches, we'll also have to wait to see what sort of mod support the game enjoys. After several discussions with the developers we're hopeful that the game will be even more mod-friendly than previous iterations. This is a high bar to clear, admittedly, but mod support is supposed to be much more robust and convenient this time around. Time will tell.  We'll be back soon with an update on how the multiplayer side of Tribes: Vengeance is shaping up. Even so, the single player experience and the potential inherent in the multiplayer side of the game make this a game action fans cannot pass by. I love this team from Down Under. You know, Irrational hasn't made a lot of games but those they have made have been fantastic. Tribes: Vengeance is no exception. It walks the fine line between staying completely true to the previous games while also striking out into some exciting new territory. The new single player campaign gives players a much clearer understanding of the world while also being true to the multiplayer roots of the series. The sometimes disjointed timeline of the story is a definite weakness but the action itself is always clear enough to carry you past any questions you might have about who's killing whose grandmother or whether you should be happy or upset about it.When you combine the fantastic single player story with the tried and true gameplay design, you get a title that benefits from years of refinement and iterations while also offering up a completely new experience you haven't seen before. Add that to the Unreal technology that Irrational uses to power the visuals and you've got a game that no action fan should be without.As I said, we'll have to wait and see what happens once the community gets their hands on the game. If 90% of the servers are still playing capture the flag by the end of the week, then the multiplayer draw of Tribes: Vengeance will definitely decrease. There are some new ideas worth trying here though and, though we don't think they'll supplant CTF as the mode of choice, we hope they find some home within the game's community.", "date": "Oct 5, 2004"}