{"name": "Aladdin", "name_review": "Disney's Aladdin", "ref": "https://www.ign.com/articles/2004/10/06/disneys-aladdin-2", "text": "Capcom's originally released Disney's Aladdin to coincide with the theatrical film back in 1993. History repeats itself, as this Game Boy Advance game was originally set to ship last year, but it was held up in storage so that it can be released along side the Special Edition DVD of the film, now hitting shelves. The year in storage didn't really hurt the Game Boy Advance game all that much since it's already aged more than a decade, but to be fair the original game design wasn't all that exciting to begin with. The portable rendition is a pretty spot-on conversion of the somewhat uninspired Super NES game, tweaked a bit to better fit the portable market. It's fun while it lasts, just don't expect anything more than a solid, standard platform experience based on the great Disney flick. Features Playable characters, including Aladdin and Abu Extra GBA Bonus stage Cartridge save (one slot)  Back when the Aladdin film hit the scene, there were two Aladdin games shipped to market. Sega and Virgin Interactive made the headlines with the Dave Perry-developed version on the Genesis that better captured the essence of the film with a much better animated presentation and game design. And Capcom hit the Super NES shelves with its own game; similar concept, much different game design. Out of the two, Sega definitely won the Aladdin battle even though the Super NES game wasn't really all that terrible either. It just wasn't really all that ~special.~  And that's what you're getting on the Game Boy Advance: a very safe, routine side-scrolling platformer that takes the situations of the film and boils it down to a few dozen run-and-hop level designs on the GBA system. As Aladdin, players run and bounce through Agrabah, collecting apples to throw at enemies, gems to earn extra lives, red jewels to earn the super extra secret ending, and scarabs to hit the bonus level for a try at some goodies like a free continue or two. Most of the game takes place in this hop-and-jog layout regardless of location, with the occasional magic carpet level peppered in to keep things from getting too routine.  There's nothing particularly bad about Disney's Aladdin. In fact, it's a better than average platformer that offers a significant level of difficulty. The graphics have aged pretty well with its distinctly Capcom look to the backgrounds and sprites, and even though the game doesn't move as impressively as the ~competition~ Aladdin on the Genesis, the animation is as slick as any A-title platformer on the SNES and Game Boy Advance. The music, however, has that tinny trumpet SNES audio that wouldn't be so bad if the music wasn't poor royalty-free modifications of the songs from the film. It's like you actually want them to be the real songs, but they never quite get there.  The Game Boy Advance version actually goes one step further than the original Super NES game by sticking in a save RAM chip so players don't have to fumble with the original version's stupid password engine. And somewhere in the GBA version is a brand new level unique to the handheld version. So, at the very least, it's not entirely a direct port of the original 11 year old platformer.But even with the improvements, there's not much going on in Aladdin that hasn't been done before, or better for that matter. It's just a routine game that's best enjoyed by fans of the cartoon. At the very least it's at least aged well over the years, and fits the GBA handheld better than the original SNES game. Just don't expect to be ~wowed~ in any way.", "date": "Oct 6, 2004"}