{"name": "Quake II Mission Pack: Ground Zero", "name_review": "Quake II: Ground Zero", "ref": "https://www.ign.com/articles/1998/10/20/quake-ii-ground-zero", "text": "Despite recent competition from the mighty Unreal, Quake II is still the considered by many to be the undisputed king of the first-person shooter. One key to the game's long-term success has undoubtedly been the release of successive mission packs, which keep the action coming long after the release of the original. Such is the case with Ground Zero, the latest addition to the Quake II series.   If you're unfamiliar with the mission pack strategy, don't expect too much by way of innovation. The mission packs are meant only to maintain the momentum of the series, not re-invent it. What you can expect from Ground Zero, however, are 14 new challenging levels of single-player frag-and-tag action, and 10 new Deathmatch levels for multi-player action. Along with the new levels come new enemies, power-ups and, of course, new over-the-top weaponry designed for maximum damage.  The story begins simply enough: as part of a small (okay, let's go ahead and call them ~rag-tag~) group of surviving ground forces, you are responsible for tracking down and destroying the Strogg's newest and most powerful weapon, the Gravity Well. Of course, as is usually the case, before you get anywhere near your final mission objective you'll have to work your way through a seemingly endless maze of underground tunnels and caves, taking out vicious new enemy forces such as the spider-like stalkers and the air attacking Daedalus. As you work your way though the game, you're also responsible for achieving smaller (but no less important) objectives that will help you in your pursuit of your final goal.  Doom players will be happy to see the return of the Chainsaw (albeit a fancy new version) as part of the new arsenal of weapons offered in Ground Zero. Other new weapons include the armor-piercing strength of the ETF Rifle, and for those players that like to lay deadly traps there's the new Prox Launcher which leaves a vicious collection of proximity mines for any unsuspecting enemy that might happen by. The Prox Launcher can be especially gratifying in multi-player action.  The one mildly disappointing aspect of the game is in the design of the environment, which doesn't quite have the same flow as the original. Of course, Ground Zero is fought on a new battlefield and so it needs to have a different feel from the original, but at times the design seems to have gotten a little ahead of itself, leaving an overly difficult and confusing mess for players to navigate in single-player mode. As for multi-player action, if you can gather enough opponents with the mission pack add on, you will find a rich new environment in which to destroy all comers.  It pretty much goes without saying, but if you just can't get enough Quake II, Ground Zero is a more than satisfying holdover. If you are looking for a brand new experience in the first-person shooter genre, than you're going to have to look elsewhere for now.  -- Patrick Baggatta", "date": "Oct 20, 1998"}