{"name": "Yu Yu Hakusho: Dark Tournament", "name_review": "Yu Yu Hakusho: Dark Tournament", "ref": "https://www.ign.com/articles/2004/10/07/yu-yu-hakusho-dark-tournament", "text": "Hollywood-level production values and dead-on recreations of popular licenses in videogames are two trends that have become more and more common in the last couple of years; with the French publishing giant Atari appearing to be the one that's spearheading the whole operation. Leading the way with such titles as Terminator 3, Dragon Ball Z, The Matrix, and Godzilla, the wildly successful company from Europe continues to add additional licenses to its resume at an alarming rate. The latest such name on the docket, an incredibly fashionable anime by the name of Yu Yu Hakusho, joins The Transformers and Dragon Ball as one of the corporation's most lucrative and valuable properties aimed at young people -- with the distinguished privilege of being the first game of its kind to use the Yu Yu license for a console title since the days of the 3DO.   Unfortunately for the developer Digital Fiction and its backers at Atari, this return to the console space for Yu Yu isn't exactly a triumphant one. Because despite the fact that Yu Yu Hakusho: Dark Tournament does indeed capture the look and feel of the popular Cartoon Network blockbuster, it still runs into quite a bothersome roadblock: it has more style than substance.   Of course, it's always been an established belief that an abundance of style or presentation can go a long way towards making the game more appealing than it normally would be (Midway's recent Mortal Kombat: Deception is a great example of this). But it's never a definitive rule, nor is it always the saving grace. And to be frank, Yu Yu Hakusho: Dark Tournament offers a fighting mechanic that's just plain bad; with one of the least responsive reaction times I've seen in a fighter for quite some time.   Click For More Images Now on the surface, Dark Tournament holds a strong resemblance to Atari's other anime brawler, Dragon Ball Z Budokai -- with a similar button setup, somewhat comparable timing, and an obvious stylistic similitude. But after one or two matches in the practice or arcade mode, the similarities stop rather abruptly; when it becomes pretty obvious how much less polished Yu Yu is in comparison to Budokai.   The primary problem lies in the control of your characters themselves. Overly lethargic and inaccurate, the directional movements needed to perform specific combinations and super moves are too sloppy for their own good. At least in Dragon Ball Z Budokai 2 (and most other fighting games for that matter), a quick tap of the arrows or a motion on the D-Pad is all you need to successfully perform the move you want to do. Here it's way too awkward; frequently ignoring your successful motions on the Dual Shock in favor of just reacting with almost no movement whatsoever. The whole process is both stiff and mechanical.   Speaking of mechanical, the game's combo system also poses a problem. Because even if you can eventually start performing better chains and combination maneuvers after mountains and mountains of practice, the payoff is extremely limited and are arguably not worth the risk. There is absolutely no way to cancel a combination attempt that you've already started, for example, which forces you into waiting until the animations play themselves out before you can regain control again. During this wait, your opponent can easily walk up to you and completely destroy you with a few limited combinations of his own -- which is the other major flaw in the gameplay: the power of successful combos. Once you've figured out a particular chain, you can literally take out your opponent in six hits or score a ring out in a matter of seconds. And all this is regardless of difficulty setting, the size of the arena, or who your opponent is.   The end result of this battle system is very much like experiencing a dumbed down Virtua Fighter match. But keep in mind that that's not a comparison in terms of the game's potential complexity or strategic possibilities; but rather, how it's a similar experience to watching two newbies duke it out in VF on their very first quarter that they've ever used. But unlike Virtua Fighter, however, Yu Yu never offers more than your standard 'block-dominant' wait and see approach with a couple of imbalanced combos and easy ring outs.    To its credit, Yu Yu Hakusho does offer a nice array of game modes, features, and goodies that should please players that have the patience (or forgiveness) to stick around for the spotty gameplay. In addition to your typical Arcade, Practice, and Exhibition modes, there are also a number of hidden bonus gameplay extras as well. The survival mode, for instance, is always a nice diversion from the typical one-on-one match, while the Team Battle option harkens back to the days of Marvel vs. Capcom and Tekken Tag Tournament. And while only two human players can partake in this mode, it's a nice alternative to one-on-one (though the strange four-second loading times between each tag is definitely way too long). Additional goodies, such as a tactical Token-based mini-game and two different versions of the story mode are also very strong elements of the feature set.   In fact, it's in the two story modes where players will most likely spend the majority of their time. Offering up a ton of actual footage from the Dark Tournament anime as interstitials, the narrative follows the original animated series rather closely with a nice assortment of mission objectives in each chapter. So while one chapter may simply require you to dodge, jump, and duck your way out of the path of your teacher's projectile, another may force you into a team battle or survival match to progress the storyline. It actually works much better than Dragon Ball Z's retelling of its sagas, and is a real saving grace for the quality of the game.   That doesn't mean that there still aren't some problems with the single player game, though; and I'm not just referring to the aforementioned control issues either. As the enemy A.I. in Dark Tournament is both ruthless and clueless simultaneously. Absolutely kicking your butt like crazy when you're trying to go toe-to-toe with it via combos, projectiles, and the like, it's also an absolute pushover when it comes to the simplest of moves. Crouching while blocking followed by a sweeping kick or uppercut, in particular, is probably the most effective strategy in the game -- and almost always guarantees a victory if you find going head-to-head too much of a challenge. It's a weird sort of balancing issue if I ever saw one.   At least Yu Yu Hakusho does a fine job of capturing the atmosphere and personality of the TV show, though. Boasting around 25 different characters (including the members of Team Urameshi, Team Ichigaki, Team Rokuyukai, Team Mashoutsukai, Team Uraotogi, and Team Toguro) and eight different but familiar stages, fans of the television program will probably go nuts over its accuracy. The environments of each stage have some limited destructibility too, and several of the vocal actors from Cartoon Network's English dub have done the voices for the game as well. This kind of respect for the series definitely helps bolster the overall game up a few notches and should reel in the exact audience that Atari is going for: Yu Yu fans.Yu Yu Hakusho: Dark Tournament feels like an incomplete game to me, as the limited combo system and unresponsive control definitely left a feeling that more could have been done. Also, there were definitely a couple of times in my experience that the uneven AI and frustrating control scheme had me shouting quite a few expletives too at my television set. How could the enemy be so cheap, how could my foe be such a sucker, and why is my guy not doing what he's supposed to be doing were among the many arguments I had with my widescreen.Pure fighting fans will likely find the same problems, issues, and frustrations that I did, and for that I say stay away. But if you happen to be a fan of the Yu Yu Hakusho television series and have several forgiving bones in your body, then this one could certainly be worth a rent. The presentation values are pretty solid after all, and the story mode is rather cool even if you're cursing at your controller the whole time.", "date": "Oct 7, 2004"}