{"name": "Paper Mario: The Thousand-Year Door", "name_review": "Paper Mario 2: The Thousand-Year Door Review", "ref": "https://www.ign.com/articles/2004/10/12/paper-mario-2-the-thousand-year-door", "text": "It's been more than three years since Nintendo radically changed the presentation of its Mario-themed RPG franchise with the release of Paper Mario. After Square and Nintendo split ways in the mid '90s, Nintendo looked long and hard for a new team to tackle a Super Mario RPG sequel -- and ultimately decided on its first internal game development studio, Intelligent Systems (formerly R&D1). After all, members of the team were behind the original Mario Bros. and had gone on to create such classics as Super Metroid and the strategy RPG franchise Fire Emblem. A perfect fit, as it turned out.Although released late in the system's lifecycle and sporting a unique (and not necessarily mass market-friendly) look, Paper Mario managed to sell more than a million copies worldwide. Fast forward to 2004 -- enter Paper Mario: The Thousand-Year Door.The Facts Play as Mario and friends in a full-fledged RPG, complete with stats upgrades Play through seven chapters for more than 30 hours of gameplay Battle using a turn-based combat system with timed action elements Interact with the crowd in battles Utilize Mario's paper-like properties for unique special moves. Join forces with a host of supporting characters, each with their own special moves Experiment with item combinations to create 57 different recipes Collect 85 badges to open up new moves, sound effects, and outfits Battle and gather intel on more than 120 different enemy characters Supports 480p progressive scan Dolby Pro-Logic II Surround soundNot Far From the TreeLike recent Nintendo sequels like Pikmin 2 and Mario Kart: Double Dash!!, Paper Mario: The Thousand-Year Door doesn't break any new grounds in terms of originality. There is no radical switch in style and presentation like between Majora's Mask and Wind Waker, or from Super Mario RPG to the original Paper Mario. Since not much was broken in the N64 predecessor, Nintendo went for evolution over revolution with The Thousand-Year Door. The cutesy presentation starring flat sprite characters, the turn-based combat system with action elements, the simple ~someone kidnapped the princess~ narrative, the humorous text-based conversations, the memorable soundtrack -- it's all back for an encore presentation.But before you shrug off Paper Mario 2 as an uninspired repeat not worthy of your attention, consider for a moment what really makes a great Mario game. Sure, The Thousand-Year Door doesn't stray far from the formula, but it oozes fun, polish, and, strangely enough, originality. With nearly every other RPG series out there going for elaborate story cutscenes, twisting narratives, and darker visuals, Paper Mario 2 manages to stand out as something a bit different. Nintendo has once again crafted a game that manages to appeal to two distinct audiences at the same time. Kids can enjoy the intuitive gameplay, colorful worlds, and happy-happy characters, while older gamers will chuckle at the many classic Nintendo references and humorous situations. But I'm getting ahead of myself. Here's how the game is played.Platform RPG PerfectionIf you've played the original Paper Mario, you'll be instantly familiar with the overall system. The game mixes the exploration, conversation and battle-heavy gameplay found in RPGs with action sequences and platforming elements so comfortably at home in the Mario universe.You take control of Mario and set out to join the lovely Princess Peach on a mysterious treasure hunt in a rundown port town. But when you arrive, Peach is gone. Kidnapped again? Hey, everyone's got a job, and Princess Peach's lot in life is to get kidnapped again and again. It's what keeps Mario from plumbing -- and gives us the chance to keep playing and see a world outside the kitchen sink. Using a map sent by Peach, Mario embarks on a long quest to find seven Crystal Stars. Only when these artifacts are united will the magical Thousand-Year Door swing open and reveal the secret treasure that lies hidden.NPC characters, like Frankly here, sometimes tag along as well.  Mario is joined by a host of sidekicks, including the University of Goom archeology major Goombella (yes, a Goomba), the self-doubting Koops, and a spunky orphan Yoshi baby, among others. In typical Nintendo style, each character comes with a number of unique abilities that can be used to unlock new secrets and gain access to previously hidden areas. For example, Goombella can tell you information about your surroundings and help provide clues, Koops can use his shell to hit switches, Yoshi can carry Mario across gaps and chasms, and so on. But Mario himself isn't completely helpless either. Though it may sound like a disadvantage at first, being a flat piece of paper has its benefits. Once he has unlocked them, special abilities let Mario roll up into tube or turn sideways to slip into small spaces, twist into a spiral to smash things with a hammer spin attack, and fold into different shapes to float or soar to new objectives.  Many of these special powers can also be used in the game's ingenious battle sequences. Since leveling up characters is such a vital component of RPG gameplay, a boring turn-based battle system can easily break a title. Get this: battles in Paper Mario 2 are fun. I know it sounds like a crazy concept, but Mario's latest RPG outing does not throw hordes of random enemies at you and force you to battle the same enemies again and again. Like in one of his classic platform adventures, Mario can actually hop over or run away from enemies when he's feeling pacifistic urges or is just trying to get somewhere quick (a good choice to keep things flowing, as there's some minor backtracking involved here and there). Intelligent Systems took the original game's system and expanded on it with a number of great ideas. You still select attacks and moves from an icon-based ring menu, choose your target, and then perform a simple mini-game-like challenge to determine over success or failure of the maneuver -- but the developer added an all-new element to the mix: the audience.Battles are no longer solitary little tiffs out in the middle of nowhere. Each battle is now set up as a stage play of sorts, complete with an audience of characters at the bottom of the screen. Mario and friends enter from the left, the bad guys are on the right. Depending on whether you got the jump on an enemy before the battle or vice versa, one of the two teams starts off the attack. As you battle, you can either impress the viewing public by kicking ass and taking names, or disappoint them by screwing up. The better you do, the more onlookers will join the party, and the more star power you will gain from their cheers. The latter fills up a special gauge at the top of the screen and is key to unleashing some devastating (or life saving) special attacks on your opposition. While virtually each move has its own control scheme, the game one-ups its predecessor and adds ~stylish moves~ to the mix.By pressing the A button shortly before or after an attack, Mario and friends can pull off stylish special moves that fire up the crowd even more. For example, perform a flawless hammer attack with Mario by pushing left and releasing the analog stick at the right moment, then time yourself perfectly and push the A button three times and you can pull off a showy triple jump and net some big star power. But the audience isn't all cheers and stars. There are actually times when members of the audience will throw items at you, try to sabotage your ~performance,~ or create havoc by making other viewers leave. Revealing more details would mean potentially ruining the surprise, so just take it from me: the addition of the audience not only adds more fun and interactivity to the battles, but also provides for plenty of humorous situations.I could go on and on about the battle system -- on how some battles are beautifully integrated into the storyline (spoiler, highlight to read: one chapter has you enroll in a wrestling league and battle your way to the top), the tricky block system that has you deflect or counter damage by pressing A or B at the right time, or how varied effects like fog, electricity, or outside props keep the fights fresh -- but know that Paper Mario 2 just nails it. From the menus to the timed controls, everything works flawlessly well. Likewise, the character equip and upgrade systems are well-balanced and intuitive. Mario goes up a level for every 100 Star Points he gains in combat, while partners level up using Shine Sprites found hidden throughout the main quest. In addition to special rewards granted at the end of the game's chapters, both parties gain special moves and abilities via special badges the can be bought, found or won in battle challenges.Mario StoryPaper Mario: The Thousand-Year Door's biggest flaw is that it starts off slow. Put in only a few hours of game time or so and you might walk away feeling that the environments are generic, the conversations too wordy, and the story predictable. Luckily, things pick up soon enough. What initially seems like a flat story line eventually throws you some unexpected curveballs. And for every one of the game's main chapters, there are plenty of sidequests involving item fetching, mini-games, and hide-and-seek exploration.Likewise, the presentation of the environments starts off with the standard stuff, but soon turns things up a notch. The developers have wisely created an adventure that walks the fine line between the familiar and the new, littering the world with classic characters from past adventures and locations previously unseen in any Mario game. The outcome is an almost perfect mix. You will recognize characters from Super Mario Sunshine, hear sound effects and music that goes all the way back to the original NES classic, don surprises and new outfits, and try to figure out which ones of the new characters are good and which ones are bad.The localization is pretty much perfect as well. Though the bad guys aren't quite as funny as the crew in Mario & Luigi: Superstar Saga, many of the jokes made the transition just fine from the Japanese original. Some of the banter in the early phases of the adventure runs unnecessarily long, but the later half of the game moves at a much brisker pace. It almost seems like the writers needed a ramp-up period and really got into the groove later on. Many of the NPC conversations are so funny, you'll actually want to talk to every character you see. Do yourself a favor and don't miss out on hearing what the crows have to say... While the visuals may be more suited to younger players, the sense of humor that permeates this game makes it a perfect choice for older gamers. It's hard not to laugh out loud at times.You need to get the crowd on your side if you're planning to unleash lots of special moves, like this quake.  Which brings me to my only gripes with this otherwise wonderful game: some presentation shortcomings when compared to other current RPGs on the market. Despite a leap forward in console technology since the days of the SNES, Mario's latest RPG remains a 100% text-based RPG that serves up a unique look, but doesn't evolve its presentation over its predecessor. Yes, it's nice that you can progress the story in the game at your own pace since everything is text-based, but with the help of some quality voice actors and/or facial animation, Paper Mario 2 could be even better. There are plenty of opportunities for comedy with voice actors and facial expressions -- and given that Mario himself doesn't really talk in the game, it's about time Nintendo embraced the medium and at least gave the rest of the crew a voice. After all, the characters in the Pokemon TV show don't converse with speech bubbles when they run into each other, why should games, an interactive audio-visual medium lag behind? Given Nintendo's broad age target for its games, adding voiceovers would also mean that younger gamers could get in on the fun.But lack of voice acting is a small quibble. The well-written dialogue and expressive text effects (letters shake when characters are scared and blow up to super-size font when angry) do a commendable job, and many old-school Nintendo fans may actually prefer the silent treatment.  The other, more significant demerit is that Paper Mario: The Thousand-Year Door's art looks just like it did on N64. No, I know -- it's sharper, the textures are more detailed, it runs smoothly, there are sometimes hundreds of characters on screen -- but when a game has the word ~paper~ in its title, it'd be nice if things actually truly looked like paper. It's possible that the developer's inexperience with 3D game engine and texture creation may have gotten in the way. Or perhaps it's a matter of choice? Whichever it may be, the irony is that games like Yoshi's Story (N64) and Yoshi's Island (SNES) did a better job at reproducing the look of different materials like paper and cardboard than this paper-themed Mario game running on the more capable GameCube hardware. For examples on how it can be done, check out what the now defunct Doki Deki did with the presentation in Piglet's BIG Game. One of the game's 3D levels featured a crafts theme, with paper clouds suspended with string, and taped-up cardboard lining the paths.Paper Mario 2, on the other hand, might as well be called Sprite Mario. There is no texture to this paper, no shine, no paper trees swaying in the wind, no real paper feel. The game serves up a stark, cartoonish 3D world with some occasional, but really cool 2D effects on the characters and a few objects. For example, switches trigger page-flip or rip-away animations, some boss characters have origami-like qualities, there are transitions that crumple up the screen, and one of your sidekicks can blow away certain objects, which then flap in the wind realistically as they disappear. In the end, this gets the job done, but I can't help but wish Intelligent Systems had taken the extra step and matched the game's look to the superb gameplay. While not on par with recent stylized hits like Viewtiful Joe or Wind Waker, the graphics range from gorgeous (the very viewtiful chapter 4) to bland (earlier towns and environments). Outside of facial and speech animations, the characters move really well, too. But background animations and texture effects, a more paper-like look, and some more glitz for cutscenes could have helped make Paper Mario 2's look more than just a hi-res version of the original N64 game.Some of the mini-game stages, like this Bowser level, poke fun at classic Mario gameplay.  If you're on the fence whether you should give Paper Mario: The Thousand-Year Door a go, it's time to fold and take the plunge. Unless you're allergic to reading, even gamers who can't see the fun in turn-based battles will have no problems getting sucked into this charming adventure. It's obvious the developers poured their heart into creating a long, rewarding quest that's loaded with a ridiculous level of Mario goodness. Play it yourself or buy it for your significant other, but don't miss out on this engaging piece of old-school fun that serves as an easy reminder why Mario has grown to such a recognizable icon over the years.With Mario & Luigi: Superstar Saga finished and stashed away, I was ready for another opportunity to venture into Mario's RPG realm.  While there's plenty of room for better presentation (Paper Mario Revolution, anyone), this game is an absolute blast to play. Get past the slow-moving first chapter and some clunky NPC path finding routines in chapter 2 and you'll be hooked. The story is funny, the gameplay varied, and the world so charming, you'll want to explore every last corner of it. Add to that plenty of playable characters and sidekicks, some great cameos, a memorable score loaded with classic melodies, and a quest that runs a good 30 hours long, and you've got another winning offshoot in the mighty Mario franchise. Paper Mario: The Thousand-Year Door improves on its predecessor in every way and takes the cake as the best Mario RPG yet. Highly recommended.", "date": "Oct 12, 2004"}