{"name": "ChoroQ", "name_review": "ChoroQ", "ref": "https://www.ign.com/articles/2004/10/12/choroq", "text": "It's not often that IGN editors will gather around a single desk to gaze in horrified wonder at a game so preposterously awful that it's actually capable of annihilating sentient life. This particular black hole of a PlayStation 2 title happens to be ChoroQ, the thousandth in a series of other unfathomably lame ChoroQ games. Right now it's sucking in the universe and bending light.   ChoroQ is a cosmic harpy. It attracts its feeble prey with lustrous use of all three primary colors, twanging bleeps and blangs, and disproportionate animated cars that talk and say totally useless things like Whee and Kazow. Once you've been caught by its charm, ChoroQ unwraps its hooked tentacles and latches onto the very fabric of life that binds your spirit to your body. Then it starts to rip and tear like a crocodile rolling through the river with a buffalo's throat between its jaws.   It's a caRPG. This means that ChoroQ forces players to meander about some perfunctory town so that they can build themselves up with new parts and converse with other cars. Unfortunately it's a waste of time and the characters that can be spoken with provide absolutely zero interest. Sadly, the gameplay follows suit and it seems that developing an exciting or decent driving game took a back seat to the role-playing elements.   Here's how it works: you wander around town, speak to bafflingly stupid car-habitants of crappy Carsville and then pick a race or two. Most of the conversations you'll have are literally pointless, as in without a point. There are times when you'll park at a house and be loaded into a brief non-interactive cutscene just to see something like, ~There's no one here.~ If you're lucky enough to speak to people, you may get some things like, ~Hi.~ That's about as riveting as it gets.   Game go Boom Did I mention the interface? It's poorly designed and is, well, garbage quite frankly. How about those graphics? They're poorly done and way behind the technology curve. Unfortunately the sound is just as medieval, with nary a memorable song or sound effect worth remembering. And the racing? Oh, the sweet, sweet racing...   Excuse me for saying so, but ChoroQ has one of the dumbest racing systems ever -- possibly the dumbest. Pole Position on the Atari was a better planned racer. ChoroQ starts off painfully slow (like walking); then, with the help of all the car upgrades and stuff, you eventually get up to golf cart speed, which is where the game really picks up. Regardless of whether or not you're moving slow or fast, however, you'll never like turning. It seems that the left and right directions are still mysteries that lie somewhere beyond the scope of ChoroQ's design.What other way is there to put it? If you want to know what a box of suck looks like sitting on your shelf, buy ChoroQ.", "date": "Oct 12, 2004"}