{"name": "Syberia II", "name_review": "Syberia II", "ref": "https://www.ign.com/articles/2004/10/14/syberia-ii-2", "text": "comes to us during an irrefutable slump in the adventure game genre. I've been playing adventure games for the better part of two decades. As other boys my age were out hunting for pre-teen girlfriends, I was indoors playing text adventures like Zork, The Wizard of Oz, and Farenheit 451 on my Commodore 64. Between then and now, there have been a bevy of titles keeping me up at night. Lately though, the torrent of adventure games from companies like Sierra and LucasArts have slowed to a trickle. Luckily, the original Syberia satisfied some of our adventure cravings for awhile. Having played through Syberia II, I can say the adventure genre has been given a nice shot of meds to keep it ticking for awhile longer.       The Story Thus Far...  When gamers last saw Kate Walker, she had found the elusive Hans Voralberg, an aging toymaker who built advanced machines and automatons. The old man seemed deliriously obsessed with finding Syberia, a sacred island where Mammoths still freely roam. Kate Walker meets and joins Oscar, a wimpy yet loyal automaton built by Hans, in a bid to realize the crazed dreams of the frail old man. The trio soon boards a whimsical wind-up train and shoot into the frozen unknown in search of Syberia. It's ok if you don't know what I'm talking about, Syberia II graciously provides a bite-sized prologue for the Syberia virgins of the world through an optional cinematic.    The opening movie in Syberia II reveals Kate Walker letting go of her roots. She disregards her boss's plea to have her return home to New York after she left for France on a business trip weeks earlier. She's now resolved to help Hans Voralberg reach the mythical island of Syberia. Kate Walker forsakes family and career to head off into the frozen north in search of the old man's dream, even if she's still not too sure about it herself.    Adventure Awaits!  You control Kate Walker through a very simple interface made up of an inventory screen, a document screen, and of course, a slot for Kate's cell phone. Fans of the original will remember getting tons of phone calls from Kate Walker's mother, boyfriend and boss. The cell phone has taken a backseat in Syberia II, as Kate Walker has pretty much severed all connections with her former self. She ends up hanging up on most of the calls she gets. I really didn't mind the heavy cell use in the first game, as it sometimes provided bits of needed info on the story. Now though, you only make a few phone calls that actually matter story-wise, making the phone feel more like a novelty than anything else.    A point-and-click game, the bulk of the adventure will have you moving your cursor around with the Left Thumstick the screen in search of hot spots. Usually, this means mousing over characters to initiate a conversation or scrolling over an item to pick it up. Which brings up problem number one: unless you have super-vision, you'll either need cornea implants or your glasses cleaned and tweaked to find some of the more reclusive hot spots in this game. It is way too easy to completely miss an entire section of a restaurant, bar or what have you just because you don't hold title as the world's best hot spot hunter.     When not rummaging through a hundred billion pixels to activate the aforementioned hot spots, chances are you'll be out solving puzzles. The puzzles in Syberia II are a mixed bag of anything from flawlessly logical brain teasers to completely illogical brain roasters. Even with some frustrations, the game does a pretty good job overall of integrating puzzles into the game world.    For example, early on, Kate needs to wake up a pilot who has fainted after his plane crashes on a snowy mountaintop. The solution is so blatantly logical it's obscene. Not to say the puzzle feels overly simplistic; it just doesn't require abstract thought to solve. It closely resembles something you would do in real life to get yourself out of a similar bind, given similar circumstances.      In true yin/yang fashion, Syberia II's good puzzles are balanced by some truly gnarly ones. I really don't want to get into specifics, as puzzle fanatics may sneak into the IGN offices and murder me for giving away solutions. Suffice to say that I ~solved~ some of the puzzles in Syberia by randomly dragging items from my inventory to whatever hot spot I was standing by. You'll come across puzzles you need to solve just because they're there, not because logic dictates solving it will further your journey.    Other times, you will start puzzles by activating a hot spot, only to find there are a dozen or so mini hot spots making up the entire puzzle. Now, as stated before, it's possible to completely miss the solution to a puzzle simply because your TV was too dark, or there was glare, etc. You'll find yourself begging for those ~find key to open locked door~ kinds of puzzles.     Along the way, you'll also find several books; each containing vital clues to the puzzles dotting the icy landscape. One such book, a journal from a deceased monk, holds the tale of Syberia and the history behind a tribe of natives known as the Youkals. Unlike other books scattered throughout many other adventure games, you'll actually enjoy reading this one. The journal does a great job filling in gaps players may have regarding Syberian lore and comes packed with beautiful illustrations.   A Painting Come to Life  Truth be told, the whole game is beautiful. Subzero conditions have never been so gorgeous. Sure, stills make up most of the environments, but who really cares when they look this good? Plus, the developers employed a variety of graphical touches that turn each still into a living postcard. You'll often see animals scurry about frozen ponds, or watch birds and white owls dart around the screen.    Trees sway in the freezing wind and snow lazily drifts on top of hills and buildings. Character animation looks equally impressive. As Kate Walker makes her way across the landscape, she'll leave footprints in the snow. Leave her alone for too long, and she'll shudder and cough. All characters, regardless of importance, appear to have been animated with utmost care. With a story populated with well-written characters, it would have been a damn shame to have them look bland and lifeless.    Walker, Syberian Ranger  The original Syberia reaped equal amounts of praise for its gameplay, graphics and original story. Unfortunately, Syberia II's graphics outweigh the emotional pull of its story. It's still very well-written, but the first game had a mystery and complexity missing from the sequel. Syberia II is only a continuation of the original story, not a complete story in and of itself. In fact, it feels like Syberia II simply concludes the first installment -- as if it's the last few chapters of a large novel.    What's more, the journey to Syberia isn't about Kate Walker anymore; she's just around for the ride. The story really centers on Hans Voralberg and his unearthly determination to reach the island he's been dreaming about for decades. Initially, I was a little turned off by simply helping an old man get some peace of mind. Progressing through the game changed my mind. This is the first game I've played where you're striving to help a single person reach his own personal holy land -- a noble, selfless cause if there ever was one.      Throughout the game, you'll see Kate Walker mature and grow, redirecting her ambitious determination from her own goals to those of her friends. The transition is subtle, spanning the entire game and is handled exceptionally well. The only other complaint I have is the ending to the story -- it leaves some loose ends and fails to achieve absolute closure for our heroine. And damn if there's one thing we adventure gamers need in our games, it's closure!   Ear Candy  The music and sound in Syberia II rank up there with the genres very best. Each environment lends a distinctive flavor to the music score, with realistic sound effects rounding out the overall sound package. The voiceovers for many of the characters sound especially well done. Each cough, snicker and sigh adds an immense amount of personality to the people (and animals) you meet and draws you deeper into the frozen game world.    Even though I played the game with subtitles, I never found myself skipping any of the spoken dialogue -- it's that good. My only gripe in the sound department, like in other areas of Syberia II, is that the game just doesn't give you enough. Sure, the music far exceeds the tunes in just about any game on any platform, but why must we have so little of it? Most of the time you're just listening to the wind howl. At other times, it's just the sound of your own footsteps echoing throughout some icy cavern.Through its faults, Syberia II conjures a little bit of that magic common during the golden days of adventure games. It has a great, albeit short, storyline that grips you from the get-go. Plus, the story's sense of urgency does a nice job balancing the languid pace of its gameplay. It's a bit too slow-paced for consoles, enough that it may frustrate some gamers. Superb graphics, sound and music push Syberia II above being good, and just short of being great. During an adventure game drought though, Syberia II is a real winner -- a refreshing game rich in narrative, gameplay and style.", "date": "Oct 14, 2004"}