{"name": "Otogi 2: Immortal Warriors", "name_review": "Otogi 2: Immortal Warriors", "ref": "https://www.ign.com/articles/2004/10/15/otogi-2-immortal-warriors", "text": "The original Otogi was an unexpected mini-marvel. Developed by FromSoftware, the game featured incredible visuals and non-stop button-mashing action. A mild success in North America last year, Otogi's addictive gameplay and dedication to throwing as many particles on screen as possible earned it a dedicated fan base eager for a sequel. Fans, your prayers have been answered with Otogi 2: Immortal Warriors.   When last we left Raikoh, he had vanquished Michizane and the demons plaguing the world. With his work done, the undead warrior was once again laid to rest, his soul sealed within his sword until he was needed once more. That time has come, only now the threat to the world is so great, Raikoh will need the aid of five other immortal heroes. It's the addition of these five unique fighters that puts Otogi 2 a step above the original.  I'll warn those who haven't played the first, that Otogi 2 is absolutely, 100%, unequivocal non-stop action. There are no adventure elements, platforming feats, cart-racing mini-games, or prolonged conversations. Enter any level and you'll pretty much do nothing but slice and dice throngs of demons, slamming them into walls that erupt violently, filling the screen with an incredible number of particles. Though different stages offer goals that alter the parameter for successfully completing a mission, you are constantly encouraged to ravage the enemy and destroy every last piece of the environment. If this is not your type of game -- the kind where your singular goal is to kick ass -- you do not want to tangle with Otogi 2. If you're ready to man up, though, this is the game for you.  Choose Your Hero Otogi 2 is broken up into 27 different stages, nearly as many as the first, only now you can choose from several of your warriors. The choices you make will prove important, as each character has their own strengths and weaknesses and play quite differently. While Raikoh remains the most balanced, with power, speed, and magical prowess, he's not nearly as interesting as axe-wileding Kintoki or Tsuni, the wolf man.    In combat, each character has relatively the same controls, so Otogi veterans will have no trouble playing as the new heroes. Every character has a normal and heavy attack, with the heavy attack usually able to smash through even the sturdiest pieces of the environment. All characters can also use an equipped spell, though some characters will be able to use more powerful magic than others. But where Raikoh had access to 33 weapons in Otogi, each character now has a specific set of weapons that only they can use, limiting your overall choices per character, but making for an even more unique experience with each of the heroes.  While playing with Raikoh or the living tree stump Suetake (no really, he's a tree stump) or any other character will still allow you to slam enemies about, the weapons are quite different and the attack styles feel and look unique. Then there is Kintoki, who has a slightly different control scheme than the rest. Kintoki's normal attack is equivalent to any other character's strong attack and the strong attack button is actually a grab button. Grab an enemy and then throw them about, knocking them into other enemies, bouncing them off walls (a spectacular sight), or chucking them far into the sky and almost out of view.   New spells have been added, though the original four remain. Spells work just as before, where holding down the magic button charges a spell but turns you immobile. Spells, however, aren't as big of a deal this time out. In fact, the stress of trying to finish levels quickly due to your ever depleting magic bar (as magic is needed to stay on this plane of existence), isn't as pressing either. Magic is still useful, but is hardly necessary anymore, especially since Tsuni, Raikoh, and Kintoki prove to be incredible warriors.      As you progress through the missions, you'll earn experience that can be spent on any of your warriors various attributes. To make it a bit more interesting, each time you purchase an attribute upgrade for any character, the cost for upgrading that attribute rises for all characters. That means that if you buy three levels of strength increase for Raikoh, if you then want to increase Sadamistu's strength, it would cost a significant amount, just to go up one level. This adds a slight element of strategy, because by the end of Otogi 2 you'll have made use of every character at least once, so neglecting to level up a character in order to make another overpowering may hurt you in the long run.   Replay Value As with the original, there are numerous accessories, magics, and weapons that can be earned by completing secret mission goals. One stage may reward you with a new weapon by freeing every soul trapped within the different objects in a level and another may require you to complete the stage within a certain time limit. These optional goals aren't posted in the game and must be discovered on your own either by accident or trial and error. Since you can replay any level you've completed, anyone who wants to thoroughly destroy every piece of the environment, free every soul, and destroy every demon will certainly be able to unlock ever last weapon and spell. In addition to the types of unlockables seen in the first Otogi, you will also earn special bonuses by playing through a level with a specific character. Play one level with Kintoki and you may earn a new weapon or a special cut-scene, for example.  New bonus missions have also been added, which unlock after each stage is completed. Bonus missions take place on the same stage you beat, but will have unique requirements and an arcade score. You earn additional XP this way, which is a good way to power up characters and most of the bonus missions are pretty good. The best, or at least my favorite, puts you in a grassy area filled with floating demons. You need to bash the demons into the ground to destroy the grass. This leads to an enormous amount of demon baddies bouncing around like rubber super balls.   Trouble in Demon-Bashing Paradise As fun as Otogi 2 is, many of the same problems that hurt the original are back. The repetitive nature of the game has been, for the most part, resolved with the inclusion of new playable characters and there are more bosses this time around to keep things interesting from start to finish. However, the camera is still pretty troublesome. Even when you lock on creatures, the camera can sometimes position itself in an awkward place. While you can auto-center the camera or move it manually, the action is so fast, it's not always easy to do. While you can certainly succeed and enjoy Otogi 2 in spite of the camera issues, the fact that there's been no improvement from the original is a little disappointing.  I mentioned a moment ago that there are more bosses, which is a good thing, but I must say that none of them measure up to the two great bosses from the first -- Michizane and the awesome Crimson King. The bosses are memorable and some are pretty tough, but none offer the same exhilaration felt when first battling the Crimson King. That battle, which took place halfway through the first Otogi remains the pinnacle of the series.  Looking back at the first shows both the good and bad of Otogi 2. The majority of the game is stronger in design and levels don't repeat even though some are very similar, but the last couple of levels pale in comparison to the final few levels of the original. It's certainly a great continuation of the series, but the franchise has yet to put together a an epic piece that consistently provides great missions and combat in every level. My hope is that the third time (if there is one) will be the charm as Otogi 2 shows the promise of a series that could one day put out a true action classic.    Sight & Sound Otogi 2 pumps up the particle effects to an extreme level, even more so than the original. It's an absolutely stunning piece of work that will absolutely dazzle your eyes. The electricity of seeing the Dragon spell cast, with hot white dragon spirits flying at enemies, the brilliance of spirits possessing massive statues and bringing them to life, the beauty of a demon bouncing off the ground, kicking up dust, and then crashing through a wall in a powerful explosion of demon ooze and broken stone -- it's amazing.   All of this extra visual oomph, however, has resulted in a significant amount of slowdown in many areas of Otogi 2. While not noticeable in every level, there are a number of times where you'll find yourself surrounded by enemies, tapping buttons to unleash a string of attacks, only to have the game chug, dropping the framerate down to 20 or even 15 frames a second. Sometimes it's so bad, with the particles and enemies overtaking the entire screen, that Otogi 2 almost comes to a halt. This occasionally will affect gameplay, but usually is more of a visual annoyance. If not for this, Otogi 2 would easily be among the best-looking Xbox games available.  In terms of audio, Otogi 2 hasn't added too much in terms of enemy sounds or better effects. The English dub is decent, but nothing particularly great. These are ethereal heroes and the voices seem all too grounded in reality to properly works, but the Japanese dub is always an option if it suits your ears better. The score remains a strong point in the series, with oriental strings offering an interesting contrast to the over-the-top action. Beautiful music indeed, so much so that I love to leave Otogi 2 on while I work, just to listen to the score. It's haunting and beautiful, much like the game itself.   Otogi 2 is not a major step forward from the first. The addition of the new playable characters is a big boon in terms of keeping the game fresh from start to finish, but there's not much progress here otherwise. It's still a very fun game and a better one than the original, but FromSoftware has yet to turn this one into the masterpiece it could be. Action fans will love it as it's a non-stop butt-whoopin' good time. If the term ~beautiful destruction~ gets you all tingly inside, this is the game for you.", "date": "Oct 15, 2004"}