{"name": "WANTED: A Wild Western Adventure", "name_review": "Wanted: A Wild Western Adventure", "ref": "https://www.ign.com/articles/2004/10/18/wanted-a-wild-western-adventure", "text": "I'm as big a fan of the Western as the next guy. Give me some Clint Eastwood or Tombstone and I relive my days of Cowboys and Indians, back in the day when your thumb and index finger were permissible weaponry. So it was with much delight that I took on Wanted: A Wild Western Adventure. Unfortunately, anticipation quickly turned into disappointment. It had a western theme and it was a point and click adventure, but I doubt anyone would want this game, and it certainly isn't what I would call wild, unless you consider wild to be choppy audio, long loading times, frequent crashes and the joy of watching the main character walk around -- a lot. It's not all bad -- the tongue-in-cheek story and the voice acting, when it isn't stuttering, are solid.   Our hero goes by the name of Fennimore Filmore. He rides into town and, well, it appears he's a Peeping Tom. This apparently isn't a bad thing, though, as he saves a farm from destruction with some artful shooting. He is taken in and fed some yummy artichokes, which he promptly passes out from, since he's quite allergic. He awakens the next morning to discover Billy, the farmer's son, has gleefully taken Fennimore's guns. And so the game begins. The objectives are clear: Fennimore must help the farmers save their land from the evil Starek, the Governor of this territory, who happens to want said land.   Right off the bat, the weaknesses of this title are apparent, as it is impossible to skip through dialogues or cut-scenes. You must sit there and listen. Heaven forbid the game should crash without being saved -- those same dialogues and cut-scenes must be repeated. As such, saving as often as possible is a must, especially after any long cut-scene. And it isn't that the cut-scenes and dialogue are bad, at least the first time through. However, on the third or fourth time, they simply become loud and annoying. Saving after every dialogue may seem tiresome, but I would recommend it. Unfortunately, there isn't a quick-save option to make this any easier. Saving involves hitting the space bar or the escape key, clicking on save game, and selecting the empty box to save it in.     The dialogue itself is witty and often entertaining. It is very much tongue-in-cheek and has some very interesting references to modern times, along with some out-of-place items in the game. For example, in one particular dialogue, there is a reference to our current President and the war. There are also robots, bullhorns and mobile telegraphs--all out of place in a western-themed game but all very much in place in this one. Our hero himself is, at times, hapless and, at times, brave and able. This dichotomy makes Fennimore a very interesting character indeed. By the end of the game, I really like him and some of the other characters we come across. On this point the developers of this game succeed.   The puzzles have an action slant, and there is a possibility for death...another reason to save often. One puzzle involves slapping a fish into a basket; perfect timing is critical in this and many other puzzles. Another fun little game involves shooting targets. The game is completely point-and-click, so shooting is done with the mouse and can range from easy to difficult, depending on one's ability with the mouse. I found the shooting game to be great fun and played it repeatedly. Doing so gave me a store of cash that I thought I might need.   Money is an important part of the game and is in short supply early on. Fennimore finds money laying around in drawers and closets. Later on, he can also get it from faraway friends through telegrams or many other means. By the end of the game, money is no object. Another activity to be managed, which is actually a more frustrating thing, is feeding Fennimore's horse. The horse eats carrots, which can be grown on one of two farms or bought from the general store. In the early game or when you run out of carrots near the farms, growing carrots is the only way to feed him. Growing involves taking a water bucket, filling it with water and then watering the crops. After waiting a certain period of time, carrots suddenly mature and Fennimore is able to take them. The novelty of growing them the first few times grows thin as the game progresses and, by game end, is just a time consuming, pointless act.    There is one part of the game I found particularly entertaining at first and then just frustrated with by the end, and that is the Spicy Sasparilla Duels. The key to this game is to learn all the opponents' key phrases, by repeatedly dueling them and asking them ones you don't know. One person states a phrase and the other has to reply with a phrase that rhymes. The only problem here is the same problem that exists everywhere, no way to skip through things. It becomes a needlessly time-consuming venture. If you beat the person before getting all their phrases, you have to leave the bar and come back in to reinitiate. Every duel begins with the bartender serving the drinks in an animation you'll quickly get tired of. The duels themselves are battles of words. For example, one may say, ~They tell me you drink like a sissy.~ And the other would respond, ~You'd know about that, now wouldn't you, missy?~ I enjoyed learning the new phrases, but the slowness of it is not fun at all.   Beyond all of that gameplay, the biggest frustration to me was the lack of a naturally logical progression of the game. Sometimes, I got stuck trying to figure out what I should be trying to do next. I would have no idea what would make sense to do next, so I'd just go around talking to everyone and doing everything possible, hoping I'd hit upon something to give me a clue as to what I should do. One such event was with the duels themselves. After I completed two duels (there are four total), I couldn't get another dueler, so I wandered aimlessly trying to discover what I needed to do to make another appear. I finally had the good sense to talk to the Sheriff again and he gave me a clue as to what I should do. If you miss a dialogue for any reason, there is no way to pull it up--chats are not saved and there is no objective listing. So, pay very, very close attention to every detail.    The graphics are very nicely done. They are cartoon-like, bright and vivid. The animations are smooth and do add a dimension of humor. I loved how Fennimore was able to store things on him, no matter how big, and the animations made light of it. The cut-scenes were very well done as well, even if there is no way to skip them. One area of annoyance is the long load times between scenes, such as entering a building. It's been a long time since I've sat and started at a black screen for 10 seconds or more waiting for the game to load.    The voice acting is very good. I found some of the dialogue to be difficult to convey and the actors had a hard time pulling it off, but they mostly did. The sound effects and music were well done. The only problem with audio was some stuttering in certain places, particularly where Fennimore starts to talk. It's just another item that could have been fixed easily enough and wasn't--taking this from a great game to a mediocre one.   Finishing the game is rewarding, as there are some cute ~out-takes~ at the end. Getting to the end of the game, though, with all the slowness built into it in a very contrived fashion, isn't fun.  I really think this could have been a title to be talking about--a great adventure game. The story was really well done and they had some obvious talent behind the game. However, the oversights involved in not allowing cut-scenes and dialogues to be skipped and allowing many bugs to slip through take this game down a few notches. At the end, all I can talk about with this title is what could have been. It could have been a contender.", "date": "Oct 18, 2004"}