{"name": "Red Jack: Revenge of the Brethren", "name_review": "Red Jack: Revenge of the Brethren", "ref": "https://www.ign.com/articles/1998/10/21/red-jack-revenge-of-the-brethren", "text": "CyberFlix first introduced its unique interpretation of 3D with Titanic: Adventure out of Time. Of course, by 3D we're not talking about something akin to Quake or Unreal, but rather a much slower, more detailed environment, which allows players to navigate and explore on pre-determined tracks with a surprising amount of freedom. Applied to Red Jack, this engine enables players to explore a variety of richly detailed environments searching for clues in an ancient pirate mystery. Along the way, Red Jack also offers a host of action sequences, which generally hold up pretty well for an adventure game.   As the young aspiring pirate Nicholas Dove, your first challenge is to convince the captain of a visiting pirate ship that you've got what it takes to join his crew. To do so you'll need to prove both your physical and mental strength. Once you've made it clear that you're pirate material, the real adventure begins. CyberFlix demonstrates its ability to deliver a well-crafted adventure game from the opening minutes with a seamless integration of story and gameplay lessons. Before you know it, you'll be off the island of Lizard's Point, sword in hand and ready to deal with just about anything that comes your way.  What Red Jack does best is offering a mix of action, puzzle-solving and exploration. While the action gameplay isn't going to challenge any of the dedicated action games on the market, it is head-and-shoulders above the ill-fitting sequences you've seen in other adventure games. The sword fighting alone is enough to make you grateful they put in the effort. And then there's the puzzle-solving, nicely integrated into the game and reasonably challenging without going overboard. In fact, the only criticism of the puzzles is that  they 're a little too easy to solve.  But what really makes Red Jack shine is the exploration. From the pubs of Lizard Point to the darkest caves of Red Jack's island, there is always another corner of the world that needs to be examined. As for what you'll find along the way, there is everything from the typical keys and gold statues to high-powered cannons and pirate journals. Unfortunately, although it may seem like a blessing as you play the game, you will find very few red herrings to throw you off your path leading to a conspicuously linear adventure.  The game does have a rich cast of characters, who naturally enough hold vital information for solving the game's many mysteries. For the most part, the characters do a good job of drawing you into the atmosphere of a pirate adventure, but the occasional bit of bad voice acting reminds you that you are indeed just playing a game.  Red Jack is solid, not brilliant, but adventure game fans will enjoy it for the adventure game experience, the rush of solving a cleverly-devised puzzle, or the satisfaction of finding that one lost item. It is a rich and exciting adventure on the high seas.   --Patrick Baggatta", "date": "Oct 21, 1998"}