{"name": "Yourself Fitness", "name_review": "Yourself!Fitness", "ref": "https://www.ign.com/articles/2004/10/18/yourselffitness-2", "text": "Today, God help me, I bought an exercise step.   A week ago I bought some hand weights.   I am beginning to enjoy a daily fitness routine in front of a television set.   Yourself!Fitness is the only type of product that could make me do it. Meet Maya, my personal trainer. She's an incredibly fit, talkative, energetic individual who motivates me to exercise -- And she's all digital. Developer ResponDesign's motto is ~Games that are good for you,~ and this is my first experience where that actually proves to be true.   Yourself!Fitness is a complete fitness program on a disc - exercise, diet, motivation, and fitness tracking are all included. Your host is the aforementioned Maya, a dynamically generated digital personality who guides you through all aspects of the application. You need nothing more than an Xbox and a television set to partake. Oh, and you need space, too. Lots of space.   The program boasts 500 different exercises ranging from yoga to Pilates, integration with common fitness equipment, dynamic environments, multiple genres of music, meal planning, and individual fitness goals and tracking that would attempt to sway you from buying tapes and gym memberships. How well does it work? How well does it work for me, a purposefully lazy 32 year old gamer?   Round is a Shape, Right?  Upon booting the program I watched a sample workout and my muscles locked in horror. There's no way I can do this. But I paid thirty-five dollars and I'm going to try. Money is a motivator. Usually works for me. I created my profile with my name, and the program proceeded to ask me a few questions -- Sex, age, height, weight, and current level of activity. Of the three given descriptions I chose the closest to ~moves like a cave floor.~   The program then measured my pulse in a relaxed state, which could only mean one thing: it was next going to measure my pulse from a decidedly non-relaxed state. On come the jumping jacks! Maya instructed me to follow the onscreen avatar in jumping jacks for two minutes. The avatar started slow, but eventually increased its pace to three jacks every two seconds. Owie. The heart was moving, and frankly I was stunned at the speed -- Rate measured, ambulance circling. Next, I had to do as many standing squats as I could, but also keep them in good form and at a pace of the onscreen avatar. Not bad. Next, pushups. Not many. Then, crunches. I saw some long-dead relatives around this point. Last came a flexibility measurement. Sit on the floor, legs out, feet 12 inches apart, and bennnnd. Hold it. Now compare yourself to the onscreen bendy dolls and choose the closest one. I got as far as my calves.    Special note -- one of the bendy folks on the screen is actually folded face first into the floor. Ha ha, Maya is such a kidder! Let's all go to the circus!     The program now asks you for your exercise focus -- Weight loss, cardio, upper body strength, core (middle) strength, lower body strength, or flexibility. The program had already noted that I was outside my weight range for my height (6'2~/230 if you must know), so it automatically chose weight loss for me. Thanks. I begrudgingly approved its recommendation and entered my goal weight. Maya then calculated my fitness schedule based upon my level of fitness and my targets. Sunday through Friday, a mixing of 30 and 15-minute workouts. I was impressed! Mostly because I could then go to bed.   Put on Your Leg Warmers  Along came Monday -- and thus started the regiment. Maya chose cardio for my first workout, but I could have overridden it if I wanted. I could have chosen the other targets (the strengths or the flex routines) but I figured Maya knew best.    I was now able to choose how I wanted to work out -- I was given a chance to override the workout length, but again, Maya knows. I could choose my music (3 choices), and my workout environment (2 choices). I also had a choice of fitness equipment -- Heart rate monitor, hand weights, step, and flexibility ball. You know, a yoga ball? A Hippity-Hop ball without the handle? At that time I was thinking, ~Hoo hoo, yeah, right. I'm gonna buy a step. Look at me, I'm Mr. Healthy Ned Flanders climbing on a step.~ Feel free to re-read the first few sentences of the review as I hang my head in shame.   Now, before I get started on the actual exercises, keep in mind you can also begin the game and just start exercising from the main menu. Maya will ask you what kind of workout you want -- Cardio, upper body strength, lower body strength, core body strength, or flexibility. Choose your workout length, music, available fitness equipment, environment, and wham, you're off exercising -- but unless you're showing off the game for the curious, it's best to keep with a profile. The true benefit of Yourself!Fitness is in tracking your accomplishments and advances, and a guest profile workout is pretty tough in comparison to my personal profile workout.    So, there I was in the dojo, with virtual Maya, warming up. She then asked me how I was feeling. Wha? Yeah, the game takes your mood into play when going through the exercises. You basically answer great/fair/bad, and she takes it from there. Maya makes some cute small talk, takes a second to find the beat of the song and you're off!   Goodbye Baby Fat, Hello Supermodel Girlfriend  STOP. WAIT. What the hell is a side kick warmup? Step touch what? Never fear -- at any time you can hit a button and an animated tutorial of the move in question is shown to you. You can zoom in/out, change views, speed it up, slow it down, and all the while Maya is telling you how to perform the exercise. Very nice. Exit this screen, and there's Maya again waiting for you, getting the beat of the song. Speaking of songs -- the music rotates within your chosen genre, but you can always skip a particularly grating song through the menu during your workout. Nice touch.   Along the bottom of the screen is a bar that progresses as exercises come up. This bar shows your current exercise and its difficulty on a scale of 1 (easy) to 5 (opposite of easy). As the bar makes its way across the screen, the next exercise creeps along so you can prepare. For example, if I am doing a step touch, I continue to do the move along with her until the next 'move bar' comes along from the right of the screen. It happens to be a set of crunches, so I can reserve my mental anguish for the upcoming crunches, and also get into position. It is with these upcoming moves you can also retrieve your exercise equipment if needed. A small icon of hand weights may accompany a plie, or you might see a step icon moving along with a step exercise. It's all very intuitive. Breaks are interspersed in the routine, and I am only assuming that I am getting a lot of breaks due to my relative inexperience and -- Oh let's face it, because I'm horribly out of shape. For longer routines, you even get water break reminders. How great is that? Maya also gives some good (yet pretty generic and repetitive) encouragement while exercising, and also gives some quick pointers on how to properly perform your current exercise.   Keep in mind that every workout routine is different and every routine is dynamic. For example, Maya had me do some tough cardio work. After a few minutes, she asked me how well I kept up -- Was it easy, just right, or too hard? Based on my answer (guess) she could change future workouts of the same type, and also change my current workout to go easier on me.    So my workout was done. Bleah. Tired. The end of a workout might show how many calories you have burned, or it might show you what new exercises you experienced in that particular workout. Back to the main menu. ~That was a great session -- be sure to come back Tuesday for your next workout!~ Talk about a love/hate relationship. From the main menu there are some other options that are tuned to your profile.     Find Your Ying, Relax Your Yang  Meditation Garden is a yoga exercise yard. Usually around 20 minutes, Maya goes through a patterned yoga routine. I am not ready for this yet. Oh, but I've tried. She goes through a pattern of stances, spelling them out for you as she goes (monkey, into down dog, then into crocodile). She usually goes through two or three patterns in a session.   Selecting commitment from the main menu allows you to see your recommended schedule and target focus area (and allows you to alter both). It also lists meal plans with some great ideas for meals within specific calorie levels.    Choose progress from the menu and you'll see tracking of your fitness evaluations. You see, every 10 workouts you have to do another fitness evaluation consisting of the exact same exercises (two minutes of jumping jacks, etc.). It scales these in graph form to give you a quick synopsis of your progress. Again, very clever, and very motivating.   I do have some serious questions of the program however. Some of the features would be more beneficial if they were implemented just a bit better. Take the food menu -- while there are a great variety of choices and food styles, Maya really doesn't recommend anything for you. She basically points out there there's a menu of food choices for you at specific calorie levels, and that's about it. How about tuning the menu to my targeted weight loss?   Another oddity is the meditation garden. While I am sure the routines are fantastic for someone more flexible than I am, I have no idea if or when I am supposed to use this thing. Is it a workout? Is it a relaxation area? Why would I go in there? The manual does not provide much depth.    Also, I like to work out at night. If I start a session on Tuesday night that happens to last until Wednesday morning, I'm not sure what day I get credit for. Maya tells me to come back on Thursday. Did I just do two workouts, or did I not get a workout on Tuesday?   24-Hour Fatness  Graphically, the workout environments are acceptable. The program uses RenderWare and it is obvious they paid the most attention to Maya. Some of the background sprites are those flat 2D rotating models held over from the Wolfenstein days -- rotate the screen and the sprite rotates with you. Not a biggie, though. Maya is the focus and she looks really convincing. She is more of a human being than, say, the Dead or Alive girls. Not that there's a problem with that. Her animations are fantastic with the rare robotic move. Even her transitions are very well done; smooth moves from one exercise to the next. She has a bit of an odd floating look to her but it really doesn't detract from your primary focus.   The music is suitable but ResponDesign would do well to incorporate custom soundtracks in future versions. You have to use the fairly generic workout music that is supplied due to the strict ~aerobic~ tempo and the proprietary algorithm for Maya to find the beat of the song. Can't work out to Dragula after all.   While we're on the subject of the music and environments, Yourself!Fitness has set up a reward system for consistency -- stay with the program and increase your ~membership standing.~ With higher credentials comes new music and environments. I am a bronze member now because I have not missed a session, and for that I get new music and a new environment. It might not mean much on paper, but it is nice to hear a different genre of tunes -- something even Maya agrees to sometimes. ~I wasn't into that song, either.~ Oh, Maya!   Another small issue I have with this game -- I am male. I'm sure of it. I see physical evidence at least once a day and mental evidence every three seconds. So ResponDesgin: let's act like men can be a part of this, too. The Yourself!Fitness web site is woman-oriented, as are all the in-game graphics. The loading screens feature tips and advice from Prevention magazine, and some of the statements are geared directly towards women. I understand the desire and design to get women more interested in gaming and consoles in general, but let's not be solely focused on one half of the population.   ResponDesign has promised future products in this series, perhaps some that aren't so focused on the idea of a female-only audience. I'd like to see some features added and existing ones cleaned up. Xbox Live Aware (~Sonic is playing Yourself!Fitness and can barely do a pushup.~) would be a nice one, as would custom soundtracks.     Yourself!Fitness is a one-of-a-kind product that attempts to reach out to a different type of audience. Much like Sony's EyeToy or Konami's Dance Dance Revolution it is very hard to classify this title. Workout program? Lifestyle program? Self-improvement title? However you peg it, those of you looking for an alternative to an expensive gym membership or a series of pricey videos will find something special here. Maya is an excellent mentor who gives more attention than a video can -- she asks questions and will help you with specific exercises, and that's more than some gyms will even offer. If ResponDesign can integrate some features just a bit tighter, incorporate your music preferences just a bit more, make the environments a bit more real, it will have a complete winner. Downloadable content seems to be a good fit for future titles -- will ResponDesign take advantage of the Xbox in this regard?", "date": "Oct 18, 2004"}