{"name": "Fatal Frame 2", "name_review": "Fatal Frame II: Crimson Butterfly - Director's Cut", "ref": "https://www.ign.com/articles/2004/10/19/fatal-frame-ii-crimson-butterfly-directors-cut", "text": "Survival horror isn't exactly a happening genre on Xbox. There's little in the way of zombie and spook games on Microsoft's console outside of a handful of mildly successful thrillers. Fans of the genre have been forced to turn to GameCube and PS2 to fulfill their survival horror jones. Finally a ray of hop in the dismal Xbox survival horror world has emerged. Fatal Frame II: Crimson Butterfly - Director's Cut is the ultimate late-night fright game. No, it doesn't involve blowing zombies in half with a shotgun, instead, FF 2 plays like a classic Japanese horror flick. It's eerie, atmospheric, and will give just about anyone the willies.  Fatal Frame II takes place some 30 years before the events of the first game. While you don't need to have played or have any knowledge of the original, fans of Fatal Frame will get an extra kick about learning the origins of the Camera Obscura -- a device that can capture the essence of lost (and often angry) souls.   You play as pre-teen twins, Mio and Mayu, who are enjoying a nice view by the water before inquisitive Mayu wanders off after some odd crimson butterflies. Mio follows and the two find themselves in The Lost Village, a mysterious town with a dark and bloodied past. It is from this point that the game kicks into full gear, never stopping to let you catch your breath. I wouldn't think of revealing any more of the story, but trust that it is a great horror tale. Since there's no loading whatsoever, the experience is seamless from start to finish as if you were living out a movie instead of playing an adventure game.  Photographic Memory Fatal Frame II is unlike any other survival horror game out there. This is not the blast-fest of Resident Evil nor the gore-crazy frenzy of Silent Hill. You have but one weapon, an old camera. Using lenses and filters found throughout your journey, you'll battle the dead by taking their photograph. The better the picture (yes, framing your subject matters), the more damage dealt. And as you progress through Fatal Frame II, you can upgrade your camera as if leveling up your character in an RPG, giving you some control over how you will fight ghosts. Do you want to invest in a filter that slows ghosts or would you rather increase the power and range of your camera? The choice is yours and upgrades come at a rather steady clip, so you will be constantly improving the Camera Obscura.    Don't think of FF 2 as some sort of undead Pokemon Snap -- it's not. This is a truly frightening game, easily the scariest I've ever come across, and the ghosts you encounter play for keeps. Some ghosts zip back and forth, some come at you as slow as a snail, others will disappear in a cry of agony only to pop up behind you. You never really know when the baddies will appear and the almost inaudible score allows for plenty of quiet moments that are just a little ~too quiet.~  Along with ghosts you must battle, there are also numerous entities that are merely tortured souls. These may appear out of the corner of your eye, floating down a hall, cowering in a corner, or crying from inside a wall. Snap their photos to earn bonus points you can use to upgrade your camera. You can also keep a photo gallery of your snapshots for later viewing. Maybe you can turn it into a slide show should you survive The Lost Village?  As if the numerous anguished cries of the dead weren't enough to keep you on edge, there are loads of cut-scenes that are triggered regularly showing flashbacks to horrors of the past. These graphic scenes often mix with the current realm to create a sort of living nightmare. And while the scenes --which require no loading or transition times -- are unsettling, they also often progress the story, raising questions or giving clues to the mystery of the Village and its history.    Red Dead Adventure The original Fatal Frame had quite a few issues. It was a good idea, it just didn't seem to pull all the essential elements together into one kick-ass product. The original was very confined, offered troubling Resident Evil-style controls and camera angles, and was a bit too simple and easy for its own good. The sequel fixes many of these things.   Instead of exploring a cramped mansion, Fatal Frame II allows you to explore an entire dead city, along with numerous indoor environments. Though you have a large area for exploration, you won't be getting lost at any point. That's because you are often restricted from where you can enter, but while this sounds punitive, it actually helps keep you focused on where you are meant to go and limits the amount of frustration from being lost.  Despite the large area to explore, there is a lot of backtracking, even from the get-go, as you must retrace your steps through the initial house several times. This wouldn't be so bad if Mio weren't so incredibly slow. She seriously moves at the speed of a zombie. No, wait, slower than that. Even her running pace is that of a toddler. It's my main complaint, the one aspect of gameplay that really frustrated me, because you do have to travel a lot in FF 2 and you can never do it quickly.  However, there is, perhaps, a reason for this. You can never really escape the ghostly apparitions that appear, because you seriously cannot outrun them. This means your defense can't involve earning a lot of distance from your foes, but instead requires that you position yourself in a good spot in a room or hallway so that you can advance and retreat as needed.   While I have some issues with the backtracking and Mio's snail pace, I can't say enough good things about the puzzles. There's a wide assortment of adventure-style puzzles to be found. Some are time-based, some word puzzles, and others that are essentially fetch quests. Though the first few chapters are relatively easy with very simplistic puzzles, things get much more involving and interesting as the story deepens. There are some great puzzles to be found and what's great is that there's always a little uneasiness when doing anything in Fatal Frame II, because you just never know when something is about to attack. The morbid nature of the tale, the muted colors of the dead city, and distant sounds of invisible enemies keep you unsettled.   First-Person Horror The PS2 version of FF 2 and the original game both had a similar problem, which I mentioned earlier -- they suffered from the crappy control that plagues most every survival horror game. If it weren't for the Tecmo label slapped on the box, you might swear this was running off an old RE engine, as the third-person control of your character places you in an environment with a static camera that keeps you from having proper perspective while moving. It feels like you're maneuvering a puppet around a stage.   For the Xbox version of FF 2, Tecmo has found a solution. There is now an option for a First-Person mode. You can always choose the Normal mode, which is your typical third-person survival horror shin-dig, but I don't recommend it. Yes, some are okay with this perspective, but I think the control sucks. I highly recommend starting a game in first-person instead. This eliminates all of the issues with the bad control as you now experience the game with standard FPS controls. What a difference it makes.  I love the First-Person mode, because it not only solves control issues, but it works perfectly for Fatal Frame II. This is a horror game, one that needs you fully involved, to be completely wrapped up in game, so that it can then scare your boxers off. If there is a Fatal Frame III -- and I'm pretty certain there will be -- first-person should be the only option. You really get a great sense of perspective and because your field of vision is more limited, it's a lot easier to get surprised by the sudden appearance of a ghost.      In first-person, Mio still moves like a slug, but it's a little more bearable. In combat, you are a bit limited in what you can see, because you are playing in first-person, but it's also a little more exciting. You have to watch your surroundings, because you can't see if a ghost might be sneaking up on you. Fortunately, there is a 180 degree turn button, which helps greatly since the turn radius is ridiculously slow. First-person is more intimate and in some ways a little more difficult since you can't see what's behind you, but it's also a lot more fun than the third-person perspective.  The first-person perspective does not solve some of FF 2's other problems, namely when your twin gets in your way. Sometimes Mayu will cower in-between you and a ghost, ruining your shot, or she will follow you into a door and then block your path. All very annoying little glitches that distract from the game, taking away some of the fright temporarily and replacing it with frustration.  Unfortunately, there's no way to switch perspectives during a game. If you start a new game in first-person view, you are stuck there until the finish. Now, the finish will only take you 8-10 hours, but it's still a very fulfilling experience.  Once you've beaten Fatal Frame II, you can play through on a harder difficulty or you can try the new survival mode, which takes FF 2 into a more arcade realm. This is your standard arena battle, only it's just you, your camera, and an endless supply of ghosts. It's a nifty little mode that works well, but it's really not the reason to play FF 2 It won't scare the bejeezus out of you (and we could all use a little less bejeezus in us), but it will give you something to do for a little while.   Fatal Frame II: Crimson Butterfly is a unique horror game, one that tests whether you are really a fan of being scared or just a fan of cutting zombies in half. This is not an action game, it's a slow-paced adventure yarn packed with creepy noises, horrific imagery, and a great sense of the macabre. If you want zombies exploding onscreen, go elsewhere. If you love movies like The Ring and want a truly creepy experience, this is your game. While there are still some issues, this is a definite improvement over the original and with luck the third installment will lead to the survival horror promised land with a tale and an experience that is second to none.", "date": "Oct 19, 2004"}