{"name": "Law & Order: Justice Is Served", "name_review": "Law and Order: Justice Is Served", "ref": "https://www.ign.com/articles/2004/10/20/law-and-order-justice-is-served", "text": "is the latest Point & Click crime drama to hit the PC.  Based upon the popular television series, this is the third installment of the series to be released.  It comes with the first game, Dead on the Money, a bonus to anyone who missed that first title.  It has everything you would expect, an interesting crime and a surplus of suspects all hiding something.  Several actors from the show lend their voice, so it is an authentic interactive experience and a solid title for any fan of the show.  Two tennis players enter the woman's locker room, speaking barbed words to each other in heavily accented voices.  One of them notices the body of a woman on the floor and screams.  Fast forward - we are partnering with Lenny Briscoe on this part of the case and have to search for evidence and interview the witness.  The victim, Elena Kusarova, was an aspiring tennis star coached by none other than Patrick McEnroe.  As the case proceeds, you'll discover a player boyfriend, a shady agent and an overbearing mother -- a perfect mix of suspects.    The game is split into two parts, much like the television series.  The first half involves accompanying the detectives as they investigate the crime.  Evidence collection and analysis, research and interrogations will all be important to discovering the identity of the murderer.  There are also surveillance and psych evaluations at your disposal.  Eventually, enough evidence is obtained to obtain search warrants and, finally, an arrest warrant.    After the arrest warrant is issued, the second half begins.  Serena Southerlyn, ADA, graces the screen as our partner in this section.  More investigation is required, but more importantly - the trial begins.  A computer gives you access to all the information you'll need, including those important objections.  Witness and evidence lists must be created before entering the courtroom.  Once on the stand, witnesses answer questions and explain evidence.  When the defense attorney cross-examines, you'll have to be on the ball with your objections -- some questions are ok and some violate the rules.   There are, of course, some puzzles -- what adventure game is complete without them?  They aren't convoluted and fit well with the story.  For example, one involves piecing a torn note back together.  There are a few ~figure out the combination~ puzzles, but all of them are easily solved if you have an observant eye.  Another puzzle involves moving boxes around until you can get through to the other side.  I enjoyed this aspect of the game a great deal.  The interface is clean and simple.  This isn't one of those games where you have to constantly save -- you can't really mess up too badly.  Dialogue gives you several options to choose from, but you can't really mess it up.  Until you ask the right questions, it doesn't close.  Finding evidence on the screen is pretty simple.  There's no real pixel searching to worry about.  Everything about this game is logical and easy -- which I guess could be a bad thing.  The point of the game is to have fun and enjoy the story.  There isn't a lot of challenge.  The graphics are attractive.  The characters from the show are instantly recognizable.  All the animations are fluid, although they could have been a little better.  The voice acting is top-notch, as you would expect.  The moment the game starts and you hear the familiar music, it instantly puts you in the mood.  Both graphics and sound are solid.  Law & Order: Justice is Served is a very good game and it does exactly what it is supposed to do.  It contains a really interesting case to solve and an involving story, along with some great game mechanics.  It is a little short, as most of these games tend to be.  I'd have loved for them to jam two cases into the game, but I guess if that were the case, it wouldn't have been as well written.  This isn't a game for people who don't like the show or point and click adventures, but for those two segments of gaming society, it's perfect.  The essence of the television show is beautifully captured, something a lot of games based on TV shows rarely do.  Including the first game in the series is a big plus for anyone who hasn't played that one.", "date": "Oct 20, 2004"}