{"name": "Ape Escape: Pumped & Primed", "name_review": "Ape Escape: Pumped & Primed", "ref": "https://www.ign.com/articles/2004/10/21/ape-escape-pumped-primed", "text": "Mmm monkey loving. The kind of all-night escapades that left you sore for hours the next day, you know what I mean? If you don't, then you probably never laid your hands on the carpal tunnel-inducing action of Ape Escape or Ape Escape 2 that were on the PSone and the PS2, respectively. These were both platformers that had some of the most innovative uses for the dual-analog controller before or since. After the second installment failed to convince gamers to shell out the cash the series has gone in a different direction and is now a party game that's called Ape Escape: Pumped and Primed. The clever control schemes and goofy graphics lend themselves well to the genre, but without a tremendous amount of variety this is a short-lived party.   To understand what the whole Ape Escape thing is all about is to know that the gameplay is all about stick control. While walking around the left analog stick is used for moving the people or monkeys around while the right stick is used for control of the different devices. It's a huge evolutionary step from the classic Smash TV controls where one stick was movement and the other was used for shooting. Since there are no guns in AE:P&P these controls are a little more interesting for the five different weapons.   To attack other characters there are a few different choices: Stunclub, RC Car, Dash Hoop, Slingshot, and Dragonfly. The Stunclub is the most traditional item here and works like a regular sword. Tap the right stick in the direction you want to hit and the character will strike in that direction. Do a few circles with the stick and the character will spin the Stunclub around for a circular attack. The Slingshot works in the opposite way by first pushing the right stick away from the target to pull back. By releasing the right stick the Slingshot fires its ammo at the target.    The only other direct weapon in that that's its only use is the RC Car. By tapping the R3 button  an RC car appears at the foot of the character and the right stick controls its movement. The car can pick up coins in the different levels as well as explode with another R3 tap. The character can still move around at the same time which lets players do two things at once on the screen. If everyone runs around and uses cars, then there can be as many as eight things running around at once.   The last two items are the Hula Dash and the Dragonfly and they require some constant circular motion to work. By spinning the right stick the Hula Dash spins around the character, letting him run faster and knock others over. This is crucial for winning sprints as well as just avoiding enemies and knocking some coins out of them. The Dragonfly may not have any offensive attack, but by jumping in the air and spinning the right stick this will twirl the paddle over the character's head and fly her across a chasm.    With some crucial items to use and the need for switching them quickly, the face buttons are assigned to four of the items. The specific assignments are chosen in the screen right before each match so that everyone can customize their loadout and placement. The rest of the controls fall to the shoulder buttons for jumping and firing of weapons while in other vehicles.   There are a few different vehicles that also make extensive use of the analog sticks since this is an Ape Escape game. A tank is moved with each stick controlling a tread and a submarine is moved around with the left stick controlling thrust and strafe while the right stick controls the direction. The toughest one of them all is easily the boat where each stick is used to control an oar in the water. Nothing says Carpal Tunnel Syndrome like trying to spin both sticks in opposite directions with the thumbs and try to steer and shoot at the same time.      With all of these novel game mechanics in place and working out just fine it's a shame to see the Ape Escape legacy get crammed into a party game. What made the original games so much fun was that solving the puzzles required some creative solutions to the different problems put out there. Here, the challenge is to use these same creative ideas for knocking others around and winning in different events. As a result the game is pretty much fun for as long as the thrill of beating up a little monkey with a little girl lasts when combined with a few friends trash-talking each other.   The non-vehicle segments of the game are easily the best parts of the game with their mix of different weapons that are available and arenas that provide for plenty of chances to knock each off the edge. With one of the arenas taking place on blocks of ice that can be smashed with exploding RC Cars this gets even more frenetic when the ground itself gets obliterated. Since it's possible to knock coins out of each other just like poor little Sonic when he stubs his toe beating each other up is fun and lucrative and provides some good back and forth action.    Apparently the arenas aren't enough and so there are a few courses where the characters need to move along with the camera over an extended course that takes place on hovering platforms. This means that characters can fight each other of what feels like a complicated treadmill while tying to get all of the coins. It's a little bit of fun, but since the camera angle makes depth-perception exceptionally difficult this provides for plenty of times for players to wonder why they keep falling off or where they are at all. Many jumps that look perfect will drop monkeys off into oblivion. Either the game is trying too hard (too many things happening) or not hard enough (not enough control), but these become more tedious than entertaining.    As for the vehicle levels, these are so simply executed that they become even more transient in terms of being fun to play. The big joke here is that monkeys and other silly characters are on stupid looking vehicles. While seeing a monkey riding a tank that has a pot of flowers on it is pretty hilarious the straight-up game of slowly moving a tank and firing missiles on a one or two level arena get old quick. The same can be said for rowing a boat against a friend or the submarine level which has 3D warfare with lots of torpedoes.    The biggest draw for AE:P&P is that it is a decent party game that gets better with more people, but even that has its limits. It gets even worse when playing against the computer since the single player experience is a little deeper, but less entertaining. Boss characters are included for some long and tedious battles and there are obstacle courses that are much longer and more complicated than the multiplayer versions. With lots of perspective problems and an almost infinite amount of opportunities to fall off, winning the game definitely proves something, but we haven't quite figured out what yet. It's a shame to see a series like Ape Escape, a franchise that could've been a contender, become something more like a carny show. Instead of the cleverness that ran through the original platformer games, this party game uses some of the ideas well, but then cripples them with a game that doesn't do it justice. It's good enough for a little while, but if you're looking for a party game that will keep on going and provide kicks for more than one party you're looking in the wrong place.", "date": "Oct 21, 2004"}