{"name": "Tony Hawk's Underground 2 GBA", "name_review": "Tony Hawk's Underground 2", "ref": "https://www.ign.com/articles/2004/10/22/tony-hawks-underground-2-2", "text": "Once upon a time (actually more than three and a half years ago), a small New York-based development studio by the name of Vicarious Visions wowed the handheld market with an unbelievable feat: a stunning handheld conversion of the console hit Tony Hawk's Pro Skater 2 for the Game Boy Advance. Even though the game couldn't be portrayed in exact form on the GBA, it was an amazing achievement to see and experience the series in a form that accurately represented the look and feel of the series on a handheld. And it was a testament to the potential the system had in its first generation.   The game was successful enough for a second go-round on the system with Tony Hawk 3 and allowed the development team to improve on the Tony Hawk 2 engine with larger parks, more detailed characters, and more advanced moves for players to master. That next game was followed up with Tony Hawk 4 GBA, and as great as the title was on the system, it was when the series began wearing out on the handheld.   Last year's release of Tony Hawk's Underground, though,  proved that there was still life breathing in the series, and the series' new direction and updated gameplay really energized the franchise on the Game Boy Advance.  It was like a jolt of creativity surged through the game design process, giving new life to a game that, just a few months before, only seemed to give a few slight upgrades to its predecessor.   Unfortunately, the same cannot be said for its sequel.  Tony Hawk's Underground 2 is guilty of a familiar Game Boy Advance crime: it's recycled. It happens to the best of them: Capcom with its Mega Man Battle Network series, Konami and Yu-Gi-Oh....even Nintendo's a culprit when it brings back that Mario Bros. in nearly every Mario GBA adventure. THUG2 for the GBA essentially takes what the team had already done in last year's THUG and basically offered only the most basic of tweaks, such as new skateparks and the couple of new moves introduced in the console versions. It's still a good, fun challenge on the handheld, but the game itself barely does much to justify its existence over THUG, and in nearly every case it's just best to track down a copy of last year's game if you haven't already done so.  All of the game elements that made the Tony Hawk series a success return, including the absolutely massive skateparks, tons of skate lines to pull off some really awesome combos, as well as a massive amount of challenges that push players' abilities to the limit. Yes, there are new elements, such as a couple of new moves like wallplants, Natas Spins, and a Tantrum move that recoups points during a bailed combo.  The ~extras~ involved in making Tony Hawk's Underground 2 its own experience, at least on the Game Boy Advance, actually work against the sequel. Gone are the restrictions that made the series a linear gaming experience, letting players skate anywhere in the chosen area. In most games this might end up a good thing, but in THUG2 this open-endedness makes the game feel completely loose and unstructured since players can open up any and all challenges on the board. It doesn't matter if the previous ones weren't completed, the game will let players simply keep them open for as long as the clock allows it. And in most cases, this removes any sort of urgency to complete tasks, and many times you'll find yourself ~accidentally~ completing tasks that were opened up several minutes before. It's just a much sloppier way to play the game.  THUG also features tag-teaming during the single player challenges, mirroring what Neversoft included in the console versions of the game. But on the GBA, most of the challenges feel like busywork that are there simply to inflate the length of the game. What's the point of forcing players to do the same task twice...once with the create-a-player, and once with a chosen professional skater?  The ~world tour~ of the console game doesn't make itself known as well as it does on the console, mainly because the GBA offer the same presentation that the elaborate Xbox, PS2, and GameCube productions can. Sorry guys, but intermissions featuring the low resolution Tony Hawk and Bam Margera in-game models egging players on during the ~World Tour~ just can't tell the same story as the rendered cut-scenes on the consoles.   But at least the stuff that made the original THUG1 such a treat on the GBA are retained in the sequel. The RPG-like stats progression, the side-quest Arcade Mode that brings back the classic Tony Hawk game structure, the multiplayer challenges, and the board editor. But I honestly can't come up with one element in THUG2 that genuinely and significantly improves on the Tony Hawk experience. And for a sequel, that's sad.It seems like I'm unfairly harping on the game's negatives and not focusing on what makes it fun. But honestly, I've already extolled the virtues of the Tony Hawk series four times before. The series has kicked all sorts of ass on the portable system many times already, and the reality of it all is simply this: THUG2 marks the fifth time the series has hit the Game Boy Advance. The GBA is the only system with five versions of the Tony Hawk franchise, and it's clear that, with THUG2, Vicarious Visions' Tony Hawk team is creatively tapped. Put to the task of bringing a fourth sequel to the handheld, the team just couldn't figure out a fresh new direction to take Tony Hawk.It's still a good solid extreme sports game and a significantly fun string of challenges on the handheld, but it's pretty obvious after playing this sequel that it's time to put the Tony Hawk series to rest. I really do not want to play another GBA Tony unless the franchise is going to radically change in a future iteration. THUG 2 just doesn't set itself apart enough from last year to justify a return.", "date": "Oct 22, 2004"}