{"name": "OutRun2", "name_review": "OutRun2", "ref": "https://www.ign.com/articles/2004/10/22/outrun2", "text": "Back in the arcade days I played OutRun, Pole Position and every other arcade racer I could get my hands on. Back then, they were all arcade racers. Each game had its twist, its one catch, and Sega's OutRun always stood out as a fast, wild ride in a convertible with a girlfriend. If you remember playing it, you'll also recall it wasn't an easy game, either. OutRun was easy to pick up and play, but to beat it? Well, you'd better have two pockets filled with quarters, and another loaded pair of pants for backup.   In yet another strange arrangement that would have boggled people's minds just a few short years ago, Microsoft is publishing OutRun2, an Xbox port of the Sega AM2 arcade game. But so be it. The final reviewable is, to be completely honest, pretty damn good. In fact, it's much better than I expected it to be. There is a hefty quantity of modes, hundreds of unlockables, fully licensed Ferraris (which of course drive nothing like their real-life counterparts), and two secret arcade games bundled in for old-school racing farts like myself. It's also got a distinct sense of control and speed that makes it easily one of the most fun racing games that I've played in a good long while.    Gameplay  Sega AM2's OutRun2 boasts a few, singular strengths. It's the epitome of arcade games in the best sense of the phrase. This racer is absolutely super easy to pick up and play. Anybody can do it. There are two buttons to press. Right trigger is accelerate and left trigger is brake, that's it. It takes place across a wide range of courses, all of which are tied together in a branching and expanding pyramid. You'll speed across them with a great sense of speed, and you'll pretty much be punching the pedal to the metal the whole way. No, it's not as blazingly speedy as Burnout 3: Takedown, but that's OK. It's still very fast. It also boasts one of the coolest powerslide mechanics in any arcade racer ever. And if you REALLY love Sega's racing games, you can unlock the original Outrun and tracks from Daytona USA. Yes, they're packed in here. Lastly, you can get online via Xbox Live! and vie against seven other people.   I'm not going to short-thrift OutRun, but that's pretty much it. Is that enough?   So, I just turn this wheel and you love me long time? Now, if you're still interested in a very good alternative to BurnOut 3 this fall, you should seriously check this out. I'll explain why I believe this seemingly simple arcade game has more going for it than meets the eye. First, if offers three main modes of play: OutRun Arcade, OutRun Challenge and OutRun Xbox Live. The first mode offers OutRun Mode (beat the arcade game), Heart attack Mode (listen to your girlfriend's commands and earn hearts while still making the checkpoints), and Time attack Mode (beat your best score). Then there is OutRun Challenge, which offers 101 missions to beat. With a little inspiration from other arcade games, namely Crazy Taxi, you'll find these missions hilarious, cruel, fun, and just plain weird.   For instance, a normal challenge is to pass as many cars as possible in a certain time length. Easy enough. Another might see you collecting as many hearts (which revolve around opponent cars) as possible. Yet another challenge might require you to pull off a sustained powerslide and while holding it, take a picture of a giant heart in a specified area. That's also a rather cruel one -- because it's actually quite hard at first (the timing is all weirded out). There are, in fact, 101 challenges, and each one, once beaten, unlocks something special. The word ~Special~ ranges full tilt in OutRun 2. You could unlock a picture of a mountain bike (somehow related to a Ferrari, which is the special obsession behind the this game's origin), or a special Euro-mix of a classic OutRun tune, or a new car. Unlocking stuff is the essence of gaming these days, and there is undoubtedly a serious quantity of ~stuff~ to unlock in these 15 stages.     OutRun Mission also gives you a chance to take turns with another person (there is no two or four-player split-screen mode) in Party Missions in a tournament, and just plain old OutRun race. This enables you to play any OutRun course in 1) a rival race (you against the CPU), 2) against your own best time or a ghost car, or 3) on System Link for up to eight people.    For car freaks, or rather, Ferrari fanatics, it should be noted eight Ferraris are initially available: the Dino 246 GTS, 365 GTS4 Daytona, F50, 360 Spider, 288 GTO, Testarossa, F40, and the Enzo Ferrari. (Four are unlockable, so there are 12 altogether.) We noticed right away that they are not organized or weighted in realistic terms. In other words, the Novice, Intermediate and Professional rankings do not reflect their real-life performance capabilities. But then again, it's an arcade game, so you shouldn't really expect anything terribly realistic in that department either.    After the excellent modes -- and it should be noted the Xbox Live and System Link options are easy to work and great fun -- the two coolest things about OutRun 2 are its excellent sense of precision control, and its insanely outrageous powerslide. The cars all drive essentially the same, sadly, with some driving faster than others and minimal differences in handling (OK, super minimal differences), but they all powerslide like nobody's business.   Powersliding here is a pure rush of driving fantasy. It's incredibly controllable and flexible. For the more import-tuner heavy car-heads out there, a powerslide is also called a ~drift.~ Once you start one, you can literally slide for 10, maybe 15 or 20 seconds, all while maintaining the same speed. This mechanic is designed to beat the game's toughest corners, but it also is a little mini-skill in itself. It requires a little bit of practice, but it comes in incredibly handy during those snaky hills and 180 turns,and it's made into great use in the Challenge mode.   You can, in fact, steer though and pass traffic while in a full powerslide, which is ridiculous, but simultaneously empowering in a laugh-out-loud-I-cannot-believe-I-am-doing-this way. This mechanic is not anything like in the original game, which had a slide but it was nothing more than a graphic touch. This creates an amazingly fun new dynamic to the game that simply didn't exist before, and it's sure to provide real driving fans with unending entertainment.    Get a great sense of speed with the two cockpit views. Oh yeah, did I mention that the original version of OutRun and tracks from Daytona USA are here? Yeah, I thought so.   On the flipside, OutRun2 has it problems. But they're not so much technical or design flaws, as they are part of the nature of any arcade game. First, aside from the powerslides, there is little depth to the driving and courses. And with any arcade port, you can beat this one the first time in, oh say, one-half hour. No, you won't have unlocked anything special, and you'll have missed a bunch of modes. But if you simply play the Outrun mode, you can beat it fast. Of course, it will take a few tries, because the game isn't actually too easy. But compared to the original, it's a little easier.     Still, that's missing the point. The idea, as you can see by the many branching paths, is to take a different route each time, exploring new hillsides, locations, and weather climates. The real depth of the game is its modes, and specifically I mean the OutRun Challenges and the Xbox Live and System link play. Seriously, you could rent this game in one day and beat it dozens of times. You could rent it for two days and probably unlock everything in all the modes.     Graphics  The big, wide open courses, perfectly designed for RAM-fat arcade machines, work out pretty well on Xbox. So, there is a little fade-in here and there, but it's nothing terrible. Second, the lighting is excellent. As you're getting that excellent lens flare or watching as an incredibly bright sun lights up the entire screen, straining your eyes through the fog, or taking note as the headlights automatically turn on at night time, you'll get a great sense of realtime lighting and the passing of daytime cycles.   The realtime car reflections are worth noting, and the detailed backgrounds every so often look photo-realistic. The cars are all well detailed and modeled, though the somehow all look like smaller, less muscular versions of their real selves. OutRun 2 is designed as an arcade game, so it's really good at what it does, and makes no bones about being realistic.    Sound  I'll put it plainly. If you're an old-school purist, you'll like hearing the remakes of the original three songs, Splash Wave, Magical Sound Shower, and Passing Breeze. If you have a dirty mind (all of you are totally innocent I know), these song names are, erm, rather suggestive. It's hard to ignore a song called ~Passing Breeze.~ But anyway, as part of the unlockables, you'll discover Euro Remixes of all the originals, you'll be able to unlock the actual 1986 originals as well, plus prototypes and instrumentals too for a total of 18 music choices altogether. I can bear these songs. All of them somehow work well with the game, and some of them are actually catchy and memorable. Also, if you've ever played Sonic the Hedgehog, these songs sound strangely familiar.   Ever just wanted to peel out in a Ferrari and not pay for the damage? Now, if you despise any music but your own, and you especially hate old-school arcade music, you're out of luck, bub. You can't rip your own music here. And the 18 songs of old-school stuff will simply make you wince.I'm surprised at how well this game turned out. The amazingly sensitive control and superb supernatural powerslides make this a totally refreshing alternative to any racing game around. The Xbox Live and System Link options give this puppy legs and the 101-plus challenges will give you a sense of satisfaction and gratification after you've bought it. But personally, I'd rent this first if you're unsure. It's not for everyone, and unlike the super sophisticated racing games with amazing physics and suspension and all that customization, this one pales in comparison. But if you like racing games and you want something that's both old-school and extremely fun, and you want to play online, OutRun2 is an excellent buy. Plus, for $39.99 and the inclusion of the original OutRun AND tracks from Daytona USA, you can't go wrong.", "date": "Oct 22, 2004"}