{"name": "GTA San Andreas", "name_review": "Grand Theft Auto: San Andreas", "ref": "https://www.ign.com/articles/2004/10/25/grand-theft-auto-san-andreas-6", "text": "I'm not going to beat around the bush. Grand Theft Auto: San Andreas is the single best PlayStation 2 title I have ever played. It's larger than the biggest RPG, has more story than the heftiest adventure game, and has almost as many mini-games as Nintendo's Mario Party. Additionally, it has a production value that's second to none, boasts a faithfulness to '90s source material with an eerie accuracy, and provides more hours of entertainment than all the previous Grand Theft Autos combined. In short, it's a terrific unending masterpiece of a game -- and one that will never fall victim to an over-exaggeration of its lofty status. It's the defining piece of software for Sony's successful sophomore system, and it's almost impossible to imagine a PlayStation 2 library without it.   Now I realize that with a statement like that, I leave a lot of expectations on the table. Immediate questions from longtime GTA players (and haters) will no doubt surface regarding what kind of problems San Andreas must have. Does the framerate still stutter? Is pop-in and draw distance still an issue? Are there any collision quandaries or other graphics-related bugs? Are the sound effects still tame by other action game standards? Does the AI ever have stupid moments or not perform the way you'd want it to? And is it true that there's absolutely no form of online play whatsoever? To be honest, the answer to all those questions is a definite yes. But an even better question to ask (and one that has a lot more direct impact) is, ~Do any of the issues explored above really detract from the overall experience?~ In a word: No.   But how is that possible? Isn't that a significant number of concerns for one game to handle? Sure it may sound like the case when clumped together like that, but in practice it's almost completely unnoticeable. For starters, the frequencies at which the graphical hitches mentioned above appear in comparison to when they don't is so lopsided, that I'm left unaffected. Additionally, there's literally so much to experience in the single player game that the lack of online play isn't missed in the least, while the minor sound effect kinks and other presentational issues get completely dwarfed by everything else that the game manages to do right.    The big curiosity, of course, is just what is it that San Andreas does so right in the first place? After all, IGN and every other videogame publication on the planet have been sworn to secrecy since first getting our hands on the game late last week. And while it's true that we've told you all about the different kinds of features that Rockstar had plans to implement by release day, nobody's talked about how those features actually felt. Even more importantly, though, no one has mentioned the number one reason that Grand Theft Auto: San Andreas is so amazing to begin with: it's the first game I can ever remember that asks its players to wonder ~What can't you do~ as opposed to ~What can you?~   Johnson N The Hood  The storyline of San Andreas should feel somewhat familiar to fans of 1990s cinema. Borrowing rather heavily from John Singleton, Spike Lee, and Ernest Dickerson pictures, this iteration of Grand Theft Auto is all about the thug life when it was still in its infancy. Following the exploits of young Carl Johnson, the game begins as CJ returns from exile in Liberty City after learning that his mother's been killed via unknown circumstances. CJ feels pretty torn about coming back too, as he originally left Los Santos five years ago when his younger brother Brian was mercilessly gunned down. Nevertheless, family's family and Carl returns home to San Andreas to pay his respects.   Video Review A world as big as GTA: San Andreas deserves to be seen. In this sweeping 14-minute video review, IGNPS2's Jeremy Dunham and IGN Guides' Chris Carle, give their final take on the game after many, many hours of play. With tons of direct-feed, no story spoilers, and explicit content, this is something interested adult fans have to check out.  Download It Now  Within seconds of arriving in Los Santos, however, CJ is met by two bastardly police officers: Frank Tenpenny and Eddie Polaski. Rotten to the core, the pair of crooked officers robs Carl of all his money, frames him for the death of a cop that's on to their schemes, and tosses him into the middle of enemy gang territory. Weaponless and outnumbered, CJ is forced to run back to his old neighborhood in an effort to survive. Once resolved, things really begin to take off, and players will meet a huge assortment of characters in a short period of time. CJ's older brother Sweet, his sister Kendl and her boyfriend Caesar, Carl's friends Big Smoke and Ryder, and a massive gallery of supporting personalities all weave an intricate plot that's easily among the best storylines this year.    In fact, Grand Theft Auto: San Andreas has probably the best narrative of any of the three PS2 GTAs far. It's certainly more multifaceted than 2002's Vice City anyway, and offers up a large selection of interwoven and completely independent plot threads that really help to tell an effective story. And while the characters don't grow or evolve the same way they would in an adventure game or an RPG (save for CJ), they're still vastly different from one another and do a great job of keeping things interesting. The absolutely terrible rhyme-deficient street rapper OG Loc, for example, is in complete contrast to your serious older brother Sweet. San Fierro's honorable Tong leader Wuzi is a great alternative to the tough-talking mystery man Mike Torreno. And your harsh but loving sister Kendl is as different as can be from your psycho 'kill everything that moves' girlfriend from the San Fierro countryside. Best of all, though, none of these characters are annoying or out of place (unless they're intended to be) -- and almost all of them offer up some truly memorable scenery.   Those that are ethically opposed to the content of the Grand Theft Auto franchise, however, aren't going to find anything different this time around. The plot is still brutal, the characters are still ruthless, and the moral of the story is that there isn't really a moral. So yes, this still isn't the type of fairy tale you'll want to show your children (unless you want to show them what NOT to do); but for adults who love crime dramas, action films, and gangsta rap, the devices here are strong and offer up a great deal of twists, turns, and interesting visceral situations. It even ties in rather nicely with Vice City and GTA3 for long-time fans of the series.  Click For More Images Menace II Three Societies  One of the reasons that the game is so impressive is because of the technology that powers it. No longer restricted to just a single city, Grand Theft Auto: San Andreas is huge: almost six times the size of Vice City and even more so than GTA3. Broken into three major metropolises (Los Santos, San Fierro, and Las Venturas) the map's major designations are separated by countryside, desert, mountains, and a dozen smaller towns in-between. Though not an official time stamp by any means, it took me more than half an hour to drive from the southern-most part of Los Santos into the west through San Fierro -- and then Northeast into Las Venturas. Keep in mind; I didn't stop for anything along the way and avoided traffic as best I could. I didn't stop off at any of the smaller towns either. Needless to say, enormous doesn't even begin to describe how big this monster really is.   Making the trip even more jaw dropping is the fact that the entire state of San Andreas streams entirely off the disc -- with no loading screens to be found except for when transitioning to the indoors or when activating missions at a key point. Even then, the waiting time tops off at about five to six seconds before starting again which is comparable to the period typically found in other action titles for the system. And though Vice City worked on the same technology, the number of framerate hitches and pop-in issues are much lower here than they were before. Granted, you will run into some slowdown and a few bizarre glitch moments when the screen is populated with car crash casualties, but as I mentioned earlier, the frequency at which the appears is more than forgivable when compared to how smoothly the game usually runs   What specifically caught my eye about the world of San Andreas, though, is the fact that it's a true mini-society. The dynamic climate, for example, differs quite drastically from area to area. The San Francisco-inspired city of San Fierro, for example, is frequently cursed with a mixture of fog, rain, and overcast afternoons. Los Santos, on the other hand, is surrounded by a constant haze brought on by the area's terrible level of pollution while Las Venturas is almost always sunny thanks to its arid climate. These weather patterns behave just as they do in real life too, which enables climates the ability to change their spots from time to time. DJs on the radio will even mention these weather breakups and inform players when they can expect to see alterations to their environment.    But there's more to recreating a mini-society than just simulating a bunch of weather patterns and Grand Theft Auto: San Andreas seems to know it. Rival gangs, for example, are at constant war with one another -- so don't be surprised if you see members of the Orange Grove Families blasting away at rival Ballers while you drive through the city streets. Cops will stop and bust them for their crimes just as quickly as they'd bust you as well, making it easier to get away with robbing or killing if they've already got their hands full with somebody else.   Additionally, people on the streets will make comments to CJ based on his appearance. If Carl's fat and out of shape, for instance, he'll be ridiculed and made fun of. But if he's buff and well-dressed, the townspeople will recognize this and make positive comments supporting him. This is just one example of how the world is alive and players can also expect to see drug pushers walking the streets and making deals, citizens running for their lives from criminals other than you, and normal everyday fender benders happening between the game's less coordinated AI drivers. But that's only scratching the surface: cars can rust and get dirty the more you use them unless they're washed; traffic flows more heavily during the morning and evening hours to mirror real-life rush hours; pedestrians change clothing styles and speech patterns based on the towns they live in; construction workers holler and whistle at women as they walk by; and cops make a much more concerted effort to follow their targets until they're completely and totally out of sight. Sure it may not be The Sims, but for what it is it's damn extensive.   Click For More Images How Do U Want It?  Naturally, it would only make sense to allow CJ to be just as alive as the world in which he lives; and that's exactly what Rockstar has enabled him to do. By far one of the most dramatic improvements that's been made since Vice City, the ability to customize CJ anyway you want is more than just presentational -- it also has a direct effect on how well you can play the game. Cycling, driving, holding your breath underwater, and riding motorcycles are all individual skills that can be improved upon by undertaking them more often. And the more you do them, the easier they are to perform. What's so cool about this aspect, though, is that none of these skills have to be worked on in order for CJ to be successful; your own ability with the dual shock and some determination is really all you need. But for those of us that enjoy the role-playing ideal of building up experience and becoming more powerful, it's a great incentive to try things we normally wouldn't repeat.   These kinds of improvements aren't just limited to how responsive your vehicles control either. Dressing well, keeping fit, and increasing the amount of respect that you have in the eyes of other thugs can be improved upon as well. Should you let yourself go and become a fat slob, for example, you'll be less likely to earn points for your Sex Appeal stat in order to woo the ladies for those always-fun girlfriend fornication side-missions (plus it'll be harder for you to increase your stamina attribute). If you head to the gym and jump on the treadmill or bench-press, however, you can burn the fat consumed by eating food and turn it into muscle and increased stamina. Your new buff bod not only makes you more attractive to the ladies and better respected by your homeboys, but it also makes your melee attacks more powerful and your ability to sprint last longer.   There are a number of other customizable goodies at CJ's disposal as well. Clothes can be bought at several different garment stores all over San Andreas, and each one offers a specific kind of look that uses just about every style imaginable from the 1990s. Haircuts and tattoos can be added to your character too, and depending on the quality of your appearance, you'll evoke bigger reactions out of women and fellow gang members. Similarly, ugly or cheap clothing gets you laughed at or ignored by those you're trying to impress most, but regardless of the reactions you get it's just further proof of how realistic Grand Theft Auto has truly become.    Fantastic (High Speed) Voyage  Speaking of realistic, the vehicles in Grand Theft Auto: San Andreas feel extremely good. Fans of the previous title's cars, trucks, and motorcycles should be pleased to know that in addition to several new vehicles made specifically for San Andreas, a great deal of the older autos have been incorporated here as well -- only with an ~updated~ 90s look. But keep in mind that appearing like they're from the 1990s really isn't the update that matters here; it's the vastly-improved handling system and dead-on physics engine instead. And I guarantee you that you'll be able to tell the difference between San Andreas' and Vice City's automobiles immediately; each and every vehicle in the game has its own unique suspension, weight, and speed limit.   Fans of the car modification craze that's recently invaded the racing genre are in for a treat as well; as they'll be able to pimp out their rides with a huge assortment of mods that allow them to upgrade their front and rear bumpers, tires, upholstery, and just about anything else associated with the customization aftermarket. But these modifications do more than just make your car look better: they also raise your respect level with fellow gang members and increase your sex appeal stat with the ladies. Moreover, upgrading your ride with a hydraulics system (controlled via the right analog stick) enables you to partake in a mini-game centered on bumping your car to different selections of music. You can even add a nitro pack to the back of your car for an extra boost when speeding up (which comes in really handy on the straight-aways during racing missions). The Burnout 3-like blur effect that surrounds your car when using this boost is pretty awesome too.   Click For More Images Of course, there's a ton of other cool vehicle-based additions to San Andreas as well. The BMX bicycle, for instance, is a strangely addictive supplementary vehicle that allows players to either ride it like a motorcycle for cruising or to tap the X button like crazy for serious high-velocity action. If you want to get stylish, you can even perform various extreme sports-like stunts -- including stoppies, bunnyhops, 180s, 360s, wheelies, and a few others that I can't seem to pull off without smashing into the pavement.   Additionally, there's a colossal list of automobiles that are brand new to the GTA series and include a devastating combine that chops its victims into goo, a super-responsive dune buggy, a hilarious street sweeper that's essentially an urban tractor with brushes, and some sweet little hovercraft. For flight jockeys, various kinds of airplanes and helicopters have come back into the fold as well, and there's a nice selection of super secret vehicles that I don't want to tell you about for fear of spoiling things (but trust me, they're extremely cool). Players can even hijack trains if they're looking for a way to pass the time and San Fierro tourists should turn their attention towards city trolleys if they're in the mood for a little something different.   Needless to say, it seems that Rockstar realized that after creating a land area as large as San Andreas that it would have to seriously re-approach its thinking when it came to the handling of its cars. There are a ton of things in this regard that I haven't even mentioned yet too: such as the improved AI of your carjacking victims, the ability to pick up hitchhikers, a super-sweet Monster truck that can crush other vehicles, more realistic boat physics, and a ton of other related things that are better left to your experience rather than a descriptor.    The Player's Club  Of all the improvements made to Grand Theft Auto: San Andreas, however, the most important are the enhancements that have been made to the existing gameplay mechanics. Though similar to Vice City in that you can still lock on to enemies with the R1 button and cycle through targets with the L2 and R2 keys, the system is much smarter than it was before. One of the biggest complaints in Vice City, for instance, was that the target-cycle would lock onto dead enemies as well as live ones -- costing you valuable firefight time and making missions more frustrating than they should be. Now that problem is completely fixed with a much more accurate (and faster) cursor that locks onto the biggest threat in front of you until it's completely eliminated. In short, it's what Vice City's targeting system should have been.    Rockstar has also incorporated several of the gunplay elements from last year's brutal stealth actioner Manhunt. Players can finally move, fire, and zoom in on their opponents all at the same time with deadly accuracy. The optional manual targeting camera (which can be activated at any time with the right analog stick) feels terrific and enables players to pinpoint specific locations on their victims. To supplement this feature, your proficiency with each weapon is increased each time you fire it -- which opens up new abilities for Carl to toy around with as his skills progresses. When mastering the micro sub-machine guns, for example, players will eventually gain the ability to strafe and fire their weapons simultaneously while wielding two guns instead of one. Hand-to-hand combat has also been drastically upgraded with a wider variety of moves, the option to learn new techniques at gyms across the state, and the incorporation of a limited combo system. Carl is by no means a helpless badass.   But the targeting system isn't the only aspect of Manhunt that San Andreas has claimed for its own, as it's taken its stealth-oriented mechanics as well. Though not as important or as frequent in comparison, the need to crouch in the shadows and sneak up behind your victims adds a nice touch to what's otherwise a high-speed action game. In truth, the stealth missions are among my favorites: with the heavy breathing of CJ the only sound you can hear while sneaking from place to place and silently cutting throats. And while it's nowhere near as brutal, graphic, or meticulous as it was in Mahunt, it's still somehow just as satisfying. But then again, that's really what makes San Andreas so appealing in the first place -- its ability to consistently present players with missions that not only introduce all-new gameplay features, but in which each feels as important as the last, regardless of whether they're directly tied into the storyline progression or not.   Click For More Images In the Las Venturas desert mission ~Monster Mash,~ for example, Carl is called upon to drive to the Terra Robada ranch just outside of San Fierro for a meeting with a mysterious man. Once he arrives a stranger approaches him with simple orders: take a monster truck and race through several difficult checkpoints in less than seven minutes. Simple as it may sound, it's a clever way of introducing you to an all-new gameplay feature: full four-wheel steering via the R1 button instead of the typical handbrake. Similarly, CJ will eventually reach a point where he undertakes ~Learning to Fly~ -- a series of airplane and helicopter tests which teach him how to pilot the fastest transportation in the game. It's fast, fun, and like every mission in Grand Theft Auto: San Andreas, is overly challenging.   But that's only a smidgen of the different kinds of missions that players can look forward to. San Andreas does offer more than 100 different quests and challenges after all, and boasts everything from the scenarios mentioned above to escort missions, stealth-oriented home robberies, on-rails shooting situations, traditional car races, and lots, lots more. There's even an unparalleled selection of mini-games to undertake in your spare time -- including a Dance Dance Revolution-type rhythm game to play when in clubs, a small collection of arcade games that play exactly like Tempest, Asteroids, and Defender, and a fully-realized pool game that has its own physics system and betting option. And don't forget, you can also travel into town and bet on horse races, gamble at practically every known game inside the Las Venturas casinos, and even team up with second player for two-person rampages.   The two-player game in particular is deceptive fun. Available in several different flavors, this multiplayer aspect never splits the screen at all. Instead, it enables player two to press start when CJ stands on designated icons to activate an overhead camera that tracks both characters (the second of which is usually one of Carl's girlfriends). Once underway, the new player can equip armor, steal cars, drive, and target just as CJ can, and can create some pretty satisfying destruction at that. The only real snag is that players have to stay within a certain distance of each to keep from being halted in their forward movement -- but in practice, it's really no big deal.    Presentation Rules  Graphics fiends will probably be San Andreas' biggest enemies. Though it has been improved upon in several ways technologically when compared to Vice City, it still has a lot of the pop-in, framerate, and collision issues I mentioned earlier. In the game's defense, however, the sheer number of objects, vehicles, and land area being displayed on the screen at once is so impressive that it's more than forgivable. In a perfect world, these snags wouldn't rear their ugly heads at all, but given the power of the PS2 and how much activity is going on in the game, it's hard to imagine it getting any smoother than it already is without several more months (years?) of optimization. I'll have to admit that it is a little disappointing that progressive scan isn't provided as an option for us High Definition users, though. But at least widescreen mode is fully supported and it looks great on the televisions that support it. I'm also happy to report that those bothersome trails from the previous two games have been removed entirely.   The rest of the game, however, looks fantastic and provides a terrific amalgamation of the all the popular landmarks taken from all over Los Angeles, San Francisco, and Las Vegas. The Watts Towers, Lombard Street, the Las Vegas Strip, the Great Western Forum, are just a few of hundreds of different recognizable areas. The number of polygons for each object has been nearly doubled from Vice City too, and the number of animations, particle effects, and weather patterns are more realistic than ever.   What really stands out for me, though, is the absolutely kick-ass soundtrack and voice acting. Boasting a cast that includes Samuel L. Jackson and Chris Penn as Officers Tenpenney and Polaski, James Woods as Mike Toreno, and Charlie Murphy as a self-absorbed pimp named Jizzy, the talent available here is top notch. Up and coming rapper Young Malay is perfect in his role as CJ too, while all the supporting characters are of Hollywood caliber.   The soundtrack is just as strong, and in many ways, much better than Vice City's was. Classic 90s staples like the Stone Temple Pilots, Dr. Dre, Snoop Dogg, Guns 'N Roses, and Boyz II Men make up a rather extensive eleven-station presentation. The commentary is completely dynamic too -- with sounds that differ based on what kind of car you're driving and what kind of adjustments have been made to its sound system. Strangely there's no DTS this time around, but we did get Dolby Pro Logic II.I've spent the last six pages making my case for why Grand Theft Auto: San Andreas is best game I've played on the PS2 thus far, and I still haven't even begun to touch on how much it really has to offer. I've spent almost every waking moment of last week doing nothing else but playing this massive beast and have put well over 60+ hours into it.  And yet despite that fact, I'm only barely hovering over the 50% finished mark (which is all you really need to complete the story), and I still have a ways to go. Hidden horseshoes, graffiti tags, special photographs, and a myriad of other hidden items still elude my grasp (nearly 300 of them), while a huge assortment of things I can't even tell you about make me wish that I wasn't so protective about spoilers -- there's some seriously cool secret stuff in here.But that's why San Andreas is so awesome: it's a world that can offer different people different things. If a solid storyline and some incredibly tough missions are all that you're looking for, then you can have them. If you'd rather spend your time doing nothing but exploring the city and finding new ways to make money, destroy property, and dress like a pimp, then you can do that too. Live the life you want to live, do the things you want to do; it's entirely up to you. But however you choose to do it, do it now. Drop everything and do it right now. This is the best PlayStation 2 game ever made. Period.", "date": "Oct 25, 2004"}