{"name": "Puzzle Master", "name_review": "Puzzle Master", "ref": "https://www.ign.com/articles/1999/12/10/puzzle-master", "text": "Metro 3D kicked off its Game Boy publishing by releasing Chase H.Q. back in September, and has also recently released Classic Bubble Bobble. But the company also has a group of Game Boy developers, and has just released its first original Game Boy title, Puzzle Master. On the surface, the game may look and feel like the existing Puyo Puyo puzzler that's been released on every system since the Genesis, but Metro 3D has taken the idea and built on it to create a few elements unique to the genre. It's admittedly not the better game, but it's decent enough to check out what the team's done with the idea. Features Fifty levels Training levels For Game Boy or Game Boy Color  You've seen it before: clusters of colored tiles fall from the sky into a bin  when they land, if three or more of the same color are touching, they'll disappear and cause the rest to fall into the pit. Puzzle Master's the same way  but instead of ~colored~ tiles, the developer uses elements: Fire, Water, Wood, Stone. And unlike Puyo Puyo, the pieces fall in varying groups instead of two at a time. Sometimes five will fall, other times only a single one.  But that's not all Puzzle Master adds to the game. Powerups come into play as well. On the side of the playfield is a menu that tells you how many of a certain item you have. Knives will take out an entire column of puzzle pieces, Keys will ~unlock~ certain parts of a level background, Bombs will take out a cluster of pieces, Hearts act as a ~wildcard~ element that'll complete a grouping, and the Potion will remove all pieces from any one group from the playfield. These powerups can be called upon at any time, as long as you have them in your queue.  What's more, the playfield now reacts to certain tasks, instead of simply being a basin to hold your puzzle pieces. For example, a flowerpot is hanging in a lone spot. If you douse it with water elements, it'll bloom and award you a power-up for the task. There are also switches that trigger events like a drawbridge, making an entire row of blocks fall when it's pulled back. And monsters are even thrown into the mix  as long as they're on the playfield, they'll cause a whole group of tiles to fall from the sky...even the unremoveable skull pieces. The only way to stop this is to ~stab~ them with knives or to destroy them with bombs.  When it's all said and done, the game is just an extension of Puyo Puyo (you know, Kirby's Avalanche on the SNES, Mean Bean Machine on the Genesis, or Puyo Pop on the NeoGeo Pocket Color). But that's just fine  there hasn't been a US version of the game released on the Game Boy Color yet, and this is the closest thing yet. On the downside, some of the tasks each puzzle gives you clutter the playfield  but on the flipside, the developers had the forethought to include a simple ~marathon~ mode if you just wanted to see how far you can get in a single, increasingly difficult round.  Puzzle Master is a very decent title for the Game Boy. The game will definitely please those who are fans of the existing Puyo Puyo series, since that game isn't yet available in the US. The designers definitely knew a good series to work off of  the extra puzzle elements, like the monsters and switch-triggering are a cool plus, but sometimes they just seem out of place in a game like this. Still, kudos to the designers for trying something new in a familiar genre.", "date": "Dec 10, 1999"}