{"name": "Dr. Mario", "name_review": "Dr. Mario", "ref": "https://www.ign.com/articles/2004/10/26/dr-mario", "text": "At the time Dr. Mario shipped on the NES back nearly a decade and a half ago, it was definitely an odd thing to see good ol' wholesome Nintendo offer up a game that encouraged kids to play around with drugs...oh, er, I mean, vitamins! Yeah, that's what those multi-colored capsules are. Vitamins! Well, the game's still a strong title in the company's line-up, and Nintendo still holds no shame for the content of Dr. Mario, still giving kids the ability to twist and turn those dr...er, vitamins, to defeat the enemy viruses in this pill-popping puzzler.  Since the Classic NES Series game release is essentially an emulation of the NES game, it remains identical and faithful to the 15-year-old game design. So it's just a little surprising to see just how limited the game presentation was. Even though players can adjust the difficulty of the action, Dr. Mario really only has one mode of play...which is almost unheard of for puzzle games released nowadays. But at least this game design can stand on its own because of its simplistic design; stack and match four or more like colors together to eliminate them, but the task is to wipe out the little face-making viruses that inhabit the playfield. Once they're gone, it's onto the next level of difficulty. Dr. Mario is the only game in the second, four-game batch of Classic NES Series games released on the system to feature multiplayer support. The Classic NES Series emulation features the nifty ability to connect two GBA systems together via link cable or Wireless Adapter, only requiring one copy of the cartridge for the two player stuff, and Dr. Mario utilizes this feature to make the game stand out way better that it would have had it only been a single player offering. And, generous Nintendo still lets the cartridge-free system ~keep~ the game in memory even when the link has been severed, a great way to be generous and giving to friends who might not own a copy of the game themselves.  The puzzle design is fun and addictive, but it owes a ton to the design of Tetris. The Classic NES Series game retains all the oddness of the NES release, including the black-and-white manual that tries to show the different color capsules graphically. Yeah...I can really see the Yellow/Blue capsule when it's printed as White/Black.  Even though this game was given away for free in Wario Ware as an unlockable called Dr. Wario (as well as a free download in the GameCube Nintendo Puzzle Collection release in Japan), the game scores well thanks to its simple fun and its quick ability to get into two player mode.  Just say no to drugs, kids.", "date": "Oct 26, 2004"}