{"name": "Madden 99", "name_review": "Madden NFL '99", "ref": "https://www.ign.com/articles/1998/10/23/madden-nfl-99", "text": "This is the year's best football game so far, offering solid field action and a reasonable management simulation. And while most other games skimp in one of those two areas, Madden to its credit does both reasonably well.  But it's not the stats or gameplay that will first grab you, it's Madden's jawdropping graphics. These are probably the most detailed and realistic players to ever suit up for a computer game. Sure, the stadiums are authentic, the team logos are spot-on, but it's the incredible amount of detail packed onto the players--you can read the names on the jerseys without squinting, and the helmet logos aren't blobs of color but actually recognizable--that make this game simply fun to watch, let alone play.  However you can't always see what's going on. The default camera angles are adequate, but it's too hard to see your receivers before you pass. Far superior is the replay mode camera, which is free-floating and can be moved anywhere you like around the field. But that's no help during a play.  The replay brings out another odd flaw in the passing game, namely that players are clearly surrounded by 'catch boxes', invisible rectangles that mark where the ball stops its normal flight path and suddenly veers into the receiver's hands. It's like a weird Disney film about a telekinetic quarterback who wills the ball into his receivers' hands.  But the graphics are fast enough that during an actual game you'll hardly notice. The smooth frame-rate and detailed players make it feel like you're playing football. The game runs a step or two slower than other games, but this only helps out, because it gives you an extra split second to figure out which way to run or throw.  On the other hand, the color commentary is very spartan. John Madden's comments are so few and far between that when he actually has something to say it comes as something of a surprise. Glad you could join us, John.  But a lack of commentary is a minor issue. Most of the time you'll be busy just playing the game. We mentioned the passing game before, but most football games can do passing fairly well; they seem to have more trouble with the running game. Madden though, perhaps because it moves at a slightly slower pace than other titles, has a far more playable running game. It's not easy, but with a fast running back, a strong line, and making sure you run to the strong side, you can gain yards with a lot of hard work--unlike the passing game, there are no money running plays here.  Player control is spiced up with a variety of moves, including the stiff-arm, pump fake, juke, dive and hurdle. This is definitely one to be played with a gamepad. Support for the Sidewinder is somewhat chancy. Somehow the 'X' button becomes the #1 receiver, the 'A' button the #2, and the 'B' button the #3. This is quite counterintuitive, and takes some getting used to. Once mastered, however, it works admirably.  Less admirable is the so-called 'One-Button Mode', a dubious feature that lets you control the action with just one button, with the computer making the decisions for you. What's the point? You might as well just watch the game.  So much for graphics and gameplay, and on to the clipboards. While Madden's coaching and simming options are fairly comprehensive--a career mode, a fantasy draft, franchise mode, salary caps--they come up markedly short in comparison to the old Front Page Sports games.  For example, there's a fantasy draft, which dumps all current players in a pool and lets you draft a complete team through 48 rounds. The teams bear no resemblance to reality, instead having made up names and logos such as the Titans or Yankees. This is a good way for people to play a hot seat season, but strangely, it has no career mode. Conversely, you can have a franchise or career mode with the NFL teams, but not a fantasy draft.  Playcalling is pretty straightforward, and each team has its own playbook, though the amount of custom plays in each is pretty low. Play editing on the other hand is a bit more cumbersome, and doesn't really compare to Front Page Sports' play editing. In Madden, you cannot invent your own formations or routes, but instead must choose a preset route for each receiver, based on one of your team's default formations. This is regrettable because practice mode is otherwise handy.  Trying to make sense of Madden's maddening menus is a tedious exercise. Questions like ~How do I put a custom team in a new league?~ and ~Who's playbook am I editing, anyway?~ will plague you at every turn. The pamphlet of a manual is little help either.  Here's an example. In those Front Page Sports football games of yore, it was pretty easy to create a new league of variable size, assign any team--classic, contemporary, or fantasy--to any slot in any division, then go in and edit player ratings, assign playbooks, have a draft, even set home town temperatures, and all this for a permanent, career league you could play forever.  Most of those things you can't do in Madden. Some of those things you can do in certain modes, a few in others--it's never really clear which--but you never like you have the absolute freedom to sim and manage anyway you want.  To add insult to error, the whole mess is designed to be navigated by a gamepad, making absolutely no use of a computer's ability to display lots of information (like a football player's stats) in easy to read rows and columns, or in separate windows, or in easy to print text files.  This alone is enough to turn me off ever looking to Madden as a real management game, even though Madden throws in some nice classic FPS touches like the uniform tweaker. But if EA is serious about adding a hardcore, sophisticated management sim on top of Madden's steadfast gameplay, it needs to go back and study the past masters.  Still, just because it's not Front Page doesn't mean it's bad. For most gamers, the coaching and simming options will be more than enough, and when you combine them with a very solid and enjoyable game on the field, you have the best all-around football game available.  --Jason Bates", "date": "Oct 23, 1998"}