{"name": "Tron 2.0: Killer App", "name_review": "Tron 2.0: Killer App", "ref": "https://www.ign.com/articles/2004/10/28/tron-20-killer-app-2", "text": "One of these years Disney's going to finally hammer down a production company to get to work on a true sequel to the 1982 live-action/animation/CG hybrid theatrical film ~Tron.~ Until then, at least we have the videogame world to live our sequel wishes vicariously. Last year Buena Vista fueled the ~Tron~ sequel train with Tron 2.0, a first-person shooter that extended the plotline of the original flick into a contemporary setting. This year, the company has teamed with GBA developer Digital Eclipse for a spin-off of the PC production. The end result is a fine extension of the ~Tron~ property with a game design that's full of variety. The core of the production is slightly clunky, but the overall package is strengthened by the return of classic games and fun minichallenge that can be enjoyed outside of the central adventure. Features Two playable characters Two seperate adventures Link cable support for four players (multiple cartridge) Light Cycles, Recognizer, and Tank minigames Tron and Discs of Tron included. Cartridge save (three slots)  For those unfamiliar, The Tron universe establishes a world within your computer where programs are represented as beings handling tasks by the ~Users~ on the outside world. A real world second is nearly a lifetime to these programs as they zip along the speed of light to perform the duties sent to them. Tron 2.0: Killer App takes the theme of last year's Tron 2.0 PC title -- which is returning as Tron 2.0: Killer App on the Xbox -- and establishes a new story arch for the handheld gamer. It's the only version of the game where you'll actually play as Tron, the role handled by ~Scarecrow and Mrs. King~ alum Bruce Boxleitner. According to the game's plot, a vicious virus has been unleashed into the system, and to learn its origin. Tron has been brought out of ~stasis~ to uncover the mystery of this hazardous program. Tron 2.0: Killer App has the added benefit of offering two different playable characters. Along with the classic Tron character, players can also take control of a being introduced in the PC game: a Light Cycle program/pilot called Mercury. Mercury, voiced by Rebecca Romijn-Stamos, gets her own quest and level designs that interweave with Tron's own adventure. It definitely adds to the replay value of this GBA game since it can be played through twice, each with different challenges. Her own abilities are similar to Tron's, though she's tweaked slightly to make her feel different for gameplay's sake.  Those familiar with Digital Eclipse's Spyro games on the Game Boy Advance will recognize the foundation of Tron 2.0: Killer App's graphic engine. The game's action is very similar to Spyro in that you have to stay the course laid out in the angled perspective; falling off the edge is considered ~bad,~ most of the time it just takes a bit of energy and you'll have to jump back up, or simply ~deresing~ which results in a loss of life.  The gameplay is a lot of jump and shoot, with players throwing discs as Tron, or a spinning baton-like object as Mercury. The levels encourage players to explore every inch of the levels by hiding collectible ~chips~ that can be equipped for use by Tron or Mercury to enhance their abilities.   The main adventure isn't what you'd consider fantastic, but it is a solid design with a few gameplay flaws that tend to make the adventure feel just a tad clunky. Locking onto enemies is a simple matter of holding the ~throw~ button down, but when there happens to be more than one enemy on-screen the autolocking mechanism tends to go after the closest one to your character...no matter which enemy you're looking to take out. This wouldn't be so bad, but there are situations where you must nudge enemies into specific spots on the map, and when two or more enemies get on-screen the lock jumps off the character you're trying to move in favor of another enemy that's just a few pixels closer.   Interspersed throughout these exploration-focused action games are mini-challenges that have specific context to the level itself. For example, players must ~hack~ into locked doors using a cool little Pipe Dream style puzzle game where they'll have to link tiles from one point to the other before time runs out. To get past a ~Firewall~ creature players must take part in a more clumsy mini-game that goes on far too long; it's a classic shooter where players must blast at a Breakout-like wall to get at the creature on the other end.  There are also vehicular games. Tank and Recognizer levels offer a very Faceball-like maze combat challenge in a rudimentary, and slightly ugly, 3D environment. It wouldn't be a Tron game without the Light Cycles, and luckily these battles turned out pretty darn well. It's not much more than an enhanced version of Snake where players must draw lines around an arena to make the opponents weave and crash into them; but it's handled pretty nicely on the Game Boy Advance with a dynamic camera that zooms in and out of the action depending on how close they are to an opponent.  Power-ups come into play that'll help or hurt the cycle that picks it up, which changes things up significantly from the original arcade Tron challenge.  Speaking of the original arcade game, Buena Vista offers up the best treat in years: Bally/Midway's original 1983/1984 arcade games Tron and Discs of Tron as extras, playable right from the get-go. The GBA screen's resolution and configuration doesn't tailor itself well to be pixel-perfect; Tron ends up very ~squished~ due to the original's use of a vertically aligned monitor. But the classic gameplay remains intact, and as playable as you can get on the button layout of the handheld system. And because these games aren't playing on the actual hardware, there are issues: the weighted knob control of both arcade units has been relegated to the digital L and R buttons, so you can't exactly spin the aim as quickly as you could on the original cabinet. And Discs of Tron has a particular habit of slowing down in later levels. But these can be forgiven because of one important fact: Tron 2.0: Killer App for the GBA is the first time two decades that Disney and Midway have made these games available anywhere outside of the arcade. And that's a big deal. It's pretty clear that the guys over at Digital Eclipse know what makes the Tron property ~cool,~ because they've incorporated a ton of that cool factor in Tron 2.0: Killer App. There are some quirks peppered throughout the entire production, but even with the minor problems this is a very good extension of the Disney property, and definitely worth picking up even if you're too young to know what the heck ~deresing~ means.", "date": "Oct 28, 2004"}