{"name": "SEGA Superstars", "name_review": "SEGA SuperStars", "ref": "https://www.ign.com/articles/2004/10/29/sega-superstars", "text": "You can call SEGA SuperStars SEGA's version of EyeToy: Play because that's what it is, but it makes plenty of creative decisions that make it stand out on its own. In a nutshell the game has a dozen mini-games, each with its own SEGA theme and they're best when enjoyed with others. Completing the game on one's own only takes a couple hours at most so this is a party title for when you and your buddies want to see yourselves on TV and get stupid.    The dozen games include all sorts of different SEGA titles like Sonic the Hedgehog, Nights, House of the Dead, Super Monkey Ball and eight others. We covered the full list and descriptions of all the different mini-games in our preview which has all of the details. Each of these mini-games has its own take on incorporating the EyeToy and each one has three levels of difficulty. Getting through any of the games should only take a few tries and the real appeal is that of the high score board where the winner gets to post a photo taken with the EyeToy forever. Or at least until the next greatest thing comes along.   In the game itself, since it's not hard to really finish the different modes, it's pretty clear that SEGA SuperStars is a party game. By posting a photo that taunts others with some funny faces or even a rude gesture or two (our personal favorite) there's a fun reason to try and get the new top slot and get another picture up as a response.   When it comes to the mini-games there are a dozen of them and they run the full range of being pretty near awesome to completely forgettable or even taking a detour to unnecessarily aggravating. The best one is the odd, odd game from PuyoPop Fever where dozens of colored Puyos fall from the sky and players need to guide them into their color coordinated mailboxes. Of al of the ideas here, this one is the most creative and best-suited for bringing families together to laugh at each other. House of the Dead's zombie smacking and Virtua Fighter's fighting game help out with their own well-paced timing challenges.    When it comes to some of the more boring games of the bunch, that title is easily snagged by Crazy Taxi. Here, the goal is to wave one's arms and yell and scream to hail a cab. It's just that exciting and about as long-lasting. It's little more than an excuse to fill out the game, but at least there's PuyoPop Fever to make up for it.   Some of the other games are simply aggravating and Super Monkey Ball shows this off pretty well. Just like in the original game, the goal is to guide a monkey in a ball to safety by tilting the board that he's on. The difference is that this is controlled by holding one's arms in the air. This is annoying enough with just having to keep one's arms up all the time, but the EyeToy also has a hard time picking up quick movements so that it's easy to ~lose~ the sensor and have the game roll the bal right off the edge. Similar problems pop up in Sonic the Hedgehog's tunnel racing as well as the rhythmic Space Channel 5.The mini-games in SEGA SuperStars are an interesting mix with a variety in ideas as well as execution. While these are definitely a step up from EyeToy: Play they still have the longevity of a housefly without the added boost of bringing in some friends over for an afternoon or two of goofing off on-screen. It's just too bad that by putting in just a little effort pretty much everyone should be able to get through the game without much difficulty at all.", "date": "Oct 29, 2004"}