{"name": "Tonka Raceway", "name_review": "Tonka Raceway", "ref": "https://www.ign.com/articles/1999/12/10/tonka-raceway", "text": "There are two types of racing games you can do on the Game Boy  the usual behind-the-vehicle, pseudo 3D perspective (Top Gear Pocket, Jeff Gordon XS Racing), or the overhead viewpoint (RC Pro-Am, Micro Machines). Each style has its own merit, but I favor the overhead style because it's more tailored to what the system's capable of.  There have been two of these racing games released this holiday season  Mickey's Adventure Racing and Test Drive 6, and now Hasbro enters the fray with its own take on the style with Tonka Raceway. You can see that the developer had the right idea in design, but unfortunately everything about the game is average or less. Features Three different terrain Four different vehicles Rumble cartridge Only for Game Boy Color  Let's start off with what's right about the game. During the race, your car gives off an constant, idle rumble that gently vibrates the system, while offering a violent nudge when hitting the sides. The game is easy to pick up and play, and the tight controls make it easy to maneuver your vehicle.  Now, let's head to what's wrong with the game. Tonka Raceway may have three different styles of terrain (desert, jungle, and snow), but none affect the road conditions or the maneuverability of your vehicle, nor do they offer any new tracks (each of the three terrain has the same track layouts). The tracks are way too narrow and never vary in width at any time during the race  and it feels like you're driving in a gutter since you can't go off road. If you hit the sides of the track you come to almost a complete stop  there isn't any ~give~ to the curbs in the game. The computer AI is pretty bad, they'll remain grouped together during the entire race, never separating from the pack. The graphics never really change, since the trackside scenery is simply a repeating texture of trees or brush. And if three vehicles get in a line, they'll flicker uncontrollably as if the system can't handle it. The game or manual doesn't tell you what each of the four upgrades do for your vehicles, just generic ~Tires,~ ~Shocks,~ ~Engine~ or ~Turbo~ notations. And even worse, the game is a breeze to finish  once you upgrade your vehicle (available after the first track), the computer drones can't catch up with you. That is, of course, if you learn to stay off the sides of the track. The race information at the bottom of the screen looks like something the programmer threw together at the last minute  providing what place you're in, how many laps are left, and how much time is left on the clock, all in one mess of a text string.  Get the picture? I went through the entire game in one shot without a single loss  but then I said to myself, ~Tonka = For Kids.~ While it may be simple for me, it could be a challenge to the 10 year old the game is aimed for.  I also have to complain about the lack of link cable support, an absolute necessity in racing games  I'll always knock a point off for a game that screams ~two player!~ and doesn't get it.  Developers try, but it's almost if they just can't bump RC Pro-Am out of the top racing spot when it comes to third-person racing games. Tonka has all the elements, it's just slapped together into a sloppy, incompetent package. I will give the game a little leeway for the score, since it is aimed for kids...but even they might find lots to get annoyed at.", "date": "Dec 10, 1999"}