{"name": "Pacific Fighters", "name_review": "Pacific Fighters", "ref": "https://www.ign.com/articles/2004/11/05/pacific-fighters", "text": "My love of flight sims began in the Pacific Theater with Dynamix's Aces of the Pacific. Over the years, there've been many flight sims for fans of the European side of the War, but those of us who dig launching torpedoes at carriers or battling in Zekes and Wildcats have been woefully underserved by flight sim developers. Lucky me, the fine folks at UbiSoft have translated the power of IL-2 Sturmovik to the Pacific Theater, trading the Yaks and Messerschmitts for Zeros and Corsairs. The game can even be installed on top of installations of IL-2 Forgotten Battles or the Ace expansion, giving the player access to the entire range of planes from the series.  The range of planes available in the game is pretty impressive, particularly on the Allied side. Among the planes of the American forces are such standards as the Hellcat, Corsair, and Wildcat. Nearly the full pursuit range, from the Lightning to the Mustang, is included here as well. British flyers can take to the skies in the cockpits of planes like the Hurricane, Seafire and Spitfire. Japanese pilots have a wide variety of Zeros to choose from, or can opt to fly one of several variants of the Tony or the Val. While there's a nice variety of planes to fly here, the absence of flyable models of the Jill or the Avenger means that the game has no torpedo combat whatsoever. And this is a game about World War 2?  The planes all have their historical performance characteristics. Load up a fight between the two of my favorite fighters, the A6M Zero and the F6F Hellcat, and you'll see the difference between the ways the different planes fly. The sturdy Hellcat is faster and can dive more quickly, for instance, but any attempt to turn with the Zero will result in a quick and certain death. The characteristics of the other planes are just as pronounced.   Unfortunately the flight model, though seemingly complex thanks to an excess of controls, is fairly relaxed compared to IL-2. Hardcore players will still have to worry over engine overheats and the drag caused by unfeathered props, but the stall characteristics of each plane seem a bit too loose. I've turned through several arcs at top speed with nary a wing drop. In fact, the few times that my plane has stalled, the nose merely dropped to the horizon to recover.  The excellent slow-flying characteristics will come in very handy during the deck landings. Managing the arrestor hooks and getting just the right speed, altitude and approach is a difficult skill to master. Thankfully, there are some convenient tools to help you land the plane -- although not an actual Landing Signal Officer, strangely. Hitting that moving deck and getting stopped in time is quite probably the biggest challenge in the game.  The missions themselves leave a bit to be desired. There are a number of dynamic campaigns that can go off in unique directions or a number of historically-based campaigns that let you fly numerous sorties during, say, the battles of Midway or the Coral Sea. A mission builder gives you a chance to set up your own encounters but I wish that carrier strikes were an available option in the quick and dirty version of the game' mission generator.  The missions in the campaigns are historical, alright, but historicity in this case is where fun goes to die. Though experienced airmen from the War were no doubt grateful for a totally uneventful mission, the lack of action in some of the missions in Pacific Fighters is really unsatisfying for gamers. Time compression and skip controls are included but these merely reduce the boredom rather than eliminate it completely. Even running at 8x normal speed, forty minutes of nothing happening still eats up five minutes of real time. Good thing there's a TV in the same room as my computer.      You'll need to rely on the game's autopilot for lengthy periods of time and this presents some problems too. Some AI controlled planes smash right into nearby mountains, for instance. Now, the first time this happens, but after a while it starts to get annoying. I let my plane run on autopilot until the final waypoint. Before I thought to take control of the plane myself, the autopilot threw the plane into a spin and splashed right into the ocean.  The combat AI is a bit better. Enemies seem to understand energy management pretty well although, with the relaxed stall model, that's no great feat. You'll often see enemies in front of you scissoring in an attempt to get you to overshoot. Allies and enemies tend to stick together as well, using numbers to overcome superior piloting skill.  The one aspect of Pacific Fighters that shines above all others is the graphics engine. The plane models are just lovely, with all sorts of working parts and loads of details in the textures. Since there are lots of carrier-based aircraft here, you'll sometimes start with folded wingtips. Damage modeling is also high and you'll frequently see little bits of your plane blown off in combat. The cockpits are also first-rate, full of working dials and levers. Everything's rendered in 3D here so you'll get a real sense of what the space inside the cockpit really looks like.  Moving outside the planes, the rest of the world looks just as good. The ships look particularly good -- you can see the planks on the deck and loads of cables and whatnot on the towers. The sea and sky models are also amazing. The clouds and sun flare effects are very believable and the way the sun glints off the sea is just beautiful.   This graphical beauty comes at a price though and you'll need a beefy system if you want to play this game at the maximum settings. The recommended spec handles things pretty well but you'll probably still be limited to 1024x768 resolution. Anything higher than that will have to require you to drop down some of the details.  The audio in the game manages to serve the overall experience but it won't necessarily wow anyone. The engine and weapon sounds are very satisfying but I would've liked more ambient sounds of things like the wind over the wings. There's a lot of radio chatter in the game but it does little to increase your awareness of what's going on with the other planes in your squadron. There's a stirring music score in the game but you can add your own MP3s for a custom soundtrack. Though I liked IL-2 and its subsequent expansions, Pacific Fighters left me wanting more...and in a bad way. The wide variety of planes certainly have their historical performance characteristics but, overall, the flight modeling just isn't as tight as I expected. Add to that the lackluster content of the missions and some outright mistakes on the part of the artificial intelligence and you've got a game that barely scrapes by.If it does manage to please, its probably thanks to the visuals. The planes and the environments they fly in are the best thing about this game. As always in life, beauty comes at a price. In this case, that price is paid by your hardware. The system requirements are steep but well worth it for the effect.", "date": "Nov 5, 2004"}