{"name": "Halo 2", "name_review": "Halo 2 Limited Collector's Edition", "ref": "https://www.ign.com/articles/2004/11/08/halo-2-limited-collectors-edition", "text": "It's this simple: Halo 2 is the best game on Xbox. If you own the system and you do not own Halo 2, you are a chump. I don't care if you have Xbox Live or not, without Halo 2 your Xbox's existence has no meaning. While Halo 2 is not perfect in every aspect, no other Xbox title does so much so well. From the unparalleled sound to the fast-and-fun gameplay, Halo 2 maximizes the 'box's hardware to create one hell of an experience. To properly describe the sensation of playing through the single-player campaign would require numerous joyous expletives (what can I say, I love to cuss). Do I love it? Yes. Will you? Yes. Is it everything I could have hoped for? And more.  IGN reviewed Halo 2 on Sunday. However, Halo 2 comes in two forms. While you can purchase the standard edition and enjoy one of the great first-person shooters of all time, there is an alternative for dedicated fans. Those who choose to spend an extra $5 can purchase the Halo 2 Limited Collector's Edition, which includes an extra disc, packed with bonus content. Because Halo 2 holds such weight and importance in the world of Xbox, we felt it appropriate to offer a separate review of the Collector's Edition.  Before I continue my Halo 2 love shower, I should note that I am not a Halo fanboy. Yes, I liked the original, played through it four times, but it's not one of my favorite games of all time -- it's not even my favorite Xbox game. Halo 2 is a different matter. Though the core gameplay remains the same, it's the multiplayer that sets this at the top of the console food chain. I don't care what scores Halo 2 receives from others and I don't care how those scores compare to a game like GTA: San Andreas -- in my opinion, this is the best console game of this generation.  I do have problems with Halo 2. There are plenty of technical issues visually with texture pop-in and some framerate issues in the cut-scenes, I think the game ends strangely, and there's no online co-op campaign. Despite these and other small problems, Halo 2 still feels more polished than the majority of games released on any console and is a true cinematic experience.   Damn, this game kicks ass.  Total Halo 2 Coverage Master Chief wouldn't stop at merely sufficing. So why should you? Go beyond the call of duty and explore the deepest Halo 2 coverage available.  16:9 Video Review Multiplayer Walkthroughs w/Bungie HD Theatrical Trailer 8-Minute Multi Demo Halo 2 vs. Halo Preview Documentary E3 2003 Unveiling Custom Desktop Wallpaper Join Insider Today  Halo 2: Electric Boogaloo Bungie has wisely placed heavy restrictions on what can be revealed regarding the story of Halo 2. In fact, I can only talk about the first three chapters, which center on Master Chief's arrival to Earth and subsequent combat in the streets. The twists and turns of Halo 2, of which there are plenty, remain a mystery for you to discover on your own. This makes it a bit difficult to talk candidly about the one game design aspect I disagree with: the ending. On that matter, I will simply say that the last chapter ends on the wrong foot, and leave it at that.   Master Chief prepares for another adventure.   Because I don't want to let any surprises slip, I'll talk about Halo 2's story in generalities. It's bigger and better than the original and a lot more interesting. Just a few chapters into the sequel, I was already eyeing the unread Halo books on my desk. The story is more involved, a bit more personal, and even a bit more human. For a genre that tends to focus on the broader story, Halo 2's tale managed to involve me emotionally. It wasn't just about blowing the crap out of the Covenant, there was an emotional value added to Halo 2 that was relatively absent the first time around.  It's not an easy thing to write an epic sci-fi story that is both broad and also intimate at the same time, but Bungie's pulled it off. What's perhaps more important is the balance struck between story and game. There were no times in my 11 hours through the campaign where I felt a cut-scene dragged on too long or that the action became monotonous. Instead, it seemed that each chapter ended by presenting me with new questions and my only hope for answers was to wade my way through scores of enemies to reach the next cut-scene for yet another clue. The game between the story served as the perfect bridge from one plot point to the next.   A lot of folks are Halo fans because of the gameplay more than the story. That will change thanks to Halo 2 as the story is a far better complement to the game itself. I look at it this way: Halo is like A New Hope and Halo 2 is The Empire Strikes Back. That means it's a little darker, a lot prettier, and a hell of a lot more interesting. So, expect to fight Ewoks in Halo 3 (if there is one).    New Jack City If you've played Halo or just about any first-person shooter since Halo's release, you pretty much know what to expect from gameplay. There's a lot of enemies, a lot of shooting, and plenty of exhilarating moments. A few new wrinkles have been added to the gameplay mix and they turn what was originally a stellar action title into the greatest game of its time.  My favorite is the ability to jack someone's ride. Whether it's a Banshee that's flying too low, a Ghost, the powerful Scorpion Tank or Covenant Wraith, if you can get close enough you can steal the vehicle. It's not always easy. When you hop on a Ghost, you just need to attack and you'll knock the rider off his perch and take his place. But for a bigger vehicle, like the Wraith, you need to get alongside it then rip the hatch open (no small task) and evict the rider (preferably with a grenade).  Not only is jacking a nice visual treat, it helps to balance the multiplayer. In the original Halo, when someone got hold of a Warthog, they were tough to beat. You had no options other than bombarding the warthog relentlessly in hopes of taking it out. If there were no other vehicles, that wasn't usually an easy task. Now you have options in a risk-reward system that sometimes sees a successful jack and occasionally leads to a mistimed attempt that gets you steamrolled by the driver.  Double-Fisted Glory Perhaps the more notable (or more talked about) addition is Chief's ability to hold two guns at once. Though not styled like Max Payne or Dead to Rights it still feels awesome to wield two weapons at one time, with Left and Right Trigger firing the weapons independently.   As powerful as it may feel to run around snapping off shots with the Magnum (Halo 2's redefined Pistol) and sub machinegun in either hand, none of the dual-wielded weapons really match up to the strength of the bigger guns. The Battle Rifle is an awesome piece of hardware that is one of the more reliable guns for the campaign. Or you can get up and close with the shotgun. And, of course, nothing really compares to the Elite Energy Sword, which can lock onto enemies to deliver a lunging one-hit kill.   Dual-Wielding is a blessing from Bungie.  Dual-wielding -- and the better overall balance in weapons -- creates more options for how you'll go about laying the smack down on the Covenant. If you choose to dual-wield, you can't throw grenades, which for some folks is a vital part of their game. You can quickly drop your second weapon to chuck the rock at someone, but it's going to cost you a few seconds. That's the tradeoff, but it's that kind of balancing that keeps dual-wielding from being overpowering.  There are other new additions I'm zipping past rather casually, but are significant for fans. In the campaign you can now swap guns with an ally, as long as you aren't trading them a weapon with no ammo. There's a ~no suicide~ rule for soldiers. They may admire Master Chief, but there's no way in hell they are going to give up their only means of defense for an empty clip. Along with this, Chief can ride shotgun or in the turret seat of a Warthog and let the AI drive. Though this sounds good, the AI drives worse than Billy Joel on a bender. Seriously, I didn't know the AI could drive the Warthog worse than I do. At times it can be frustrating, especially when you want them to, say, try and dodge shots from a Wraith or avoid flipping over when navigating rough terrain.  Brute Force Shooting Covenant isn't possible if you don't have something to shoot with. Halo 2 brings back many favorites from the original, but everything has been modified. Some weapons, like the Pistol, have been retooled, renamed (Magnum), and powered down. The Magnum has no scope and isn't quite as powerful as the nigh-invincible Pistol of old. It's a useful sidearm for dual-wielding, but no longer the multiplayer weapon of choice. In fact, I'm one of the only people who uses the Magnum at all during IGN skirmishes over Xbox Live.   Sadly, one big request didn't make the final cut. There is no flamethrower in Halo 2 -- unless Bungie answers every pyromaniac's prayer in a future content download. Still, there are plenty of new weapons (particularly on the Covenant side) to keep you occupied. I didn't even think about the flamethrower's absence until writing these impressions. I had so many other aspects -- in the campaign and online -- occupying my time, I never noticed it was missing. Frankly, I think it would make little sense in terms of gameplay and balance and would only be there for cool factor. And if that's the case, it's unnecessary. Halo 2 has plenty of cool factor all on its own.      Weapons in general are much more balanced this time out. Each has advantages and drawbacks, even the biggest weapons. Covenant Swords actually wear down with use, so you can't pick one up early in a mission and carry it through to the end, destroying all in your path. Plus, some enemies need a shotgun blast in the face rather than a slice from an energized knife.  Each gun has its proper uses, even the weenie guns like the much-improved Needler. Learning when to use the right gun is going to be crucial in certain areas of the single-player campaign as well as in multiplayer. Fortunately, the balance is good enough that skill, not weaponry, tends to be the deciding factor in battles.  Stuck in Traffic Vehicles are certainly a factor once again in the campaign, but are also more enjoyable in multiplayer. Not only is there jacking going on, but the controls for each vehicle have been tuned slightly to make them more manageable. The Warthog, which was the epitome of cool in the first Halo, is somewhat marginalized this time. That's not because the Warthog isn't great, but there are so many other fine vehicles that the Warthog becomes, particularly in multiplayer, almost like your father's car -- a nice ride, but not something that impresses the chicks. Instead, players will probably flock to the Banshee and its barrel rolling abilities or the awesome might of the Scorpion Tank and the Wraith.   The Scorpion is central to my favorite moment in Halo 2, a moment that happens early on (meaning I can talk about it!). The Covenant are storming New Mombasa and your only way into the city is across a long two-mile bridge. Your ride is the Scorpion and when you take control as Master Chief, two grunts hop on the sides, one with a rocket launcher, the other a Battle Rifle   As you slowly ride along this impressive bridge, rolling over abandoned cars and shooting buses that block your path, the Covenant send Ghosts and Banshees to impede your progress. Your job: Use the Scorpion's machineguns and mortar launcher to destroy them all. Visually, it is one of the more impressive stages, as dusk settles, casting an orange haze against the metropolitan skyline of New Mombasa. Knocking Banshee's out of the sky like King Kong swatting at flies -- it's just pure bliss. This is not a difficult section of gameplay, but it is arcade-fantastic.  Jacking Ghosts takes talent.  This scene takes place in the same area as the E3 2003 single-player demo. That demo, though, featured a sideline race against a Wraith. It was also the first scene to reveal Brutes to the world. Oddly, it's not in the game at all. That's right, the eight-minute demo that really kicked off the Halo 2 madness does not actually exist in Halo 2. In fact, the Brutes aren't even in New Mombasa. And, more importantly, none of the cut-scenes from that demo are in the game either. Crazy, huh?  The good news is that the actual scenario in New Mombasa is great in its own right. While it's not the scenario I've been dreaming of for the past two years, the Covenant rampage in the streets is not a bad substitute.  Intelligence of the Artificial Variety If you've played Halo, then Normal difficulty on Halo 2 will likely be a little easy for you. I'm no Halo expert, but I had very few spots of trouble in Halo 2 and the majority of my deaths came from my own stupidity rather than the quality of the Covenant forces. However, kicking Halo 2 up to Heroic or Legendary will be a real sock in the goods. Heroic plays a bit like Legendary from the first Halo and Legendary plays like, well, Super Legendary.   With the advanced difficulty, you'll suffer headshots from the Covenant, flanking tactics, and a much greater enemy presence. There are areas in Halo 2 that, on Normal, almost seem devoid of enemies. On Heroic, those locales can be overwhelming and a true test of your gaming skills. Legendary gets even more intense and don't expect co-op play to help you get through it any easier. On the highest difficulty, if your buddy dies, you both have to start again. Live together, thrive together, die together.  There are some nice AI upgrades that are noticeable even on the lower difficulties. The Elites have a range of personalities. Some will choose to be tactical, some will charge right at you, and some will shy from combat, hiding and waiting for a chance to catch you from behind. Jack a Ghost and the driver isn't going to cry about it, instead, he'll come right at you, trying to take back what was originally his. Hop onto a Wraith and beat the cockpit panel open and enemy forces will launch attacks on you, preferring to destroy their own toy than allow you to gain access.      The only bad AI comes from your fellow marines. They are truly awful drivers and sometimes can be quite stubborn. While you can go up to a Warthog and tell the gunner to get out so you can handle the shooting, there's no way to tell the driver to stop and pick you up. Instead, you have to chase the Warthog around, hoping to corner it and hop in. Though this is rarely an issue, it is still pretty annoying and one of the few missteps in an otherwise superb game.  International Fragfest The campaign is only one half of the Halo 2 puzzle and while I love the single-player, particularly the execution of the story, it's the multiplayer that makes Halo 2 one of the all-time greats. Whether you want to hook up 16 Xboxes for System Link play or jump online, there's an exceptional amount of options to allow you to customize games on 12 different maps just about any way you please.  Bungie has separated online games into two categories, Arranged and Matchmade. An Arranged game is one you set up. You create the game, set the parameters, pick the map, and invite your friends to play. These games are unranked, but offer you total control over every aspect. This means you can select what vehicles spawn on the map, the starting weapon, whether to have power-ups, and if everyone should have active camouflage or overshields.  Matchmade games are for those who care about rankings. With this, you can select from a general type of game to play, such as a free-for-all game (usually a variant of Slayer), clan game, or small team game. You're then matched against others with similar rankings in that type of game and set in a randomly selected match. You may end up in an all swords affair of Slayer on Lockout or a Team Crazy King match with just shotguns and pistol on Midship. You won't know until the game is about to launch.   Bungie chose to do things this way for a few reasons. First, it cuts down on cheaters, because you no longer choose whom to play with in a ranked game. Second, it gets people to play with others of the same skill level. And lastly, it forces players to be good at all maps, all modes, and with all weapons, because you just never know what you're going to get.   I'm not sure I'm the biggest fan of this, but so far I've found it to work pretty well. As for hosting, it's selected automatically based on the best connection of the group. That means there are no dedicated servers. But don't worry, I've yet to have any significant slowdown and I've been playing Halo 2 online for about four days straight. It's the best-running Xbox Live game to date.   Select your color, piece together an emblem, and get online.  The favorite games of Halo have returned along with new goodies like Territories (a Domination-type match) and Assault (a bomb planting game a la Counter-Strike). You can play any of these in four-player split-screen, through System Link or online (with four-player split-screen support!). No other console FPS has robust multiplayer options like this. There's really a game for everyone. My personal faves are Oddball (hold onto the skull as long as possible) and Capture the Flag, though none of the modes are in any way bad. Since you have such great control on how the games are set up, you can always adjust a game mode you don't like to better suit your play preferences.  Along with the great game variety, you can create your own unique skins for Master Chief, selecting a primary and secondary color and also choosing from a large menu of symbols. And if playing a Spartan doesn't do it for you, there's always the option of choosing an Elite skin. Being Elite gives you no extra power or bonus attributes, it's just a different look.  Online is as seamless as it gets. This is one of the rare Xbox Live titles that allows you to add a friend in-game, without having to go to the Xbox Dashboard. Everything you need online is instantly accessible from the lobby and easy to manage. You can group your friends or other players into a party and then travel together into different Matchmade or Arranged games. And if you are the party leader and you hop into another party, you can actually take everyone with you! It's very convenient. Parties are not to be confused with clans. A party is only temporary and goes away once you head offline. Your clan is a permanent affiliation, so don't join up with a bunch of losers unless you want to be branded with them for the rest of existence.      Clan set-up is easy as pie. Create a clan, choose a name, and invite people to join. Set any clan member's ranking to alter their roles and overall control in the clan. I made Fran a Peon, because he annoys me. In this role, he can only play in our little clan games and send clan messages. Higher roles include Jeremy Dunham's Staff ranking, which allows him to recruit clan members and can also demote and promote lower-ranked clansmen (Microsoft should expect a call from the ACLU this week). As Clan Overlord, I have the ultimate say in all areas, as you'd expect.  The big shocker, the ~Holy effing crap this is insane!~ portion of Halo 2 online is the immersive stat-tracking on Bungie.net. Want to check out every game you've played for the past month? You can do it. Not only do you get all your stats for a game, you can see a 3D map showing where you died, who killed you, and with what weapon. Want to know which routes are used most often? Yeah, you can see that. The level of detail that will be available to millions of users at every moment of the day is incredible. No other online game comes close. Not even kind of close. Other Xbox Live games have just been given notice, the standard leader board garbage is no longer acceptable. It's time for other companies to step up and amaze us.  For two years we've waited and hoped that someone, anyone, would make an Xbox Live game that did the service justice. Bungie has answered the call with what is easily the best online multiplayer game available on any system.  The Sight of Lightning Halo 2 is both beauty and beast. It is at once a gorgeous work of art that stands atop all other Xbox games and then, within moments, flickers to show its ugly side. Running at 30 frames per second during gameplay with occasional touches of slowdown, Halo 2 is certainly atop the Xbox FPS heap visually. However, there are some troubles in paradise. Most noticeable and perhaps most offensive is the excessive amount of texture pop-in during cut-scenes and the often meager cut-scene framerate. How a cut-scene, a controlled cinematic, could look worse than the in-game action is beyond my comprehension. Suffice to say, it is pretty distracting. Though there is some draw-in and pop-in at times during gameplay, most of it comes at the start of a level and is forgivable.  These technical issues are outweighed by the sheer beauty of Halo 2. Yes, the above-mentioned is annoying, but so much of Halo 2 remains attractive that it's sort of like looking at a beautiful girl with a gap tooth or bushy eyebrows. She's still hot, but she's got a little imperfection. The texture work is outstanding and Master Chief has never looked so formidable. Explosions are far superior to the first Halo, and I particularly love the secondary explosions on vehicles damaged beyond repair. As for damage, Halo 2 featured fully modeled vehicles, with Warthogs that lose hubcaps and bumpers and degrade throughout a battle.  The explosions are just as delightful as the music.  The action is fast and Halo 2 does a good job of keeping up. I will warn that in split-screen co-op there is a serious amount of slowdown in some areas, but not enough to kill the game or my enjoyment. Overall, there is just so much that wowed me that I can forgive the glitches. The game looks as good as the trailers, has a large variety of environments, and is among the best-looking games on Xbox.  The Sound of Thunder While the video has some glitching, the audio does not. Even though the multiplayer is as hot as it gets, the sound is actually Halo 2's crowning achievement. Not only is this a brilliant use of 5.1 Dolby Digital -- with true directional sound, best illustrated by the pinging of bullets ricocheting off walls behind you -- but the score is phenomenal.   In-game you get pretty much an all-new score with the old Halo choir thrown in once or twice to good effect. This is an evolution of Halo's original score, an upgrade and a well-done one at that. In the early goings of Halo 2, the music is reminiscent of the original, but as you progress, the music becomes a bit edgier, with Steve Vai guitar riffs thrown in with surprisingly good results. The score a perfect fit to the action and emotion of Halo 2. You can't ask for more than that.      A story is not told by the music, but by the voice actors, an area where many games go horribly wrong. Halo 2 does not. With a smattering of big name actors offering voices, it's David Cross who steals the show. As voice of many random marines, it's Cross who delivers the punchlines throughout Chief's adventure. Halo had so many quips that you could play through the campaign four or five times and not hear them all. Halo 2 has more. One of my favorites is one sometimes shouted gleefully by Cross after Chief has swapped weapons with a marine: ~Did you see that? He wanted my weapon.~ Just the same, you can trade a pellet gun (or maybe a Plasma Pistol) for a Rocket Launcher and hear a disgruntled thank you from a marine for the total screw job.  Limited Collector's Edition This special edition of Halo 2 costs an extra five bucks, but is well worth your spare change. The Collector's Edition comes in an attractive tin box with the Halo 2 logo on the front and spine, with a protective slipcase serving to highlight the ratings box and game info. The case is the best I've seen for a video game and is better than the majority of high-end DVD special tins. The case alone, honestly, is enough to warrant a purchase. It showcases Halo 2's special place in the Xbox library and, again, it looks fantastic.  Once you get in the tin, there's a bonus DVD filled with supplemental material. Oddly enough, some cases come with a mid-flap to separate the DVDs, but mine came with one on top of the other, which is a little disappointing.   Here's the full list of what's included on the Collector's Edition DVD:Behind the Scenes: Making of Halo 2 Developing the Game - Visualizing the Story, Designing the Levels, Beyond Single Player: Multiplayer & Live Bonus Materials - Cutting Room Floor, Commentaries, Gameographies, Art Gallery Set Up and Credits - Audio Test, Credits The bonus material is overrun with spoilers and the thoughtful warning at the beginning of the DVD says it all: Don't watch until you've beaten the campaign.   All the goodies in the Collector's Edition. T-Shirt not included.  The highlight of the bonus DVD is the hour-long making of. This documentary takes you inside Bungie Studios for a candid look at some very hard-working folks. Primarily focused on Writer Joseph Staton, the documentary shows a side of the Halo 2 story that may surprise some -- Bungie's disappointment following E3 2003. Though the single-player demo at E3 wowed the crowd, Bungie's take was quite different. An engrossing watch, though there are a few parts (such as the LAN Fest portion) that seem unnecessary.  Other goodies include cut footage, commentaries on every single-player level, and multiple documentaries on Halo 2's development. The majority of extras are worthwhile to fans of the series who want a glimpse at what it took Bungie to make Halo 2. At times, I wished I could have asked a few questions to the DVD, because, while seemingly all-encompassing, a few basic questions (such as the story's ending) were left untouched.  The Limited Collector's Edition is better than most DVD bonus discs, with attractive packaging and informative documentaries. Oh, and it also comes with a copy of Halo 2. You can't beat that. Love it.", "date": "Nov 8, 2004"}