{"name": "Cardinal Syn", "name_review": "Cardinal Syn", "ref": "https://www.ign.com/articles/1998/10/24/cardinal-syn", "text": "Kronos -- the same developer that brought the PlayStation's bland, first generation 3D fighter Criticom -- gives the genre a second shot with Cardinal Syn. And it's certainly a huge step above the company's first effort, but the developers got a little too ambitious throwing every used fighting game  clich in the mix.Cardinal Syn is a weapon-based fighter  each of the game's eight characters (more are revealed when you win the tournament) has his or her own hand-held object to hack and slash at the opponent. While all the characters have their own for-distance projectile attack, 99% of the game takes place up-close-and-personal, and memorizing all the canned combos is key to putting the opponent out of commission. This is a true 3D fighter  like the Tobal series, characters move in the direction of where the controller's pushed. Attacks are simply high, medium, and low, and the other main button is used for blocks and counters.What's more, the 3D arenas are interactive  there will be treasure chests thrown into the fight that will reveal icons for extra power and health (or bombs, just to be annoying). Also, each arena has its own specific hazard that fighters will have to avoid while in the heat of battle  some have electrical pillars that'll zap fighters who are unfortunate enough to get too close, others have arrows that randomly shoot out of the walls. Irritating, yes, but at least it's an option that can be turned on and off.Cardinal Syn features a very smooth, vibrant, and fast 3D engine, as well as an audio soundtrack that fits the fantasy/medieval theme appropriately. However, the downsides of this fighter are all in gameplay, and despite all the features that have been included in the game, Cardinal Syn just can't match the solid playability of other established fighters on the PlayStation.I was more than willing to give this game as much chance as possible before giving it a final review  in terms of presentation the developer included all the bells and whistles, so it's obvious Kronos spent a lot of time making this game. For all the effort that went into the game, however, the game just doesn't play very well at all.First of all, the controls are a bit convoluted. One shoulder button performs a jump, the other enables you to run around the arena freely. Unfortunately, it's easy to get these functions mixed up. Worse, the block mechanism seems a bit unresponsive  sometimes you'll block, other times you won't. It's hard to tell when you're successful in a blocking move.Second, the entire battle is just a matter of simply pushing the right buttons for a preset combo. It's irritating to fight up close all the time, but a game that's nothing more than combinations becomes really dull really fast.This game is great to look at  it's a shame there wasn't gameplay to compliment the excellent graphics engine.", "date": "Oct 24, 1998"}