{"name": "Outdoor Life: Sportsman's Challenge", "name_review": "Outdoor Life: Sportsman's Challenge", "ref": "https://www.ign.com/articles/2004/11/09/outdoor-life-sportsmans-challenge", "text": "Well, this is a strange and tasty hybrid -- an economic management game married to the world of hunting.  Carrying the brand of the hunting magazine Outdoor Life, this new game lets players develop their own hunting park, placing lodges, setting tag prices, hiring staff, prioritizing advertising and all the other activities it takes to run a successful hunting resort. While the concept is undeniably intriguing, the execution falls a bit short in a few key areas.  The tutorial serves as a nice introduction to the most basic features of the game. Here you'll learn how to build trails to certain points of interest and how to hire the right staff for your park's needs. What you won't learn here (or in the slim manual) is how to prevent poaching or how to keep development of your park buildings from driving away the game. Though some of these matters are somewhat intuitive, it'll take a bit of trial and error to figure out just how the game operates.  There are a number of open-ended venues you can practice in if you like or you could head directly into one of twelve scripted challenges. The early missions don't begin to touch upon the game's complexity. The first four missions in the campaign are so easy in fact that they only require the player to make one of two changes to the starting setup before settling down and waiting for the victory. If you're tasked with getting a certain amount of salmon out of your rivers, all you need to do is plop down some fishing shops and drop the tag price for the fishermen who'll be angling in your rivers. Go play Halo 2 for five minutes and you'll be back in time to for your victory. (Those of you who haven't bought Halo can breeze through these sections with the speed controls.)   Things get a bit harder for the middle set of missions and much, much harder for the final missions. Some focus on objectives that can only be achieved through management of several different areas of your park. You may have to reach a certain happiness level among your guests, or achieve a specific degree of park maintenance or ecological balance. Other missions have much more straightforward objectives, like building one of every kind of building available.  In nearly every case you'll know what you need to do in order to succeed. What makes the missions Sportsman's Challenge difficult is that you'll be under a time and financial constraint. Some missions have to be won in a few weeks' time. This is frequently frustrating because the game's pause function doesn't allow you to access any aspect of your park. Pause merely freezes the game without giving you access to any of your report screens or building orders.  There are a few other snags in the interface. For one thing, you can't click on a message to view the event in question. The game will happily tell you there's a fire somewhere on the grounds but it won't actually point you in the direction of the problem; you'll have to search for it yourself. This can also be a problem if you're trying to locate the best hunting areas. It would be very helpful to see a display of all kills for each week on the map. Hell, it would be nice to at least have different mini-map filters for different kinds of animals. As it is you have to puzzle out a very confusing overlay of five different types of animals. This can make it very hard to direct your hunters towards, say, bears over some other form of game.  While you're busy managing your park and its patrons, you'll need to be mindful of the effect that your park's development and the amount of hunting that goes on there have a significant effect on the wildlife. Build your toilets too close to the grazing land and you'll drive the sheep away, for instance. You'll also find that an animal population can be hunted to extinction if you don't set the appropriate limits, either by cutting off the season early or raising tag prices so that fewer hunters seek out the type of game you're trying to protect. You can pay to add more of any animal type to the land (or rivers or lakes) but this is very expensive and you should strive to maintain an animal population that can sustain itself through reproduction.      It's not just about the hunting though. As in Rollercoaster Tycoon, the patrons in Sportsman's Challenge are often in search of different things. Hunters want good hunting, families want nice campgrounds and scenic tours, fat people want more food (no kidding), and kids who have fish hooks stuck in their ears want to see lots of first aid employees. You can also include bars to give everyone a place to unwind once the day is through.  You'll get a chance to re-evaluate your progress week to week. At the end of each week, everyone leaves the park and you have to prepare for a new round of guests. In between the departure of last week's guests and the arrival of next week's, you'll see the change in your animal populations and get the chance to fiddle with your advertising budget and room rates. This way you can attract a certain type of guest, encouraging fishermen over big game hunters, for instance. This marked break between the weeks seems a little jarring but it definitely gives you the chance to pause and reflect on your performance.  Though the visuals are serviceable, the game isn't a graphical wonder. The buildings are the best part of the visual palette here with lots of detail. I do wish the buildings were more identifiable at a distance but when viewed up close, you'll see lots of details. Animals and patrons are a bit less lively, both in design and animation. The hunters and fishermen and the bison and ducks and other animals are all very generic. The environments are pleasant to look at but the textures tend to get a bit muddy when viewed close up.  Sound is less than average in quality. The voice work and sound effects don't add much to the game and you're probably better just turning the sound off altogether and running your own (legally obtained) MP3s in the background. The music for the game is really generic and far too repetitive.  Finally, the game includes some articles from Outdoor Life that are squarely aimed at hunting and camping enthusiasts.   This game seems aimed at a very specific niche but there's definitely some crossover appeal for hunting fans who are tired of trekking through the woods or sim fans who'd rather be selling guns than snow cones. More thorough documentation of the interaction of the different aspects of the park would definitely help those players who are a little less familiar with hunting to get more enjoyment out of the game. Once you do manage to get a handle on how the various factors influence each other, you'll find yourself wishing that the game presented the necessary information in a much more comprehensible format.Fans of tycoon style games will find the subject matter of Sportsman's Challenge to be a nice change of pace. The game itself is less polished than many other titles in the same genre. With more summary screens and a clearer indication of how your decisions impact the world you're playing the game would be much more enjoyable.", "date": "Nov 9, 2004"}