{"name": "Children of the Nile -- Enhanced Edition", "name_review": "Immortal Cities: Children of the Nile", "ref": "https://www.ign.com/articles/2004/11/10/immortal-cities-children-of-the-nile", "text": "did pretty well for itself back in the day. Impressions continued with their style of city planning and made it better, enough so to capture my heart and attention for hours and hours and hours. Regardless of how great the game actually was, it still had its share of problems and begged to be improved. It happens that a bunch of the guys from Impressions picked up shop and moved on to other things... sort of. In fact, they picked up to form another company called Tilted Mill in order to make another game much like the old Impressions city builders. This time, the object was to create a more accurate simulation of life in ancient Egypt by centering on the people instead of the buildings. Immortal Cities: Children of the Nile certainly succeeded in some ways that I enjoyed, but faltered in others. I had fun with Tilted Mills' first title as a team, but it's missing enough to keep it from being great.   On the superficial surface, Children of the Nile's 3D engine (Empire Earth) and graphics are part of that simultaneous steps forward and backward. The engine, while a tad bit dated, is still decent, allowing for a lot of motion and people on screen at the same time. Seeing a bunch of people scamper out to the fields like ants to the harvest is very cool.  Lighting and shadow also makes the game look pretty good when zoomed out to a decent point of view.   The problem doesn't seem to be with the engine as much as the art style which is a little bit stale compared to Pharaoh. There's not as much personality, detail, or fun in any of the new textures compared to the old 2D isometric view as well as some ugly things such as the strange gigantic square quarries, lack of blending between roads and paths, and the short draw distance that creates an ugly thick fog at the edge of vision. The attention to detail just isn't as fulfilling as it has been. Just take a look at the two images below for comparison between the two games and see if you don't agree. On the left we have Pharaoh's temple complex and on the right is the new cult temple in Children of the Nile.         While I may not be as appreciate from an artistic standpoint, the technological change to 3D does allow you to zoom down into your city to get a view at street level. It doesn't do anything for the actual gameplay, but it's pretty cool to get down there and check all of actions of your citizens. You can watch the different crafters create their goods, farmers tend the fields, and the horrible battle animations between raiders and your city guard. Okay, so not everything about the zoom feature is great... but after you've helped your city grow to an acceptable size, tilting the camera down the ground in order to get a nice view of the city can lead to some impressive views of your pyramids off in the background. It's a neat feature that I really wish hadn't come at the expense of detail and style.   The gameplay also turned up confused. There are a lot of great ideas going into Children of the Nile that I am still really excited about. At the top of the list is the move from the old style of housing to the new style. In the past everyone simply lived in housing complexes that had to be within a certain distance of work for them to be employed. The way Children of the Nile works is a bit more realistic and fun. Each household is of a certain type and holds one family unit. That entire family will help the residence run smoothly. The men will usually go out and do the manual labor (planting, hauling, harvesting) while the women will be the ones to go and shop for other goods that the house needs to survive. The kids will lend a hand where it's needed such as out in the field at harvest time or will even go to school in order to become an educated worker later on.    This one change actually creates the need for other changes to pathfinding and so on. Because these families will actually go out and find the goods they need to survive, bazaars set up to deliver merchandise from door to door are no longer necessary. Families travel to different vendors no matter how far they are on the map. This is the neat trick to city planning. The closer the items each household needs, the quicker they'll be able to pick them up and get back to work. Being able to solve all of these little problems and make sure each citizen has their needs fulfilled is challenging and fun.   Getting your citizens working efficiently is especially important because of the day/night cycle. Now that your city has to take breaks to sleep the travel time for farmers, laborers, and educated workers (they specialize in certain government buildings) needs to be minimized. For example, if that doesn't happen, laborers might get to a quarry just in time to go to bed.   The day/night cycle also manages to be a great measure on the seasons. Three seasons encompass a year. One day and night counts as a season, so three nights is a year and the cycle begins again. You always know when the planting season is going to start, when harvesting begins, and when to look for the flood.   The flood is actually a much more important thing to watch in Children of the Nile than it was before. If the Nile rises too high, your town could be under water if you didn't plan correctly. And if you haven't planned for the religious needs of your people in a dreadful time like that, your city could be at your throat in no time.     Religion, medicine, education, funeral services and so on are all run by educated individuals that have been trained at a school. The number of educated workers that will follow you depends on prestige. Prestige depends on your actions both in and outside of your city. These actions depend on a economic system that is different than Pharaoh's and I think a bit better. Instead of gold, your entire economy is run on food and government buildings constructed with clay bricks. So these two basic resources basically make your city work. The relationship between farmers, nobles, tax collectors, the Pharaoh, and the rest of the world is an interesting one. It simplifies the economy and allows for you to concentrate on more meaningful tasks once you get that system up and running.   While I think the ideas at the core are good, there are little problems and omissions that are perplexing. They rely on the system of transportation for goods and your inability to store goods in different places around the city. I really miss supply depots sometimes, especially when it comes to transporting bricks. Some sort of midway supply depot where someone with a cart could push a lot of bricks to a drop-off point. The problem is, eventually, the brick makers and brick layers that you set at the beginning of a game are going to be a long, long ways away from anywhere you want to build later. You can build new brick makers and layers over in the new area, but when you start construction on a new building, those other bricklayers way over on the other side of the map are going to come out to help as well, causing your construction to take a much longer time. If you destroy all of those brick makers and layers, all of the bricks in those buildings are lost, which could be potentially traumatic. Having some sort of transport worker and the ability to tell them to transport bricks from one side to a depot somewhere would be perfect. Or being able to tell brick makers to halt production and move to another brick maker location would be even better.   What's stranger is that the bricklayers don't have carts, especially when you build roads. Roads are almost completely useless in Children of the Nile, which I think is a big mistake. These arteries of transport are a huge part of making transportation and travel more efficient, but make absolutely no difference here. They don't have any cost, increase travel speed, allow for carts, increase prestige, or have any real purpose other than for city planning. In fact, travel is more efficient for these little guys to just go tramping across the landscape, which they do amazingly well. It's just baffling that roads weren't part of the actual gameplay.    The same thing can be said for most of the beautification pieces. None of it costs anything, nor does it do anything for your city except please your own eye. All of it should cost and all of it should have some sort of prestige attached to it. Fractions even, but enough that it makes it worth your while to bother placing it. It sucks to create a gorgeous town square and realize that its beauty means nothing to your city. No one in the city cares and no one outside the city cares.    But the main problem with the game isn't in the fundamental mechanics but in the interface and feedback system. While the interface is functional, it's not as slick as it could have been. I could think up several improvements in the first 30 minutes of playing that I would have loved to see. But the lack of citizen feedback is really surprising. While you can click on a type of person like farmers and see what their complaints are, it comprises all the farmers across the map, doesn't tell you which farmer was having the problem, what the problem really is (whether it's too far or there just isn't something they need at all) and how you can fix it.   It's just hard to find the exact information you need. I want to know how far people have to walk on average to get places. I want to be able to see resources glowing when I'm placing buildings associated with them. I want, when I click on Farmers, to be able to see a list of the families, what problems they're having, and then be able to click on whatever their problem is, zoom to that household and have a reason why they're having that problem. Half the time their problems just don't make sense like one of my commanders that kept complaining about not being able to worship Amun when there was an active and dedicated shrine just outside his door. It is because it's only a shrine? What's the problem? This game seriously needs some well organized informational screens that allow you to look at the big picture instead of always focusing on the individuals in the city. Pharaoh did a great job of that allowing you to locate and fix problems before they got worse. The fact that the game is built differently than Pharaoh because of the family units and lack of walkers (thank you for that, by the way) created a more interesting interface challenge that wasn't solved well in this case.    Beneath the problems of Immortal Cities: Children of the Nile beats the heart of a good city builder. The core idea of the family was a great move forward in this genre, especially for a game like this that deals with ancient Egypt and smaller communities unlike those found in games like SimCity.There needs to be more information provided to players in different types, but the disorganization of the interface doesn't keep this game from being playable or fun for the most part. It's just frustrating when your people begin complaining about something and it takes forever to find what the problem really is.Hopefully in future games from Tilted Mill, which I sincerely hope we see, they'll move to a more modern engine that can handle more detailed textures and building models to complete the great feel of a living city that this game does better than any other.City building fans will find a whole lot to like and explore here, even with some of the frustrations. Children of the Nile is a very decent game that can easily fill the recent void of city planning games.", "date": "Nov 10, 2004"}