{"name": "Painkiller: Battle out of Hell", "name_review": "Painkiller: Battle out of Hell Review", "ref": "https://www.ign.com/articles/2004/11/12/painkiller-battle-out-of-hell-review", "text": "When Painkiller came out back in April, it reminded many of the Serious Sam days, with armies of enemies, brutal weapons, and enough viscera to fill a grain silo every ten minutes or so. Some of us, though, saw it as a step backward in the advancement of the genre. There was lots of eye candy, plenty of action, and lots of chunky slicing, but the pornography-thin story was incoherent, the waves of enemies became numbing, and the set pieces few and far between. The expansion has done a lot to rectify some of these problems, but at it's heart, it's still Painkiller, and that's an acquired taste, especially in the face of more rewarding fare like Far Cry, UT2004, Thief: Deadly Shadows, Tribes: Vengeance, and Call of Duty: United Offensive. When you're ~in the zone~ with Painkiller, it's fun. But it doesn't stick with you like these other titles.  Battle out of Hell begins right where the original left off, starting off with a long pre-rendered cutscene explaining that Heaven's Hitman has to back into Hell to kill Alastor, who's taken Lucifer's place. The voiceacting is underwhelming, and the lip syncing almost painful, largely because we're treated to extreme close-ups of barely-animated faces. They look great when they're not talking, but a little like marionettes when they are. Thankfully, though, we won't see another cutscene for a long while.  You'll dive from area to area, without much context or impression of going deeper into the depths of hell. In fact, most of the time, there won't be much of a ~Hell~ feeling at all. You'll wander through an abandoned urban environment, WWII-era Leningrad, pirate caves, a haunted orphanage, an amusement park, and an ancient coliseum on your way to Alastor, and it just ends up feeling a little slapped together, artistically. The levels look really good, with complex character models, great lighting effects, pretty textures, and meaty physics, but they look like they've all been pulled into the expansion because they look great, not because they fit together or give the player a sense of progression or accomplishment.    Likewise, the difficulty varies from scene to scene. There are a couple downright maddening jumping puzzles (exacerbated by relatively long saved game reload times) and some mysteriously difficult boss fights. As with Painkiller, you'll have to use the environment against the boss monster, and the solution is never easy or intuitive. In the ~Colloseum,~ the final monster appears to be invincible. In the center of the arena are about a dozen pillars and a ring of sticks burning at their bases. You have to shoot the fires to put them out, and once you do, you can damage the boss. There are also some stairs in the arena leading underneath it, and you take damage if you go down them, for no apparent reason.  Then there's the spider monster at the end of Dead City, which looks pretty much identical to all the others you fought before and were able to kill with your relatively conventional weapons. You'll unload half your arsenal until it becomes clear that it won't die. You'll keep on shooting because it bleeds when you do, even though it's not taking any damage. The monster in the coliseum arena doesn't bleed when you shoot it, so you know it's not getting hurt. This is what I'm talking about when I say that Battle out of Hell is inconsistent.      The monsters are generally more difficult in the expansion, meaning that they generally behave the same as before--i.e., dumb as a box of rocks--but know it takes more firepower to kill them. You'll have a few more weapons at your disposal, like an assault rifle that doubles as a flamethrower, and a crossbow that shoots five stakes at a time and alt-fire flechette-style ball bearings, but for the most part ~intensity~ is established by giving the enemy more hitpoints.   Mowing through the enemies is generally pretty easy, even when they're coming from everywhere at once. Since the melee fighters come right at you, all you have to do is run in a circle. Since the ranged fighters couldn't hit the side of a barn door, all you have to do is keep moving. The most difficult part is making sure you don't back into a wall. And if you do, don't worry, because you can quicksave at any time, and the in-game save points bring you to 100 health (unless you have more).  You can have hundreds of health points and an obscene arsenal, so there's always a way to wreak havoc and always plenty of crates full of ammo lying around. Often, all you have to do is switch to your spinning blades and go to town, as long as there aren't any exploding enemies around. It's a fearsome chainsaw. There's also plenty of glowing health balls around, and different types of armor. You'll rarely be in a bad way on the default difficulty.  However, when you are, it becomes epically ridiculous. There's one rail section where you're stuck on the longest roller coaster ever, and bunches of ranged fighters will be shooting at you from all angles. Unfortunately, the oversized filigree on the front and back of the coaster car obstructs your vision half the time. This doesn't stop the enemies from doing damage to you, though, especially the floating ones with the hero-seeking balls of flame. So you'll go through that scene a half dozen times easily, simply because you're taking damage from enemies you can't see, and you can't aim straight because the track is looping and swerving the whole time.   Battle out of Hell is at its best, ironically, when there aren't a lot of monsters around--when you actually get a moment to soak up the mood and look around a little. The game is coated in supernatural Gothic madness, but you hardly noticed most of the time because something's flying at you. When something's not, like in the majority of the haunted orphanage at the beginning of the game, Battle out of Hell briefly transcends the modest trappings of a shameless gorefest and becomes a little bit creepy. Your flashlight flickers and buzzes and doesn't shine very far. You can hear things rattling and groaning in the distance, and torchlight flickers in a gritty, dank corridor. Then a wave of skeleton zombies teleports from the bottom of a staircase, and it's on. BooH benefits from fewer, stronger enemies, but chooses to stick with the Serious Sam level of mindless monsters for the most part. And with a little more story, a little more mood, and some basic tactical intelligence on the part of the enemy, BooH and Painkiller could be something more. Instead, Half-Life 2 is about to be released, Halo 2 is on store shelves, Vampire, the Masquerade: Bloodlines is within a few days of release--there's just better stuff to spend you money on. BooH, like the game it spawned it, is only a guilty pleasure by comparison.", "date": "Nov 12, 2004"}