{"name": "Yu-Gi-Oh! Destiny Board Traveler", "name_review": "Yu-Gi-Oh: Destiny Board Traveler", "ref": "https://www.ign.com/articles/2004/11/12/yu-gi-oh-destiny-board-traveler", "text": "At least three times a year I end up writing a review for a Game Boy Advance Yu-Gi-Oh title. It's almost getting out of hand how many titles there are in the franchise for the handheld. The latest game in the series, Yu-Gi-Oh: Destiny Board Traveler, is an awful, boring spinoff that combines the mechanics of the established card game with the maddeningly sluggish pace of a table-top board game. It's like combining Yu-Gi-Oh with Monopoly, and the pairing mixes together like oil and water. It's a bland design that just trudges along for way too long. Features 750 game cards 12 different characters Link cable support for four players Cartridge save (one slot)  The one constant in all Yu-Gi-Oh games released on the Game Boy Advance: Konami has yet to acknowledge, in game, any newbies to the series. These games have been designed with the mentality that everyone knows how to play the game. Why is it so difficult for Konami to actually offer some sort of tutorial mode so that players unfamiliar to the card game can actually learn the rules and gameplay mechanics without having to shuffle through the instruction book for pointers? And in the case of Yu-Gi-Oh: Destiny Board Travelers, a game that has new rules and new mechanics, it wouldn't have killed Konami to actually hold players' hands for a couple of rounds to learn the elements that make the design what it is?  No matter, because the actual game design is flat out lame. Essentially, players take turns shuffling through their deck of monster Yu-Gi-Oh cards, placing their best choice of monsters on each side of a six-sided dice. Players roll to pull up that particular creature, hoping that it's powerful enough to attack the creature that takes that one space. Each space has a creature guarding it, whether it's owned by the ~board~ or one of the players who have already secured it with a monster battle. To capture the space, that player must roll a special die that may hurt or help either player's creature, whether it's increasing or decreasing its attack/defense points, or simply swapping the value of the attack/defense points for that character. So, if a particularly weak monster goes after an uber-powerful monster, a roll of the dice can turn a mere mouse into a massive, unstoppable beast.  The idea, of course, is to control as much of the board as possible, and with the most powerful creatures you can place there. Almost like having hotels on Boardwalk, a high level beast can dominate a particular space. Each character, based on the anime series, also has a special ability which can be pulled up during the match and turn the tables on the other three players. The game offers as many as four players via link up and only link up, since players have to hide their creatures from each other.  This game may work better as a real-world design, but it's an absolute drag to play this on the Game Boy Advance. Games can last hours without a single way of saving the progress for when players grow tired of the back and forth progress of the game's pacing. The design encourages players to try to win matches in order to unlock new boards, but I was done with the game after only a couple of matches. This game just isn't any fun, and it lacks the pacing and strategy established in the trading card game. It also has some of the most illegible text ever created in a Game Boy Advance game, but that's the least of the game's worries. I'm not anti-Yu-Gi-Oh, and if anyone reads my reviews of the actual card games I tend to give them a fair shake. The card game has a ton of depth in terms of strategy, and for those who are willing to put in the time there's a lot to get out of it. Not so in Destiny Board  Traveler. Whatever strategy is in the game is lost in the drab, dull gameplay that's more based around luck than skill. It's one bland experience from start to finish.", "date": "Nov 12, 2004"}