{"name": "Baten Kaitos", "name_review": "Baten Kaitos Review", "ref": "https://www.ign.com/articles/2004/11/13/baten-kaitos-review", "text": "As one of few remaining exclusives on the Nintendo GameCube, Baten Kaitos: Eternal Wings and the Lost Ocean represents more than just another entry in the systems surprisingly thin library of RPGs. It's something that Cube loyalists can call their own. It may sound odd, it may sound funny, but in the system wars, a good exclusive is the equivalent of a megaton bomb. And the more you have the greater chance a system has of rallying troops to its side. Baten Kaitos is one such quality exclusive. With Baten Kaitos, Monolith Software has crafted a beautiful and thoroughly engrossing game filled with great characters, impressive visuals and solid combat. The world of Baten Kaitos has been fully realized through a spectacular mixture of pre-rendered backgrounds and FMV. It also boasts one of the more unique approaches to combat and inventory management in recent memory, basing acquisition of items and weapons on magical cards known as ~Magnus.~The story, so farIn fact, much of the game revolves around these ~Magnus~ cards, including the narrative. The story of Baten Kaitos takes place in a world of floating islands, at a time when people have evolved to a point of sprouting wings on their backs. According to legend, an evil deity by the name of Malpercio once invaded the world and sucked the oceans dry, leaving everyone to make homes for themselves in the sky. Malpercio ultimately fell under the power of spiritual heroes. Using five Magnus cards known as the ~End Magnus,~ these heroes confined Malpercio. Peace returned to the world. Like any good RPG, this peace eventually comes to and end. This is where Kalas, the ill-mannered and selfish protagonist, makes his entrance. At the start of the game, Kalas wakes up in pastoral village on the Sadal Suud Frontier, the most rural of the floating island continents. Upon getting his bearings, Kalas joins a fellow traveler by the name of Xelha, a strong-willed yet nave traveler. Together, they inadvertently unleash the first End Magnus which binds Malpercio. Before they can claim it as their own, the Empire, the ruling body governing the floating continents, steals the End Magnus. They also kidnap Xelha and leave Kalas for dead.   Admittedly, the setup sounds  clich. Evil Empire? Check. Reluctant hero? Check. Slumbering evil just bursting to destroy the world? Check. But it's not all bad. What the story behind Baten Kaitos lacks in originality, it makes up in solid character development and great pacing. The story progresses at a brisk pace, with plot twists and revelations popping up when you least expect them. The five characters that join you appear flat and two-dimensional at first, but wind up growing on you and greatly effect your emotional investment in the game. And if there's one thing RPGs can do without (or any game emphasizing narrative over action) it's a lack of genuine characters.  Just be sure to turn off the voiceovers. The voice acting here hurts. One realizes that time, effort and money went into recording the speech in Baten Kaitos, of which there is plenty, but the result simply robs from the experience. When all you have to go on in terms of character is text and a few facial expressions (displayed on the bottom of the screen next to the dialogue), it's all up to the writing to convey personality and any kind of emotional depth. Well, Baten Kaitos has good writing but the voice acting simply ruins it. It sounds like a bad dubbing job on an anime film, with voices sounding confused and overly anxious, even during the most mundane conversations. To be fair, you have the option to turn it off. So, please do so. Simply reading the text makes for a far more genuine and believable experience.    Pick a card, any cardThe card-based inventory and battle system is one of the most talked about features of Baten Kaitos. Instead of finding items and stuffing them in an imaginary storage locker (as in most RPGs,) you store them on blank Magnus cards. This makes for a very unique and refreshing experience, as you only receive a limited number of these blank cards. Investigating your environment reveals hidden items just about everywhere, forcing you to choose a very limited number of items to take with you on your journey. Some items you need to progress in the main quest, so those are handled differently and don't use up your precious cards.Random items you find in drawers and barrels come into play in wildly imaginative ways. For example, you can visit a dairy and trap the essence of fresh milk on one your cards. You can use the milk to heal yourself in battle for a certain number of health points. Should you decide to keep the item in your inventory, it eventually curdles into cheese, which heals a character better than plain milk. This calls for very fun, yet somewhat strange, inventory management strategies. Trap the essence of fruit and it will heal you in battle. Wait awhile and the same piece of fruit rots and can be used as a weapon during battle, causing poison as an added bonus. Seeing as Baten Kaitos features over 1,000 Magnus cards, you can spend a large chunk of time just running around the game world finding different cards just to see what you can do with them. Combat plays out in similarly distinctive fashion. You engage enemies much like in the Playstation classic Chrono Cross, meaning you can see enemies on the map and avoid them if you wish. Instead of physically carrying around weapons and armor, characters use the essence of such items using cards. Each attack, whether magical or physical, is based on a card with a numerical value and elemental property (fire, wind, water, etc.) Succeeding in battle revolves around using the appropriate defensive cards to block attacks and the forming of attack combos. Using the right cards to block and to form attack chains is one of the coolest parts of the game.   At first, it can seem simple: use water-based armor to block a fire attack, and use fire attacks on aquatic enemies, etc. But the longer you play, the more involved combat becomes, forcing you to invoke a complex chain of cards to block a single attack. At first, combat feels a little tough, because you only have a small pool of cards with which to make you battle deck. After some five hours of adventuring, you'll amass a sizeable mound of cards, letting you swap cards in and out of your deck to survive particular situations. In a fiery cave? Swap your fire-based armor and weapons for those of a frigid nature, and so on. The entire system is well thought and a joy to use. One of the stranger elements of the battle system has to do with forming combos. Not just any combos, mind you, but the super powerful ones. These you can only perform by leaving random cards in your deck and heading into battle to see if they have any kind of effect. The most powerful combos in the game arise out of pure guesswork and chance. Specific offensive cards, when used in a specific sequence, trigger a combo when combined with specific non-combat related cards. Sound confusing? Well, its. And a tad annoying, to be honest. Later in the game, delivering potent attacks is essential to your survival, and having these very potent attacks locked behind an undecipherable pattern of cards will leave you weak. A bit more logic would have been greatly appreciated. Of course, if you like going through hundreds of cards (some as random as stagnant water, pressed flowers and rice wine) then you'll spend weeks just trying to unlock the 140 plus combos in the game. You'll find some by accident, which in a way makes it worse, because you'll see how much damage you could be dealing if you had more combos at your disposal.    Level up!Baten Kaitos handles character growth a little differently than most RPGs. Instead of just leveling up whenever a character earns enough experience, players need to visit a church and level up manually. You visit the church through the same magic plants the game uses to save your game. These plants can be found in convenient locations for the most part, and are usually located nearby important locations, such as boss fights. Instead of feeling unique and different, or adding depth to character progression, the system comes off as arbitrary and hokey. There's really no benefit in hoarding experience points until you remember to level up. Sometimes, the system even backfires, as you may forget to level up before heading into battle, leaving you at a disadvantage. Apart from increasing your stats (Attack, Defense, Agility and Vitality) leveling up increases the amount of cards you can use in your battle deck. Like most RPGs, Baten Kaitos features a bunch of side quests, puzzles and mini-games. While rare, these sections add a little extra oomph to the game. You'll engage in arcade-like shooter sequences and even a little stealth action. One such side quest has you collecting constellation Magnus for an old man who wants to decorate the ceiling of an old church. Another has you running around the world searching for the relatives of a dying man and filling out an intricate family tree as part of his dying wish. Throughout the game, people you meet will ask for items and reward you if you happen to find them. Come here, my pretty.Baten Kaitos is one pretty game. The character models reflect a good amount of detail, as do the environments and structures. Blending intricate pre-rendered backgrounds with striking FMV, each of the island continents in Baten Kaitos looks astounding. You'll explore jungles filled with swaying trees and watch as birds dart through exotic foliage.   You'll run through thick, sun drenched clouds as you make your way through open-air markets and villages. Waterfalls and streams feature beautiful animation, adding an immense amount of atmosphere. Each area is saturated in little details and graphical touches, with each of the floating islands carrying a distinct theme. You'll have a lot of fun exploring this one. While the game doesn't feature dynamic lighting, or other such effects, the use of color and overall design of the world is terrific. It's an imaginary world realized through digital artistry. The only real complaint in the visuals department is some of the enemies, which suffer from bland design and lackluster textures. The sound and score in Baten Kaitos matches and sometimes exceeds its visuals. Motoi Sakuraba's soundtrack is utterly fantastic. Each area of the game boasts a different theme both visually and aurally, and the music makes just as big an impact on the player as the visuals. Everything form the beat-happy, infections combat theme to the subtle and melancholic tracks during the game's more dramatic moments, make the soundtrack in Baten Kaitos memorable and simply adds to an already satisfying game.  In short, Baten Kaitos delivers one of the finer experiences on the GameCube. If you own the system and love RPGs, go buy this sucker just as soon as it lands on store shelves. It boasts great visuals, genuine characters and a solid, albeit somewhat unoriginal, story. The combat is fast and unique, with over 1,000 cards to form your perfect deck. The journey should last around 45 hours for the average gamer, but expect to spend some extra time if you want to unlock everything this game has to offer. Highly recommended.", "date": "Nov 13, 2004"}