{"name": "Railroad Tycoon 2", "name_review": "Railroad Tycoon II", "ref": "https://www.ign.com/articles/1998/10/28/railroad-tycoon-ii-5", "text": "I'd like to start this review with a note to action gamers. Railroad Tycoon isn't for you. Now shoo, go away... this review is for strategy fans only. For the rest of you, here's a quick summation... Railroad Tycoon II is one of the deepest more satisfying strategy games I've played this year and is a more than worthy sequel to Sid Meier's classic. Although it's in no way a title that's going to force action gamers decide that they've been wrong all of these years, Railroad Tycoon will keep most hard-core strategy fans busy for months. After annoying the crap out of PopTop and their very patient PR agency, the companies agreed to let IGN-PC have the first final code. Here's what we thought...  Okay, let's get the superficial stuff out of the way first. Railroad Tycoon II looks good. I mean really good. From the furthest camera views out you can still make out the movement of the trains and the city names. Once you zoom in, you'll be able to see your wheels spin, the smoke rising from your trains (er, I hope your still in the steam era) and the individual branches on trees. Most of the various resources in the game are easily identifiable even if you've never played a strategy game before (steel mills look like steel mills, coal mines look like coal mines, etc.). There are a few exceptions to this rule though, cattle farms and sheep farms look a bit too much alike and the cannery looks pretty abstract. Fortunately, if you can't identify something by looking at it, the sound it makes will probably tip you off to what it does.  Railroad Tycoon II also boasts some amazing sound effects. The entire game is narrated by an old timer that makes me think of Uncle Jessie from the Dukes of Hazzard every time I hear his voice. As your guide to the game, he'll talk you through each one of the introduction sequences and offer you consolation or congratulation after each mission. If you leave him hanging for long enough, he'll slip off to sleep and start snoring (WARNING - This noise is very likely to annoy co-workers). There are loads of different sound effects included in the game, from the sound of your trains chugging along and factories clanking out their production lines to the whistle of the wind through high mountain ranges and the bleats of sheep in the field. As I stated above, this can be more than just a cool effect. Sounds really help you to identify things on-screen quickly.  As nice as the narration and sound effects are in this game though the real showstopper is the game's soundtrack. Filled with all sorts of bluesy riffs, the soundtrack manages to keep you entertained without every becoming annoying (unless you hate the blues, in which case you're screwed). Of all the games I've played this year, this is the only one that didn't have me wanting to strangle someone after listening to the game's soundtrack for the fifth or sixth time. Let's hope that more companies try and implement scores that are as pleasing and non-obtrusive as this one.  Still, none of this is what makes Railroad Tycoon II great, it's all just icing on the cake. The bottom line here is addictive gameplay with loads of variation. The original Railroad Tycoon offered up various time periods and basically said, ~make lots of money and drive your competitors out of business.~ That simple game mechanic was enough to keep us busy for months at a time. While the original game did boast difficulty settings, these mostly determined how many game features you could use, changed how skillful your competitors were and decided how much they would be able to 'cheat' financially. Railroad Tycoon II offers up the same open gameplay for those who want it, but adds a campaign mode that lets you take on various missions in which you're required to face the same hardships that the original railroad barons had to deal with. Some missions require you to connect cities across a continent, some require you to build a personal fortune and others to carry a president to as many different cities as possible in a limited amount of time. When a mission ends you're given an opportunity to either quit and move on to the next challenge, or continue playing out the empire you've built. PopTop has done a great job here of breaking up the monotony of simply performing the same actions over and over without taking away you're right to play as you wish.  When you've selected the circumstances under which you'll be playing, it's time to start trying to make some money. In most scenarios you'll start with a limited amount of capital that you'll use to build a small connection between two well-populated towns. Everything that is within the area of influence of your station (smaller stations give you a smaller working area, larger stations give you a larger working area) will generate certain supplies and demands. A town with lots of population, a cattle ranch and a steel mill will generate a supply of passengers, mail and cattle. It will demand passengers, mail, grain (for the cows), iron and coal (for the steel mill). If you bring enough iron and coal to the town, the steel mill will also generate steel, which you can in turn carry to another town for more profit. The real trick to the game comes from being able to spot which runs will be fast an profitable and which ones will require too much in the way of track and engine maintenance to be worth the trouble. If you're doing really well, you can actually buy the factories, mines or farms that you're dealing with to make even more money.   One big difference between the original Railroad Tycoon and the sequel is that this time around you're able to run your trains on competitors' track and to cross their track with your own. While you'll have to pay them for every mile you use, in some cases you can make a lot of money connecting your existing rail with a particularly large town that your foe managed to get to first. This new feature is not only more realistic, but it also renders worthless the asinine tactic of surrounding a city with track so that your competitors can't get any of the goods within.   Once you've gotten comfortable with the basics, there are loads of different skills you'll need to master. In the beginning, it's plenty to just build track and connect cities, but eventually you'll have to face the fact that through shrewd investment, your competitors are making more money off your hard work than you are. To protect yourself, you'll eventually need to master the art of the investment. Railroad Tycoon II boasts a pretty sophisticated stock market that rises and falls depending on the current state of the economy and how much profit the company is making. Once you get the hang of it, you'll be able to make money off of competitors who are doing well and even force mergers with those who aren't. Be careful though, although the game allows such complex actions as buying stock on margin and selling short, doing so can result in your having to declare bankruptcy. Yet another way that this game mirrors the real world.  In fact, Railroad Tycoon II's sense of history is one of its most incredible strengths. Most of the scenarios in the game have been researched extensively and will force you to deal with political and economic situations that actually occurred in the era and location you're playing in. While playing one of the British scenarios I invested heavily in a very profitable agricultural run between Dublin and Belfast and several smaller cities. When the Great Potato famine hit and wiped out my empire I sincerely wished that I had paid more attention in my high school European History class. You'll also get a chance to engage in some of the shadier dealings of the times in pop-up windows that will appear from time to time. In the time that I've been a railroad man I've been asked to look the other way while opium was smuggled, I've invested in experimental technology and I've bribed kings. Things don't always turn out the same, so every game you play is always at least a little bit different from the last.  ~But Trent,~ you say, ~they didn't include my favorite railroad era or location.~ Don't sweat it, PopTop has been cool enough to include one of the most impressive game editors I've ever seen. Not only will this nifty tool enable you to build your own landscapes, but also to attach events to certain dates or at random times. For those who aren't so hot at land design, all of the country layouts that are used in the campaign mode are available for you to attach your own events to. I spent hours with this tool trying to recreate the early North Carolina railroad expansion but I think it's going to take a little more research on my part before I can completely complete it. I'm expecting that a ton of these maps will start showing up on web sites in the coming months.  Despite all of Railroad Tycoon II's pros though, it does have a few cons. The most noticeable (and confusing) flaw is the absence of any sort of tunnel construction. No matter which era you're playing in, if there's a mountain in your way, you'll have to lay track over it... there's no way to go through. This is not only a huge problem in terms of gameplay (tunnels were expensive, but they improved the speed of delivery though mountainous areas dramatically), but also in terms of aesthetics. Everyone's favorite part of any train set was the little tunnel. There's something magical about watching your train disappear and reappear.. I don't know, maybe it's just me. It seems likely that this major feature was included simply because it was too hard to pull of with the graphics engine used by the game as trains will often disappear when they go over bridges as well. There also seem to be a few problems with the game's path detection AI. More than a few times I completed a railway between two cities and never received credit for it. Still, in the long run I have to admit that no matter how disappointing both of these issues are emotionally, neither ever really ruined my ability to enjoy the game.  Railroad Tycoon II isn't for everyone. There's not a lot of action here, and even real-time strategy fans may not understand the allure of a resource management game that doesn't let you kill anyone. With that said, if you're a hard core strategy fan who's into world building, you'll have a hard time finding a game that will keep you more entertained than this remarkable product.  -- Trent C. Ward", "date": "Oct 28, 1998"}