{"name": "The Urbz: Sims in the City", "name_review": "The Urbz: Sims in the City", "ref": "https://www.ign.com/articles/2004/11/15/the-urbz-sims-in-the-city-2", "text": "Last year, Game Boy Advance owners were introduced to The Sims series in an original production that spun out the whole virtual life idea into an original, portable-centric edition unique to handheld gamers. As successful as that game design was, Electronic Arts, Maxis, and Griptonite have pushed the game forward into a bigger and badder edition to accommodate the new direction the console games have taken. Enter The Urbz: Sims in the City. Features More than 25 locations Cartridge save Link cable support for four players Eight mini-games to unlock  First glance, The Urbz doesn't look much different than last year's The Sims: Bustin' Out. That's because it's from the same development studio, using last year's game as its foundation.  The original's~Goody Two Shoes~ art style of The Sims Bustin' Out has been pushed aside in favor of a more ~gritty~ environment, though the game doesn't have quite the ~urbaness~ that the console version pushes on the player. You'll encounter occasional graffiti on walls and litter scattered around the area, but the ~hip urban~ theme isn't quite as saturated as the console's design.  The GBA sequel is nearly identical in gameplay as the original title. There's just ~more~ this year, which definitely works to the game's advantage. The first game was a decent length but ended surprisingly quick for a game in the Sims series. This time, though, Urbz is an extensive adventure that covers a much larger area, and the further in you go different stuff unlocks. It'll take players a good day or so just to get through the first city and branch off into the next territory, and to complete the main quest you're looking at a good week or more.  Of course, much of the playtime involves a ton of tedious busy work. This is the Sims, after all, and though you only care for one Sim character instead of multiples, your on-screen persona requires an enormous amount of hand-holding in order to remain healthy and at peak performance. As you work your way through the progress tree you have to deal with the admittedly annoying tasks of sending your Sim/Urb character to bed, to the bathroom, to the shower. Since the game's task and level designs pretty much revolve around these menial duties, without them Urbz wouldn't be that meaty at all and quite easy to beat. But they do start grating on your nerves the deeper in the game you go, especially when you simply want to finish a specific task without needing to hit the john every ten minutes.  There are far more character elements to keep track of, though. Along will keeping tabs on your person's hunger, fatigue, and bladder levels, you'll also need to earn ~credentials~ with the inhabitants of the world. Earn creds with the Nerdies, Streeties, Richies, and Arties by conversing with them positively, which will open up the tasks that they require of you to move deeper into the game's structure. Talk about things they like, and avoid things they don't like. The conversations do get a bit tedious since it's a simple matter of remembering the positive subjects and repeating that selection over and over and over. It's very difficult to actually get a character to hate you in this game, in fact you have to really try your darndest to get on a character's bad side. Urbz really is suited well to the Game Boy Advance market since its gameplay is near endless. Even after the main tasks have been completed you still have the ~Sims~ esque element of complete customization of your pad, creating a livable space with the hundreds of items that can be purchased and collected along the way. The game's still not as versatile in its customization as the PC and console games due to GBA restrictions, but for what the system's able to do, you can do plenty: hang pictures on walls, arrange sofas and other furniture in different locations and positions. Items can be traded between systems via the link cable as well to encourage passing items back and forth between Sim characters.  There's also enormous payoff to actually get through the main adventure. There are as many as eight different mini-game ~jobs~ that can be unlocked, and once they are they can be played once a day in the main adventure, or any time, either solo or with other players via link cable at the main menu. Each game ~borrows~ from classic game designs, so you're not going to get anything super original. But the dangling carrot is there, encouraging players to continue onto the games different locations in the city in order to unlock them all. Last year's The Sims: Bustin' Out turned out to be a surprisingly addictive and engrossing simulation on the Game Boy Advance, and that theme has continued in its sequel. It's not enormously different than 2003's offering, but the developers took the time to lengthen the experience with more things to see, do, and play, and though much of the game remains identical in a newer setting, Urbz still offers plenty to keep Sims fans latching onto their Nintendo portable.", "date": "Nov 15, 2004"}