{"name": "Nicktoons Movin'", "name_review": "Nicktoons Movin'", "ref": "https://www.ign.com/articles/2004/11/17/nicktoons-movin", "text": "We've recently seen the EyeToy do a few new tricks with AntiGrav and even Sega put out a dozen mini-games with SEGA SuperStars, but now we also have Nicktoons: Movin' which puts lots of animated characters into the action as well. SpongeBob SquarePants, Jimmy Neutron, The Fairly OddParents, and more are all included to provide a world that kids will want to interact with. With over a dozen different games and a healthy amount of variety between them this is a good title for parents who want to get their kids off the couch for a little while.   Like other EyeToy games, Movin' is a collection of mini-games, this one has 13, where players compete for the highest score. If it's too easy the action can easily be taken up a notch by moving the skill from easy to medium or hard. One of the best aspects of the game is that the hard setting really is difficult to pull off and provides a good challenge for kids who want to push themselves and break a sweat in front of the television. And in such a fashion the obesity epidemic will be treated with videogames. Oh, the irony and let's move on.   In many different EyeToy games there is the traditional ~smack the stuff~ game that involves players in the frantic quest to wave their hands over any offending item on the screen. In the original EyeToy: Play this was soap scum on a window and we've seen all sorts of variations on the same theme in the past year. To be honest, Movin' has these same types of games, but still manages to present them in a lively way that keeps them a little fresher than can be expected.   One of the mini-games puts the player in as a goalie in front of a hockey net and he needs to block the pucks as they come flying towards him. Instead of simply smacking the puck at any time this is a matter of timing and when there are multiple pucks flying at once this requires some serious coordination. Jack up the game to the hard mode and there are two hockey players firing off pucks. This would be tough for players at any age and that's a great thing because too often children are treated like people who can't handle a serious challenge.    In many of the other games there are skills that are required beyond the normal waving of the arms as well. In a SpongeBob SquarePants bowling game the players have to ~guide~ the ball down the alley by waving on the left or the right. While it has to be said that the physics are a little suspect and that the pins move like they weigh 50 pounds each this is still a game of finessing the ball along the way. The same tactics will not work every time and once again this is a suitable way for kids to try something new and somewhat difficult.   Many of the other mini-games show other creative ways of using the license beyond just sticking it in there. Puzzle pieces are moved around, submarines are guided through mines, and ghosts are zapped with lasers. If children are huge fans of the TV shows, then they should enjoy what this title has to offer.   That being said, there are still the traditional problems with the EyeToy that if young 'uns are playing, then the parents need to be aware. When the game needs to read a large portion of the screen it can misread some of the action on the bottom and lights can set off the sensor as well. The technology is pretty good, but not perfect and it's important to help kids figure out what's going on.    If everything works out flawlessly and the little webcam is working perfectly, then let the kids invite some friends over because the game can host multiplayer competitions for up to eight people. It's just a matter of trying to get the highest score, but the winners get to have their pictures taken with the cartoon characters in the game. Of course, be sure to expect the winners to make silly faces and maybe even some rude gestures. That's what we would do at that age and now.  The mini-games in Movin' have a healthy variety and a good range of difficulties so that kids will be entertained and challenged by it for at least a little while. We can't make any guarantees for the lifespan of a youngster's attention span, but if they're fans of the Nicktoons shows this should be a good present for them. It'll get them off the couch for a little bit and give them a chance to try out some old-fashioned competition.", "date": "Nov 17, 2004"}