{"name": "MTV Sports Snowboarding", "name_review": "MTV Snowboarding", "ref": "https://www.ign.com/articles/1999/12/14/mtv-snowboarding", "text": "It has to be possible to make a good snowboarding game. It just has to be possible. You have a board, you have snow, now rip it up! That's the whole gig, and yet only 1080 on the N64 has really pulled it off.   THQ's MTV Sports Snowboarding is the latest attempt at the sport, and it's not half bad. The problem is that it's not much better than half good either. This game is in a weird spot amongst a crowded field. In many ways, it's the best snowboarding game available on the PlayStation, besting Cool Boarders in every incarnation. The play control is good, the speed is fast, and the balance of realism and fun is fairly even. But there's still not a lot of life in this game. It's generic and hollow, with a character set that is completely inexpressive and a series of  challenges that are just impassive. It's almost as if the designers didn't care if you have fun playing, just as long as their game is technically astute.  Gameplay Point your board downhill and go. MTV Sports Snowboarding doesn't do much to change up that formula (a surprise, considering that the MTV Sport show often features extreme variations on sports, such as helicopter drops and sand surfing). There are four countries represented here, and each has only a single mountain to run (although there are variations on the courses when you get into the MTV Challenge Mode). What's nice about the track design is that there are short-cuts and alternative runs all over the course, making a trip downhill much more like boarding on a real mountain.  There's also plenty of air to be had here, as dips and ramps litter the trail. Skip off a cliff and hang one of 10 moves [per character] while in air. There are also variations in each trick, and hidden moves to be found, so the total set of 46 tricks, many of which can be linked into combos, is decent. The feel of pulling off tricks is also quite good, as moves are realistically difficult to do. Tricks have accurate physics and controls to capture the difficulty and the fun of the sport -- the buttons are logically laid out, spins slowly speed up as you gain momentum, and landings are reasonably tough to stick. Grinds aren't too remarkable or difficult (you don't control speed or balance in a grind), but at least boarders don't magically stick to magnetic rails like in Cool Boarders. One huge problem with the trick system is that linking tricks just doesn't work as well as it should. With some moves, you can't link another trick at all, so the game has you just falling out of the air after pulling off a kick-out flip. Grab-to-grabs are almost impossible, even though you get plenty of air.  The game feels quite solid. Speed is faster than any other boarded on the PlayStation, and the pace of a race is exhilarating and yet always controllable. Acceleration isn't accurate nor intuitive (the up/down controls are supposed to regulate your speed by allowing you to duck down as you race, but ducking is not very responsive, especially with an analog controller. Even when you do duck, the speed increases but the control doesn't change at all to adjust for the lower center of gravity). However, carving control is almost spot-on, as you lean some into sharp turns and sway as you run over gently weaving hills.   But I can name half a dozen other boarders (none of them with the word ~cool~ in the title) that control almost as well as this game. Playability is the only strength in this otherwise tame game. For instance, MTV Challenge set-up, which forces you to play the different mountains and qualify 20,000 points (all of which have to rank on the hi-scores board, for some reason) before you can actually race a competitor, makes for some boring down-time before players can ever get into the heart of the game. Once inside the Challenge, there are only two different types of events (trick and speed), and while there are slim variations on the themes, there's nothing innovative like a game of Horse or a half-pipe two-in-the-tube doubles event (in fact, there isn't even a singles half-pipe event -- half-pipes can be found in the middle of tracks, but there's no individual pipe to practice on).   In some ways, this game is even a step back from X-Games Pro Boarder. THQ didn't get the license to pro snowboarders, so the riders are caricatures of real people (and bad caricatures at that -- the Asian girl is named Sakura). They have no distinguishing abilities to make them special -- riders do have individual skills, but the differences are minimal and their abilities aren't ranked. Choosing a board is equally pointless, as the boards are only different in appearance. Mountains are varied in their runs, but there isn't much going on in one course that can't be found somewhere else, to a lesser extent, in another course. For instance, the USA course has a section with a lot of trees, but that area is over quickly and then it's back to cliffs and ramps. There are no slalom runs, half-pipes, big-air ramps, or moguls. There's not even ice or powder to change up your handling-- only rocks and snow.   The game is just universally boring. Two-player runs are uneventful, and although the frame-rate is solid, the game isn't much fun for two. It's just either more tricks or more racing -- no hot competition in either event. Part of this is that shortcuts, while common, don't do much to shorten the track -- their just side runs. This means that ambitious players who fall behind won't make up much time going off-course, so there's not much tension in making a choice of branching paths. Even the promising create-a-park option is garbage -- you place obstacles and ramps, but you don't shape the hill (in fact, you don't even see the hill while designing), so hand-made courses are generally as boring as those Quake arenas your buddies e-mail you with ~DOWNLOAD THIZ!!!~ written in the message. In general, the game provides the bare minimum for gameplay and assumes that players will find some way to have fun playing. It controls well, but it doesn't live up to its extreme namesake. Graphics Equally proficient and yet not quite noteworthy. The game looks very nice, in motion and in stills. Riders are well-defined and animate quite well, as it looks like they are really taking to the snow. They weave, bobble, and lean as they ride the terrain. Unfortunately, the characters are bland and don't stand out much from one another, but at least they didn't all shop at the same parka shop as the Cool Boarders kids did.   Courses are also nice looking compared to the acid-washed Cool Boarders series, with plenty of evening hues and tonal variations in the snow. Resolution and speed are all very good, and while the frame rate is slightly choppy, the game looks very nice and realistic, especially in motion. Tracks undulate fluidly, with plenty of sharp ramps to take flight off of. Shortcuts change things up quite a bit, as some off-track runs have straight-aways, half-pipes, and tree runs. Trees are sprites, but the hit detection of the trees is the best of any snowboarder -- there seems to be collision variation between striking branches and taking a bono into a trunk.  But, again, nothing remarkable. The courses are colorful, but tracks are shaded based upon fixed time settings, so Japan is set at eternal midnight rather than slowly changing to daytime. The two-player mode is slower, is severely letterboxed (it preserves to TV ratio), and has some pop-up, but it is playable if you can still find it exciting. The camera (which rarely poses a problem in sports games) flips out sometimes when you're not moving quickly. There are lens flares, benches to grinds on, hovering gondolas, and other pointless additions, but omitting powder and ice is like taking dirt out of a rally game or the butt-bounce out of Mario. Again, the graphics are fine for the purpose, and shortcuts do add a lot to the realism of the game, but all of this is still only slightly better than par for the snowboarding course. Sound Quote from MTV Snowboarding manual: ~Oh yeah, did we mention the action is set to music from today's hottest bands?~ Only twice on the jewel box, twice in the manual, in about every print ad of the game, and just about everywhere else in that such a fact could be mentioned. Oh, and what a surprise it was, especially coming from MTV.  Seriously, though, the music and sound effects in this game aren't too spectacular, but they get the job done. Thankfully, tracks aren't as badly botched as X-Games Pro Boarder, as the music is clear and loud. Represented here are standards such as Fear Factory, Face to Face, Voodoo Glow Skulls, Ministry (a remix of Jesus Built My Hot Rod), and several other bands that MTV would never actually play on their network today. Also, Gary Numan's remix of Cars, the one that Infogrames bragged about licensing for Test Drive, is buried in here amongst the Blink 182 tracks. As always with this game, this is an adequate collection, but it's certainly nothing extraordinary, and it doesn't represent the Backstreet Boys network very well.  Outside of the music, things get a little hairy. Swooshes and carving sounds are passably laid down, but there are none of the little details (like the bell ringing and the dog barking) that made Capcom's Trick'n Snowboarder so engrossing. Tricks don't have accent sounds to let you know when you've pulled out something wicked. And the voices are so bad (it sound like the characters are phoning it in) that THQ wisely turned the voices off as default. While the game is a vast improvement over the  terrible yet somewhat realistic X-Games [ESPN] Pro Boarder game (made by the same developers at Radical Entertainment), and although the control is quite good at capturing the sport, it just doesn't have anything to raise the excitement level of the genre. It's fast and playable, but not anymore fun than any of the half-million other snowboarding games out there. I'm particularly disappointed by this game because the control is so good that I was hoping the rest of the game would follow the feel. It didn't. The game is boring, just like all the rest of these board games. However, it is the best controlling snowboarder of the bunch (although that's not saying much). The speed and feel is all there, so if you're still dying for a boarder game, give this one a try.", "date": "Dec 14, 1999"}