{"name": "Test Drive Off-Road 2", "name_review": "Test Drive Off-Road 2", "ref": "https://www.ign.com/articles/1998/10/28/test-drive-off-road-2", "text": "In Accolade's Test Drive series, you're given the opportunity to drive vehicles you normally wouldn't have available to you. Test Drive Off Road 2 is no different. Ever want to race a Hummer? Well, now you can.  Test Drive Off Road 2 features more than twenty off roading vehicles, including the Hummer, Dodge Ram, Jeep Wrangler, Land Rover, Ford Explorer, Chenowth DR-2, Ford F-150, and the Jeep Cherokee. Each naturally has its own strengths and weaknesses, but one thing's for sure: these machines were built to take abuse. You'll be slamming them into the pavement, dirt, mud and water in the game's six courses, spanning across locations such as Hawaii, Morocco, the Mojave, and even snow-covered mountains of Switzerland.   Each race is essentially a Point-A-to-B competition against you and five computer vehicles. You're faced with a time limit that resets after crossing certain checkpoints. The goal, obviously, is to traverse the unfriendly terrain and get first place. In World Tour mode, you're given a certain amount of money at the beginning of the game to purchase a low-end vehicle. Pick one, and enter that vehicle's class of races. Win the race, you'll earn credits to purchase a better vehicle. After all the classes have been completed, you'll enter the Open class where you'll race against any and all vehicles in the game. Win this class, you'll be the champion.   What's more, if you finish World Tour mode you'll unlock the two extra tracks (as well as mirror mode for all six tracks) as well as a few of the hidden vehicles. The major downside to Test Drive: Off Road 2 is, unfortunately, the lack of two-player action. This is for one person only, folks. Test Drive Off Road is a very underwhelming racer. There's nothing terribly bad about the game (except for the lack of a two-player mode), but it's not that special, either. The game feels a lot like last year's Test Drive 4, with the same floaty control and weird in-air physics. If you pick the right vehicle the game plays fast and intense, but most of the time the trucks just lumber along.The World Tour is a good way to play the game, unfortunately it's a bit redundant because if you run out of time in the third race of a four race circuit, the game ends and you have to start back at the beginning. Very annoying...thankfully you can turn off the Checkpoints so you're not racing against the clock.Timing is everything, and Accolade just beat out Rally Cross 2  its obvious competition. Unfortunately from what we've seen, despite not having any real vehicles Rally Cross 2 is the much better choice for off-road racing.", "date": "Oct 28, 1998"}