{"name": "Hot Wheels: Stunt Track Challenge", "name_review": "Hot Wheels: Stunt Track Challenge", "ref": "https://www.ign.com/articles/2004/11/19/hot-wheels-stunt-track-challenge-3", "text": "For kids, the ultimate HotWheels experience stands on four pillars: cool cars, speed, stunts and tracks. Building the ultimate track and racing your favorite cars through bends and loops dished out plenty of fun.    Things get more complicated when racing digital tracks in the latest games. Still, having an equally cool HotWheels experience using small plastic tracks or in a videogame still depends on those same four pillars.    The latest HotWheels game, Hot Wheels: Stunt Track Challenge, gets it mostly right. It features a decent amount of tracks and plenty of cars, going so far as to include a story mode where the player competes in a televised game show, such as in the old PC racer MegaRace.    You can customize each of the included 30 cars with new tires and decals, and race the though the Game Show mode or with friends in split-screen multiplayer and online (PS2 only.) Although the game includes an arcade mode (where you can play unlocked tracks,) the main appeal lies in Game Show mode.    Here, players will compete in six episodes featuring six different Danger Parks. Each park contains a number of challenges, including two races and four stunt challenges. You need to beat them in order to be declared winner of the episode, which is never hard to do. Overpowering the AI racers takes little effort, to the point of being able to finish most of the game using only one car; the one you start with.     The average gamer should be able to rip through Game Show mode in a matter of hours. Make no mistake, Hot Wheels is a very arcadey racer and has no problems throwing the laws of physics out the window. Each car is impervious to damage and each feels very lightweight, making each handle as though it were driving over oil-coated tracks.   While featuring pretty decent visuals, the different track could benefit from a little more spice in the design department. You'll need to jam through each one, going through loops and making enormous jumps across chasms. Unfortunately, none of them is particularly cool or noteworthy. They all feature very similar challenges and each comes with the usual track staples, such as Zip Stripes to increase your speed and Rumble Strips that slow you down.    Plus, you'll need to watch about for obstacles like bombs, crates and barriers before crashing into them, losing valuable seconds in the process. You can power slide through corners, an improvement over the last game, and you can also spin your car to perform stunts by pressing the thumbstick up, down, left and right, which earns you boost. Sadly, performing stunts offers little fun. It's a little sad, seeing as stunts have always been one of the biggest aspects of the Hot Wheels franchise.       While performing stunts could use a little work, driving through stunt challenges can be fun. These stunt-heavy courses have you driving through all manners of funky terrain, jumping through loops trying to earn a set number of points. While many of the early courses require little effort to beat, some of the later examples can be tough. You'll find yourself falling off cliffs and off the sides of a narrow road several times before you're comfortable enough with the track to finish it without plummeting to your death.   Apart from the stunt challenges and race tracks, Game Show mode offers a series of Game Breaks, where you need to race around maps using a top-down perspective collecting tokens. These tokens unlock decals for use in the Garage, where you can customize your cars with a new paintjob, tires and decals. Customization in Hot Wheels is adequate, but is nowhere near the depth seen in other racing games. Then again, it really doesn't need to be.    And for the most part, all of these elements play decently. There's an adequate sense of speed when throttling through the environments. Nothing that will blow your head open, mind you, but there have been racing games slower than this by far. Racing through loops and tearing through the sky on those big jumps is pretty fun, and it's party due to Hot Wheels good sense of movement. When using boost, which you acquire by running over flame icons on the track, the screen rattles and blurs slightly, helping you buy into the illusion of driving 225 miles per hour.    The tracks themselves split between six different geographical themes, including: Jurassic Jam, Buccaneer Bay, Spider Alley, Tiki Islands, Zero Gravity Zone and Lava Land. Each offers a unique look, and each looks pretty good, but they eventually feel a little gimmicky. Instead of offering themed obstacles, such as killer pirates in Buccaneer Bay and lethal savages in Tiki Islands, the challenges remain similar throughout. You can fall off the track, miss jumps and slam into rocks and other obstructions, but that's about it.       Tracks also remain similar in design. Racing through Jurassic Jam feels like racing through Spider Alley and vice versa. None of the tracks distinguishes itself through inventive design. Graphically, each looks radically different. In fact, it feels very much like driving through a series of open-air haunted houses, in that there are animatronic beasts and insects infesting each of the tracks.   HotWheels: Stunt Track Challenge marks a definite improvement over the last entry in the series. It boasts a good sense of speed and decent visuals, while offering an entertaining, although simple and uninspired, number of tracks and stunt challenges. The actual stunts in the game could use work. Spinning up and down, and left to right, is simply not enough for a game based on the HotWheels franchise. Multiplayer offers a bit of fun, especially for younger gamers. And for only 20 bucks, HotWheels isnt too shabby.", "date": "Nov 19, 2004"}