{"name": "Pirates!", "name_review": "Sid Meier's Pirates!", "ref": "https://www.ign.com/articles/2004/11/19/sid-meiers-pirates-4", "text": "Back in the 1990s Microprose got me fired from a job and almost caused me to flunk out of college. The addictive nature of Civilization, X-COM and Pirates! meant that playing games became more important than going to work or attending class. But now, since playing games is work, I can safely confess that I've been totally captivated by Firaxis's remake of the old C64 classic. The new game adds a few new gameplay elements to the mix and updates the graphics but it still tightly adheres to the strengths that made the first game an all-consuming addiction for those of us who played it.  I've been playing the final version of the game for a few days now and I can barely tear myself away long enough to write the review. Over the past few days I've gone from being the insignificant captain of a small ship to become the most powerful and influential pirate in the Caribbean. Along the way I've sacked towns, hunted down rival pirates, explored for treasure, rescued long lost family members, amassed a vast personal fortune, climbed the ranks of high society, wooed the attractive daughters of wealthy governors, found lost cities and revenged myself on the evil bastard who originally split up my family.  To put it simply, I've been pretty busy.  The opening cutscene starts during your childhood. An evil Marquis who your father owes money to bursts in during a family dinner. He takes the members of your family into bondage but you manage to escape, vowing to rescue your family and take revenge on the man who stole your life from you. Ten years later you find passage on a ship headed to the New World. During the crossing the crew mutinies and names you captain. From here you're set loose to find your own destiny in the Caribbean.   As you can probably already tell, there are a wide variety of experiences to be found in this game. Though the search for your family and the vengeance you owe the Marquis provide a nice direction for the game, you can pretty much play things however you want at this point. You'll find quick profits early by joining in on the wars between the various European powers.  Depending on your starting era, you'll find a variety of political conditions in the Caribbean. There are four European powers here -- the English, Dutch, French and Spanish -- and a few minor powers like Native tribes, missionary settlements and pirate-run towns. Natives and pirates can be encouraged to attack nearby enemies while the Jesuit missionaries can intercede on your behalf with an irate governor. Each group and each town associated with that group has an agenda that it acts on independently of your actions.  The ability to influence the political landscape of the Caribbean is one of the game's great joys. Capturing a chain of islands owned by England for your own nation or intercepting a ship carrying a peace treaty that could seriously impact the profits you're getting from privateering makes you feel like you're making a real and lasting difference in the game world. What's especially cool is that the AI-run towns are capable of launching attacks against rivals all on their own.  Unlike the original game you can actually see the other ships on the sea map. Each ship is identified by nationality, cargo and origin and destination. So if you see an enemy troop ship moving in towards a town owned by your nation, you can intercept it before the invasion takes place. Conversely, you can actually escort these ships to their destination if the invasion is in your best interests. Ships loaded with either goods or settlers also have a significant impact on the health and wealth of the various towns on the map.  The ship battles are my favorite part of the game. There are at least two dozen types of ships here, each rated in terms of size, speed and maneuverability. Each is also rated in terms of the crew, cannon and cargo it can carry. Though you can have a vast fleet of multiple ships, you'll only be able to lead one single ship during the ship battles. Whether you choose to captain your nimble pinnace or your hulking galleon depends on the size and strength of your opponent. You can even upgrade your ship at various ports throughout the Caribbean to increase its speed, crew capacity, cannon accuracy or a number of other factors.      Assuming your ship is capable of using them, you can select from a variety of shot types to target specific areas of your enemy's ship. The default shot attacks the hulls and cannon of your enemy. Chain shot shreds his sails and reduces his speed; grape shot tears through his crew, leading the way to an easier boarding. The enemies seem able to switch between the shot types as needed. The enemy AI is also pretty smart at running from fights it can't win.  The arrangement of ships and land features on the sea map corresponds to their arrangement on the battle maps. This is a great feature that was missing from the original game. Now you can come at the enemy with the wind at your back or cut him off if he has to make a run along the coast. The new game also sometimes throws multiple opponents at you during the same battle. Having to fight off more than one enemy at a time increases the excitement and tactical sophistication of the fights considerably.  When you board an enemy ship, you'll have to duel with its captain. In dueling you'll have a high, mid and low attack and corresponding block moves. You'll need to time your attacks and blocks just right if you want to survive. Luckily, you can anticipate your enemy's moves if you watch them closely enough. If he rears back high, you'll know to block high. A successful attack pushes your opponent back. Once he has nowhere to retreat to, a final hit will win the fight for you. You'll have plenty of other chances to duel as you encounter guards bothering barmaids, criminals hiding in taverns, guards on top of city walls and a host of other villains. The dueling AI is fairly good here and the enemy mixes up a wide variety of attacks and blocks.   The land battles are much more sophisticated than they were in the original game. When you decide to attack a town, your crew will take the field against the town's defenders. On your side the crew will be divided into melee combatants and ranged fighters. The enemy has the same types of troops but can also field cavalry. You'll always have access to an elite unit of officers that can be used to turn the tide of battle.  Each fight takes place on a map divided up into grids. Turn-by-turn you'll maneuver your troops against those of the enemy, firing on those that come into range of your muskets and charging those who come in reach of your sabers. Once all of one side has been routed or eliminated, the victor is declared. Terrain and morale factor heavily into unit effectiveness; if your troops have the high ground for instance, they'll have a significant advantage when attacking nearby enemies. If your troops fire at an enemy located in dense woods, the effectiveness of their fire will be reduced. Once you beat a town's garrison you may be able to assign a governor of a new nationality.    It's more likely that you'll just sail into town peacefully. The towns are the focus of much of your gameplay. They provide information about the location of hidden treasures and notable villains. They also allow you to sell your ill-gotten gains, sell the ships you've taken and recruit new crewmembers. Towns are also where you interact with the governors and receive rewards for attacking their nation's enemies.  Though the original game required you to woo the governors' daughters, the new game takes this feature to a higher level. Now you'll have to obtain invitations to dances with the ladies. Invitations can be hard to come by. They're dependent on your rank, certain special items you've purchased (ladies can't resist a man in a jaunty hat) and gifts you've purchased for the girls themselves. The dancing game takes place in a variety of ornate ballrooms and you'll have to watch your dancing partner for cues. Each cue corresponds to a key on the number pad. Hit the key in time with the music and you'll perform a flourish and increase the lady's affection for you. Mistime a move or hit the wrong key and you'll stumble and lose favor in her eyes.  You don't necessarily have to dive in to every aspect of the game if you don't want to but you'll find that each of the smaller games here provide compelling rewards. Even the dancing rewards you with bonus items that can dramatically improve your skill at fencing, your ability to weather storms and a variety of other tasks.      There are plenty of other activities that will occupy your time. Treasure maps will lead you to buried riches or cabins where your family members are being kept. Nine other famous pirates are also at work in the Caribbean. The game directs you to them from time to time and gives you the opportunity to put an end to the pirating careers. Getting married, finding lost cities, escorting governors from place to place and hunting down wanted criminals also provide interesting short and long term goals for you to focus on.  There's a finite limit to your pirating career. In addition to the toll that aging takes on your body, you'll find that your crews don't like serving more than a year or so. Keep them on for much longer than that and they're likely to mutiny. The only answer to dealing with crew unhappiness (besides sacrificing them all in a futile battle, of course) is to divide up the plunder and let them go their separate ways. You'll get your share of the treasure and, after a suitable period for refitting, start all over again with a new ship.  Alas, there are some small problems with the game. I'd like to see options to attack towns included whenever you sail into port. As it is, you can only automatically attack towns when approaching on foot. Short of that, you'll have to fire a few shots at the town first or attack ships of the nation controlling the town before you get the option attack the town from the sea. There are some occasional frustrations with accidentally sailing into a town when you merely wished to put ashore near the town. This is only really a problem if you have to use a city as a starting point for a treasure search.   Since you're engaging in the same four or five activities again and again some gamers may find that the game also has a tendency to become repetitive. This tendency is lessened by the dynamic nature of the world and the various contexts that you can create for yourself while playing. Even so, your 20th duel with the bothersome captain of the guard won't hold any surprises for you. You'll also find that the more mundane encounters become more tiresome once you've obtained the special items that grant bonuses to ship battles, duels and dances. Shoot, shoot, spin, spin, dance, dance -- let's just get on with this, shall we?  And while I realize that the game isn't meant to be 100% historically accurate, I wish the Letter of Marque were a little less generic. Historically the Letters of Marque legitimized piracy against the ships of rival nations but sadly there's no check in the game to keep players from taking Letter of Marque from all nations at once. As a result piracy against the ships of every nations can become nice and legal for a single player. This makes the distinction between pirates and privateers almost non-existent in the game. It would be really great if Letters of Marque required players to turn over a portion of their prizes to the issuing nation. This would definitely make players think twice about enlisting in the service of a given nation and help to counterbalance the massive discounts on repairs and trade goods that privateers can obtain. Captain Kidd's decision to break the terms of his own Letter of Marque reveals the drama that such a distinction might help create.  Though it won't put too much stress on your video card, the new version of Pirates! looks damn good. The world of the Caribbean is really brought to life beautifully here. The colors are all really vibrant and the sandy beaches, dense forests and stony hills merge together very naturally. Cities and settlements dot the coasts and are easily identifiable by the colored flag that flies above them. Puffy white clouds drift through the sky casting shadows on the sea and land. Darker storm clouds pour rain down onto the sea and are punctuated by occasional flashes of lightning.  The animations add a lot of life to the game. The flags flapping in the breeze and the sails billowing as the wind shifts add lots of personality to the otherwise static ships and also serve as a nice visual indicator of the quality and direction of the wind. You'll see the ships listing to either side as the bow dives in and out of the water as you steer your course through the Caribbean.   The water is just great. The small waves keep the sea from looking too flat and the slight variations in ocean color keep things from becoming monotonous. There doesn't really seem to be much variation in the size or quality of the waves (to reflect rough seas, for instance) but the distorted reflection of the ship in the water and the foamy wake trailing behind the ship serve to heighten the realism. Foam or sandy-colored water makes a nice transition between the open sea and the coastal areas and dangerous reefs. Small waves also break on the shores, making the whole experience that much more dynamic.      Things are even more exciting and lively in sea battles. The ports along the hull open as the cannons are reloaded which serves as a nice visual cue that your broadsides are ready for firing. The sailors bump around on the deck as you and your enemy maneuver around each other. Each type of shot is rendered here, so you'll know at a glance whether your enemy is using chain shot or grape shot against you. When a hit is scored you'll see explosions on the hull and sailors and barrels will fall overboard and float in the water. Holes in the hull and tatters in the sails indicate just how much the ships have sustained. When things get particularly bad, the ships even begin trailing smoke. Just before a ship succumbs to fatal damage, you'll see the masts splinter and fall into the water closely followed by a last dip beneath the waves.  When you sail into a town you'll appreciate the new interiors as well. The docks and merchant stalls are pleasant to look at but the governor's office and the tavern really steal the show here. Sunlight pours in between rich red drapes behind the governor's desk. The appointments are spare but rich. Pirate captains will treat with you from behind ornate desks surrounded by chests overflowing with pearls and gold coins. There are a wide variety of governors, assistants, and pirate captains to treat with but given the size of the game you'll see lots of duplication. The tavern is probably the best looking location in town. Sailors sit close to the roaring fire against one wall while a strange traveler sits surrounded by barrels and tankards in a corner towards the back.  The animations in town are great too. I particularly like seeing the stranger in the tavern reach up and snatch the coin you throw his way. The barmaid strokes your arm as she compliments your latest promotion, the barkeeper waves you over to whisper secrets in your ear and the sailors you've recruited go swaggering off screen with their cutlasses resting on their shoulders. There are so many of these little touches that you can't help but smile at the amount of personality in the game.   The dueling animations are exaggerated but still look fairly natural. The swipes and parries and thrusts are all broad enough to be exciting but not so overstated that they seem unbelievable. Small pre-rendered scripted sequences mark off transition points in the battle or tie off the duels at the end. Once you've reached a certain level of advantage in the tavern, for instance, you'll kick your opponent through the railing down to the floor below. The end of the garden duel has a large vase falling on your enemy's head. Each dueling location is wonderfully rendered, particularly the ships. You can see all manner of details, from the seams in the sailcloth to the planks in the deck to the intricate scrollwork at the rear of the poop deck.  Sounds are also first-rate, particularly during ship battles. The boom of cannon and the whistle as the shot hurtles through the air gives you a real sense of power. Flags and sails cracking and flapping in the wind add to the experience, as does the crackling fires on deck. When you converse with characters in towns, they'll respond in a Sims-like gibberish.  The music is also very well done and suits the character of the game perfectly. The wide variety of songs, from the background music in the towns to the stately dances heard in the ballroom, make this a game that's worthy of a separate soundtrack.The original Pirates! came in at number 3 in our list of the best PC games of all time and while this new version isn't as revolutionary as the original, the fact that there have been almost no imitators in the fifteen years since the first Pirates! make this remake a sure bet for fans of great games.There are a lot of great games for the PC this year, particularly for fans of shooters and strategy games. Don't let those distract you from also trying Pirates!. It may not be as technically innovative as titles like Half-Life 2 or Rome: Total War but the combination of ideas and experiences it contains easily make it one of the most original games of the year. It may not depart much from the original game but, truthfully, it simply doesn't need to. Pirates! is unlike any other game in the current PC catalog. Unless you hate fun, you'll love it.", "date": "Nov 19, 2004"}