{"name": "Asphalt: Urban GT", "name_review": "Asphalt: Urban GT", "ref": "https://www.ign.com/articles/2004/11/20/asphalt-urban-gt-4", "text": "Time. It's one of the major factors working against the Nintendo DS, its launch titles and the game creators that worked on those titles. Between the time the system was announced in January, revealed in May, and launched in November, all in the same year, it's clearly not enough time to create a polished game experience. Most, if not all of the games released for the system have a varying sense of a rushed development cycle, but none show this more than Gameloft's Asphalt: Urban GT This title, a conversion of the recently-released racing game the team created for the N-Gage and cellphones, may be one of the few games to push the 3D capabilities of the Nintendo DS, but its entire production feels like it's built on a teetering foundation. It's structured enough to call itself a competent racing game, but it's like giving thumbs-up to a vehicle that's barely passed inspection. Features Licensed vehicles from real manufacturers, including Jaguar, Hummer, VW, and Lamborghini Cartridge save (one slot) Wireless connectivity for up to five racers Asphalt: Urban GT is a straightforward racing game for the Nintendo DS that gives players the ability to drive a bunch of real-world vehicles through several tracks of varying locations. It borrows a bit from Ridge Racer and a little from Burnout, as it focuses on power-sliding as well as taking risks during the race. Like Burnout, players are rewarded with boosts if they put a little aggression into their racing abilities, and without it players are never going to get through the game's career mode in order to unlock all the vehicles and locations that Asphalt: Urban GT has to offer.  99 percent of the action takes place on the upper screen, with the lower screen relegated mostly for a full-screen map and occasional words of wisdom like ~Drift!~ during a drift, or ~Risky!~ when zooming past traffic too close for comfort. I will say that the team's use of the lower screen, while barely the minimum expected, shows that an on-screen map in racing games can be more than the basic course layout. Asphalt: Urban GT shows the layout as it really is, displaying hills and tunnels in a detailed full-screen graphic, something rarely done in a HUD map in other racing games.  Asphalt: Urban GT is one of the few games on the Nintendo DS to push the system's hardware capabilities with a 3D engine running at a smooth-as-butter 60 frames per second. Racing games have always benefited from bumping up the framerate to the absolute maximum of a 60 hertz refresh; Burnout, Gran Turismo 3, Crazy Taxi on the consoles are racers known for pushing the framerate limit in order to squeeze out that impressive sense of speed. Asphalt: Urban GT definitely gives that feeling even on the tiny handheld screen. Of course, it all depends on the vehicle chosen during the race; a Hummer isn't going to tear up the pavement the same way a Lamborghini roadster can, but the game's engine can definitely portray a zippy velocity when the vehicle can handle it.     Granted, the development team had to scale back graphical quality to keep up the 60 frames per second rate. Many of the trackside objects are flat 2D textures that seem to make some areas feel like you're driving through a movie lot. Traffic vehicles and on-road objects are very low poly models, and there's a bit of ~pop-up~ as you drive through straightaways. Still, the ends justify the means in the case of the visuals, because it's the framerate and sense of speed that will give the game notoriety during the launch phase on the Nintendo DS. The gameplay sure won't.     Sacrifices were clearly made in order to get this game out the door to secure one of the coveted ~launch line-up~ slots. The most obvious clue is in its touch screen function. Asphalt: Urban GT is the one game in the DS library that barely even tries to utilize the Nintendo's touch-sensitive panel. I certainly won't fault the game for avoiding the experimental ~analog~ control that Ridge Racer DS utilizes, but I'm not as forgiving when the hard-to-navigate menus are made even more clunky thanks to poor touch-button creation and placement. Some of these buttons are ridiculously tiny and shoved so far deep into the corner of the lower screen that they become nearly useless to anything but the stylus tapping at it. And that's just poor design to require players to work with the stylus for simple menu navigation when it's not used anywhere else. Of course, the argument here is that the game doesn't really need to use the touch screen for its menus, and that's true. All of the game's navigation can use the traditional D-pad and button combination, which would have been fine if they were laid out more intuitively.   Even though Gameloft utilized licensed vehicles for Asphalt: Urban GT, the team went for more of an arcade-style racing design instead of rooting the game into realism. Personally, that's the kind of racing game I favor, but even I can't forgive some of the handling issues that occur in this game. Obviously cars are meant to handle significantly different from each other, so heavier cars will have a wider turning radius especially at top speed. That's fine, since the racing encourages racers to powerslide around turns by quickly braking and accelerating through them. But there's so much ~canned~ handling in the game that makes the presentation feel artificial. Slam into a vehicle too quickly and your car will go into a perfect 360 spin. But even this isn't perfect, since occasionally the car will come to a dead stop after plowing into traffic or opposition. And the AI routines applied to the computer opponents seem to have a lot of problems handling the on-rail routines of the traffic; I've seen plenty of instances where vehicles will get completely confused by a non-moving big rig in the middle of the road, and bunch up behind it without knowing how to navigate past them.  But the most obvious bug, flaw, or feature goof in Asphalt: Urban GT is its replay system. After players finish a race, they can opt to watch the last lap from a dynamic, third-person perspective that puts the 3D engine to use for very ~TV coverage~ feel. But for some reason, this replay system only shows your vehicle and nothing else. Opposing drivers, traffic, and obstacles are removed from view, so it looks pretty retarded seeing your vehicle smack into invisible objects or launch into the air via a mysterious jump that's nowhere to be found.    Though the dual-screen, touch-screen element of the Nintendo DS wasn't much a focus during the development of Asphalt: Urban GT, the wireless multiplayer function definitely was. You'll need to track down a copy of the game for each system that wants to enter the network, which is a slight disappointment considering the DS' single cartridge capability, and that its competition, Ridge Racer DS, supports it. The multiplayer is certainly capable, offering as many as four other racers into the link.  There are limitations to this feature, though. First, the link removes traffic and computer AI drones from any multiplayer session, which isn't necessarily a big deal. But what is a big deal: Single Race mode doesn't offer any restrictions in what vehicles players can race against each other, nor will it tell the other players which types of vehicles are entering the race. In other words, everyone has to verbally tell each other which car they're choosing, otherwise you'll get completely one-sided matches that pair up Lamborghinis against VW Beetles and Hummers. This is rectified in the game's Championship mode since players can only choose within a specific class, and this begs the question: why is Single Race in there if Championship Mode offers a much more balanced mode? Cop Chase is a functional mode where one player (cop) chases another player's vehicle. But it's only for two players, and it's incredibly half-baked since the game never offers the two players to choose which side they'd like to play, nor does it offer any sort of ~scoring~ function than a ~win/lose~ situation. Asphalt: Urban GT is clearly a victim of a rushed development cycle, no question about it. Gameloft managed to squeeze in a great graphic engine in the short amount of time it had with the hardware, but it clearly just couldn't fit a well-balanced racing game within that engine. It offers the bare minimum of enjoyment for a racer, but other than its visuals that must be seen in order to appreciate, this game certainly isn't going to sell people on the benefits of the Nintendo DS system. Perhaps if the development team had more time to finish what it started, the game would have turned out much better than it did. As it stands, Asphalt: Urban GT is a bunch of loose ends that need to be tied up.", "date": "Nov 20, 2004"}