{"name": "Ski Resort Extreme", "name_review": "Ski Resort Extreme", "ref": "https://www.ign.com/articles/2004/11/20/ski-resort-extreme", "text": "It's no secret that business management simulation games have been incredibly popular over the years.  It's easy to see why--they appeal to a vast audience of gamers, and have virtually unlimited replay value.  Parents also gravitate to these games because they'd rather have little Tommy think while he's playing as opposed to mindlessly blowing up zombies in Doom 3.  As a result, a stroll down the software aisle at your local electronics store will likely reveal dozens of titles from this genreeach with its own unique enterprise for you to control.  Ski Resort Extreme is of this same ilk, but does it do anything to separate itself from the pack, or is it just another ho-hum Sim City clone that's set a mile or two above sea level?   The main goal of Ski Resort Extreme is simple: to build and manage a successful ski resort.  There are a couple of different gameplay modes to choose from, but the main premise is the same regardless of which one you pick.  The meat of the game comes in the form of ~instant action.~  In this mode, you begin by allocating yourself startup money, which essentially determines the difficulty level.  You then decide whether you want to build your mountain paradise from scratch, or use one of the ready-made templates to get you started.  There's also a basic tutorial to get you acclimated to the interface, but anyone who's played this style of game should have no trouble jumping right in.   If you prefer a little closure to your games instead of the open-ended instant action setting, you'll likely enjoy the ~challenge~ mode.  Here, you're given a task or set of tasks to complete in a certain amount of time.  There are three difficulty levels to choose from, and each has several scenarios you can tackle.  In one campaign, you might have to draw in 100 guests within 15 days.  In another, it's up to you to resurrect a fledging resort that's teetering on the edge of bankruptcy.  For those who want to jump right into the decision-making aspect of the game and not worry about laying everything out, the challenge mode is an entertaining diversion.   Anyone who's ever played Sim City or any of its myriad rip-offs will feel right at home with the interface in Ski Resort Extreme.  Panning the camera around is as simple as moving your mouse or clicking the arrow keys.  A small mini-map in the lower right-hand corner gives you thumbnail access to your entire resort, and zoom controls can provide an up-close view of your patrons or buildings.  Zooming in on the action really showcases the colorful graphics, but as your resort grows, you'll be wishing that the camera could move up higher than it does.  The menu system is cleanly laid-out, but the screen quickly becomes cluttered with icons and palettes that can make finding what you want a chore.  You'll spend most of your time clicking around in the build menu, which features small groupings of icons for the different structures you can purchase.  There's also an information bar that's constantly warning you of problems or complaints about your operation, and various stats and option menus to help you make better financial decisions.  Screen real estate is constantly at a premium, but fortunately, you can close menus you don't use as frequently.  Still, it would've been helpful if you could map some of the more common functions to the keyboard.     In terms of aesthetics, I was pleasantly surprised with the graphics in Ski Resort Extreme.  On close inspection, the buildings and people are surprisingly detailed and well-animated.  Wisps of smoke billow out of chimneys in the cottages, and guests merrily drift down the slopes before heading back to the lifts or hitting the nearest eatery.   Unfortunately, you probably won't see your resort up-close very often since it's easier to manage from higher up.  Sound-wise, the game is mediocre at best.  There are only a handful of audio tracks that play randomly in the background, but you'll probably want to turn them off anyway.  Sound effects are limited to the clunks heard when placing a building on the map, or cheesy voice-overs from whiny patrons.  Nothing special, but my expectations for simulations like this are never particularly high.  It's the gameplay that's important after all.    You'll quickly discover that there's really quite a lot you can do and build in Ski Resort Extreme.  The sheer amount of structures you have at your disposal is staggering.  Aside from your basic runs and lifts, you can also build training schools, restaurants, retail stores, relaxation stations, and lodges just to name a few.  Keeping these facilities running smoothly and efficiently is of utmost importance, so you'll need to put money aside for maintenance facilities, power plants, and janitorial services as well.  But wait, you also need money to establish a customer base.  This is accomplished by advertisingwhether by billboard, newspaper ads, radio/tv commercials, etc.... You could have the most beautiful and luxurious resort around, but it means nothing if no one knows it exists.  This is where the game requires a shrewd mind, since it's often difficult to decide whether to spend your hard-earned cash on a costly TV spot, the new hot tub your guests have been clamoring for, or additional restrooms.  The initial setup of your resort is by far the most enjoyable aspect of the game, and watching the guests pour in thanks to your brilliant business sense is very rewarding indeed-at least initially.   Sadly, after you've built up your resort and opened it to the public, the novelty begins to wear off faster than shredding down a double-diamond slope.  Within minutes of opening up, the complaints and problems start pouring in.  These come in the form of pop-up messages on your information bar.  This is pretty standard fare for this type of game, but most of the issues are a bit excessive.  For example, customers would complain constantly about the cleanliness of the park, though I had literally dozens of janitorial facilities and trash cans strewn all over.  Furthermore, regardless of how much maintenance you have, your buildings are always breaking down.  Luckily, the maintenance guys are pretty quick to address the problems without much intervention on your part, but fully-repaired building are often left closed for no reason until you manually reopen them.     While I'm willing to look past irritating customer requests and a few minor quirks here and there, I can't look past one glaring problem with Ski Resort Extreme: nothing ever happens to stand in the way of your success.  Where are the natural disasters, droughts, or economic downturns?  How about a huge avalanche that wipes out half of my buildings?  About the worst thing that ever happens is your runs become muddy, and this seems to have little effect on your revenue stream.  As a result, the chances of failure in this game are pretty slim.  Money will probably be tight for a while when you first start out (assuming you allocated yourself a small amount), but once you get the hang of things, you'll be rolling in the dough in no time.Ski Resort Extreme is by no means a bad game, but with all the competition it currently faces, it really does nothing to rise above the crowd.  I enjoyed the challenge mode, and the initial setup of your resort is entertaining, but things deteriorate from there.  The lack of natural disasters or other gameplay obstacles combined with the low difficulty form a recipe for monotony.  If you enjoy this kind of game and have a thing for skiing, give this game a go.  Otherwise, stick with The Sims or the Tycoon series.", "date": "Nov 20, 2004"}