{"name": "Front Office Football", "name_review": "Front Office Football", "ref": "https://www.ign.com/articles/1998/10/29/front-office-football", "text": "Europeans can play as many sports management simulations as they like, but North American gamers may not even know what the term 'sports management simulation' means. So what is it?  A sports management sim is a strategy game, not an action game. It has no players on the field, but plenty of text and numbers lined up in neat columns. In short, it has more in common with a Capitalism or a Railroad Tycoon than it does with a Triple Play 99 or an NFL Blitz.  Think of a business simulation strapped onto a sports game stats engine. The business sim part gives you control of a pro sports team, letting you set ticket prices, build new stadiums, negotiate contracts with star players and sign up free agents. The stats engine generates realistic game-by-game stats for every player and team in the league, determining how well your team has fared.  But this genre has been completely ignored by US publishers, and I don't understand why. Not only do these games have a potentially broad appeal, covering as they do the American male's great obsession, sports, they also rank up there as the most enjoyable pure strategy games available today.  And though sports management simulations need strenuous statistical research and a good artificial intelligence, they do not require expensive full motion video sequences, cutting edge polygon engines, CGI animation, or all the other frills that make today's game development so expensive and so protracted.  But at long last, games of this type are starting to show up here in the States, largely through the efforts of a few independent developers. Baseball fans have been treated to Baseball Mogul, which has been picked up by GT Interactive, and now football fans can sink their fiscal teeth into Solecismic Software's Front Office Football. So enough editorializing, and on to the review.  Keep in mind that Front Office Football is strictly a no frills package. Though it comes on a CD-ROM, it could just as easily have fit onto a handful of floppies. The developer, Solecismic Software, is one man, Jim Gindin, programming in his kitchen. There are no graphics to speak of, and zero sound effects. There aren't any cutscenes or animated polygonal football players leaping out of your screen in a cascade of shattering glass. No CD full of filmed coaching tips or--you get the idea.  What you do get, however, is gameplay. You are the general manager of a pro football team. There's no NFL license, but you can change the team names, for example making the Pittsburgh Welders the Pittsburgh Steelers. The current pro players are included however, and new, fictional players show up every year in the college draft.  Your first order of business every season is to submit any stadium proposals to the local voters. This can mean adding some new luxury boxes to building a whole new domed stadium from scratch. You have the option of helping to finance the stadium yourself, or leaving it to the locals to pony up the cash.  Next you can hire new coaches and scouts (each has a number of important ratings), set ticket prices, fix prices for personal seat licenses, and the like. Then you look at your roster.  The free agent market is crucial to building up your team. Every year, you'll have to resign a whole slew of players to new contracts, trying to fit them under your salary cap. Are those aging veterans who want $3 million signing bonuses worth it, or are there are better, cheaper free agents on the open market? Will you be able to fill those holes in the secondary with some young draft choices, or will you have to bite the bullet and hire an All-Pro out of the free agent pool at the expense of resigning some depth on the offensive line?  It's this constant balancing act that is the heart of what makes Front Office Football entertaining.  Once your roster is set (though you'll need to make adjustments during the season with injuries, trades and players who get hot or cold), you're ready to move on to the pre-season and then the regular season.  Coaching is handled by creating a tendency list--assigning percentages for the pass versus the run, long pass versus medium or short pass, running to the left or right, and so on. Tweaking these choices lets you run to your strong side if you've built a particularly good offensive line, or key on your tight end, if he's your all-star receiver. Alternately you can let your coaches and scouts handle this 'detail work'.  In order to make all these aspects of being a manager feel authentic, the game's statistical methods have to be on target, and by and large, they come out right (though in one game the St. Louis Rams did win the 1998 Super Bowl). But any game that has a chapter in the manual called ~Regression Analysis used to Estimate Salaries~ is obviously on a solid footing, statistically speaking.  Many of the methods the programmer used to make these determinations are detailed in the electronic manual, but the player's actual ratings are hidden from you--as a manager, you can't divine a purely numerical rating for every player's attributes; instead you must rely on the judgement of your scouts when evaluating players. The better your scouts, the better your information, but nothing is guaranteed--random factors like injuries, off-the-field suspensions for criminal activity, and a random factor ...   The game is also flexible, in that you can spend as much or as little time with it as you like. To play quickly, you can let your scouts and coaches fill out the depth charts on the roster, make all the draft decisions, and create their own game plan. This way, you focus mainly on the off-season, resigning players and acquiring free agents, and on expanding your stadium and keeping the team out of red ink. Or you can play in a hardcore detail mode, tuning the playcalling before every game to match your opponent's defensive weaknesses, checking league and individual stats every week, and then watching the results of every play in the detailed game sim mode.  Of course, not everything in Front Office Football is perfect, not by a long shot. Trading is a bit counter-intuitive, since I'm used to Baseball Mogul's ability to give you a counter-offer from the team you're trying to trade with. Here, it is very difficult to get the opposing team to agree to a trade, though that does reflect the NFL, where trading is far less important than it is in baseball.  Additionally, more could have been done to alert you to events, as for example when John Elway retires, Marshall Faulk gets a season-ending injury, or attendance at your home games is precipitously dropping. Players are also pretty much anonymous bundles of stats--it would be nice if the player information screen showed the player's entire career: the year-by-year stats as well as the other stuff, so you could see whether he's been with one team for a while or has moved around a lot (this is something Baseball Mogul neglects as well).  Another missing feature is the ability to move your team from city to city. While hardly popular with the fans, it is something that happens often enough in the NFL that it probably should be included. A list of all possible cities with. More could be done with the stadium proposals, perhaps meetings and 'contributions' to the local politicians to help move things along.  Information could have been presented better--there's no one screen that tells you where your team is strong and where it's weak; when dealing with resigning a mass of your own players, you have to click on each one to figure out his salary demands, and then total them up to see where you are with the cap; and the team stats screens don't give overall rankings for the offenses and defenses.  But generally, these are minor points in comparison to the overall experience. And while not as polished or as feature rich as Baseball Mogul, Front Office Football still has plenty to offer as a sports strategy game, and arguably has better artificial intelligence (as the other GMs can't be duped in trades) and a better stats model (since it is harder to predict how the young, new players will do). Still, baseball and football are apples and oranges, and if you liked one game the odds are you'll like the other, and both should be recommended for popularizing hardcore sports sims on the PC.  And while we do not normally include ordering information in a review, since this game is not available in retail stores, we'll point you to the developer's home page, where you can try the demo and find out more about the game.  --Jason Bates", "date": "Oct 29, 1998"}