{"name": "True Crime: Streets of L.A.", "name_review": "True Crime: Streets of LA", "ref": "https://www.ign.com/articles/2004/11/23/true-crime-streets-of-la-2", "text": "Mobile makers are greatly benefiting from relationships with top console game producers. Sorrent enjoys a closeness with Atari, Gameloft holds hands with Ubi Soft, and MFORMA has a sweet deal in place with Activision. The latest fruit of such a partnership can be seen in True Crime: Streets of LA, newly released for handsets -- based on the bestselling console game of last year.   Features:   Driving and on-foot missions  Top-down view of Los Angeles  Multiple endings to scenarios   True Crime: Streets of LA was an incredibly ambitious console title last year that tried to not walk lockstep with the Grand Theft Auto franchise. The final results were mixed. Some of the action sequences were outrageously fun, the realistically mapped-out Los Angeles was well-done (especially for anybody who lives in this so-called City of Angels), and if you were into kung-fu mysticism, you were also covered. The game was also derided, though, for banal dialogue and some tech problems that kept you from really slipping into detective Nick Kang's shoes.   The mobile version of True Crime: Streets of LA actually manages to avoid some of the pitfalls of the console version, thanks to its limited tech. However, scaled-down hardware also means scaled-back gameplay, and gamers not understanding that something like this is a companion piece to the console version will be disappointed.   True Crime: Streets of LA is a top-down action game, fairly evenly split between driving and shooting missions. After a quick in-game tutorial that teaches you the basics of driving, shooting, carjacking, and using the map, you're dropped right in the middle of downtown Los Angeles. Now, the LA of this mobile True Crime: Streets of LA isn't as pinpoint as the console game -- in fact, it's not really even close. However, if you look around the boxy blocks, you'll see the LA flavor -- occasionally glitz surrounded by ugly sprawl.   The map is actually pretty easy to read. Your goal is always noted by a little green dot on the edge of the screen that lets you know the general direction to drive/run. Your display also reveals the amount of remaining health, bullets, cop rating and mission time.   Driving missions are a mixed bag. While the map certainly makes getting from one location to another easy, the driving engine itself isn't terribly deep. For example, there's no real ~cornering,~ per se. You just tap the thumbpad if you need to turn and your car does a magical 90-degree hop. Sure, this makes the driving accessible to anybody, but wasn't one of the big draws of True Crime: Streets of LA supposed to be the feel of the cars?   Slipping in and out of cars is handled with a simple action key, and grabbing new cars is a fun, breezy way to pass the time. There are high-speed pursuit segments that work reasonably well. Because of your super-turn ability, tailing a perp is actually pretty simple. You can shoot cars from your vehicle. As you near a perp's car, a crosshair over the auto shows you have a lock and will successfully shoot the car when you pull the trigger.   Now, you must be careful while driving because like the Missing Persons song says, there are plenty of nobodies walking in LA. These innocents can be splattered with your car (leaving chalk outlines). Should you run over a ped like this, your cop rating will go south. Taking out bad guys will help restore your good cop rep.   On-foot missions are also a mixed success. Nick Kang had a look and style in the console game you either loved or hated. He doesn't have it here. The top-down sprite is small and lacking in detail and frames of animation. For a hero-centric game, this Kang is pretty dull. However, what he lacks in personality, he makes up for in hardware. Kang comes factory-equipped with a pistol, but you can find additional weapons with far greater stopping power. On-foot controls are a little better than driving, but we couldn't help but wish Nick had a little more spring in his step. You really have to jam on the thumbpad to get this dude to make tracks.   When you are chasing a bad guy on foot, a convenient red arrow appears above his head so you can track him. When he runs off-screen, a green dot appears to let you know which way you need to hoof it and catch up. While running, pressing the ~OK~ button fires your gun. True Crime: Streets of LA has a nice way of showing you when your bullet meets its mark -- a splash of crimson erupts from his fleeing person.    True Crime: Streets of LA is a hit-and-miss game, visually. The map of Los Angeles is bright, colorful, and varied. People, however, are not. In fact, Kang's sprite is the exact same as a regular pedestrian. And the only difference between you and the bad guys are shirt colors. The game eschews sound effects for a looping bit of music. It's not bad -- it has a nice bit of Hong Kong flava for Kang -- but you'll likely grow tired of it after a good fifteen minutes of play.  True Crime: Streets of LA does a pretty good job as a companion piece to the console game. It follows roughly the same storyline, even though it's told through text screens rather than cinema shorts. Personally, while I was somewhat disheartened by the controls and the same-y appearance of people and cars (color changes are really all that's employed), I appreciated the kind of ambition the developer showed when making True Crime: Streets of LA.Sorrent combined car and foot missions earlier this year with DRIV3R -- which did offer much greater auto control. But True Crime: Streets of LA has a better storyline and the simplistic controls may be a big boon for those getting started with mobile gaming. There are certainly better games available right now, but if you want a cell game with some depth and game length, True Crime: Streets of LA is a worthwhile way to pad your phone bill.", "date": "Nov 23, 2004"}