{"name": "Teenage Mutant Ninja Turtles 2: Battle Nexus", "name_review": "Teenage Mutant Ninja Turtles 2: Battle Nexus", "ref": "https://www.ign.com/articles/2004/11/24/teenage-mutant-ninja-turtles-2-battle-nexus", "text": "After the last Ninja Turtles outing, you'd think the posse of face-stomping turtles would have preferred to stay in the sewer. Several issues kept the last game from succeeding. The first (and most important) reason was that it simply lacked the kind of fun expected from a title featuring mutated turtles with deadly weaponry.    The AI needed an overhaul and each level suffered from an abysmal lack of variety. Aesthetically, Teenage Mutant Ninja Turtles did an ok job transplanting the look of the new television show, but alone that just wasn't enough.   The latest turtle outing from Konami, Teenage Mutant Ninja Turtles 2: Battle Nexus, improves the formula somewhat. Like the first title though, it suffers from dumb enemies, bland gameplay and shoddy control. Although, Battle Nexus does in fact try to shake things up in a number of ways.    First, it lets you swap characters on the fly, with each turtle claiming a unique ability. Second, you can now play the main campaign through four player co-op, up from only two players in the last game. Third, Battle Nexus features collectible artifacts and includes the classic Teenage Mutant Ninja Turtles arcade game. First, we'll dissect the on-the-fly character swapping.   Initially, this sounded like a groovy addition. After all, each turtle possesses his own unique personality and abilities in the show, so why not in a game? While Battle Nexus makes use of the feature, it feels rather shallow most of the time.    Donatello, the smartest of the bunch, operates computer consoles and switches, letting him disable security lasers and open doors. And that's all he does. Donatello could have had far cooler abilities, such as the ability to hack into and control robotic enemies, for one. And where are all those cool gadgets he invented in the show?      The other turtles claim equally handy, yet altogether disappointing, abilities and talents. Leonardo uses his Katanas to slice through certain barriers and Raphael's intrinsic rage helps him move heavy boxes and crates. The game affords you plenty of opportunities to use each power, but each is a simple matter of calling Donatello to flip a switch or Raphael to move a box. Nothing terribly exciting, but it works well enough. A roster of unique abilities per character would have been cooler. Not to mention more strategic ways to use them to solve challenges in the game.    In addition to different abilities, each turtle boasts unique attacks. As stated in earlier coverage, each turtle features a basic set of moves. Each has two primary attacks: light and strong. The strong attack causes heavy damage but is slow, where the light attack delivers two consecutive blows that don't deliver much damage. Each turtle also performs one aerial attack and one charge attack. Raphael's charge attack unleashes a ring of fire called ~Turtle Flame~ while Leonardo emits a short-distance projectile called ~Turtle Slash.~ Michelangelo throws a long-distance energy ball called ~Turtle Blast.~     Each turtle also comes with a dash maneuver and a stack of shuriken to throw at enemies. Aerial attacks cause less than damage than charge attacks, but there's less chance the attack will be interrupted since you'll be delivering the blow from above.    Raphael's aerial move causes him to dive toward enemies while spinning and Donatello bashes his foes from above with his staff, to name a few of the moves. For some odd reason, you can't throw shuriken while jumping, so killing bats and other airborne foes is a pain. Using Michelangelo's mid-air attack works just fine, but you're out of luck if you're stuck with any of the other turtles.   While you can play the story mode in single player mode, the real hook is the new four-player co-op mode. Each player chooses a character (or two players chooses two characters) and heads into the game. While it is in fact a bit more enjoyable playing with friends, the game in itself doesn't change to accommodate the increase in players.    All of the puzzles play out exactly the same way, requiring only one player to perform a specific task. And the enemies remain as inebriated as ever, simply waiting around for you to put them out of their misery.   Battle Nexus includes several racing sequences, where you'll ride boards over snow and various other terrain. These can be mildly entertaining when played with friends. Too bad the racing sequences control as badly as the rest of the game. After you've fallen into a pit or missed a jump the tenth time due to unresponsive controls, there's a good chance your friends will abandon you, leaving you to weep all by yourself, controller in hand.    One of the biggest concerns in the first turtle game was control. It hasn't been improved in Battle Nexus. A slight pause still precedes every jump, forcing you to miss critical jumps during platform puzzles. You also can't block fast enough to avoid damage in some situations, especially after performing a combo. The double-jump also feels a little wonky, forcing you to fall into bottomless pits quite often when jumping from platform to platform.       Enemy AI in Battle Nexus still lacks intelligence. Foot soldiers and guards often turn their backs to you, providing many opportunities to slice them dead. You'll also encounter enemies that stun you with every hit, leaving you open to attack. Now, you may argue that it's all a question of skill and that a good player can avoid damage altogether. But that's not really the case here. Factor in the unresponsive controls and the fact that you'll often face three or more of these ~stun~ enemies simultaneously, and you have the ingredients for one frustrating game experience.    To its credit, Battle Nexus includes various extras. The first and coolest of which is the inclusion of the classic turtles arcade game. It's a perfect port, so expect a trip down memory lane when booting this sucker up. As in the first game, you can also unlock various characters such as Casey Jones and Master Splinter, but now you can also find artifacts strewn about each level that you can take to April O'Neil's shop named 2nd Time Around. Once at the shop, you can look up information on whatever you've collected. You can find suits of armor, weapons and other ninja-centric paraphernalia.   In the end, Teenage Mutant Ninja Turtles 2: Battle Nexus improves on its predecessor by including a list of groovy extras and providing each turtle with unique abilities. Battle Nexus also lets you play four-player co-op. Sadly, the shoddy controls, frustrating platform puzzles and sub par enemy AI keep Battle Nexus from succeeding. The racing elements offer a little amusement, but poor control spoils the fun in that department as well. Overall, this game is an improvement, but nowhere near the addictiveness of earlier NES and arcade games based on the Turtle license.", "date": "Nov 24, 2004"}