{"name": "Prince of Persia 2", "name_review": "Prince of Persia: Warrior Within", "ref": "https://www.ign.com/articles/2004/11/25/prince-of-persia-warrior-within-2", "text": "ranks among the very best console action-adventure games of this generation. Despite the critical acclaim, Ubisoft decided to tinker with the formula in hopes of attracting a wider audience with Prince of Persia: Warrior Within. The result is a much darker Prince, who speaks in a gravelly voice, travels through a rather grim labyrinth of saw blades and spiked floors, and is solely concerned with saving his own butt, no matter who he has to take down in order to do so. In the process, Ubisoft Montreal re-invented the combat system, added a few new traps, lengthened the gameplay experience, and threw in a number of bosses. So, with all of these improvements, how is it that Warrior Within isn't as good as The Sands of Time?  A Warrior's Tale Warrior Within takes place several years after the events of The Sands of Time. The Prince, having originally released the Sands, is being hunted by the Dahaka, guardian of the timeline. The Dahaka is a massive dark warrior that serves fate and will pursue the Prince until he is dead. Desperate and weary from the years of running, the Prince makes a final play, heading to the Island of Time. The hope is that if the Prince can somehow go into the past, he can stop the Empress before she ever creates the Sands of Time, meaning he would never have opened them and the Dahaka would have no cause for its hunt.  The premise certainly sounds good and the story of Warrior Within has more complexity than the simpler fable of The Sands of Time. Ubisoft chose to use this story to darken the Prince, draping him in a morose take-crap-from-no-one attitude, changing voice actors to provide the Prince with an edgy Clint Eastwood snarl, and giving him such novel lines as, ~You bitch!~ No, this is not Sands of Time, this is the new Prince of Persia and the idea of a dark character, dark atmosphere, and dark story are forced down your throat from start to finish. It's too much, too forced, and frankly, not as appealing as the Prince of old. From a thematic perspective, it's a step backwards, even though the gameplay remains excellent.    In Ubisoft's decision to make a bad-ass, no-nonsense Prince gamer's could better identify with, they instead made the Prince more generic than before. It's the Arbanian theme, the whimsical feel and luscious bloom lighting of The Sands of Time that helped it stand out among other action games. And though the gameplay mechanics remain unique to the world of the Prince, the character seems like a quick selection from video game Central Casting.  There is no Farah in this adventure, no white dove that shows some light in the darkness. There is nothing to contrast the gloom seen throughout Warrior Within. The Prince is not out to save the world, he's out to save himself at the cost of anyone who gets in his way. This isn't even a tale of revenge. It's easier to empathize with the Prince from The Sands of Time, because he's likeable, and he's at least trying to do the right thing. The only character in peril this time is the Prince. He's not a hero this time out, he's just a guy trying to save his own ass.  Though the dark look and feel of Warrior Within were off-putting at first, once I got past those elements, I fell in love with POP all over again. Warrior Within is quite an enjoyable gameplay experience. With many of last year's complaints addressed, it would be tough for any Prince fan not to enjoy the sequel, just don't expect to love it as much as the first.  The Prince of Persia's Excellent Adventure As with The Sands of Time, Warrior Within sets you in a confined environment (this time an island), throws enemies in your path, and has you perform acrobatic feats that would seem to defy gravity. Once more you will run along walls, swing off bars and fly through the air like a trapeze artist. Though the essence of POP remains, the game's structure is a little different.      Where The Sands of Time put you at the starting line and then pushed you from point to point, rarely returning you to familiar ground, Warrior Within has a slower pace and a more open design. The majority of your quest involves activating two towers (Tolkien fans, please don't send me your angry letters), which open a door that's keeping the Prince from his ultimate task. You can choose to go after the towers in any order and you can trek back through the majority of areas at any time if you want to explore, look for hidden treasure chests (which unlock art), or hunt down the elusive, booby-trapped chambers that hold health meter boosts.  Throughout the Prince's journey, you'll come across time chambers, where the Prince can hop to the past or present. This changes the enemies encountered and the overall structure of each room. It's an awesome sight at times, to witness a room in the present -- dilapidated and barely in one piece --  transformed to a pristine grand hallway, with working traps and better lighting.   As with most open adventures, there's a lot of backtracking in Warrior Within and while many instances place you in a different time period when you backtrack (making for a new experience), there are several times where you will revisit the same rooms, pass the same traps, defeat the same enemies. These repetitive moments really screwed my navigation up, as I would pass a few familiar traps and think, ~No, I must be going the wrong way, I've been here before.~  While the backtracking is a little too much in the end, there's a lot of variety to the areas, more so than in The Sands of Time. The more drab locations, which are prominent early on, are the weakest, the later sections of Warrior Within feature some fantastic design and great art direction. I love the gigantic moving gears in the Mechanical Tower and the gorgeous green Garden Tower. The areas that caught my eye most, that really made me appreciate Warrior Within, were the ones that were less dreary and reminiscent of the style from The Sands of Time.  Critics of The Sands of Time's length have nothing to fear. If the first POP took you eight hours to beat, Warrior Within should take 12-14 hours, a good length for an adventure game. Any longer and it would have become monotonous. As for concerns that this is an all-combat affair, Warrior Within has the same balance of platforming, puzzles, and combat as Sands. However, the platforming elements have been approached a bit differently this time out.   The Platformer Within Anyone who's played through The Sands of Time will have few problems handling the platforming tasks of Warrior Within. Though two new trap types have been added and the need for slowing time is more prevalent, you won't be asked to do anything you haven't done in last year's Prince of Persia. Run on walls, leap off onto a bar, swing and jump against another wall, bounce off and upward, grab onto a ledge and pull yourself to the top. I could do it in my sleep by now, but I still love it, because no other game has platforming quite like this.  The major difference between Sands and Warrior Within is the sense of urgency when platforming. Sands had a lot of crumbling beams and platforming puzzles that forced you to be reactive, where Warrior Within is a bit more laid back, concentrating those types of intense moments into short bursts. On the one hand, this makes a sepia-toned chase scene where you must run from the Dahaka more exhilarating. But since you only get about a half dozen or so chase sequences in the entire game, it would have been nice to see more instances where quick reactions were vital to survival.   Platforming is what makes this series unique. There are a few other platformers in the market, but none come even close to POP in terms of innovation or sheer marvel. Why then de-emphasize what makes this franchise so special? Though there is an equal share of platforming and combat, the platforming often feels secondary in design. You always seem to be platforming just so you can get to another battle. Because there are far fewer moments where you are pressed to move quickly, a lot of the jumping, swinging, and wall running is easy to take for granted. I'd rather have more complex platforming moments that require quick reactions and timing and less combat. Fighting in action games is incredibly common, but great platforming is not. Why not stand out from the crowd instead of standing with them?      One thing that has not been fixed with platforming is the camera. Though you can now move around while in the pulled back Landscape View, there are several times where you can't position the camera behind the Prince, forcing you to make a blind jump. This is nothing new, as it was a problem in The Sands of Time. This issue doesn't surface often, but it's still there.  Along with platforming, Warrior Within retains roughly the same number of puzzles as the previous game. Puzzles often involve pulling levers to adjust movable objects to either connect together or create new ledges for leaping. These puzzles really don't require much thought and I actually passed them all by just randomly turning levers. As with the first, I really wish there was more emphasis on classic adventure-style puzzles that require some real brain power.   King of Blades Ubisoft Montreal's biggest efforts went into upgrading the combat system. We've talked about this system extensively since E3 2004, but some things are worth mentioning again. For Warrior Within, Ubisoft created a free-form fighting system, which enables you to create your own combos and find your own favorite fighting style. With the ability to wield two weapons, the Prince now has an assortment of combat options. You can pick up a secondary weapon and use it in combination with your normal sword (which is upgraded about a half-dozen times throughout play) or you can toss the weapon at a foe (for a knockdown or delightful decapitation). Playing with your default sword is often a better tactic, however, as with one hand free you can grab enemies. Once nabbed, an enemy can be strangled, sliced, or tossed aside.   Combat in the first few hours of Warrior Within is pretty awesome, because it's all very new and there are so many ways to earn slow-motion close-ups of gruesome death blows. With the large variety of enemies and more than 60 weapons at your disposal, there is plenty to keep you occupied. But after a few hours, I started getting tired of the battles, just as I did in The Sands of Time. I don't care about fighting more and more enemies, no matter how cool it may look, it's the platforming and the puzzles and even the story that make Prince compelling. Eventually I just started grabbing enemies and throwing them over ledges to get rid of them quickly.    Fortunately, there are some good boss fights mixed in throughout Warrior Within that refresh the combat. The brutes, who are flesh and sand goliaths that tower over the Prince, are an awesome challenge. The Crow King is a cool-looking foe, though he's never given any context in the game as to why he exists or what his purpose is other than dying by your blade. The big fights come against a few different women, all of whom share the same set of combos. It's pretty damn cheap when you fight two different characters a total of four times and each fight is the same with some wrinkles (i.e. Time Powers) here and there. Still, the final boss fight is at least a challenge and victory is certainly satisfying.  Cats in Agony: The Sounds of Warrior Within While some may argue that the darker theme of Warrior Within makes for a better game, there will be little debate over the sound, which just plain sucks. Godsmack provides one guitar-heavy melody used a few times in POP 2, but there are other heavy riffs that often come up during combat as well. Though there are a few tracks offering a more Arabian feel, they quickly fall prey to power cords.   When the music isn't happening, you must contend with the horrendous screeches from enemies, which sound a lot like my cat getting neutered. Then there are the quips from some of your female combatants, who sound like valley girls on a power trip and who scream like banshees in a blender. Perhaps worst of all is the Prince himself, who offers some horrible quips, including, ~I am the Prince of Persia... and the King of Blades!~ Try listening to that ten times fast. The quips from bosses are repetitive and bad as well. On the plus side, this becomes added inspiration for killing bosses quickly.      It's not all bad though. Along with some of the more decent Arabian-themed tracks, the voice acting in the cut-scenes is actually quite good. Sure, the Prince sounds like he's been smoking since he was seven, but for the tough-guy voice, he's actually handled well. I like the cut-scenes and the voice-acting in them, but during combat it's just awful. The Prince doesn't even talk to himself any more in that adorable Peter Parker kind of way. He's quiet until he needs to cut someone's head off.  Timeless Beauty The sound may be ugly, but the game is beautiful. The bloom lighting of the first POP made for an almost ethereal experience and Warrior Within is the exact opposite. Things are dark and dirty, with the Prince looking more menacing than some of the enemies he faces. Love or hate the look, it's hard to argue the stunning visuals. The architecture in some areas is amazing and the Garden Tower feels like the seventh wonder of the world.   Ubisoft seems to be king of animations and Warrior Within adds a few more to the Prince's bag. Everything is smooth and fluid. Watching the Prince climbing a ledge is a fantastic sight. What other game has animations so good that you can be in awe of a character climbing a ledge? With dust particles, dynamic lighting, and solid texture work, Warrior Within keeps Prince is a pretty game. Unfortunately, the PS2 version suffers from a lot of framerate stutters and some contrasting problems that make the game too dark in some areas. In a game packed with action and platforming these things can be a killer. It mainly affects aesthetics more than gameplay, but it's very noticeable throughout the game. Prince of Persia: Warrior Within has lost some of the marvel that made The Sands of Time one of the great games of this generation. Despite this, it retains the core gameplay of Sands, improves the combat, and adds substantial length to the gameplay. The majority of those who enjoyed The Sands of Time will like Warrior Within, but a few may find the overly dark look a bit too much of a departure from the series' roots. Ubisoft Montreal needs to realize that people play prince for the sense of swashbuckling adventure, not for the combat. If anything, I'd like a combat system that pits the Prince against just one or two enemies at a time, but matches the intensity of a fighting game. Ubisoft took a gamble by taking the Prince to a dark place. I don't think it paid off as the sense of magic, seen even in the old 2D PC days, is barely present here. It wasn't the wrong decision to make for a darker story, but Ubisoft took it too far. I like Warrior Within, just not as much as Sands of Time. Despite the step backwards, this is still one of the best games you could purchase this holiday.", "date": "Nov 25, 2004"}