{"name": "Monster Garage", "name_review": "Monster Garage", "ref": "https://www.ign.com/articles/2004/12/01/monster-garage", "text": "It's as if Hollywood wasn't doing enough to ruin our favorite TV shows. That's the only rationale behind Activision Value's latest game, Monster Garage, the highly touted Xbox version. Now, I've been a fan of the show since it first aired two years ago. The reality-TV concept married to a high pressure automotive engineering challenge is damned exciting to me, not just because of the open-ended mechanical problem-solving but also because of the incendiary personalities. Sadly, neither quality has managed to find its way into this clunky car-~making~ game. What we're left with instead is a puzzle game that inexplicably straddles the line between Byzantine complexity and generic simplicity.    If you haven't seen the show, gear-head and all-around guy's-guy Jesse James (also seen in Tony Hawk's Underground 2 driving the retro-fitted Seque-chopper) is tasked with converting a stock car into an entirely different kind of vehicle. Viewers tune in every week to see Jesse and his team of five builders (a different group for every show) try to turn a Ford pick-up into a nut-shaker. Or turn a Mini Cooper into a snowmobile. The team gets $3,000 (and a few freebies) and seven days to complete each project. The real excitement comes from seeing the different build teams interact as they try to turn a bus into a pontoon boat. Should be fun, right?   Well, that's where the fun should start. But it's actually where the game careens into unparalleled idiocy. Monster Garage the game requires no more skill than watching the show. Early on you'll be limited to one particular schematic for your build. As the game progresses you'll be given the option to choose from a couple of different designs but, rather than wildly adjusting the game, these small options merely give the illusion that you're involved in the process of determining how to approach a given task. Added to that, a whole laundry list of things appear designed to ruin the interface, from the camera that gets stuck on stationary objects in the garage, to the check list that doesn't appear side-by-side with the parts menu.    Fall asleep in all new ways with Monster Garage. I also find it quite stupid that the seven missions here are all drawn directly from the television show. Now, call me an idiot, but it seems to me that the only people likely to be interested in this game are people who are already interested in the show. Basic logic, right? And the only reason they would be interested would be if the challenges were new. Since the game merely duplicates some of the well-known challenges from the show, I can only respond with a hearty ho-hum. Here goes: ~Ho-hum.~   The terribly dull and uninspired building phase offers just as much freedom as the design phase but really ratchets up the tedium factor. The car sits before you in a 3D showroom. You can pan the camera around the car, focusing on the particular sections you need to work on. Using the Xbox analog stick and face buttons you click on menus to add parts. But the only other real interaction you'll get here is in screwing and unscrewing bolts and either cutting or welding pieces of metal. What's even funnier is that you actually have the option to skip the basic screwing and unscrewing of bolts, which is the only actual mechanical work you'll perform. This dumbs down an already basement-level of dumbness to below the likes of Barbie Horse Adventures, which looks damn interactive in comparison.     Like in The Sims the time values are all screwed up here and it takes far too long to complete certain tasks. Forget it taking an hour to go pee; I'm more concerned that a career mechanic takes five minutes to unscrew one nut. You'll be grateful at least that the sounds within the shop seem fairly realistic even if the labor commitments aren't. You'll also find that your own cursing sounds very realistic after a few minutes of playing.   Before you get too deep into the first day of your build, you should head to the parts catalog and you'll see a list of everything you need to buy. Simply buy one of everything you don't already own and you're set. Having the chance to pick from among different types (or at least qualities) of parts would help to make the game more interactive. And if that variance in quality translated into better vehicle performance or time saved during the build, so much the better.   Worse still, when you have a part that needs to be customized, all you have to do is click on one of your builder portraits. A complete list of every custom job the build requires is laid out before you and you'll merely have to assign builders to work on each project until they're finished. Again, fitting the right builder to the right project isn't even a consideration here, therefore eliminating the opportunity to think.   And, as I said before, the builders here have no real presence in the game. The show is full of disagreements and clashes. Here you just have the portraits of three random guys alongside Jesse James. They're not profiled like on the TV show or even introduced. Given that none of them stand out in terms of performance, it's probably best that you not try to get to know them.   Driving this car is about the most gameplay you'll get. Things would be bad enough if they ended there. But, as in the show, you'll have to take your new hybrid, Frankenstein car out for some trials to see if it stands up to real world use. (That's if you haven't managed to forget something completely idiotic, like not removing the front windshield of your rock climber therefore rendering it completely inoperable.)   Anyway, if you haven't arbitrarily screwed up your car (which is next to impossible), you'll have to take it out of the garage for some really basic driving challenges. Where the show presents a head-to-head challenge against another stock vehicle designed for the purpose. But the only challenge here is the inconsistent physics system.You get that I really don't like this game, right? Having already waxed critical regarding the game's worst features, I feel the need to add this final thought: Though games are a separate medium than television, the key to successful licensing lies in adapting what makes a property cool as you move from one medium to another. In the case of Monster Garage, the developers have eliminated the personalities and blank-slate design decisions that make the show worth watching. Worse still, the designers have simply reproduced challenges from the show virtually ensuring that anyone who might have the least interest in this game won't be surprised by any part of it.The only monster is this garage is a flagrant disregard for fun.", "date": "Dec 1, 2004"}