{"name": "South Park: Chef's Luv Shack", "name_review": "South Park: Chef's Luv Shack", "ref": "https://www.ign.com/articles/1999/12/15/south-park-chefs-luv-shack", "text": "I guess if there's one thing that bonds the systems of this world, it's South Park. I've been hearing the South Park ~Simultaneous~ song coming from nearly every section of IGN as the game has made it onto nearly every platform known to man, and it was only a matter of time before the PC offices were filled with more bleeps than you can shake a [bleep] at. Chef's Luv Shack is the next in line for the South Park franchise, a You Don't Know Jack copy under the guise of a public access show hosted by Chef, and played by the four kids of South Park. It's a chunk of You Don't Know Jack style trivia, spiced up with some mini-games, and a whole lot of show references... and not much substance.  The game allows you to choose between one and four players (two on keyboard, two on separate joysticks), though the one player game is pretty pointless, since you play by yourself through the entire session. You can choose your game size and character, limited to the four main kids in South Park. You're then introduced to the exciting world of trivia and quick action gaming. The question are a spotty set, varying from how many World Cups England and France have won to the more SP-appropriate ~who was the big one off of Facts of Life?~ Kids are going to be stumped by most of the harder questions, while adults will be bored by the absolute simplicity of the easier pop-culture references. There are some funny questions though, particularly when categories range from Robert Smith minutiae to an encylopedia of (surprise) sexual references.   Mini-games pop up fairly often between sets of questions, giving players a change to score some extra points and bash each other to shreds. Most of the events are lifted from popular classics like Donkey Kong and Super Sprint, while others mimic midway games. You can blast each other apart as Terrence and Phillip in a mockery of Asteroids called Asses in Space, or try your hand at Spank the Monkey with Mr. Mackey, a screwed up and funny version of Simon.   The graphics are straight out of the show, simple and flat. Everything's incredibly crisp, though you do get a shocking amount of fuzz when any characters try to do some dancing, shaking or yelling on the main set. The simplicity does lead me to ask one question though -- ~what's up with the weird load times?~ The game moves at the pace of a Shockwave game, and though the game loads new screens fairly fast, why should it really load much at all? The actual mini games are an erratic bunch as well, sometimes moving lightning fast, while other times running at a choppy pace, despite the fact that little or nothing is actually animated on screen. You'll get to hear all the signature phrases and voices from the show in the game, which depending on how much you like the show, will either make your day, or break it right in half. Personally, I can't hear enough of Cartman (especially the classic ~suck my toes you ***holes~), but I'm seeking therapy to try to help me with my illness. Though it's under the Mature rating, don't expect to hear any foul language just because this is PC instead of TV. It's still bleep city, but at least you can take solace in the fact that they actually perform an alien anal probe on Cartman in the game. South Park -- always the bastion of classyness.  The look is perfect, the sounds are great (especially with a host like Isaac Hayes guiding you through the seamier side of trivia), but the game itself just refuses to act fun, damnit. The questions are funny, yeah, but they lack the trivia-ocity that makes you want to watch Jeopardy night after night. In fact, a lot of times, the actual question is fairly dry and simple -- as if they were lifted right out of the almanac and plunked into the game. There's still a nice helping of South Park trivia, but with the show not even three years old, it's a little hard to make any question guaranteed to stump or fluster fans of the show (AKA, most people buying the game).  The mini-games are fun for a few minutes, but quickly (very quickly) get old, since they're designed to have the level and depth to last for around 30 seconds. You're able to play up to four players on most of the games, and they do attempt to create a frantic battle between players, but anyone who's had a taste of Mario Party will see just how shallow most of the events are in CLS. It would have been great to be able to play more elaborate versions of the mini-games separate from the trivia game, but they probably keep them imbedded for the same reason that you don't get the answers to questions you get wrong: longevity. There are a fairly limited amount of questions, and any avid player should be able to run into duplicates in a matter of days.  Chef's Luv Shack lives up to its name. It's not a complete house, it's not even a condo. It's a shack worth of game -- even fans of the series will quickly find themselves bored by the mini-games and limited questions. You Don't Know Jack was just as irreverent, funny, and twisted, only it was actually good. Chef's Luv Shack, on the other hand, will leave you about as satisfied as the average Internet date. The final words of the game pretty much sum up the average Chef's Luv Shack experience: ~that's it, game over, you can leave now.~  -- IGN Staff", "date": "Dec 15, 1999"}