{"name": "Ridge Racer DS", "name_review": "Ridge Racer DS", "ref": "https://www.ign.com/articles/2004/12/02/ridge-racer-ds", "text": "Regardless of Namco's official line on the product, Ridge Racer DS is, at its core, a ~port~ of the company's Ridge Racer 64 game released on that console back in 2000. And that's certainly not a bad thing considering that Ridge Racer 64 was a pretty top-notch racer on the N64 a half decade ago, an impressive, NST-developed extension of the Namco arcade racing franchise.   As we've already experienced with Super Mario 64 DS, it's clear that the Nintendo DS system was created with the capabilities of the Nintendo 64 in mind. And it's also pretty obvious that it's this particular reason why we're getting Ridge Racer DS as a launch title. Quick development cycles beget either ports or half-baked game designs, and in this case we're getting a spot-on portable conversion that likely isn't going to sell anyone on the system and its capabilities, but it at least seeds the Nintendo DS' library with one of the few solid addition to the launch line-up. Features 20 GP races 32 available/unlockable vehicles Cartridge save (three slots) Multiplayer support (six players, single/multi card)  Nintendo's own NST development group, who has already proven itself Nintendo DS capable with its Metroid Prime Hunters project, had been commissioned by Namco to revive one of its first products out of the studio for dual-screen gamers. Ridge Racer 64 was already a successful game design on the console, even though its existence was more the ~black sheep~ of the series due to the fact that it was, gasp, a Western-developed version of a decidedly Japanese franchise. The Nintendo 64 game was a great way for the development team to get their feet wet, as it gave the guys the opportunity to put their skills to use by ~porting~ a high-profile PlayStation game into the N64 platform, all the while giving them creative opportunity to offer Nintendo 64 owners a new take on the existing arcade racing formula. Ridge Racer DS isn't like Super Mario 64 DS, at least in terms of ~N64 ports~ on the system. The DS version doesn't add or change much from the original design -- this is, pretty much, a dual-screen version of the game that hit the scene a half decade ago. The developers push the second screen by reducing the ~clutter~ on the main, upper-screen, moving the track map, lap times, and transmission gear to the lower screen. The rest of the lower display is taken up by an enormous, nearly full-screen representation of the vehicle's steering wheel. While this wheel may appear somewhat stupid and wasteful in still screens, it's, believe it or not, a handy indication of how much rotation's being applied during a turn...especially when hitting the skids into the all-important powerslides. Ridge Racer was never about realism. At the series' core, it's a balls-out arcade racer, and Ridge Racer 64/Ridge Racer DS remains true to the franchise by focusing on tremendous speed, tight action, and intense racing competition. Powersliding is, and has always been the series' heart, giving players the ability to hit near 90 degree chicanes without the need to hit the brakes in the process. Ridge Racer 64 took this one step further by letting players push the powerslides into full-out 360 degree turns. It was this decision that gave the design a love it/hate it relationship with gamers, but there's no denying that it adds a bit of cool factor to the game's look...especially when players successfully hit turns in a full out car rotation at top speed.    The other design bulletpoint in the series Ridge Racer's aggressive computer AI opponents, and the challenge that comes from trying to beat them. Ridge Racer DS offers the same aggression, and later that aggression turns into pure frustration. This game is not easy, and its requirement to come in first place to move on to the next race can get absolutely brutal deeper in the game. And with 20 different challenges in the Grand Prix mode, it's not a quick cakewalk to finish. There's not a whole lot of variety in the tracks, though, since there's really only three different locations, and the different courses are simply branches off the same main circuits.     The biggest ~change~ that this version of Ridge Racer brings to the game design is its control structure that's set up on one of three ways, labeled ~easy,~ ~hard,~ and ~expert,~ though their namesakes are easily debatable. ~Easy~ is attached to D-pad, which brings the DS game back to the days of the PlayStation One's digital steering; certainly controllable, but there's far too much ~tap-tap-tap~ overcorrecting while trying to pass opponents and take basic turns. ~Hard~ is the game's ~pain in the ass~ mode of using a stylus for steering, and is clearly the least favorite control mode of nearly everyone that grabs a hold of the system. Tapping a steering wheel with an extended pencil isn't really an intuitive way of controlling a vehicle.   And then, there's ~expert mode.~ This is truly the way to play Ridge Racer 64, and it's another game that puts Nintendo's downplayed ~Thumb Strap~ to use for control. In this mode, the game recognizes left and right touch motion anywhere on the screen, similar to the way Nintendo pulled off Super Mario 64 DS's ~touch mode~ analog stick emulator. This control works extremely well once the initial learning curve is met -- since the screen offers virtually no tactile feedback, you'll have to ~use the force~ so to speak to recognize the points on the screen where your thumb meets the absolute right and left of the steering wheel's rotation. It's very ~floaty~ to play this way, no question. But racing games almost require some sort of analog control nowadays, and without an analog stick on the system this is the best it can do. Like Super Mario 64 DS it's a compromise that works, though NST should have offered a bit more user-controlled sensitivity -- smaller thumbs may have a problem sliding across the entire distance of the screen that's required for a full left-to-right movement.  Despite Ridge Racer DS's solid racing design, the game still feels somewhat rigid in its handling and course designs, and that's more a testament to the series' direction than it is in how the port was handled on the portable. Ridge Racer was never very forgiving in its wall and opponent collisions, and that's one of its shortcomings. The most annoying element is that there's no variance between road and trackside...if you're not on the track, you're hitting a wall. There's no offroad ~warning track~ when players' cars get too close to the edge, which causes a lot of annoying bumps and nudges. The DS version is also far more difficult to play in a ~chase view~ than console versions. Inside the vehicle, though, is a lot more intuitive.  But what Ridge Racer DS does extremely well: multiplayer racing. Unless I'm completely mistaken, this is the first time six players can race against each other in a Ridge Racer game, and only one copy of the game is required to take advantage of this support. Ridge Racer DS supports the DS' Download feature, and though it's limited in functionality (cartridge free players don't get music or race announcer during competition, players are labeled ~Guest~ instead of their DS' name, and only one track is transferred over), it shows exactly what the system's capable of in it wireless multiplayer mode. As long as the network remains strong, the action never drops...and computer AI drones can fill in the empty spots if the players choose. Of course, the multiplayer is fully functional in multiple cartridge mode, but the taste-test single cart mode -- and its overall handling of multiplayer in general -- is definitely the key reason to pick this racer up.  Ridge Racer DS can certainly hold its own technically, but it's not going to bust open the gates with an awesome display of visuals and audio -- as great as the game appears, it's nothing more than the Nintendo 64 game without the texture filtering. Geometry and texture work is definitely crisp and runs at a fast and smooth 30 frames per second clip. In terms of visual impressiveness it doesn't quite reach its current competition: Asphalt: Urban GT...but in gameplay, Ridge Racer DS outclasses it. It's pretty clear that if the DS couldn't handle N64 ports as well as it does, we wouldn't have seen this game in the handheld's line-up. But since the potential for ease-of-conversions exist on the dual-screen handheld, we get a revival of a Ridge Racer game that's two generations behind the current mark.  But, despite the DS' lack of true analog control the system handles the game with as much grace as it can with D-pad or touch-screen control. And the real trip is its great handling of wireless multiplayer, obviously thanks to the team's previous effort with Metroid Prime Hunters. Is it a system seller? Not a chance. But it at least strengthens the current line-up with something that doesn't immediately feel like a rushed product.", "date": "Dec 2, 2004"}