{"name": "Ghost Recon 2", "name_review": "Tom Clancy's Ghost Recon 2", "ref": "https://www.ign.com/articles/2004/12/02/tom-clancys-ghost-recon-2-2", "text": "for PC was a demanding first-person shooter that emphasized the tactical management of small squads of soldiers in predominantly exterior locales. The only real resemblance between it and Ghost Recon 2 is the Tom Clancy logo. Ghost Recon PS2 was garbage, so I'm not going to bother comparing that to anything, save for perhaps a banana. Ghost Recon 2 is definitely better than a banana, but unfortunately worse than its ancestor on the PC.  In an attempt to broaden the series' horizons (and blot the awful PS2 port of Ghost Recon the first out of existence), Ubisoft made Ghost Recon 2 into a straightforward action game that features virtually zero required or encouraged squad-based management and exactly zero tactical planning. In this way Ghost Recon 2 has more in common with Call of Duty and Medal of Honor than it does its own predecessors. This is a very good thing, as it can't suffer from what made the first PS2 Ghost Recon so bad, but it also ends up being a pretty bad thing for a number of different reasons.  It's clear Ubisoft is trying to capitalize off its strong Ghost Recon brand name, but this console-centric title developed specifically for the PS2 is so unlike those that came before it, it's misleading to categorize it within the same sweeping family tree. To call it a sequel to the terrible PS2 original would be an insult, and to relate it to the awesome PC original would be a lie. Stamping GR on top of the box just seems wrong. In many ways, Ghost Recon is essentially trying to be SOCOM courtesy of Ubi, but is it any good at that?  A Tale of Aggressive Communists Even though someone might tell you otherwise, I suspect there isn't actually a Ghost Recon 2 story. After playing through the game I've come to the conclusion that North Korea just likes attacking stuff and that was apparently plenty enough to make a game out of.  Click For More Images  Players take on the role of a Ghost (U.S. Army special operations operative) and attack these North Korean aggressors because that's the kind of noble thing Ghosts do when tyranny strikes. Even if everything in the game just sort of happens, it is at least better than fighting politically correct Nazi plant mutants or some kind of terribly inept Arian terrorist organization. Still, for as plausible as the Korean fight may be, each mission in Ghost Recon 2 is completely standalone, meaning that it could have been scooped up and dropped anywhere along the singleplayer campaign without causing the slightest continuity ripple.  Since there's no story to discover and unravel and enjoy, we hoped that the actual gameplay would propel us into some kind of thrilling ~warcapade.~ For the most part, it does not. The basic meticulous action of the original GR remains intact, but the emphasis on stealth and strategic improvisation does not. In Ghost Recon 2, any cover that is not 100% solid is useless. The AI is even capable of scanning straight through layers and layers of bushes to shoot the player character without a care in the world. And once the computer is trained in on his target, that foe will forever have his sights set on the prize regardless of what happens next.   The Korean bad guys are also blessed with an eagle's eyes and a surgeon's hands that allows them to supernaturally direct spreads of AK fire from football fields away. This makes the game suitably challenging, but also somewhat frustrating. And when they do occasionally miss, the sloppy positional audio on the PS2 (even with Dolby surround enabled in the options menu) makes it seem as if every whizzing bullet were directly behind the player character. It's like there's no left or right, so it's hard to even figure out where the heat is coming from. (Doubly frustrating.)  The singleplayer levels upon which all of this up and down mediocrity sit are surprisingly short, but again, rather difficult. Ghost Recon 2 boasts what I call a dynamic trial and error driven difficulty slider. In layman speak, when a player errs and tries a level again, the difficulty slides downward because that player's brain subconsciously remembers exactly where every enemy in the level is. Since the whole game is a giant script that never deviates, it's not hard to memorize the patterns and prepare for it all.  Even though the actual missions never really last for more than five or ten minutes (assuming they are completed front to back without repeated dying), perishing toward the end of a particularly challenging level can also be frustrating since there's no mid-game save. What's especially irking is that dying usually implies that the player has simply accumulated too many injuries as the result of being unavoidably shot several hundred times throughout the course of a health-free mission. It's a messy pit of trial and error and error and trial.       There are some minor additions to the combat, like rudimentary commands that determine the actions of a three-man squad (scout this, grenade that, return to me, and suppress over there), but they're superficial. Pointing your small unit to and fro is largely unnecessary. It's easier and more enjoyable to just walk around and let your buds stand about and do whatever. And so we're left with a heavily scripted, rather unexciting title with little to no AI, no story, no stealth, and no strategy. In essence, we're left with something even more basic than the original DOOM, only in the jungle. This isn't completing damning, however.  In many small ways Ghost Recon 2 succeeds at delivering a game worth trying. It's a game wrought with design issues, but it is technically sound and at least offers an experience on par with modern on-rails shooters. If you can imagine skating along a track and picking off enemies from afar, you can imagine GR2. This methodical, snipe heavy approach to action and careful navigation of heavily forested areas helps build upon the special operations nature of the title, but unfortunate omissions across the board never allow that rather engaging aspect to come into its own.   Take it to the People Ghost Recon 2's biggest sell is multiplayer, but that doesn't necessarily make it a good sell. In a word, GR2's multiplayer is limited. There is no splitscreen, LAN, or sever creation option. There are plenty of lag issues, performance issues, crazy extraneous Ubi.com account signups, map balancing issues, and idiotic campers. I have nothing against the people who hunker in and defend themselves and their land with a sniper rifle, but why would you do it when there are just two people left in the server and the game still has eight minutes to go before it times out? Most maps allow for widespread death within 30 seconds of booting, so having to wait around for the one overtly cautious team member to drain the clock can be a real drag.   Like the singleplayer game, the slow approach to action that eventually becomes quick and lethal is the most compelling aspect of online play. The offered weapons and configurable items add quite a bit to the experience, as do the maps that come littered with a variety of cover points. Unfortunately, online play features just as many downsides as offline play does.  Even if the emphasis on cautionary camping suits you, Ghost Recon 2 is still riddled with online issues. Over the headset, voices often fallout. Over the wire, the game can get so laggy that just shooting straight becomes an impossibility. Should you opt to play something interesting like a 16-player Supremacy match, you'll happily find yourself dealing with the same poor framerate and lag. You'll also have to deal with the perspective locked in the third-person, too. These kinds of presentational issues really work against a title that has the feel done pretty well. Really, Ghost Recon 2 isn't going to appeal to many people. Longtime fans of the series will hate this game for its changes, action buffs will dismiss it in favor of a multitude of other titles, and online fanatics will snicker at its lacking competitive and cooperative modes. Only a small group of diehards will appreciate this. Should you be one of those people, rent Ghost Recon 2 and see.", "date": "Dec 2, 2004"}