{"name": "Alexander", "name_review": "Alexander", "ref": "https://www.ign.com/articles/2004/12/02/alexander", "text": "In what is sure to be the first of many Alexander the Great-themed strategy games, Ubisoft and Ukrainian developer GSC Games have just released Alexander. In addition to being the first out of the gate, Alexander also enjoys the distinction of having loads of footage from Oliver Stone's Alexander. Whatever your opinion of the movie itself, including tons of footage and music from the films definitely helps the presentation of the game and ties the missions together.  The fifteen missions of the Alexander campaign run through the entirety of his military career. It starts with him putting down revolts at home and ends with him leading his armies back to Babylon. Along the way you'll fight the key battles, like Issus and Gaugamela, and even have missions where you visit Troy and the Egyptian oracles. Once you've spent a few hours completing the Alexander campaign, you'll unlock three new campaigns where you get to fight against Alexander at the head of the Persians, Indians or Egyptians. Each of these three campaigns consists of about half-a-dozen missions each. In addition to these four campaigns, the game also includes a handful of single, scripted missions, a skirmish mode and multiplayer.  You can complete most of the campaign missions in less than ten minutes. I fought and won the battle of Gaugamela in about three-and-a-half minutes. Talk about an anti-climax. There is a good range of scales in the missions. Sometimes Alexander is leading a few units of infantry in search of a lost relic. In other cases, Alexander will find himself at the head of thousands of units. Though the skirmish and multiplayer modes include traditional base-building and resource elements, most of the campaign missions are free of such restraints, letting you focus instead on leading your forces in battle.   But of all the games that have been built on the Cossacks model, Alexander is probably the least tactical. I've won every large battle simply by lassoing all my units and sending them right at the enemy line. (Gaugamela in less than four minutes!?!) Considerations of flanking, misdirection or appropriate unit match-ups seem totally unnecessary here. That's great because it frees you up to hold your faster-moving healers and siege engines from outdistancing the forces that protect them.  Though you can set the density and facing of unit formations, there's no real reward for caring about these issues. I've even seen formations of mine march through enemies before wheeling around to attack them in the rear. In any case, once your units engage the enemy, the forces simply mash together in a large clump at which point further tactical maneuvering is simply impossible. While that's fairly accurate, the tendency of units to break formation completely when making an attack seems wrong.  This is more of a problem in the large, open-field battles but it's not as noticeable when you're fighting in narrow city streets. Alexander offers both types of fights, switching from large battles with little terrain considerations to fights in the same sorts of channels and halls that have been the mainstay of RTS games since the first Command and Conquer.  Luckily, the units' AI seems to know how to get around areas of the map that are still covered by the fog of war. Simply click on an objective located deep in unknown territory and your units will head straight through the labyrinth of corridors and bridges that lead there. This would make sense if the path actually led straight to the objective but on some of the maps, your units will have unnatural knowledge that they'll first need to use hidden passes and crossings that lie in the opposite direction.      On the subject of pathfinding, it's sometimes hard to know why some of your units are or aren't moving. The generals are particularly susceptible to this. Sometime Alexander refuses to attack an enemy despite repeated clicking. Other times he seems to wander off all on his own looking for trouble. Some of the generals ride around in chariots and you'll need to be particularly careful with them. Since the chariot is made up of two units, the horses and the chariot itself, you can actually jackknife the whole arrangement effectively freezing that unit for the rest of the mission. It's not a frequent problem but it's still aggravating.  The enemy AI isn't too much of a challenge and seems to be directed almost entirely by mission scripting rather than behavior. In the large battles, enemy units will simply hold their formation until you attack. When the enemy's dealing with smaller groups of units, they'll sometimes wander around but seem unable to retreat or outmaneuver your forces.  The graphics are probably the best part of the game. GSC Games has always put a lot of life and detail into their environments and Alexander is no exception. Trees sway in the breeze and banners flutter as your units march down cobblestone streets. The units even cast strong shadows that add further to the realism. The buildings are very detailed, from large Eastern-style temples to modest camp tents. Sadly, it's hard to tell the difference between the buildings. This is particularly inconvenient when you're tasked with marching into an enemy camp and destroying the barracks and stables. The units tend to look a little blurry in the cutscene close-ups, but beyond that the graphics are very well done.    The size of the battles can sometimes become a liability in terms of performance. In the larger fights you can count on the frames per second dropping below ten. If you switch to the wider overhead view, you can actually count the individual frames themselves. It's a real shame, because the larger battles definitely fit the subject matter. They're just too much of a burden on the PC.  The sound isn't as great. The dialogue is very stilted and artificial, both in terms of the writing and the performance. While the impact of the sounds of battle is initially impressive, after a few big fights, they'll start to seem too repetitive. Grunt, grunt, clang, whinny, clang! When you have large forces fighting together, the sounds seem to cycle a bit too regularly; it just winds up sounding like a two-second loop repeated over and over again. The battle sounds also unfortunately overwhelm the stirring musical score. A dynamic change of volume or intensity would definitely bring the music up a bit and give it the attention it deserves. I had to double-check the box to make sure this game wasn't based on Alexander the Ordinary. Though you have to expect that a successful game developer will use previous games as the base on which to build new ideas, Alexander seems too much like Cossacks in Macedonian clothing. The result is a much too traditional and predictable real-time strategy game.Alexander only stands out thanks to the movie tie-in aspect but if you care more about the gameplay than seeing Colin Farrell in a dusty, blood-stained cuirass, there are definitely better games that will give you your ancient strategy fix.", "date": "Dec 2, 2004"}