{"name": "World Championship Poker", "name_review": "World Championship Poker", "ref": "https://www.ign.com/articles/2004/12/02/world-championship-poker-3", "text": "Do not purchase World Championship Poker to hone fledgling hold 'em or crazy pineapple skills. It'd be better to wildly throw your money into the air hoping it lands in your pocket. While Howard ~The Professor~ Lederer, the most pleasantly serious and consistently professional player in the world, seems to be endorsing the product, his welcome insight is limited to ten minutes of instructional video that outlines a few basic tells. Howard teases us with this snippet of his own ~Secrets Of~ video set, but everything else about World Championship will make a man right stupid, right quick. Solo gameplay actually kills brain cells. It's as simple as that. It's one thing to misstep on your way up the mountain of poker stardom, especially on the first try, but to dive off the peak slamming your face into each and every boulder from summit to base... I mean... How? Why?  I'm playing a limit tournament on professional. The levels are 40 - 80, which makes for 20 - 40 blinds. It's a six person table (as that's the maximum here). Remember, limit poker and ~professional~ AI.  A computer character named Brenton is on the small blind. I'm big. In the hole I show an Ace of hearts and a 9 of hearts. Everyone folds around to Brennan who with a raise. I re-raise. He re-raises. I wonder what the computer is capable of, so I re-raise again. He re-raises once more and I call, worriedly.    The flop comes Queen of diamonds, Ace of spades, 9 of spades. Brennan checks it to me. My top and bottom two-pair looks good, but I worry about a set given the heavy pre-flop betting. But is Brennan smart enough to check-raise? Probably not. I bet; Brennan calls.  I Still Have a Chance!  The turn comes a 2 of hearts. The board now shows Queen of diamonds, Ace of spades, 9 of spades, and 2 of hearts. Once again, Brennan checks. My two-pair is either still very good or still very bad. Given that I was not raised on the flop, I believe I'm in the lead and bet again hoping for a call. Brennan calls.   The river comes 9 of clubs. This gives me a boat: 9s full of Aces. Brennan checks. I have $10 left in this tournament and he checked it to me. I have 10 freaking dollars left and he checked when the pot is now well over $500. Win or lose, it's simple math that Brennan is missing. He should have made an unconscious bet that had to be made and yet he somehow managed to miss the committed point. So I bet my last 10 into the check happy computer and get a predictable call. The cards go face up...   Brennan was sitting on an Ace of clubs and a Queen of clubs. That's top two-pair. He raised and re-raised and re-raised and re-raised pre-flop, and when he had the best hand on the flop and the turn, he called it down, giving me the opportunity to suck out. Brennan was apparently in the process of having a lobotomy while he was playing.   Crazy plays like this are all over the place. What's especially annoying is how three or four players will fold on every single hand, regardless of position in the tournament. If four do fold, it's an absolute guarantee that the person directly to the player's right will bet / call just to ensure action. It's painfully predictable. And the entire time the announcer is spouting out vocalized death like, ~He's not intimidated. This is his game -- heads-up poker.~ I hear that again when three people are in a hand and someone is going to die. And still the play goes on.  Post-flop, the AI blindly calls, blindly raises ten thousand dollars into a pot of $200, or passively checks hands down. Even if he made quads, Brennan would check the button on fifth street. It's like playing cards with a timid Monarch who only understands three numbers: 0, 1, and a whole stupid damned lot. He's incompetent and he has money to burn. What? You have Aces and the computer has an unsuited Queen / 2? Just bet a million dollars into a four dollar pot and if he / she is sitting on your right, you'll get a call. The only way I ever lose an offline game is if I get burned by a couple running cards or some wacky live 3 that hits on the river.  Once I was heads-up in a big tournament -- my chips even with my only remaining AI competitor. I bet a paltry hundred into the pot with an Ace and a Queen and got re-raised all-in. It was something like 25,000. 25,000! I call. The computer shows a Queen and a 3, unsuited. Heads-up play is supposed to be loose, but that play of his was ridiculous. I now have him dominated to three live cards. I thought it was all idiocy until the 3 hit. Yikes.      So the solo game is worthless. Argue as much as you like about how it's a first go and only $20 and I'll argue about how it's not worth five. Thankfully, WCP offers more than just 12 pointless offline poker games. It also offers online play.  Before getting online, you'll want to create a character. This is where WCP shines. Its character creation tool is in-depth and allows for the birth of some genuine freaks. I'm personally proud of ~Teh Roy,~ an Irish killer who looks like the illegitimate child of Larry David and Patrick Stewart. But right now I use ~Star Fug,~ the result of a pig crapping out a large apish boy as he's being hit in the face with a rolling pin. While Teh Roy sat idle, Star Fug made about 20 grand in online play today. Star Fug likes!  The benefit to playing online is an experience more akin to real poker than any offline game can offer. WCP also supports a USB headset, a USB keyboard, and even the EyeToy. While the voice can be garbled, it's usually timely and the keyboard works well. The only real problem is the EyeToy, which can cause some rather serious lag issues; the instruction manual even indicates that it may take ~several minutes for streaming video to appear for every player.~ What the manual neglects to say is that during these minutes, it's possible for the game to stall.  That's the beginning of a great deal of simple presentational issues that went unresolved. The most grievous offense is the lack of a user defined clock, be it automatic or manually turned on. If I could shout, ~Time, idiot!~ into the faces of the hapless morons who consistently throw money my way, I might be a lot happier about winning. Without a foreman to keep things moving, at least three minutes for every player can start to add up. Watching some dude in Oregon smoke and talk on the phone courtesy of the EyeToy is cool and all, but I'd prefer he got with the damn program and started making bets.  Star Fug Dominates  The next problem is not being able to kick people off a table for consistently abusing the unspoken time rule. After that I found the server sorting tool to be of less worth than a shower mounted toaster. It claims to be sorting by game type and limit and some other crap, but it really doesn't do anything, save for lie. And why isn't there a simple audio prompt when it's my turn? You know, I actually wouldn't need a noise if I could just mark a check/fold in-turn option. Whoops! That's not there either.  But then WCP is online and there is always some fun to be had starting a sit and go and just having at it. It is possible to never lose fake money, since the client-side saving allows a player to quit and reset his or her online tracker, but the fun is still there. Organized free-rolls, rankings, and sponsored tournaments would be nice (as would the ability to bet real money), but that's just not going to happen this year.  If you're familiar with play money games you'll understand the haphazard betting, as you will the satisfaction of hitting a nut flush to crush a cute set of tens. Doing this while staring at a pixilated image of a man across the Internet who swears more than he plays is pretty damn neat, but probably only because it's something that can't actually happen at a place like The Bellagio, even if it always seems to happen at Binions. Har!Look, if you have access to any sort of online poker (Paradise, Party, etcetera), you shouldn't care about WCP, at least not enough to invest currency and a car ride into picking it up at the store. If, however, you are browsing IGN on some kind of sophisticated abacus, or just like the idea of watching a man eat a sandwich as he neglects his game, you'll love WCP.It's the best poker game on PS2, but it doesn't measure up to current standards. Its problems are many and the singleplayer game is four steps below worthless, but the online game, for however much it may malfunction, offers a great deal of enjoyment. If you thought I just trashed this title and am now copping out to a modest 6.5 score, remember that the last poker title on PS2 earned a deserved 1.0. WCP tries a lot more, and for that I am exactly 5.5 more points grateful. Now it just needs to try a little harder.", "date": "Dec 2, 2004"}