{"name": "Robocop", "name_review": "Robocop", "ref": "https://www.ign.com/articles/2004/12/04/robocop", "text": "Part science fiction and part merciless social satire, ~Robocop~ was one of the seminal films of the 1980s and perhaps the greatest movie that director Paul Verhoven has ever made. Thanks to its hero, a cyborg cop with armor plating and a pistol that shoots through subways, the source material is perfect for video games. However, most vids based on the metal exploits of a cop they once called Murphy have been mediocre at best, save for the original Data East arcade game.   Digital Bridges' Robocop following the side-scrolling action formula of that game, which is probably why it succeeds so well. The game places you in the ~skin~ of Robocop, a gunned-down officer reborn as a cybernetic hero of the streets. But more so than being a well-made action game, Robocop shows respect for its namesake. The game includes several assets from the films, such as the plastic news team that delivers the worst news with plastered smiles and it plays a few bars from the movie's theme.   Robocop starts out on the streets of Old Detroit. Before Robo can zero in on OCP, he (it?) must clean up the crumbling city. Members of Clarence Boddiger's gang are much more plentiful in the game, but are just as well-armed. Thugs will shoots at Robo with flamethrowers, hang out of second-story windows and pepper him with pistols, or hide behind crates with machineguns. You can shoot straight ahead, or use number buttons to fire diagonally at enemies above you. Sometimes you must shoot away crates to get the perfect shot. And no action game would be complete without exploding barrels that can kill multiple bad guys at once.   Just like the movie had a little something to say about police brutality, Robocop lets players choose whether or not to arrest surrendering thugs or mow them down without a second thought. (Of course, because you often lay on the trigger several times to drop a prep, you can sometimes accidentally kill a surrendering thug that throws his hands up seconds before your last shot hits his chest.) Arresting thugs is worth more points than killing them, but there isn't a huge incentive to get a high score. The goal is to survive.   Robo benefits from picking up power-ups of his own, including bigger weapons that offer greater shot frequencies. And should you take a beating from Boddiger's minions, you can rescue hostages that reward you with a jar of baby food. (Apparently, every captive woman in Old Detroit just delivered two months ago.) You can also snag cash and stolen jewels for extra points.   And, yes, the ED-209 does make an appearance. The bi-ped 'bot with a bad, bad attitude tries to stop Robo for completing his mission. The ED-209 is probably as much an icon of eighties cinema as Jeff Spicoli, and you cannot help but smile when you see it walk on-screen. Of course, you'll stop smiling as soon as it opens fire at you.   Robocop looks like a good NES game. The sprites are drawn with good detail, especially Robocop and the ED-209. Basic thugs are slight variations on each other, but they look imposing enough. The backdrops are detailed with old Detroit looking like the hellhole it was in the movie and the old steel plant evokes memories of that final showdown with Boddiger.~Guns, guns, guns! Come on, Sal. The Tigers are laying tonight. I never miss a game.~If you know that line by heart -- and a few other choice Boddiger-isms -- than Robocop is a must-download. It's a solid action game with a decent amount of difficulty. And fans will probably replay the game at least once to repeat that showdown with the ED-209. I was really impressed by the visual style and how everything looked just right, and was surprised by how much the theme music evokes the visceral feeling of the movie. Download it today.", "date": "Dec 4, 2004"}