{"name": "Lemony Snicket's A Series of Unfortunate Events", "name_review": "Lemony Snicket's A Series of Unfortunate Events", "ref": "https://www.ign.com/articles/2004/12/07/lemony-snickets-a-series-of-unfortunate-events", "text": "I've always been a little sick. Though I'd never admit this to anyone but you, I'm the type of guy who stands next to the subway track and ruminates about how easy it would be to push someone in front of an oncoming train. I blame my dad for exposing me to the cartoons of Charles Addams and Edward Gorey at too tender an age. Lucky for me, an entirely new generation of children are being similarly warped by Lemony Snicket's A Series of Unfortunate Events. The massively popular book series is soon to be a major motion picture and, as if to complete the holy trinity of cross marketing, the kind folks at Activision have just released a video game inspired by the franchise.  For those who don't know, these are very dark books. After the fiery death of their parents, the three Baudelaire children have been sent to live with their uncle, the wicked Count Olaf. The count seems to have his eyes on the children's inheritance and it's up to the three of them -- Violet, Klaus and Sunny -- to thwart their uncle and his cronies. The dark humor and menacing atmosphere that runs through the books (and makes them such a nice antidote to The Babysitter Club) is preserved in the game.  If not entirely unfortunate, the gameplay here is a series of at least unremarkable events, ranging from collection tasks to jumping puzzles. Since this is a game aimed more at kids, the mental challenges are fairly light and a little pedestrian. This is a game that tasks players with looking for onions, remembering the alphabet (well, the first five letters at least) and recognizing colors. Even in the rare cases where you'll have to acquire a number of items to make it past a certain obstacle, Violet seems to know right off the bat just what types of items she'll need for her next MacGuyver-inspired machine.  It's really cool that a small card at the top of the screen shows which items you've collected and which ones are still missing but I hardly think it was necessary to add a little sparkle to each of these items in the environment. For the most part, every thing you need for the challenge in front of you can be found within a few rooms of the challenge itself. I guess the younger crowd could use that extra help but it seems superfluous to me.  The transitions from one character to another are taken completely out of your hands here. The game will switch from Klaus to Violet to Sunny based on pre-scripted triggers. Some multiple path puzzles would definitely have increased the interest level here. Since the decision is taken completely out of your hands, you start to feel that the game is leading you around rather than letting your explore.  One of the biggest slip-ups in terms of the licensing is that the experiences for all of the characters are completely interchangeable. Klaus's bookish tendencies are reduced to looking for books in a library, otherwise his sequences aren't any more cerebral than Violet's or Sunny's. Jump, smash, grab. That's about all there is to do here. Even Sunny's slightly different mechanic (replace ~smash~ with ~bite~ in the previous description) doesn't do nearly enough to differentiate her from the others. The only difference between her and her older siblings is that she can fit into tiny areas. Why things are structured like this is a mystery, particularly since the console versions of the game use Sunny in some interesting platforming sequences.  Without any gamepad support, the keyboard movement controls can seem a little clunky. It's not too big a deal but there are more than a few balance beam sequences that would have been much easier with a gamepad. In any case, there aren't too many controls in this game. Apart from your movement controls, the only options you have are ~use~ and ~jump.~ Fortunately, ~use~ covers a wide variety of tasks, from opening doors to activating levers and buttons to lobbing projectiles at your enemies. Given the third-person perspective, you can sometimes find your character's head is obscuring the object you want to manipulate. Some better camera work could definitely have smoothed out this aggravation.  The graphics are damn fine. The overall atmosphere of the world comes through beautifully -- which is to say, dismally. You can see nearly every depressing detail in the world, from rips in the felt of the pool table, to stains in the bottom of the kitchen sink. The art direction is really well done here. The characters are also great with loads of detail and (almost) believable animations. I liked the fire effects that were used in the game but I wonder why the same attention wasn't paid to the lobber and bug spray effects. When you launch bubble gum at enemies or shoot poisonous gas at giant flies, the effect is very cartoony.  The musical score, which echoes Danny Elfman (and presumably Thomas Newman's score for the upcoming film) fits and even enhances the mood wonderfully. In terms of voice work, Tim Curry steals the show as the narrator. He delivers the lines with the dry wit that the role requires. The competition in terms of dialogue isn't too tough though. Jim Carrey turns in a decent performance but he, along with the actors playing Violet and Klaus, seem a bit too subdued, almost as if they're on Quaaludes. (Don't do drugs.) Sound effects are somewhat better and more consistent. The atmospheric impact of dripping water or rumbling weather definitely enhances the game's believability. This is the second time Activision has taken a successful console game based on a popular movie license and pretty much wrecked it in the translation to the PC. It's not that I think the console version of Lemony Snicket is all that great, mind you, but it is definitely better than the PC version.In either case, Lemony Snicket is clearly a game for children. Older gamers will find the gameplay too one-dimensional and the solutions to each challenge far too obvious. The graphics and overall atmosphere definitely put this game at the head of the pack for the target audience but we'd suggest getting the console version wherever possible.", "date": "Dec 7, 2004"}