{"name": "Worms Forts Under Siege", "name_review": "Worms Forts: Under Siege", "ref": "https://www.ign.com/articles/2004/12/09/worms-forts-under-siege-5", "text": "Good old Team17. For years now they've brought us joy in the form of those combative little belly-crawlers, the Worms. After the last game's jump to 3D, Team17 is back with another innovation for the series -- base building. It makes sense that Team17 decided to revolutionize the gameplay yet again. A new title that only refined the core principles and smoothed out some of the problems from the jump to 3D would hardly be a must-buy for Worms fans. Unfortunately, the new additions detract from the basic appeal of the Worms design. Worse still, some of the problems that 3D graphics caused are still here.  The turn-based nature of the game has been wedded to a real-time clock. Each worm on your side (you can have up to four) has one minute in which to take his actions for the turn. These include moving around, building structures and firing weapons. Having this real time element keeps you on the ball certainly but it makes Worms Forts more of an action game than a strategy game.  In adding the forts to Worms, Team17 has introduced a base-building model that borrows from more traditional real-time strategy games. Your worms will now have to build forts and towers on the map. These towers and forts offer up new weapons and serve as platforms to launch attacks. Additional buildings give you even more options. The hospital allows you to respawn dead worms while the science building lets your weapons do increased damage. Each of your buildings must be attached to your initial starting building through a series of walls which are automatically built when you place your buildings.   While I dig the idea of creating the buildings, it tends to de-emphasize the attacks in the game.  You wind up playing a much more conservative game, hoping to win battles by attrition rather than a mad dash. One interesting aspect to the design is that if you take out a building, it also destroys any buildings that used the destroyed building to connect to your keep. This mechanics means that building structures in a straight line is pretty foolish. For me, the creation of forts hardly makes up for the lack of destructible terrain, one of the series key features until the switch to 3D rendered it impractical.  As always, the series derives much of its humor and personality through its weapons. My favorite weapon has to be the catapult-launched Exploding Refrigerator that scatters frozen ferrets that explode near the area of impact. The Chili Con Carnage weapon and the napalm-dropping giant are definitely close seconds. In all there's a very wide variety of weapons here and you're not likely to grow tired of any particular one. There are even some god powers you can invoke. The giant flood causes the waters to rise around the island, suffocating and killing any worms that haven't reached high ground.  The only problem with the weapons is that the aiming is a little unintuitive. There are so many weapons here that you'll find yourself struggling to get used to the arc and power needed to score hits. Switching from the mortar to the bazooka to hand-thrown grenades requires a bit of a mental shifting of gears. Likewise, trying to steer around the exploding grandmas, giant chicks and rhinos requires a bit of getting used to. Since the number of each weapon you can use is limited, you don't have the luxury of trying to get the hang of things.  Maneuvering your worms around the battlefield requires some getting used to as well. Though the basics are simple enough, you'll find that the backwards motion associated with the default double-jump will take some getting used to. Since you can steer the direction of this jump before you take off, it seems stupid that it works like this. Worms are also likely to get hung up on corners of objects as they move around the environment. This can be aggravating if you're running short on time and need to reach a specific area in a hurry. The sometimes sluggish camera can make this even more of an issue.      The learning curve for the game is fairly low but the overly tiresome tutorial is a necessity to figure out just what in the hell is going on. The final mission for the tutorial is a real killer. Instead of just letting you try out some weapons and get the hang of what the different structures do, the game places you in a massive fight that taxes your patience more than your tactics. This becomes a problem in the actual game missions as well with lots of downtime between rounds.  Beyond the first couple, the actual campaign missions take a while to complete as well. Sometimes you'll play a mission with an eye towards figuring out what you need to do to lose before relaunching it and trying like hell to avoid taking the wrong route (or taking too long to take the right route.) There are a number of campaign missions here, set in a variety of locales. Some interesting one-off missions are also included for those of you with low attention spans. Multiplayer is also included but you're not likely to find too many opponents. As always the series is better in hot seat mode where you can actually taunt your opponent face to face.  Worms has always been known for charmingly cartoonish graphics. The move to 3D tended to spoil this quality, but there's no denying that the worm models are still very appealing and the animations have a lot of life to them. Again, the weapon effects are the best aspect of the graphics. Seeing a giant, yellow chick waddle around before finally exploding amid your annelid enemies is a real treat.  The environment design suffers a bit more than the character models. The design of the environment is just too blocky and the seams between the objects are too sharp. This is really apparent when you look at the place where the water meets the land. The overall style of the different environments is very distinct and helps to give a different character to each of the map types. The lighting effects (or the appearance of the effect of lighting) seem a little muddy and spoil the otherwise fine textures.    As a final note, our North American readers won't be able to find this game on shelves. There simply aren't any plans to release it through traditional retail channels yet. Though European gamers can go pick it up in stores, gamers here in the States and Provinces (or whatever the hell Canadians call states) will have to buy the game online and download it. Team17 should be commended for taking a chance with Worms Forts: Under Siege. Unfortunately the chances that were taken and the sacrifices made leave Worms Forts feeling very uninspired, particularly when compared with the other games in the series. The base-building mechanic isn't a terrible idea in itself. The way it's implemented however limits your freedom of action and has you focusing more on grabbing crates and erecting towers than on actually fighting the opposition.", "date": "Dec 9, 2004"}