{"name": "Return Fire 2", "name_review": "Return Fire 2", "ref": "https://www.ign.com/articles/1998/11/03/return-fire-2", "text": "The original Return Fire was one of those games that helped break down some of the barriers between hardcore action and strategy gamers. Now, the team at Rip Cord has done it all over again with Return Fire 2 -- a game which sticks to the same simple principles as the original, but does it in a way that's even more likely to widen the appeal of the genre. Featuring more than 30 new maps (each with a considerable amount of geography to cover), a shiny new 3D engine, and new vehicles to control, Return Fire 2 goes places the original never dreamed of.   Despite the many improvements, Return Fire 2 boasts the same simple gameplay as the original. In fact, most of you have been playing this game in one form or another since first grade. The game is capture the flag, and although it will require a strong sense of strategy, quick thinking, and a lot of firepower to capture the flag in Return Fire 2, that simple goal remains your final objective.  Compared to the deliberately understated graphics of the original, Return Fire 2 is a visual knockout. Lush green hills, crystal clear ocean waters, and detailed structures and vehicles all contribute to the new look and feel of the game. Also seeing a big improvement are the special effects graphics like the explosion of an enemy tank or the smoke trails of an outgoing missile. All this added realism goes a long way to draw the player into the action and increase the urgency of the gameplay. It also makes a big difference that, this time around, players are invited to experience the action in a first person or ground-level perspective which only intensifies the battles that much more.  Further adding to the appeal of the game is a variety of multi-player options. From 16-player Internet and LAN play to four-player split-screen action on one computer, this is a game that screams to be played against friends. Fortunately, the one-player mode, although strangely difficult to get to via the clunky game interface, is nearly as rewarding as a giant multi-player match, and features a challenging foe in the computer opponent.  Every once in a while a developer happens upon a gameplay idea that's so easy it just can't go wrong. Such is the case with the Return Fire series. About the only places the game stumbles at all are in its awkward user interface, which will have you searching through unnecessary options just trying to get into the game, and the in-game control, which can be a little unfriendly at times.  If you never played the original, you owe it to yourself to jump on board now and experience a game which is at once different from anything else you've every played and yet strangely familiar and comfortable from the very start. If you're already a fan of the original then expect even bigger challenges with huge new maps, cool vehicles, and an extremely flattering face-lift.  -- Patrick Baggatta", "date": "Nov 3, 1998"}