{"name": "It's Mr. Pants", "name_review": "It's Mr. Pants", "ref": "https://www.ign.com/articles/2004/12/11/its-mr-pants-2", "text": "is a concept that began as a Donkey Kong licensed puzzle game back in 2001 called Coconut Crackers. Between then and now, good ol' DK had been ousted in favor of an occasional Rareware favorite, Mr. Pants, an oblong scribbleman wearing nothing but a bowler cap and a set of red underbriefs. How can you have this guy headline a game and try to take it seriously? Answer: you can't. And Rare takes every opportunity to be as weird and creative in the presentation as it can. Substances were most likely consumed in the board room during the company's pitch for the game, but you know, it's this tripped-out exhibition that gives It's Mr. Pants a unique personality that shouldn't be missed.  Games like Tetris Denki Blocks and a bazillion other puzzle games have a perfect home on the Game Boy Advance because of their engrossing, quick-shot style of design. Its Mr. Pants offers its own take on the whole ~rotating tile~ puzzle genre popularized by Tetris with a design that feels decidedly ~non-Tetris~ as a result. The concept is simple: place colored tiles on a playing field and attempt to form squares or rectangles of at two by three bricks big...removing them from play in the process. Colored tiles can be placed on blank spaces on the grid, or on other colors, or both...but not on top of the same color. The mechanic of placing different colors on top of other colors is the key to It's Mr. Pants' design, and without learning how to use tiles to cut large blocks in half, you won't get very far at all in the game.  This puzzle design is used in several modes of play. In one mode, players have a finite amount of tiles to remove a specific structure from the grid. This gameplay option is It's Mr. Pants' main option, and it's definitely one hell of a challenge deeper in the structure. It's pretty well designed overall, though the limitation of only seeing the next two tiles is not a very convenient idea. The task is to use all the specific tiles to clear the board, so not having the ability to see every tile in your hand is a little unfair. The second mode, Wipeout, takes this idea and puts it in a rapid-paced two minute challenge of cleaning up a random assortment of little tiles. Marathon mode is a classic style design of placing and removing tiles in a five-minute shot, trying to score as many points as possible within that time. The extra incentive of a ~scribble~ working around the edge of the screen, ultimately shrinking the playfield as time ticks off the clock, adds just a little more urgency to the action.    The game is a cool puzzle design, sure, but it honestly plays second fiddle to the real reason to play it: the overall strangeness infused throughout the cartridge. Graphics are crudely drawn and animated in a scribble fashion, even to the point where the handdrawn game grid itself doesn't even have a straight line. It's sort of a GBA version of the ~Dr. Katz~ style, and it works extremely well to give the game its own look and feel. Perhaps we're swayed by the Rare influence, but in all honesty we'd love to see more developers taking a real leap of faith in their game titles to present something that's not exactly of the normal videogame persuasion.  But even though the designers obviously poured a lot of its effort into making the game as weird and unique as they could, they didn't forget the essentials necessary for a successful puzzle design. There's no multiplayer, unfortunately, but the cartridge save records top scores, hidden unlockables, and other data that encourages constant playtime. At the very least, you have to hand it to Rare and THQ for trying something...uh, different. It's Mr.Pants is nothing but an original tile-based puzzle game for the Game Boy Advance, something any game developer could produce in a short amount of time on the handheld. But it's the bold and basic direction that really makes the experience something completely unique on the GBA platform. It's a simple concept that works on many levels, and Rare takes this idea as far as it can with a deep and addictive GBA presentation that's as challenging as it is wacky. Not many game designers can get away with filling the screen with a bunch of colored underpants every five seconds, but Rare does it in style.", "date": "Dec 11, 2004"}