{"name": "Rosco McQueen", "name_review": "Rosco McQueen Firefighter Extreme", "ref": "https://www.ign.com/articles/1998/11/03/rosco-mcqueen-firefighter-extreme", "text": "Wow. Psygnosis really has branched out for this winter holiday. The company is covering all of its bases: Colony Wars: Vengeance, F1, Lemmings, and now its under 12 kiddy game, Roscoe McQueen. What a load.  And what a strategy. Rosco is a fire-fighting game for parents and kids around 10, who want to play something safe and simple, something inoffensive and that may make a good babysitter. This fits right in with Sony's own strategy to release winter holiday games for the predominantly owned Nintendo 64 market.   As you may have suspected, Rosco is a cartoonish Tom Slick lookalike (avec big chin, curly blond locks, and a perfect figure) who is a one-man fire-fighting squad. Team? Who needs a stinking team when you've got the ultimate fire-fighting extreme! Oh yeah! Woooo-hoooo! Eh-hem...Anyway, In the third-person perspective, you can handle axes, ~super axes,~ and throwing axes, as well as fire hoses to clean out the wretched robots who have taken over and set fire to a large set of Chinese laundry houses. You must destroy all of the bots, collect water and food, and save all of the clone-like Chinese women who appear to own only three actions, screaming and jumping up and down, and bowing in thanks for their savior.  Rosco can switch weapons quite easily, and he can jump up for power-ups to access new rooms as well. He will also have to watch for bigger, more dangerous bots, people trapped in high places, steaming laundry machines, as well as find electric fuse boxes, and newer areas to clean out and water down. The faster he cleans out and makes safe these areas, the more people he saves, and the more points he gets.  Rosco is a one-player game that is fully polygonal, texture-mapped, and has decent control, with side-stepping and climbing features. The game does not support analog or support dual shock, but does come with three difficulty levels (easy, medium, and hard).Rosco McQueen is a kiddy game. Period. For any hard core gamer, you're looking at a one- to two-hour experience and a whole lot of repetition in both gameplay and musical themes, and you'll be pissed off to have bought this loony little clanker. If you're a parent who wants a safe game for your kid, get this game. It's decent fun, it's relatively cute and easy to play. But it's not a real thinking kid's game. If you're anyone else, don't make the mistake of thinking that this game is Psygnosis' answer to Sega's Burning Rangers. 'Cause it ain't. In fact, the game suffers from severe redundancy, really bad muzak that's an insufferable mixture of funk-jazz-elevator, and it's mindless. What's more, while you may not want to have your kid exposed to heads being blown off and bloody Mortal Kombat gore, this game makes some serious stereotype faux pas. This game makes the assumption that laundry houses are filled with helpless, vulnerable Chinese women who all look alike. Hmm...", "date": "Nov 3, 1998"}