{"name": "Zoids: Battle Legends", "name_review": "Zoids: Battle Legends", "ref": "https://www.ign.com/articles/2004/12/14/zoids-battle-legends", "text": "Just about every gamer appreciates giant robots. They loom 20 stories high and boast unholy weaponry. They can level city blocks with ease. Best of all, they make for truly wicked video games and entertaining television shows. One such show, an anime called Zoids, features mecha fashioned after animals and dinosaurs. Those unfamiliar with the series needn't fear. It tackles the same issues as other programs featuring robotic dinosaurs, namely, the destruction of public property by nefarious villains and the heroes trying to stop them.    The concept behind Battle Legends is decidedly simplistic. You need to destroy everything that crosses your path. Straightforward and none too fancy, but there's nothing wrong with that. The game splits between several modes, including Mission Mode, Zoids Battle, VS Mode and Zoids Fist. The Zoids Battle and VS Mode play out in typical fashion: two Zoids battle for supremacy in 14 different stages. Zoids Fist, on the other hand, is a little different in that you fight in confined spaces, where the wrong step can send your Zoid plummeting to its death.    Mission Mode pits you against enemy Zoids in a string of missions, with each mission connected by static cutscenes that push the narrative. These cutscenes do little to convey any kind of depth to the characters of the show, but wind up feeling mildly refreshing anyway, if only because they break up the fighting (which can be wildly difficult at times.) The story, like the basic premise of the game, is very simple. You can choose to play from two different angles: Empire or Republic. In the Republic campaign, you play a young man named Shomo, who sets out in search of the Blue Unicorn Team, a group of Zoids pilots gone missing.   On the Empire side of things, you'll start as Kouki, a young Imperial officer hunting for Republic supporters. You won't be restricted to one character. You can play as one of several throughout the game. Battle Legends features a cast of 17 personalities from the show, each with varying attributes such as combat skill, maneuvering skill and weapon skill. Each attribute enhances the base set of skills for a given Zoid, so you need to choose the right combination of pilot and vehicle.      Unfortunately, finding the right pilot for the right vehicle is never enough. Sloppy control and a vile camera system keep you from succeeding in battle. Battle Legends employs a strange lock-on system that only seems to work half of the time. In theory, pressing the right shoulder button on the controller should target the nearest enemy. This usually doesn't work to your advantage. You can have an enemy blasting your face with lasers a mere two feet away, only to have the camera lock on to an enemy 20 feet behind you. Not cool at all.   Considering that Battle Legends features tough fights, especially in Mission Mode, the wonky lock-on system causes a player to experience premature death quite often. Add the fact that Zoidz can't run backwards (a necessity in mech games of any class) and you have the makings for one spectacularly frustrating experience. Movement in general feels floaty and unresponsive. The slightest movement of the thumbstick sends your Zoid running, virtually eliminating any chances for subtle maneuvers.    The C stick lets you boost to the left or right, and boost backwards. Still, you hardly ever use these maneuvers as most fights end up in close quarters, wrestling-style slug fests where avoiding damage is near impossible, even when trying to boost out of the way. Also, you can't aim while jumping, since your reticule is locked in place just as soon as you leave the ground. Gamers with any reasonable experience playing mech games know how ludicrous this is.      The game also suffers from serious balancing issues. Combining certain Zoids with specific stages can virtually guarantee victory. For example, using the Gun Sniper Zoid to attack the Atak Cat Zoid in the Empire Development base will result in victory for the Gun Sniper every time. All you need to do is jump on a building and launch volley after volley of missiles at the Atak Cat, which cannot jump as high and therefore must run around the ground defenseless. What's more, CPU controlled opponents arbitrarily shoot everything in sight.    It's not uncommon to park your Zoid far away from enemies and watch them blast buildings, rocks and anything else that happens to be in front of them.Since the control scheme won't help you win battles, you'll need to spend time customizing your mech to increase your chances of survival. This is perhaps one of Battle Legend's better features. You can choose from among 100 or so parts, including weapon, armor and shield upgrades. Each Zoid features a different number of slots for upgrades, with bigger Zoids capable of holding the most armament and armor.    You can also choose the color of your Zoid, although options are limited to a handful of pre-made schemes. Graphically, and in terms of sound and music, Battle Legends gets by with the bare minimum. The music sounds generic at best, and graphics look equally uninspired. Movement of each Zoid looks jerky, and none delivers a genuine sense of weight. Shadows look blocky and plain unattractive. Weapon effects, arguably the coolest aspect in any mech game, look weak and fail to deliver any real sense of astonishment Environmental effects such as rain and fog look plain bad, with showers looking more like screen static than anything else.   While Zoids: Battle Legends had the makings of a decent action game, it falls short due to several key issues. For starters, the lock-on system needs serious work. It arbitrarily locks on to enemies behind you when its supposed to focus on the closest enemies, regardless of their position. Movement feels awkward at best, with vehicles lacking any real sense of weight. The main story mode is also maddeningly difficult, even during the earliest of stages. A fact worsened by the bad control. Only recommended for fans of the show with superfluous funds.", "date": "Dec 14, 2004"}