{"name": "Time of Defiance", "name_review": "Time of Defiance Review", "ref": "https://www.ign.com/articles/2005/01/04/time-of-defiance-review", "text": "One of the things I pride myself on is my self-discipline. I consistently exercise, I can say no to food and drink when I've too much of either, and I am never late to appointments. I never go to bed after 11 PM, and I never wake up after 7 AM. Yet with Time of Defiance, I haven't gotten to bed until well past midnight. I can't sleep without worrying about my empire or wondering if I'm under attack. And that's only been the first few days.   Don't get me wrong: ToD is not going to be the Great American MMO. In fact, it probably won't have nearly the success as the great ones like Ultima Online or EverQuest. However, it does do things not seen before in MMOs. And for the most part, it succeeds.    ToD is definitely a different game is many ways. It's an MMO, but there's no character building or questing. It's an RTS, but there's little combat, if you desire, and it focuses on resource collecting. It marries short-term games with long-term dedication. It should appeal more to the tycoon or management fans than anyone else, although almost everyone can find something they like.   The story is pretty dry, not that such things are important in MMOs. Basically, you run a mining empire on a gaseous planet. There are a myriad of rocky islands spread all throughout the map, and you need to mine them of six different resources using a variety of ships.   Initially, you start with a few ships, little money, and one island in the middle of vast emptiness. You'll use your ships to mine enough materials to get a special ship called a Colonizer, which will allow you to build a base on another island. You can mine on any island you want, whether it has a base or not, but you can only create buildings on islands with bases. All islands have limited resources though, which means you'll be on the move quite a bit when you get a large mining fleet up and running.     Throughout every step of your ToD career, you'll be watched by the NPC Eighth House, a sort of governing body that reaps the benefits of all the players' hard-earned work. They are primarily responsible for buying and selling resources, selling special vehicles you may not be able to build, and selling intelligence. That can be anything from the ranking of another player to locations of unclaimed islands in the area.   Access to the Eighth House is allowed via a Quantum Gate. You can buy these Quantum Gates and set them up by any island you own. Ships can instantly travel between gates, provided you can foot the bill to open them. A short-term cost is more than offset by the amount of time you save getting your ships across the map, and as the saying goes, time is money.   That time is the greatest drawback of ToD. Especially on the official games, the starting pace of the game is extremely slow. It's so slow that you may have one action literally every 20 minutes or more. It takes a long time for ships to move from one island to another simply because of how far apart things are spaced, and constructing new buildings could take a half-hour or more if there are delays in getting materials.   ToD is overall very newbie-unfriendly, and the time issue is just part of it. When you first get into things, the amount of information and ship orders you have access to is overwhelming. The vast size of the world doesn't help any, and to make it worse, there is no in-game tutorial. Sure, there are Tips of the Day, but how do I start mining some freakin' coal to fuel my ships? It makes the manual almost a must-read document, which is becoming less popular nowadays. Some of the more complex ideas, such as the Q-Net (which I'll explain in a moment), need an in-game tutorial. The manual just doesn't help; you have to see it in action to understand.   Another problem is the wonky camera controls. Instead of opting for the standard, where putting your cursor on the edge of the screen scrolls it, it has you holding the right mouse button to orbit the camera. This wouldn't be a problem, but right-clicking also orders ships to do something. As it is, you may click a ship, then try rotating the camera, and in the process you'll send the ship somewhere that you didn't mean to. Even though it's practically unfathomable in an RTS anymore, I'd suggest getting rid of the right-click system entirely for orders since a right-click is simply a shortcut for a couple of left-clicks. In a game where resources are this important and every drop of fuel counts, incorrect orders can be real killers.   If you can get through the first twenty hours or so, though, you'll start being able to mentally filter out the information you don't need, and you'll have trained yourself to close the ship windows when rotating the camera. Once the distractions are out of the way, you'll start to understand the underlying complexities of the game rules. That's when the addiction starts, and the fun really picks up. It will still be slow for several more hours, but you'll at least be able to plan ahead. What islands do you want to colonize? What security threats are worth dealing with? What direction should you send your scouts? Should you save up your crystal moss to buy things, or should it go to the ships that need it for fuel? These questions will be running through your head every moment you're playing.   Micromanagement will take up most of your time in the early game. Your ships will automatically mine as much as they can from whatever island you have them stationed at, but you have to decide what to do with your resources. The miners are smart enough to put the resources in silos, but you can disable that option per ship if you have a specific plan in mind. All building choices are yours, as are all choices of what ships to create. The beginning will be full of mentally planning. To paraphrase what another player said to me, ToD is almost a chess game in that you have to think several moves ahead.   Eventually, you'll stop needing ships to do your mining for you. Among the buildings you can buy are resource mines, which, it may go without saying, mine the islands for you. You can also buy Q-Communicators, which will send resources to a Q-Silo on another island. Q-Communicators have a range, but with a string of Q-Communicators and Q-Silos, you can theoretically get resources from one end of the map to the other. Collectively called the Q-Net, this enables you to feed all your resources into a few islands or less, which can then transform all those resources into ships and buildings.   Beyond that, you can set some ships on trading routes. You can order a mining ship, for example, to move to an island and mine for an hour, then go to another island and mine for another, then go to a third island and dump everything off. You can specify how many times you the ship to run its route, or you can just let them do it forever. Between trade routes and the Q-Net, the game becomes about macromanagement, not micromanagement. It's extremely satisfying to see your empire grow, especially if you're into business-type games.    This may sound a bit easy, but the challenge comes in the form of other players. Everyone wants the same thing as you, and the world is only so large. There are no computer empires you'll deal with; everyone you see is another player. That's important, because you can forge alliances and so on, but unlike computer opponents, humans remember what you do. There's no exploiting an alliance system when everyone can think for themselves.   Prior actions are important because the game sports an unusual marriage of short- and long-term play. Official matches only last twenty-eight days. The players with the ten highest scores get League Points, which are listed on the ToD website. After that, the server gets wiped, and the game starts completely over. Of course, the players' memories don't get wiped, and if you stabbed someone in the back last time, don't expect them to ally with you this time.   For gamers who don't want to commit to a 28-day game, there are shorter ones too. The servers for beginners are only 14 days long, but there are also 3- and 7-day games if you really want some action. The shorter games have increased mining and constructing speed, but travel time is still pretty slow.   You're not locked into one type, though. You can only play one 28-day official game at once, but you can play it with any number of other types of games. That means you could try your hand at juggling an official game, a 3-day game, a 7-day game, and two 14-day games all at once. However, just one is complex enough, and trying to deal with more than two at once would be enough to drive anyone insane.     While you're not playing, the game goes on without you. This is a persistent world, and just because you're not babysitting your people doesn't mean they aren't working. They won't get any additional orders, so if you mine out an island, your ships will just sit there doing nothing. That's why it's best to do a quick check to make sure everyone is doing what you want them to do before logging off for the night. All your combative buildings and ships will still defend the realm per your orders, which can be anything from firing on everything to only firing if fired upon.   The nice thing is that you can stay fully informed of what's going on even if you're not logged on. Inside the client is a message system that will hold important messages for you, so when you log back on you can see the major events that happened. Better still, you can set the client to e-mail you whenever certain things happen. I personally have it set to e-mail me when there's a security alert, so if I'm at work and get an e-mail that some dumb rookie invaded my airspace, I'll um take an early lunch. Or a coffee break. Or make some copies.   Combat itself is fairly simplified, which is a plus for those gamers who, like me, could just never get into the Warcrafts and StarCrafts of the world. Your tactical buildings and ships follow particular rules of engagement of your choosing, and will automatically open fire on anything that you deem a threat. However, you probably won't see too much action, as the game is defensively oriented. Attacking is expensive, both in fuel and time, and committing to many or too lengthy offensive actions can run you into the ground in the long run.   There is a much more subtle form of combat, however. You can have Boarding Parties, which are ships that steal other ships. My personal favorite form of sabotage is to get a Scavenger Vessel, which can scrap an enemy ship or building and convert it back to materials. There are so many options that the game can accompany whatever style you prefer, and it's always nice to see that.   War is dangerous not just for the cost, but for the mystery. You can start by attacking the weakest player, but he may be allied with the stronger player. You never know who's friends with who, which makes attacking a risky proposition. However, most players seem willing to talk and negotiate before attacking, so diplomacy should be the first option when a conflict arises. Peace could save both players a lot materials and time.   The odd thing about ToD is that your particular game experience largely depends on how many players are there. With 3500 islands per game, that's plenty to go around if you only have 15 players. But if you've got 50 or 100 players on a server, you can bet that real estate will run out fast, and more people will turn to war to expand. It's the aura of not knowing that really makes the game thrilling, even in the times when it moves the slowest.   Graphics   Homeworld taught us that ships of the future will not be sleek and curvy like science fiction normally portrays, and will instead be the space age equivalent of oil tankers and cargo ships. ToD takes the same view, and as such, the ships and buildings are very blocky and bulky. The appearance works, however, and it makes the game run pretty smoothly.   You're not going to be overwhelmed by anything here. The islands are little more than floating rocks with flat tops, with little color or texture differences between them. Space is extremely empty, and unlike Freelancer, the only thing to really break up the monotony is the sun, a couple moons, and some spotty stars. I suppose the fact that you're on a planet and not in the middle of space makes a difference, but it's still a little bland. Sky changes are limited to colors that change as the sky rises and sets, which are admittedly pretty, but nothing that'll blow you away.   On the other hand, this makes the game run extremely fast. There's no lag at all, although I was never in an extremely busy game. Still, this baby is far from a resource hog, and you can multitask with ease. I'm only on a 1.4 GHz computer with 512 MB RAM with a GeForce 3, and it's easily handling ToD with full graphics options, even though I'm also running MS Word, two IM programs, and a music player simultaneously. It runs at a solid 20-30 FPS at all times, which is really all you need for this type of game.   In a word, you could call the graphics ~serviceable.~ It could be better, but it could certainly be MUCH worse, and it does not detract from the experience at all.   Sounds   The graphics are bland and serviceable, but the sound is downright obnoxious. The opening theme is pretty catchy, but after that you won't hear any music. Your buildings sound like factories, which I suppose is appropriate, but it will grate on your ears after you listen to it for too long. The ships sound like you'd expect them to, but there's no other ambient noise to spice it up. You'll basically either be hearing the grinding of your buildings, the growl of your ships' engines, or absolutely nothing.   It's a shame, because there's little sound for anything else when it's very needed. I'd like to see a way to customize hearing certain sounds for certain events. As it is, you have to keep your eyes glued to the chat window to know when anything happens. You'll hear a sound akin to a phone ring if there's a security alert, and there is a way to set the game to actually talk to you once a building or ship is constructed. However, there is no audible alert when a ship arrives at a destination, or when an island gets mined out, or when a ship runs out of fuel. This isn't so bad in the first 15 hours or so, but once your empire starts having dozens of ships all on different orders, it can be chaotic and downright impossible to keep track of everything at once.As it has been said on IGN and other places, its hard to score an MMO because of different tastes of people. However, I believe this one is much easier to score, because its as far from the swords-and-sorcery RPGs that make up the bulk of MMOs and is less dependant on mobs and leveling up. It really feels more like Trevor Chans Capitalism II in space with guns than anything else. Thats a good thing if youre into that, and very, very bad if youre not.If youre an EverQuest or World of Warcraft player looking for more of the same, stay the heck away from this one. But if youre looking for something different, something more economy based, then Time of Defiance really is for you. Civilization players may like it too. Its certainly a very different MMO than what weve come to expect. Its also very stable, very balanced, very fast, and very addictive after the first 15 to 20 hours. If you have the patience and can just get past that time of slowness, youll experience a game as thrilling and tactically proficient as anything else on the market.", "date": "Jan 4, 2005"}