{"name": "Napoleon 1813", "name_review": "Napoleon 1813", "ref": "https://www.ign.com/articles/1999/12/16/napoleon-1813", "text": "Living as we do in the land of the free -- that's America to you Canadians -- it's hard to come by a decent Napoleonic warfare simulation. It seems like the only 19th century war of any interest to game designers is the American Civil War. Don't get me wrong; I like the Civil War as much as the next guy...well, maybe not as much as Shelby Foote or James McPhereson, but what do you expect? Regardless, the scarcity of Napoleonic wargames is shameful. We've (read: I) have been trying to talk Firaxis into adapting the Gettysburg engine for just such a purpose but to no avail (yet).  That's one of the reasons I was so excited to take a chance with Empire Interactive's latest game, Napoleon 1813. It seemed to offer exactly what I was looking for -- a real-time Napoleonic sim that also happens to be a good strategic and tactical level wargame in its own right. Plus the folks at Empire showed us such a nice time at their press event a few weeks ago. For two weeks now, I've stared at the box on my shelf just waiting for the chance to crack it open and play it. Sadly, games from other publishers -- ones who have a more enlightened opinion of our home state -- were competing for my attention. But the day finally came when I tore into the package and loaded Napoleon 1813 onto my hard drive.  The game recreates the final stages of Napoleon's career. This to me was a shock. The Peninsular Wars, the invasion of Russian and Waterloo are all permanently enshrined in the minds of all historical wargamers. But let's give Empire the benefit of a doubt here. Maybe it's because of the relative anonymity of this chapter of Napoleon's life that it was chosen. While it does contain the largest pre-20th century battle fought on European soil, Leipzig, it is less well known that Waterloo. The period also presents the opposing armies in what may be considered their closest parity. But this is also the dimmest period for Napoleon's tactical acumen. It is a period of extravagance rather than economy of force. Napoleon becomes impatient and seeks battle at every opportunity.  This is my first gripe against the game, although one that's accurate from a historical point of view. Napoleon's strategy here relies more on mass than mobility. Although Napoleon was never all that great a tactician (compared to his strategic and administrative skills), his early battles exhibit much more invention and spontaneity. It was nice to see that the AI in the game models Napoleon's tactics to a small extent. The issue is still occasionally decided by pinpoint artillery attacks and moves against the rear, but on the whole the computer tends to settle things with a forward rush. But once again, this is a trend that may be defended as being historically accurate. It depends on whom you ask.  The game is played on the divisional level that came into fashion during Napoleon's time -- and which he helped popularize. Individual soldiers (1000 of which form one of the game's ~strength points~) are grouped into a division of self-contained combat forces. Divisions may be combined to form corps, corps to form armies and armies to for army groups. The game offers over one hundred different unit types ranging from Old Guard Infantry to Engineers to Horse Artillery. Overall the unit modeling is quite well done. Each unit has a distinct character but an indistinct graphic representation.  Each division is assigned a leader who is rated in each of a dozen performance characteristics. The Initiative rating measures the ability of the subordinate to anticipate and carry out his superior's orders. Staff measures the amount of subordinates a leader can control while Subordination measures the difficulty of controlling each leader. Leaders also have rankings for tactical ability, command radius, aggression and luck. Matching the correct leader to the task at hand is one of the primary challenges facing you in this game. If you need to perform operations far away from your supreme headquarters (Napoleon or the Czar in this case), you'll want to appoint one of your better leaders to command the operation.  The game also models the supply and communication routes that were so integral to the 19th century concept of warfare. You have all sort of opportunities on the strategic map to cut your enemy off from his source of command and supply. Ownership of mountain passes and bridges will allow you to assume control of your opponent's mobility. There are also towns to siege, raid or capture. Each town yields a number of strength points which may be used to build reinforcements for your army.  All the strategic combat takes place against a rather nicely rendered map of Europe. You move your armies and supply trains from one area of the map to the other. This is one of the most well implemented real-time strategy interfaces I've seen lately. As all the movements are handled in real time, you get a better feel for the scales involved. With some turn-based games at this level, it's easy to lose sight of the time element. When you turn the time scale in this game up to ten seconds = 1 day it's a lot easier to get a conception of your actions as they play out over the weeks and months. The game uses the movement arrows that you see in any battle atlas to indicate the direction of your troops. I quickly grew entranced with the geometry of it all and I gotta admit that the game sucked me in.  You can set the game up to arbitrate all of the tactical conflicts on its own. You merely set orders and aggression levels for your units and the computer takes care of the outcome of the individual battles and sieges. While this is a very satisfying way to play, it's certainly not the experience that the designers hope you focus on. The option exists to jump into the individual battles and take direct command of the troops. Here's where the game begins to disappoint...  The first thing you'll notice is that the hex-based map and the units look pretty bad -- especially with the hex outlines turned on. As a way of allaying the crude graphics, the maps in Napoleon do include some pretty neat features like roads, trees, rivers and cities. Each of these objects is modeled to have a realistic effect on both movement and firing. A second problem is that the map can only be scrolled by using drag bars at the edges of the page. In a world where most games can use a bump-pan or click-to-center form of map movement, this limitation is more than a minor annoyance. There is a small mini-map that you can click on to move the main view to that location, but often you'll only need to scroll the map a few feet in any given direction. Another solution would be to use the extreme zoomed-out view to control the units, but all the features and units become nearly indistinguishable at this level.  Control of units is handled with the mouse and as quite flexible. A quick click opens the orders menu where you can select from a truly remarkable amount of options. The amount of versatility in this interface is one of the strongest points of the game. Overall, I found the unit response to be a little sluggish but this is mainly a factor of the historical limitations of command. But even with the Instant Orders option engaged, the units tended  to drag their feet a little. I also had a problem with the formation controls mostly as a factor of the limitations that hexes impose on unit position.  The game offers six campaigns, each of which presents a smaller portion of the larger Grand Campaign. This campaign begins in March of 1813. The Russian invasion has failed and the Prussians are revolting. Napoleon's job is to raise a new army for a counterattack. The Allied players must try to stop him. The smaller Grand Campaign skips a month ahead and lets the French player start with the Grand Armee already formed. The other four campaigns represent smaller fractions of these two main campaigns. The game also offers individual battles that recreate Leipzig, Bautzen, Dresden and a few other scuffles from the war.  All in all it's a great concept in a sorely neglected field. I only wish that Empire had better been able to implement the ideas that are presented in the manual. There are several minor problems with the interface and the graphics aren't the best around. They're not even average by today's standards. But still, there's something very well done about this game. It's solid on concept -- more so than many other games in this genre. It's just the execution of it all that's sloppy. And luckily that's something that will improve as the Wargamer team tries their hand at the next game in this series. The bad news? It's a Civil War game. Sigh...  -- Stephen Butts", "date": "Dec 16, 1999"}