{"name": "The Getaway: Black Monday", "name_review": "The Getaway: Black Monday", "ref": "https://www.ign.com/articles/2005/01/11/the-getaway-black-monday-2", "text": "Riding Guy Ritchie's successful wave of English thuggery is this Getaway sequel, Black Monday. Two years following the conclusion of the first PlayStation 2 exclusive, the London underworld is once again in a violent uproar. A troubled policeman, a vengeful boxer, and an unscrupulous thief live out a perilous and profane day. Would you like to participate? Oddly, it's the participating that we'd like to do less of.   Black Monday is better enjoyed as a show than a game. Its highlights revolve around Team Soho's penchant for a meticulously presented, full-featured tale of comedic grit and excessive F-word use. When taken as a collection of cutscenes upon which some nondescript game plays, Black Monday delivers a story and a group of characters most videogames can't touch. Other ~Save the world and be its master~ plot devices really don't compare to the personality and style of Black Monday, regardless of how narrowly appealing it may be. Lock, Stock, and Two Smoking Barrels was never Commando, after all.   While Mitch the copper's noggin is like a pumpkin attached to the body of a small child or a moderately sized asteroid jammed onto the Eiffel Tower's tip, every moment of his incredibly pained life -- as portrayed by his gruff attitude and perpetually strained expression -- is a real zinger. Eddie, the more spontaneously combustible boxer is just as engaging a character. His imposing stature and blurted words carried out by uncontrollable spittle nicely contrast the sensible if needy Sam and her stealthy wiles. Villainous Latvians with lowbrow whit and counterfeit jeans further compliment a story that's absurdly coarse but very addicting. This genuine attempt at narrative is fantastic, but only lasts for around six to eight hours.   Unlike San Andreas and its ability to be good by offering every type of gameplay mechanic, regardless of how undeveloped it might be, Black Monday uses the nurtured storyline to funnel the action through linear environments. In one way, this creates a game that lacks the grand scale of its counterpart but delivers a more structured, believable experience where the environment does not play as pivotal a role.   In Black Monday, London serves as a detailed set piece upon which the next series of unfortunate events plays out. This focus on directed action against a smoky European backdrop makes for a cohesive experience, sure. But it also neglects to highlight any particular part of the outstanding recreation of London that Team Soho has worked so long to perfect. So we're left with this huge city, but absolutely nothing to do in it. Why then did the team devote so much effort to painstakingly replicating that which can only be truly enjoyed through some trivial black cab, race, and free roam extras?   Had all that development time spent trying to unnecessarily emulate GTA's scope been diverted to establishing gameplay fundamentals that actually worked, Black Monday would be as good a game as it is a show.   It's been two years since The Getaway released. That's two years and countless third-person action games later, yet we're still forced to endure a control scheme that's so obtuse that it makes navigating the intricately designed gameworld a chore. The new limited camera swivel (done by using the right analog stick) is practically useless. Add some sloppy collision detection and the on-foot aspects make controlling Mitch, Eddie, or Sam something like piloting a malnourished mastodon through treacherously tight environments.   In some sequences players are charged to run in relatively straight lines picking cover and rolling past bullets to squeeze off a few tight shots. This kind of fast and forward motion creates a hip action movie mystique. Once the game starts complicating things with turns and stairs, however, there arise a few problems. If only a system more analogous to Robotech's that allowed for both free-look and snap targeting would have been implemented. Hell, even Resident Evil 4 and Splinter Cell have more convincing shooting components.   Of no help are the enemies. In fact, all characters in Black Monday aren't any smarter than your average apple. Most of them are placed in important places and told to do important things like run to or away from the player. In these moments, the game works to create a finely tuned sequence of combat, but once a bit of dynamic interaction is involved, still more issues arise. Some characters won't notice the horrible deaths of their friends not standing two feet away, while others will make it their business to run into speeding cars and launch themselves over the hoods for no other reason than to spite physics and common sense. As Mitch, it's even possible to arrest enemies, whereupon their friends will holster their weapons and patiently wait for the detainment to end before firing again. Basically, if you know how to roll and press a button, you can beat a third of Black Monday without a problem. Sam's stealth missions, however, are so painfully inadequate and unnervingly driven by tedious trial and error that they more than make up for the relaxed gameplay that flows up to them.   Driving improves upon on-foot action simply by taking away the camera issues. While the cars have been updated with more variety, classier interiors, balanced controls, tightened physics, and improved durability, they still feel a bit too sluggish and a touch boxy -- as if they were bound by rigid squares that, when nicked against the angular squares of other objects, caused jarring halts and stiff unpredictable reactions. Of course, it's the combination of cars and guns that makes the title, at least that's what we keep telling ourselves.Here's the problem with Black Monday: while it offers some new, it doesn't offer enough. Furthermore, it doesn't fix many of the serious issues that plagued the first title. A map complete with objective markers is a big help, as are the GPS driven turn signal indicators, but the game is just as stiff, clumsy, and unworkable as it's ever been.Black Monday sounds good, has a solid musical score, and features stunning voice acting. And while the graphics are also top notch and animate well (with a good bit of choppiness) there just isn't any real gameplay present. It's the same broken mess it's always been.Two years later that's even less acceptable than it was before.", "date": "Jan 11, 2005"}