{"name": "Tork: Prehistoric Punk", "name_review": "Tork: Prehistoric Punk", "ref": "https://www.ign.com/articles/2005/01/13/tork-prehistoric-punk", "text": "has had a tumultuous lifespan. Once Microsoft's darling, Tork became one of the first casualties of the first-party publisher's big purge. All was quiet for most of 2004, but Tork finally resurfaced in Ubisoft's care towards the end of the year. It's fitting, considering developer Tiwak was formedby members of the Rayman 2 team. That's an impressive pedigree, since Rayman 2 is one of the finest platformers ever created. That is a large part of the reason Tork was regarded so highly at Microsoft. But after playing through Tiwak's prehistoric platformer, it's pretty obvious why Microsoft eventually chose to part ways with Tork. I certainly wouldn't say Tork is bad, but it's not something a company should build a franchise on.  In Tork, you play as the title character, a young caveboy who's witnessed his father's kidnapping and the destruction of his village at the hands of evil Orgus. Your 13-level adventure takes your through three different time periods (Prehistoric, Middle Ages, and the Modern Age.) with new powers and skills for each of the unique time periods. Each time period is broken up into several levels, which run the gamut from your typical ice and lava levels to more elaborate forest and castle environments.   There's a large variety in the enemies, even from the earliest stages, and some minor platforming to be had as well. Tork's controls are kept simple, but that's not an issue for any game, so long as it's interesting and addictive. Problem is, Tork's gameplay doesn't fall into that category. Tork uses his bolo to either bash enemies or chuck the bolo at them. This leads to a lot of button-mashing, but with no cool combos, you literally walk through areas mashing A for five minutes and knocking everything around you to pulp. There is some variety to the gameplay, such as a level where you fly on a pterodactyl, but it's not enough to save Tork from mediocrity.  One of the more interesting aspects of gameplay are the transformations. By beating up enough enemies, Tork fills his Fury meter, which allows him to transform into one of three creatures (depending on the time period). Each creature has unique skills and, if you've collected enough crystals, can unleash a devastating smart bomb-type of attack that lays waste to everything on screen. There are also some barriers and containers that can only be passed by using Tork's alternate form.    In its favor, Tork has a number of alternate paths and secret goodies hidden for those who like to branch out and explore. And by earning high scores in levels, you unlock different mini-games for a little added extra game time. For a platformer that's pretty much on rails, there's generally a good sense of openness to the environments. I just wish the camera could be manipulated 360 degrees.  Tork has some pacing issues, as the entire Prehistoric section (which comprises the first third of the adventure) is fairly ho-hum. Those who get past these areas are in for much more interesting enemies and levels. The castle level alone, the first area you play in the Middle Ages, is attractive, fun, and has smarter and more menacing enemies. But the first third of Tork feels so slow, so meek, that it's hard to want to play through to the better areas. As Tork progresses, the game grows better and better. It is never great, but there are some good and enjoyable moments. It's too bad most of those come in the later stages, when many people will have likely given up on the prehistoric adventurer. Tork is just a kid and while he may be prehistoric, he's hardly punk. If Tork had a little attitude, it might actually have been better, but the title is misleading. This caveboy is far from punk. In fact, he looks more like a cuddly toy than anything else. Tork isn't particularly inventive, doesn't have personality, and probably is worth a rental over a purchase. Those who like platformers can find some enjoyment here, but Tork is hardly at the top of its genre.", "date": "Jan 13, 2005"}