{"name": "Missile Command", "name_review": "Missile Command", "ref": "https://www.ign.com/articles/1999/12/16/missile-command", "text": "Missile Command is one of the all-time classic arcade and Atari 2600 games. It had the all-familiar ~save the planet from alien invaders~ plot that seemed to rule the roost back in the early 80's and it coupled that with amazingly simple, yet addictive, fast-paced gameplay.    Over the past few years, classic gaming has become en vogue. Developers have been able to feed the gamers' desire for retro-games by bringing back the classics in two distinct ways. One popular way has been to deliver the exact same experience to the game player by offering a sometimes arcade perfect emulation of the classic game, usually as a part of a compilation CD.   The other means of re-releasing a classic game is to upgrade the game's graphics to the standards of today's games, usually done by replacing the simple 2D graphics, with 3D polygonal graphics. Hasbro decided to go with the latter in recreating Missile Command for the Sony PlayStation.  Gameplay The story is the same; Earth is under attack by an unknown alien force, so it's up to the missile command to save the planet. In this PlayStation remake, players can take part in either the Classic Game or the Ultimate Game. The Classic Game mode will give players a fairly nostalgic gaming experience as it basically replicates the play mechanics of Atari's original Missile Command game. The graphics have been given a 3D facelift, but the basic gameplay is straight from the Atari classic.   Players can take on the alien invaders, in single player, head to head and cooperative play modes. Although it's called head to head, it doesn't pit players against each other, they only take turns in their attempt to stop the alien aggressors.   The play mechanics are extremely simple; the player must move the cursor around the screen, launching missiles from one of three control pods with the intent of destroying the enemy ships and weapons.  In spite of the fact that this all seems uncomplicated in nature, there's actually quite a bit of depth to the game as the player only has a limited amount of weapons on hand and at times there will seem to be more attackers than weapons available.   In order to be successful, the player must strategically launch missiles so that the blast radius of the explosions will take out more than one attacker. This takes quite a bit of skill, especially in later levels where the speed of the attacks is significantly increased. Making accurate missile attacks can be a bit troublesome with the digital or analog control pads, but after some time, the skill can be mastered. Nonetheless, the game is designed for use with a trackball.   The Ultimate Game mode takes the classic Missile Command gameplay and expands upon it. In addition to putting the player in a fully 3D world, new weapons, play mechanics and enemies have been added. Once again, the player must stop hordes of alien invaders, but instead of just moving from level to level like in the classic game, there are hot zones that players are sent, in order to put an end to the invasion.   The most significant difference between the two play modes is that in the Ultimate Game mode, the battlefield is larger than a single screen. Players must keep an eye on the radar to know where exactly the enemy attacks are coming from. Also, players can earn the right to upgrade their missiles and even buy new advanced weaponry. They'll need these new and advanced weapons as not only do enemy waves move faster in later levels, but they also feature newer more advanced alien crafts.  Graphics Since the original Missile Command hit arcades back in the very early 1980's, it's a no-brainer that the graphics in this PlayStation remake are much improved. Gone are the very simple vector graphics, as they've been replaced with 3D polygonal objects. Some of the backgrounds are a sight to behold, but nothing here really pushes the power of the PlayStation to its limits.  Sound The game has all of the classic arcade samples from the arcade original, plus a ton of new ones that are featured in the Ultimate Game mode. The game's music has an excellent up-beat feel that adds to the game's excitement, but at the same time, there's nothing really special that stands out in the audio department.  Although, I've only played very little of the Missile Command arcade game, I played the Atari 2600 version to death. Outside of Asteroids, Defender, River Raid and Kaboom, it was probably the most played game in my house on that system. It was an extremely simple game, but it was unbelievably addictive. The playing of this game was the basis of many sleepless nights. On the whole, the game hasn't stood the test of time as well as some other games from the same period. Nevertheless, I still had quite a bit of fun playing this game. The classic mode brought back memories of playing the original and an excellent job was done on the Ultimate Game mode as it truly expands on the play mechanics of the original. Most previous attempts by companies to take an old game and create a new 3D game based on it have ended in failure. Games like Frogger come to mind. Typically, the game is given a new 3D shell, but none of the play mechanic features, which made the original game a classic, come with the new-fangled package. Thankfully, Hasbro has succeeded in not only giving a classic some new threads, but also enhancing its already solid play mechanics. Bravo.", "date": "Dec 16, 1999"}