{"name": "FIFA 2005", "name_review": "EA Sports FIFA Soccer 2005 Mobile", "ref": "https://www.ign.com/articles/2005/02/07/ea-sports-fifa-soccer-2005-mobile", "text": "Digital Bridges' mega-deal with Electronic Arts essentially paved the way for EA's massive catalog of games to make their way to handsets -- and the first fruit of this exclusivity arrangement is the global sensation, FIFA. FIFA 2005, however, is no grossly simplified take on a console game -- it offers an incredible recreation of the bestseller soccer game, from the inclusion of real world teams to many play modes.   What it doesn't offer, however, is much of a learning curve. Unless you are already familiar with the world of FIFA, FIFA 2005's steep competition -- which sometimes crosses over into painfully unfair -- is something of a gatekeeper. But with enough practice, and FIFA 2005 does include a training program and a ~Friendly~ mode for skill-honing, you will soon learn enough soccer skills to somewhat hold your own against the tremendous artificial intelligence. Needless to say, there is no way you will ever steal the ball as much as the computer.   If you don't mind a good challenge, though, FIFA 2005 has more than enough game play to entertain your inner footie fan. The tournament mode drops you into the play-offs with sixteen teams to prove yourself a champion. If you have a solid feel for the controls, you'll do alright for the first few games -- but then get ready for a slaughter, because as mentioned above, the AI shows no mercy. Pass at your own caution.   The visual presentation doesn't offer much help in this department. Because the screen is portrait-style, you're missing entire sections of the field. Many of your players will not be in view when it comes time to make a pivotal pass, and you must often kick on faith. Faith, in many cases, though, is not good enough and leads directly to a turnover. This gets outrageously frustrating after while, because even though you may know where you mates are off-screen, you have no clue if the opposition is nearby, waiting to swipe the kick. Ugh.   In addition to a regular game of soccer, FIFA 2005 includes a shootout mode that, for some people, may prove more fun than the actual main game. You approach the goal, rear back for a kick, and then choose the direction you wish to kick the ball.   FIFA 2005 looks pretty good. We tested it on an N-Gage QD, so we got the feel of a Series 60 version of the title. The grass is bright green, but not garish enough to distract from the players. The player models look slid and feature decent animation. Most important, though, is that the ball is big enough to easily track, even when the action heats up.FIFA 2005 is hard. Unnecessarily hard, in my opinion. Not knowing where your competition is when you have to pass doesn't seem fair -- and when you couple that with the computer almost flawless ability to steal, you may want to throw your phone in frustration. So, I have to rule against FIFA 2005 for casual gamers. However, if you are a total diehard soccer hooligan, FIFA 2005 does offer probably the most complete mobile soccer game I've played. Maybe you'll have some zen connection I don't and manage to keep the ball away from the marauding, merciless AI.", "date": "Feb 7, 2005"}