{"name": "Colin McRae Rally 2005", "name_review": "Colin McRae Rally 2005", "ref": "https://www.ign.com/articles/2005/02/07/colin-mcrae-rally-2005", "text": "Codemasters' console hit, Colin McRae Rally 2005, has finally made the transition to cellphones, courtesy of development house Digital Bridges. Fans of the franchise will find much when they first download Colin McRae Rally 2005 to like. It has four good-looking courses, the car (a Subraru Impreza WRX) is nicely detailed, and the general interface really evokes the console experience.   But...   Colin McRae Rally 2005 will make you angry. Don't believe us? Go download the game, try to successfully negotiate more then three turns in a row without sliding off the track and coming to a dead spot, and so if you don't get a total mad-on. You know what doubles this anger? The fact that the game looks great for a basic Series 60 racing game.   But it's not really fair to aim all of our frustration at Digital Bridges here. Let's face it, it's 2005 (the game was released in late 2004) and we're still playing most cellphone games with a digital thumbpad. It's not exactly the most responsive control input, and a game like Colin McRae Rally 2005 requires a little sensitivity. However, since we're stuck with this thumbpad, Digital bridges could have certainly could have eased up a little on whole ~touch one obstacle pixel and you stop~ thing to compensate. Maybe slow us down a little, but it's near-impossible to run a decent race if you keep sliding off the road and having to accelerate from zero to full speed over and over again.   Now, back to those looks. Colin McRae Rally 2005 is a fairly attractive little game. As mentioned, the car is well done. The game offers two view modes, allowing you to ~sit~ in the driver's seat and look out at the road over the steering wheel. The four different tracks -- Britain, Australia, Spain, and Sweden -- all have little touches to make them look like their country of origin. There are also different weather effects, from sunny to stormy.Colin McRae Rally 2005 is a remarkably complete game with lots of road to tear up in the various time trials. The tracks look good and scroll past your car smoothly. That is, at least, when you're not pulling your hood out of a tree trunk. Thanks to the loose control that prevents you from ever getting on a hot streak with corners, you'll find yourself frustrated -- which is not what you pay four bucks to feel. Hopefully we'll soon have phone with better control inputs, but until then, maybe Digital Bridges can lighten up on lightening the controls.", "date": "Feb 7, 2005"}