{"name": "Evel Knievel Evel-ution 3D", "name_review": "Evel Knievel Evel-ution 3D", "ref": "https://www.ign.com/articles/2005/02/10/evel-knievel-evel-ution-3d", "text": "You just bought a new V CAST-enabled phone. It set you back a pretty penny, so you want to take good care of it. You know, make sure it doesn't get scratched or dented. Allow IGN Wireless to give you a little hint to keep your handset looking mint: Don't download Evel Knievel Evel-ution 3D.   This ~game~ is so frustrating, so unnecessarily touchy that you will want to hurl your phone across the room after a mere few minutes. It's not the concept that's bad. Recreate five of the daredevil superstar's biggest stunts? Sounds capital to us. But the execution is so botched that squeezing any fun out of this title will take a Herculean effort that Evel Knievel Evel-ution 3D simply does not deserve.   What makes Evel Knievel Evel-ution 3D so awful? You cannot land your bike after a jump with any degree of certainty. It is such a crap shoot you will think there is some evil randomizer in the game that lets you land your bike only once out of every thirty attempts. The control input seems simple enough. Press up to accelerate to ~escape velocity.~ As you bike soars through the air, you must press up and down on the thumbpad to balance the bike. You cannot land too hard on either the front or back tire. If you do, Evel just flying off the bike into the dirt.   Landing that perfect jump is a huge pain. The controls are so touchy and inertia works so hard against your efforts that it's near impossible to decent a decent run and advance to the next stunt. Which is a shame because, as mentioned before, this is actually a really good idea for a game.   Maybe if Evel Knievel Evel-ution 3D included some midair meter like the speed meter, which alerts you when you've got enough juice to make a jump. At least with whelies you have some idea if your balance is right on or not. Even if controlling it is a chore, at least you have something to anchor your hopes and frustrations to.   Evel Knievel Evel-ution 3D actually looks pretty slick, though. The polygon model for Evel and his bike are well done and the animations when he crashes are smooth -- and occasionally funny. At least, until you've seen the bike roll over Evel's crumpled body for the hundredth time. Then it's not so funny. The tracks look good with lots of color and some nice effects, such as the fire rings you must occasionally launch yourself through.Simple formula: You + Evel Knievel Evel-ution 3D = no fun. Sorry. The control is so awful, so overly sensitive and without fair balance, that it renders the game pretty much unplayable. It's too bad that such good visuals were wasted on Evel Knievel Evel-ution 3D, because that's what will sucker subscribers in. But they're expectations, much like the digital Evel, will soon crash and burn.", "date": "Feb 10, 2005"}