{"name": "Racing Gears Advance", "name_review": "Racing Gears Advance", "ref": "https://www.ign.com/articles/2005/02/10/racing-gears-advance", "text": "The day Codemasters shipped out the original Micro Machines for the Nintendo Entertainment System was the day I fell madly in love with top-down racing games. Similar games in the genre have come and gone before and since then, but it was Micro Machines that really brought the magic to the forefront of arcade-style racing. Orbital Media's clearly on the same wavelength, as the company's first game out of the gate, Racing Gears Advance, takes the same energetic approach to arcade racing. The development team has offered up a great looking, tight controlling, and extremely creative GBA racer that brings back a lot of those old Micro Machines feeling, something that hasn't felt since the release of Paragon 5's Karnaaj Rally and Micro Machines shipped on the system.   Orbital Media's take on the arcade racing genre is pretty straightforward, but it's pulled off in style. Racing Gears Advance is a eight-challenger affair where players zip their choice of twelve real-world, licensed vehicles through several different competitions of five races each. Though a skillful hand on the wheel is certainly required, this game's not simply about balls-out racing since it also pushes the offensive element by allowing for weaponry during competition. And in this case, Racing Gears Advance can get incredibly hectic since the computer opponents aren't exactly what you'd consider ~pushovers.~  The racing action takes place in a fixed camera position over the track, scrolling with your vehicle as you zoom over the terrain. Unlike Karnaaj Rally and Micro Machines, the perspective chosen for Racing Gears Advance is slightly more angled than a harsh straight-down viewpoint. This enables the graphic artists to provide a somewhat 3D appearance to its 2D artwork, and Orbital Media took advantage of this opportunity in a big way. The beautifully rendered track designs are incredibly creative because each one not only offer paths that go every which way -- including crossing over and under themselves -- but also hide some pretty nifty shortcuts that aren't always obvious to find or utilize. The engine offers only a basic scrolling environment, but it utilizes sprite techniques that allow for a huge amount of rotation positions for absolutely tight control. And if a vehicle happens to duck behind a tree or into a tunnel and disappear from the player's sight, the game offers a handy guide ~arrow~ to show exactly where the car is and what direction its heading.  The actual racing and handling is also expertly pulled off on the Game Boy Advance. Steering is very precise, and it's enhanced with a control mechanic that gives players the ability to pull off much tighter powerslides simply by release-tapping the accelerator within a curve. Each of the twelve cars in the game are closely matched up in actual performance from the start. The differences between them are somewhat minor in handling, but major when you realize that each vehicle has a unique special ability; the Corvette, for example, can boost from zero to maximum from a dead stop, whereas the Dodge Super-8 (similar to the Magnum) can snag money away from other drivers if you bump into them. The performance issues come into play after each race where you'll have to manage the race earnings by repairing the vehicle and purchasing upgrades and weaponry. It's here that the game offers up a nice bit of strategy, since you'll have to balance how that money gets spread out all over your vehicle -- are you an offensive or defensive driver, or do you simply want the fastest, tightest handling vehicle on the road?  The multiplayer aspect also has been pulled off extremely well in Racing Gears Advance. As many as four players can link up together in the standard races in a seamless multiplayer environment. It's already tough enough to outrace each other with standard driving skill, but when the missiles and oil slicks start flying it gets absolutely frantic. Though Racing Gears Advance doesn't support single cartridge multiplayer or even the Wireless Adapter on the GBA, the link-up is still a mode that shouldn't be missed.  Really, the only hard complaint about the game is its lack of any sort of ~Best Time~ feature. Racing Gears Advance has cartridge save to record the progress of each of the twelve different racers, but the game doesn't offer any sort of ranking for Best Lap or Best Race Time standing for any of the tracks, even in its Practice Mode. It's a normal feature for most racing games, and it's a shame to see such a complete racing package miss this pretty important element.  Orbital Media's the new kid on the block, but its first game on the GBA is an excellent one. Racing Gears Advance is a fantastic, energetic racer with a ton of strategy in its design. And even though the missing ~Best Time~ data could have extended the length of the game, the single player mode is already enormously lengthy with challenging competitors that are pretty darn tough to beat. This racer is definite A-title material.", "date": "Feb 10, 2005"}