{"name": "Star Wars Republic Commando", "name_review": "Star Wars: Republic Commando Review", "ref": "https://www.ign.com/articles/2005/02/19/star-wars-republic-commando-review", "text": "Star Wars is an interesting beast when it comes to video games. There have been some excellent entries (think X-Wing, KOTOR, Jedi Outcast, the arcade games), some crappy ones (Force Commander, Jedi Power Battles), and a whole lot in between. Lately, LucasArts has focused its attention on creating games around the prequels, with good reason. While most of these sit in that ~in between~ category, a new addition to the franchise pokes its head part-way above the fray. Star Wars Republic Commando. Is it the answer? LucasArts' game is set during the events of the movies, but outside of the characters and main storyline; it's filled with posh presentation, and it gives players the ~go sign~ to light into aliens and droids like never before. Republic Commando makes the Clone Wars cool again.Now, this isn't what I'd call an excellent game, but it's what I'd call a good one. The polish has been rubbed into everything in Republic Commando. In fact, the game starts with a lovely multi-part cutscene introducing the premise excellently while also serving as a platform to set players into their new skin and into the lead of Delta Squad. It's a strangely soothing scene that wonderfully sets up the game.You may also like: Best Star Wars GamesThe Cast and CrewAfter starting in, you'll begin to see that Republic Commando is stacked with character. In fact, each member of Delta Squad has his own personality. While they're part of the clone army, they're often referred to by other clones as ~deluxe models~ due to their higher training that not only gives them more skills but also unique traits that complement each other in a team unit. Because they're so functional together, they're given all of the nasty jobs that the normal clones would die trying.For the most part, I can dig this change in the clone philosophy. It kind of makes sense. A group of four that acts as a clone Voltron (minus the attaching themselves to each other) is a cool idea. Each of them has a specialty such as demolitions or hacking (though I'll get into that more in a second) and a distinct personality. One is a goofball, the other is the hunter-killer type with a dark (yet personable and fun) demeanor. For the most part, the team dynamic works in both mechanics and in execution. The problem I have is that if they're brought up in the same environment for the most part, why is it they don't have New Zealand accents like the rest of the clones and the main character? That bugs me. They could still have personality and all share the same accent.Either way, once you get over that inconsistency, the voice acting is pretty fun to listen to. There's a good amount of banter between the guys and various comments to you as well. It helps to quickly create a comfort zone with the other characters in the game and accept them as your violent little family.And violent they are. While there won't be any red human blood splattered around, there's plenty of green bug juice and robot fluids splattering onto your Metroid-like visor, which gets neatly cleaned by a energy-based equivalent of the windshield wiper. In general, the game has a much grittier and darker feel than either of the recent movies, a big plus. In fact, while there's a lot of battle happening, it reminds me quite a bit more of the dirty and industrial feel of the original films.AndAction!Things really get going when the battles set in. There are only three main campaign levels in Republic Commando, but all are full of action. Everything begins on Geonosis when training becomes a reality for Delta Squad as they drop into live combat during the battle at the end of Episode II. This particular planet gives the game a feel similar to that of Call of Duty or Medal of Honor, as friendly clones, enemy droids, and Geonosians run around killing each other while you and your crew mow through everybody in an attempt to achieve a very specific goal.The main difference between a game like Call of Duty on the PC and this one is nature of the soldiers. Call of Duty provides a feel of what it's like from the point of view of a grunt (mostly) and Republic Commando looks from the view of special ops that aren't usually in the thick of a battlefield. It's more in the vein of Rainbow Six 3. Consequently, there are quieter times and less frantic moments where you're hoping not to die from the bullets whizzing from all directions and completely outmanned. As much as there's some serious action, it's never overwhelming.The game has a good measure of that kind of excitement attached to it simply because you have these team members with you to add lots of gunfire in all directions. It doesn't ever quite reach the intensity or insanity as other games in the same genre. This stems largely from the fact that most levels have you slogging down corridors (whether they're inside or out), clearing out enemies, and moving along farther, with very little deviation. The game's best moments occur when things spread out and grow more complicated. One moment in particular took place on a ghost ship level and had the squad backed up fighting against a bunch of droids that simply kept coming. More of the scripted and timed events that come at you from all angles would have been appreciated. As it is, the game is almost entirely linear.Too Much Brawn, Not Enough BrainsEven so, I really did like the pace for the most part; it was simply that I wished for more of a challenge for my brain and not just my trigger finger. When you're playing it you have this feeling that it could be better. My largest annoyance with the game comes from the way squad organization is handled. Now, I'm speaking from the standpoint of a hardcore gamer; I play a lot of games and many of them are strategic in nature. When I see an opportunity like this slip away, it makes me a little sad. When you have this cool squad to deal with, why not use them? Let me try to explain...Each of your squad members is supposed to be a specialist and have a particular personality to back it up. But these specialties boil down to the fact that if you tell someone to hack a terminal, the first person to respond will be the hacker specialist Fixer. But if you give commands for two consoles to be hacked, another will begin to hack and do it just as quickly as Fixer. Now, I have no problem with everybody having all of the skills. In fact, I think that's great. But I also think that the specialists should have been quicker at completing a task than one of the other guys.But the importance of this niggling design point is that it's fun and strategic to direct a specialist in tense moments and to know how to use your men wisely in certain situations. Instead, the game holds your hand with a Darth Vader-like death grip. I do understand the need to appeal to the mass market, but I have a hard time believing that people are really that simple. Sure, not everybody is used to playing games, but I do believe they'd be able to figure simple controls out. I mean, how did all those squad-based Rainbow Six games perform so well if that's not the case?As it stands, all around the levels, you'll see specific spots with blue silhouettes over them that can be used for sniping, heavy weapons, grenade throwing, and so on. All you need to do is see those spots and give orders to your guys for these set positions. You can't tell one of them to take up defending a certain spot with a certain weapon (or even other rubble or cover that doesn't have a symbol), which majorly dumbs down the strategy component. Your men simply become floating guns following you around with fun personalities and good animations.I really think that Republic Commando could have balanced deeper tactical gameplay with an easy interface. Select soldier, point at ground, tell to go there and snipe, be done with it. I'm not saying that this should be Full Spectrum Warrior in the Star Wars universe, it certainly should remain focused on action, but there also has to be a tactical challenge.Particularly annoying are the ghosts of soldiers that appear when aiming the reticule at one of these set locations. This is just too far for me. Yeah, it shows that someone can stand there and after the ghost turns green that someone listened and will soon take up that position, but it's just so bizarre. It yanks me out of my immersion in an otherwise terrifically presented game. If nothing else, there should have been an option to turn them off.Otherwise, it really is a blast to have these guys along with you. Sometimes you'll be defending them while they're trying to complete a task, while other times they'll be covering for you. Every now and again one of them will have to shock you back to life using an electric paddle as well. The teamwork foundation is definitely there, it just could have been expanded on a bit.MultiplayerMehMultiplayer is a bit of a wash, however. I'm not saying it's bad -- it isn't. It's just kinda obvious that it was tacked on because they needed to have it. They were definitely concentrating on the single-player experience, and the three long missions show that focus. But for those who like basic multiplayer with maps that range from OK to not-so-OK, they'll have 16-player deathmatch, team-deathmatch, capture the flag, and assault. You can customize your clone to a moderate degree, with options to look like a commando or a Trandoshan. These are very unlikely to steal you away from Xbox Live staples Halo 2 or the new, lovely Unreal Championship 2: The Liandri Conflict demo disc.I was originally excited about assault because I figured this was developed to be along the lines of Return to Castle Wolfenstein's brilliant class-based multiplayer. Not the case. Assault is simply a different version of capture the flag where one team takes a flag and tries to get it into the other base. I'm actually pretty surprised that they didn't go the way of Wolfenstein here. There are basically classes already set up in the game along with hacking, demolitions, medics, and so on. This is also a wish-list sort of thing, but man... it could have been a ton of fun.The Xbox version includes all the same modes as the PC, with additions for one to four-player split-screen matches, System Link, Friends List, plus in the future, LucasArts will provide downloadable content. Lastly, you can play the game at 16:9 and at 480p HD.The bottom line for the single player experience is that it's a good fun ride. Not excellent, but solidly good. The action survives on near constant combat, decent weapons, and very Star Warsy sound. Gameplay could have been helped by less hand-holding and more tactics. Multiplayer is there... but that's about all I can say for it. It can be fun for a while, but it isn't going to replace Unreal Tournament 2004 or Halo 2 anytime soon. It would have been nice to see the multiplayer a little deeper since the single player game only lasts for around 10 hours.Presentation is really what carries Republic Commando farther than it could have gone on its own. It comes with a grand score, good voice work, lovely animation, and great artistic style and polish. There isn't too much story to speak of as these soldiers are mainly just doing a job for the Republic and not personally involved in the politics, but it gives a couple of insights into the other side of the conflict as well as things to come.If you're a fan of Star Wars that's been looking for something a little grittier, this is definitely a good choice. Don't expect it to blow your mind, but it looks good and plays well while it lasts.Another Take from Douglass C. PerryRepublic Commando is a solid, good looking first-person shooter that takes the squad dynamic and then neuters it real good. Rainbow Six fans are going to wonder what the hell happened, but less military (or less militant) gamers are sure to appreciate the rather easy squad tasks and team dynamic. As far as it goes, the squad is still interesting and relatively fun. The game gives you little management tasks like filling up Becta and covering tactical locations, and the biggest one, obviously, is that you must keep your squad alive, and they you. Indeed, there is a bare-bones dynamic there to make you feel like you're commanding a squad. But just barely.Aside from that, some stretches of the game nonetheless will hammer you with surprising oodles of enemies, and Like Dan was saying, the bigger, more open situations require more skill and thus a bigger reward. Republic Commando does a solid job of bringing in a different side of the Star Wars universe, with different kinds of creatures than you've encountered before, with different weapons, skills, and environments, and it's quite pretty. In addition to the good texture work and often dark spaces, the character models are imaginative and likable, their animation is usually good, and a litany of special effects gives the game a polished sensation.In short, Republic Commando is a solid endeavor that just comes up as little short. The single-player campaign seems to end pretty quickly (8-11 hours max), the Wookiees are indeed cool as they smote enemies against the ground in various ways, the multiplayer is average, and overall it's visually appealing. Sound appealing to you? Go get it. Still on the fence? If you're a hardcore player, rent this first.Star Wars: Republic Commando is presented beautifully. Everything from the opening cutscenes to the briefings are done with style and polish. Visually, this is a good looking game. I was a bit surprised the first time I saw it, but they did a really good job bringing Star Wars to life here. Textures and animation are especially impressive. The music is terrific, voice work is very good (though a tad bit out of place), and sound effects are certainly decent. t takes around 10 hours to complete the single player and while multiplayer can be fun, it won't replace any of the better multiplayer games you already have. Star Wars: Republic Commando is a fun. It's a good linear shooter. It's just too bad the squad members are more of an accessory than brilliant gameplay addition.", "date": "Feb 19, 2005"}