{"name": "Snakes", "name_review": "Snakes", "ref": "https://www.ign.com/articles/2005/02/19/snakes", "text": "It cannot be said that Nokia isn't trying. The Finnish phone giant is making a series of solid, if not impressive, moves to save the N-Gage platform from becoming the ~go-to~ joke for vid writers. This latest move is perhaps even Nokia's greatest -- and the bizarre irony is, it won't make them a lick of money. Well, maybe if this engaging (ho ho) piece of freeware can sell a few more N-Gage's it will.   Most cellphone gamers have played or are at least familiar with Snake. In this now-classic game, you control a straight line that gets bigger with every dot you consume. Said line (or snake) can only perform 90-degree turns. Barrel into the border of your screen or your own tail it was monochromic game over.   Developer IOMO has ushered this ubiquitous game into 2K5. Now, you control what actually looks like a segmented snake. As you consume power diamonds, which are conveniently placed in straight lines or on an easy curvature, your tail extends. There is an always-present time limit, so you must use boosts and brakes to complete these paths of power pellets. In addition to swallowing these blue diamonds, which indeed increase the length of your snake, you can also pick up letters to spell NGAGE and extra lives. Grabbing these extras often require you to navigate carefully designed systems of breakaway walls that shave life off of your snake.   Later levels take the game off the square grid and replace it with hexagonal spaces that make turning a real challenge. But it's a good challenge. You must learn to use a ~hard turn~ button to really swing your snake around and line up with a diamond path.   However entertaining the single-player game is, the heart of Snakes is its multiplayer mode. Nokia and IOMO have made it remarkably easy to distribute the freebie to friends or other N-Gagers via a simple ~Send Game~ button in the start menu.  The game is also available for download at Nokia's site. The goal is to get the game out there virally without need of an MMC card -- and since the game only takes up about 1MB of memory, it's a campaign that should be easy to implement.   Multiplayer games are played over Bluetooth connections. We've tried several multiplayer matches and never had a single hitch getting the game up and running. The multiplayer game is much more destructive than the single-player game, which requires you to gobble as many power-ups as possible as slam into other snakes. The last snake slithering wins. These matches are fast and furious -- and good fun.   Snakes is a very slick-looking game. You would imagine that grid fields would be dull to look at, but IOMO makes excellent use of color. This looks like a techno-paradise along the lines of Disney's ~Tron.~ The grids are splashed with a rainbow's host of colors and are not always entirely flat. Sometimes the grids buckle in a very convincing 3D effect. The music is suitably electronic and the action is highlighted by a series of crunchy sound effects.Snakes is a right brilliant game for the N-Gage. Not just because of its price point -- which is certainly unbeatable -- but also because it's easy to share with friends and exploit the multiplayer capabilities of the system. But its also offers the kind of bite-sized gaming people have come to expect from cellphone games. Yes, the N-Gage is not branded just as a cellphone, but with the presence of a SIM card and number buttons, well, what do you expect. Perhaps Nokia has hit on a winning formula here -- alongside the console ports, a selection of N-Gage exclusive downloads that can be enjoyed in flash gaming sessions.If you own an N-Gage and haven't downloaded Snakes yet, hustle over to Nokia's website and nab it. Then clear out the next hour of your day, because you'll find this game wraps itself around you like few other N-Gage titles.", "date": "Feb 19, 2005"}