{"name": "Fight Night 2", "name_review": "EA Sports Fight Night Round 2", "ref": "https://www.ign.com/articles/2005/02/24/ea-sports-fight-night-round-2", "text": "As a big supporter of last year's game, I had equally big expectations for EA Sports Fight Night Round 2 -- especially since there was still so much that could be done to make it even better. Regardless of its room for improvement, though, the original had done so much right in its first appearance that it easily remained my favorite athletics title of 2004. The reason it did is because it managed to accomplish something that few other sports titles rarely do: it invented a new mechanic that would change the genre forever from that day forward. With a debut like that, I was curious to see how well the development team could follow up on such a powerful first effort.   To my great satisfaction, the newly-formed EA Chicago has come back with something even stronger. Nearly every single one of the complaints I previously had have either been modified or completely redone for the sequel. When Executive Producer and Game Designer Kudo Tsunoda told us earlier in the year that he had listened to critics and consumers when creating Fight Night Round 2, he really wasn't kidding.   To begin with, most of the boxers this year look pretty amazing. Guys like Winky Wright, Roy Jones, and cover boy Bernard Hopkins resemble their real life counterparts almost exactly. Strangely, featherweights like Marco Antonio Barrera and Manny Pacquiao aren't quite as accurate as the more popular bigger fighters, but for the most part all 36 licensed personalities are pretty dead-on. These eerily accurate likenesses are all thanks to a beefed up graphics engine that boasts twice the textures and twice the polygons of the first game. What's more is that a boxer's face now has individual swelling and cutting points so that their mugs react to damage more realistically (as opposed to the general ~ugly face~ mapping that was used last year).   Fight Night's improved facial damage also ties into another one of Round 2's big additions, the ~EA Sports Cutman.~ A smart idea that should be in every boxing game from now on, the Cutman feature no longer leaves the healing of your face to some predetermined AI routine. Now, your recovery from swelling and cuts is entirely in your hands with an easy to use mini-game. Broken into four quadrants across your fighter's face, this 30-second diversion not only allows you to see just how much detail is in each pugilist's visage, but it also helps keep your guy in the fight. Of course, if you don't want to mess with this you can go ahead and automate the whole process, but it won't be as effective as it would be if you did it yourself. Either way, it's a terrific include and a must-have feature for any Arturo Gatti user.   The facial detail this year is stunning. But the visual enhancements to Fight Night Round 2 don't stop there. EA has also improved the jittery rag doll physics from the 2004 edition by giving boxers more weight to their limbs and removing heavy resistance from the ropes (those crazy rubber band knockouts from last year are almost completely gone). Moreover, blood and sweat drip realistically from the bodies and heads of each fighter, and the stadiums become blurrier the father away an object is. Personally I found this hazy look a bit over the top, but it's still an improvement when compared to last year and the variety in each venue is a big plus. I was also pleased to see that the widescreen mode no longer suffers from the unexplainable slowdown that ruined last year's like-minded presentation. HDTV television owners have got to be happy about that one.   Speaking of presentation, Fight Night Round 2 has eclipsed last year's audio mix by leaps and bounds. Round 1's out of place radio personality Big Tigger has thankfully been swapped out with veteran ESPN analyst Joe Tessitore for more professional end-results. But not only is his play-by-play commentary less boisterous and generic, it's also a lot more accurate to what's happening onscreen. Unfortunately Tessitore's remarks still occasionally miss the boat (he'll occasionally comment about a cut that hasn't happened yet or about a guy being in trouble after taking only one or two shots, for example), and the number of phrases that Joe can say are still a little on the skim side. Nonetheless, comparing the commentary of Fight Night 2004 with Fight Night Round 2 is like comparing the boxing skills of Carl Daniels to those of Felix Trinidad.    The audio aspect I enjoyed most, however, was the effective way in which EA captured the reaction of its crowds. Mixed with the increasingly popular Dolby Pro Logic II technology, audience chants and sound effects give off the distinct impression that you're right there in the ring with your boxers. Whether it's the thud of the gloves against your opponent's face or the dynamic response from the spectators, the aural atmosphere here is terrific. Just plug Fight Night Round 2 into a capable surround sound system and sit back and enjoy the show. My only real qualm is that the name calling is still only limited to the predetermined nicknames and licensed boxers; the recognition technology used in the Madden and NCAA games would have been a great addition here. At least the strong new licensed soundtrack helps the disappointment of that omission go away somewhat, so at least that's something.   Speaking of strong new additions, the revamped career mode is exactly what it should have been last year. Now beginning in the amateurs, each fighter's career follows a more realistic path as they go from nobody to somebody. Though players can still turn pro at any time (it's automatic after ten fights), the early amateur contests work as a tutorial by teaching users how to do specific kinds offensive and defensive maneuvers. EA has even included the real amateur rules in this mode with four two-minute rounds and the use of headgear. Should you stick around long enough, you can even win an Amateur World Title that unlocks a couple of bonus goodies for your fighter in the pros.   Once a fighter turns professional, the real strategy of the career mode comes into play. In it, users will have to use their earnings to tactically choose what kind of approach they want to take on a fight-to-fight basis. Cutmen and trainers, for example, are available in three different varieties so that you can customize what type of competitor you want to mold. If you want to work with a trainer who's an expert in punching power and a cutman that's better at handling swelling, then you can go ahead and do that. But if you prefer to train with a guy that knows how to increase your speed more effectively and a cutman that can close wounds faster, you can do that too. Of course, the amount of money you have in the bank affects which guys you can select from, so you'll have to decide if those funds are better spent somewhere else.   Training your fighter means better results. Luckily there's a healthy selection of alternative ways to use that money. Offering an expanded selection of trunks, shoes, mouthpieces, gloves, and protective wear, the game's licensed gear is legitimately helpful. If you remember the way it was setup in last year's version, the outfits you bought were strictly for show -- but this time around, every last piece of equipment actually does something. This means that your gloves and shoes, for example, can add a nice power, speed, or agility bonus to your fighter's existing stats. Picking up a high-end mouthpiece or body guard, however, could increase your resistance to cuts or shots to the body. When used in conjunction with trainers and cutmen (and ring girls that can be hired to psyche you up before a match), your decisions can indeed mean the difference between winning and losing a fight as your career moves along. Best of all, trunks and other unlocked goodies stay open to the boxers in your profile forever. Fight Night 2004 forced you to re-earn outfits with every new career.   More importantly, though, Fight Night Round 2's career mode is a lot more fun to play through. The list of boxers available to your fighter is much greater than it was before. You'll also be able to deviate from your normal progress and throw down in a special knockout mode known as ~Hard Hits~ to unlock additional gear and stadiums. What's more, is that once your fighter has won a title, you can then decide to spend your career defending the belt against all ranked contenders, or just skip over your opponents to fight tomato cans until it's time for a mandatory defense. Players can even compete in ~Pound for Pound~ or ~Unified Title~ competitions or lose and gain weight to try for another division's championship. Throw in special achievement trophies for accomplishing certain tasks and the ability to choose how many bouts you compete in over the entire year, and you have yourself quite the deep experience.    But let's be honest, Fight Night Round 2 will be made or slayed based on its gameplay, and gameplay is exactly what this has. Expanding quite a bit on the system first introduced in last year's version, Round 2 offers a number of new features that makes the action truer to life. One of my personal favorites is the inclusion of clenching, which can be an absolute life saver if you're stuck in a bind. Even better is the fact that you can now block and punch while moving, and you can no longer abuse the torso roll so that your opponents constantly miss punches when you dance. Coupled with other new extras like fight stoppages based on cuts, flash knockdowns rewarded for perfectly-timed punches, and a more aggressive AI, the already-awesome gameplay system from last year ups the ante by quite a bit.   I'm also quite fond of the fact that the game's pace has been slowed down a bit to lose some of the original's arcade feel. While knockdowns and knockouts are still going to be fairly common among experts, two equally-skilled fighters are a lot more likely to go the distance than they were before. The reason for this is because hooks and uppercuts have been weakened a bit (a compensation for the new Haymaker system), while jabs and crosses penetrate an opponent's defense much more effectively. Looking forward I'd still like to see the jab become a little more devastating when landed consistently, but for those of us that played the 2004 version to the death, the improvements with the jab are definitely apparent.   The biggest new addition, of course, is the aforementioned Haymaker system. A special punch that can be used for both left or right uppercuts and hooks, the Haymaker allows you to charge each strike so that it hits harder than your usual blow. This is accomplished by starting a typical punch motion on the analog stick and then moving it backwards to strengthen it. Once the punch is charged, just complete the uppercut or hook as normal and BAM! You've landed a Haymaker. This whole system is in place so that fighters can turn bouts around in desperation or dictate just how much power they unload on their opponents. But as good as I think the idea is it doesn't work as well it should.   Mayorga likes to get Kayoed by Puerto Ricans -- it's a fact. The problem is that Haymakers aren't enough risk and offer too much reward. If one guy plans on landing an uppercut Haymaker, for example, he can just sit there with his punch charged back waiting for the moment to strike without too much danger. If he gets hit in the head or body a couple of times while waiting, it rarely disrupts his Haymaker pose -- making it a little too easy for power guys to sit back and take a couple of blows before landing a much more devastating shot. Now I'm well aware that there are fighters out there that believe in landing one big punch for every three that their opponents throw, but if they're loading up and get caught with three straight hooks to the face, simple physics say they shouldn't really be able to load up any more. Plus, it doesn't appear that missed Haymakers take away too much stamina either, which makes it easy to abuse the feature over several rounds.   The good news is that Haymakers are only available to analog stick users. So the guys that do nothing but use the face buttons to fight (and you know who you are), won't be able to pull a Haymaker off unless they go to the sticks. Another nice addition is the fact that analog stick users now have combos that can only be used for them -- making button users once again limited in the type of attacks they can do. I like this. One of the biggest issues I had last year was that stick users were punished for trying to play the game the way it was meant to, while button guys didn't receive any penalties. Good decision.   Oh! I can't forget to mention that the ~Create A Champ~ feature this year is great. The level of flexibility that it offers when altering your character's face is up there with Tiger Woods in terms of photorealistic likenesses. The only way it could have possibly been any better is if EA had decided to include EyeToy support for PlayStation 2 users (yes that's a hint). Still, you can get some of your created characters to look uncannily similar to your real life inspiration (just look at our upcoming Round 2 Tournament for proof).    Online players expecting to see big changes shouldn't expect to see too much -- Because other than a slight interface change, there really isn't anything that different about it. That is, unless you're an Xbox owner, which gives you a big step up over last year since the 2004 version only supported the feature on PS2. Regardless of which system you go online with, though, the experience is still just as smooth and painless as it was before (meaning that it's good). GameCube owners aren't quite as lucky unfortunately, but they do get an exclusive emulated version of the SNES classic Super Punch-Out and a special hidden character by the name of Little Mac for use in the regular Round 2 fisticuffs.   Speaking of the GameCube, it does have one distinct problem unique to that version which takes away from the final product -- and that's controlling your punches with the C-Stick. Because of the octagonal frame that the C-Stick is housed in, it's difficult to pull off hooks and uppercuts on a consistent basis. It can get pretty frustrating too, since the circular fireball motions needed for the attacks are interrupted by the constant catching in Cube's corners. By all means, the game is still workable and for frequent GameCube users it many not seem so bad. But when played side by side with the other two versions of the game, it's obvious that there's a definite loss of punch and combo speed.   My only remaining problems with the game border on nitpicking. As I'm a bit bummed that profile stats are no longer tracked (just individual boxers) and that you can only control one career boxer per profile at a time . I was also surprised that ring introductions are less customizable than they were in 2004 and that created fighters couldn't be ported over for play in career mode unless they were made there. By the way, does anyone else find it strange that you can't change your fighter's nickname or hometown once it's been decided? It's kind of weird.All things considered, EA Sports Fight Night Round 2 is a solid evolution of an already excellent game. The entire office has been going crazy over it for three or four weeks now and there's no sign of our interest slowing down. Unless something dramatic happens, I wouldn't be surprised if this becomes my favorite sports title for the second year in a row and I'm already looking forward to see what EA has on tap for next year. Could we finally see licensed trainers and a franchise-like Gym Management mode? Or perhaps we'll get a network license for better transitions and fighter scarring that's reflective of the damage he's taken over his career? Regardless of what happens, though, it'll be interesting to see if the team can make as big an improvement on the next version as it did with this one. Without question, Fight Round 2 is a must buy investment for any boxing fan, be they casual or hardcore alike.", "date": "Feb 24, 2005"}