{"name": "A Sound of Thunder", "name_review": "A Sound of Thunder", "ref": "https://www.ign.com/articles/2005/03/02/a-sound-of-thunder-2", "text": "I love the tagline on this game: ~Time is not on your side.~ It's so poetic, since A Sound of Thunder for the GBA was originally intended to release along side the theatrical film featuring Ben Kingsley in a rediculous hair-do. But the movie -- in the can for well over a year -- is still spending time in film industry limbo, and apparently BAM can no longer afford to let this one sit in warehouses. The action game that pre-dates, and is literally a precursor to the development team's stunning Max Payne product holds up relatively well even after being buried under a virtual layer of dust and cobwebs. It's a little shallow in places but definitely offers a good bang for the buck, even if the studio's Max Payne trounces it in style and design.  The game's concept itself is based on the film, which in turn is a concept based on a Ray Bradbury short story of time-travel gone completely awry. In a time where leaping into the past is as easy as hopping on the local public transportation, the film and game tell the tale of a group of dinosaur hunters who accidentally affect history by altering something insignificant in the past. The timeline becomes polluted, and it's up to players to work their way through the adventure to figure out what went wrong and how to stop it. Of course, it doesn't help that the present day is constantly evolving, ~catching up~ with how the change in the past is affecting the future. That's the game's hook, forcing players to do battle with constantly spawning creatures of a new evolution. A Sound of Thunder takes place in an isometric perspective, similar to the style and technique popularized by the GBA versions of the Tony Hawk series, complete with the skillful use of realtime rendered 3D character sprites for smooth and varied animation. This perspective allows for a 3D-style of shooter design without pushing the GBA too hard. It's very playable and the game offers a lot of action in a small package, but the controls have been stripped in order to make it playable. The developers had to enable a ~lock-on~ function so players could actually target with some sort of accuracy in this perspective. The downside is that the action boils down to simply weaving back and forth while ~locked~ in one direction and letting the auto-targetting device take over. It admittedly takes away a bit of skill and makes the action a bit more ~automatic~.  Luckily, it's not all guns-blazing action, because if it was, the game wouldn't be very deep at all. There's a lot of puzzle-solving in the game design to extend the challenge of A Sound of Thunder, though these puzzles are almost entirely based around shoving crates around. Some crates need to be shoved to activate switches, other crates need to be shoved to create pathways across electrified floor panels. And some crates need to be shoved to form staircases to reach higher ledges. It's not a very creative idea, but at least they make the game more challenging than simply blasting a gun in a single direction.  Then there's the occasional driving sequence. These certainly shift the action around from the standard run-and-shoot gameplay, but they're also designed on an engine that's far too limiting to pull them off properly. It's clear that Mobious' game engine was constructed for designers to create and string together small ~rooms~ as levels, and it's a little awkward to drive in a track that's designed exactly the same way. After speeding along for a few feet in the vehicle, the action pauses briefly when the car leaves one ~room~ and enters another. It's not exactly a ~seamless~ effect when it happens, and it's pretty obvious that the engine wasn't made for this type of level. Apart from the strange pauses every ten seconds or so, though, these racing levels aren't all that bad and actually add a bit of variety to the action.  The game's single player missions aren't enough to keep the game going for more than a few hours, but the progression from one level to the next definitely takes advantage of the game's situation: the deeper you get into the game, the wilder the environments and surroundings become. There are plenty of instances where the world literally changes right in front of your eyes, in turn affecting the way the level needs to be solved. So at the very least the designers push the ~time wave~ aspect pretty well in A Sound of Thunder.  What really makes this game unique, however, is A Sound of Thunder's amazing attention to multiplayer support. These modes can be approached either cooperatively with two players, or competitively with four. The four player deathmatches are surprisingly well produced for such a simple game design, as players duke it out in a tiny room of jump pads and teleporters. It becomes quite the intense game experience, and what's even better is that it's a single cartridge affair; the necessary files copy to every GBA in the chain for this mode.  The bummer of it all is that the game was developed with the intention of shaving a few cents off the cost of the cart. Which means it lacks a cartridge SRAM to save player's progress. The password engine offers codes small enough to jot down, but all they record is the last level obtained. Without the SRAM, the cartridge won't save the scores or best times earned in each level, statistics that are actually presented between rounds. Such a tease. The development team's excellent Max Payne definitely outclasses A Sound of Thunder, simply because Max Payne was the follow-up using the technology created for BAM's game. But A Sound of Thunder is a decent throwback, and even after sitting on the shelves for a couple of years the game design hasn't gotten entirely stale. It's definitely worth the price of admission if you can score three other players and some link cables, because this game offers some surprisingly decent deathmatch action that only needs a single cartridge for the network.", "date": "Mar 2, 2005"}