{"name": "Chicago Enforcer", "name_review": "Chicago Enforcer", "ref": "https://www.ign.com/articles/2005/03/07/chicago-enforcer", "text": "It often seems as though the Xbox is a system based around first person shooters. A large portion of the console's success can be attributed to a little game called Halo, a title that seemingly must be mentioned in any console FPS review. Since Microsoft dropped the H-bomb the system has been flooded by a stream of high-quality shooters. Just in the past two weeks we've seen the release of Project Snowblind, Republic Commando, and Brothers in Arms. Unfortunately, when any genre becomes saturated with games there are bound to be a few rotten titles. That brings us to Chicago Enforcer, a game that is about as uninspired and generic as they come.   The game centers on a mob soldier named DeMora who is sent on missions to thin out the ranks of Capone's rivals. Each of the 10 missions is split into smaller objectives with an auto-save feature after each is completed. Annoyingly, the game has a tendency to save during or directly before a confrontation. This led to more than one occasion where my most recent save file placed me looking down the barrel of a shotgun, with nothing to do but start over from the beginning of the level. This would have been less annoying if the game's loading times were more reasonable. Each time you die or kill a civilian, players must wait a horrendously long time for the level to load. On the up side, each death allowed me to get in a long stretch of gaming on my GBA.    The loading screen becomes a huge part of Chicago Enforcer due to the game's unbalanced and frustrating mechanics. The main character has a health and armor meter which can both be depleted in the blink of an eye. One second the poorly-depicted streets of Chicago are barren, and the next second two mobsters will appear out of nowhere and kill DeMora with a couple of shots. If the mob doesn't get you, the civilians will. Every so often an innocent bystander strolls down the street and gets in the way of the carnage. Shooting a civilian ends the level and kicks players back to loading screen. Strolling down the street with a shotgun while taking down police officers is perfectly acceptable, but hit a store clerk by accident and it's back to the last save point.    Kingpin circa 1999 Chicago Enforcer  The thugs roaming the streets of Chicago aren't exactly smart, but they do have a slight range of actions that make fire fights more interesting. They lie stomach-down in the street, roll out of range, and retreat to safer ground if they are being picked off from afar. On the negative side, they can also be tricked into wandering around corners into the scope of your shotgun and continuously backing up a street will keep a group of goons running towards you while they are put down one at a time.       The most difficult enemies are corrupt members of the Chicago PD. I kept waiting for a bizarre plot twist that revealed these characters to be robotically enhanced humans from the future, as they can sustain up to four times more damage than a street thug. Repeatedly blasting an officer in the face with a shotgun is often not enough to save DeMora from these unstoppable killing machines. A hint on the loading screen suggests sneaking up on the police with no weapon equipped, then bopping them on the head with a lead pipe. This method would work if other enemies didn't constantly spring out of nowhere to ruin the ambush. Also, since these officers are ~corrupt~ they have no problem teaming up with the rival gangs as they shoot up the streets of Chicago.    The weapons are standard for an FPS. Players start with a pistol and a piece of pipe. Later you gain access to a shotgun, an ice pick, a Tommy gun, a sniper rifle, and eventually a rocket launcher that resembles a small firework. None of the weapons are exciting or enjoyable, so there is little incentive to advance through the game.    When first playing Chicago Enforcer I was reminded of Kingpin: Life of Crime, a very similar mobster-themed game on the PC. Both games share a similar art style, although Kingpin had more detailed environments and weapons effects. It was also released in 1999. In Enforcer, the animations look chunky and unrealistic. Some gangsters tear down the street in fast forward while civilians will try to escape the battle by ducking directly into the line of fire.      Each level begins with a phone call to the main character explaining the scenario. Besides these voice clips, the game is an aural wasteland. There are gunshots, and occasionally a mobster will yelp when shot but that's it. When the streets have been cleared of enemies the game becomes completely silent, with no music and hardly any environmental noises.       Share the Pain  Chicago Enforcer actually features a decent set of online options. It supports system link and Xbox Live with Quick Match, Optimatch, and a friends list. The online modes include Deathmatch, Team Deathmatch, Capture the Cash and Turf War, which take place in nearly identical versions of the single player maps. Weapons are plentiful and appear as glowing blue icons that clash horribly with the drab settings.    Playing this game online is about as much fun as playing the single player game; this is to say, no fun at all. The multiplayer experience is technically sound, however the core game play is so flawed that there is no reason to share this game with a friend.    Closing Comments  In short, Chicago Enforcer is not worth a purchase, even at the budget price of 19.99. Any fun that could be squeezed out of this poorly designed title is negated by long loading times and unbalanced game mechanics. It can be easy to over-criticize a poorly designed title, but this game deserves every insult it receives. There are a huge number of first person shooters on the Xbox -- almost all of which are better than Chicago Enforcer.", "date": "Mar 7, 2005"}