{"name": "Planescape: Torment", "name_review": "Planescape: Torment", "ref": "https://www.ign.com/articles/1999/12/18/planescape-torment", "text": "Interplay has been doing pretty well with RPGs for the last few years. First they managed to weather a pretty nasty battle with Steve Jackson over the GURPS license, stay on schedule (well, mostly on schedule) and release Fallout, one of the best roleplaying titles to ever hit store shelves. After the loss of Fallout's Lead Designer, Tim Cain (who has gone on to form Troika Games w/ several other members of the original Fallout team), Interplay proved that they still had what it took to make a great adventure with the release of Fallout 2 (although rumor has it that Cain was very involved with the project before he left Interplay), another stellar RPG. One month later, the company showed off BioWare's Baldur's Gate, an out of house project that many consider to be the best roleplaying game of all time.  While all of this was going on, the company was working on another licensed title that seemed to constantly evade actual release. The new title, which would eventually become Torment, was to be based on the Planescape license, which the company had acquired shortly after they grabbed the rights to the Forgotten Realms world. After years in development and several rotations of staff, many people were growing more and more convinced that the project would never see the light of day. Fortunately, for both Interplay and the gaming public as a whole, those voices were wrong. The final game has just recently started appearing on store shelves and after a couple of weeks glued to my monitor, I'm here to tell you that it was well worth the wait.  When you've got a storeroom full of great RPGs behind you, you've got to imagine that it's pretty hard to keep convincing yourself that the next one is going to live up to the great expectations that have already been set. Fortunately, rather than resting on the laurels they received for Baldur's Gate and the Fallout series, Interplay has taken the winning qualities of those titles and mixed them with a universe that is far different from what most RPG fans are used to. The end result is a game that has the playability of Baldur's Gate (which is no surprise, it uses the BG engine after all), the story and character depth of Fallout and Fallout 2 and an adventure that doesn't fall prey to the predictability that plagues so many games of the traditional fantasy genre.  As I stated above, a lot of the game's originality comes straight out of the Planescape world itself. For those of you who aren't on TSR's mailing list, the Planescape universe was created to allow deeper exploration of the various planes of existence that showed up in the earlier AD&D rules. There are a whole lot of different planes, and in the interest of getting this piece done sometime in the next century, I'm just going to let the game introduce them to you. Let's just leave it at this  there are a lot of different attitudes out there and most of them have a plane of existence associated with them. Within these planes are major powers (gods, devas, etc.) who help keep them running the way they should. The city of Sigil, where a good deal of Torment takes place, acts as a sort of intersection for all of these different worlds. What this means is that as you stroll down the city streets, you'll be just as likely to spot devils and demons (they actually have more specific racial names, but once again I think the game itself will do a better job of explaining this out than I will), walking suits of armor, creatures of pure order, or other magical constructs as you will to spot human beings. If you're familiar with the concept of planar travel already, you're probably salivating at the basic setup here. If you're not familiar with it, let me reassure by saying that the game spends a lot of time making sure you understand the concepts involved by immersing you in them. In other words, it's fun to figure this stuff out and I'm going to move on now...  As you can imagine, this kind of backdrop was a dream for the guys who were designing the game. I mean, how bad can a story be if it can involve literally anything you can dream up? Even so, the guys over at Black Isle went all out when writing Torment's tremendous storyline. As the game begins, your character wakes up on a marble slab in the basement of a huge mortuary. Shortly after you wake up, you discover your first travelling companion, a floating, disembodied skull named Morte. Once you team up (Morte acts as a sort of floating encyclopedia for you), you'll start to discover what really sets this game apart from other titles you've played before. First off, you can't remember who you are. While it becomes obvious to you fairly quickly that you've played an important role in a great number of lives (you keep running into people who are really pissed off at you), you have no memory at all of who you are, what you've done, and what you're supposed to do now. The next thing you'll realize is that you're immortal. Unlike most games that end when the main player dies, in Torment you simply find yourself waking up again and again on the same Mortuary slab. While this is certainly preferable to dying, it can be a real bummer when you've traveled pretty far afield. Your power over death seems to extend to others as well  you have an innate ability to raise any of your companions from the dead. Finally, even in a world where the extraordinary is commonplace, everyone in the realm of Sigil keeps treating you like you're some sort of freak. The repeated verbal jabs you take from the citizens you run across make finding out who you are and how you got to be that way a very compelling goal indeed.  Fortunately, your brain blank doesn't seem to be complete. Every so often, you'll see a person, place or action that seems familiar to you and it will trigger a flashback that will restore some of your earlier abilities and skills. It turns out that over the years you've done just about every job under the sun, so taking up any profession (read: character class) is really just a matter of remembering what skills you can. In gameplay terms, this is particularly cool, because you never really have to nail down and choose a particular profession. You start the game as a low-level fighter, but within a couple of hours you be able to switch over to thief or mage. If you decide at some point that that's not the way you want to play the game, all you have to do is switch back and you'll pick up where you left off on the experience scale. Obviously, if you ever want to be good at anything, you'll have to settle down and actually earn some big experience in one of the different professions. The really cool thing about this is, like Fallout and Fallout 2, the game is written so that any type of character will have their own specific way to get through each of the different situations presented. More intelligent characters will be able to talk or magic their way through a situation, charismatic characters will be able to charm their way through it, quick characters might be able to flee or steal their way around the problem and strong characters... well strong characters will just beat their way through it. This setup not only offers a more realistic gameplay experience, but also imparts a certain replay value to the game  if you've played through as a thug, you can try again as a wise man and will have a very different play experience than you did the time before.  Even though your character will always be the big freak in the party, some of the other players you pick up during the course of the game are pretty hardcore as well. I really kind of ruined the game for myself by knowing a lot about these different beings before I started playing the game, so I'm going to leave out the heavy character descriptions here. Let's just leave it at a succubus who's given up sex, an animated suit of armor with a Batman-like obsession with Justice, a rat-tailed girl who can trade insults with the best of them (the best of them would be Morte) and a weird critter from the planes of order. This is just a sampling of the different types of characters you'll find yourself travelling with, but I'm going to stop there. It's almost impossible to even talk about some of the different characters in the game without giving away parts of the game, so I'm just going to leave it alone. All you really need to know from a review standpoint is that all of the characters in the game are extremely well designed and have loads of speech, history and personal flavor. Better still, they have their own agendas and will respond quickly to changes in your alignment or deviations from the path of action that they deem most important. I also liked the fact that certain player characters have powers that, like your raise dead ability, are a part of the character design itself and don't really fit within the rigid AD&D rule set. My favorite was Morte's insult ability that would make any enemy on the screen ignore anyone else in an effort to kick his cranium. Not only was this power useful (sometimes you need a little space to cast a spell), but it was also pretty funny as well. Even more amusing was the fact that every time an NPC said something nasty to me while Morte was around, he would cackle with glee and add the new taunt into his already awesome catalogue.  Obviously the characters you travel with have the most conversational text, but Planescape's NPCs boast a good deal more than you see in the standard RPG. A great deal of your game will be spent interacting with people trying to gather as many facts about yourself and the world around you as possible and it's nice to have townpeople who can offer up more facts than the standard, ~Things used to be better before the Demon King invaded our realm.~ While this depth is one of the things that kept me glued to my screen, hack and slash players may get bummed out at the fact that Planescape is a lot more about character interaction than it is killing bad guys. On the other hand, I did have some troubles with major characters who play a important role in the game having a really short fuse. If you screw up a conversation, you may find yourself having to kill someone who could make your journey a lot easier. Still, even this is fairly realistic within the confines of the game. Planescape is a tough universe and nosy people who go around asking too many questions are very likely to find themselves in a fight.  Baldur's Gate fans will find the Torment interface just as easy to use (if not easier) than the original engine that it was based on. The game uses the same point and click system that finally convinced me that an RPG could exist in real-time and still be fun. All of the rules you'd expect to see in the pen and paper game, from encumbrance to casting time are in there, but handled by the computer without bogging down the game's pace. Like Baldur's Gate, all of the characters and NPCs in the game are surrounded by glowing circles that help you sort out your enemies from neutrals and comrades. While combat is relatively hands-off (you just point and click), loads of nice features like special animations for critical hits hold your interest pretty well and keep battles from ever becoming a chore.  I'm really running long here, but I feel like I have to say something about Torment's incredible art before I finish things up. When I first heard (all those years ago) that Interplay was planning to try and recreate the Planescape universe in a PC game, I was pretty convinced that they were doomed to failure. I couldn't have been more wrong. Black Isle has taken the point of view used in Baldur's Gate, but zoomed in close so you can see the characters a little bit better. And there are a lot of characters. The real reason I thought that no one would ever be able to truly recreate the Planescape universe was the sheer number of different models that they would have to create to show off all the different types of beings you would be able to interact with. While Torment doesn't have them all, they do have more than enough to make you feel like you're at the crossroads of the universe. Better still, there are some truly amazing background and large scale animations in the game, like huge machines and a giant iron golem that takes up half of the screen. While it could be argued that these pieces of eye candy don't have all that much to do with the way the game actually plays, I think the sheer psychological impact of seeing something that huge really helps you get a feeling of scale that doesn't come across when you're watching the action from afar. Finally, the game's spell effects are something that I don't think will be matched for some time to come. High level spells like Meteor Shower become minor events in and of themselves and feature huge animations that show exactly what's going on when you cast the spell. Playing as a mage gets pretty dangerous sometimes as the incredible spell animations will have you looking for any opportunity whatsoever to unleash some of your more destructive magics.  I realize that there are a lot of things that I haven't covered here, but it's all really a moot point. If you're a roleplaying fan, you need to go buy this game for several different reasons. First, it's a great example of the genre. Second, it's got enough depth to keep you entertained for a very long time. Third, and perhaps most importantly, it's a hell of a lot different than anything else that's ever been released. People who have traditionally shied away from Tolkeinesque fantasy RPGs may find the Planescape world a little daunting at first, but may find that the game's incredible script and  powerful characters will help them understand why the rest of us are so addicted to this type of game. A must have for every serious gamer and a powerful contender for RPG of the year.   -- Trent C. Ward", "date": "Dec 18, 1999"}