{"name": "Zuma", "name_review": "Zuma", "ref": "https://www.ign.com/articles/2005/03/12/zuma-2", "text": "Never has an hour vanished so quickly. After meeting with Sorrent last week, we were handed off a phone pre-loaded with Zuma, a Sorrent-published take on the infinitely popular PopCap flash game. Sometime during the weekend, we powered up the beast and took the game for a spin. And that's when the temporal displacement happened.   Zuma, for the unfortunate uninitiated, is like Bust-a-Move taken to the next level. You control a ball-spitting frog that volleys colored balls at snaking lines of colored balls. These lines are constantly on the move, inching ever-closer to the omnipresent sun god icon (or icons) on-screen. To keep the lines from the sun god, you must create chains of three or more like-colored balls.   Easy to say.   Easy to play.   Im-damn-possible to put down.   The crux of the game is somehow balancing stopping the advancement of the lines with taking preventive measures. You could always try to head off the front of the line, but to really keep the incoming balls at bay, you need to tackle the middle of the line to halt its progression. This buys you extra time as the front of the line stops until the back half catches up and continues pushing it toward the sun god.   The game is merciful, starting you out with a few easy boards. But soon the difficulty is ratcheted up to brain-busting levels. Suddenly you have to deal with two lines of balls, and if you split those by attacking their center sections, you soon have to juggle four lines. Line paths go from simple curlicues to winding, twisted routes that make lining up combos a Herculean task. But the brilliance of all of this is that you never feel like Zuma is being unfair. When you fail, yours is the only thumb to blame.   There are also several power-ups that come into view, often behind a line of balls. Some of these slowdown the line's progress, the best actually make it back-up. If you can, always go for one of these bonuses.   Zuma is a brilliant pick-up for Sorrent -- dare we say, one of the smartest the company has made since the acquisition of the FOX Sports license. This is the kind of game the epitomizes casual play, even if it does wrap you up in its python-like grip. The control pad is easy to use (especially with the quick-snap key that immediately makes your frog do a 180) and the game relies on only pressing the ~OK~ key to fire off a ball. It's incredibly friendly to newcomers to mobile games, and for those that have been jamming on their phones for months now, it's a reminder of why the cellphone gaming space is pretty exciting.  Zuma is probably the best mobile game I have played so far this year. Does it blow my eyes out with a zillion polygons or make my ears bleed with cutting-edge audio? Nope. Instead, it relies on game play with such an incredible hook that I will be playing this long after I've finished all the 3D racing games and actioners that are sure to launch over the next several months as carriers move into the realm of 3D gaming. You want an even bigger indication of its appeal? I have a PSP and all six of EA's launch titles. Guess what I played more of this weekend?", "date": "Mar 12, 2005"}