{"name": "Brothers in Arms", "name_review": "Brothers in Arms", "ref": "https://www.ign.com/articles/2005/03/15/brothers-in-arms", "text": "I had said in the Xbox review of Brothers in Arms that it was easily the best World War 2 game on the system. Now, two weeks later, we've had a chance to take a look at the PC version of the game. The content and overall quality are exactly the same on both systems, making Brothers in Arms an excellent game no matter which platform you choose. The competition is certainly a little tougher on the PC but, even so, no game delivers quite the same type of experience as Brothers in Arms.  Just after midnight on D-Day, hours before the landing craft made their way to the shores of Normandy, paratroopers from the 101st and 82 Airborne parachuted behind German lines to disrupt the defenses and forestall the inevitable counterattacks that were sure to be launched once the Allied troops landed on the beaches. These paratroopers were effectively on their own until Allied forces could secure an exit off the beaches. Through a disastrous series of misdrops found themselves far from their original target and far from the other members of their company.  You play as Matt Baker, a sergeant in Fox Company of the 502nd Parachute Infantry Regiment, 101st Airborne Division. The game takes place over seven days, starting with the nighttime drop and ending with the action at Hill 30. Nearly all of the locations and events and characters you'll encounter in this game have been drawn from the actual experiences of the 502nd Regiment over those seven days. Consequently, you can expect early missions to involve linking up with other paratroopers and taking out German defenses. From there you'll move on to clearing out towns, blowing bridges, and keeping Jerry from overrunning your command posts.  Though there are some definite concessions made for the sake of the game, Brothers in Arms is an undeniably authentic experience. From the small things like the offhand reference to the flooded fields that drowned many paratroopers, to the large things like the mission that involves removing obstructions that are preventing the gliders from landing, Brothers in Arms really puts the player there, from the early breakout at Exit 4 off Utah Beach all the way to the final showdown at Carentan. While the main character's story itself isn't all that engaging, the context of the battles is always very clear and meaningful.   The basic shooter mechanics are solid but you'll probably need to adjust your mindset a bit since you're not the super soldier you are in most other games. Like in Rainbow Six, a couple of hits are sufficient to bring you down in Brothers in Arms. You can opt to play with a reticle or not. It makes the game more realistic to play with it off but it makes it a hell of a lot more convenient to switch it on. In either case, the zoom function makes use of a great iron sights effect where you stare down the barrel and literally have to line the target up in your sights.  There are some key differences in how the game plays on the Xbox and the PC. Though I generally prefer the more precise aiming on the PC, you'll find you're only marginally more accurate on the PC. The aim, even when crouched and aiming down the barrel is still a little swimmy. It's a little easier to compensate for this with the analog stick on the Xbox controller than it is with the mouse. Even if you're a deadeye with Unreal you won't find yourself pranging ducks on the wing and getting off spectacular hip shots. Gamers who are used to precise aiming are going to have to take a few missions to get used to the reduced accuracy of the weapons in Brothers in Arms.  Though the action elements are exciting on their own, it's all stuff we've seen before. It's the squad-based tactics that really make Brothers in Arms so much fun to play. If you've played Full Spectrum Warrior you've got a good idea how this works already. You have two fire teams -- one armed for assault and one armed to provide covering fire. You'll need to maneuver them around the battlefield to suppress and outflank the enemy. Since you'll take part in these fights yourself, you can plan even more sophisticated attacks, catching the enemy in a three-way crossfire.  The tutorial does a good job of explaining the tactics in detail. You'll find that the basic engagement pattern outlined in the tutorial works throughout the game. Just remember the four F's. First you Find the enemy, then you lay down a base of fire to Fix him in place. Once he's hunkered down behind cover, you maneuver another fire team around to Flank him. Use the angles from this new position to Finish him.  Your assault team is armed with Thompsons, M1 Carbines and plenty of grenades. This makes them ideal for rushing in and dealing with groups of enemies at close quarters. The base of fire team is equipped with the BAR and M1 Garands. These weapons are good at laying down lots of fire from a distance. In most missions you'll be equipped with both the M1 Garand and the Tommy gun, meaning you can fit in with either team as needed. If those weapons aren't your style, you're free to switch your weapons out for those you find in the field.      Moving the squad around is very easy. You just hit the squad command button and the selected squad will move to the location you're aiming at. If you're aiming at an enemy, the squad will commence firing on that position. If you hit the fire button while holding down the squad command button, you'll order your squad to advance on the enemy position and take them down. It's a really convenient system that lets you accurately direct the actions of both teams from a ground level perspective. You can also opt to have one or both teams stick with you if you like. This makes it a lot easier to get them around on the field but they'll sometimes run a bit too far ahead of you bringing them under enemy fire.  There are some limitations on what you can do with squad management. For one thing, you can only send people to places you can see. While this is almost never a problem, it can cause an occasional inconvenience when you want a fire team to head to the other side of a house. I also thought it was odd that you can't assign the members of your fire team to man fixed machine guns. Those 42s are damned effective but it limits your tactical options when you're the only one who knows where the trigger is.  A tank will sometimes take the place of one of your fire teams. They're controlled in exactly the same way as your infantry teams. Though it's tempting to let them lead the way in most engagements, you'll need to scout ahead to make sure they're not going to come under fire from anti-tank guns or soldiers equipped with panzerfausts. It's too bad that you won't have the benefit of anti-tank guns when you're facing enemy tanks. You'll have to make do with bazookas. If you can manage to sneak around behind an enemy tank, you can climb on top and drop a grenade down the hatch. Fighting tanks in Brothers in Arms is a seriously deadly business though and you're likely to die several times before you finally start to get it right.   Though you can tell roughly where you fire teams are and how hurt they are by looking at the compass in the lower left portion of the screen, you can find out much more information by checking the situational awareness view. This zoomed out view pauses the game and gives you a top down view of the action. You can scroll between objective markers, known enemy positions, your friendly teams and yourself. This mode is great for giving you a clearer understanding of the fields of fire and potential flanking routes around suppressed enemies.   Like Full Spectrum Warrior, this game makes use of suppression indicators over the heads of your enemies. A round red dot indicates the presence of one to three unsuppressed enemies. An expanding gray wedge indicates they're being suppressed by fire from your own time. The more gray you see, the more suppressed they are. But unlike Full Spectrum Warrior it's still possible for them to pop their head up and shoot back. Even better, you can still sometimes hit an enemy who's cowering behind cover. It's pretty damn hard to hit just the top two inches of someone's head but it can be done.  If you think the suppression indicators are kind of a cheat (which, face it, they are), you can turn them off completely. Not only does this mean that you'll have to gauge whether or not an enemy position is likely to fire on you but it also means that you'll have to spot the enemy units to begin with. With the suppression indicators on, you'll almost always have a constant awareness of where the enemies are at all times. If you'd rather not rely on them, you can easily switch off these indicators.  Your inevitable exposure to enemy fire is broadcast very clearly. Rather than relying on the more ~gamey~ convention of suppression meters, your risk of being hit by the enemy is communicated through a variety of methods that warn you to seek cover soon or risk being taken out entirely. In addition to seeing subtle tracer effects from enemy fire, the screen also occasionally blurs along the edge where the shots are coming from. You'll also sometimes see grass fly up in front of you or dirt clods splatter on the screen as bullets smash into the ground. It's a great way to let the player know their number is about to be up without relying on health meters or flashing fire indicators.  Even with all these aids, you'll still find that you die a lot in Brothers in Arms. And when I say ~a lot~ I mean ~a whole damn lot.~ This is something I think might discourage those who are used to the super-soldier style of play found in other World War 2 shooters. I respect that the difficulty level is in keeping with the overall authenticity of the game and I'll also allow that the extreme danger of the battlefield makes your successes all the more satisfying. Still, there were more than a few encounters where I (yes, even I) seemed to die an excessive number of times. The quality of the rest of the experience definitely drew me right back for another try but you should consider yourself warned: if you're the type of gamer who's easily frustrated by failure, Brothers in Arms will certainly test the limits of your patience and determination. It might also test your ability to punch a hole right in your monitor.      Like Halo the game automatically saves your progress periodically. Every mission has about three of these save spots, usually placed in a small bit of dead space between encounters or objectives. One potential aggravation with this sort of spacing is that the hardest encounter in each save area is usually right at the end so if you screw it up, you'll just have to play through the entire area again before you get to the really dangerous part. The game's dynamic and flexible enough that playing through the same stretch of encounters isn't really as obnoxious as it might be if it all played out the same. If you find yourself getting worked over again and again, the game will even be so nice as to give you the option to heal up all the members of your squad (including the dead ones) before letting you try it again.  While some might opt not to heal the squad to preserve the realism of the game, that realism is completely undercut by the fact that the soldiers in your fire team return fully healed at the beginning of each new mission anyway. Consequently, there's no real incentive to keep your team alive, particularly during the last few minutes of a mission. If there are just a few pockets of enemy resistance left in a level, you're not punished for sending both teams right into the teeth of the enemy while you circle around their flank. Losing a particular soldier starts to mean less and less once you realize that you'll be seeing their face again once the new mission starts. Though the scope of the game prohibits replacing veteran soldiers with green recruits, there could at least be a leadership rating that indicates how effectively you used your assets.   You do gain medals for completing each mission but these merely unlock extra content from the game's production. You'll get access to a few historical items, like Lt. Col. Cole's Medal of Honor award and period pictures of some assets you'll find in the game. You'll also see members of the development team and hear some (very) short voiceovers by Gearbox's military advisor, Col. John Antal (ret.). You do get a video of the game's E3 presentation, with commentary by Randy Pitchford and John Antal. I wanted to see more extras like this. There's a ton of ~making of~ video on Gearbox's site after all. It would also have been cool to read more about the real life exploits of people like Staff Sergeant Summers and others whose actions inspired the game's missions.   The visuals will definitely remind you of the Band of Brothers miniseries or Saving Private Ryan. There's a slightly coarse, dirty quality to the image that helps preserve the illusion here. In my opinion most World War 2 games look far too colorful and clean. You can see from the screenshots that that's just not the case with Brothers in Arms. Almost everything here has some kind of dust or dirt on it.  That includes the soldiers. I have to say, the character models in Brothers in Arms are some of the best I've seen. It's not just the attention to detail in the uniforms either. Sure, the pockets and patches and buttons and whatnot definitely help to maintain the sense of reality but it's the faces that really sell it. Each soldier has a very distinct face and all of them carry a weary misery and fatal-seeming resolve in their expression. Their sunken eyes will follow you around as you move, giving them a real sense of life. While I like the expressions a lot, the awkward lip sync tends to kill the effect. Just try not to look at people when they're talking to you.  The graphics also reinforce the strong sense of place. The visual environments here are very believable. The architecture for the towns is first rate. The variety of buildings (and the degree to which they've been blown apart) means that you won't feel like you're walking past the same set piece again and again Hanna-Barbera style. Things like telephone poles, parked trucks, stacked boxes and a host of other details help contribute to the sense of realism here. The vegetation model also enhances the immersion. Though they can get a bit pixeley in close ups, the individual leaves and blades of grass that cover the trees and ground combine to create a completely believable sense of foliage.  On the PC the graphics are widely scalable. The game is enjoyable at the lowest settings but you'll have to start pumping up some of the details if you really want to get immersed in the experience. Even then, you may have to scale down some of the graphics; I pumped all the details up to the maximum level but the framerate suffered too much. The screens you see in the review represent the middle of the road in terms of graphic details. Since my Alienware struggled with the high-end options, the game's visuals should advance alongside increases in hardware capability.  The only bad thing I can say about the graphics is that the textures are a bit muddy. If you stare too long at the road or the side of a building, you'll begin to lose a bit of confidence in the world the game creates. Some of the firing positions are a little obvious but they're usually so well integrated into the environment that they seem less like in-game conveniences and more like natural parts of the world.       Rather than relying on purely linear layouts for their levels, the Gearbox designers have given us towns that feel like towns, vast orchards with more than just two gates, city streets that branch off in multiple directions. Sure there are the arbitrary roadblocks here and there and no end of locked doors in the towns but there's such a sense of openness in the levels that you never really feel like the developers are forcing you down a path.   While we're talking about the graphics, it seems like a good time to bring up the issue of violence. The game has definitely earned its M rating but the violence is almost never that graphic. You see puffs of blood when characters are shot of course. This enhances the realism of the game and provides much needed feedback during combat. It's handled very subtly so I don't think the quality of the effect will bother anyone. The quantity is another story. People are getting shot constantly throughout the game so, while you'll never see geysers of blood spewing out at once, you will see lots of those little puffs. While the game shies away from Soldier of Fortune gibbing, there is one scene where you see the incredibly mangled corpse of the victim of a Stuka attack.  The game's sound design is nothing short of fantastic and drives home the point that you hear a battle just as much as see it. Most times the environment around you stirs with the sounds of war. Bullets whizzing by your head and mortar rounds exploding in a nearby field all remind you that death is never more than a few feet away. The sound of your own gunfire is satisfyingly chunky and gives you a real sense of the power and character behind each weapon.  The voice acting is pretty good throughout the campaign but the actual dialogue falters at points. Some of the lines are classic. At one point an officer instructs his men: ~If you see something, shoot it; if it screams in German, shoot it again.~ I also like the early briefing where the troops are told to ~go tell the Krauts 'hello'...the Airborne way.~ One soldier asks, ~You mean shoot them?~ to which the commander irritably replies, ~Yes. Obviously.~  Baker's dialogue is the weakest of all unfortunately. At times he just seems to philosophical and reflective. I'd have bought the whole experience more if he had been more business-like and nonchalant rather than sounding like he was auditioning for The Thin Red Line. One final note about the language: there's quite a bit of foul language in the game, particularly at the beginning. Though it's not particularly out of place, it is something parents should be aware of if they're considering buying the game for a kid.   The music is also great. It's really only present during the menus and loading screens but it's suitably moody and fairly subdued. You probably won't miss the music during the missions themselves. I think having underscoring for the game itself would tend to detract from the intense ~you are there~ style of presentation. The sound bug that so frustrated me on the Xbox seems to have cleared up completely on the PC version.  The final subject to tackle is multiplayer. The game just came out today so the Ubi servers aren't terribly populated yet. We still managed to log on for a few hours today and had little trouble finding opponents. You'll have to wait a while before you can get a full four players but patience pays off here. Some of the players we encountered today seem to be confused when they can't join games in progress. Once players get a little more time with the game, this confusion should clear up.  Multiplayer is purely a mission-based affair here, so you won't find deathmatch or capture the flag options. Rather than offering the sequential objectives found in Return to Castle Wolfenstein, Brothers in Arms usually reduces the point of a map to accomplishing a single objective. In pretty much every case, one team will have to obtain and then deliver an objective to a specific location. Sometime you're setting explosives on a bridge, other times you're deliver orders to a waiting vehicle. Either way the pattern is pretty much the same.  The objective for the other side is usually just to stop the other team from delivering the goods. I would have liked to have seen some alternate objectives for the defending team as just sitting there shooting the order/bomb runners gets a little monotonous. If each side had its own objective, you'd be able to increase the drama and excitement a lot more. Say both teams are fighting over a bridge: the Germans have to place a smoke marker to bring in an air strike, the Allies have to get a radio to call in air cover to prevent the strike.  Multiplayer is limited to two to four players but, since each player gets at least one squad to order around, the battles seem fairly large. When the character you're controlling dies, you can switch control to another member of the fire team. Once they're all dead, there are a limited number of reinforcements available for each side. If you can't accomplish your objective by then, you lose. Like most of us here at IGN, I'm still a huge fan of Call of Duty and Battlefield 1942. While those games have their own unique strengths, Brothers in Arms takes some of the best features of each and adds an entirely new tactical dimension. Offering up engaging, squad-based battles and presenting it all in an authentic yet undeniably cinematic setting, Brothers in Arms is a game that, to borrow a phrase from General Patton, ~grabs you by the nose and kicks you in the ass.~There's no denying that the game is hard. It's so hard, in fact, that I almost popped a blood vessel in my forehead in frustration at one point. I believe I also said a bad word. But even when I was feeling hopelessly outclassed by the enemy, I still felt like there were always new approaches to take to circumvent and outwit the opposition. That's what kept drawing me back for more punishment. And when I did finally succeed, I felt it was because I had learned something, that I had discovered a weakness not in the game but in my enemy.", "date": "Mar 15, 2005"}