{"name": "NFL Quarterback Club 1999", "name_review": "NFL Quarterback Club '99", "ref": "https://www.ign.com/articles/1998/11/11/nfl-quarterback-club-99", "text": "Last year there was NFL Quarterback Club '98. The game, developed by Iguana Entertainment (Turok, Turok 2), launched Acclaim's football franchise for Nintendo 64 and, at the same time, proved that 640x480 high-resolution graphics were a possibility for the console. In addition to its remarkable visual presence, QB Club '98 featured the full NFL license exclusively. Unfortunately, the title lacked the solid AI of the Madden franchise, which turned many football fans off in the long run.  This year, Acclaim has returned with a highly enhanced sequel to last year's game. Not only does it run on a brand new engine specifically designed with football in mind, but it features second-generation high-resolution graphics, loads of new gameplay options and significantly improved AI routines. It is everything that QB Club '98 should have been and then some.   The Facts<br  Full NFL License.  All 31 NFL teams. Six NFL Europe clubs and the expansion Cleveland Browns. All new 3D polygonal ~sports~ engine. Second generation 640x480 high-resolution graphics. All new artificial intelligence and game strategy written by New York Jets offensive coordinator Charlie Weis. 250 new animations including player specific celebrations like the Merton Hanks chicken dance, Terrell Davis salute and Ken Norton punching bag. Play-by-play from Mike Patrick and color calls from Randy Cross. Referee calls from NFL's head of officials, Jerry Markbreit. Authentic team play styles: the 49ers West Coast Offense and the Steelers Ground Attack. Optional analog passing system 30 different team specific playbooks. Playbook editor. Total Team Management: trading, drafting, signing, releasing players and managing the salary cap. Historic simulations for all 32 Super Bowls. Customizable simulations. Create-a-player. Rumble Pak support. Injuries and penalties. Instant replay. Unlimited selection of camera angles. Create-a-cam option. Game, weekly and season awards including Player of the Game and NFL MVP. Six modes of play: practice, exhibition, season, playoff, tournament and Pro Bowl. In-game highlights feature color photos and stat updates. 4MB Ram Expansion support: Longer replays and slight performance improvement.    Gameplay This is no upgrade -- it's a whole new game. Iguana, starting from the ground up, has built on an entirely new 3D ~sports~ engine and the performance results are significant.  Without a doubt, QB Club '99 features more game options and subtleties than any other N64 footballer. There's a practice mode that enables players the option of testing out plays and formations. There are simulation modes where players can take place in historic Superbowl events and pit classic teams against one-another. In addition, players can also simulate their own custom games. There's quick play, season modes and more. But all of the above is pretty standard stuff.  QB Club's create-a-player feature has been much improved, allowing for physical changes that include height, weight, color, name, number, jersey color, stripes and more. There's a free agent option, fantasy draft, roster management -- everything you'd expect from a football game and more. More meaning added extras like a team creation mode that lets players select from a list of logos, colors and the like.   With the help of New York Jets offensive coordinator Charlie Weis, the development team has upped QB Club 99's AI system quite a bit. Whereas last year's game featured players that often stood around doing nothing in particular, the players in QB Club '99 frequently execute diving blocks, grappling tackles, touch-down preventing tips and so on. But best of all, players are always doing what they should be. For example, if time is running out for a computer team to score, their quarterback will intentionally down the ball to stop the clock. No time-outs left? The offense will forego the huddle. Formations and routines work exactly as they should and there are no tricks involved. Opposing players also adapt to offensive rushes and change their tactics if you try the same play over and over.   The game's icon passing system is equally effective. Using the Z trigger, players can hike the ball and bring up receiver options, just like in last year's version. However, everything feels much tighter than ever before -- and faster.   Unfortunately, QB Club 99's gaming experience is still not perfect. While most gamers will love this game to pieces, seasoned players are likely to discover certain AI holes that knock down the gameplay enjoyment by a notch. Spoiler Alert: Highlight the black space below for hidden text that reveals one of QB Club 99's biggest drawbacks. But be warned, if you don't know about it you may never stumble upon it anyway. In the long run, you may prefer not to know.  Here's an example: We stumbled onto a glitch that works as a ~money~ play for any quarterback run. Using the Z trigger, players running with their quarterback can often throw off any defensive linemen with the greatest of ease. It serves as a major drawback to an otherwise unblemished running/passing system. Unfortunately, this AI glitch can be exploited on all difficulties and even in the multi-player mode. However, it should be noted that such play *could* open your quarterback for more injuries in the long run. Still, a depressing oversight.  Spoiler Finished  All in all, QB Club '99 plays much better than last year's version in virtually every respect. The multiplayer mode is lots of fun, gameplay options are endless, the full NFL license returns, the play AI is more realistic, playbooks are top-notch, control tight -- we're very satisfied with the final product.  Graphics Never before has Acclaim's selling point been more true. QB Club '99 really does go the extra mile to bring football fans the best looking pigskin game we've ever seen. Remember last year's game? It looked sharp, but players were a little blocky, colors a bit dull, and where were all the extras? QB Club '99 makes its predecessor look like a 16-bit rush-job by comparison.   The game's second-generation high-resolution graphics are extremely detailed -- from footprints in snow, soggy splashes in rain and player breath in cold weather to a field-goal net that actually drops after a goal is kicked.  Player animation is breathtaking. Nothing can compete. Players dive through the air to make catches and the ball often lands perfectly in their hands. We guarantee that you'll find yourself watching the game's instant replay mode in amazement. Bone-crushing hits knock quarterbacks on their asses, grappling tackles bring rushers to the ground, celebration animations see receivers break-dancing -- the attention to detail is absolutely unparalleled. We could go on and on and on. Let's just say that QB Club '99 might as well be a technology demo for what Nintendo 64, given the right development team, is capable of.  Sound Like Midway with Wipeout 64, Acclaim contracted Fluke to write a special version of its hit single Absurd for the game's intro, menu, and replay sequences. Iguana puts its proprietary sound compression techniques to good use for QB Club '99. Everything sounds crystal clear, but what's more, the amount of in-game speech and commentary -- a whopping 45 minutes -- is amazing. Whereas ASB '99 lacked ambience and character, QB Club '99 is filled with play-by-play calls from Mike Patrick and Randy Cross. In fact, this game never shuts up. Very well done. As far as I'm concerned, NFL Quarterback Club '99 delivers the most fun of any football simulation on the market. It's the best looking footballer on the market. And, it's the best sounding football game on the market. Why then, hasn't it received a higher rating? Put simply, there are a few AI problems that, unfortunately, keep me from declaring it the best all-around footballer for everybody. Hard-core football fans may not be able to so easily forgive the AI bug that I had no problem overlooking. And it's with that in mind that QB Club has received the rating it has.It must be said though, QB Club '99 has greatness written all over it. Buy it -- or, if you're still unsure, give it a rent.", "date": "Nov 11, 1998"}