{"name": "NBA", "name_review": "NBA", "ref": "https://www.ign.com/articles/2005/03/18/nba", "text": "Now that EA has bought the rights to the NFL license everyone's been talking about how the NBA must be the next sport in line. Who knows what might become of NBA license in the years to come? Luckily, 989 Sports has taken the opportunity to put out one of their first and possibly last NBA-licensed basketball games for the PSP launch. Unfortunately, NBA won't leave us with much to remember, other than a funky approach to shooting controls that would be best left forgotten. The game leaves much to be desired.  At first glance, the game looks clean. The visual presentation definitely deserves applause; everything from the punchy cut scenes (and then freeze framing of players in ~Upper Deck~ card frames) between key plays on the court, to the glossy court itself that's viewed by a smooth panning camera in the ~sideline~ view. It's cool the way the camera will slide from goal to goal with each possession, giving the game the feeling of a televised match-up. And let's not forget the slick player models and animations. Even from the menu, we see a cool well-defined player, dancing to the music (that knocks by the way) and doing tricks with the basketball -- reminiscent of NBA Ballers.   From the main menu there are quick play, online, game modes, or mini-games that the player can select as options. The four basic game modes are practice, exhibition, season, and playoffs. I like the mini-games because they challenge various skills with the controls. It's almost better than the practice mode because the ~Skills Challenge~ game develops more than the shooting skills. It tests passing skills as well.  The season mode is easy enough to use. Simply press the square button to simulate or X to initiate the game. It can be set to play 29, 58 or 82 games. The Playoffs are adjustable for single elimination or ~Best of.~ Getting free agents is just as simple. The interface will list the name of the present roster next to a list of free agents. Scroll and match for a likeable swap and press X. Done. There's no worry about money issues -- real straight forward.  Online gameplay is available for NBA. There is an option to play with people across the country through the Infrastructure mode, or go head-to-head through the Ad hoc option. The game I played here in the office had a lot of potential for fun. There was no visible strain on the system to transfer info between the two PSPs.  Unfortunately, Artificial Intelligence issues started to show up that ultimately spoiled the experience.    The A.I. in the game is in need of some crucial tuning. Players will routinely step out of bounds for no reason, drop their blocking assignment by standing still and letting the opponent dribble around them, or make unnecessary fouls. I saw the computer attempt to pass the ball to another player and totally missed because the player had his back to the game, standing out of bounds while making dribbling motions without the ball. Even though I benefited by getting possession of the ball, it still looked tacky. Sometimes teammates will let players run up the hole and put in easy lay ups. It's frustrating as hell to see Rhasheed Wallace just stare as someone scores in front of him! The little analog tab can also get annoying because it's not tuned tight enough to pull you back in bounds if you get to close to the edge and see yourself close to stepping out.      Let's step back for a minute -- every now and then, game designers try to something fresh with game controls and they take the risk of completely missing the mark. Case in point: Rise to Honor. Here was a game where someone thought it would be a great idea to control all the action with an analog stick. I'm sure it sounded good when he was explaining how it worked to the rest of the design team, but when we put the actual finished game disc in the console and played, it was infuriating. What did we learn? Nothing kills the excitement of playing an action game like sending kick attacks by thumbing an analog stick. Regular button mashing works just fine.   Now, NBA attempts something new with basketball shooting controls by having players tap the circle button once to begin the process of the shot, and then tapping it again to release it. If it's not timed just right, the shot misses. The ball turns green first, and then you have to tap the circle button at that time to get what they call the ~Perfect~ shot. Green means it's good, yellow means it's a maybe, and red means it's going to miss.  Unfortunately this isn't as innovative as it may seem because it only complicates shooting. It's fun when used for just playing around in practice mode, but in the actual game it grates on the nerves because it's so counter-intuitive. While I understand that almost every basketball game ever made has mapped shooting controls to be a ~hold and release~ function and I appreciate 989 trying to break the mold, it just doesn't work in this case.  Because the action takes place on such a small scale, NBA tries to give players a better sense of what the accuracy and timing looks like by using the indicators, possibly taking a cue from Jamdat, who used a similar techniques for passing with their football game because the action took place on such a small screen. However, the indicator doesn't work as well here. It's works okay for pulling jumpers from three-point range, but if the player is in motion or driving to the hole, it's useless. Even dunking is weird because it seems contextual. Sometimes driving the lane will end with a dunk, sometime it won't, and the indecisive nature of it gets annoying after a while.       When you first start playing, NBA looks like it's going to be a lot of fun, especially with the promise of online head-to-head play, but ultimately the game is a let-down on several levels. Weak AI combined with problematic controls make for an experience that is more frustrating than it needs to be. I suggest waiting to see how NBA Street turns out before committing to NBA for your roundball fix on the PSP. When you first start playing, NBA looks like it's going to be a lot of fun, especially with the promise of online head-to-head play, but ultimately the game is a let-down on several levels. Weak AI combined with problematic controls make for an experience that is more frustrating than it needs to be. I suggest waiting to see how NBA Street turns out before committing to NBA for your roundball fix on the PSP.", "date": "Mar 18, 2005"}