{"name": "TMNT Mutant Melee", "name_review": "TMNT: Mutant Melee", "ref": "https://www.ign.com/articles/2005/03/18/tmnt-mutant-melee-2", "text": "It's a safe bet everyone reading this site knows about the Teenage Mutant Ninja Turtles. You either watched the cartoon in fourth grade or read the comics at some point during your adolescence. Who could resist the raw appeal of a five-foot-tall mutated amphibian? No one in the mid-90s, that's for sure. Certainly, a small pack of parents and twenty-somethings may have escaped turtle mania, but the rest of America couldn't help but get sucked in. And for the videogame fans, the Turtle games that popped up in arcades and on the NES seemed like a logical next step to satiate their lust for all things green.   Several years and incarnations later, Konami has released the latest game based on the aging Ninja Turtle property, Teenage Mutant Ninja Turtles: Mutant Melee. Folks who played the last two Turtle games from Konami have reason to fear this one, seeing they both suffered from a myriad of issues. Control felt sloppy in both cases and wound up muddling the whole experience. When a game builds its foundation on frenetic combat, the one thing you just can't mess up on is control. It needs to be responsive, fluid and intuitive. So when Teenage Mutant Ninja Turtles and its sequel Teenage Mutant Ninja Turtles: Battle Nexus shipped with clunky controls, the only thing left for fans to do was wait for the next installment.    Mutant Melee is not a direct sequel to Battle Nexus, in that it doesn't follow the timeline of the new cartoon. It's more of a spin-off, using all the characters from the show and throwing them in a disjointed adventure. As the name implies, Mutant Melee will have you battling everyone from Shredder to Foot Soldiers, and Master Splinter to Casey Jones, in a series of mini-games and matches. It's like Super Smash Bros. Melee in that regard, but for all things righteous don't think the two games compare when it comes to quality. In fact, they couldn't be farther apart. Once again, Mutant Melee, like the two games before it, suffers from a bunch of serious, fun-deteriorating issues.    Mutant Melee splits gameplay into two main modes. The first mode, called Adventure Mode, follows one of 10 characters (four unlocked, six unlockable) through 100 quickie stages tied very loosely by a story. And by loosely, you should understand the supposed story is practically non-existent. A typical story line goes something like this: Stage 1 - ~You're in the dojo, train by hitting punching bags!~ followed by Stage 2 - ~You're done training, now beat up thugs in an alley!~ followed by stage 3- ~You're in April O'Neil's apartment. Beat up Michelangelo to impress here,~ and so on. It goes on and on, with each stage boasting no real character interaction or subplots, or even much of a plot.      Since many of the stages take place in different environments, they present different challenges. The layout is different every few stages, for example, and the placement of destructible crates and barrels is different. Many of the stages feature several levels, so you can climb and dive bomb your foes below. Perhaps the coolest (and sometimes frustrating) aspect of the stages are the insta-kill zones; sections with no guard railings, glass panes on the floor and break and give way and bridges that explode, sending you to your doom.  Certain stages don't have you killing anyone at all, but simply trying to survive an aerial onslaught of bomb-throwing Foot Soldiers.    Unfortunately, the amusement wears thin excessively fast. The average gamer will clear the first ten or so stages in a matter of minutes, and that should give a clear indication of where the game is heading. There will be more enemies, harder enemies and different stages, but there's very little variety in what you're actually doing. It's just punch-kick-win, punch-kick-win, and so on. Things get harder and different enemies attack using slightly different methods, but none of it will get your blood pumping. What's worse, virtually every character shares from the same pool of stages and events. Donatello needs to spend his first few stages training in the dojo, but so do Michelangelo, Raphael, and Leonardo. Each of their training sessions culminates in a fight with Master Splinter, which precedes a ~surprise~ attack by a posse of foot soldiers. A little more variety would have livened things quite a bit.   Just as in previous Turtle games, the characters don't control that well. It serves to note they control better than in Battle Nexus, but it could just be the arena-style stages that produce the allusion of tighter control. There are far less obstacles to overcome, so there's less chance of you missing a jump or something of that nature. If you've played a Konami turtle game before, then you know exactly how this one handles. Each character sports a main and secondary attack, shuriken technique, block, counter, and signature move. Pulling these off exactly how and when you want will frustrate the bejeezus out of you. And since bloodthirsty killers constantly surround you, a missed hit or block will cause you a ton of grief. And it happens a lot.     Once you start unlocking characters, things change somewhat, or at least where story is concerned. But again, the changes are negligible. Since you can only unlock characters after completing a certain amount of another character's adventure, the recently unlocked character's storyline reflects your progress. For example, April O'Neal's adventure starts after Foot Soldiers have trashed her apartment, which took place in an earlier adventure. Which ends up meaning next to nothing, since she sets off on a ~personal~ quest filled with all the fighting and locations you've already visited. Perhaps the biggest reason to play through Adventure Mode is to unlock stages in Melee Mode, which allows for four-player, arena-style bouts. The further progress you make in Adventure Mode, the more stages and characters you unlock for play in Melee Mode.   Melee Mode lets you choose from 10 characters, with an additional 12 being unlockable. You can also select from 24 stages, although 15 of them are locked.  It splits between four different styles, including Knock Out, Last Man Standing, King of the Hill and Keep Away. Knock Out is the classic deathmatch, where the character with highest number of KOs wins. Last Man Standing should be pretty self-explanatory, you just need to kick ass and stay alive to win. King of the Hill and Keep Away still require you to bash your opponents, but shakes things up by giving you different reasons to do so. In King of the Hill, you need to step into a randomly appearing ray of light and defend the position from the other players. The longer you stay in the light, the more points you accrue. Of course, when someone else is there, you need to beat his ass and take his place. Keep Away sees you picking up a treasure chest and trying to defend it while other players try to swoop in, murder you and take it. The longer you hold on to the chest, the more points you earn.   Melee Mode manages to produce a little fun, if only because you get to torture your friends. But it's plagued by the same issues found in Adventure Mode, and the previous two Turtle games for that matter. Had Mutant Melee shipped with tighter control and better stages, it would be a remarkably different game. The four game modes are fine, if sparse, but it wouldn't have mattered as much had the characters controlled with greater precision.    Is it the turtle game youve been waiting for? That depends on your taste. But theres a good chance the mentally healthy guys and gals of the gaming public wont find what theyre looking for in Teenage Mutant Ninja Turtles: Mutant Melee. It lacks the humor and charm of the original show, and even the new one for that matter. It gives you plenty of characters, but no real reason to prefer one to the other. The two different game modes cough up a little amusement, but it gets old fast. Most players, should they spend 20 bucks to pick it up, will spend most of their time playing with friends in Melee Mode. But even this gets stale amazingly fast, since the characters arent that fun to play and stages lack engaging layout and overall variety.", "date": "Mar 18, 2005"}