{"name": "Rave Master: Special Attack Force", "name_review": "Rave Master: Special Attack Force!", "ref": "https://www.ign.com/articles/2005/03/22/rave-master-special-attack-force", "text": "I miss the 80s, a decade when you could count the number of popular Japanese anime series on a single hand. Now, nearly every Saturday Morning cartoon is a Nippon import, and we can arguably thank the popularity of Pokemon for the recent avalanche of  Asian animation series in the past decade. One of the umpteen billion shows now on the air in this country is Rave Master, and Konami's prepped a fighting game to capitalize on the potential success of the series. One, I've never even heard of the ~Rave Master~ anime before Konami's GBA rendition, and two, after playing through this god-awful fighter, I don't want to know anything more about the series. No more, thanks.  If you know nothing about the Rave Master show, comic, or anime, this game isn't really going to open your eyes regarding character, storyline, or situations. It's a 2D fighter from start to finish, and though there's a ~Story Mode~ for each of the characters in the game, the text is so confusing it's tough to figure out which end is up with these guys.  So, we'll just leave the character orientation out of this and simply look at the fighting side of Rave Master: Special Attack Force.   Konami's created a fighter that's certainly inspired by Nintendo's Smash Bros., at least at its most basic. It's a two-to-four player affair in a wide variety of arenas of single or multi-tier platforms and environment effects. Because players have to deal with attacks on either side of them, the character moves have been reduced to double-tapping in a direction with a button press.  Rave Masters also shares another element from Smash Bros.: it attempts to be much different than the standard fighting fare. In this case, Rave Master's ~hook~ is a game mechanic that doesn't require players to simply KO their opponent after their life-force is spent, instead forcing players into a very ~wrestling~ like idea of a special move that can be pulled off at nearly any time during the battle. If successful, the fight's over. No second round, it's just over. According to the manual, ~The player who successfully completes a Special Move wins,~ because, as we all know, ~in the world of comic books and anime, the grand finale comes when a cornered character rises up and turns the tide of battle with a Special Move.~ But I don't seem to remember an Anime battle where the victor can win simply by mashing the buttons down...which is really all this game offers.  The fighting is so incredibly unbalanced in Rave Master that it's simply no fun to play. The fights have a combo system that allows players to juggle opponents with a series of well-timed hits, but the fun of doing this is reduced to near zero when the programming arbitrarily decides ~enough is enough~ and simply turns your opponent invincible so he can recover. Sure, I suppose this is the game's way of making it a little more fair to an opponent who's getting the crap knocked out of him, but when the player can't do anything but simply run around and wait for the invincibility effect to wear off, the game loses any novelty it might have had.  On top of this, you have that ~Special Finishing Move~ mechanic that breaks the fight worse than it already is. Any player can pull off this Special Attack, and the only counter to it is to mash the buttons and hope that it was done fast enough. But since opponents don't have a gauge to see how well they mashed those buttons, it's a mystery how close the player came to countering the attack.   One saving grace of Rave Masters is the game's somewhat cool Ranking Mode, an option that mixes fighting with Fire Emblem-style strategy. Players use funds to buy a team of fighters, and then take them into battle on a grid-based field. Character position is everything, as fights will take place on that particular grid; and if players make the right move they can gang up on a particular enemy in a two-on-one or three-on-one battle. But this mode starts out unbearably slow with two of the wimpiest characters with absolutely no abilities beyond a simple kick and punch, so for the first few rounds it's just a matter of rapid button-mashing until the other player falls. The faster fingers win. Fighting games have been more miss than hit on the Game Boy Advance, but this case, Rave Master: Special Attack Force, never even comes close to the target. If there's a large enough fanbase to justify this game's existence, I can't imagine any member of the club enjoying this fighter either. And for those who don't even know what a Rave Master is: ignorance is bliss.", "date": "Mar 22, 2005"}