{"name": "Shining Tears", "name_review": "Shining Tears", "ref": "https://www.ign.com/articles/2005/03/23/shining-tears", "text": "SEGA's excellent Shining Force series for the Saturn and Genesis was easily one of the best fantasy franchises of the 1990s. Though not as plot-driven or character-oriented compared to that era's other big name role-players, it offered a richness of tactical depth that few other titles could match. In fact, with the exception of maybe Ogre Battle and Fire Emblem it was arguably the best game of the strategy/RPG genre -- with enough options, personality, and high-end production value to fill the entire Great Fortress of Balbazak to the top. But it's Shining Force's beloved position in the history books that makes this latest spin-off all the more difficult to swallow. Because while Shining Tears may not be awful, it's not a legend in the making either.   Taking its inspiration from games like Ys and Alundra, Shining Tears is your typical top-down 2D adventure. But despite the fact that players still have a map screen to plot character movement before going into battle, that's really the only gameplay similarity that Tears has. Everything else about the game is rather new, from the structure of the towns and how you navigate them, to its action-based hack and slash combat. More specifically, it's essentially an upgraded version of Shining Soul for the Game Boy Advance, only with a couple of mechanical tweaks and obviously better graphics.   If that sounds like the type of game you're looking for then you might as well stop reading right now, because Shining Tears should fulfill that wish rather effectively. But if you're looking for something a little meatier in your RPG diet, or better yet, a replacement for the brief entertainment that was February's Ark of Napishtim then you may want to look elsewhere.   It's really too bad too, because Shining Tears starts out rather promisingly. Taking place on the same planet as all the other ~Shining~ titles, Tears begins with the mysterious Mage Knight Xion washing up on the shores of the walled city Shildia. Discovered on the beach by a traveling Elf named Elwyn, Xion (pronounced ~Shion~) is nursed back to health by Pios the local physician and Volg the Wolfling Innkeeper. Once Xion comes to, however, it's quickly realized that he has absolutely no memory of who he is or where he came from. Luckily for all those involved, there is a clue to his identity in the form of two mysterious Dragon rings. Working as a Ying and Yang of sorts, these two rings imbue Xion and his partner with the power to kill hordes of ugly monsters. It's a good thing that they discover this ability too, since days later the neighboring kingdom of Rune Geist invades Shildia for unknown reasons. The remainder of the game is then spent figuring out why they did it and what it is you're going to do to stop them.   Mummies all over the world are in BIG trouble Granted the storyline may be a little bit derivative, but at least its told well enough to keep the whole thing interesting. In fact, Shining Tears is surprisingly wordy -- with a wealth of indexes, NPC conversations, and mission setups that take a long time to wade through. These subplots are further made better by a diverse cast of likeable, well-designed characters; and while their dialogue may not be the same philosophical butterfly speak that you'd find in something like Megaten or Final Fantasy, at least it works. Or at least most of the time it does, since there are a few noticeable translation mistakes during conversations.   Happily, Shining Tears also benefits from a pleasing visual style that looks almost identical to the old Genesis strategy titles; and like Ys VI before it, provides a refreshingly welcome alternative to the overly-detailed realism of today's polygonal RPGS. Admittedly though, its not as polished or crisp as Ys was, nor does it offer as great a variety in terms of environments or special effects. Even so, the low-res 2D graphics do boast a certain amount of personality and vibrancy that The Ark of Napishtim didn't have and the excellent character designs from Tony Taka go a long way.   But then the problems begin. For starters, Shining Tears has a first-rate soundtrack but it's held back by a MIDI presentation straight out of 1996. The sound effects are pretty standard too and when coupled with the rarely-used voice-overs, make for an audio arrangement that's way behind the times. Visually the game comes across as dated as well, with plenty of slowdown during its more populated moments and animations that would have been considered ~just okay~ on the PSOne. Keep in mind, that it's one thing to want to feel old-school and another thing entirely to actually be old-school.    Shining Tears' biggest problem, though, is that the gameplay never really evolves beyond a simple hack and slash formula. Sure it's cool that players can team up with their CPU or human allies to pull off ~Linked Attacks~ and other team-oriented goodies, but most of the time these specialty moves rarely matter since using the basic 'Circle-Circle-Circle' dial-a-combo is all you'll need to win. Not to mention the fact that the AI of your opponents is pretty awful anyway, leaving them to do little else but stand there and attack only occasionally for roughly the entire first half of the game. It's not until later before your targets get a little more complicated, but by then you should be powerful enough to handle them without any issues.   To make matters worse, nine times out of ten you won't even need the assistance of your CPU ally. Just focusing on your own character and building up his stats and equipment will be enough to take out the other side. Just walk up to a monster horde and tank them Final Fantasy XI-style without letting up on the Circle button -- before you know it, they'll all be dead, you'll be more powerful, and the level will be over. In the meantime, your AI Buddy hangs back and does his thing without any real effect.   To be fair, though, the two-player mode can actually be pretty fun if you treat it as a competition. Who can kill the witless enemy bastards the quickest, who can grab the most loot, and who can rack up the highest chains can turn into an entertaining exchange between friends. If you approach it like that, then Shining Tears does have some addictive qualities to it. And if you don't mind the repetitive nature of the combat, it can offer the same kind of fulfillment as a single-player game as well. Throw in the ability to go back and play through the story multiple times, some nice customization features, and the ability to establish different kinds of relationships with NPCs, and you have the potential for something really fun here... you just have to want to put up with the simplistic combat and easy enemy AI to get to it.   As long as you're happy doing this over and over again, you're good. I hate to say it, but the term ~wasted potential~ is undeniably applicable here. Hardcore SEGA freaks and RPG nuts will likely be more forgiving than they have to be, but with the simplistic and repetitive nature of the gameplay and the lack of any challenge whatsoever, it'll be hard for anyone to appreciate it as much as they did the Genesis games. Hopefully Shining Force Neo will pick up the slack later this year, or better yet, maybe SEGA could finally give us the bona fide strategy sequel we've always wanted.", "date": "Mar 23, 2005"}