{"name": "Splinter Cell Chaos Theory", "name_review": "Tom Clancy's Splinter Cell: Chaos Theory", "ref": "https://www.ign.com/articles/2005/03/24/tom-clancys-splinter-cell-chaos-theory-4", "text": "It's not often that a series not only improves visually, but adds completely new elements with each instalment. The original Splinter Cell introduced a new stealth action hero in the form of Sam Fisher. The game looked and played great, but what really stood out was the potential for a successful franchise. Pandora Tomorrow broke new ground by creating an online multiplayer stealth-action game, and Splinter Cell: Chaos Theory continues the trend with improved controls, graphics, a highly polished adversarial mode, and new online and offline co-op missions. It is amazing to see the range of gameplay elements that have been squeezed into this title. It is even more impressive to experience how well each of them works.    Chaos Theory contains three unique gameplay types, but this doesn't mean the solo mode has been overlooked. The story follows a typical Tom Clancy formula of throwing as much globe trotting and technical jargon in a person's face as possible. While Sam Fisher is a step above the typical meathead video game protagonist, he seems to have a very small emotional investment in his job. There are no Metal Gear love triangles or family disputes; Sam is simply a soldier who is doing his job.    There are ten levels of single player international espionage, and each one contains multiple paths to complete the primary and secondary objectives. The levels are larger and better designed than the other games in the series. While many of the scenarios in Pandora Tomorrow were easy on the eyes, they felt too short and lacked depth. In Chaos Theory, the levels are not only visually impressive, but they are expertly designed to offer a ton of replay value.         In terms of combat, the first two games in the Splinter Cell series contained a slight contradiction. While they emphasized stealth, Sam Fisher was in possession of the equipment and the abilities to kick some serious ass. Pandora introduced incremental alert stages in which enemies would outfit themselves with better equipment as the alarm level increased. This addition, along with some very touchy AI, seemed to force a more restrained type of gameplay. Thankfully, this feature has been removed from the game, and instead Ubisoft has decided to let the gamers decide their style of play.    At the beginning of each level, there is an equipment selection screen that gives players the choice of a stealth or assault package. There is also a third option called ~Redding's Recommendation~ that usually contains a mixture of items best suited to the level. This doesn't solve the problem of having an overly powerful protagonist, but it does address the issue. Whether players choose stealth or action, Chaos Theory offers an assortment of new moves and improvements.      First off, Sam now carries a knife that can be used for quick lethal takedowns. Sam either jabs an enemy in the gut or takes them down with a quick throat slash. He also brandishes the blade when interrogating an enemy, which is a bit more threatening than a headlock. The lethal knife attacks are executed so quickly that it can be very enticing to take care of every threat in this fashion. The knife can also be used to cut through plastic sheeting and paper walls. This creates even more pathways from which to approach your objectives.     There are also a number of environment-based kills that allow players to take out the bad guys with style. When a spy is hanging over an enemy he now has the option to grab them from above and either knock them out or snap their neck. When approaching a door there are now four options: open door, open door stealth, bash door, and optic cable. The stealth opening allows players to manually push the door ajar, so as not to disturb whoever is on the other side of it. ~Bashing~ causes Sam to enter the room with a quick kick, which knocks out any unlucky soul on the receiving end of the swinging door.     WATCH THE VIDEO REVIEW    When Sam brings out the heavy artillery, he also has some new tricks up his sleeve. The SC-20K now comes with a sniper and a shotgun attachment that blows enemies off of their feet. The ability to shoot when pressed against a wall has been removed, and instead there is the option to switch the over the shoulder view from the right to the left side. The SC pistol has an alternate fire that that interferes with electrical circuits and disables lights for a short period of time. Because this technique is completely silent, it is a more attractive choice for the ultra-stealthy gamer. Most enemies will find the outages suspicious, but it won't set off any alarms.    The default control setup on the PC is very intuitive. This is especially apparent in the walk/run setup. Sam will naturally move at his slowest walking pace, but by moving the mouse wheel forward he increases to a trot, and then a full run. This offers better control of movement than the analogue controller on the consoles. Needless to say, aiming is also significantly easier with the mouse, which inevitably leads to more gunplay in the PC version of the game.    That brings us to the game's revamped AI system. In Pandora Tomorrow, the slightest mistake would set off alarms and have enemies madly firing off their weapons. Chaos Theory has a more robust, multi-tiered alert system that allows spies more chances to stay hidden, but less chance of survival when their cover is blown. Making a noise or moving through a dimly lit area will still spook guards, but it won't set off any alarms. Instead, the enemies will go through a routine of checking out an area, switching on a light source such as a flare or flashlight, and then investigating the source of the disturbance. They no longer randomly follow Sam as he sneaks away through the shadows, and if players remain silent they can expect the enemies in the area to return to their patrol patterns. Overall, this makes it easier to judge just what gamers can accomplish while remaining hidden from view.      Staying out of site is a good idea, because once Sam is out in the open, he only has a few seconds to take cover or eliminate any threats in the area. Enemies work together by retreating to a better vantage point and flanking their targets. At close range with an automatic weapon, they can fully deplete a player's health in the blink of an eye. Aggressive spies will want to keep this in mind if they attempt to run through a level without caution.    Spies Like Us  One highly anticipated aspect of Chaos Theory is the addition of an on and offline co-op mode. This isn't just the single player game with two spies thrown into the mix, or a co-op version of the versus mode. Instead, Ubisoft has specifically designed four levels for two spies to cut loose in.    Besides the standard equipment from the single player mode, in the co-op missions spies also have access to a set of team moves. Each of these techniques are outlined in a co-op tutorial that must be played to unlock the following levels, but the lessons are barely necessary considering all of the two-player maneuvers are handled through the use of a single button. It was a brilliant game design move to make the system so simple. Instead of fumbling with a new set of controls, players can simply identify areas that require teamwork and tap the ~co-op~ button.      Spies have the ability to boost each other over walls, become human ladders, and use ropes to lower their partner down to otherwise unreachable areas. There is also a super cool torpedo move where one spy is turned into a human missile. One spy simply readies themself by pressing the co-op button and a targeting reticule appear behind them. When the second spy joins up, he is flung towards the target. Not only does this move instantly knock out anyone in its path, but it can also be used to cross gaps.    Once again, excellent level design elevates the gameplay by structuring the co-op levels to encourage teamwork. The alternate fire on the SC pistol must be held down in order to disable electronic equipment. In some situations, one spy will jam a camera's signal while the other player moves past the threat. My only complaint about this feature is that there are only four co-op levels. Perhaps we will be blessed with some downloadable content in the near future.      Versus  The addition of the multiplayer element in Pandora Tomorrow was impressive just for its excellent handling of two separate gameplay interfaces. It pitted the Splinter Cell, third person perspective of spies against a Rainbow Six-style mercenary. In Chaos Theory, this mode has been expanded upon.    Most importantly, there are eleven new adversarial maps that are more interactive than anything seen in Pandora Tomorrow. Players will find more switches, vent shafts, and crawl spaces than where in the last version. There are now three game modes for the online versus experience. The first type of game is a story mode that combines a couple different types of the ~seek out and neutralize~ gameplay from Spies vs. Mercs into one map. As Spies complete one task, a new section of the map becomes available along with a new set of objectives.    The next mode is called disk hunt, and in it Spies must collect computer disks that have been randomly scattered across a map. This game is far more straightforward than the story mode and requires less knowledge about the environment. For people who want to think as little as possible, there is also a deathmatch mode. Only one gadget is allowed per side so Spies carry flashbangs and Mercs carry flares. To even the balance even further, Mercs do not have access to their spinning melee attack or any of their advanced vision modes.      Both spies and mercenaries can exchange equipment and heal each other throughout the course of a match, and spies have access to a limited set of co-op moves. The jerks of the world will also be happy to know that now both spies and mercs can whisper nasty comments in each other's ears before taking out their opponents. The online game also looks remarkably good, even when compared to the beautiful single player experience. The versus mode will feel familiar to those who enjoyed the multiplayer aspects of Pandora Tomorrow, but for new gamers the rules of the game take some getting used to.    Sights and Sounds  Every aspect of the sound in Chaos Theory is top-notch. The environmental effects are incredibly detailed and include radio chatter, raindrops, wind, and mechanic hums. The noises not only add to the atmosphere, with the new sound meter they have become an important gameplay element. Directly below the light readout, there is a bar which displays how much noise Sam makes along with a sliding indicator of the ambient noise in the environment. As long as the player's clatter stays below this mark, enemies will not be alerted to their presence. Silence has always been necessary in the Splinter Cell games, but now it is quantifiable, giving gamers more control.      Not surprisingly, the visuals in Chaos Theory have improved even further from Pandora Tomorrow. Creeping around in the dark has never looked as good as it does in this game. There are flickering candles, creeping shadows, and environmental effects that add to the atmosphere. When combined with the excellent animations, the game feels incredibly cinematic, and on a high-end graphics card the game is stunning. Each level is a grand set piece in which players stylishly accomplish their goals. The entertainment industry loves to speculate on the convergence of video games and film. And visually, Chaos Theory is the best example yet.", "date": "Mar 24, 2005"}