{"name": "Ape Escape: On the Loose", "name_review": "Ape Escape: On the Loose", "ref": "https://www.ign.com/articles/2005/03/25/ape-escape-on-the-loose", "text": "The original Ape Escape served up a mean dish of platform goodness. Its arrival on the PlayStation marked an upswing of innovation and finely-tuned game mechanics. But that was then, at a time when 3D platformers suffered from design malaise. Fast forward to present and the latest entry in the Ape Escape series has launched along with Sony's poppin' fresh handheld, the Sony PSP. Currently one of only two platformers on the system, Ape Escape: On the Loose brings you back to the original PlayStation game, only updated with a series of extras. Fans of the series will undoubtedly feel at home in most respects, but the nature of the PSP also changes the basic Ape concept in some pretty big ways.   But first, a bit of simian lore. On the Loose mirrors the storyline of the PlayStation classic, where a monkey named Specter gains fiendish intelligence and ambition by donning the P-Point Helmet. He then sets out to re-write history by unleashing a band of wily chimps across time. Specter hopes to undo humankind's grasp on the planet, and it's up to you, a peppy redhead named Spike, to stop him. In order to do so, you'll rocket across time capturing some 200 monkeys with a bunch of cool gadgets, such as a stun club, slingshot and propeller. The way you actually used these gadgets was undoubtedly the best aspect of the original. Using the Dual Shock controller, you controlled Spike's movement with the left stick and gadgets with the right. A simple concept to be sure, but it worked remarkably well.    On the Loose features a game hub, called the TimeStation, which branches off into several rooms. Depending on which room you enter, you can access the main game world, mini-games, tutorials and the save/load area. On the Loose splits between different ages, with three stages in each. You'll play through the dinosaur-infested Lost Land and explore the watery depths of Oceana, and spend some time in Medieval Mayhem. Each stage features a certain number of escaped apes, though you only need to catch some of them in order to pass the level. The more you catch, however, the better the rewards. Each stage brims with a series of obstacles, such as spinning blades, floating platforms and frozen lakes. Of course, you also need to battle a number of age-specific foes, most of which aren't too difficult to dispatch. All in all, On the Loose sounds very much like a standard 3D platform. And that's because it is.       By today's standard, at a time when Jak 3, Tak 2 and Sly 2 all compete for space on store shelves, On the Loose can't help but come off as somewhat pedestrian. Still fun, mind you, but definitely lacking that new-game smell. Catching monkeys using your arsenal of gadgets is still good fun, especially considering that On the Loose dishes out hours of classic PS1 goodness in the palm of your hand, but much of what made it truly unique has faded. Controlling Spike using the PSP's lone analog stick and face buttons loses some of the appeal of the original game, in that you need to press a button and swing your net or stun club, adding a step. Of the eight gadgets you score in the game, you can use three at any time by assigning them to the upper-most face buttons.    It definitely works well enough, but it's nowhere near as intuitive and cool as it could be with another analog stick. So while using the gadgets has lost a smidge of its appeal, running around catching monkeys still provides a good amount of fun. Taking to the skies with the propeller calls for you to thumb the appropriate button, as does using the Super Hoop, which creates a shield around Spike and damages enemies on contact. To use the Slingback Shooter, you need to switch the camera to first-person mode and take aim. Still, you don't need to be a crack shot. The game is very forgiving of people with mediocre shooting abilities. You can seemingly miss your target by several feet and still register a hit. The most useful of gadgets, the Stun Club and Time Net, are pretty easy to use. You can catch monkeys by simply swooping them into your net or knocking them out with the Stun Club and then moving in to apprehend them. You can swing both these gadgets by holding down the appropriate face button and moving the analog stick, but catching apes the traditional way feels easier.     Each stage boasts excellent design and impressive size, and the PSP's fantastic screen lets you see it all in crisp detail. One the downside, Spike lacks some of that finesse from earlier games, so traversing the environments gets tricky at certain points. The loss of precision will cost you lives, especially when jumping from platform to platform. And speedily making your way across a narrow strip of land? Forget about it. You'll die several times for sure. On occasion, Spike also has issues grabbing onto ledges when making those Jackie Chan-style leaps between gulfs or canyons. Practically anything that requires an arguably high level of elegance is tougher than it should be. On the Loose could have benefited from tighter control, no doubt.    Thankfully, you can manually control the camera by pressing the left shoulder button. A quick tap will center the camera behind Spike, where as holding it down switches the camera to a first person view. You'll use this technique a lot, especially when standing at the foot of a precipice. Unfortunately, it's a little too easy to accidentally switch into first-person mode (which freezes Spike in position) when all you want to do is center the camera. This is especially annoying during race sequences, when you need to center the camera to get your bearings before running across a three-inch thick beam. You lose valuable seconds every time it happens, and it happens more often than it should. Apart from this, On the Loose has a few glaring camera problems. The camera sometimes gets lodged in a boulder or winds up behind a wall. This too, easily contributes to several cases of premature death.    If the main adventure lacks a bit of refinement, then the mini-games lack serious polish. You can unlock four mini-games by collecting Specter Coins, scattered throughout the game. You can also score Specter coins by defeating Jake (remember him?) in a number of obstacle courses. The first mini-game, called Snow Kids Racing, costs 10 coins, with Specter Boxing, Jake Attacks and Ape Ping Pong setting you back 20, 30 and 40 Specter coins, respectively. Each mini-game functions decently, and it's cool that they're there, but none of them offer anything terribly exciting. Skiing down slopes seems like a matter of luck and cosmic destiny, as controlling each skier feels downright wonky. Specter Boxing and Ape Ping Pong control better, but they still flounder as mild diversions. Again, it's nice addition, if only because it's an addition to an already satisfying adventure.       Visually, the game looks like the first Ape Escape, only in high resolution. It's bright, cheery and decidedly kid-friendly. While not the best looking game on the PSP, On the Loose stands on its own through a great sense of quirky style. Characters animate fluidly, and most of the game runs at a brisk pace. Although sparse, the special effects look pretty good and give the title a little extra jolt. But not all is well. Textures reflect the simplicity of earlier Ape Escape games. They're not ugly, but they lack the kind of complexity seen in other PSP offerings. You'll notice several instances where the environments tear and the frame rate takes a noise dive, but apart from this, there isn't very much to complain about.    In summary, Ape Escape: On the Loose rekindles fond memories of the PlayStation classic. It certainly doesn't offer anything new in terms of mechanics, but the solid gameplay of the original remains, making On the Loose one fun game to carry in your pocket. Fans of the series will probably miss the second analog stick, but having gadgets mapped to the PSP's face buttons works well, just not as well as before, and definitely not as intuitive. Graphically and visually, On the Loose looks pretty good. It's makes great use of a super-bright color scheme, which is only enhanced by the PSP's mammoth screen.", "date": "Mar 25, 2005"}