{"name": "Mario Party Advance", "name_review": "Mario Party Advance", "ref": "https://www.ign.com/articles/2005/03/25/mario-party-advance", "text": "Two years ago, Nintendo tested the portable Mario Party waters with a game that combined physical cards with the Game Boy Advance's e-Reader peripheral, enabling players to scan in simple mini-games from the dot matrix code imprinted on the cards' edges. It was the first taste of GBA Mario Party, but it's taken Nintendo this long to produce a full-fledged cartridge experience for partying with Mario on the go. Mario Party Advance has been tailored more for an individual, solitaire experience when compared to the console series, now at Number 6 on the GameCube. The GBA version features a whole slew of different things to do and play, but it all seems just a bit uncreative for the first outing on the handheld system.   Like the console version, Mario Party Advance is a lot of little challenges strung out in a board game style presentation. But unlike previous games in the series on the console, the board game is specifically made for the single player adventure. Here, players roll dice and maneuver across the playing board to reach specific spots on the field to acquire ~gaddgets~ that will unlock goodies outside of the main game experience. The challenge is to remain alive as long as possible in the board game; since you get a finite amount of rolls of the dice, the adventure ends once you're out of turns. Luckily there are plenty of opportunities for addition dice rolls in the form of mini-games, and it's these games that make up the meat of Mario Party Advance. Winning these really, really basic challenges awards an additional batch of dice rolls which keeps the adventure going.  The idea in the single player mode is to complete all the tasks across the entire playfield. Each main location on the board has a character ~fetch quest~ that requires the player to find a spot on the board in which to retrieve an item or element. Upon returning to that spot, you're rewarded with an unlockable. This element certainly extends the gameplay for a long, long time thanks to the fifty unlockables Mario Party Advance has to offer, but it also drags out the experience to an almost uncomfortable level. There's so much text in the game because each task features a character with the gift of gab, and if you fail the task by running out of dice rolls, you have to sit through all that text again and again until you get it right.  Ever since Hudson Soft produced Mario Party to Nintendo 64 gamers more than a half decade ago, the company's specialized in mini-game board games across a ton of platforms. Hudson's worked with Sega for Sonic Shuffle and Disney for Disney's Party, but it's Nintendo's property where that studio's mini-game department really shines. The Game Boy Advance's mini-games, however, range all over the place, and none ever really reach that ~wow, that was fun!~ level. Most of the dozens of games are actually on the bland side, featuring some rudimentary platform challenges or memory games that have been done a billion times before in other games. The 2D environment must have restricted the team's creativity in providing some challenges that are imaginative and fun.  A lot of the unlockables can be played either in single or multiplayer competitions via single or multiple cartridges, and that's really where the ~party~ in Mario Party Advance comes from. Surprisingly, as a late-generation GBA game, Mario Party Advance does not support the Nintendo-created Wireless Adapter, and for a game that's meant to play with multiple people, to see this feature left out of the final product is somewhat disheartening.  Though multiplayer is certainly a focus, what's surprising is that the adventure board game, the gameplay staple of the console Mario Party experience, cannot be played with more than one player. Instead, the company has created a somewhat useless physical board game that's much like something you'd find on the back of a box of Frosted Flakes. In Mario Party Advance, players use the software in the cartridge to roll the dice and perform games of chance (mostly Hot Potato or Roshambo style) when the board's space calls for it. It's a far cry from the virtual board of the console Mario Party experience, and I can't imagine all that many people actually snipping up the sheet of paper to take part in this portion of Mario Party Advance.  On top of this, the actual game feels like a first generation Game Boy Advance title due to its incredibly basic and rudimentary graphic and sound presentation. Nintendo has usually been great about putting technically competent development teams on its GBA titles, but the style in Mario Party Advance puts a visual and audio appeal below the Nintendo standard on the handheld. Mario Party Advance isn't so much a fiesta this time around, at least in comparison to what console gamers have gotten in past editions of the series. The GBA version is more focused on the single player experience, because much of the game won't become available until they hit the board game solo. That wouldn't be so bad if the single player adventure was tighter and more creative than what's been created here -- the main experience is slow-paced and unexciting, and many of the mini-games wouldn't even be worthy in a regular platform game design. But the game's not all that bad, with a nice assortment of basic one-off challenges that can be played at any time...once you've unlocked them in the main game, of course. It, at the very least, offers a lot of bang for the buck.", "date": "Mar 25, 2005"}