{"name": "NARC", "name_review": "NARC", "ref": "https://www.ign.com/articles/2005/03/26/narc", "text": "I had serious trouble coming up with a good way of introducing Midway's politically incorrect third-person action game, NARC -- the strapline being an introductory line of particular importance and difficulty. No matter what I dreamt up, nothing seemed worthy of representing NARC's deeply disturbed F-word flavored humor. Nor did any of my proposed straps manage to properly convey how fleeting the exhilaration behind abusing authority really is.   I eventually settled with the whole ~whore pummeling~ line because stealing crack off a prostitute by way of first introducing her stomach to an officially stern knee seemed dark enough, vaguely amusing enough, and completely indicative of the totally pointless raw experience the game offers. For reference, some of the other crass options I threw around included:  Put your hands up so I can shoot you in the balls for kicks!  Of course I'm a cop. Can't you feel the authority flying off my club when it hits your face?  Man, some mother-*bleep*-ers are always trying to ice skate up a hill.  Chief, I shot our suspect and about 400 other people I suppose we could call suspects if anyone asks.  I'd totally be a better cop if I still had my bright pink motorcycle suit on.  17 years later and it's still kind of fun to mercilessly gun down filthy hobos. It really is all about life's simple pleasures, isn't it?  See mom, I told you smoking crack isn't a bad thing! It just gives you super eyesight.  Lowbrow choices for a lowbrow game. That was the point, anyway.   I chose those ones because I thought it was important that everyone stop and understand NARC right from the beginning. This is as no-frills and unpretentious as gaming gets. This is also a dark, twisted, offensive and morally vacant game. Yet it's such an outlandish cartoon and so totally blown out of proportion that it's hard not to laugh (or at least giggle). And the ability to elicit laughter? Well, that's usually a big positive.  Yea! It's Law Enforcing Time NARC doesn't masquerade behind some morally ambiguous gray area. You just do drugs and kill people. NARC also doesn't claim to offer the most feature rich, exciting action on the planet. Nope, you just do drugs and kill people. But you might still smile enough to make that simplicity worth a look.  Like any good high, NARC offers a brief period of euphoria followed by the sudden dramatic realization that what you're doing is probably very, very bad for your brain and/or spinal column. Yet, it's also likely to beg for a second, third, fourth and fifth try. Every single time I turned on NARC I knew my brain and backbone were deteriorating even further. I just couldn't stop stupidly laughing long enough to really hammer down all of the many reasons why I should drop the controller and plug in a better action title. It's that kind of guilty pleasure. NARC is pornography and peanut butter cup ice cream. NARC is a morning of hooky followed by a nap set to the mellow PBS droning of Draw Along with Paul Ringler. It's a last minute cancellation of a hot date just to make more room for bloody Farscape reruns.   When trying to figure out why the game is like this, I realized that our own David Clayman put it best when he suggested that NARC would be the greatest live action television show / movie of our time. It's true, too. The random brutality that makes this kind of wildly unreal game so endearing represents a fresher comedic take on the usually gritty seriousness of other urban life action titles. After all, where else can a fellow run around (which itself involves watching a pretty comical animation), flash a badge at some random dude, punch him a few times, kick him in the junk, wrestle him to the ground, cuff him, beat him some more, then just start shooting at anything that walks while announcing that you got some seriously hardcore s*** to sell?       Yup, NARC is definitely wise beyond its years. The key to appealing to a mass market isn't any kind of advanced control or state-of-the-art graphics (which no 5 million selling titles have). Obviously, the key is opening with a tutorial filled with pearls of choice wisdom like, ~If you are overwhelmed by enemies, try using crack if you have any. Crack will highly increase your accuracy for a short time.~ Then, once you master the proper allocation of crack to yourself, you can get on with the whore and junky clubbing. That's just ingenious.  Apparently there's a story behind it all, too. There's this new Liquid Soul drug on the market that can supercharge almost dead people and keep them moving along in an enraged zombified state for quite awhile. Your job as one of two undercover narcotics officers is to unravel the mystery behind this drug and stop its supply and sale. (Kill people and do drugs, remember?)  The specific missions that develop this tale are tied together in segments -- perform a task and that might expand to include a few more related tasks before you can report back to HQ and get something new going on. Between the big jobs, there appear a few select mini challenges with no impact on the plot and little gameplay relevance. And, between all this directed action, NARC's dank streets are always open for exploration.  For dutiful law enforcement agents, street play might include seeking out loitering dealers, muggers and prostitutes and then busting them all for obvious reasons. For the not so honest officer, the street lets a player kill thousands of people, randomly arrest anyone who happens to be within spitting distance, and viciously kick and punch even the most benign bystander to death.  An extremely forgiving badge rating system governs whether or not your cop is a good detective, a mediocre beat walker, or some jobless scum. Start clubbing and killing with reckless abandon and you'll find yourself skulking around as a hobo or street cop, prohibited from progressing through the game's storyline until you strive to arrest real criminals and deliver evidence to build your character back up to righteous levels.  It's Badge Rating Lowering Time  While this badge rating system helps break up the typical assortment of exploratory, assault, surveillance and thuggery missions by forcing the player to experience the open street, it has no real affect on gameplay. It's so easy to sway between good and evil without consequence or reward that it often feels like nothing done in NARC matters at all. I could keep on delivering the evidence I get (drugs and money) into some nondescript police depository, but why would I bother if I'm not getting anything back in return? Once I'm a good cop, I'm just a good cop. That's it. Being a better cop doesn't mean anything. Conversely, I could opt to horde my cash and drugs. But that's even more pointless because cash is really only good for buying drugs and drugs are only good for temporarily powering up the main characters.  NARC's biggest gameplay gimmick is the use and abuse of a handful of these illegal substances, but this particular aspect of the game is underdeveloped enough to matter even less than whether or not the player is good or evil. While some accompanying mini-games would have ideally handled the use of drugs, narcotics actually turn out to be items that simply turn on and off. NARC uses them all to expand gameplay by creating a variety of different mind altering states: pills grant players super speed, rocks give the player better aim, tablets create easily identifiable crooks, and so forth. In combat, it's not really necessary to use any of the drugs, though. It's also not possible to combine any of them. And so they're just kind of there.  Whether you're high or not, the action never moves beyond the primitive realm of shoot, punch, kick, tackle, grapple, throw and pummel. The only time the game gets legitimately challenging is when it becomes necessary to toggle out of the drug menu and select your beating fist or holster a weapon to arrest a suspect. The interface just isn't tight or considerate enough to let its players jump from one kind of attack to another without a hassle, which makes the plainly limited combat system somewhat more trying than it needed to be.  But really, why bother with weapons when you can just dive into a civilian and perform a neck shattering super bust maneuver? That kind of random blinding violence works to create a somewhat more appealing title. Looking for mindless amusement for friend prices? There's nothing quite like piloting a blocky little man around densely populated streets and randomly punching dudes before arresting them.If you're seeking something more -- anything more -- look for some other game that doesn't encourage its players to drop acid just to see the funny clown heads.", "date": "Mar 26, 2005"}