{"name": "World Tour Soccer 2006", "name_review": "World Tour Soccer 2006", "ref": "https://www.ign.com/articles/2005/03/29/world-tour-soccer-2006", "text": "Soccer must be a tough sport to get right. After what seems like years, EA's FIFA series still hasn't nailed that perfect balance, while Konami's Winning Eleven inches ahead with the most minuscule and subtle of advancements. Sony's World Tour Soccer, on the other hand, appears to have good years and bad years, swinging back and forth like a pendulum. This season happens to be a moderately good one, sort of half way between swings.    On the one hand, you've got a robust set of features, expanded career mode offerings with new teams, trading abilities, and subtleties. You've also got a healthy -- very healthy -- set of FIFA licenses, which in the world of professional sports, means a lot. On the other hand, the accuracy of the game's controls could be tightened, the default difficulty level is way too easy, and there are things like awkward camera angles and terribly inaccurate announcing that, metaphorically speaking, make this a Jackson Pollack kind of soccer game. It's splattered all over the place.   Let's start with the positives. With 935 teams and more than 19,000 real players, World Tour Soccer 2006 comes in strong with numbers. The game boasts the FIFA Pro license, and the combination of real teams, leagues, and distinguished players provides the title with a sense of real genuine goodness. So, it's broad in its appeal, which is a good thing, bolstered by the fact that it's been released worldwide in four different languages (English, French, Spanish and Italian).    As features go, the list is solid and impressive. Those who love their EyeToy can scan their faces in to create a more realistic, in-game feel. You'll definitely want to play with the lighting and snap a few shots before deciding which the best shot is, but at least you can do it. The mode list keeps things thick and deep. You can play in Exhibition mode, which offers a health amount of options, Career mode, and a host of Cup, Season, and Challenge modes.   Not a very good defender is he? The Career mode is where you'll get the best, most comprehensive singe-player experience. Here, you'll start your players off in high school, playing in po-dunk institutions across the country, building up players and advancing through semi-pro to pro leagues. The early games are quite simple, lacking fan-fare and any kind of news, updates, or real team management strategy. You'll have to wade through the early years before any substantial team ~stuff~ happens. And when it does, trading, hiring, and building that team can be relatively exciting -- though it's less compelling than, say, Winning Eleven 8 in this regard. We're talking 20 seasons, so be prepared to play a lot of soccer games and to experience very little separating game action.   The gameplay itself is a mixed bag. The ball and player physics are decent. The ball moves with mostly realistic bounce and gravity. There isn't Konami's subtlety of sense of ball curving and intricate pass combinations crafted by the players, but there is a certain amount of core play here that works and is compelling enough. It's quite amazing to see these players run, however. No amount of crack cocaine or speed could ever propel real-life humans to run like this. When you punch the spring button (R1), these dudes literally blaze across the screen like the Bionic Man. It's like watching a fast-motion clip.   The animations are also a potpourri of good and bad. Sometimes you'll see a player move elegantly and fluidly. Other times, their animations are slow and too long, other times, they' chopped off and short. These little deficiencies add up to less realistic movement and less suspension of belief.    My experience was colored greatly by the difficulty level I picked. There are four difficulty levels (Amateur, Pro, World Class, and Master Class), and I picked the default one, Pro, which is always designed to be the most suitable for all gamers. The pro level of difficulty is a joke, plain and simple. Any blowhard can pick up the controller, make less than three passes in less than 30 seconds, and run circles around the opponent, and score at will. This level of difficulty is so easy it's shameful. I lost zero games in 20 tries, with contests of 9-0, 8-0, 5-0, and 4-1. Interestingly enough, I even watched the opponent AI defender run the ball into his own goal. Ouch. You can literally run the ball from the defender's position, easily anticipate the enemy prepare for a slide tackle, make a simple move left or right, and then, to put the final icing on the cake of humiliation, run around the defenders and shoot the ball from less than five feet away from the goalie to score. It's pathetic.   In Pro mode, the AI is both horrible on defense and awful on offense. On offense, the players never try to drive into the opponent goalie box, instead choosing to kick from three-quarters of the field, taking awful, wild, and no-chance shots. They had no chance of dealing with the simplest of tackles or maintaining the ball for the smallest periods of time.    Moving into the World Class level of difficulty changed things pretty drastically. The enemy doesn't provide that wide buffer zone of comfort and challenges you regularly with soft tackles, dribbles and even complex one-touch passes down the field. The game is still easy, but the AI is more aggressive, more willful, and resistant. Your players fill in their positions well, moving in correspondence with you. In a neat touch, any pass you make when there is only one offensive lineman in between you and the goalie, is interpreted as a through-pass, giving you that beautiful chance to beat out the opponent for a perfect shot. You could also see it as an annoyance, especially if you didn't want to make a through-pass, but in my humble opinion, it's at least a move in the right direction.   The opponent AI is still a wonky, however. It often dribbles all over the field, rudderless. It often kicks the ball out, even though it has driven into its own territory and moved into the corner. The AI continues to make terrible, terrible shots on offense. In one game, I played against Tahiti, a three-star team, against Mexico, a three-star team. In the first half, Tahiti shot the ball like 10 times, all from way too far out, and nine of them were absolutely worthless. The only good one was an out-of-the-blue bicycle kick blast that missed. At least it was within five feet of the goal box though. In World Class, both goalies displayed a solid performance, grabbing balls, defending high shots, and dive-blocking close-the-bar outside shots.    A couple of nice touches caught my eye. I noticed you can actually get in the goalie's way when he's kicking it, drawing a foul. That was neat. The throw-ins were handled well and smoothly, with the camera angle coming in quickly and neatly. Sony's London Studio took a page from FIFA's corner kicks, enabling players to pick face buttons to organize a systematic corner kick, and, for the most part, it works.   Speaking of smoothness, aside from the mixed bag of motion-capture work and blend of short and overly long animations, the motion of World Class Soccer is functional; it usually holds at 30 frames per second. The player models, clothes textures, musculature, and faces show a better than average sense of realism. Player expressions are almost vacant, as are the robotic coaches on the sidelines. There is little eye movement, though some emoting is done when a yellow or red card is pulled (you bet I hade my fair share of reds).   The game offers a variety of different weather patterns of times of day to play, though neither the rain nor the snow seems to affect the field or the play in any meaningful way. It's not a great looking game, really, but it's not a bad looking one either. It's just slightly a nude over average.   Unlike the ridiculous over-the-top, mumbo-jumbo, gooble-di-gook dance hall trash found in the awful FIFA Street, similar kinds of music are used in World Tour Soccer with much better, more subtle success here. Some of the musical choices are, to be honest, quite likeable, with catchy, sophisticated licks and phrasing. There are some plain good songs in here; all found in the menus systems. Unfortunately, that's really the only goof thing I can say about the sound.    The commentating is horrendous in every facet. Every time a player shoots, the commentator yells his name as if that's the greatest thing the world has ever seen. Even if it's a terrible, awful, inane stinker of a shot. He regularly makes errors. You'll pull off a terrible move, kicking the ball out, and he'll say something like, what a great move by so-and-so. There game is almost entirely void of any analysis, and each game is ended with a typically parallel universe conclusion. After I deployed a dull, 9-0 whipping to the other team, the commentator exulted by saying what a dazzling impressive and exciting match that was. He's so regularly off, wrong, and wacky, it's almost fun to hear him. Almost. Studio London should get a new commentator, new system, and new lines because this commentating is bottom-of-the-barrel slop.World Tour Soccer 2006 does enough basic things right, while adding in a host of new features and improving upon others, that the awful, weak, and outright erroneous aspects of the game are somewhat forgivable. It all depends on what kind of game you want to play. Want to run rough-shod over your opponent? Than simply play in the default ~Pro~ mode of difficulty. You can dribble through the entire ranks of the opposition and crush the ball into the net without passing once. You need no strategy or skills. Just weave back and forth. Moving the difficulty up a notch changes things for the better, but the AI still proves to do dumb things, shoot terribly, and weird out every so often.This is a tough choice. On the one hand, FIFA does a number of arcade things equal or better than WTS06, while on the other hand, Winning Eleven 8 shreds both games in the simulation department. WTS06 is a mostly competent game, but it finds itself in the unfortunate spot of being the lesser in both categories.", "date": "Mar 29, 2005"}