{"name": "Brave Fencer Musashi", "name_review": "Brave Fencer Musashi", "ref": "https://www.ign.com/articles/1998/11/12/brave-fencer-musashi", "text": "Square is on a roll. Who would have thought that the Japanese gaming giant, now self-publishing its own games in North America, could manage to churn out four high-key titles in almost as many months?  It's latest is Brave Fencer Musashi, a game that's no doubt familiar to followers of the developer's work. A combination of action and adventure elements that will no doubt conjure comparisons (like this one) to classics such as Zelda, it's the story of Allucaneet kingdom's fight against an evil intruder. Its ultimate weapon: a pint-sized facsimile of the legendary samurai Musashi. Japan's greatest warrior may have been a gruff grown up, but in this game he's a wise-cracking kid. Go figure.  Musashi's lengthy quest involves running, jumping, and slashing his way through six chapters, from one side of the land to the other. Not only does the little guy have to get his hands of five legendary scrolls before the bad guys do, but he's also got to (surprise-surprise) rescue a princess. Don't let the simple description fool you though; there's a lot more than simple swordplay involved.  Along the way, Musahi not only has to talk to townspeople and solve various puzzles of the not too difficult, yet still noggin-scratch material variety, but utilize a number of ~assimilated~ abilities as well. You see, our hero can launch one of his two swords into enemies and use it two draw out a special power, be it a magical shield, rapid fire bullets, and many more.  Some of the game's aforementioned puzzles involve paying keen attention to an ingenious 24 hour clock. Daytime turns to night and certain objectives can only be met (meeting up with store keepers, for example) during the right hours.  Musahi's foes are numerous. Ranging from potted plants to gun-toting warriors, they all have one thing in common: they answer to a boss. In traditional action game style, the game puts Musashi up against a variety of boss characters, starting with a giant steam-powered robot and only getting more fiendish from there. Square has managed to impress me yet again. Dipping its hand into the action-adventure category for the first time on PlayStation, it's produced a game that may convey the epic scale of Xenogears, but is one heck of a blast while it lasts.Musashi drew me in via its solid control, clever puzzles, excellent visual design, and loads of personality. As good as I found the gameplay and visuals though, I've got to give special mention to its stellar soundtrack. In fact, I'm humming it as I write this.It's obvious that Square was going for a Zelda-style (the old 8-bit game, folks) with Musashi, but it ended up very action heavy. Quite frankly, that's fine by me. In fact, I found myself enjoying the action scenes so much at points that I almost wished the game was without its more ~RPG-esque~ town and exploration elements entirely. What I really didn't care for was the surprising amount of slowdown and the simply annoying (in my humble opinion) voice acting. Some of the voices were passable, but Musashi's began to great on my nerves rather quickly. I actually found myself skipping it entirely after a few minutes.That aside, I still consider Musashi one of the year's best PlayStation games. If you're looking for a top-quality action-adventure game, it's an absolute must-have this holiday season. However, if true Zelda-style play is what you're after, the already-released Alundra will be more up your alley.", "date": "Nov 12, 1998"}