{"name": "FF VII Snowboarding", "name_review": "Final Fantasy VII Snowboarding", "ref": "https://www.ign.com/articles/2005/04/01/final-fantasy-vii-snowboarding", "text": "It's almost a dirty trick. Log on to your VCAST game channel and lay witness to the opening letters of Final Fantasy. For some gamers, this may induce a heart murmur of varying degrees, but before getting too excited, wait to watch the entire title of the game scroll by: Final Fantasy VII Snowboarding.   Yeah.   Final Fantasy VII Snowboarding is a 3D game based on the snowboarding mini-game from the original Final Fantasy VII RPG on the PSone. Starring a shredding Cloud, you must race down three courses, collecting balloons while avoiding icy obstacles. It's not quite a Square Enix fan's dream -- especially considering the fact that Japanese cellphones have a proper Final Fantasy RPG -- but it's certainly better than a poke in the eye.   As you slash down the three hills, you collect balloons for points. Several balloons can be grabbed just by running through them, but others require a little jumping technique. Balloon points figure into your final score. If you finish the course speedily, collect enough balloons, and do it with a little style, you can open up the next track. Each track gets a little longer and offers up more challenging obstacles, including snowy Moogles, thick tree groves, and sharp turns. Unless you played the hell out of the mini-game in the PSone game and have achieved a certain fusion with your phone's thumbpad, it will take multiple attempts to complete each course.   Final Fantasy VII Snowboarding is not the most engaging cellphone game you'll play -- but it's safe to say it certainly surpasses the majority of VCAST offerings. The game actually presents a solid sense of velocity, but get going too fast and the admittedly non-elegant thumbpad may steer you wrong. You will wish, from time to time, you had a PSone pad -- usually when you watch a balloon zip by because you couldn't turn tight enough.   As a 3D game, Final Fantasy VII Snowboarding is a mixed bag. The Cloud character model looks great -- just like his PSone counterpart, but with a little more grain, but still impressive for a cellphone. The courses are somewhat plain, by in full 3D, unlike the static balloon sprites that hang over the landscape like refugees from some 1987 side-scroller. The camera could use a little work, as it sometimes does you wrong on sharp turns. It will occasionally swoop behind a snow bank, showing you the inside of the track model rather than where little Cloud is going.Like Musashi: Mobile Samurai, Final Fantasy VII Snowboarding is a great showpiece for your new 3D handset. But there are only so many showpieces you can have on your phone before you want something a little meatier. Final Fantasy VII Snowboarding is definitely a step up from most VCAST games by actually using 3D as part of the game mechanic, rather than an ill-fitting ~look at me~ gimmick. I wish the camera didn't get so sloppy. I wish the thumbpad was a better controller for this type of game. But even with these drawbacks, I was still somewhat impressed by Square Enix's efforts. The 3D revolution hasnt necessarily taken hold yet, and I still question its current validity, but Final Fantasy VII Snowboarding feels like the start a snowball that will only get bigger over time.", "date": "Apr 1, 2005"}