{"name": "Doom 3: Resurrection of Evil", "name_review": "Doom 3: Resurrection of Evil", "ref": "https://www.ign.com/articles/2005/04/04/doom-3-resurrection-of-evil-2", "text": "was like a brief honeymoon of really cool stuff, but the buzz wore off early, especially in the wake of Half-Life 2, CoD: United Offensive and Brothers in Arms. Yeah, it looks damn good. But can it hold a conversation? I'll get back to you on that. While the engine has few peers (of this generation, only the HL2 renderer is about as good), the AI turns out to be oversimplified, the gameplay dated and repetitive, and the environment just too damned dark. But hey, there's an expansion pack called Resurrection of Evil that adds more levels, a continuation of the story, a couple more weapons and several new monsters. For the grab-you-by-the-short-hairs MSRP of $34.99, it better be pretty good, right? After all, you can get a full retail game for that much, on sale brand new, or a few months old at regular price. Increased cost of development, you say? Come on, now. This is being built on top of existing code. Cry me a river!   So what all do you get for thirty-five smackers? Let's talk about weapons; everybody like weapons. You get a grabber gun and a double-barreled shotgun. The new shotgun packs quite a punch but takes a while to reload, and the grabber you've probably heard about. Its main difference from HL2's gravity gun is that it can capture and redirect large projectiles (like fireballs and plasma balls, as opposed to bullets and grenades). It's pretty cool, because there's a lot of stuff you can push around this time. It can also be awkward to use, as aiming it just right for capture and release takes some finesse, and finesse is rarely something you have time for in a close-quarters situation like this. Still, it provides some sorely needed environmental interactivity, and you're actually rewarded for exploring and finding little bits of ammo and armor, instead of being punished every single time with a monster closet/teleport booby trap like in the original game.   Okay, maybe it wasn't every time that hellbeasts appeared in a flash of orange lightning right up my arse every time I picked up an armor shard sitting in the middle of the room, but it felt like it. Sadly, Resurrection of Evil does not buck this trend, and the monster closets are just as prevalent as before. I don't know, if I was a demon, I'd be running around and tearing crap up instead of waiting in a little compartment for the hero of the hour to run across my door trigger. Is this supposed to be ~back to basics~ gameplay? Am I asking to much for everyone to be present and accounted for when I enter a room? Perhaps. But I know what fun is, and fun is blowing crap up. There's plenty of that to go around in RoE, but there's also a demon humping my leg from behind, and he wasn't there a second ago.     All right, so what about the new monsters? For one, there's the crawly demon with two heads who throws plasma balls instead of fireballs and packs a mean melee attack. He can be taken fairly easily at medium range, but the grabber gun typically takes a little more time to use than I can afford, and it's typically easier to just dodge the plasma and kill with conventional weapons. The flying skulls are a lot easier to handle, however, but you have to chuck them quickly, since they can apparently still attack you when you have them held in the grabber field. This creates an awkward situation because this gun distorts the air in front of you when activated, making it difficult to see to the end of a hallway and such. It's a neat effect, but I could do without it, tactically.     There is one significant improvement from Doom 3, however, in that the environments are a lot more varied. Some people liked wandering around the enormous but mostly claustrophobic and very dark scientific/military complex for hours on end. I thought it got kinda monotonous after a while. Well, RoE features much more wide-open spaces, more varied locations, and just plain cooler locations. Unfortunately, I can't be too descriptive without giving away spoilers. But, for those of you who were disappointed by Doom 3's level architecture, you'll be pleasantly surprised by what RoE has to offer. It will also probably take you 12-15 hours to wind your way through it, so this is a impressive large level addition.   Pleasantly surprised enough to be comfortable with $35 less in your wallet? Well, RoE is an enjoyable expansion pack that manages to fix a few problems in the original without losing the atmosphere, but I really can't justify such a high price. Sure, you can find it on sale for as little as $25, and I think I could tentatively recommend it at that price point, but this is simply too much, in my opinion. I would have expected several more new weapons and a lot of multiplayer maps. How about a flamethrower, or pistols akimbo, or SMGs akimbo? Heat-seeking missiles, mines, sticky bombs, a katana sword, throwing knives, leech gun, riot shield, sniper rifle/rail gun Or maybe upgradeable weapons.   There is the artifact, though, and its semi-Bullet Time trick (called Hell Time) can be quite useful. Unfortunately, instead of being an occasional advantage, it's typically something you have to use in order to progress through certain choke points without being turned into hamburger. Sometimes it's an environmental obstacle, like deadly machinery with gears and smasher things that move too quickly for you to get through, but mostly it's waves of enemies that appear soon after you come across the bodies you can extract artifact power from. Rarely will you be able to save up your artifact's power for when you want to actually use it--you'll more likely use it when the game wants you to. The artifact will also eventually grant you a couple other cool powers, but there uses tend to have the same timing issue as with Hell Time.      In the end, RoE maintains a precedent of a few frustrating design decisions marring an otherwise compelling premise. id creates some fantastic engines and multiplayer experiences--I don't think anyone would deny that. But when it comes to crafting a single-player experience, you just can't do the monster closets and primitive AI anymore. You can't sabotage so many armor and ammo pickups with booby traps that make you say, ~Okay, I'll have more ammo and health once I grab this stuff, but how much will I actually gain once I'm done with the creatures who will appear as soon as I hit the trigger?~ As with Doom 3, I find myself avoiding anything that's sitting in the middle of a room. I find myself hesitant to grab anything, actually. And it's not because the atmosphere has spooked me.   It's because the enemy's appearance is unpredictable in number, direction and ferocity. I might die, not because I failed to fight effectively, but because I was overwhelmed by ambiguous forces and must thereby die my way through the game if I want to grab all the health and ammo I see. Traditionally, you're told to stock up on everything whenever you see it. Grab a full health pack even though you're mostly healthy, because you always need to be at full capacity. But by creating so many booby traps, this tradition is subverted and the player has to adjust to a survival mode, when Doom 3 is synonymous with viscera and constant action. And you know, there are other games out there that do survival horror better, when it comes right down to it.    Thankfully, multiplayer offers a solid vacation from the disappointing campaign. Player capacity has been increased from four to eight, with no noticeable slowdowns as a result, and there's the all-new CTF mode, which is pretty fun. Here, the maps are well-designed, and the action is just like id multiplayer should be: hairy, chunky, and virtually non-stop. Some of the maps are quite cool and imaginative, while others are more standard but quite serviceable. The maps are also crafted nicely to cater to the smaller groups. As I've said before, the number of players on a map isn't nearly as important as the map itself, and RoE holds its own quite well in this respect. There was no grabber gun in the modes I played, but the double shotty complemented the original arsenal pretty well. In the long run, Doom 3 multiplayer typically boils down to a game of ~Guess Who Has the Rocket Launcher,~ but it's diverting enough for a few hours of play; I certainly wouldn't crown RoE as the new king of multiplayer.   The buckshot spread is unusually narrow, even by straight-up FPS standards, the assault rifle is weak against just about everything, and all the weapons end up bowing before the might of the rocket launcher. Maybe if it took a little longer to load another rocket, or if its respawn time was slower, things would be different. As it stands, it's typically a matter of finding the rocket launcher or dying within the first thirty seconds, unless you can snag a shotty and get some lucky shots, assuming you can get the guy one-on-one, which isn't as likely as with other MP experiences, since the maps are tighter and people are closer to each other.Now that the bloom is off the rose, Doom 3's garden doesn't look quite so lush. The levels in RoE are generally better and more varied than what we saw in Doom 3, and there's plenty of them to go around. If the rather basic AI and constant traps and monster closets didn't bother you much in Doom 3, you'll probably get a kick out of RoE, although I don't expect most people to be willing to pony up 35 bones. I would recommend getting it on sale or waiting until the price goes down. While RoE provides much more interesting and tactically useful environments, it still doesn't quite offer the challenges we've become accustomed to with shooters like Far Cry and Half-Life 2. And from what I've seen of Monolith's F.E.A.R., RoE's appeal will slip a notch futher, as the encounters in F.E.A.R. are consistently more satisfying and the supernatural element more effective, in my opinion.", "date": "Apr 4, 2005"}