{"name": "Close Combat: First to Fight", "name_review": "Close Combat: First to Fight", "ref": "https://www.ign.com/articles/2005/04/07/close-combat-first-to-fight", "text": "Following the wave of militaristic games over the past seven years, developer Destineer's first independent game on Xbox and PC brings a distinct squad-based gameplay to market. Unlike Ubisoft's Rainbow Six series, in which your team leans toward step-by-step manual control, or the even more stringent Full Spectrum Warrior with its complex set of commands, Close Combat: First to Fight is designed for your squad to act according to strict military protocol. Your squad of four is programmed to find its ready-team-fire-assist (RTFA) positions without your commands, and it will act to strike enemies and defend without your help.    Initially, that sounds weird. Why would you do that? Wouldn't the game be really simple then, if the squad did all the work? First to Fight makes it interesting, tough, and rewarding to play like a US Marine. And while the game is rough around the edges, with less-than-persuasive atmosphere, the gameplay is 90% there. The squad AI works well, the command system is solid and effective, and the game challenges you in a real-world way to clear the streets of Beirut from terrorists and evil scum alike. It's fun in a serious, straight-laced, bare-bone military way. Plus, the online game is a blast.   Gameplay  First to Fight is not a story-driven game, instead it takes a mission-by-mission design route. Destineer takes you into the streets of Beirut to clear out terrorists in a by-the-book US Marines-approved fashion. The storyline is narrated in a TV news style, so in between calls from HQ describing new mission objectives you'll see International News Network (INN) reporters describing the results of your actions and future terrorist action. You go in, do your business, and get out. It's similar to the Rainbow Six story-setups -- pretty straight-forward, fundamental stuff.   With about five missions split up into long multiple parts, the single-player campaign is substantial and worthwhile or any Rainbow Six, Ghost Recon or other military-minded gamer. You'll be able to command your team as a group to cover, shoot, defend, man vehicles, tanks, and turrets, or as individuals. Using MAGTAF (Marine Air Ground Task Force) rules, players control the fire team leader from the third battalion, first Marines, in a series of indoor and outdoor missions from a first-person perspective.   Swivel into rooms packed with enemies and watch your team go to work. Mechanically, First to Fight is generally solid. Your movement is slow and careful, and your team AI is skilled and experienced. The RTFA formation always places squad members in positions that protect it in all areas. So for instance, using the simple control mechanisms, you point the reticule toward a street corner, press action, and bam, the team runs there, setting up to cover in front, along the rooftops, and from behind. You can send your team ahead or keep them behind, but First to Fight is designed to use both. If you absolutely want to, you can defeat all the enemies by yourself. It's a tough road and not terribly fun. It is fun, however, to use strategy and tactics to command your team successfully in battle. First to Fight is a team-based game, both off- and online, so using your team is only a benefit. Plus, you'll be surprised at how well your team reacts and defends you.   On the other hand, there were a few situation when my troops didn't go exactly where I directed them to. For instance, when I was on a second story I commanded a marine to man a 540 caliber gun. The reticule changed color, the direction was cast, but he had a hard time getting there, returning to his original place before I called him back again. He made it the second time. The situation wasn't urgent, but if it were, I could have lost a man in combat.   Otherwise, the controls are slick. By pressing and holding the A (action) button, you can command your team to lay down suppressive fire, use an object (a turret, for instance), or cover. These commands work well, but the Marines won't just lay down suppressive fire anywhere. They have to see the enemy, which brings up problems as a game. To cross a street you feel iffy about, you should be able to lay down suppressive fire in the general area you want, even if you can't see an enemy. Not here, and it's a bummer.     Entering enemy-filled rooms works well too. When you approach a door, a new set of commands appear, giving you the choice to breach and enter or frag and enter. Once you've given the command, you press A to initiate it. Unlike the Rainbow Six series, there are no double doors and few multiple pathways to provide that pincher effect, and that's disappointing because with a squad at hand that particular tactic is key. Perhaps Destineer wanted to differentiate itself from Ubisoft's games, or maybe those situations aren't terribly realistic. Either way, I wanted to use the team in that way and couldn't.    In the single-player campaign, weapon wise, your options are limited to the M-16 A4, the M-16 A4 M203 grenade launcher attachment, frag and smoke grenades. You can pick up any enemy weapon on the ground, including RPGs, but after the mission ends they aren't retained. On your team, one marine carries a saw M249, another a rifle, you've got an assistant gunner.   Despite a few sticky areas, on the whole the game moves, plays, and feels really good. The M16 has a quick double zoom function, initiated by pressing down on the right analog stick. While scoping out far-away enemies, you can still call out commands, which is nice, and all of your basic HUD stats remain on-screen. The zoom function is superb, reflecting the general controls, which feel extremely quick and accurate. The A4 is extremely accurate. You can zoom in on specific points of the enemy's body, face, their shoes, shoulders, or elbows, whatever, and the enemy reacts locally to the hit. It's so nice to play a game that delivers such an extraordinarily precise aiming mechanic.    Then there is the while psychological model. You team functions by way of health, morale, and discipline. If you are a poor team leader, the team's speed, agility, accuracy are affected. If you keep them healthy, don't throw them into too many harrowing and deadly situations, and generally make good decisions, they will react quickly with good accuracy and agility. Honestly, there were very few times when my team was like, ~Dood, hell naw. I ain't doing that sh*t. This army stinks.~ No, none of that. I generally kept my men healthy, as a tight unit, and in good situations. Honestly, the psychological model doesn't have a significant affect on your team members as much as it does on the enemy. When you overtake the opfor (enemy in military terms) in a significant manner, you'll see them slump away, cower, or flee, in some cases sprinting right past you.     In split-screen, SysLink or on Live, the multiplayer is great fun. The special functions/weapons bring a lot to the single-player game. Depending on the situation, players can call in air strikes, send in mortar teams, call in snipers or send in choppers or tanks. While there are few situations when this happens, and in my humble opinion far too few, these calls are insanely fun. Watching a tank take get mortared or seeing a particularly nasty machine gun nest get slaughtered is supremely satisfying. The only major issue is with the sniper. It's difficult at first to know how to set him up exactly, where he'll be, and where he will be aiming. What's more, if you do need to call him in, you generally are being sniped yourself, and more often than not from a sniper who's hidden. The sniper situations could have been made easier.    Multiplayer  First to Fight was created for both offline and online players in mind. You can play two- to four-player split-screen missions if you can't get online. The split-screen option is remarkably satisfying. The co-op missions are actually better in many ways than the vs. modes because the teamwork required is so integral to success that one feels rewarded and skilled after having beaten any of the levels.    SysLink and Xbox Live support is substantial. With SysLink you can hook up two Xboxes, or using a HUB, you can link eight consoles. With either SysLink or Xbox Live, up to eight people can play simultaneously. The three modes provide long-lasting online play for team-oriented players or deathmatch fanatics; we liked it a lot. Cooperative mode enables you and three others to play through the single-player mode, with roles being played by each team member. Somebody picks team leader, another chooses saw gunner (M249 SAW), etc., etc. This affects your weapon type, but multiplayer games give you the extra benefit of using the superb shotgun. Oh yes, indeedy.      Modified Cooperative is basically the same as the Co-op, but with more choices, such as AK-47, SVD, the pistol, RPG-7, and the RPK. Fire Team Arena (FTA) is a rock-out balls-to-the-walls deathmatch situation. Two teams fight one another in a variety of specially designed deathmatch areas, and the gameplay is awesome. One-shot kills, shotgun attacks, team raids, you name it, this game is going to get clans and teams together in a big way.    Online we had few problems. The load times were the worst of it, and as usual, sound is occasionaly laggy, but the game is solid, fun, and deep enough, with enough maps and variations, to play for many months. Expect to upload new maps in the coming months, too.   Graphics  Visually, First to Fight is a mixed bag. On the one hand, the models, weapons, and the menus, especially the in-game menus, do a better-than-average job of reflecting realism and utilitarianism, respectively. On the other hand, the character animations of your team and Beirut civilians and terrorists, as well as the general surroundings and special effects, aren't quite as good.   Your RTFA squad, for the most part, is respectable looking. The gun details, body models, and the clothing are reflective of real US Marine garb, equipments, and the obvious haircuts, so they lend a distinct genuine quality to the game. The menus are pretty standard, really, but they too reflect a distinguished military flair, and this being a distinctly heavy military game means Destineer is being consistent and attractive to its perceived market. The in-game radial menus look and work well too.    First to Fight, however, loses traction in many other areas. The character animation is clunky and robotic. It looks as if it really didn't get done, or didn't receive that last wave of polish. The animation of your own team suffers too. But these animations are compounded by the fact that the character and environment collision detection are fudgy and awkward. You'll occasionally get stuck on objects. Walking up ladders is a chore. And sometimes, your team is just in the damn way too often. It's a tough thing to nail, squad collision detection, and you'll know it when you play the game.   Lastly, the special effects, lighting, and physics render mixed results. The special effects are actually quite minimal. Vehicle explosions, simple fires, and the like are nothing out of the ordinary. The natural lighting and room lighting work out well, producing natural shadows with good effect. But the character shadows are all over the place. You'll see your team and your own shadow in places they shouldn't be, passing through walls, and even spreading across unaware enemies. The in-house physics are cool, even if they are a little over-the-top as rag-doll physics go. When you lay down a grenade shot into an enemy-filled room and a terrorist flies out head over heels, it's silly but great fun to watch.   The game doesn't look quite this good in action. Overall, the visuals don't convince me that I'm really in Beirut. The effects, texture work, and lighting are minimal, weak, and inconsistent, respectively, stealing away realism and immersion that this otherwise realistic game delivers. The game supports 480p and wide-screen options.   Sound  Going for a realistic effect, Destineer's minimalist sound design is decent. Supporting in-game Dolby Digital, players find the game offers voice-over work for your team, the terrorists, and civilians (plus, the straight-laced narrator), with little music occurring in levels. You'll hear traffic (though you won't see any), people talking, and in some levels relentlessly looping sirens.   More than anything, though, the sounds of your men rattling off military checks, answering your commands, and shuffling their boots across the city streets dominate the aural landscape. That, and the sound of terrorists yelling, screaming, and mumbling to themselves.    The music is the stuff of nationalistic military taps. The anthemic nature of the music, again, reflects the game's super-focused military themes for better or for worse. First to Fight is very serious in nature, but unlike Full Spectrum Warrior there is little personality or character to your squad, so oftentimes the bare-bones effect is empty not atmospheric. Overall, the sound needs work.In many regards, Close Combat: First to Fight is a solid, likeable squad-based first-person shooter. It's a respectable title from a first-time development team, and it's remarkable how in all ways this FPS handles strict military tactics and protocol. The graphics, sound and overall atmosphere are not the game's selling points, it's the gameplay, straight and simple, especialy the online play, that will hook you. The cooperative games require teamwork to survive and so getting a good team together for several hours of play offers substantial rewards. The single-player game is no slouch either. The long missions add up to about 10-15 hours, depending on your skill level. You'll find the enemy AI tough and unforgiving, the level design better than decent, and the controls mostly utilitarian but in some cases, excellent. Overall, this is definitely worth your while, despite its obvious flaws.", "date": "Apr 7, 2005"}