{"name": "Star Wars: Revenge of the Sith", "name_review": "Star Wars Episode III: Revenge of the Sith", "ref": "https://www.ign.com/articles/2005/04/12/star-wars-episode-iii-revenge-of-the-sith-7", "text": "After much pontificating about the internal politics of a faraway galaxy and a half-baked romance where a lover's skin is awkwardly discussed, ~Star Wars~ fans are ready to see some serious action. Judging from the trailer, the third prequel looks like it may deliver -- and if the plot points revealed by THQ Wireless' new actioner based on the prequel, Star Wars Episode III: Revenge of the Sith, are dead-on -- fans will see plenty of lightsaber swinging.   Star Wars Episode III: Revenge of the Sith is a side-scrolling beat-'em-up that replaces fisticuffs with lightsabers. As one of the several Jedi highlighted in the film, from Anakin to Obi-Wan to Mace Windu, you must work through some galactic trouble spots. We're loathe to spoil the film for you (all this game coverage has pretty much wiped it out for us), but rest assured that many droids will be cleaved in two, Count Dooku will be dealt with accordingly, and at some point in the game Anakin will completely cross over to the dark side.   In addition to using the lightsaber, you also have access to Force powers. As you wreck enemies, you earn Force (detailed as a blue meter). When your meter is full, you can unleash lethal combo attacks and special Force moves, like the Force Push. These special attacks are pivotal to success, as bosses are invulnerable to damage from anything but. Fortunately, you can pick up balls of Force as you run through the levels.   Star Wars Episode III: Revenge of the Sith is actually a pretty hard little game. It took several tries to finally defeat the first boss, Count Dooku. His Force Lightning attack is unblockable, so you must memorize his patterns in order to beat him. The droids are pretty easy fodder for destruction, but you'll soon have to contend with clones and highly trained guards that have blasters and melee attacks.   We tested the game on an N-Gage QD, and found the controls to be reasonably responsive. Double-tapping left or right instantly put us into a run -- but getting out of it when we wanted to stop was a little trickier. Letting off the key still left us pumping our feet. You have to physically reverse direction to come to a quick stop, lest you barrel straight into a droid patrol. The game works on a few ~planes,~ so you must press up and down to move in and out of the screen, targeting enemies on the different planes. This is a little clumsy, especially when you cross paths with an enemy crossing planes itself. Collision detection feels off at these moments.   While the occasionally excessive difficulty and sometimes slightly unresponsive controls were buzzkills, it's hard not to be impressed with the production values. Now, Star Wars Episode III: Revenge of the Sith isn't a total looker. The character spites, while totally recognizable, are not terribly detailed. However, their animations are quite good. THQ Wireless really studied the movements of the Jedi actors and translated their moves, stances, and nuances quite well. Each Jedi actually has their own style. The levels are fairly lengthy, full of colorful architecture straight out of the film's varied locations.Star Wars Episode III: Revenge of the Sith is going to be a treat for the fans. It's a solid action game with a few minor quibbles, but it delivers the kind of thrills gamers want from a ~Star Wars~ game -- namely, lightsaber swinging. Hell, that's all I was hoping for, and I got plenty of it. I found myself having to replay specific areas more than I wanted to, thanks to what I felt was an occasionally evil difficulty bump. I could see younger players getting frustrated with this game, but older gamers that remember a time when every other game was a side-scroller will enjoy the return to form. The obvious care that went into translating the ~Star Wars~ universe to a mobile game is also praise-worthy. As a first effort, Star Wars Episode III: Revenge of the Sith gives great hope to THQ Wireless' handling of their precious license. This is a good opening shot -- further whetting the appetite for future games as well as getting to see the movie in May.", "date": "Apr 12, 2005"}