{"name": "Midnight Club 3", "name_review": "Midnight Club 3: DUB Edition", "ref": "https://www.ign.com/articles/2005/04/12/midnight-club-3-dub-edition-2", "text": "Now that the bulk of import-tuners have come and more or less gone, Rockstar, with its third iteration in the Midnight Club series, has tackled what is arguably the most stylistic and well-rounded arcade racer of the bunch. Developed in San Diego where the tuner scene is highly visible even to the ignorant, Midnight Club 3: DUB Edition is rooted deep in the mod subculture and never gives up faith or sells out to commercialism. The intertwined message of stellar gameplay and entrenched culture gives the game a feeling of authenticity sorely lacking in similar racers.   Rockstar aims the third game in its series away from the relative cheesiness of Midnight Club 2 with its goofy characters, unlicensed cars, and limited customization. The studio has added a mid-sized customization system to the mix, brings in more than 50 fully licensed trucks, SUVs, tuners, exotics, muscle cars, and motorcycles (all of which take heavy damage, mind you), and brings to the game a sizeable and compelling online component. Best of all, there are real reasons to explore the vast trio of cities and effective (if not arcadey) super powers that add a whole new layer of strategy to the racing itself. And while MC3 isn't the fastest, or prettiest racer around (it's just a hair short on both ends), it's incredibly stylistic, long-lasting, and deep.   MC3 is at once the same beast that MC2 was, yet far deeper, broader, and richer in presentation and culture. An arcade game by nature, it builds its core gameplay around intensity. Compared to MC2, the city streets are wider with more traffic, the maps are entirely different, there is more action occurring onscreen, and the nature of the races has altered ever so slightly thanks to the variety of licensed cars and addition of power-ups. Strangely, the rail-branching element that was so distinctive in the previous iteration still exists, but is no longer the primary aspect. Now, along with the un-ordered races (the dominant kind in MC2), the inclusion of point-to-point and time-based contests adds depth and variety a previously straightforward race. Running at a usually-solid 30 FPS, the game appears to blaze along faster when saddled on motorcycles, engaged in slipstream mode, or simply by changing to the first-person perspective and there are five perspectives in all.    As a starting bonus, you'll get all of the powers you earned in MC2 right away (Drift/Powerslide, In-Air Control, Nitrous Boost, SlipStream Turbo, Two Wheel Driving, and Weight Transfer). The new moves, Agro, Zone, and Roar, also add a wild arcade element to the competition; though at first they seem simplistic and silly. They're especially key in multiplayer modes. And once the competition toughens up in Detroit, these moves play a more crucial role.   Similar to the previous games, players instantly can dig into Arcade, Career, Networking, or Race Editor Modes right off the bat. Arcade mode enables you to play any of the three cities you've opened in the Career (San Diego, Atlanta, and Detroit) while using the vehicles you've won or bought. It's a nice cruising mode, made valid by hidden stashes and secrets throughout the three huge cities. But career is the meat and potatoes of the game, offering a substantial (18-plus hour) single-player experience built on a unique progression system that incorporates three-tier customization. Networking offers Xbox owners eight-player System Link and Xbox Live play, while PS2 players get a straight ahead eight-player online experience. Both the Xbox and PS2 online modes are tightly wired to provide a slew of good racing games that function technically well on both consoles, and the new Race Editor is more interesting looking than before. This is because it uses a fly cam to zoom players across the urban streets, but strangely, it's not as functional as before.   Players familiar with the series will quickly see and feel subtle changes to the aforementioned Career function. Right away you're provided with a chunk of cash to buy a decent car (I bought a VW Jetta, for instance) and you're left with enough money to make superficial changes to the exterior and to upgrade a part or two. You'll return multiple times to Six-One-Nine Garage to upgrade your vehicle, sell, or buy cars, and when new parts are won, buying them enhances your top speed, acceleration, and handling. After upgrading, exploring the city and looking for special icons (there are about 12 Rockstar icons in each city) can be a nice sidequest apart from the straight races, and the new handy map trains your go-to arrow to find another race or to head to the garage. Like the previous game, each competition is indicated with a giant bonfire of blazing red that beams into the night sky for high visibility. But unlike EA's Need For Speed Underground 2, this open city is packed with interesting and cool things to find, which gives the vast area a reason to explore. In that way, it's like GTA.    The new customization feature is complex in parts, simple in others. The engine aspects are all handled on a three-tiered system, with the stock part, plus three upgrades. You can choose to upgrade manually or automatically, but the upgrades are unlocked after wins, and they compel you to return to the garage for adjustments. On that front, I found upgrading way more simplistic than GT4 and the upcoming Forza Motorsport -- but basically it's in line with Namco's Street Racing Syndicate. It's less sophisticated, however, than NFSU2's interior upgrade system, which also offered a Dyno. Still, Rockstar did a good job visualizing the modification menus, and each part explains its purpose and effect. It's not skimpy and you won't feel cheated in the least; rather, it's a functional means to faster, more insanely chaotic races.   The exterior customization system is more complex, giving players zillions of colors, pearlescent finishes, gloss, metallic touches, and vinyl and matte materials to enhance their cars' look. The color scheme is easy, using a palette and a mouse-like system to enable players to select the exact color they want. Adding vinyls, players can provide flames, stripes, modern designs and more. They can even layer on badges, decals, and customize the license plates. The cooler stuff, like custom colors and high-level vinyls, must be unlocked. Of particular note, is that after a certain amount of wins and upgrades, you'll be able to progress to another city (and you won't have to finish each city to play in the others; another friendlier trait when compared to MC3).   The game's progression scheme is sophisticated. There are four basic kinds of races. To progress, players enter City Races for extra money, Club Races for parts, cars, and special moves, and Hookmen Races (for a multitude of things, including new cities). There are specialized tournaments requiring distinct vehicles to enter, such as luxury sedans, choppers, and SUVs. You'll have to win or buy vehicles to enter these. But the most efficient way to beat the game is to constantly challenge the hookmen. They present as many as three to five challenges, sometimes with mixed vehicles, and all of them increasingly more difficult.     From a game design standpoint, MC3 grows on you, and that's good because t felt too easy at first. The wider streets seem to have eliminated the cool rail-branching element. But by skipping the city races, which are generally there to provide needed cash, the Club Challenges, tournaments, and hookmen races quickly test your skills. The opponent AI does rail-branch less than before, though, because the course designs are more linear. The difference this time is the addition of traffic, more aggressive AI (though not as agro as in Burnout 3), and the insanely high speeds you can reach. Rockstar San Diego has really reached a sweet spot with its AI too, as you can catch up in some races, depending on where you crash, but rubber band AI isn't an issue.   Adding to the mix are physics. Using a robust in-house physics system, your car will scrape, thrash, hammer, and ram all sorts of opponents, obstacles, and buildings. You'll hit jumps, beaches, wooden planks, and freeways, and sometimes a heavy rain adds new layers of slipperiness. Incur too much damage and your car explodes, only to rebuild, adding a few penalty seconds. The cars are arcadey in feel, meaning they aren't too heavy (except the SUVs, naturally and they generally land on their wheels. Your car can take an amazing amount of damage before exploding, too.   The cars might appear to reach the same sense of speed as Burnout 3, especially in Slipstream mode, but the game doesn't look as good when it does so. That's due to the immense amount of activity, larger open levels, and the volume of cars onscreen simultaneously.   In terms of online, MC3 offers a suite of new changes, additions, and improvements over MC2. The games include Tag Matches, Capture the Flag with Classic, Split, and Basewar options, a Paint Mode that forces you to gain territories, and Track. Familiar race types include Cruise, Ordered, Circuit, and Unordered, plus additional ways to alter the parameters (number of players, city location, time of day, weather, privacy level, vehicle types, special power-ups on and off, and even heavier flags).    Supporting up to eight players online for both systems, the game offers a hefty assortment of options, stats, and bonuses. Stat-wise, the number of wins, hours played, hours cruising, and miles driven are complemented by the number of races started, races completed, logins, flags returned, stolen, and highest tag score). There's even a ~best time~ tracker. For those who love clans and clubs, MC3 supports these with a progressive pledge system, rewarding players with the ability to recruit, ascend to the rank of officer, and ultimately to become an owner. On Xbox, you can even transfer ownership to someone else.    Technically, one of the best additions to the online component is the implementation of a host migration system. So, if a host quits or is caught with severe lag problems, the second person to join becomes the new host. Thus, sudden mid-game problems shouldn't continue to be a problem. The additional of Asynchronous Join means players can leave the race whenever they want while brand new drivers can hook up at any time.   In the visuals department, Rockstar San Diego appears to have pushed both the Xbox and the PlayStation 2 to their limits. There is an immense amount of action on the screen. Whether it's pedestrians, normal traffic, or the debris of trees, light posts, mailboxes, or store windows bring pulverized or shattered by your car, it's just the beginning. You'll race against as many as six others, sometimes less, and all of the AI runs independently; they cause wrecks amongst the pack and among normal non-racing traffic, they take their own paths, and they use nitro boosts in addition to slipstreaming you. In every race you'll see opponents smashing into each and sending up a small fireworks display of particles of flying glass, metal, and polygonal debris.    Rockstar has also incorporated more cars and widened the streets. Thus, you'll see immense amounts of traffic at once, especially when you hit the freeway. There are way more cars on the screen here than in Burnout 3 or Need for Speed Underground 2. The framerate on both consoles hangs relatively steady at 30 FPS too, with occasional dips and minor slowdowns. The slowdowns aren't drastic, mind you, but they are noticeable -- which brings up another point: the simple textures. Your cars are indeed stylized and beautiful, but because of the sheer amount of stuff happening at once, some things -- OK, many things -- including people, buildings, and even other cars are less detailed than expected. Still, and this is no slight on Grand Theft Auto: San Andreas, Midnight Club 3, with its size and vastness, is remarkably good looking in comparison. To put a nail in the coffin, once you hit slipstream, the game remains steady, fast, and impressive in every regard. Perhaps even more impressive than when simply driving around.    Taking place at various times of night, the courses are always dark. After all, it's called Midnight Club. This doesn't mean you can't see far, however, and in fact, the draw distance is long with LOD work good enough to prevent you from seeing cars take shape as you come close.   Lastly, Rockstar's game is as expected, stylistically well hung. The featured mechanics, who are more or less your narrators in each city, are smartly motion-captured and they move and feel like they have their own personality. The menus are sleek and quick (different looking from the minimalist approach of MC2), and the tutorials and customization interface is tight. My only complaint is that, when you're looking to buy a vehicle, after only a few seconds, it takes off. Did you pick it? Why'd it take off? It's a little confusing at first and a little annoying. Another sad fact is that MC3 doesn't support widescreen or 480p on the PS2 like it does on the Xbox.   Luckily, with the nauseating, terribly licensed music of Burnout 3 and the dull, forgettable sounds of Need for Speed Underground 2, the drum and bass, dance hall, and sprinklings of various forms of rock create a truly distinct sound. Backed up with Dolby 5.1 on Xbox and Dolby Pro Logic II on PS2, the sounds are crisp and clear. Sure, none of the songs turned up being my favorites but I did like these a lot more than anything else found in other current import tuners. Rockstar has also made excellent editing cuts that blend distinct and catchy rhythms into menu scenes and winning sequences. Remember in GTA the familiar sound of beating a mission? MC3 does it when you win a race, and it does it well.    Unlike MC2, however, which was filled with hokey voices and stereotypical international voices, MC3 focuses on only a few characters: that is to say, you, the silent type, and three others. The stereotyping of various minorities here is in full effect too, but since stereotyping is based on real people, at least the characters feel real, knowledgeable, and hardcore racing heads.Midnight Club 3: DUB Edition is an insanely fast, chaotic, and progressive racing game that betters the second with more accessible racing, without losing its competitive edge. The single-player campaign is sophisticated with a working open city, customizable interiors and exteriors, and crazy new special moves that become crucial to winning later on.While graphically MC3 doesn't have the same chops as Criterion's Burnout 3 (which runs at 60 FPS), Rockstar's game does offer open city courses, more cars onscreen simultaneously, a customization feature, special moves, and what appears to be a more robust online component. It's a tough game to beat in many respects. And on PS2, the game is especially respectable in visuals, framerate, and all other things technical.", "date": "Apr 12, 2005"}