{"name": "Vigilance", "name_review": "Vigilance", "ref": "https://www.ign.com/articles/1998/11/14/vigilance", "text": "Formed as a counter-terrorist agency, SION (Special Intelligence Operations Network) is more secretive than the CIA and Mossad put together.  An elite body comprised of renegades and loose cannons from around the world, SION is known for their effective and efficient use of deadly force to solve nearly any terrorist threat.  As an agent of SION, you have agreed to stamp out terrorism across the globe through any means possible, most of them involving extreme violence and huge explosions.  Sounds like a cool story that would make a great game, huh?  Well, unfortunately, Vigilance is a frustrating exercise in patience that lacks the playability of other shooters on the market.  Vigilance can best be described as a 3D action shooter.  Unlike most shooters, Vigilance is not limited to a first-person perspective.  The designers give you the option of playing in two third-person views, a far shot or a close behind shot.  But, like most third-person shooters, your agent's body just seems to get in the way of the action during the action, blocking enemies from your view and concealing your aiming crosshairs.  Needless to say, I ended up playing Vigilance from my chosen agent's eyes rather than from behind him/her.  To add to the third-person perspective problems, Vigilance is one of the choppiest and slowest shooter I've played in a while.  I tried it on a P300MHz with a Voodoo card and it was very frustrating to play.  I could have made a sandwich in the time it took each level to load and I experienced bouts of slowdown during the game.  One reason for this is that Vigilance creates a huge swap file on your disk, so level information is occasionally wiped and loaded from the hard drive, causing annoying performance drops during gameplay.  Even on a P450MHz the game often jumped and sputtered when multiple enemies were spraying me with bullets, making it almost impossible to quickly and efficiently move the targeting sight over the baddies since it didn't travel smoothly across the screen.  I would hate to see how it performs on the minimum required processor, a P166.  Of course you could increase the game speed by reducing the graphics quality, changing the resolution to 320 x 200, and reducing the size of the screen with the '-' key, but then it looks like you're playing a real dog of a shooter on a GameBoy color ... and no self respecting PC gamer wants that.  Another big problem I had with Vigilance is that the environment is not very interactive, it's just kind of there to look at.  You can't move boxes, you can't blow-up barrels of fuel, and glass doesn't shatter when you shoot it.  Even when you shoot lightbulbs, light still emanates from the fixture.  Maybe it's just me, but I've gotten used to a certain level of realism in 3D shooters and Vigilance simply doesn't live up to that standard.  Level design in Vigilance is also lacking the amount of detail and care that I expect from today's shooters.  Although quite large and challenging, the levels follow the basic shooter formula: run around, shoot lots of guys, get the keycard from the guy who just happens to be at the end of a hall really far away from the door that the key unlocks, shoot some more guys, run around some more, get lost, shoot some other poor sap at the end of a dead-end hallway, get the keycard, try to remember where that blue door was that you found twenty minutes ago, yada, yada, yada.  We're all familiar with it and, if you're like me, sick of it.  When are designers going to start developing truly original games?  It can still be done in the shooter market: just look at Rainbow Six and Shogo.  Even more bewildering and irritating is the lack of an in-mission save game feature.  Although the manual claims you can save your game during the mission, the readme file lets you know the real truth: games can only be saved in the mission briefing screen.  Sure, this allows for longer gameplay as you have to begin the level again if you get killed, but nothing is more frustrating than getting within steps of the end of a level, getting killed, and having to replay the entire mission over with a completely restocked battalion of bad guys.  And, as I've already mentioned, the levels in Vigilance are rather large making it even more annoying.  Not to mention that several of the missions include areas where you must jump over deep pits or traverse precarious drain pipes and, if you make one slight wrong move, you die.  Arrrgggghh!!!!!   There were some good things about Vigilance: a sniper mode, the ability to choose from 8 different agents, unique skills and special abilities, the large and unique armaments, free multiplay on HEAT.NET, power-ups, and locational damage.  But all of these goodies still don't make Vigilance a good game.  With all of its game engine flaws Vigilance just isn't that much fun.  And, to be completely honest, I have no desire to play this game ever again.  In the end, Vigilance just can't stand up against other shooters already available.  Maybe a year ago this game could have competed in the market, but not now.  It just fails to offer any real innovations to the genre.  Yeah, there are some neat new weapons.  Sure, the different agents are a nice touch.  But the gameplay suffers so much, not only from the incredible slowness but also from the lack of creative level design.  I wish it could have been better because I really liked the idea behind Vigilance.", "date": "Nov 14, 1998"}