{"name": "Diamond Islands", "name_review": "Diamond Islands Review", "ref": "https://www.ign.com/articles/2008/03/19/diamond-islands-review", "text": "Few things in game reviewing are sweeter than discovering a little treasure -- and that's precisely what Digital Chocolate's new Diamond Islands is. The mobile maker has consistently excelled at introducing clever, original games in the last few years -- Tower Bloxx, Tornado Mania, Crazy Penguin Catapult -- so the revelation that Diamond Islands is a wholly enjoyable little puzzler should come as no surprise. But still. This is a delight.   You are an island hero hoping to marry the chieftain's daughter, but he will not offer his blessing unless you appease some angry gods. To soothe the gods, you must place totems in sacred spots across a series of islands. The totems are rectangular blocks that you roll one move at a time, either on their sides or end-over-end. To finish an island, you must push them totem so it is standing straight up on one of the sacred spaces. And that requires, especially in later stages, plotting out precise paths across the islands.   As you explore more islands, you encounter extra hazards and obstacles, such as incredibly tight spaces or the need to roll the totem on buttons to erect bridges. You can also slide the totem over muddy patches. And, to gain additional points and unlock ~spells~ (which are pretty much achievements), you must roll the totem over diamonds en route to the sacred spot. Some levels have move limits, so you must reach the sacred spot within a set number of rolls or else the totem breaks.   Diamond Islands is an incredibly easy game to pick up. Within a minute, you ~get~ the basics. Anybody can play it. And even if you burn through the 100 islands in the single-player game, there is extra content to sift through, such as the Hot Seat pass-the-phone multiplayer and an arcade mode with specific challenges. Between the playability and the value, it is exceedingly easy to recommend the game to anybody.   As you might also expect, the game looks fantastic. Diamond Islands is loaded with bright colors and great little animations, especially for the islanders. There are a number of island environments, too, such as tropical paradise, volcano, and ancient ruins. And while you may need to turn the volume down at work or on the metro, you should definitely give it a play at least once with the music on -- it's good stuff.  Diamond Islands is another hit from DChoc that deserves wider release than just mobile, although I am more than happy to have it here. XBLA? Wii Ware?", "date": "Mar 19, 2008"}