{"name": "Empire Earth II", "name_review": "Empire Earth II", "ref": "https://www.ign.com/articles/2005/04/25/empire-earth-ii", "text": "Empire Earth II is a really, really big game. Lots of people like to throw the word epic around, but this is certainly appropriate. Not only for the many periods of history involved, but for all of the variations of play, hours of gaming, and tactics that can be used to crush your enemies. Mad Doc has taken the ground works laid down by Stainless Steeel with the original title and created a truly deep and enjoyable real-time strategy experience on all levels. Both single player and multiplayer are a hell of a lot of fun. This is truly an epic game on all levels.    As with the first Empire Earth, the sequel bases itself on the history of our planet from a very early stage in human development. It doesn't go back quite as far as the first game, but it's not something that I missed. Instead, the action is focused on periods of time in history that are more interesting from the standpoint of strategic gaming. Periods of history are divided into epochs that advance civilizations into whole new realms of technology and culture. In one game you can actually see your civilization rise from shooting arrows and poking each other with sticks to shooting lasers and poking each other with nuclear bombs. The scope is huge and allows such a gigantic room for mistake that it's amazing more weren't made.   There's a good attention to history in the campaign missions, though license has most certainly been taken with geography and accuracy for obvious gameplay reasons. The campaigns in general are awesome. Some of the mission design is really, really good and none of the missions call for every last one of the enemies to be dead, which is a huge blessing considering the size of some of these maps. In fact, some of the time, missions will only charge you with taking over a set number of territories to win and push whatever invading army it was back into the hinterlands.   Three eight mission campaigns follow the beginnings of Korea, Prussia's rise and fall and rise and fall and rise and fall and rise to power eventually creating Germany, and the United States entry onto the world stage starting with the expulsion of Spain from Cuba into the future. All of these campaigns are very satisfying and provide a variety of scenarios to keep things interesting. The difficulty level can vary, but there are some great challenges to be had that are quite entertaining. Playing as the Prussians fighting Napoleon's retreating Grand Army was especially exciting and required more than a little perseverance. I'm not used to being in my death throws in RTSs nowadays. It's nice to see a campaign that can provide an interesting challenge.     Outside of the campaign there are turning point battles (Normandy and Three Kingdoms) that can be played from both sides to see if you can change history and excellent skirmish and multiplayer modes. Players can choose from one of fourteen civilizations with different advantages of their own, including unique units, from four different regions with different advantages, powers, and wonders. Picking the right civilization for a certain type of game in a certain range of epochs is actually part of the strategy. There's a lot to think about before you even get into the game.   Of course, it's this epic nature that is really the game's only real downfall from a gameplay perspective, if you can even truly call it that. This is a complex game for hotkey heroes. If you want to be successful, you're going to have to learn which combination of keys do what. For all of the great extra features included in the game like the citizen manager, war plan, and picture in picture, there are a thousand other things that you have to remember. And half the time, the hotkeys are hard to remember because there's just so many of them. The entire alphabet is used up so that both the shift and ctrl keys have to be used as modifiers for most of the other commands. The single player games allow for the forgiving pause and order feature, but multiplayer matches will challenge your memory of hotkeys, civilization bonuses, technologies, buildings, leader powers, unit uses, and more. This is a deep, deep game that will take most players a while to get familiar with.    As mentioned in the previous paragraph, Mad Doc did design some truly wonderful features that not only add to gameplay depth but also allow for some alleviation of micromanagement. The Citizen Manager is one of the best inventions for an RTS with multiple resource types. It allows the quick movement of citizens between needed resources on an easy list and map. The map will even show where all of the known resources are. Even better, resource structures can actually be placed from the Citizen Manager screen and will take the closest idle citizen to build and then occupy it. The only thing I would have liked to have seen is a idle citizen spotter on the actual map. You can find them easily enough by hitting comma or the idle citizen button on the gameplay screen, but it would have been great to be able to select specific guys and assign them to resources nearby yourself.   The picture in picture feature allows players to put a camera down at one of six locations and then put them on rotation in the lower right hand part of the screen to see what's happening at all times in different parts of the map. The PIP can even be used to follow units around to track spies or armies you need to keep specific track of. Best of all is that commands can be issued from this screen, meaning you don't really have to take your attention away from a battle on the big screen if you want to start building a new nuke or order more troops to the front from one of your bases.   The last big new feature addition is the War Plan. This brilliant little piece of work allows you to give your AI allies orders but more importantly allows you to coordinate with allies in a multiplayer game with ease. It's basically a paint program that allows you to draw battle plans which can be sent to whoever you wish. It's now all about coordinating multiple armies to attack multiple targets in unison. Hell. Yes. This changed the face of multiplayer games, especially when the improved diplomacy features are mixed into the bubbling cauldron.   Diplomacy options are actually pretty robust for an RTS. Alliances can be struck with any other players on a map (aside from single player campaigns where allies are restricted for historic reasons). Tribute can be given for favor or just to help a buddy out, border permissions can be selected to allow only certain types of units to cross into your territory, territories can be handed over, and the amount of time this alliance lasts can also be decided. The question is really how much you trust a guy. Take Delsyn (Allen Rausch) over at Gamespy. That bastard double-crossed me in a game against Ian Davis and crew over at Mad Doc. Once I started realizing he was building walls all along my border, I began having doubts and immediately began building walls of my own. The problem was, he had already brought his guys into my territory and then cancelled our treaty while I was fighting with Ian, lighting a fire under my feet, as it were. I crushed him, but it wasn't without a lesson. Never to trust a guy from Gamespy or at least to give full border permissions to one.     But what I've found to be the best bit of tomfoolery in multiplayer is making multiple alliances with different people, drawing up different war plans for each of them, and then watching them wear each other thin while I build a mighty civilization with none the wiser. Since war plans can be sent to specific people, it's a simple idea of selling the plan at the end of a timed treaty and then crushing them at their weakest. Sure, it's not nice, but it is part of the game. It's certainly a level of intrigue that's appreciated, but I do think there should be an option for unbreakable peace to go along with the Until War setting. I also wish Allen hadn't been able to go back on me like that without some sort of small resource or tech point cost.   Aside from the intrigues of geeks, multiplayer has a lot going for it. Not only are there a sh*t ton of modes to explore, but there are games that can be created from a mixture of options. For instance, each player can set a handicap that will govern any advantages. So a Newbie will have a significant advantage over a Game God in terms of strength and economy, which allows friends of highly different skill levels to play and both have fun. But as Ian Davis once told me, they like to play seven on one games where the lone guy is set as a Newbie and the other seven are game gods. With the amount of options available, there's a huge amount of creative ways of playing as well.    Whether in multiplayer or single player, several other additions to the gameplay make Empire Earth II even more interesting. The first of these are the Crowns. As you play through a match (single or multi), you'll gain points for economic, imperial, and military gains. The leader in each category after a certain amount of time will win a crown in that category. It will provide the player with an option to choose an advantage for winning the crown (such as Drills which allows all ground units to move faster) that will last until the time is up and a new winner is crowned along with a leader. These leaders are not only powerful fighting units, but have special powers of their own pertaining to the crown won. It makes winning those crowns important and scrambling to dethrone the current winner equally important.   Equally important to gameplay is weather. Mad Doc wanted weather to really mean something instead of only adding some extra visual weight. They've succeeded admirably. Weather does several things that will certainly change the way your strategies play out. You'll find that you most certainly want to run most of your offensive campaigns in the heart of summer when the weather is nice and clear. When the snow begins to fall, it might be wise to hunker down and wait for good weather. Not only do planes have a hard time flying, but ground forces move significantly slower and have a severely decreased line of sight. And when the blizzards start, it's also hard to see the map. The particle effects plaster the screen, turning your nice jaunt into enemy territory much harder to accurately plan. I was a bit unsure of whether I liked this effect at first, but it grew on my as time went on. It makes sense that I should have a hard time planning an offensive in a blizzard. And in multiplayer, it'll only cause more problems for all of the players, allowing bold strategists the element of ultimate surprise if spies have been put to good use.   One feature that I didn't really care for, only because it didn't seem to work most of the time, and sometimes caused serious problems, was roads. No matter how well you try to build them, units will always wander off of them and not take advantage of the huge speed bonus they get for traveling on them. It can be really frustrating. It seems that most of the time unless have a straight road from point A to B that's perfect, units will go off-roading. While that's more frustrating than broken, bridges (which are built separately or by laying a road over a river) cause problems for pathfinding AI. I've had to kill off tons of my own units because they were stuck on a bridge when other faction AI units decided to come the other way at the same time. It's happened several times over the course of playing. They have to be destroyed in order to free up valuable population cap space, which of course, is a ton of resources down the tube. Either bridges need to be wider, or something else has to be done, because it can be a real problem.     Visually, Empire Earth II is decent. It's not the most interesting I've ever seen or am likely to see this year, but animations are mostly smooth, models look good, and buildings are surprisingly detailed if you zoom on in and really take a look. Shadows and lighting are good and a lot of units can be on screen before suffering serious slowdown issues.   The sound department is also decent. I think they got the guy from Soul Calibur (His soul still burns!) to read the intros to each of the campaign missions. He and the most of the unit voice-over actors are pretty decent. I was a little annoyed when Teddy Roosevelt screamed the same ~My blood is boiling!~ line that Frederick the Great did back in Prussia, but other than that, it was a pretty decent job.Empire Earth II is a deep and satisfying real-time strategy game. The campaigns are great, the multiplayer is super fun, and skirmish allows for tons of single player satisfaction thanks to some terrific AI that'll give you fits. The new features like the Citizen Manager, Picture in Picture, and War Plan are all an awesome way to make the game both easier and deeper at the same time. Still, even with a management solution like that Citizen Manager, this is a complicated game that isn't going to be particularly newbie friendly. There are so many hotkeys, you have to have a great memory to remember them all. The only major problems that needs to be addressed are roads and bridges. Otherwise, this is a great game that fans of Empire Earth, Age of Empires, Rise of Nations or any of these ~historic~ RTSs should heartily enjoy.", "date": "Apr 25, 2005"}