{"name": "FIFA '05", "name_review": "FIFA Soccer", "ref": "https://www.ign.com/articles/2005/04/25/fifa-soccer", "text": "We're stilled dazzled by the technical abilities of the Sony PlayStation Portable, but in the case of EA's FIFA Soccer, the little console with the big screen is showing off too much ugliness to be ignored. It's loaded with the majority of features and capabilities everybody will remember from the PS2 and Xbox versions of FIFA Soccer 2005 last fall and even a few PSP-specific enhancements. And those are major points in its favor.    The problem is, FIFA Soccer feels a little too rushed. Technical problems fall all over this game, and the features that worked great on console are too much of a pain to play with on PSP. This handheld takes some thinking before you approach putting a game on it, and FIFA looks to have been done just to get it done. In the end, the PSP version will probably only appeal to FIFA 2005 fanatics who just can't live without a little footy in their pockets.    The players control well considering the limitations of the pseudo-analog stick (we'll call it psanalog) and all of your pass, talk and shoot buttons are nice and responsive. Just like with the home console versions you'll always have to figure out the timing of the controls in this sports game even if you initially feel the players should respond quicker than they do, but it is responsive in comparison to the rest of the series.    The problems with control come up right from the moment you boot up the game. When you're simply trying to navigate menus, the PSP takes it's time registering your button pushes as it loads up the next page or what have you. There's a nice compliment of game modes like scenario, challenge and season modes, but navigating around those modes can become a pain as you set up games. And if you want to do something really tricky like check out the ratings of your staring lineup or (gasp!) substitute somebody, you're adding minutes onto your gaming experience with nothing much to show for it.   While the basic controls of FIFA Soccer turned out decent, it's the advanced control systems that hurt to the point that the developers should have considered just dropping them.       First Touch control was the biggest improvement to the home FIFA games last year. The ability to direct an incoming pass in a direction that confuses the defense was an welcomed feature for many soccer gamers. They've included it in the PSP version, but the problem is the controls for it are mapped to the d-pad instead of the right analog stick like we had on Xbox and PS2. This means that you'll have to manipulate your players around the field using your left thumb on the psanalog stick, use your right thumb to hit a pass button and then use your left thumb again to tap the d-pad as the ball comes up on the receiving player. Quickly switching back to the psanalog stick with your left thumb to take advantage of the First Touch opportunity you just created is extremely difficult. Remember we said FIFA Soccer for PSP has it's own unique timing quirks with moving your players around, but those quirks include inputting a run direction well before you expect the player to actually start running in that direction. That is, we have no problem with delay between command and execution, but when you try to squeeze a First Touch move on the d-pad in between, your player on the screen are just way to slow to respond to really give you the advantage you're supposed to have.    During gameplay there are too many loading pauses sprinkled throughout the game. A missed shot that goes out of bounds for a goal kick will cause the game to hiccup before the ball even crosses the line. It's like the PSP knows it has to load up the goalkick perspective/scenario, so it starts doing it before you've even seen the ball go out of bounds. Half-second stutters like this happen far too often in this game. All of this is made even worse when you're playing in head to head mode with a buddy. When you're playing against a friend all of the hiccups and timing issues really take away the frantic pace that makes for fun multiplayer sports gaming. At times I thought the First Touch controls were automatically disabled in head to head games, but it turns out that the timing on the controls is so off that using First Touch moves isn't worth it.   Other than the technical obstacles that come from stuffing a PS2 game into a PSP body, the selection of game modes is impressive as is the depth of stuff brought over from FIFA 2005. The FIFA store and trophy room are in the PSP version along with the full list of international hits from EA Trax. If you're really a big fan of Dog Die in Hot Cars' ~I Love You Cause I Have To~ you'll be thrilled to know you can watch the music video as well as listen to the tune throughout FIFA Soccer. We love music acts where you can't tell the name of the group from the name of the song so being able to see them as well as hear them is a great space age innovation.    Visually FIFA Soccer shows signs of how tough it can be to display the clarity and level of detail you get on a television set when you only have a little screen to work with. All of the camera perspectives are the same in the PSP FIFA game -- you just get all of the heavy dark lines drawn around players to make them jump out at you during cutaway shots like celebrations and bookings. All of the crowd animations that made the Xbox version feel so lively are gone as the supporters simply stand still watching their teams. Sometimes there can be considerable flicker on wider shots as the game tries to draw signs an other details of the stadiums. But little touches like the countdown meter on corner kicks are more useful than they were in the PS2 and Xbox version of FIFA 2005.       In the end you'd have to be a true FIFA 2005 freak to get satisfaction out of FIFA Soccer for PSP. If there was a franchise mode beyond the basic single season mode, I could see the appeal of being able to manage your franchise to greatness anytime anywhere. But there isn't and the problems we had with First Touch control basically make that feature non-existent. Which means we might as well be playing FIFA 2004, which is not good for anybody. It just seems like the whole effort with the PSP FIFA Soccer was either rushed or the finer points of portable soccer where simply neglected. The pieces are here there's just not enough polish and attention to detail to make this a heavyweight PSP soccer game.", "date": "Apr 25, 2005"}