{"name": "Elite Warriors: Vietnam", "name_review": "Elite Warriors: Vietnam", "ref": "https://www.ign.com/articles/2005/04/26/elite-warriors-vietnam", "text": "Although the wave of Vietnam games hasn't had quite the staying power of WWII, various development houses have extracted some intriguing premises from the conflict. While the war didn't feature the enormous scale of many WWII battles and operations, some folks have figured out how to turn this to their advantage, which is where the SOG comes in. An acronym for ~Studies and Observation Group,~ the SOG was the precursor to the famed Delta Force and established patrol techniques that are still in use today; the group sounds like a bunch of land surveyors, but this couldn't be further from the truth. In fact, the SOG became so good at its job--squad insertion behind enemy lines, black ops including sabotage, recon, assassination and ambush--that the NVA created and trained special teams just to counter these elite servicemen. In theory, this is one of the compelling and rarely-told stories of the war and begs for a team-based treatment. In practice, however, a few problems prevent Elite Warriors: Vietnam from bringing the tension and thrill effectively to the computer screen.   While straight-up team-based shooting sounds pretty intuitive, Bold Games decided to switch things up a bit by sealing those segments within a topographical map. Your team, represented by an icon, travels along a waypoint route you confirm before the mission starts, and as your icon slides along from point A to point B, several randomly chosen encounters and events may occur before and after you reach your destination. You may be ambushed, or you may get a bonus to movement, and you can choose to rest, at the cost of making the mission take longer.   You're scored according to mission time, effectiveness, and getting out in one piece. There isn't much info either in-game or in the manual about the benefits of resting, but it's assumed that this will make you more alert for counter-SOG teams. However, resting can expose you to attack. You can also move at half-time, normal time and double time, balancing risk with speed. Lastly, you can call for emergency extraction, but this will end the mission.   So the square icon representing your team moves a few inches up the topographical map, you're told that something has happened, then you move again, choosing movement speed, unless you're given the option to rest. While this could be interesting, the presentation is a little bland and removed, and you're helpless to avoid negative random events. It has more in common with a board game, which isn't exactly a bad thing.     But it's not exactly how the game is represented. The box doesn't mention this aspect of the game, or show any screenshots of the interface, leading the gamer to perhaps assume that Elite Warriors: Vietnam is all action, when you might be spending half your time from a perspective that isn't mentioned.   Unfortunately, the actual in-the-jungle segments aren't worth the wait. While the soundscape is impressively lush, with bird calls and insect noises punctuated by foreboding and aggressive drums, radio chatter, Vietnamese voice work, crackling gunfire, and crunching footsteps, that's about the best thing that can be said about this aspect of the game.   The visuals aren't too bad, either, with good use of lighting, textures, and character models. There's a lot of foliage here, though, and it pops in and out distractingly, instead of fading, when it gets in between your character and the camera. There are also the dreaded invisible walls, where you can see more terrain but are mysteriously blocked from advancing into it.    Movement isn't nearly as nail-biting of an experience as it could be, since the enemy AI is generally stationary. When you hear gunfire close by, and you're an armed service member defending a camp, the typical reaction doesn't involve standing around. It's also obviously proximity-based; you could be plinking them with rounds from a hundred yards away, but they won't be aware that you exist until you're almost right on top of them. At least EW:V doesn't fall prey to perfect accuracy, or else I could probably have gone commando through a lot of it with a scoped rifle, and perhaps a mule to carry extra magazines.   It's disappointing how much things break down tactically, once you leave the topographical map. On the other side of the coin, you run into aggressive patrols that will tear you apart pretty quickly, giving position through gunfire before anything else. So before you can formulate a plan, your team is dying or injured. Is this realistic? Maybe it happened all the time. But when you switch to jungle mode because a random encounter has been determined, you expect to have some idea where the enemy is. It would make more sense to be dropped in at that point, rather than the point right before the encounter.   Also, your team members are usually more of a hindrance than a help, particularly when there are civilians around. They aren't bloodthirsty, but the AI doesn't seem to notice when there's a noncombatant between it and an enemy. And when a civ dies, the mission is immediately aborted. Most of us have played a game that was a lot more fun without the squad than with it, but even then, EW:V doesn't offer compelling gameplay. It just feels incomplete.   The team commands are fairly intuitive for those who've played Hidden& Dangerous and its brethren--hit TAB to switch to another member, hit any key along the keybord row of F-J to select different commands, number keys select items, et cetera--but some of the default movement keys are odd. ~Enter~ to reload, instead of ~R,~ which order the team to attack your target. ~X~ to crouch, instead of ~C,~ which chooses standing posture. Press ~B~ to zoom a scope, instead of the middle or right mouse button. Left-click for burst fire and right-click for semi-auto, instead of hitting a key to switch modes. Then various odd bits like ~I~ to select your knife, ~L~ to send chat text, and ~P~ to drop an item.     You can remap everything, thankfully, but the tactical shooter genre already has a good template. No one wants to spend the first five minutes of their game figuring out what template would actually work for them. This aspect of the game isn't truly a major problem, but it serves to make the game feel that much more rough around the edges.If you're jonesing for team-based tropical shooters, you're going to have to keep on looking. Last year saw several strong action-oriented releases, and none of them broke up the action with an overhead strategic map. It doesn't look bad, and it certainly doesn't sound bad, but combat is alternately vicious or easy. There's also the matter of getting dropped into jungle mode just outside the view of your target, which typically leads to frustration as you trudge around looking for whatever it is that stopped your travel. Perhaps EW:V needed a little more time for polish.", "date": "Apr 26, 2005"}