{"name": "Crash Twinsanity", "name_review": "Crash Twinsanity", "ref": "https://www.ign.com/articles/2005/04/28/crash-twinsanity", "text": "Ever since Naughty Dog turned over the Crash franchise to Vivendi Universal games, the bandicoot has fallen on hard times. Basically, it's hard to find a gamer that really gives a damn about him anymore. However, he is still a recognizable face, so you can't blame I-play from licensing his latest adventure for the mobile treatment. But in a bizarrely cool turn of events, I-play's take on Crash Twinsanity, which sputtered on consoles last year, is infinitely more enjoyable. How we love it when mobile games trump their console counterparts!   Crash Twinsanity is a dual-layer action-platformer where Crash and the villain Cortex are forced into partnership. Each character occupies the same screen, but they run along on different planes. However, their action affect each other's plane -- for example, Crash must hit a switch to detonate TNT in Cortex's path. (Apparently Cortex is not smart enough just to wait for Crash to reach the switch...) Conversely, sometimes Crash must slow down or rush to keep up with the ever-running Cortex, as he is able to clear hazards on Crash's plane -- but only for a brief period of time.   This being a platforming game, there is a lot of jumping involved. Unfortunately, things get a little rough for Crash Twinsanity here, as the control just doesn't feel sensitive enough for some of the more complex double- or split-second jumps Crash must make to survive chasms or reach switches. Some of these jumping challenges will frustrate you, which is too bad because it threatens to capsize an otherwise breezy, fun adventure.   Crash Twinsanity is an extremely eye-catching little game, sporting an insane amount of color. The character art is quite well-done, which is important since these are indeed such recognizable gaming figures. We're sorry to report, though, that Crash Twinsanity is seriously lacking in audio. Just a little jingle at the opening titles, but then it's radio silence.Crash Twinsanity is a good action game with some control quibbles that will frustrate some gamers more than others. If you are in a forgiving mood, though, there is some real enjoyment here. Keeping up with Cortex can be quite a task, but for fans of the genre, Crash Twinsanity is a good afternoon or two of mobile fun.", "date": "Apr 28, 2005"}