{"name": "Resident Evil Outbreak File #2", "name_review": "Resident Evil Outbreak File #2", "ref": "https://www.ign.com/articles/2005/04/29/resident-evil-outbreak-file-2", "text": "Though it wasn't the best zombie in the horde, 2004's Resident Evil Outbreak brought an interesting idea to the table: What if you took the same classic gameplay that powered the highly popular PSOne horror series and brought it to the online world? Based on the market reaction it was obviously a question that longtime fans were more than willing to answer, but also one with a conclusion that wasn't as favorable as hoped.   Sure the game was cool and unique and beautiful, but it also had some issues... because despite its great atmosphere and appealing mechanical additions, its online aspects and sense of progression were terribly under realized. As an ongoing fan of the series, I really liked it at first (but only for so long); once other horror games like Silent Hill 4 and Obscure were released in the months following, Outbreak's flaws became glaringly more apparent. And that's what makes Capcom's latest follow-up Resident Evil Outbreak File #2 all the more disappointing --the designers just didn't seem to understand what was needed for the sequel.   To be more specific, File #2 still suffers from the exact same problems that plagued 2004's effort, which makes it a lot harder to forgive a full year later. The analog-powered variation of an old-school configuration used since the series' inception is really starting to wear thin, especially after playing Capcom's near-flawless GameCube sequel, Resident Evil 4. The sluggish and unresponsive locomotion and camera-crippled directional control just isn't acceptable anymore; and to be truthful, it marks a bit of a milestone for me because while most of my co-workers lost their tolerance for this kind of setup almost a generation ago, it took me this long to join them.   Of course, the biggest issue with Outbreak is that it still doesn't understand the importance of communication in an online environment. Just about every critic in existence had something negative to say about the first game's level of person-to-person contact, and other than a few small fixes here and there (there's an apology command now) the sequel remains relatively unchanged. File #2 still uses the right analog stick to issue a handful of basic commands to the characters around you, but outside the AI, it serves very little purpose when playing with other people. In-game keyboard support (or better yet, voice chat) would have made a lot more sense for figuring out what to do with one another.   If this were real, it would probably be the most terrifying thing ever. That communication problem is what ultimately creates the biggest hitch with Outbreak File #2 when playing online: it's inconsistency. You'll either find yourself pairing up with a pack of newbies that run around with no idea how progress (or worse, pressing the same command button a million times), or run into the veteran player that knows where to go and how to do it, thereby leaving your ass alone to fend for yourself. Needless to say, for a game that's built around the idea of being a multiplayer experience, it's a whole lot more enjoyable as a single player adventure.    To its credit, If you can get past the poor online approach the game does add a number of new features to the existing Outbreak model that make it a much more complete experience than before. The incredibly long load times of last year's game, for example, have been dramatically improved (averaging 4-6 seconds between transitions instead of the ludicrous 12-17 second waits of the original). Hard drive support has made a comeback too, and its effect on the load times is even more dramatic than previously seen (it's close to instantaneous).    The one thing that the Resident Evil series has always done best, and continues to do, is look good -- and Outbreak's sequel is no exception. All told, the animations are still a little stiff in comparison to several of today's other high-profile action/adventure games, but the quality of the character models, excellent lighting effects, and clever use of shadow and camera angles is still just as spooky now as it has ever been.   Each of the eight different characters have seen upgrades that make them more diverse and effective too, with guys like George benefiting from a gun that'll fire healing units into allies, and Jim's brand new combo swing that gives him the ability to do more damage with pipes and bats. Other interesting includes, such as Cindy's blood-stopping bandage and Alyssa's high-voltage stun gun, help to round out a more versatile cast of players, while more general abilities like ~Action Aiming~ (walking while in attack mode) and ~Ground Grab~ (items on the floor can now be obtained as you crawl) turn out to be pretty useful as well.   Outbreak's environments this time around are more interesting too. The first (and coolest) stage of the bunch is definitely the City zoo that puts you face to face with infected zombie animals including the rotting remains of one pissed-off undead elephant. Other areas, like the underground subway station or the dilapidated police department are pretty fun too, and a lot more expansive and action-oriented than in the first game. In short, if you can get around the dated controls you'll probably love the way everything progresses this time (especially with the healthy amount of unlockable bonuses to find along the way).As a longtime fan of the Resident Evil franchise it pains me to admit that the RE4-style overhaul is desperately needed for every future game in this series. With lesser known titles like Still Life and Obscure upstaging its more expensive counterpart by accomplishing things that Outbreak should have pioneered to begin with, the proof that the formula is stale has never been more apparent.Despite its archaic response time and somewhat outdated feel, however, File #2 is still a significant improvement over the first game. Better character balancing, more useful gameplay options, improved boss fights, and much quicker load times are noticeable positives right from the get-go. And when you throw in the excellent production values, strong atmosphere, and effective soundtrack, it's difficult to stay angry about its problems for very long.Ultimately, though, it's hard to forgive Outbreak 2's repetitive nature, sluggish pacing, and lack of an effective online communicator. It was somewhat forgivable the first time around, but not 13 months and thousands of fan requests later. Sure it could be worth a try if you're a diehard RE fanatic, but horror fans in search of something a little more progressive may want to hold out for the PS2 port of Resident Evil 4 later this year.", "date": "Apr 29, 2005"}