{"name": "Motocross Mania 3", "name_review": "Motocross Mania 3", "ref": "https://www.ign.com/articles/2005/04/30/motocross-mania-3-2", "text": "When deciding what score to give a game there are certain criteria we hope do not have to be addressed. For example, a game should have clearly defined goals, functional mechanics, and some working controls. Once these standards are in place, we are able to critique the finer points of game design like sound, graphical prowess, and originality. Motocross Mania 3 is printed on a disc, comes in a box, and includes an instruction booklet, but it lacks many of the base requirements of what makes up a working game. So much time can be spent on its fundamental flaws that there is hardly room to mention its auxiliary shortcoming.   The first order of business in MM3 is setting up a player profile. This consists of an old-school, arcade-style three letter entry. The main menu offers up championship, single race, time trail, freestyle, multiplayer, mini games, and options. In the championship there are also battle royal setups in enclosed areas where combat is the only path to victory. At first glance, this is fairly robust set of options; however it all boils down to the same style of gameplay. The championship race has players battle their way through a series set on a variety of outdoor tracks. There are three difficulty settings the easiest of which is comprised of 7, 2 lap races in which players must finish in the top 4 places to advance. The next most challenging setting is sixteen rounds, with 3 laps in a race and only the top 3 advance. Before a championship race, players are able to challenge a competitor and win their bike. The challenge is decided over a series of three races.   In the championship mode there is a garage and auto shop where players can upgrade their bike. The multiplayer games are split screen only and feature a single race, a tournament, and a straight up VS. race. The mini-games include some simple deathmatch options and a form of tag where the person who's ~it~ has 30 seconds to pass it on before they explode. These extras are not very original, and add a minimal amount of fun to the title.    Players ride on motorcycles, but this is the only similarity between this game and real motocross. Racing is comprised of floaty jumping and cartoon-like combat, similar to the kind found in the Road Rash series. Races can be won either by crossing the finish line before your opponents, or by beating them to a pulp. Combat is huge portion of the game and it's often easier to crush other riders than it is to become a better racer.    The default controls are nonsensical, considering it sets the left and right attacks to the triggers. The gas is pedal is the A button, forfeiting the precise analog control of the triggers. There is a second control layout that changes the attack buttons to X and B, while the triggers are returned to their normal roles as gas and break. In the end, neither setup makes much sense because a ~pedal to the metal~ approach will easily get players through every race.    Keep this a hands-off experience Each racer has a health bar that can be depleted by using two methods. Racers are given a baseball bat to start, but can eventually upgrade to more powerful items like the cattle prod, a bear paw, an ice pick, and a cricket bat. Money is awarded through winning races, performing stunts, collecting items, and by picking up wads of cash during a race. Purchasing a new weapon can be expensive and can only be used for a set number of hits before disappearing into thin air. Air attacks involve acrobatic flips and kicks that do not require a weapon. They are performed through directional combos and the B button in the default control layout. According to the instruction manual air attacks involve ~showing off and kicking ass at the same time.~ Actually, an air attack disables a character's steering ability so unless you show off by swallowing a face full of dirt, these moves are only handy on long straight jumps.     The mania meter at the bottom of the screen is used to slow down time. This feature resembles bullet time, but instead of only impeding the opposition, it also affects the person using the effect. There is very little advantage to using mania mode except for getting in one or two more hits when directly next to someone. Speaking of things that don't work, the directional arrow used to guide players through a course is barely functional. The arrow points towards vaguely defined check points, but often spins in circles or changes directions for no discernable reason. If a check point is missed, most games will warp players back onto the track after a set amount of time passes. In Motocross Mania players can drive off into oblivion until the race is over.     When knocked from a bike, a player's body has no collision detection and flies through objects including the ground. The game often spawns players facing the wrong direction, and the position indicator changes without any clear indication of a player being passed or getting ahead.     Look Ma, No Style  The tracks are a variety of urban and woodland courses that feature plenty of jumps and tight turns. For some reason, each stage is covered by a dense haze that limits visibility. The benefit of this feature is that it hides some of the horrendous pop-in that occurs in every environment. It is also possible to drive off the edge of the world in a few stages and ram face first into numerous invisible walls. These types of bugs make me want to set down the controller and ram my face into a real wall. As a side note, the water in this game is handled as a solid surface and players can ride across lakes as if they were concrete.   The starting cast of playable characters is comprised of eight stereotypical ~extreme~ bikers. It was hard to choose between Moishe Flaven of West Hollywood and Oleg Trotsky from Russia, but ultimately I felt that Moishe was more likely to appear in a Mountain Dew commercial. The overall visual style of this game is a throwback to the 32 bit era when developers were just getting the hang of fully realized three dimensional worlds.    Sound  The music in Motocross Mania is the type of repetitive, super heavy guitar rock I've come to expect from budget titles. There are no custom soundtracks so players will have to make do with turning the volume off and popping in a CD. I recommend Def Leppard's Hysteria. The sound effects are laughable with a few poorly acted voice clips and strangely emphasized chirping birds. There is an annoying effect during a crash that is supposed to resemble bones crunching but instead sounds like dice being rattled. The best and worst sound effect in the game occurs every time players utilizes their mania meter. A cartoon voice yells out ~mania!~ in the goofiest possible fashion. This may be the game's only redeeming quality if players are looking for a way to purposefully annoy people around them.   Even if Motocross Mania 3 were to fix some of its glaring design flaws, there are still plenty of excellent games on the market in the same genre. Just last month we reviewed MX World Tour: Featuring Jamie Little. This game received a 5.0, but it qualifies as a far better rental experience than the mess that is Motocross Mania 3.", "date": "Apr 30, 2005"}