{"name": "Stronghold 2", "name_review": "Stronghold 2", "ref": "https://www.ign.com/articles/2005/05/01/stronghold-2", "text": "is not a strong game. I loved the first, but I was near to pouring pitch on the second thanks to a slew of bugs, missing features, and generally mediocre gameplay and production values. This sequel does very little to advance the RTS genre or even keep up with the norm. A patch was released when the game hit store shelves that fixed some of the problems, but those of you without Internet connections at home are going to be straight out of luck. Those of you with Internet connections will have a slightly improved gameplay experience, but even that can't save Firefly's sequel.    Stronghold 2 is the follow-up to a game that holds a very fond place in my heart. I'm a turtler by nature. I like to build impenetrable bases and watch the enemy shatter on a deadly shell of defenses and then stick my neck out to bite the hell out of whatever is left. The Stronghold series plays to that preference and therefore combat is tailored to the defensive. Stronghold 2 also brings a system of economic and citizen mood management with it. The management isn't rotten at the core, but it is slow and isn't rewarding enough on its own to help the game succeed. The combat portions of the game are equally as flat and unrewarding creating an all around mediocre gaming experience.   Both aspects are presented to players in the form of campaigns. Players can walk the Path of Peace or the Path of War. Peace sets a campaign of economic strategy and city building, which are centered on aspects of city life. For instance, peasants have to eat and need a place to sleep. In turn, they'll work their sorry little asses off for your betterment. Aside from the very basics, peasants also need to be kept happy. This includes providing a clean environment free of disease ridden rats and gong, low crime, religion, and beer. Of course, in order to have beer you'll need barley, breweries, and an inn. In order to have religion, you'll need bees, candle makers, and a church (God knows you can't have church without candles). Keeping crime down is the trickier thing. Some of your employees will suddenly, for no understandable reason, turn to crime. No matter how happy your castle is, someone is always looking for the quick way out. What's especially frustrating is that the frequency is ramped up in certain portions of the campaign. Sometimes, before one of my weapon smiths (who seem to have the highest rate of crime despite having what is probably one of most well respected and highest paid jobs in the city) even gets to the job after converting from a peasant, he's off trying to steal things. Why are these guys so upset? I have no idea.     The worst thing about the happiness rating in Stronghold 2 is that if you forget to place an important worker (say a gong farmer or hawker), your citizens will start getting upset while you're off trying to save your town from rampaging bandits that your trained spearmen can't seem to handle. On their own, unhappy citizens would be fine as they encourage you to create healthy towns from the get go. The problem is that there's no real warning system in place to inform you that your citizens are angry or any kind of time table that tells you when they'll begin leaving. You'll come back to your town from directing a battle to find all of your citizens have abandoned you, leaving your castle worthless. It's not like it's a slow trickle out of the castle that you can reverse with a little bit of work. It's a mass exodus.    Even worse, it seems to be the guys like the hawkers and gong farmers that take off, leaving your town a disease ridden dump, which only makes things worse. You can switch off industries hoping to move existing citizens over to these most important roles, but they'll end up leaving, or moving to another job, leaving you to shut down every aside from those couple you need working. There's no way to tell a worker to move jobs specifically. There's also no way to tell one particular building to shut down without stopping an entire industry, which makes absolutely no sense. The result is a city that simply ups and leaves. Almost every last one of them. And aside from handing out gold as gifts, there's no real way to get them back. Why they didn't have citizens simply work slower to grind things to a halt until problems are fixed, I don't know.   City building in general can also be odd. You can't place storehouses wherever you want, nor can you tell certain buildings to take their products to certain places. They'll automatically take it to the closest building, which might not always suit your purposes best. Some buildings can be rotated, while others cannot. Forests also can't be clear cut to make room for more industry, which can be incredibly annoying considering castle walls and buildings simply pop into existence upon a whim.   One aspect of city life that's been added that I like is the idea of living like a lord. While it doesn't quite have the personality that I might have liked to see (a problem that drags this game down in every area), it's a good move forward. Your Lord not only serves as the leader of troops (though he bestows no morale advantages) but also as the center of your community. The more he lives like a proper lord, the more ~honor~ he gets. Living like a lord entails eating better foods, holding feasts, holding jousts, having a wife and so on. Gaining honor allows for the purchase of estates outside of the area. Unfortunately, the estates all run themselves. You'll gain money and perhaps some shipments, but that's about it. Enemies can then take the estates over via military means that are pretty akin to capturing a control point in Battlefield 1942. More importantly, honor allows the recruitment of units, most notably, the high priced knight. These special units will kick the crap out of any other unit in the game and can even ride a horse granting them a few more hit points (the horse dies first) and extra speed.     One of the main differences in the military portion of Stronghold 2 from the original is the fact that players will have to venture out onto the map to claim territory and attack enemy castles actively. Both the single player road to war campaign and kingmaker mode will challenge players to act both as defender and attacker.   Unfortunately, unless you're playing against a human opponent, this is going to be a pretty boring exercise. Stronghold 2's AI is not exactly challenging when playing in a kingmaker setting and only becomes challenging at all when huge numbers of them are set against a small number of your own opposing forces. The problem with the AI is that it won't sit back and let the catapults and trebuchets break down your walls and force you to attack. They also won't sally forth from their own castles when you're bombarding their own walls. It makes both defending and attacking ridiculously easy as long as you have a siege camp to bring trebuchets and catapults along for the ride. You can pick all of the enemies off bit by bit and destroy their buildings around them and they won't budge.    But what I find most entertaining is the AI of both sides in sieges. Enemies will run up crazily with ladders and place them on a wall. Meanwhile, the enemy units are sauntering up from behind because they're so slow. At the same time, units on the walls will decide to push a couple of the ladders down, but leave the rest standing, I guess because they like a challenge. Some of them will even climb down the ladders to get outside the city walls to engage the enemy on a level playing field. What the hell? At the same time, if there's more ladder carriers running up behind, they'll climb the ladders that are already placed, still carrying their own ladders and put them on the inside section of the city wall. Again, what the hell? Even better, ladders that are placed on a section of the wall where you've put defenses like rolling logs will cause those defenses to completely disappear.   The one thing that's been done fairly well about both building and the military aspects is the easy construction of walls and defenses. Firefly included a top down view to make the placement of walls easier and to allow you to make sure that you've actually made a solid wall (a problem in the first game). They've actually included a lot of other useless views as well, but this particular one is helpful for laying out your town.   Actually getting your troops to really attack in an organized manner can be a chore. A feature to give different orders to units and then hit a key to actually make them carry these orders out (like the feature in Empire Earth II) might have solved the problem. What's particularly brilliant is that your units will simply mob targets in any case. Sorting out fights when a blob of units are attacking each other isn't particularly entertaining, even with a pause and order feature. But then again, your guys won't even line up in smart formations (melee units in the front, archers in the back) without downloading the 26 MB patch.     Even with the patch, the game can't be saved from its horrible production values. No amount of patching it will save that. Firstly, the story is bad. The voice acting to go along with it might actually be worse. The animations used in cutscenes, or any part of the game for that matter, are clunky, slow, and lifeless. Frankly, there's nothing redeeming in the visual quality of this title. Technically and stylistically Stronghold 2 would need a complete overhaul to rest on the good side of average.   It's strange that game that doesn't have anything special in the visual package would also run so sluggishly. Patched or not, this is a big issue. I've been running the game at 1024 x 768 on a 3.2 GHz machine with a gig of RAM and a Radeon X800 and it still has major problems.While there are some good ideas at play in Stronghold 2, they just aren't implemented in a way that I can get behind. For every good point, there's something ugly overshadowing it. Even with the patch, the game isn't something I would want to recommend to my friends and therefore am not recommending it to my readers. You'd do well to avoid this unless you're a serious fan of the series or simply want to build castles in the sandbox mode. The story is a mess, visuals are lifeless, and gameplay is flawed on many levels. Hopefully Firefly can recover from this with their next title.", "date": "May 1, 2005"}