{"name": "Killer Loop", "name_review": "Killer Loop", "ref": "https://www.ign.com/articles/1999/12/22/killer-loop", "text": "Killer Loop wants to be every other futuristic racer ever made. Not that the idea of busting the sound barrier in a sleek set of wheels (or no wheels even) has lost its luster, and Killer Loop is amongst some good company. Yet it adds nothing to the genre, and it's competitors are just too superior for this game to barrel through them.  Gameplay Combining elements of Wipeout, Extreme-G, and F-Zero, Killer Loop is a race on the edge of tomorrow. Cobbled together around a generic plot about lack of gas in the future is a 400 MPH electro-burning  tournament on one of 8 spiraling pipe-cut courses. Your magneto-kinetic tripod swivels, slides, speeds, and sticks its way through the field in the quest for the cup. And if good clean racing isn't your idea of a next-century grand stand spectator sport, then give the fans what they want by launching rockets or missiles at opponents.  The issues with the game are few. In fact, the game has very few flaws. The MKs (the vehicles you race) steer from the front leg rather than the center of the racer -- while turns are accurate, the MKs have no lean and rotate in circles too easily in tubes (thus making it easy to get spun backwards) -- but that's not exactly a flaw so much as it's a design decision I personally don't agree with. Also, while it's possible to disconnect the engine to get more slide out of the ride, it would have been nice to have more of those hacking features available -- that would make a race kind of like Star Wars' Pod Race sequence, where you're constantly soldering connections and reassigning tweaked parts while in a race to eek out more speed or special control. But, again, that's not exactly a fault of the game so much as it was something that could have been that wasn't.  But that's the problem of the game. I spent much of my time playing it thinking of things that could have improved it, or of better games that had the features this game was missing. For every moment I spent on the ceiling of a tube, I though of the hours in Stun Runner I spent doing the same thing; for every straight-away I broke 400 MPH, I though of entire laps in Wipeout where I broke out at twice that speed. If Killer Loop had done everything right, the generic quality wouldn't have been such an issue. And it doesn't play that horribly. Yet there's nothing that stands out about the game. The MKs ride high on their tripod legs, but the legs don't flex and the vehicles seem to have no center of gravity, so the feel is very stiff and bland. The control over the slide is a good addition, but they don't slide enough -- cars should have slid as much stock as they do when you disconnect the engine. And the magnet feature, which lets you race on the ceiling, is far too limited to be inventive. As soon as you start to figure out how to use the magnet's power to your advantage, the MK will run out of mag power.  Graphics  Graphics also loot heavily from other racers. The presentation pilfers Wipeout's esoteric design so thoroughly it should be illegal. From the gaudy colors to the bold graphics to the modish fonts, Killer Loop is a carbon copy of the Psygnosis series.  Racing graphics are a little less Wipeout, but are a lot more R4 or any other 3D course-bound racer on the system. Backgrounds are sharp and well designed, with many futuristic landmarks and special lighting effects. But the roadside detail still mimics every other racer on the system, from the waterfalls to the arches, the lens flares to the moodily-lit tunnels. It seems that the only original design in the game is in the vehicle designs, and perhaps that's indicative of why the designers chose to copy other games rather than go out on their own -- MKs are some of the goofiest, askew, unintuitive designs for moving vehicles ever.   Sound Techno tracks, digital bleeps and bloops, and '80s arcade simplicity. Nothing special, nothing original, and certainly nothing to write about. Not a terrible game, but not too exciting either. There's no two player game to add to the appeal, and the actual tournament is not quite stimulating. What's worse, the game design isn't too impressive. Tracks are a bit too tightly bound to really let you open up the speed, the magnet power isn't as effective as could be, and the MK vehicles steer as if they're futuristically powered magic bricks.", "date": "Dec 22, 1999"}