{"name": "Pokemon Emerald", "name_review": "Pokemon Emerald", "ref": "https://www.ign.com/articles/2005/05/03/pokemon-emerald", "text": "Ever since Nintendo realized it had struck gold with Pokemon, the company has never backed down from milking the virtual cow. Even in the early days of the series the company kept the money rolling in by offering basic updates to the RPG game design, even when those games had already run their course. On the original Game Boy, the success of Pokemon Red and Pokemon Blue spawned Pokemon Yellow. When the Game Boy Color hit the scene, Pokemon Crystal kept the series alive after Pokemon Gold and Pokemon Silver had their time in the sun. Pokemon Emerald is Nintendo's way of keeping the RPG train chugging along, having the series remain in the Game Boy spotlight for as long as the public can stand it. The game is, for the most part, an extension of the storyline, universe, and ~quest~ that has already been established in the release of 2003's Pokemon Ruby and Pokemon Sapphire, with the additional creature animations and Wireless connectivity brought forth in last year's Game Boy remakes of Pokemon FireRed and Pokemon LeafGreen. So, for anyone waiting for the Next Big Thing in the Pokemon franchise, Pokemon Emerald honestly isn't it. It's a been-there-done-that experience, but at least that experience is still successful, even if it's been recycled for a new shade of cartridge color.  In the Pokemon series, players assume the role of an up-and-coming Pokemon trainer. Pokemon are among a class of various creatures who live in harmony with humans, from bird to bug to fish to...puppet. Players work their way through the land, going from town to town, using their skills to capture Pokemon in the wild to do their bidding against other Pokemon trainers. Successful battles between Pokemon will strengthen those creatures, and the higher their level, the more powerful they can be. When a player's set of Pokemon is at a certain level, they can attempt to challenge the town's Pokemon Gym leader. The leader holds a specific badge for Pokemon trainers to collect, and by defeating this leader, players earn that badge and the abilities that the badge holds. By collecting all eight gym badges, players will earn that coveted Pokemon Master title. Pokemon Emerald is going to feel somewhat like a TV Land rerun marathon to anyone who has already experienced Pokemon Ruby or Pokemon Sapphire. The foundation of this green cartridge has already been laid out in the 2003 release; from start to finish, the goal is essentially the same experience, so if you've already romped through Ruby and/or Sapphire, you'll really have to be among the absolute die-hard to put in another 30-plus hours to get through the quest again.    But like a TV Land marathon, there are special, newly-created treats sprinkled throughout the experience to make experiencing this repeat worthwhile. Pokemon Emerald's special edition additions are minor but numerous, and collectively they admittedly do improve the Pokemon experience -- albeit minorly -- to make Emerald the prime edition for anyone just getting into the series. There are new creature animations during battles as well as extra side-quests and fights, and altered placements of creatures to make some Pokemon rarer than others.    More importantly, Pokemon Emerald adds in Wireless Adapter support, an element that made last year's Pokemon FireRed and Pokemon LeafGreen more than simple Game Boy Advance remakes. Emerald's Wireless Adapter support enables better trading with the ~newer~ Pokemon creatures established in the Ruby/Sapphire series, and also builds up the community aspect with other Pokemon adventurers since players can battle and trade within a ~Union Room~ of dozens of participants. Unfortunately, Nintendo didn't feel that it was necessary to package the device with the game this time around, which was the real feather in the cap for FireRed and LeafGreen and the absence of Emerald brings down this continuation's value below last year's Pokemon release.  Even as a ~director's cut~ style repackaging, Pokemon Emerald still retains what makes this series a must-have: it's a fantastic, deep adventure that really deserves to be played at least once. Socially, it's ~cool~ to hate Pokemon because of its sugary-sweet character design and complete saturation within the gaming industry, but its success isn't just clever marketing; Pokemon is, and has always been, an excellent RPG game on the Game Boy platform, offering an incredible amount strategy within its design. And this should mean something coming from someone like myself who's a self-proclaimed hater of the ~random battle~ element inherent in Japanese RPG designs; the Pokemon formula utilizes it, but in a much more palatable way by keeping creatures in specific locations. In other words, there's an easy way to avoid fights if you need to.  And with Nintendo's inclusion of the Pokemon series within the company's ~connectivity~ strategy, everything players do in the Game Boy Advance adventure can be moved to other games, like Pokemon Colosseum on the GameCube and Pokemon Dash on the Nintendo DS...with more on the way. That thirty dollar investment goes a long way with Nintendo's other game systems and Pokemon titles.  I've played through every Pokemon RPG game since the original release of Pokemon Red and Pokemon Blue, and I can honestly say that despite its cute and kiddy reputation, Nintendo's RPG series is successful for more reasons than just brilliant promoting of the brand. So, with the release of Pokemon Emerald, I will admit that my enthusiasm for a rerun this soon after FireRed and LeafGreen -- two reruns themselves -- is somewhat low. There isn't a whole lot new in this green cartridge that can really validate its release outside of Nintendo's business model of simply making money. And this is made even more clear when you realize that Nintendo didn't give players a free Wireless Adapter this time. Yes, I'm not quite as enthusiastic for Pokemon Emerald. But I just can't ignore that the game's entire design is based on a stunningly great role-playing game with an amazing amount of depth. And at the very least,  Pokemon Emerald is the game to get if you have yet to put down the funds for a GBA Pokemon game. You'll just have to find yourself a spare Wireless Adapter to get everything out of this version.", "date": "May 3, 2005"}