{"name": "Pariah", "name_review": "Pariah", "ref": "https://www.ign.com/articles/2005/05/03/pariah", "text": "When games like Half-Life and Unreal started coming out, everything changed for the action arena in terms of story and intensity. As FPS dedicated developers traded blows for the next several years trying to claim the shooter crown, the ideas of what made an FPS successful were cut so deep that some games couldn't seem to claw their way out. Breaking out can be hard for even the most dedicated and well versed development crews. While there are some that do manage to srabble up that slipper slope, it probably comes as no surprise that Pariah, while containing some good ideas, settles a little too easily into the groove molded by so many that have come and gone before.   Pariah starts out intriguingly, with cinematic music and title screens, and an extensive intro cutscene with above-par voice acting and sprinkles of R-rated profanity that will continue on to the end. While the cutscenes are well produced, they suffer from distracting edge crawl. It's all done in-engine, but it's pre-rendered at a low resolution and without antialiasing. It looks as though both the Xbox and PC versions contain the exact same clips. While the poor quality won't be too noticeable on the Xbox, it's jarringly different from what you see when you're actually playing. This wouldn't be such a big deal if the game wasn't so story- and scene-oriented.   Further complicating this element of the game is that the story comes off as a little bewildering and threadbare. Someone's running off and you have to go catch them, then you're shooting people on a train, then you get captured, and by the time I get to the end, I couldn't quite figure out why I was there. All I knew was that I had to kill some people before they killed me first--and then it was over. I had no idea that the last boss fight was the last boss fight, because I didn't recognize the boss, even though I had the impression that I was supposed to. It seemed as though a lot had been cut out by the end of production.   But meanwhile, the game itself isn't so bad. It looks pretty good, if a little environmentally monotonous. Although the story is pretty rough around the edges, the individual set pieces are competently put together. You won't see much variety in the enemies, and building architecture isn't quite as refined as the shooter fan has become accustomed to. Everything is just a little bit blocky. The weapons are varied and each is useful, but the vaunted upgrade system could be a little more informative. Sometimes the weapon becomes more powerful, but sometimes its behavior is altered, and you don't really know which is going to happen until after you apply the upgrade. Sometimes the upgrade doesn't seem to make much of a difference.     I have to say, though, that the sniper upgrade that gives you an infrared scope is the business. I was picking them off with ease. Unfortunately, it's more of a shooting gallery than a shooter, since the enemies don't react well (or much at all) when their patrol buddies are getting their heads blown open like watermelons. Sadly, it's the same basic routines we've been seeing for years: duck a little and look around, duck and camp insufficiently behind a box, or stand behind a tree. It's like of Far Cry AI, only getting to the point where they take some basic defense without actually trying anything like flanking, flushing out, or aggressive advancement. They would, however, fly straight me sometimes and blow both of us up, which gets kind of aggravating, especially since Pariah sticks rigidly to the checkpoint save system. All the while, I couldn't quite shake the feeling that I was playing against Xbox-oriented AI, since those silly controllers will never compare to the majesty of a mouse and keyboard. Yeah, you heard me. Bring it! In fact, certain segments felt easier than I think they were intended to be.   At any rate, the game also suffers from brevity. Although that's the soul of wit, it's not so great when combined with the cobbled-together feel of the story and the overly familiar design of action and encounter. Pariah would have benefited from more variety, increasing difficulty, and more set pieces. The vehicle control feels a little awkward and the vehicles themselves aren't too exciting, nor can they make good use of their surroundings. It's mostly just something you get through without getting yourself killed by staying behind the wheel until it gets blowed up good.   The physics are fine, but I felt a little cramped by hillsides, sheer dropoffs, and twisting paths. When I get behind the wheel, I want to rock out, and it was often better and safer to just hoof it. You'll be going up against other vehicles sometimes, but Pariah's generously high and floaty jump mechanism means you can hurdle pretty much anything that comes flying at you. And none of the enemy vehicles are particularly dangerous. In the one segment where they actually pose a threat, you'll be sufficiently fortified to get through it in one try. In fact, the game as a whole is just a little bit easy and breezy, doable in less than ten hours and feeling like three or four.   Throughout the experience, I could see influences that I felt DE was trying to capture, particularly Halo and Far Cry. But, for Halo's faults, it told its story well, and Pariah does not, thereby subduing the drama and making some sections feel more like an exercise than an adventure. I never quite lost the awareness that I was playing a game.I'm starting to feel like a broken record here, but the shooter genre is one of the most painfully competitive in gaming. Pariah already comes to the table with the burden of having no established license or franchise, even though DE is a veteran developer with many hallmark titles to its name. For better or worse, perhaps they should stick to what they're excellent at, namely fragalicious multiplayer mayhem. Or maybe Pariah was just the victim of running out of budget before it ran out of game, if the story is any indication. It's quite solid in most respects, but it won't tear you away from whatever you're currently hooked on. In fact, Pariah just made me want UT2006 that much more.", "date": "May 3, 2005"}