{"name": "MX World Tour", "name_review": "MX World Tour: Featuring Jamie Little", "ref": "https://www.ign.com/articles/2005/05/04/mx-world-tour-featuring-jamie-little", "text": "With a name like MX World Tour: Featuring Jamie Little one might expect a certain feature set in the game. First, a world tour should probably encompass many environments or settings. Then, with an official announcer attached to the title, players might assume that the game would include officially licensed MX athletes, and some quality voice work. Unfortunately for us, this game contains none of these qualities. Oh, and a decent racing engine would have been nice.     MX World Tour contains stadium races (SX), outdoor tracks (MX), and as a reward for completing career mode some SuperMoto racing. The locations are different but the basic idea behind a race is always the same. Twelve competitors rev their engines at the start line and take off down the course. Players can receive an extra boost by holding the clutch and the gas button before the gun goes off. Leading the pack down the first straight away awards people with winning what is called ~the holeshot.~ This doesn't actually present any benefit besides putting players ahead of the pack, but it's something to shoot for to start off on the right foot.    Winning a race is all about dropping the clutch in the turns and boosting into the straights. This is combined with finding a rhythm on the bumps. Holding back on the analog stick when approaching a rise enacts a boost. When in the air, you can tip the bike forwards or backwards depending on the position of the landing. Sticking the landing is critical for maintaining speed and staying in the driver's seat. Hitting a barrier head-on or flubbing a landing will result in some of the most hilarious crash sequences I've seen in any game. Racers remain in their seated position as they hurtle through the air, then skid and roll to a stop in the dirt. Purposely torturing your MX rider is good for a few chuckles, even through it probably wasn't meant to be one of the more positive features of the game.   The heads-up display can pretty much be ignored, as it offers no useful information about the race aside from positioning. The mini-map displays other racers as small colored dots that are nearly impossible to associate with a specific person. The menu system is ugly, and instead of an auto-save feature, players will be asked to save when navigating many of the options or have to do it themselves in between races.    MX World Tour is by no means a simulator. The air is huge, and gravity feels significantly lower than what normally exists on earth. When bouncing into the stratosphere, players don't have to worry about falling off of their bike or flipping to the sides. The biggest worry is hitting a jump straight on, to prevent landing out of bounds. Other players get in the way, but they can also be used as turning devices since bouncing off other characters doesn't slow down your rider in the least. The brake can be used around tight turns to kick the back wheel out, but learning to use the clutch in its place is a better idea. Learning to combine these methods to race like a champ only takes a few exhibition matches. Adjusting to the game's controls is where most of the fun lies in World Tour, however once I got the hand of the bouncy races the game quickly became repetitive.     The menu of World Tour includes a quick race option, customize, a career mode, and an exhibition mode. Starting a new career throws players into a series of increasingly difficult series. There are ten of these series that unlock new upgrades for the bike and rider. Applying these upgrades is handled in the customize menu that is broken down into the rider and the bike. Riders can be equipped with different colored boots, chest plates, and other outfit accessories. There are six different head styles for females and seven for males. The riders are blocky and lack style, but all of these qualities fade into the background during a race. The A.I. controlled competitors are a gang of fictional characters from around the world. Each rider has a stereotypical name in line with their origin. For example the female rider from Italy is named Donna Tello. Players can race as Jamie Little, but taking the wheel as the commentator doesn't really add to the experience.      There are a limited set of bike upgrades that could benefited greatly from a large set of officially licensed upgrades. Instead, players are often given the options between ~stock~ and ~modified~ parts that have little effect on the performance or appearance of the vehicle. The exhibition races also included a small set of options like the number of racers on the course from (1-12), the number of laps, and the difficulty. Multiplayer offers very little over the single player experience. Up to four players can race on a single system in either a series or a single race.    Dirt Poor  I understand the difficulty in presenting a compelling visual experience based on mounds of dirt, but even given the benefit of the doubt, MX World Tour still falls short in the graphics department. The character and vehicle models have low polygon counts that are throwbacks to the 32 bit era. The backdrops are standard in every respect and never add to the atmosphere. A massive stadium in Tijuana feels the same as one in Chicago or Monterrey. There is a slight blur effect to add to the feeling of speed when launching off of a jump, but that is all in the department of flashy effects. The game runs exclusively in 480i which is almost a good thing, considering a higher resolution would only accentuate the substandard graphics.    Rock Your Face Off.  The musical tracks included in MX World Tour are some of the chunkiest, head-banging, ass-kicking, heavy metal ever committed to disk. For the nancy-boys that can't handle this level rocking out, there is also the option to use custom soundtracks on the Xbox. Although Jamie Little is featured prominently on the cover of the box her actual commentary during the races is sparse and repetitive. She has a short blurb regarding the location of the event, a few exclamations when players crash, and announces the winner. The commentary isn't just poor when compared to the advanced audio features of EA Sports games, it is lacking when sized up to almost any game featuring an announcer.    MX World Tour is a bare bones racing game with a gameplay style that quickly becomes tiresome. The addition of multiplayer may amuse gamers for an extra 10 minutes before moving on to another game. This is a budget title that might provide a sliver of fun when snatched out of the bargain bin. I would recommend it as a rental for hardcore MX fans, but not before much better titles like vs. ATV Unleashed.", "date": "May 4, 2005"}