{"name": "Cold Winter", "name_review": "Cold Winter", "ref": "https://www.ign.com/articles/2005/05/11/cold-winter", "text": "~Boy, Cold Winter is terribly brown and boxy. We think we'll just pass on this one and pick up a copy of Rogue Agent, which seems far more color-- Hey now! There's a known murderer in a pink bikini! Let's see if we can't get us a date for tonight.~  Damn you, eyes. That and just about everything else is all your bloody fault. We lay the neuron interrupting brain massage we're all so regularly subjected to entirely on your shoulders. You've been poorly influencing humanity for tens of thousands of years. ~Golly, that fire sure is pretty. I think I'll just plant my caveman face right in there and get to the bottom of it, eh?~ Will it never be enough?  Just look at you ocular bastards. A few millennia of mucking around in the average man's business just wasn't enough, was it? Now you're finally screwing over PlayStation owners.    Blasted eyes! Had Cold Winter featured an impressively dazzling, uniquely vivid graphics engine to wow you, gamers probably wouldn't be so quickly duped into dismissing this one's otherwise terrific action in favor of far worse PS2 shooters.   That's the long and short of it. The game plays good and looks bad. Try and remember that. The rest sounds a bit like...   Andrew Sterling is an aging, bitter man. But he's not the kind of man who fixes cars, sandwiches and women. He doesn't sit comfortably in a cubicle behind the relative safety of a computer enterprise as the world tirelessly spins in its own special kind of serenely chaotic way. He's the kind of fellow prone to seeking fortune at the grave expense of the many dead people left in his wake. He's very...talented. He is a man who was finely honed by the elite British Special Air Services.   Dan Perish is a man like Andrew, only age and injury have swept his wild youth aside and replaced field work with a steady and lucrative job managing blokes like Andy.   John Gray is a man unlike any other. It is he who will determine the fate of the world, but only through Andrew and Danny's actions.  Three men. One story.   Pillars Won't Save You  One of the highlights of VU Games' Cold Winter is its storyline that ties all the senseless killing together. Non-interactive CG cutscenes emulate the overall style of the game without any of the obvious technical limitations of the actual engine and feature well-done voice work and solid direction. This level of care placed into conveying an actual plot is definitely appreciated.  It all begins with a comparatively simple prison break out of a Chinese military stronghold. Our boy Andy has spent a good bit of time isolated there. Between being tortured and eating rats, he's dreamt steadily of exacting brutal revenge on all those that held him. As soon as he escapes and recovers (the parts that come just after slaughtering many Chinese guards), Andy sets out to freelance for Dan Parish.   His first task is to take down an arms dealer named Salah. This task naturally evolves into something bigger, which just happens to eventually thrust Andy into the middle of a conspiracy that's been spinning out of control since World War II's ashes began to finally settle.  All this background flavor is a great inclusion when seen within the confines of a PS2 shooter genre dominated by half-assed attempts at narrative, poorly constructed stories that might have been compelling in a dream, and games with no plot at all. It's unfortunate then that a large helping of presentational omissions mar an otherwise generally well thought-out game.   One of the presentational offenses includes disallowing users from watching cutscenes a second time. This reviewer learned this sad fact the extremely hard way when an inopportune phone call interrupted a particularly pivotal conversation with the mysterious John Gray character. Strike one. Now why are there no real in-game options? Where are any of the audio sliders? What's up with 480p widescreen? How come I can't get a decent rating? What do the ratings even do? Etcetera.  While the fates of Andrew, Danny and the entire world eventually hang in the balance, the overall box in which their adventure takes place often relies too heavily on the average gamer's patience level. But that's not so bad since it's the gameplay we're supposed to being focusing on, no?  Since its public unveiling, Cold Winter has been billed as the Goldeneye sequel that should have been. That claim is fine with us. Many of the gameplay elements that made Rare's beloved N64 shooter so engaging have been transferred over here, and not secretly.  Immediately, gamers will recognize the pacing, which feels decidedly like Goldeneye -- characters are strongly encouraged to take things easy, anyway. This implies that stealth is of some value when in fact prudence is what's being emphasized. A surprise mechanic also helps create an illusion of legitimate spy work. But like Goldeneye, levels are built to funnel the hero and his enemies into cramped combat areas while always encouraging the player to gun down anything stupid enough to turn the corner without ducking and covering. It's action with a hint of devious, sneaky behavior. Just a hint, though.  The weapons even come straight from James' grip. Grounded in reality, the guns Cold Winter offers up never kill any aliens or mutants or mutated aliens, but they do shake and rattle and feel lethal enough to be exciting. A P90 isn't all that impressive compared to a shrinking freeze ray of plasma death, and yet it still works extremely well.  It should be known, however, that VU Games' real homage to the big G is the way each multi-objective level of Cold Winter take direct inspiration from that seminal Bond title. Even basic world interactions, which include rudimentarily screwing with security systems and planting the occasional bomb, seem like objectives we've played before.       Even if this one does simulate Bond's old exploits in those key ways, the end fight -- if it can even be called one -- involves dispatching nondescript guards and setting a few random shaped charges. Hardly a boss encounter of the quality we've been spoiled by over the last decade, not to mention a depressing way to conclude such a nicely put together story.  The unremarkable climax not withstanding, Cold Winter offers a consistently exiting Bond-ish shooting experience. But despite so many similarities to the N64 progenitor of all things polygonal console shooting, the games still differ in quite a few areas. Specifically, Cold Winter is super violent.   Soldier of Fortune styled death and dismemberment routines play often and usually work off a surprisingly believable ragdoll physics system. This creates a sort of goriness that may be a bit much for the meeker among us, but the actual visceral effect provides a satisfactory conclusion to killing that occurs quickly enough not to draw undue attention to busted up arms and such.   Cold Winter further distinguishes itself from Goldeneye by offering an extremely sound AI system (as far as PlayStation 2 and N64 games go, anyway).   Where Area 51 largely forwent advanced routines in favor of rushing monsters and Killzone just sort of forwent AI, Cold Winter took the Red Faction approach. It states that enemies should try and move out of the way of bullets, shoot in the general direction of their target, and usually not spin around in circles until they spontaneously combust. While the AI won't typically make use of the game's Havok physics system to spread out mobile cover and mess with the neat and tidy locales, it's nice to know that you can still exploit their weaknesses by tipping tables over and throwing boxes this way and that.  A typical encounter might involve the player first initiating action by sprinting up to an enemy and unloading a shotgun into the back of his head. After it explodes, that dude's nearby compatriots might dart in from different directions. After being shot at a few times, they'll take defensible positions and return fire. The in and out exchange of bullets and continues for some time. But beyond the classic, ~Now we must jump from one solid thing to another until we get within killing range~ approach to firefights, Cold Winter's AI also includes a few totally random, incredibly surprising spurts of spontaneous smarts.   Thank Goodness for Flame Barrels  While navigating Andrew through a series of perilous canyon trails, a sniper rifle suddenly fell from the sky and landed on our head. Bound by the same physics that determines how each and every object in the game should move, it tumbled off our face and down the canyon wall. When we looked up, we saw the soldier it recently belonged to snapping his machinegun into place. Dig that one! The sniper guard saw that Andrew was right below and moving too close and too fast to hit with his rifle, so he threw it down and whipped out the machinegun without first firing at us to give away his position. Too bad the gun bounced off the rock face and alerted us. Things like that don't happen often, but they do happen.   Now, even given the steady AI, solid weapons and good Goldeneye base, Cold Winter isn't without a few major problems (the anticlimactic nature of the conclusion not withstanding). In a word, we're talking about technology.  This poor performer features a sluggish framerate, uninteresting colors, muddy textures, flat models and way too many angular shapes to be healthy. The sound also suffers tremendously from some seriously low quality compression or implementation or some damn thing. Muffled effects, scratchy noises and jumpy audio are everywhere, but what annoys the most are the omnipresent background noises that never change in pitch. The first snow area features an ambient buzz not at all unlike a submarine sitting on your face. Another level sounds like it takes place entirely on the second level of a parking garage, while yet another feels like a city park. The ambient sounds are simply disastrous.   But that's not the worst part. The worst part is that the voice acting and music is absolutely great. Think about that one. The music and voice acting is great, yet it's of such poor technical quality that it all just kind of sucks. We almost feel cheated by the engine -- cheated into suffering through audio that would have benefited immensely from more powerful hardware or software.  Here's where it gets tricky.  Sound and graphics do play a large part of singleplayer gaming, but they're not the most important components. That is, they shouldn't make titles but they can certainly break them. In multiplayer, things tend to wave a bit more. It's there that the predominately boxy-brown levels and stuttering performance really begin to hamper an experience that relies more heavily on them. Because of this, Cold Winter lacks a level of solidity other first-person shooters on PS2 feature.   What it doesn't lack, however, is an abundance of modes and options. We've only recently detailed each of these in a feature, but suffice to say that a Goldeneye comparable level of configurable options and gameplay types are offered both off and online.  Unfortunately, we haven't been able to fully appreciate real-world eight-player online matches, which obviously require the luxury of post-review playtime. As of this writing, online players were difficult to come by and real-world performance between end users across the world and we editors was not measurable. Had we been able to travel forward a few months in time, we would have been able to rate these specific aspects of the online gameplay.   However, if you are looking for more detailed information on the Cold Winter multiplayer experience, IGN is currently planning on running an extended multiplayer specific feature shortly after the conclusion of this year's E3. Check back for it in a few weeks.While the technical failings of Cold Winter will certainly provide many gamers a reason to pause, the underlying combat of the title and the intriguing storyline that delivers it warrant play, if not purchase.", "date": "May 11, 2005"}