{"name": "Tin Soldiers: Julius Caesar", "name_review": "Tin Soldiers: Julius Caesar", "ref": "https://www.ign.com/articles/2005/05/12/tin-soldiers-julius-caesar", "text": "I used to be a big time tabletop gamer. As I've gotten older and less tolerant of the type of people you meet at miniatures conventions, I've had fewer opportunities to involve myself in the tactical side of the hobby. While the yokels at my local hobby shop seem content to spend countless hours playing Warhammer 40K and DC Super Heroes, enthusiastic opponents for historical miniatures games are disappointingly rare.  All that's to say that Koios's (Koiou?) new series Tin Soldiers fits the bill nicely by offering a solid historical miniatures experience that you can enjoy without braving the Cheetoh-munching, ass-crack crowd down at the local equivalent of the Android's Dungeon. DC Heroes Night indeed. Anyway, the second title in the series, Tin Soldiers: Julius Caesar, gives you the opportunity to refight some of the classic battles in the latter days of the Roman Republic.   While Rome Total War also covers the same time period, the two games couldn't be more different. The Total War game strives to present a real-time simulation of the actual experience on the battlefield. Tin Soldiers takes a different approach, offering up a turn-based recreation of Roman battles in a miniatures format.  While the overall authenticity of the tactics and units involved is incredible, the most charming and engaging aspect of this game is that it really feels like you're playing with miniatures. The units and the trees are even arranged on bases. Sure the units are a bit muddy in close-up and the terrain textures are pretty shoddy but the sense of playing with 25mm figures is a big part of the appeal of this game.  While I applaud the overall tabletop presentation of the game, there are a few areas where it sort of falls apart. Even though the game feels like a miniatures experience, it could use more of a tabletop feel. I want to see dead units sitting off the side of the map. Actually being able to see a table would also kind of reinforce what this game's trying to get at. The game does try to offer a taste of this kind of immersion via a detached hand that drops in to take away destroyed units but the whole effect is just awkward.   Luckily the combat modeling makes up for any clumsiness in terms of the visual presentation. There's a wide range of troop types here and some comprehensive but intuitive consideration for things like flanking and morale. The game also makes use of ~strategy cards~ that can offer a small, one-time bonus to a certain unit. Though these sound kind of gamey, they're fairly subtle and don't feel like cheating.  You and your opponent will issue orders at the same time and then watch as they play out. Midway through the execution of your orders, you'll have the chance to react to the changes on the battlefield. If, for instance, a unit now occupies the space another unit was moving to, you can change orders for the blocked unit. You can even designate certain units as reserves for that round and move them once you see how the turn plays out.  The interface for the game is really solid. The whole range of commands are right there in front of your face, making it a snap to issue orders to each of your units. A right click menu for commands (like in Combat Mission) would save lots of back and forth movement with the mouse, but the whole scheme is pretty convenient. The only area where the game definitely needs improvement is in distinguishing between the units that have received orders and those that haven't.  Where the AI of most single player PC wargames suffer in comparison to human opponents, Tin Soldiers offers a remarkably tough computer opponent. The AI is particularly good at showing you the types of tactics that you'll need to win. It manages to reach out and probe your lines very smartly, keeping the bulk of its force in reserve and only committing it once it knows what your disposition is. Even then, the AI is very good at holding back part of its force for a good long while, only bringing them to bear when they see an opportunity to exploit. The AI's also very adept at making a mad dash for victory objectives when you've left them open.  If you do find yourself wishing for a human opponent, the game does allow for online play but you'll need to connect directly to your opponent's IP. An in-game browser would help greatly.  There are a few different ways to approach the game. If you're in for the long haul, you can try out the campaign mode. Here you'll select from a variety of available missions, buying and training troops with victory points earned in battle. The idea of army management adds a little interest to the game but it's the tactical battles that are the heart of the experience. If you just want to enjoy the tactical side of the game, there are a number of skirmish battles that you can jump into.  The subject matter alone ensures that this is not a game for the impatient. Even so, those of you who actually enjoyed reading all of Appian's Bellum Civile are still going to be challenged by the slow pace of the game. It's not that the interface is poorly designed or that the AI is slow. What really drags is the actual execution of orders and combat resolution. While some gamers won't mind this slower pacing as much as I did, the lack of any speed controls means more anxious gamers are just going to have to deal with skirmishes that can last up to an hour.This is a great series. It certainly doesn't have the purely visual or kinetic appeal of a game like Rome: Total War but there's plenty of depth to be enjoyed here. Fans of turn-based tactical games will find this game to be a really tough and rewarding challenge. Fans of miniatures combat who can't seem to muster up the passion or interest to debate whether or not Aquaman would win in a fight against a Warp Beast will definitely appreciate the historical accuracy here.", "date": "May 12, 2005"}