{"name": "Haunting Ground", "name_review": "Haunting Ground", "ref": "https://www.ign.com/articles/2005/05/26/haunting-ground", "text": "It's not often that a videogame can make you feel uncomfortable with its themes, but Capcom's latest horror adventure Haunting Ground manages to do so rather successfully. Unlike titles like Manhunt or The Suffering, however, the game formerly known as Demento doesn't disturb because of heavy violence or gore... but rather, a healthy amount of conjecture and inference. Just what is it that the massive sloth Debilitas is doing to our main character following the ~game over~ screen anyway? How many voyeuristic camera angles can be used to watch the female lead before the experience feels less like a game and more like an intrusion? It's questions like these that give Haunting Ground a definitive psychological edge, and ultimately,  it's not what you see that's truly scary... it's what you don't.But that doesn't mean that Demento is entirely devoid of visual impact. In fact, it's quite the opposite. Truth be told, the reason that Capcom can get away with so much supposition in the first place is because Haunting Ground creates an immersive and believable world. Main character Fiona Belli is eerily realistic, with a range of emotional reactions played out via facial animations on par with the revered Silent Hill series. Supporting players like the aforementioned Debilitas, the beautiful housekeeper Daniella, and the uncanny butler Riccardo, are built and animated just as powerfully. And when combined with the deliberately washed-out artistic style of the mostly-brown environments and the unique ~panic vision~ screen-altering, the whole thing makes for quite a creepy proposition.Part of what makes these characters and their narrative so interesting to watch, though, is how little we know about them going in. When the story first begins, Fiona is thrust into the tale with no recollection of how she got there (just a scant remembrance of her parents and a car wreck), why she's locked in a dog cage, and why she's dressed in nothing more than a bed sheet. From that point on, the whole focus of the adventure is to figure out why Fiona is trapped in the spooky castle and how she's going to escape. But the only way to do so is to start exploring the 130-plus rooms at her disposal. This is Fiona. She's terrified... a lot. If there were a weakness in the storytelling, it would have to be with the  clichd nature of it all. Borrowing heavily from several pass horror staples of years past (Fiona frequently falls down, hides in not-so secretive hiding spots, takes the role of the ~hunted heroine,~ etc), Haunting Ground does and will feel familiar in several ways. If you've watched a lot of slasher movies or just played a bunch of Sierra's old point-and-clicks, then you shouldn't expect to be too surprised with what you get here. But one aspect that Demento does have going for it, is that the plot keeps you on edge with its uneasy sexuality. Whether it's the revealing clothing that Fiona is forced to wear, Debilitas' obvious carnal desires that are fueling his pursuits, or Daniella's sadomasochistic tendencies and negotiating skills, Haunting Ground's success comes from making the player feel like a desired and endangered object. It's both disturbing and effective at the same time.On the gameplay side of things, the mechanics of Demento aren't too different from 2003's serial killer opus, Clock Tower 3. That means that if you didn't like what Capcom offered horror fans two years ago, you probably wouldn't like this new effort either. Of course, the similarities between the two games aren't very surprising, considering that the teams for both projects shared several key members. I, on the other hand, liked Clock Tower 3 quite a bit and was more than willing to give the extension of its gameplay philosophy another try. You don't even want to know what this is... Now in the off-chance that you didn't play Clock Tower 3 (which wouldn't surprise me considering its sales), the game's main concept had players running towards designated ~hiding~ spots so that they could eventually lure their serial killing pursuers into fatal traps. As mentioned earlier Haunting Ground works much in the same way, but there are a few key differences worth noting. The best and most obvious improvement, for example, is that the panic meter takes a much more prominent role this time. So unlike Alyssa's slightly hampered performance due to fear in Clock Tower 3, Fiona's panic level affects everything around her. The more scared she gets, the harder it is to see what's happening onscreen, access special items, control our heroine's movements, and keep from tripping while running. It's a cool extension of the concept to say the least, and one that works surprisingly well.    Another new alteration to the Clock Tower formula is that Fiona has more ways to defend herself than Alyssa did. Instead of just walking around with a vial of Holy Water and looking for one or two places to hide, Ms. Belli can also do running shoulder blocks, kick her opponents where it hurts, and combine various alchemical items for special weapons (explosives, distraction tools, and the like). Fiona can even exploit more hiding spots in a single area than Alyssa could in the entire Clock Tower 3 game, as bathtubs, door panes, beds, curtains, and plenty of other spots will have to be used in a pinch in order to survive. Also cool is the fact that you can no longer automatically hide just by going to a safe spot -- if your enemy sees you go somewhere, they'll follow.One feature that didn't appear in Clock Tower at all, and one that adds a lot of personality and assistance, is the ability to employ your German Shepard companion Hewie. What's particularly fun about using the dog, however, is that you don't have any direct control over him. Instead, Fiona has to give him commands with the right analog stick and hope that he pulls through. This little mechanic is the most important of the whole game, as Hewie can not only fend off attackers and sniff out story-related clues, but he can also go into areas that Fiona can't to retrieve special items or solve puzzles. The trick is you have to establish a good relationship with him by praising him and scolding him for his performances. The results of which not only determine his uses and obedience, but also the game's ending.Despite its intriguing characters and clever mix of panic and dog mechanics, however, Haunting Ground never really achieves the legendary status of its Resident Evil and Alone in the Dark forbearers. The reason for this is because there's just not a whole lot to do other than run from your attackers, briefly subdue them, learn something about the story, and repeat. It would have been a lot more gratifying if Fiona could have used her hiding spots and the environments around her more offensively rather than defensively. Ask almost anyone an they'd probably tell you that if they're running away in a videogame it's strategic so they can fight again another day. But if nine times out of ten, you're just running away to advance the story before running away again, it's nowhere near as satisfying. Here we see a battle of two creepy (but smoking-hot) women. Capcom has an interesting horror experience with Haunting Ground. Twitch gamers and action fiends will probably have an intense dislike for it, but old-school adventure fans should appreciate its slower-paced gameplay and rewards for tactical escape. Needless to say it's a very specialized game, but for the market that it's trying to hit and the things it's trying to do, Haunting Ground's combination of high-end presentation, disturbing sexuality, and psychological mindjobbing makes it one of the most interesting games of the last couple of months. It's definitely not for everyone, though.", "date": "May 26, 2005"}