{"name": "GTA San Andreas", "name_review": "Grand Theft Auto: San Andreas", "ref": "https://www.ign.com/articles/2005/06/07/grand-theft-auto-san-andreas-2", "text": "The first time I played Grand Theft Auto III extensively, I was amazed by its creators' vision and style. GTA III delivered some of this generation's most influential game design and simultaneously reached previously unseen mass commercial success. The design was planned; but the success? Well, selling more than 7 million units within a year was way beyond anyone's imagination. Grand Theft Auto: Vice City saw a change in style, the excessive use of the color pink, and one of the best all-time soundtracks included in a videogame. Interestingly enough, it also added a voice to the lead character Tommy Vercetti, which had previously been a verboten subject in the videogame world. Oh, how far we have come.    Grand Theft Auto: San Andreas, the third in the trilogy, takes the series in two directions, exploring gameplay in both the macro and micro levels in ways no other development studio has done before. Weighing in at five times the square mileage of GTA:VC, Rockstar's PlayStation 2 port onto the Xbox is one of the biggest, if not the biggest game on the system, easily rivaling the size of any RPG or adventure game. Yet despite the inclusion of three vast cities and countryside to tie it all together, there is actually more to do on a smaller scale, at a micro level, than any other game on the system. In a sense, it's the ultimate Grand Theft Auto, and since it's also now on Xbox, it actually looks good, too. OK, OK, that's a cheap shot, but you will indeed see a visual enhancement over the PS2 original.   It's pointless for me to write an eight-page essay on the distinctive genius behind the Grand Theft Auto series, seeing as how Grand Theft Auto: San Andreas shipped last October on PlayStation 2 and has been out for exactly six months. So, I'll talk about the changes and the highlights of this version compared to its predecessor.    Plain and simple, this game is genius. It's been said by two dozen people, half of whom have actually played the game and know what they're talking about, and the other half are just saying it because everyone else is. This particular iteration, Grand Theft Auto: San Andreas, is by and large the grittiest, deepest, and unimaginably biggest action game you have ever played. And depending on how you measure it, GTA: San Andreas might just be the biggest game ever.    The extent of its depth isn't just impressive, it's astonishing. You play 10 hours, and you might peel away several layers. Play another 20 hours, and the game evolves into a vast adventure. Dig in for another 30 hours, and you're finally getting into the groove. Funnily enough, after 60 hours of play time, you've still only scratched the surface; seriously. After 60 hours of gameplay, there is still so much left to do and play, you'll wonder if there really is an ending. If you meet someone who's finished the game, and they can prove it with that 100% mark, they're either the most obsessive person you've ever met, a teenager with excessive amounts of time on their hands, or someone you should be really wary of.    Get the guide.  We do not sleep until every last detail is unearthed, every last mission is explained and every last secret is unfurled.      Check out the tunes.  Read the Grand Theft Auto: San Andreas Official Soundtrack box set review. 8 discs of classic rock, rap, country, reggae, and more.    So, I'll skip my normal 10,000 word diatribe. You've probably already heard it before, and PS2 EIC Jeremy Dunham did an extensive job conveying the game's high points in detail (you can read his review here), so I'll move on to the key factors.   GTA Xbox-ified  First and foremost, the Xbox version receives a few technical enhancements that might help graphic elitists substantiate their Xbox purchase. The game offers a slight visual improvement by delivering sharper, clearer textures, as well as progressive scan and 16:9 widescreen support. If you look hard enough, you'll see the character models are more distinctive looking and the texture work slightly more detailed.   For instance, you can read the graffiti and stop signs, and the funny, phony billboard placements. The improved lighting shows a more subtle contrast between dark and light objects and the world is less saturated. The strange orange haze, i.e. smog, is lightened up a bit, giving players a clearer, bluer sky. The draw distance is a little better, too.      It's my opinion, of course, but the difference between the PS2 version and the Xbox version isn't all that great. In fact, it seems the difference in clarity between Grand Theft Auto III and Grand Theft Auto: Vice City on PS2 and their Xbox versions is greater. Perhaps because of Grand Theft Auto: San Andreas's voluminous size, it simply doesn't allow for much visual improvement. Perhaps because there is so much on screen that the margin for technical improvement might be much smaller. Or perhaps it's because of the skill of the porting team itself. I don't pretend to know. Either way, the visual differences aren't that noticeable. You still see aliasing, shimmering, draw-in and pop-in. It's not nearly as bad as the PS2 version, but it's there. It's a little disappointing. But to put things in perspective, nobody really plays GTA for its graphics. They do it for the addictive gameplay.   Xbox owners receive the ability to rip their own soundtrack, which can be enormously rewarding. It's not like the game requires or even needs it. The massive eight-disc box set is a wide-ranging and potent statement on popular music in the 1990s, with of course some country twang thrown in for good measure. But the notion that you can cut your own sounds is enticing. Your custom soundtrack is identified as its own radio station, and an additional option enables music fans to drop in radio ads in between songs to localize the station. The colorful DJs aren't remain exclusive to their stations. I guess if you wanted to, you could record your own DJ comments on a disc with your own music, and then rip the disc to the game, but it wouldn't be the same.   Lastly, GTA: San Andreas utilizes a new 30-second instant replay feature, which is special to the Xbox version. This attribute enables gamers to replay radical stunt jumps, near-miss crashes, and particularly cool gunfights and bloody rampages for others to enjoy. Considering how many random things can happen in a game like this, replays definitely come in handy to prove stranger than life events.    The Goods  Rockstar North's GTA: San Andreas provides an enormous amount of things to do, mini-games to play, and lifestyle options that make this title more like an action-RPG than ever. These additions dwarf any improvements that Vice City made over III. So, for instance, the things that made GTA VC distinct over GTA III are far more now commonplace. You can own properties, take over gang territories, earn respect, and get girls.     On a size scale, the world is bigger, meaning there is much more geography to cover. But here it also means the amount of things to do is greater, largely thanks to the imagination of the Rockstar North team. You can fly airplanes and helicopters like before, and you're able to navigate boats, too. Mr. Johnson, a superior creature to Tommy Vercetti and the quiet, violent GTA III ~kid,~ can swim. Yes, indeed. You can finally drop into the water and paddle about, and if you dive down and search around, you'll find shuckable oysters that work similarly to Hidden Packages. If you're an explorer, you'll find you can sneak into the airport and steal a Cessna, which you can then fly to the unopened cities of San Fiero and Los Venturas.     You can drive all of the vehicles in the game, like before, only now there are also tractors and BMX bicycles. The bicycles are strangely addictive. It's just like Rockstar North to add in a feature and then provide an inordinate amount of things to do with it. On a bike, you can pedal, pedal fast, jump, bunny hop small and large, and there are all sorts of environmental objects waiting for you to use. There are bowls, ramps, hidden backyards, heck, you can pull wheelies, stoppies, and even earn cash for the distance you can go on one wheel. The list goes on and on.     The lifestyle aspects of GTA San Andreas are spectacular in their level of customization, large and small. From modding your car's interior to its exterior, to cutting your hair, getting a fro, and adding facial hair, to gaining and losing weight, the impacts of all these things not only look cool, they actually affect gameplay. When you're fat, people comment on your heftiness, plus you're less likely to get chicks or run very far. Your homies are less likely to follow you. It's an odd thing to allow a gamer to choose to get fat, but it's worth experimenting with, and it's impressive to see how obese he can get.   Gaining and losing weight is based on eating, another choice you have, and yet another facet that alters the game as you play. Lifting weights, running, boxing, and all of your physical actions -- if you do enough of them -- are measured. Once you've done enough of one thing, you'll automatically upgrade it, say bike riding, running, or stamina, for instance. Heck, you can upgrade your driving and bicycling skills by just driving and biking well. The game is so deep, so broad, and so capable of letting you do anything, it's hard to count it all.    One thing on everyone's mind is how the aiming and shooting elements work. Like the PS2 version, the shooting aspect has been upgraded in a few ways. First, the auto-lock feature enables you to pinpoint anybody, or you can free shoot. While free shooting, you can target anybody using a handy little reticule. While targeting, the auto-lock is less sticky, less annoying than before. When an enemy thug goes down, he goes down. Your reticule doesn't remain glued to him. The target device will pick the most immediate threat to you in a nearby crowd, and it quickly switches from character to character. Thanks to this improvement, going into a crowded room of enemy thugs is much more fun than before; it's far less of a crap shoot. You can walk, run, duck, shoot and duck, roll, and quickly kill a dude. You can instantly target an enemy, then switch, kill another, switch, and kill another. It's not the best system ever, but it works better than before.    The other thing I've noticed about GTA, in general, is how incredibly accessible and yet raw the controls are. Sure, it's not fair to compare a first-person shooter like Halo 2 to GTA: San Andreas, but Xbox gamers will notice the stark difference in the refinement of the one versus the raw, basic controls of the other. You could just as easily say that GTA enables players to do many more things, whereas Halo 2 does not. Another example of GTA's progress is how elements of Manhunt's stealth game add a different flavor to the life of crime.    Presentation  Lastly, after having played all of the GTA games and all of the wannabe GTA games, it's become very clear that Rockstar's GTA series is leaps and bounds ahead of any other imitator in nearly every way. Rockstar handles its games with so much more style, subtlety, and passion, all of which manifest in the game's characters and in its presentation, that it's tough to contend with. There are dozens of examples, but let me just name a few. When you finish a mission, the game just keeps on rolling. It doesn't stop and go to a cutscene. It's smooth, and it rolls on, providing you with that catchy riff that indicates you just earned respect, and you're still right there, immersed in your GTA world. That riff means a lot. You count on it, and you eventually get to a point where you want to hear it. It's the cool sound of progress. It seems like a simple thing, but True Crime's lack of composure in this area, in contrast, highlights GTA's super chill behavior.   Speaking of continuity, the load times are much shorter in the Xbox version. So going from outside to inside a building is literally done in the blink of an eye. Rockstar successfully keeps you glued to the game, immersing you in a ~sandbox~ of toys, cars, and an amazingly simple yet complex set of actions, from styling your hair to pumping iron to modding your car, so if you fail a mission, you don't swap it out for another game. Nah, you go beat up come poor hapless punk, or get in a gang fight, or steal someone's car, or go on a taxi ride, or a rampage, or steal a plane, or go swimming. Or go parachuting! Whatever the action, there is so much here to keep you involved, it's hard to ever leave.    Then there's the story. It's well known that the guys from Rockstar love their movies. The characters in GTA: San Andreas have, you know, character. They're believable, they have shades of gray. They're subtle. The script writing in GTA: VC and GTA San Andreas is high caliber. It's funny, appropriate to the story, and mixes mature subjects with relatively real-life actions. That the writing team can go with such ease from the scripts of GTA: VC to GTA: San Andreas and do both well, shows versatility and clear, deep knowledge of a diversity of subjects. This stands in stark contrast to the multitude of badly written games filled with totally forced, annoying dialog we've been hearing from so many other ~big production~ games.   Many of the characters in this game are voiced by major voice talent, but you won't hear about it from Rockstar. Thank God. Smartly, the publisher doesn't make a big deal of the fact that Samuel L. Jackson and Chris Penn voiced the roles of officers Tenpenney and Polaski, that James Woods played as Mike Toreno, and Charlie Murphy acts as Jizzy, but these actors' contributions make a huge difference in the game's story and in the characters' delivery.  By now, most folks know if they like Grand Theft Auto: San Andreas or not. Returning from a slew of first-person shooters and high-intensity action Xbox games, I had to re-acclimate myself to the world of GTA; its physics, controls, and feel. I swore a lot, died in some stupid situations, but I finally got a bead on the game. It's not for everyone, but it's for most people. Millions of gamers have proven that for five years. It's a game I love to lose myself in, even if at first the immensity of the world was a little overwhelming. Now, Xbox gamers have the chance to own a superior version of Grand Theft Auto: San Andreas. The graphic differences are less obvious than the Xbox GTA Bundle is over the PS2 versions of those games, but the game itself is the same, the content is exactly the same. And in the GTA series, this one easily overshadows all the others in terms of the fun things you can do, places you can go, and the story you'll be told. Going a little broader than that, Grand Theft Auto: San Andreas is easily the best game in its genre - whatever that might be. Driver 3, True Crime, and even the excellent Mercenaries -- they all might do one, maybe two, little things better than GTA, but on the whole, the experience is continents apart. No competitor comes close in content, story, or style to Grand Theft Auto: San Andreas.", "date": "Jun 7, 2005"}