{"name": "GTA San Andreas", "name_review": "Grand Theft Auto: San Andreas", "ref": "https://www.ign.com/articles/2005/06/08/grand-theft-auto-san-andreas", "text": "It's not often that we do three unique reviews for one game across multiple platforms. But given the length of time between the original PS2 release and the subsequent Xbox and PC releases, we felt it important to give it a second look. On top of that, PC gamers may have some expectations that may be a little different than console gamers so we decided to differentiate those as well. What we found after playing the game for so long is that it's still an excellent game on the PC. It looks better than the other two versions and has better combat controls while suffering only slightly in the driving department with the mouse and keyboard. It's an expansive, awesome, well produced and put together game with a ton of different missions of all sorts. While it has its problems, Grand Theft Auto: San Andreas is a very entertaining game with hours and hours of fun for those who both want to rip right through the story or explore the gigantic environment.   While the GTA series was birthed on the PC, the PS2 provided the second coming of the series. Since Grand Theft Auto III was released and broke all kinds of sales records and ushered in a new way of thinking about open ended game environments, the GTA series has gone back in time, first to the 80's with Vice City, and now to the early 90's with this latest installment, San Andreas. I'd say this is the best of the three because of a couple of things. First, it has a much better rounded story and second, for those that want to explore, there's a ton of room to do it and things to find. But while players of the originals will find that this indeed sets the bar again in terms of size of environment and exploration opportunity, it stays pretty close to home in the rest of the experience.   San Andreas follows the story of Carl Johnson, recently arrived back in the fictional city of Los Santos, just the first of three major metropolitan areas in the game, to help bury his mom. Upon arriving home, he's immediately picked up by officer Tenpenny, a hard-nosed cop that immediately sets Carl up in order to cement his ~loyalty~ and attention. Soon after, Carl's back in the thug life accompanied by a hugely varied cast of characters.    These characters and personalities that make up the story of San Andreas are a huge part of why this game is so damn good from a strictly story-based point of view. Not only is the cast believable and fun in the way they're written into the plot, but they're also absolutely excellently voiced. The entire cast, minus a couple, is brilliant. Rockstar managed to find the perfect people to voice each of the characters and make them human. Samuel Jackson plays the a smarmy corrupt cop, Chris Bellard (aka Young Maylay) does a perfect turn as the main character CJ, and even Peter Fonda steps in perfectly for one of the supporting roles of The Truth. What's ear catching about all of these roles is that it sounds like these people were all really having some fun voicing them and took the job seriously, something that kicks ass in itself given all of the craptastic voice work that we hear in so many other games.     Not only are each of these characters voiced well, but they're given life with animation sets so good that it makes visuals that are otherwise average, good. Only the low poly models and unimpressive textures get in the way of convincing the realness of these people. All of the characters that play a role (main or supporting) are given their own animation set to complete the full bodied approach to creating a believable set of individuals.   As I said though, the same can't be said for all the visuals in the game, especially considering the way PC graphics have progressed over the years. Textures aren't very good, models tend to be a bit blocky (think blockhands), lighting isn't real time, and none of those tag words everyone loves so well like Normal Mapping are included in the equation. Of course, a large part of this is probably due to graphics being specifically designed for the much less powerful PS2. Perhaps in the future, as Rockstar develops for the PS3 and Xbox 360, we'll finally see a truly spectacular GTA. Right now, we're left with something that on the surface looks like a game that's a couple years old.    Still, San Andreas has a sense of style to it and the world is most certainly full of the everyday stuff that you'd expect to see in a city including a ton of funny billboards, posters, and more. There's a huge amount of varied art in the game for each of the particular areas of the entire San Andreas map as well, adding to the feeling of really being somewhere else and making it look much better in motion than it does in screens.   All it really needs is a technical upgrade. If that Unreal Engine 3.0 tech really works for creating huge seamless levels, I would imagine that Rockstar will have to look into a ridiculously detailed future... in which case they better start hiring some more artists. On the extreme plus side of having graphics not as intense are the incredibly quick load times. I've never waited more than a fraction of a second for the game world to load up when moving in or out of a building. This is a definite improvement over the PS2 version. Now if they'd just get rid of the coming out of the closet routine for trying on new clothes, all the aggravation of waiting for loads would be gone.   But the thing to understand is that the world of San Andreas truly is huge. While it's not totally unusual to see environments this expansive on the PC thanks to the free flowing MMO market and some select RPGs, none really create such a huge explorable area along with the gigantic and believably designed metropolitan areas that have distinct looks and feels. This in particular makes the game spectacular for those players that love to get out and explore their gaming worlds. There are a ton of secrets to find in the cities and countryside areas for those that wish it. Those that don't wish to explore as much might actually find those countryside areas tedious thanks to the circuitous routes the roads take along with the switchbacks and so on. It does get a bit tiring to have to travel out in the countryside from the second city of San Fiero several different times. But thankfully, long driving trips to failed missions can be skipped as long as the trip has been made once before.   That annoyance will probably just stem from sheer impatience about getting to a mission that will in all likelihood be really fun. There are a couple of stinkers in there (I'd recommend avoiding the Zero missions aside from the necessary ones) but for the most part, the variety of mission types is once again astounding. Most fall into one category or another, a lot of which we've seen in previous GTA games, but they're designed very well for the environment they're set in. Everything from races, escort, seek and destroy, demolition, crime spree, escape, flying, driving, running, await those that play the game. Then there are the more creative ones that require players to do an array of other things.     What's a little disappointing is that I've found all of the missions not involving straight up combat much more entertaining than those that are all about shooting. Combat is an important part of the game, even if it is just a part of a much larger whole. What usually makes combat especially fun is either the design of a linear mission or the challenge of smart artificial intelligence. Unfortunately, the enemy AI during combat in San Andreas is anything but smart. PC gamers are used to enemies like we've seen in Far Cry, Half-Life 2, or one of the other recent actioners are going to notice a huge difference in the level of intelligence of the enemies. They don't really run for cover, try to flank, or even shoot as they strafe. The only thing that makes combat difficult at all is negotiating the complex environments around city areas. My only deaths during combat occurred after getting stuck in a bad place because I wasn't paying attention to the environment. Otherwise all you have to do is get a little separation from the enemy and pick them off as they run at you in a line from the distance. Even those missions that corner you or surround you with enemies end up being fairly easy to contend with.    Taking part in gang wars where you fight over areas of Los Santos is a good example of this basic thinking. I really, really wish you could order your gang members around like Freedom Fighters or could send groups off on missions to take other areas while you went and did your own thing. More interesting situations than simply fighting enemies that spawn into the area in waves would have been good as well. As it is, the fighting for control over the city is pretty repetitive and an extremely simple action.   One of the main reasons for the ease of combat is the PC control scheme. Obviously, coming to the PC, the big addition is the mouse and keyboard, which allows for much quicker and more precise aiming than the console controllers are capable of. It's awesome to have the kind of control, but it also makes combat insanely easy. All you need do is crouch, bring up aim and pop all of your enemy's heads off one at a time. I've never pulled off so many headshots in any game. It's certainly satisfying to pop some heads, but this never gives the ~fighting for your life~ type of feel that so many action games do and I miss it.   Surprisingly enough, driving with the keyboard is actually really enjoyable. I'm not sure if the sensitivity has been turned down from Vice City or not, but I've had a really easy time driving around. It's still not as perfect as the analog stick on a controller, but it's plenty good enough thanks to the perfectly arcadey nature of the game. Driving and racing is a total blast, as usual. There are a lot of missions revolving around the art of the chase and those are simply awesome. You can crash into everything, run over people, antagonize the police, lead chases, and then walk away like you don't give a flying crap after you've had enough for the time being. There's no game out there that offers this kind of driving experience. Simply stealing cars and testing them out is brilliant as well.    Grand Theft Auto: San Andreas has a lot of things going for it that make it an excellent gaming experience. The excellent narrative and voice acting make it a story to remember, driving is still a lot of fun, and the selection of missions to perform make it easy to look forward to what's next.But is it a huge improvement over Vice City? Graphically it looks a little better, but not by much. There's certainly less pop-in, and it runs well. The missions are just as creative in some cases but borrow a lot from previous games. The story and narrative, as mentioned, are much more focused and well written. But the AI hasn't been improved, meaning that combat mechanics haven't really improved, which seems like one of the things that always should have been on the list. There are some great new ideas here, like gang wars for territory, but they aren't as perfectly thought out as they could have been.GTA: San Andreas is easy to recommend for a thousand reasons. There's just so much to do and have fun with, but even so there's still room for the guys at Rockstar to improve, and that's a pretty exciting possibility.", "date": "Jun 8, 2005"}