{"name": "Digimon World 4", "name_review": "Digimon World 4", "ref": "https://www.ign.com/articles/2005/06/10/digimon-world-4", "text": "A bulk of the Digimon coverage published today usually focuses on Digimon's overwhelming likeness to Pokemon. And for good reason. The two properties share a number of aspects, not the least of which is the 'mon' at the end of the title.    Beyond this, there's the intrinsic nurturing of cute, yet violent creatures and the resulting bond between human owner and Pokemon or Digimon, whichever the case may be. More importantly, both properties have mass appeal in today's marketplace, with each claiming trading cards, television shows, videogames, movies and more.    Unlike games in the Pokemon franchise, however, many of the Digimon titles have branched into different types of gameplay. Take the latest entry in the series, Digimon World 4, which plays very much like Final Fantasy: Crystal Chronicles. It's a hybrid action role-playing game, in other words.    That's a sizeable departure from earlier Digimon titles which appeared on the original Playstation, PS2 and Game Boy Advance. This is especially true of the Digimon Battle Spirit titles, which played like the Super Smash Bros. series from Nintendo.    That's not even mentioning Digimon Racing, but you get the point. And even though the above paragraph mentioned Crystal Chronicles, don't go making the mistake that World 4 matches its scope, quality and design. To be fair, Crystal Chronicles had its share of problems, but World 4 doesn't come close in terms of narrative, style and game mechanics. Anywhere it matters, World 4 is clearly Crystal Chronicle's subordinate. Which is a shame, really, because World 4 had the makings of a decent, maybe even above-average game. Before getting into that however, you may want to read previous coverage of World 4 for a rundown of story basics and initial impressions.    To start, it's painfully obvious World 4 has multiplayer co-op in mind. Which is fine in, but those lacking social skills will find themselves largely out of luck due to the game's unbalanced single-player mode. The first few hours of the game see you battle a number of enemies, all of which seem advantageously brawny. They're not particularly smart, quite stupid actually, but they'll mess you up real quick. You'll deal somewhere between 10 to 14 points of damage, depending on weapon selection, with enemies inflicting 16 to 35 points of damage. You also get hit 7 to 10 points of damage for touching enemies.       To top it off, these enemies are numerous and wildly affectionate - you'll find they can't get enough of you. They smother you at every turn. Generally, Digimon begin with 150 points of health, so you can imagine how fast it drains. Add to this a low occurrence of health power ups and a lack of automatic saves and a (free) checkpoint system, and you've got a genuine recipe for disaster. Things do get better once your Digimon evolves and gains experience, but those precious hours at the beginning of the game (in single-player) just plain suck.    At the core of World 4 lays a number of dungeons in desperate need of exploration. Each dungeon boasts a number of enemies, obstacles, traps and bosses. Each dungeon also claims number of locked doors which you need one or more ID passes to open. These passes are guarded in sub-dungeons by a vast array of enemies and a snarling, ill-tempered boss. You'll spend a bulk of the game navigating these dungeons, clearing them of enemies and finding the aforementioned ID passes. A task that offers decent fun but ends up feeling lame overall due to a slew of annoyances.    At the top of this list are re-spawning enemies and the lack of a balanced single-player option. These two gripes are obviously tied together, since a part of the balancing problem comes directly from re-spawning enemies. Then there's the total lack of manual camera control, long load times and the lack of an in-game map during a substantial portion of the game. Enemies themselves look uninspired and annoy with overly cheap tactics. Plus, they're none to bright. They simply launch projectiles at you or try to crowd you to death. Sometimes, you'll even be caught (literally) bouncing between two enemies like a pinball; a very lethal problem that happened not often, but more that it should have.    On the upside, World 4 offers decent fun when playing with friends. You can explore dungeons with up to four other players, and like most multiplayer games, World 4 gets better the more people that join. There's also a good amount of customization options, such as various incarnations of each of the four playable Digimon. There's also a good amount of weapons and armor to collect, not to mention rare items and stat-building collectibles. There are even Digimon trading cards. All of which is of course included in the single-player portion of the game. But again, it's just nowhere near as satisfying.   Digimon World 4 had the makings of a decent action role-playing game. Unfortunately, a myriad of issues bring it down. It has a wholly unsatisfying single-player game, made worse by a clunky camera and overly cheap enemies. It's also unbalanced, leaving players without any compatriots out in the cold. Bring in a few friends and things change drastically. In the end, World 4 conjures a decent dungeon crawl experience, if only because you get to play with friends. At the very least, you have someone with whom to vent frustrations. Do yourself a favor and rent this one before spending your bucks.", "date": "Jun 10, 2005"}