{"name": "Fishtank Frenzy", "name_review": "Fishtank Frenzy", "ref": "https://www.ign.com/articles/2005/06/11/fishtank-frenzy", "text": "Fishtanks are increasingly popular inspirado for mobile game developers -- recently we've seen a small spate of aquarium-themed games and apps. IN-FUSIO's Fishtank Frenzy is definitely a little more involved than your basic fishtank screensaver, but not too much so, making it a good little download for casual gamers that a pick-up-and-play experience.   Fishtank Frenzy puts your in charge of a small aquarium with a catch. These fish pay off in silver dollars. But your flounders won't cough up their coins without a little incentive. You must constantly feed the fish to make them poop money -- but food costs money, so you can see where the cycle is formed. You have to feed them smartly to collect bigger rewards.   Using the 1-3 keys, you drop food into the tank. Make sure you drop it near the fish, because if the food falls to the bottom of the screen un-eaten it goes to waste, costing you cash. When you fish unload their bounty, you use 4-6 to grab it, depending on which column of the screen it is in. To ward off attackers, use 7-9 as ~shoo~ buttons.   Your paydays allow you to buy more goodies for your tank. Many levels have objectives that involve purchasing a little knickknack or special fish for the tank. But you can also adorn the joint with oxygen bubbles, clams, and treasure chests -- the staples of every dentist office's tank. You can also snag some pets, like turtles, to really bring the aquarium to life.   Fishtank Frenzy is a clean little game with nicely detailed fish sprites. There is little animation to speak of, just a lot of 2D fish bopping around, trying to get fed. The audio is also a little lacking, with just small notes heard when you grab some pocket change.  Fishtank Frenzy is a simplistic game that may have to tapping buttons all over the numberpad, but you're never really ~sucked in.~ Much like a real fishtank, Fishtank Frenzy keeps you on the outside looking in. I actually found myself enjoying collecting fish and decor for my non-game aquarium rather than playing the money-grabbing main game.", "date": "Jun 11, 2005"}