{"name": "War of the Worlds", "name_review": "War of the Worlds", "ref": "https://www.ign.com/articles/2005/06/15/war-of-the-worlds-2", "text": "The cavalcade of mobile games based on summer movies just keeps rolling across game decks -- the latest car on this crazy train is Gameloft's War of the Worlds. It is based on the upcoming movie directed by Steven Spielberg and starring Mr. Katie Holmes, but the game doesn't necessarily feature the film's hero. Rather, War of the Worlds smartly turns the tables and places the player in the role of the alien menace that seeks to destroy humanity.   At first sight of this role-reversal, I couldn't help but feel relief. It's getting hard to play side-scrolling actioners that just swap out main characters depending on the licensed property. Granted, War of the Worlds doesn't reach much farther beyond being a shooter, but at least it tries to be mildly different.   You pilot an alien ~tripod,~ one of the ships that is used to tear the planet apart. The lumbering titan walks very deliberately across thirteen levels, dispensing liberal amounts of havoc and carnage. Using a laser cannon mounted to the tripod's head, you can shoot down earth defenses like stealth fighters or clear ground targets like buildings and tanks. War of the Worlds is not without a morbid sense of humor. Right away, you lay waste to school buses -- yellow school buses. These aliens are indiscriminate killers, apparently.   The tripod has more than a laser cannon. You can use special attacks, like reaching out with a tripod arm to squeeze earth forces or unload a screen-clearing lightning blast. During the first several levels, your tripod is just too overpowered. Blasting ~enemies~ with your lasers and extra gear is almost too easy. But as you keep decimating mankind's defenses, the puny earthlings start mounting better counter-attacks. More resistance appears on-screen. The action does get a little repetitive as you go -- after all, there is only so much you can do with this formula. But shooter fans will still get a good change out of the experience.   Although we all know the inevitable conclusion (after all, save for ~Collateral,~ when has Tom Cruise died as the hero?), it's hard not to root for the tripod. After all, it has a pretty slick design, what with those spindly arms that offer an almost graceful balance to the beast's destructive nature.   War of the Worlds is a good-looking game. On test drives on both the Motorola Gameloft had at E3 and the bare-bones Sanyo 8200 used at the office, the game presented a great amount of detail. The tripod is well-animated and the backgrounds (which span five cities) are nicely drawn. Between levels a news broadcast advances the plot, complete with an anchorwoman. The game has both an appropriately dreadful opening dirge and some crunchy in-game explosions.  War of the Worlds is a solid shooter that mercifully takes a different route than most summer movie games. Attacking earthlings as the towering tripod is fun -- even if the levels do get a little repetitive. Alright, I can put up images of the game without a blurry tripod. Check 'em out, they look exactly like they do in the movie, which is to say, pretty damn scary. War of the Worlds is not Gameloft's best, but it is quite good.", "date": "Jun 15, 2005"}