{"name": "Banjo-Kazooie: Grunty's Revenge", "name_review": "Banjo-Kazooie: Missions", "ref": "https://www.ign.com/articles/2005/06/15/banjo-kazooie-missions", "text": "When you spy Banjo-Kazooie on your game deck, don't immediately hit the download button. Know what your getting into before you plunk down a few bucks. This isn't to say your money is about to be wasted -- that's definitely not the case for the right audience -- but you need to know you are not buying a platforming adventure game. Banjo-Kazooie: Missions is a collection of mini-games that are better suited for younger players. They are simple to pick up and easy to play. While an adult gamer could blow through the game in twenty or less minutes (as we did), a younger gamer quite interested in your game-playing cellphone will enjoy what IN-FUSIO is offering.   Banjo's best buddy Kazooie has been kidnapped by the previously vanquished Gruntilda. The mecha-witch is back to terrorize our bumbling bear by spiriting his feathered friend away. The only way to free Kazooie is to collect eight Jiggies -- little puzzle pieces. Once the Jiggies have been assembled, you play a little tile puzzle to find out just why the caged bird sings.   Banjo-Kazooie: Missions offer three difficulty levels, but the games themselves remain the same. Some of the mini-games force to Banjo to slide down ramps, collecting items to earn a Jiggy. Another has him fishing, grabbing big catches while avoiding ugly green crabs. The third game-type puts Banjo behind cannon and has him blasting a far-away target, such as a ghostly pirate, with eggs.   These games repeat with different window dressings. As mentioned, older gamers will get bored. But the game just isn't for them. The mini-games get a little harder with each iteration, such as introducing slicks and spikes on the sliding levels. The final battle with Gruntilda has you firing eggs at five different body parts (hands, hat, heart, etc.). It's easy-breezy fare.   The game looked reasonable on a Sanyo 8200. Banjo's sprite is pretty small, but the chap is definitely recognizable. Banjo-Kazooie: Missions maintains much of the look of the Rare franchise, from the bouncing Jiggies to the appearance of googly-eyed animal pals. The game is accompanied by a boppy jingle that loops. You may wish to turn the sound off if your little one is playing while you're driving -- you may want to run into a tree just to make it stop.  Banjo-Kazooie: Missions is what it is. I recognized immediately that the game was not necessarily made for me, but I imagined a younger player such as nephew enjoying it. He's always interested in my cellphone and this would be a good, easy game to hand off some time. Now, whether or not IN-FUSIO intended the game for this audience, I dunno. But I think this is a good value for mobile gamers looking for family fare.", "date": "Jun 15, 2005"}