{"name": "Batman Begins", "name_review": "Batman Begins", "ref": "https://www.ign.com/articles/2005/06/16/batman-begins-4", "text": "And now for something completely different.   IGN's two greatest and most outspoken editorial miscreants, Ed Lewis and Ivan Sulic, both completed Electronic Arts' Batman Begins. Because of their unending love for you, the loyal reader, they have opted to forsake our traditionally one-sided formulaic reviews in favor of a rather fantastic collaboration. The fantastic part is just below.   This is not it.  Down a little further you'll find a lengthy conversational rating that details the many pluses and minuses of EA's latest heroic effort, and from two distinctly different viewpoints even! Enjoy.     Ivan: Hatred, anger, violence. I feel them all, Ed. You think I actually am Batman?  Ed: Har! ~You have always been weak. Now I must run.~  Ivan: Totally! Well, I say totally assuming you're alluding to the last boss fight with *spoiler edit* on the *spoiler edit?* If so... That didn't make a whole lot of sense, did it? Then again, nothing in Batman Begins really made perfect sense to me. I just couldn't dig how precisely zero of what happened during the game was strung together with any logical grace.   I felt that during the course of Batman Begins I was being funneled through a painfully linear quest and repeatedly beaten over the head with blatantly obvious context sensitive interactions that always made me wonder, ~Why the hell aren't I just doing this other potentially more interesting thing instead of exploding more boxes?~  Ed: Yep. It's dumbed down for the gaming audience because many of those folks just want something they can blast through that's like the movie (as like to it as it can be). At the same time, Batman did do a good job capturing the feel of the film and it also combined different types of action.   Now Press Your Button Ivan: But I don't think dumbing down a game has to go hand-in-hand with making the actual play so simplistic it becomes incoherent and substantially less enjoyable than other more approachable titles.   Look, there's the combat: Press the kill now button when I well tell you to and not before. Then there's the Batmobile racing: Snowplow through dozens of nondescript cars for no reason other than that they're there and your tank is capable of it. And then there's also the level progression: Walk forward until you see an icon you can play off or a ladder you can climb. Presto chango, win the level.  All that detracts from the sensation of being this particular superhero. I didn't feel like I was ever playing. I felt like I was reciting what someone else had already played -- like I was moving down a to-do list of chores.   Batman Begins Guide    Uncover Batman's dark secrets. Walkthrough and more. Get the guide now! Ed: That's not great, but it's still much better than most licensed games.  Ivan: True, but I don't believe being better than random Wolverine game #312 or an even more random Star Wars game is any kind of positive attribute. I suppose I wouldn't have been so miffed if EA had done a better job of tying together the rich movie fiction. At least then I'd be able to enjoy a solid storyline while lamely walking forward and occasionally using the Batarang whenever I was told it was okay to use the Batarang.   Don't touch that lever, Ed! Wait... Okay, now you can touch the lever.  Ed: Good points, all of 'em, and they're exactly the reasons I hate to see treasured characters come to consoles on the backs of movies. More money gets put into the license and since it's tied to a film it pretty much has to follow that specific storyline.  It's a problem with licensed games in general.   At the same time, there are so many games that have the same problems going on with them. I find these sorts of limited, linear designs to be an issue with all console games. This one had more of that simplistic feeling, sure, but when playing Ratchet & Clank I had the same feeling. I mean, just look at something like Killzone.    Ivan: There is definitely an apparent level of linearity in today's games (most of 'em, anyway) -- you always have to go this way and do this thing. But, Batman takes that limited philosophy to the absolute extreme. Not only is there only one way to approach every single situation in the game, the icon driven interface will even tell you exactly which interaction you need to play off at exactly which point. It's so ridiculously simple that I suspect an advanced LEGO Mindstorm robot could do the same things I did while playing.  Ed: Yeah, I really can't make any excuses for the game's highly scripted nature. That sucks. But in terms of doing a decent adventure with a fair amount of flaws, it works.  Ivan: Mmmm... I'll give you this: Batman Begins, like most modern EA titles, is very well produced. It features a good amount of extras (Batsuits, Batmobile racing mini-challenges, model galleries, cast and crew interviews, etcetera), and it's certainly an attractive title. That said, when I weigh the gameplay against the presentation, I still feel as if the A to B design seriously detracts from the overall package. By being so primitive and obvious, Batman Begins has somehow managed to diminish the awesome Dark Knight mystique that would have helped make the adventure great.   There're also a bunch of wacky little things I just can't deal with at all. Like our boy Bats the monkey-man climbing ladders in glorious chimp fashion. And then there's his silky cape, straight out of Victoria's Secret. Did anyone even pay attention to the little details like that? WTF, homeboy?  Alright, I'm nitpicking. Anyway, how'd you like the combat and stealth?  Ed: It's really the combat that bugged me. Here we have a combat system where it's super easy to just tap the attack button periodically and then tap another button to finish the job. When blocking, it's even easier. Just keep tapping the attack button while holding block and you're pretty much impervious and will even dish out vicious counterattacks.   The lock-on is also automatic and, worst of all, the only time you can use a flash grenade or a smoke grenade is when an obscure icon starts flashing in the top-right corner of the screen. It's here where the game's restrictions bugged me most. Go ahead and make the paths easy to find out, but when I'm fighting I want to be able to kick ass with more control.  The Bat Snowplow Ivan: I totally agree on the combat. EA and Eurocom appear to have made a mistake similar to the one LucasArts did with its own licensed Revenge of the Sith title. I can see the pretty results of my actions and all those fancy animations that look so cool and powerful, but the actual gameplay that delivers it all is just boring. Press this button and watch long thing play out. How is that neat?  What about the stealth?  Ed: The stealth aspect of the game, like most of the other parts, is decent enough and is also really quite simple. It could've been fleshed out more, but to be honest I didn't want it to be any more than what it was. If I had to worry about the stealth too much, the game would've lost some momentum. Again, that component would have been better if we had a full-on game not based around some preexisting story.   And then there's the camera which was pretty much ignored. It's clumsy during regular movement and whenever Bats enters a new location it usually ends up in the worst possible spot.  Ivan: I like it how the camera is backward by default, too. When you ~peek~ it's especially amusing.   About sneaking... True, while there could have been more stealth aspects, it would have definitely slowed the game down. So what was made available needn't really be more complex. What would have been nice, however, was if the armed AI wasn't so damned lethal. It seemed like every time I inadvertently failed to approach a combat situation in the ~right~ way I immediately triggered my own death simply because those gun toting sons of bitches were way overpowered and I was helpless to defend myself. This led to some pretty tedious trial and error scenarios I could have lived without.     Ed: While it's certainly a bummer that the bullets are so lethal I don't think that's a problem at all. Bullets are deadly and Batman's main weapon is fear. Running right at a group of uzi-toting fools head-on just isn't his style.  Ivan: Okay, but then I actually found the whole fear system to be pretty unsatisfying, too. I liked the way Batman would eventually be perceived by his foes as a demon if you successfully built up the fear meter and then finished someone, but the interrogations and ridiculously simple environment interactions that led to the final freaky cutscenes were just absurd.   Knock over crates to scare people? These thugs are spooked by that? Are you kidding me? I'm in a rubber suit for crying out loud. I need to up the ante past pipes and car alarms.   And when I did eventually force some terrified fool into submission, what then? Well, I could grab them and blindly press X until they spewed out a conversation. EA and Eurocom could have at least incorporated some rudimentary Punisher-like interactions to handle interrogations. But then I suppose if there were mini-games involved they'd be just as terrible as the timed lock picking and hack-o-matic wastes.  I guess I am being a bit harsh on Batman. To its credit, the game looks fantastic, features great sound (with some kicking dynamic music) and has functioning, if limited gameplay. But then is ~it's not actually broken~ any kind of an endorsement?  Ed: It's not broken at all, man. It's just under-conceived in the planning stages. If the dev team had been given more time I'm sure they could've turned some of the more promising ideas into genuinely exciting gameplay.    The whole fear system could've been much cooler. I like the idea that Batman had to scare people and dropping crates, pipes, piles of Peeps and whatever else would do this. The problem is that's it. There's no stalking to frighten people until they do something stupid, nor is there any challenge to get the timing right. It's just too straightforward.  Great Faces Ivan: The fear system is so weakly implemented, the stealth elements are so heavily swayed by trial and error and the game's progression is so tediously scripted, I never became the Dark Knight. Even though I'm supposed to be the Caped Crusader, I am apparently too feeble to take on gunmen, too lame to really scare anybody by doing anything that doesn't involve dropping some form of box, and too dumb to be the world's greatest detective. Not so good.But, considering that this title is such an otherwise well presented game, I'm inclined to be less dismissive than I would be with a similar effort that also happened to feature bugs and sloppy voice and some poor visuals (or whatever the nuts).Ed: As a whole, the game was a little short (six hours), but it's still a pretty fun ride despite the fact that it is not the definitive Batman game we've been waiting for. This game ain't the greatest in terms of freedom and linearity, but I'll still take it over Spider-Man 2. No doubt.Ivan: Oh man. Spidey. Buddy. Pal. Screw those mentally deficient girls who keep losing their frickin' balloons and that one dude with the perpetually broken leg. To hell with 'em, man.", "date": "Jun 16, 2005"}