{"name": "Q*bert", "name_review": "Q*Bert", "ref": "https://www.ign.com/articles/2000/01/04/qbert-5", "text": "There's definitely something very endearing about the classic cartoon cursing and simplistic puzzle action of Q*Bert. When the game originally appeared as a coin-op in 1982, gamers were treated to some of the first 3D elements seen in a platformer-esque title. It was definitely simple, addictive fun -- But one of the problems constantly present was that every level was based on the same pyramid, making it get repetitive after a while.  Seventeen years and several ages of gaming later, the concept has finally been fully rehashed (there was a sequel, Q*Bert's Qubes, but it wasn't memorable) with updated graphics and some new ideas. As with most games, there are very distinct good and bad aspects involved. Being based on such a solid foundation, it's definitely charming and fun -- But, on the same token, the rehash introduces too much and not enough at the same time.   Gameplay For the three of you who have never played Q*Bert, the game is based on a simple, yet effective puzzler premise (in fact, some say it's the grand daddy of the addictive puzzle game). You play as a weird little orange guy who hops around a landscape of adjacent 3D cubes, trying to change the color of each one. Hopping on a cube changes its color, and the raw, basic idea was to step on each cube. A number of baddies and bouncy balls also hop around on the cubes in effort to make your time more difficult -- If you touch a baddy or fall off the cubes, you die.   In the original Q*Bert, every level in the game was based on the same foundation of cubes, in the shape of a pyramid. The most major new gameplay element in this Q*Bert update is that the level designers went nuts, with tons of levels all shaped completely different. Gone is the repetition of the original singular level design, but, at the same time, some of the huge, sporadically designed levels can get confusing. With some cubes being higher than others, it can get very difficult to determine which cubes are connected to which. This is what I like to call an ~artificial challenge.~   Aside from the obvious level design updates, most of the game remains very true to the original. In addition to old school Q*Bert play elements is an array of power ups that affect various aspects of play. Shields, keys, bombs, and a few other item pickups definitely come off as an obvious step forward in the Q*Bert evolution, but in all reality do little to supplement the play. If you're driven to press on, it will be because of the same old gameplay foundation rather than these new additions.   A second obvious game rehash element is the addition of a multiplayer mode. Two Q*Berts are placed on the game board, each having the objective of coloring every block on the screen. The thing is that that each player is continually undermining the other player's progress, resulting in a fun experience at first, but one that becomes stale before too long. It feels like Tic Tac Toe, in that there's not much to it, and very little real progress is made against one other. The two-player mode is a good addition, but won't see much play time. It's more of a gimmick.   Finally, the original Q*Bert is included in the game. Players can choose to play it with the original 1982 graphics or with an updated 3D look. This mode, even though it's an exact replica of the famous original, probably won't see much play time.   Graphics While it's a very distinct update of the original's look, (the new graphics seem simple, but contrast it to the original 1982 mode and you'll see a large difference) Q*Bert is anything but impressive. Then again, the game isn't as much about visual prowess as it is addictive gameplay.  The game is based on simple polygonal characters and landscapes. They're cute, colorful, and of good quality, but they could have done more. Rather than simple real time polygons, I would have rather seen some imaginatively drawn sprites. As is, little is done to bring the characters to life -- With some good artists and some cartoony antics, the game could have been much more interesting to look at. A Q*Bert reminiscent of our 16-bit pal Earthworm Jim would have been terrific.  Sound The sound in Q*Bert isn't memorable. The gameplay is supplemented by some really basic, bouncy tunes, and Q*Bert himself likes to make a cute robotic sounding flourish when he dies. Nothing special, but, once again, as a puzzle game, it isn't required to use flashy graphics or a gaudy sound scheme to set an atmosphere.Overall, Q*Bert is quite average. While it's based on a fun premise, it does nothing to innovate the series or bring it to a new level. The larger levels often serve more to confuse and frustrate than to enhance the gameplay -- Considering the fact that nothing else major has been added or changed, it's really a transparent experience. You may get some fun out of it, but it's not a must-have. If you like Q*Bert or puzzlers, try it out, but it's not for everyone. On the other hand, if you have been idlying by, pining for 18 years for more Q*Bert, well, you are about to experience nirvana. Sheer, old school repetitive gaming nirvana.", "date": "Jan 4, 2000"}