{"name": "Midnight Club 3", "name_review": "Midnight Club 3: Dub Edition", "ref": "https://www.ign.com/articles/2005/06/28/midnight-club-3-dub-edition", "text": "How powerful is the PlayStation Portable? If you've been following the hype and stats on Sony's debut entry into the handheld market, you've heard every story about this system, and you've also seen first-hand what that talk has come out to. You've heard stories that the system is as powerful as a PS2 -- in some ways even more powerful. You've read gripes that this or that is underpowered, and that we're already seeing the highest heights that the system will hit with the launch games because bottlenecks clip its wings. You've seen big-name games cut down to fit the system, and other big-name games ported almost pixel-for-pixel to the handheld.   Why am I talking tech here in this review before saying one word specifically about Midnight Club 3, the highly-anticipated PSP version of Rockstar's renown racing series? Because more than any game on the system so far, this game pushes and pulls at the system, bending it over and twisting it around to try to perfectly recreate the deep-as-a-thong-string gameplay of the console blazer by Rockstar San Diego (formerly Angel Studios). There may be a handful of other games we've seen in previews that are more technologically advanced game on PSP (though this certainly has plenty of aspects to boast about.) And as far as using the PSP to its max, this is not the ultimate example of how much power this system offers game makers (if anything, I'm sure Rockstar will be back to kick this game's ass.) But as far as ambition and total package, it's only got maybe one or two other handheld games in its league.  Midnight Club 3: Dub Edition is a game shoehorned into the PSP, ten gallons of game crammed into a five gallon bucket. And surprisingly, it almost all fits ... honestly, it should have all fit. If it weren't for some first-gen technical issues and a few really disappointing missed opportunities to tailor this into a PSP game, it would have been right up their with THUG 2 Remix in terms of offering the most bang for the buck you can get on a portable.  On the other hand, if you had asked me at any time on the first day that I played this game what I thought of it, I would have told you that I found it to be a busted port of a game that has no business being on PSP. I might say that same thing tomorrow, depending on how much patience I have in me. As high as the PSP raises the bar for handheld gaming, there are standards set down by portable games that still have their purposes. In a nutshell, portable games should be portable. They should be playable anytime you're on the road, and the portable experience of playing when you have a free moment is one of the main attractions of having games to go. And Midnight Club 3: Dub Edition for PSP takes up the idea of portability the same way a Hummer takes on the concept of sensible driving. It's just pure brute force, with no consideration or compromise for what would be the best tool for the job.  This PSP game runs like a high-octane engine, but it's got the demands of one too.      MC3: A PSP Chevy Nova?  Before I get into the positives of Midnight Club 3: Dub Edition for PSP (and the positives should be fairly obvious -- it's flipping real-deal Midnight Club in a handheld package), you're going to have to wait. Just like you will wait for the game itself. If any game on PSP is on the verge of being smothered by the first-gen loadtime issues of this handheld, it's Midnight Club 3.   How bad can it get? If you tried holding your breath for as long as it took to load up a race in this game, you might keel over. Typical loads are 70 seconds. For comparison's sake, that boot-up load in the PS2 versions of the GTA series, with all of the faces and the slow-crawling bar, that was typically between 75 and 90 seconds in those games. Using the industry-standard for loadtimes: I wasn't able to make a sandwich while waiting for the game to boot (I might have made it if I had a pre-sliced loaf of bread), but several times, I went to take a leak and still had plenty of time to wash and dry my hands before the race started up. Somebody's who's quick and has nothing to read might be able to drop something else off at the pool in that same time.  We've railed against this issue elsewhere -- we've even knocked a few otherwise enjoyable PSP game for making us wait. But Midnight Club is just too much. Way too much. First-gen or not, big city or otherwise, it's too dang much. The game has to load every time you start a race -- it's a big, open city, but you can't do anything in it without having to reload the whole thing. Imagine if, in THPS, you had to quit to the main menu every time you completed a challenge. And took up a new challenge. Or quit out of a challenge you didn't like. That's MC3 on PSP. Races often take 2:30 minutes to complete, and there's 1:10 of loading in between each heat. Thank the Lloyd that the game doesn't require you to reload the game every time you have to restart a specific race -- now why can't the entire game just cruise along and move quick from task to task just like that?   The same goes for multiplayer -- if you want to challenge an opponent to a rematch, most modes require you to reload the whole game every time. And all that cool car mod work that driving aficionados love Midnight Club for, it's weighed down by loading as well. Switching cars takes what feels like forever, the stat bars don't always load in the meantime, and there's a full pause while you wait for the 3D car to load instead of having the car model load in the background. Even the menus take their dear, sweet time to load, and forget about the FMV -- having to reload the game just to take a quick refresher glance at the cinematic of one 15-second tutorial clip is like a rule across your knuckles when you're trying to learn.  MC3: A PSP DeLorean?  Of course, it is a very, very big game -- how much slack can PSP gamers expect to give its technical shortcomings? After all, we've felt the wait of loads in launch games (and with Midnight Club coming just three months after launch, it's very much a first-gen game.) Can't we just accept that a game this big will strain the system?   In my book, not really. For one, you won't get far asking gamers to accept compromises, and this port of MC3 demands first-born sacrifice-levels of concession in order to be enjoyed. But even for die-hards, there's always this nagging suspicion in the back of your mind while playing (or rather, waiting) that it may not be the PSP screwing everything up. And while I'm no tech expert, a few experiments with the game engine show that a much better game could have been plenty possible, if only the game had been given more time and a more focused approach to the port.    If you're thinking that it's all of that heavy data streaming needed to create this vast, console-quality racing world that's holding the game up, think again. The game's world is entirely stored in memory. You can turn off the music and pop the disc out, and the game will play. Figure that out, and you'll fly into a rage every time that minute-long load pops up every time you start a new race -- it's already all there! Sure, the game has to load the map points, but is that a minute of loading? Of course, the game has to load the car models of your opponents, but then why does the second and third race against the exact same opponents take exactly as long? Traffic patterns have to be reset, maybe some custom track details have to be put in for specific events (such as cop car placement or intersection timing), but it's a free-roaming game -- how much pre-planned mapping needs to be loaded when I'm making my own path to the finish line?  This is what drives me crazy about the PSP version of this game. It could have been so great -- it almost is great -- but it's not at all tailored for the PSP, and the fit is ugly. Cut the track complications down, make point races more random and less specific, or even (and car nuts, don't kill me for saying this) cut the detail down on the opponent cars. Anything! Whatever could have been done to get the game to fit, it would have been for the better. If Rockstar's Leeds studio could have gotten this game to run entirely inside the PSP's racing engine (to be fair, the Xbox/PS2 games also required loading in between races ... they also only took 7-10 seconds to do it), it would have been fine. A minute-long wait would have been irritating, but if everything else played right there in the game without loading, it'd be a great bus-trip game. If you could have picked points to race to in multiplayer, or had an in-game menu of modes to jump into while in Cruise Mode, it would have been a killer party game. The thing comes so close...    MC3: A Fully-Loaded, Dubbed Out PSP Escalade?  OK, enough on the rough roads -- let's talk about how this game runs once it hits the highway. Midnight Club 3: Dub Edition is pretty dang near the console game, and that's powerful stuff. As far as no-compromise PSP production quality, this is everything EA said they were aiming for with its dialed-down PSP launch games -- except for the waypoint editor not showing up on the menu (and no online play on PSP, which is a bummer but still easy to get over this early on in the system's life), everything is there. All three cities -- San Diego, Hot'lanta, and Detroit -- are present, and fully decked out in all their free-roaming glory. The tuners, trucks, lux models, and even bikes are all in, and all ready to be fully pimped out to your liking. This is the console game, put in your pocket.  If you're expecting cuts to have been made in order to jam this into the PSP, you'll be in for a shock when you drive around the environments here. Textures and building architecture are remarkably accurate to the console edition -- like Tony Hawk's Underground 2 Remix from Activision, there's little that's noticeable at first glance besides the smaller screen you're playing the game on. THUG2 on PSP did reveal itself a little bit under closer scrutiny, but with the PSP version of Midnight Club, there are aspects of the game that actually looked better on PSP. The signage and scale of the SD Stadium, for instance, made a much bigger impression on the PSP. There's plenty of texture work to distinguish each area of the city, and city walls are brought from the console game with the signs, storefronts, and even graffiti spots marked in. Draw distance/pop-in is pushed to just about the vanishing point in most cases, and the more complex architectural details such as ramps, statues, and unique landmarks are all replicated in place and in detail. The neon roller coaster is still big and bright, and the fighter jet is right up their on the aircraft carrier's strip as you go sailing over the military base. Portable games in the past have had to scale the game world back to something resembling a Quake engine (even NFSU:Rivals was a little less of a game world than its console sponsor), and we were afraid that MC3: Dub Edition would have to be flattened out and over-simplified for its PSP go-around, but that's not the case here. The only thing that really got lost in the translation is the pedestrian population, and frankly, except for the flag girls who started the races, we don't miss those walking targets much.  Same goes for the car garage feature. It's all there, down to the colors you choose for the brake calipers. Midnight Club and its street racing ilk are gromped on by car guys because of the options and effects you can apply to the cars, and the PSP edition doesn't settle for excuses of being a handheld game. Just like in the console game, there are only degrees of performance that you have full control over instead of having give-and-take on various parts and upgrades that you might see in reality (although, for the money that you're putting in for upgrades at this level, it's pretty much be pure ~take~ anyway), but you still have a wide range of manufacturers to pick from for your parts.     Get down into body design, and it's insane the options you have. Roll up on bigger rims. Stack on a spoiler. Change the grill. Adjust the rise. Bounce in some hydraulics. Change up your exhaust pipe. It's all there, and just about everything can be color-adjusted as well. Also, you can apply a wide range of decals for your ride, including tons of manufacturer and after-market logo vinyls, which all show up in surprisingly sharp and intricate detail on your car model. And if you're worried that the show car features fine detail that won't be in the game itself, you'll be psyched to see the end result of your work when it rolls out on city streets. Neons are not as prominent as they are in EA's game (but they're also not as silly in their exaggerated glow effect), and rims spin into a blur instead of slowly ramping up and then spinning backwards stroboscopicly, but the parts and effects are all there,  Even logos are incredibly sharp (I never expected the Dodge Ram to look like a ram in a tiny rear window sticker, but there it was), and if you get up close enough to a car, you can see some of the finer polygonal detail (such as the taillight lamps being modeled lights and not just textures) at work.     MC3: A Late-Model PSPBenz With Door Dings?  As good as it is in replicating the console game's production values, the PSP game does have a few issues that would have been a scratch on the surface even without the loadtime gouges.   Most notably, the sensation of speed is something that takes some getting used to. Those massive cities are damned impressive on PSP, but it's too bad that the development studio couldn't also replicate the framerate of the console game that made those cityscapes whizz by at such intensity. As it is, Midnight Club 3 skids along with a good deal of chop and stutter at full speed. Played up against smooth games like Ridge Racer or even Need For Speed Underground: Rivals (which itself never got past 30), and it just looks as if it's a performance tech demo of a final game not due for months. There are also occasional instances of slowdown or frame stuttering that grind the game out.   Amazingly, these are aspects that I was actually able to get over -- play it for a couple of hours, and might get to hardly notice the chugging. Because the game is so frantic in its gameplay style, sending you weaving through traffic and careening around corners, the feel of speed hits you even before you get into the suped-up higher car series. 200mph still feels like a lot less when you're running a straight away, and the speed-rattle and nitro blast shaking has been taken way down for the handheld edition (though I came to really appreciate the subtle lighting boost used to simulate being in the zone of a nitro high -- it helps to get extra viewing clarity), but when you're sliding into a corner or whipping through busy traffic, your craving for speed will be quenched. Even so, the framerate shutters are a let-down that you have to get over every time you pick up the game fresh. Seeing as how even a few 3D DS games have achieved 60fps (and oh, what a difference it makes there), it's hard to watch a system with so much horsepower get throttled by even a game as hefty as this. The bar's been set, and anything less is something less.  As with ATV Off-Road Fury on PSP, console-quality graphics are something you get used to surprisingly fast, and unless the game does something special, it might not stand out even if it is visually stunning. That said, Midnight Club on PSP puts on a heck of a show. Particle effects are wild and rampant as you bust through barriers and knock over lamps. The shading used on buildings gives lots of visual depth to the game world, and the abundant use of neon makes key areas pop off the screen. The full scale of weather effects and time of day settings are available to add variety. The three cities presented still don't distinguish themselves in any large way -- everywhere looks just dark at midnight, I guess -- but that was an issue from the console game as well, and the PSP version doesn't suffer from any scaling back to lose locale identity. Reflection mapping on your car is rendered with whirling hues and impressive atmosphere (even if it is a clever trick that's not really as accurate as the reflection looks -- it'd take a total blowhard or a jealous rival developer to fault the cheat when it works this well).     Visual qualms are few, and mostly negligible (aside from the framerate, of course.) Civilian vehicles are not much more than painted boxes on wheels (no reflections, no effects to dress them up, and very low-res textures to mark the windows or markings), but they're real enough for you to not want to smack into them at 150mph. Traffic also sometimes has an odd issue where cars occasionally stutter and pause when they come to a turn, as if they're loading the next direction, but you usually only see this when they're running diagonal to your path, and the stuttering isn't enough to make the difference between a T-bone wreck and a near miss. Headlights are a disappointing effect (and is it just me, or is there no way to turn these things on and KEEP them turned on), but there wasn't much to the effect in the console game, and nobody's doing headlamps great this gen anyway. There is the occasional mismatched road texture in a race start glamour shot, but that's too rare and fleeting to worry about.  Oh, but tire tracks don't stay long in the PSP version --  a true bummer when you feel like spinning some donuts.   There are tangible issues with the sound, however. Again, Rockstar packed this game with exact, uncompromised console audio and FMV -- it's all the same stuff, and it's all in there -- but this is one of those cases where things needed to be custom-tuned for PSP to work. Specifically, the audio in the FMV exchanges with the different garage mechanics is not tuned for the PSP's speaker set -- unless you've got headphones handy, all you'll hear is the background music and some unintelligible chatter. On a relatively quiet city street, I still felt like I needed subtitles to know what the heck was happening in the tutorial FMVs. The mixing of the background music, the sound effects, and the car noises is also never ideal, always just sounding like a big hodge-podge of sound. It doesn't help that the sound effects are really milky on PSP, and provide little punch in the crashes or stunt effects. On the other hand, the car engine sounds are all packed in tight, and that gonzo mass of music found in the console game is crammed in here as well -- even if you just turn on the rock or dancehall tracks (who in their right mind would turn on just dancehall tracks?), you'd still have plenty of music to go for hours.    MC3: Not A PSP SUV?  One of the more amazing aspects of the PSP version of Midnight Club 3: Dub Edition is that it has no problems playing like a Midnight Club game. The analog controller on the system has gotten its share of praise and knocks, and in the end, it takes a little bit of getting used to as well as a little bit more thought on the part of the game developer in order to tune properly for it. Ridge Racer didn't make much use of its analog properties, Need For Speed felt squirrelly and hard to steer precisely, and Twisted Metal: Head-On just flat-out lost it when it came to steering on that nub. Even the E3 build of Burnout for PSP, which spun off of a series that's always fit like a love glove, the developers admitted that they still had a lot of tuning to do with the analog controller.  Then Midnight Club 3 rolls in, and it acts as if there was never an issue. True, there's not a ton of finesse to this game -- at full speed, you're just hammering the handbrake and hoping that you re-engage the wheels before you slam up on the wall -- and there's still a dead zone in analog sensitivity. But there's also a healthy degree of custom tuning that you can do for the controls to get them exactly the way you like them. Every button can be mapped to any function in the game, so if you're used to the Xbox version of MC3, you can toss the gas and brakes up on the triggers (and if you really feel like it, you can go with digital steering instead of the analog controller.) Tuning your vehicle for drift factor, traction and friction bias let you get the control response right for how you want it (and thankfully, you don't have to load out to the garage to tweak these aspects.) I would have liked to have had camera options available in the menu, since the first-person cam gives an intense sense of speed (but also, obviously, isn't as pretty since you can't see your pimped-out ride), but the option is there on the pause menu.  Some of the functions of the console game got shoved in where they fit in, but all of the special moves and car functions are still in the PSP game. You, of course, have your nitros and your handbrake, but there's also your button for activating Roar/Zone/Agro. Hydraulics are still available for bouncing, and the more useful weight shifting is also on the layout. Bike leaning is also a vital part of the gameplay brought to PSP. Even the option to switch songs on the radio is available. It's amazing that it all got on a system with just one stick and this many buttons, and there are times where you will wish you had three hands to hit one button more than you have spare fingers for, but the control set-up works well.    MC3: A PSP Volvo Station Wagon ... With That Sticky Stain In The Backseat?  Great gameplay, even greater technical blunders -- that's how the multiplayer mode pans out. In this case, it's an even bigger door ding disaster, because you've got as many as five other people waiting with you. In our office tests, not many people had the patience to get through more than a couple of races. This is one of those clear cases where a little customization for the PSP would have worked wonders. Why, for example, does the game have to load track and traffic data for a waypoint race when completely random map points would have been just as fun to race around? Why can't I set a point in Cruise mode and challenge everybody hooked up wirelessly to race there and back? Heck, why do the Tag and Capture The Flag matches have to load everything all over again when I choose a rematch, even though the gameplay modes are just about your cars and some random objectives in a world scattered across a city that's already loaded? The Paint mode just has you turning colors on at checkpoints, so can't we just reset those colors and play again right there? I'm not even asking for compromises here anymore -- just simple, simple logic!   Obviously, it's really too bad that such an opportunity for party gaming is pissed away with the PSP version. The game can't make use of some of the PSP's ultra-swank features -- it doesn't have online play, and there's no Game Sharing -- but the six-player span is truly outstanding (and, we might add, a big ~FU~ to EA's two-player cap in Need For Speed), and what's here is still fun for those who can spare the time and patience. Adding power-ups makes races a little more crafty, and the variety of power-ups is widely different from your standard kart racer pick-up set. Tag never makes much sense (at least, not in a two-player mode), but Paint and Capture The Flag are both good runs that get even better when you get all six players going and have teams divided out. We were disappointed to find that nothing much about your multiplayer stats are saved to the Memory Stick -- the game saves every other frivolous detail about how many miles you've traveled, how many wins you've racked up, and how many burnouts you've burned, so that's a missed opportunity there. Still, the formula is here for high-octane multiplayer play ... there's just all that loadtime clogging up the engine.  MC3: A PSP Prius?  One quick detail that we'd like to highlight is battery life. With the size of its game world and the quality of its visual effects, we were sure that Midnight Club 3 on PSP would drink batteries. Surprisingly, it's not too far from economical on this aspect. Timing the game for regular play use, loads and races and all, only hit the battery for a four hour straight runtime. The sound was cranked, the brightness was fully up, and it still kept to a reasonable runtime. Ridge Racer usually clocks in at three and a half hours, and we couldn't imagine that MC3 could have beat that when we first saw it. Patch in your headphones and dial the dimmer down, and you've got a game that will keep up with the rest of them with no problems.    Is it overly harsh to pound on a game for having dreadful loadtimes? Let me put it this way. The game's clock said I spent 15 hours playing. Assuming that in-between time isn't counted in that figure, and figuring an average of 15 minutes between reloads (saying that sometimes you have to spend a good deal of time racing one opponent in one race, but other times, you blow by the competition in two or three minutes), that means that those minute-long loads added up to an entire hour this weekend of just waiting to play this game. One hour of staring at a black screen with a spinning wheel on it.That's not the next level of portable gaming there, folks. That's me sitting there, waiting for it.No amount of pardons or acceptances for the detail and depth can give me back the time I spent NOT playing this game when I was trying to play it. I played other games while waiting to play this game! And the thing that really sucks here is that you can come to realize that, with a little custom-fitting for the PSP, this could have been a must-own. There are still issues that I have with the game -- its framerate holds it back from being perfect, and as an exact port of a game many street racers already burned through, there's not much to get back behind the wheel for -- but the difference between 70 seconds of loadtime and 7 seconds of loadtime (still a substantial wait for a handheld game) would have been the difference between a clunker and a keeper.On the other hand, it's a good game deep, deep, deep down inside. It took me a long, long time to warm to this PSP game at all; I wouldn't expect most other gamers to give it that much time. Even car geeks into all the customization and detailing will get turned off by the load pauses. What I got to really like about the game, however, was its sense of chaos and mayhem. Blast this game for doing this to me, but I'm almost spoiled for other racing games now -- everything else feels like a Sunday drive on an open highway. Better-performing games will come along that provide these kinds of thrills, but this game was ALMOST there right now, and I would have been perfectly happy with MC3 as my go-to racing game this summer if it had been polished off. A month's delay would have been a drag, but it might have made all the difference.If you can stand the wait, there's a lot of fun to be had behind the wheel once you reach the end of the line. True. The same thing could be said about the freaking DMV.", "date": "Jun 28, 2005"}