{"name": "Tiger Woods '99", "name_review": "Tiger Woods '99", "ref": "https://www.ign.com/articles/1998/11/25/tiger-woods-99", "text": "Other than the sleeper hit Hot Shots Golf from Sony, there hasn't been too much in the way of golf on the PlayStation. Hot Shots is great, but sometimes realism is needed, and you just want to play a round with someone whose head doesn't outsize his body.  Enter Tiger Woods 99. This is essentially EA Sports' own PGA Tour Golf series retitled, and with a heavy endorsement from Mr. Media Blitz himself. But as always with a new entry from EA Sports, the familiar feel of the original game carries over with new features.  A new 3D engine is featured in Tiger Woods 99. The camera will cut away and follow the ball in-flight from different angles, and players can see, close-up, where the ball should land, if hit properly. The hit meter is the standard fare  press once to start the swing, press the button again to set the needed power, and hit the button again to time the shot. If the swing goes into the Tiger Zone and your accuracy is spot-on, you'll get a Tiger Shot  and you'll get another extra boost in yardage.   EA Sports video captured Tiger Woods for all the conceivable animations  from the standard drive and swing motions, to the victory and ~I suck!~ poses. He's also recorded 17 Tiger Tips that pop up when you get into a jam, telling you the way he'd handle the certain situation.  Tiger Woods 99 features five pro courses: Summerlin, Las Colinas, Southwind, Sawgrass, and Scottsdale. And because it's a PGA licensed title, you'll find heavy hitters like Craig Stadler, Mark O'Meara, Lee Janzen, and Davis Love III in the game, and each can be selected and played as or against, so you don't always have to play as Tiger.  Other features include practice, stroke, tournament, Skins, shoot-out, match, and foursome modes, as well as a driving range to hone your driving skills. Video golf is the guilty pleasure of the videogame industry. No one wants to admit they play them, but many, many do. Including me. I love Hot Shot Golf, and was looking forward to a more realistic game of golf. And while Tiger Woods is certainly not a game without flaws, it's good nonetheless.My biggest gripe is with the 3D engine. It doesn't seem very optimized, since there's not too much going on except for a few sprite-based trees and gentle slopes of the fairway, yet the game doesn't have a very strong, smooth framerate. EA Sports' PGA Tour Golf on the PlayStation was the same way  Tiger Woods 99 has a cleaner, sharper look, but for some reason the EA guys working on the PlayStation golf games just can't seem to iron out smooth animation.The interface is also a little troublesome and awkward. Including the swing-meter  instead of the traditional, generic thermometer-style graphic, you're presented with a goofy, top-down image of Tiger swinging, and you time the shot with the location of his golf club backswing. It just looks like EA Sports didn't put its best interface guy on this project.I'd rate Hot Shots Golf higher simply because its designed a lot better. But since the game does play a good game of golf (and more realistically, too), I'm tilting the scale in Tiger Woods 99 favor, too. I just wish EA Sports could have ironed out the ugliness.", "date": "Nov 25, 1998"}