{"name": "Mobile Suit Gundam: Gundam vs. Zeta Gundam", "name_review": "Mobile Suit Gundam: Gundam vs. Zeta Gundam", "ref": "https://www.ign.com/articles/2005/06/29/mobile-suit-gundam-gundam-vs-zeta-gundam", "text": "Do you really like robots? A like that borders on pure and absolute fetish that transcends any rational thought? A desire so deep and heartfelt that anything that brings a remotely robotic experience to the screen will bring forth tears of joy? Then you are just about the only person who should be checking out Mobile Suit Gundam: Gundam vs. Zeta Gundam while everyone else can live out their lives without worrying about robot battles in space or confined sections of land. Their life will be completely fine while any attempt to wring some fun out of this game will definitely cost you.   There are the games where we can play through adventures and bring static images to life. Then there are the games that show off little more imagination than that of a kid who repeatedly bashes two toys together in a mock battle. If anything can be said for MSG:GvZG, it's that it has a respectably large amount of different robots that can shoot and bang into each other and getting through the game certainly requires some skill, but it never gets to be any fun.   The Gundams are robots that have a handheld weapon that shoots as well as a sword. Mankind has figured out how to create gigantic robots that can fly through space, but they still need the good old plasma sword if these beasts are going to be coming into contact with other huge metallic mechanisms. But why would anyone bother with a stupid sword with all of the other advancements in robotic weaponry? Because the guns generally suck, that's why.   The combat in MSG:GvZG is tough purely because the basic elements of a basic game, moving and shooting, have been so thoroughly crippled. Movement is done by the left analog stick and that makes enough sense, but the right analog stick has no control over the camera. This means that the only tool that's worth a damn is the lock-on button and so the fights are not really about some clever strategies or trying to flank others, but really about locking-on and attacking. Throw in the occasional dodge and that's mostly it.   When using the guns the only time they're available for use is when a target is coming right at the Gundam or if they're not moving at all. The large majority of the weapons here can only aim at where a target currently is. So if they're moving, forget about it. To master the universe and take everyone down like a master just wait for someone to land and shoot. Wash, rinse, and repeat until the simplemindedness of the game bores its way into your brain and the drool spills onto your shirt. Forget about thinking too hard, you're not going to need it.    The combat gets worse when the robots are flying around in space and the only way to deal with the robots coming from different directions is to struggle to move and fight by targeting whatever appears. With no camera control you can forget about trying to keep track of where you are. By this point you should have given up hope anyway, but it's understandable if the guilt of paying out money for this tragedy will push you to keep on playing.   If the combat was going to be so simple and boring and not worth the hundreds of words that have just been spent on it it would have been a little rewarding if the different locations were unique and cool and there was some cool environmental damage, but that's not the case. The land battles are in sparse areas where there's slowdown even with just four characters on the screen at once. But even with them looking like they've been slapped together in a couple days they still get reused again and again for different fights.   More time is spent fighting with the controls than against the enemies in this confusing pile of robots bashing each other to pieces. Since pretty much every aspect of this titles disappoints in a few different ways, the saving grace is just one word: robots. This game truly has a lot of robots. And they smash each other. Smash, smash, smash. Smashity, smash, bam, boom, kapow. That about sums it up so save your cash.", "date": "Jun 29, 2005"}