{"name": "Fantastic 4", "name_review": "Fantastic 4", "ref": "https://www.ign.com/articles/2005/06/29/fantastic-4-3", "text": "The recent trend in comics-inspired blockbusters has spurred an equal phenomenon in the games industry. And for the first time since God-knows-when these game adaptations haven't sucked. On the contrary, they've each delivered a unique brand of superhero action grounded in solid, sometimes inventive gameplay mechanics.   Take Activision's X-Men Legends and Spider-Man 2, for example. Both games offered something more than the tired beat-em'-ups of yesteryear. Later this year, Vivendi Universal will release The Incredible Hulk: Ultimate Destruction, a game that finally lets you experience the type of destruction only the Hulk could cause.   But that's for a later time. For now, there's the upcoming Fantastic 4 film and its videogame interpretation of the same name. Like most comic book properties, those comprising the titular group of heroes boast truly wicked powers. ~The Invisible Woman~ Sue Storm can vanish before the eyes of her foes and blast them with force shields. ~Mr. Fantastic~ Reed Richards, the leader of the group, plays the role of human taffy and stretches his body a long, long ways. ~The Human Torch~ Johnny Storm can set himself ablaze at will. And ~The Thing~ Ben Grimm looks and acts like the Hulk, only less green, made of rock and is somewhat nicer.   Any one of these superhuman characters would make for an awesome game, if done right, let alone all four. The one thing capable of sabotaging such a thing would the improper implementation of the super powers. After all, if you don't really feel like the Thing or Mr. Fantastic there's not too much of a point in having a game about them, right? Unfortunately, this critical aspect is where Fantastic 4, developed by 7 Studios, doesn't get it exactly right. See, there are plenty of different powers and abilities, and the game does try to exploit them, but flexing your fantastic muscle just isn't as fun or intuitive as it should be.   To start, however, you should head over here to check out previous coverage of the game. But for those who don't want to click over, here's a quick rundown. Fantastic Four mirrors the general plot of the movie, but adds several enemies and scenarios from the comic book.    The reason, of course, is to increase the length of the game. Not that comic book fans will care -- the more the merrier. Fantastic 4 plays like a traditional action brawler, meaning you'll progress through a series of linear stages, facing enemies, mini-bosses, and boss as you progress toward the ultimate boss. The main game splits between 10 story missions, each of which is made up of a series of sub-missions.   At any given time, you'll either control one, two, or all characters of the group. This all depends on the mission or sequence. Boss fights usually feature all four heroes, for example, while less intense situations will feature only one or two. You can switch between available characters dynamically using the D Pad, with the CPU handling fellow teammates in your absence. This system actually works very well and never gets in the way of the action. Switching heroes is fast, easy and intuitive, just as it should be. Once you're controlling them, though, things get a less refined.    Each hero can perform six upgradeable combos and three upgradeable cosmic powers, along with the usual assortment of punches, kicks, and grappling maneuvers. The combo techniques look and act like your everyday string of physical attacks. They're pretty straightforward and lack a little pizzazz, yet they're effective and easy to pull off. Cosmic powers form the backbone of your arsenal, and like the combos, each of these abilities is very effective and easy to use. Cosmic powers exploit each of the character's unique abilities, so they let The Human Torch throw fire balls and raise walls of fire, where Sue Storm can raise shields, project energy waves, and turn invisible.    This also means that The Thing can use devastating body slams and charge attacks, where Mr. Fantastic gets long-range punches and forms a human twister using his limber frame. All these cosmic powers are well implemented if somewhat dull. A good number of them look cool enough, yet feel like variations of other powers. When in combat, for example, it really doesn't matter who you're using, as each character has equally strong attacks.   True, punching someone as the Thing will do more damage than punching someone as Sue Storm, but their cosmic powers are equally as potent. And thanks to a hastily refilling cosmic meter, you'll spend as much time punching foes as you will zapping them with powers.   It's a good thing you have all these abilities at your disposal too, since you'll face swarms of enemies at a constant pace. You'll never fight just one or two, but five or more at a time. However, enemies in Fantastic Four aren't too bright, and most of them feel like pushovers. Enemies go down after a few hits from the Thing or a few blasts from Sue Storm. There's no gradual increase in challenge for a majority of the game. On medium difficulty level, it doesn't provide much of a test either. In fact, it's quite easy to finish half the game only losing one or two lives. This is true for single play, and even more so during co-op with a friend.   Fantastic 4 does offer a bunch of different enemy types, though. You'll fight giant web-slinging spiders and homicidal natives in the lush jungles of Tikal. You'll need to vanquish digging mole men in the Underground stage and skull-launching mummies in the Museum. You'll battle dinosaurs, street thugs and seemingly everything in between. Fortunately, many of the enemy types use different attacks. Not all mind you, but there's definitely variety in the enemy department.   The same goes for boss characters and mini-bosses. While nothing terribly inventive, you need to conquer each doing something more than just beating it to death. Each encounter forces you to use the combined powers of each character. Doing so isn't too difficult, since the game uses the same colored-coded beacons to tell you where to place each character and when it's a good time to do so. In one fight, for example, you need to use Sue Storm to freeze the hands of a giant creature, immobilizing it. The Thing can then focus his attacks on the boss while Torch and Fantastic handle the minions running around nearby.    The system works well enough, if not feeling somewhat limited because of the lack of freedom. Also, boss encounters bring up another one of Fantastic 4's problems. Due to some of the hero's super powers, namely Sue Storm's shield, it becomes way too easy to cheat certain villains. Since her shield never runs out and blocks most attacks (even from bosses) you can easily find ways to exploit certain encounters, especially those where the other members of the group are included. Take the Diablo boss fight. Diablo changes between two different phases: one strong, one weak. You can attack him during his weak phase as the Thing and play as the near-invulnerable Sue Storm during his strong phase. There are lots of situations like this.   Though combat is a major part of the game, there's more to Fantastic 4 than brawling. In between the fighting (and sometimes during) you'll need to solve puzzles and play mini-games, both of which are imbedded into the main game. This is both a good thing and a bad thing. While trying to keep a game fresh by fusing different forms of gameplay is commendable, it just doesn't work well in this case. What makes the heroes of Fantastic 4 cool is their powers, not their ability to punch and kick people. And it's these very powers that have been replaced by a collection of semi-interactive mini-games.    You'll find that you can't actually perform some of the coolest aspects of each hero, only watch the character perform them on screen. When playing as the Thing, for example, you can't run around picking up cars and trucks. Instead, the game decides when and where you can exercise you're strength by highlighting certain parts of a level with a color-coded beacon.    Each hero has a different color, so only that particular hero can perform a specific action. So, instead of lifting up a truck to throw at an enemy as the Thing, you'll need to stand in front of the truck, initiate the mini-game by pressing a button, then tap ~A~ rapidly to fill up a meter. Only then will you watch the Thing do his, uh, thing   All four champsions needs to perform a mini-game at some time or another to clear obstacles and maneuver the environment too, but none of them are very fun and most don't make sense within the context of the game. During one sequence, for example, Mr. Fantastic needs to navigate a series of platforms. Instead of stretching him to safety yourself, you simply stand on a beacon and press a button to watch him do it.   In one extreme example, you need to use each hero to save a fire truck from plummeting into the ocean. Only you don't really do anything, just send each hero to the right beacon, perform the mini-games, and watch as they save the day. Sections like these only emphasize the lack of freedom you have with a hero's superpowers. It would have been far cooler to perform these heroic deeds than just play the role of spectator. Imagine playing Spider-Man 2 to see that you could only swing when standing in the right spot, and then, only watching Spidey swing as you sat there. It's just nowhere near as immersive as it needs to be.   Fantastic 4 includes a slew of unlockable extras. Comic fans will spaz over the covers, concept art and bios available. What's more, you can unlock video cast interviews of everyone in the movie, plus an interview with creator Stan Lee as he plays the game and offers his impressions. In addition to all this, you can unlock two bonus stages by finishing the game on Medium and Hard.   There are also Arena Fights, where you and a friend can battle different enemy types (of your choice) in a practice room or in Survival Mode, where you need to fight waves of enemies. You can only use the powers and combos you've unlocked in the main game, and it handles very much the same, with you switching between the four characters using the D-Pad.    Fantastic 4 is a passable action game with some interesting ideas. The action feels solid and the co-op mode offers an intersting twist. The team work aspect, even in single player, delivers something you won't find in most action brawlers. There's also plenty of variety in terms of enemy design and special moves, but it sometimes feels cosmetic. Still, you can't help but feel there's something missing in Fantastic 4. All the characters and powers are here, as are the villains from the movie and comic. Yet much of the game just doesn't make you feel (cough, cough) fantastic. You can't run around stretching from room to room as Mr. Fantastic, for example, and while the Human Torch can hover, he never really takes flight. As for the Thing, he can smash vases and cars at will, but that's pretty much it. Any heavy lifting or mass destruction requires you to stop, stand in the right spot and play a mini-game. All this does is rob from the experience. Heroes don't stop before they do stuff; they just do it. In short, rent this one first.", "date": "Jun 29, 2005"}