{"name": "Riviera: The Promised Land", "name_review": "Riviera: The Promised Land", "ref": "https://www.ign.com/articles/2005/06/30/riviera-the-promised-land-2", "text": "There's a bit of expectation when popping in what's believed to be a Japanese-style RPG. Riviera: The Promised Land from Atlus, however, strays from the formula with a decidedly different approach on the game genre. It still contains the usual RPG offerings in the form of turn-based battles and wide-eyed anime-style character design, but the way it's been put together is something decidedly different. It's uniqueness both works for and against the production, but overall it's a really nice surprise and an enjoyable experience during a time where original IPs have all but dried up on the Game Boy Advance.   Riviera: The Promised Land was obviously created for people who want to skip all that exploration rigamarole and dive right into the meat of the story and the epic battles. There's no wandering around aimlessly to track down the hidden treasure chests or to trigger the inevitable random fights. Everything in Riviera is laid out in a specific, rigid manner, making it so that players spend more time unfolding the usual ~good versus evil~ plot like a novel, instead of creating gaps in the storytelling due to the familiar aimless wandering to find the next point players need to go. How this is done is by a simple controller interface that assigns a map direction or items to a direction on the D-pad. This interface brings back the feeling of a point-and-click adventure, without the need of randomly clicking every little location on the screen to bring up the triggerpoint. Everything is laid out clean and straightforward, making it very easy to navigate through the things to look at and navigate to.   The game is also made for people who love the exaggerated battles of a Japanese RPG. Riviera has plenty of opportunity for over-the-top flash thanks to the ability to power-up their character in fights and using that level up engine to lay the smackdown on the targeted enemy. A combo system shows just how badly you or your enemy got whacked during an attack, and it's a slight thrill to watch the beating rattle up some combo points especially when the adventure rewards players who push as much power as possible during battles. The battles are standard RPG turn-based fashion for the most part, although they emphasize a bit of strategy by requiring players to assign no more than four items to the players at each fight. And since many items found during the wandering phase only have a limited amount of use, a bit of thought must be put into the fight beforehand, especially if you're up against an enemy with certain strengths and weaknesses.    When players aren't navigating the grid-map or partaking in the battles, the game pushes some very Shenmue-like Quick Time Events on the player to pick up the pace a bit. Open up a chest with a trap, for example, and the game will kick to a mode where you'll have to push ~Up, Down, Up, A~ before the timer expires. Or, to run away from harm, you'll have to rapidly push the A button ten times to escape. These events are scattered all throughout the Riviera storyline, mostly to keep players on their toes.   The issues within the adventure are minor, but problematic. Even with the easy-to-navigate interface, and with the ability to actually see things to investigate, the game enforces an unnatural point system to limit what players can interact with. If you see a chest sitting there, don't think you can just walk up to it and open it up. Nope, you actually have to have a ~turn point~ to interact with it, something that's earned during the battle phase. If you didn't lay enough smackdown on the enemy in a previous battle, you might not have earned enough points in order to open up the chest and score the goods inside. It's clear why the point system is in Riviera, since without it the streamlined navigation would make it far too easy to grab items in areas. But that doesn't mean it doesn't feel awkward and forced upon the player unfairly. Because it does.   The game is a surprising treat in visuals and audio. The soundtrack in particular is quite pleasing and fits the Japanese RPG feel with SNES-like music accompanying the adventure. In terms of graphics, the game features a really nice anime art style with talking heads that slide in to represent who's speaking which line. Sprites aren't quite as detailed as these individual stills, and backgrounds, while nicely rendered, are repeated frequently, so it's pretty common to leave one room and enter another that looks exactly the same.  Riviera isn't going to set the RPG world aflame with its unusual, more rigid and straightforward design, but it is a nice change of pace from the usual RPG designs coming out of Japan. The plot takes a bit to get going but it eventually does move along, even if it's a story that you've probably experienced in some fashion in nearly every other Japanese RPG game in the past two decades.", "date": "Jun 30, 2005"}