{"name": "Doom 64", "name_review": "Doom 64 Review", "ref": "https://www.ign.com/articles/1997/01/29/doom-64", "text": "Talk about bad luck. Our friend, the space marine once again enters that hellish space colony only to find it overrun by more monsters than ever. Apparently someone forgot to kill them all last time (must have been on the PSX) and they have somehow revived each other. Unfortunately this evil assortment of zombies, flaming skulls and cacodemons just won't let our friend be all that he can be.Gameplay: The object of the game remains unchanged. Find your way through a labyrinth of hallways and passages, kill everything in sight, collect keys, flip switches and get to the exit. The gameplay of Doom 64 is perfectly retro-Doom. There is no looking up and down, no precise aiming, no swimming, crouching or jumping -- just plain old Doom. The control is responsive and totally customizable. The default setup is not that great (unless you own the Super Pad) -- if you've played Turok, you will inevitably revert back to C-Button strafing and 3D Stick turning, which also works like a charm with Doom 64. The game now also has the Duke Nukem 3D map feature (with texture / or without), and all levels are completely new (and quite well-designed, I might add).Graphics: The 3D engine is ultra slick, the backgrounds scroll by smoothly and there is no pixelation up close. The texture maps are nicely detailed, and everything is now true 3D, which means things stick out from the walls and there are rooms and walkways above rooms. Lighting effects are really nicely done (lights fade on slowly), and there are a lot of well animated room transformation sequences (ceilings come down, walls open, pillars rise, etc). After playing Doom 64 for a while, I popped the good old PSX Doom in again -- and the difference is much bigger than I remembered. The 32-bit and PC Doom looks hopelessly jerky and pixelated in comparison, and its textures appear drab and boring. However, I have a feeling Midway's development monitors are calibrated incorrectly. There is no way you can play Doom 64 with the default contrast settings. Even when pumping the brightness levels all the way up, the game remains very, very dark. Which is cool in some areas (that blue or red neon glow is fantastic), but annoying in others. But luckily your TV's remote control can easily remedy that. Unlike Turok, Doom 64 uses sprite objects and enemies so that there can be more of both on screen at the same time. Although the bitmaps have been redesigned, the enemies are still instantly recognizable. What hasn't been improved is the animation. All enemies still move around in that awfully jerky way and walk on the spot rather than standing still. The number of frames is pretty low, and is most noticable during the death animations (which are bloody, as usual). On the up-side, the enemies look much cooler than they used to, and they anti-alias when close-up.Sound: The weapons sounds and enemy grunts sounds instantly bring back memories of playing Doom on PCs or Macs. Like PSX Doom, the N64 version abandons ~traditional~ music in favor of ~ambient music,~ which is usually a succession of low bass notes with some sound effects and instrument notes thrown in once in a while. It adds perfectly to the game's scary, claustrophobic atmosphere and sounds almost as good as the PSX version's red book audio. For example, in one level there are baby cries being heard in the background, and sometimes a shift in the soundscape (like gear noises etc) can really make you jump. However, I wish there were at least some melody lines appearing once in a while, (like in the PSX version) and the fact that the music doesn't change depending on your surroundings within a level is an oversight of what midi can do (talk to the IMUSE people, Midway). I have to admit though that I occasionally start humming that strange ~buzzer melody~ from the first level ~dee-o dee-o tak tak...~ Scary.Enemy AI: Enemy AI seems to have been lifted directly from Doom. It's nice though that the monsters can also attack each other. For example, if someone shoots at you, maneuver yourself in front of another enemy and cause him to get hit. He will then proceed to take revenge on the sniper. Team work.Weapons: I expected more here. The weapons are flat-looking sprites and animation is almost non-existent. The cool shotgun reloading sequence from the original is gone. Explosions are also a letdown. After seeing what the N64 can do with bitmap explosions in Turok and Blast Corps, I was really disappointed. The extra weapon, a large laser, is not really worth the effort either (and when it's selected even slows done the game a tiny bit).Options: You can customize the controls to your liking, adjust brightness (but not enough), center the screen, enter passwords or use the memory pak. There are also four different difficulty settings.Shortcomings: The most obvious problem with Doom 64 is that we've seen it all before -- maybe not in this quality, but the gameplay and concept are hardly impressive anymore. While playing, I yearned for the freedom that Turok or Mario 64 offered. Sure, this is Doom after all, and Midway wanted to preserve the classic gameplay, but I think it's time for the series to move on. The second major problem with Doom 64 is the lack of a multiplayer mode. Heck, even a four-way split-screen on a tiny TV is better than NO multiplayer mode. After all, it's the famed ~death match~ that propelled Doom to instant mainstream success. Other quibbles are with the animation (enemies and weapons), and the bad contrast calibration.A strong sense of deja-vu lingers over this game. Actually, make that ~deja-joue...~ But as a conversion this is very competent, and technically well done. Doom 64 is much more scary andaction-laden than Turok for example. You won't spend minutes running around corridors looking for enemies -- you will rather spend seconds trying to get out of the corridors because there are too many... As far as pure shooting action goes, this game delivers the goods. Make no mistake about it, this is the best update to Doom so far -- but if you've played the PC, PSX, SNES, Mac, Saturn, etc versions to death, you can do without this one.  Even if you've never owned a Doom game or you are a hopeless fanatic, rent it first along with Turok and Shadows of the Empire, then decide which one's the game to buy.", "date": "Jan 29, 1997"}