{"name": "Colosseum: Road to Freedom", "name_review": "Colosseum: Road to Freedom", "ref": "https://www.ign.com/articles/2005/07/19/colosseum-road-to-freedom", "text": "Way back when, all roads used to lead to Rome and once there the best entertainment in town was at the Colosseum where the gladiators would engage in mortal combat for the entertainment of the masses. Fast forward a ways and the idea of men hacking at each other is still entertaining, if not completely legal. So with the magic of the PlayStation 2 system we are seeing the arrival of a new simulation, Colosseum: Road to Freedom. And while the game delivers on providing a feel for what the daily life of a gladiator was like it doesn't quite hit the mark in the combat part of the game.   Where Capcom's recent Shadow of Rome spun a tale of intrigue and mostly uninteresting stealth in with some of the most over-the-top action to create a tale that was swimming in blood, Colosseum has a much more pedestrian path that it takes with sparser story elements. Here, the created character is sold to a gladiator stable and the goal is to fight through several events in order ton earn enough money to pay off the stable owner. There are a few singular fights that are story-specific, but Colosseum fills up the schedule with lots of events for a few different kids of combat. Over time, the gladiator becomes more powerful, more skilled, and loaded with some top-notch items to rule the arena. Over lots of time, that is, and much of it can get pretty repetitive.   There are many RPG elements here in that the gladiator can develop different skills as well as improve a group of different attributes. There is neck strength, body strength, arm strength and leg strength which all go to show just how resistant those specific parts are to an attack. There are also the regular attributes which most should be familiar with such as the agility, strength, endurance, and so forth. Then there are the skills such as those for one sword, two swords, a sword and a shield and so on. There are many different ways to play with the stats in order to create a specific type of fighter.   All of these numbers can be improved in the arena during fights as well as back at the stable during training. The training is done with mini-games such as tossing wooden swords about, sparring, or engaging in some old-fashioned exercise. It's all a bit much at first, but it gets to be pretty easy to use quickly. Within a few days of the game's calendar it should all make as much sense as your local bus schedule. And with such a grand setup that should be the backbone of a great adventure the game leads up to the marathon of events that should make the game fly, but sadly it kind of flounders about.   Inside the arena the gladiator has a few different attacks that are mapped to the face buttons. The triangle button is for the upper attacks, the square and the circle buttons are for left and right attacks and the X button takes care of the lower attacks. Throw in some blocking and evasive moves and the gladiator should have a good setup to mix up the moves and he does, but the problem is when dealing with multiple opponents. Without any ability to lock onto a specific opponent the fighting often leads into The Dance of Swords (cue ~huzzah!~ sound effect).      This dancing can happen when trying to attack just one enemy. After dodging an attack and trying to attack back it's possible to swing right past him and then he'll miss again on the next attack and then the camera needs to be corrected because it's lazy and a simple fight that should've been relatively quick and fun has become more of a chore. Without any locking-on the fighting is more awkward to go through as well as to see since the camera needs to be pushed around as much as the enemies.   Go into a group of enemies and there are some different problems to provide some entertainment. As one enemy is near death and just needs one more stab to be taken down, the gladiator can switch to another nearby opponent. And where the tactic of running around a group to surprise an opponent from the back should've been easy to pull off, that attack can easily go astray, giving the enemy time to turn around for his own attack.   And with this problem in the combat itself, all the best-laid plans in Colosseum start to come crashing down. The parries, thrusts, dodges, counter-attacks and such are all less interesting and much less fun to pull off when the rest of the game refuses to cooperate. This starts off as being a minor annoyance and grows to be a major thorn in the side of the gameplay. By the time the bigger battles show up this whole process gets dragged out further and further and fighting through the awkwardness becomes more of a task.   The weak fighting system gets all the more frustrating because there are many other interesting parts that could've fallen into place to make the game fun for a while. It's just that the fun part doesn't quite show up as much as it should. It could be that the tame action here is all the duller after having recently seen the blood-soaked Shadow of Rome, but the effect is that the action leans more towards a dry simulation than the raucous videogame action that gladiators deserve.   One part that was always entertaining was that enemies would drop shields, helmets, and weapons after they're hit or completely killed. During a fight it was a thrill to knock a shield out of someone's hands and then go to town on their exposed flesh. It was even better to knock off his helmet and bash his head in. At the end of a fight it was a free-for-all to grab any pricey piece of gear that was left on the dirt floor. And it was during those brief times that Colosseum almost begins to become more of a game, but sadly it's still crippled into the state it's in.  Colosseum: Road to Freedom works diligently at recreating its own version of Rome and the gladiatorial lifestyle, but when it comes down to the action itself it underdelivers. The fighting can be deep, but it can also be very awkward and frustrating. With some better graphics as well as a more fluid and intuitive system, this would've been a much more interesting title. As it stands, most of the elements remain as good ideas that could've been, but didn't.", "date": "Jul 19, 2005"}