{"name": "Love Triangle: Dating Challenge", "name_review": "Love Triangle: Dating Challenge", "ref": "https://www.ign.com/articles/2005/07/26/love-triangle-dating-challenge", "text": "is a filthy, dirty, guilty pleasure -- which I why I'm absolutely crazy about it. This game, basically a series of tongue-in-someone-else's-cheek conversations, is not necessarily the deepest title on the decks, but neither are the teenie-weenie soap operas that plague (uh, populate) channels like the WB, and it seems plenty o' folks like those. What it is, though, is an extremely witty, clever distraction that will appeals directly to the teen-to-twentysomething set. I mean, how many mobile games use both ~backdoor~ and ~Tom Wopat~ as punchlines?   You slip into the virginal shoes of Erica, who wishes to get her toes curled back by the hunky -- and deliriously dumb -- Lucas. However, her best friend Kiki stands in the way, as she's either currently dating Lucas or stringing him along with her series of flip-flop break-ups. You pop into the game just as Kiki sends Lucas temporarily packing, and it's up to you to steer Erica's chattiness into Lucas' heart and pants.   If you had the misfortune of playing Sprung for the DS, you know the gist of Love Triangle Dating Challenge. I say ~misfortune~ because that game got you trapped in conversation loop holes and had dialogue that only wished it was as sly as Love Triangle Dating Challenge. Perhaps because the game is only six short episodes, the writers were able to cram in a slew of zingers and sassy retorts without needing much filler.   Conversations flip between Lucas and Kiki, as you interact in ways to draw Lucas near while keeping Kiki at arm's length. If you successfully manipulate your friends, you move on to the next episode. Should you end up irritating one or the other, you must try again, using different questions and answers to see if you get desired results.   Between rounds of gabbing, you play a little mini-game -- essentially, whack-a-mole but with Kiki's head. You have a specific number of times that Kiki will poke her head out of nine coffee cups. You have to bean her more than 18 times to win the mini-game, resulting in some cheeky dating advice from Erica. You cannot strike Lucas' noggin more than three times, but if you can nick a randomly appearing clock, time slows down, making it easier to hit Kiki in the face.   Love Triangle Dating Challenge's artist -- which I regret not knowing and will fill in here as soon as I find out -- has designed some great character art for the game. The three leads have varied facial expressions to go with their different phrasings. The game has a cute little theme.Love Triangle Dating Challenge is pure fluff. You can breeze through it in just a few gaming sessions, but the game has replay value for those the get off on its goofiness and sass. Like I mentioned, it's a total guilty pleasure that will not be appreciated by all. But if you're in the mood for something silly and off-beat, Love Triangle Dating Challenge cannot be missed.", "date": "Jul 26, 2005"}