{"name": "The X-Files: The Lion's Den", "name_review": "The X-Files: The Lion's Den", "ref": "https://www.ign.com/articles/2005/08/02/the-x-files-the-lions-den", "text": "doesn?t star Fox Mulder or Dana Scully. That alone should be enough to keep the faithful away from this second licensed offering from Infospace, but if you're still drawn in by the presence of that big ~X~ alone, I implore you to read on in hopes you'll avoid wasting your money on this bizarro licensed dog.Instead of playing as either Mulder or Scully -- which would, you know make sense -- you step into the loafers of generically-named Chase Walker. Walker is a former employee of a bio-tech company called GeneLoft (hey now) that has it's hands dirty with some very unpleasant murders and a sinister conspiracy lingering in the background. Clues and details about this plot can be uncovered by accessing computers throughout the company headquarters, and then emailed back to Mulder and Scully for analysis.(So, technically they are in the game.)Whereas The X-Files: The Deserter was a command-driven adventure game, The X-Files: The Lion's Den is more of an action-puzzler. Viewed from an isometric angle, you must guide Walker through a series of rooms with simple and predictable puzzle challenges, such as avoiding laser beams and scarfing up key cards to get through doors. These are tired concepts made even more tired by the drab surroundings. GeneLoft could have used a visit from the Fab Five, for sure.The X-Files: The Lion's Den does feature a few action elements, but thanks to some wonky mechanics, they fizzle out before they even get started. Walker has three speeds -- normal, fast, and stealth -- but rarely do you really need to use any combination of these to escape from the GeneLoft security squad. They are essentially paid lemmings, and they will walk right into walls if you manage to get one between you and them. It's almost kind of funny to watch a guard walk dead into a wall, unable to figure out for himself that if he started walking to the side, he could rejoin the chase.As mentioned, the game is not exactly a looker. While the presentation is certainly clean, it rarely gives the gamer to feeling of playing an ~X-Files~ adventure. This almost feels more like a generic action-puzzle game that somebody in a marketing meeting just decided to slap with a license in hopes of moving a few more downloads.The X-Files: The Lion's Den should not only be avoided by fans, but by all mobile gamers. The generic nature of the game is a total let-down considering the presence of the valuable ~X-Files~ license. If gamers are in search of a good isometric action-puzzler, may I recommend THQ Wireless' Sphinx and the Cursed Mummy instead? That game has everything this game does not -- atmosphere, good control, and strong play mechanics.", "date": "Aug 2, 2005"}