{"name": "Salvo!", "name_review": "Salvo!", "ref": "https://www.ign.com/articles/2005/08/02/salvo", "text": "Spruegames is unique among the development community in that 80% of its staff are either cats or dogs. I'm not passing judgment or anything; I just think it's interesting. That a team of six cats, two dogs, and two humans would produce a game about sailing ships seems pretty remarkable. But while the phenomenon of the game's creation is pretty spectacular, the game itself leaves a bit to be desired.  Salvo! is a turn-based game of sailing ship combat. The action plays out in 5-minute turns on a hex-based map. Each turn, you'll need to maneuver your ships, fire your cannons, perform grapple and boarding actions, balance your crew assignments, and generally try to avoid being sunk. In addition to fighting single-ship and fleet engagements, players will also need to lead their forces to capture victory flags floating in the ocean.  First, the good stuff: The game comes with numerous campaigns and individual battles. Players can lead the navies of all the great powers of the Age of Sail: England, France, Spain, Holland and America. The game also includes the option to play as a variety of pirates and privateers, like Blackbeard or the Barbary Coast pirates. There are a wide range of locations and conditions for each battle too, from the shallows around the Barbary Coast to the fog-heavy North Sea to the clear waters of the Great Lakes.  I would have liked an editor or battle generator to set up some of my favorite conflicts but the dozen or so battles and dozen or so campaigns should satisfy even the most ardent naval wargamer. The campaigns are fairly dynamic as well, meaning that you can get plenty of enjoyment out of playing them again. Choosing the site of your next engagement and determining how to integrate captured ships into your own navy adds a bit of variety to each new mission.  While there are some elements that are purely abstracted, the game seems very accurate and puts a lot of the decisions and details right up front. To begin with, there are a number of different ship types represented here, each of which seems to have fairly realistic performance characteristics. Ships-of-the-line, merchantmen, fire ships, schooners and a host of other ship types represent nearly the full range of wooden ship warfare. Guns, crew complements, technological advantages and a host of other characteristics make each ship unique.   The actual tactics and battle resolution seems pretty commendable as well. While the hex-based format of the game doesn't allow for lots of fancy maneuvering or optimal tacking, getting a positional advantage is key here. The enemy ships seem to know just how to get you in the arc of their guns without exposing themselves to your fire as well. Mastering this, along with knowing which shot type to use on your enemy, is probably the biggest challenge in the game. Thankfully, the firing is taken care of automatically; all you'll need to do is get your ship within range and the AI will take care of the guns for you.  Once you get the concepts of maneuvering and firing under your belt, you'll be ready to try to grapple with an enemy ship and board her. Once you get in range, a basic grapple icon appears. Simply click on it to attempt to grapple. Once ships are grappled, you can send over any crew you've assigned to be part of a boarding party. These crew can be made up of marines, armed sailors and regular crew. You'll set the proportions yourself, always being careful to ensure that you'll have the advantage over your enemy while still retaining enough crew on board your own ship to keep things running.  Issuing most commands is relatively easy. Simply select a ship and a number of arrows will appear around it, indicating where you can move on that turn. If you've got a number of ships under your command, you can even group them into squadrons that can be commanded as one. A system of position flags and waypoints lets you move these large squadrons into specific areas with as few clicks of the mouse as possible.  The overall battle map provides a nice top-down view of the action and allows you to plot waypoints and stations much more accurately than you usually can on the actual game screen. Unfortunately, the battle map is a pretty lifeless affair that doesn't even allow you to zoom in to fine tune your orders. Trying to select and maneuver ships on the screen can be a real hassle sometimes. The game often deselects the squadron you're directing for no apparent reason at all.  The ship models are the best looking part of the game. They're generally accurate and have some subtle animations that help them from looking static. A few small visual touches can indicate damage state as well. Sadly, compared to more recent games like Pirates! or Imperial Glory, Salvo! comes up short in the area of graphics. Salvo! even has a hard time competing with the four-year-old Age of Sail II in the looks department.  The smoke from cannon volleys are rendered as indistinct blobs and the water texture looks more like it's covered in scales than in waves. It's nice to see that ships and land features are reflected in the water but if you look really closely you'll notice that the ship reflections are all the same and don't necessarily look like the ship they're supposed to.  The sound is very thin in this game. The only thing punctuating the ambient ocean sounds is the muffled thud of cannon fire. While sound is pretty low on the list of priorities for most wargamers, the sounds in Salvo! just don't seem convincing enough to add any weight to the battles at all.  A hotseat mode could extend the life of this game somewhat but, unfortunately, there are no multiplayer options here.Salvo! has some value to gamers who are desperate for a wooden ship wargame. The overall combat modeling and the breadth of the campaign will definitely satisfy. Unfortunately, the lackluster graphics and sometimes awkward interface will frustrate their enjoyment of the game. These gamers will be satisfied in proportion to their patience and love of the setting. Gamers who are merely lukewarm on the subject or those who expect a more stylish presentation won't be won over by the depth of the game's combat.There aren't too many games that simulate this type of combat, so you pretty much have to take what you can get. Still, for forty bucks I expected a few more bells and whistles.", "date": "Aug 2, 2005"}