{"name": "Outlaw Tennis", "name_review": "Outlaw Tennis", "ref": "https://www.ign.com/articles/2005/08/03/outlaw-tennis-2", "text": "The Outlaw series is known for its rowdy approach to commonplace sports. They've already skewered golf and volleyball so I suppose the next logical step was tennis. The sport that was born in the royal courts of France is now served up to the masses by a cast of strippers, convicts, and other politically incorrect stereo-types. While the game is big on presentation, it also puts a new spin on the rules and throws in some creative mini-games. Unfortunately, Outlaw's humor falls flat and the gameplay doesn't quite match up to the competition.    It's difficult for me to play a tennis game without comparing it to the all-time great Virtua Tennis on Dreamcast. The SEGA game combined excellent animations with a lot of help from the AI to create a realistic looking game that played as easy as pie. Outlaw Tennis is a much deeper game that takes into account spin, positioning, a power meter, and of course the option to hop the net and literally beat your opponent in the face.    Each of the face buttons is mapped to a different style of shot including a slice, lob, top spin and a flat shot. The shoulder buttons are used to activate extra spin and turbo when the option is available. In order to get the jump on the AI, players will need to vary their shots. Simply hitting a flat ball to the far sides of the court will hardly ever be enough to trick an opponent. On the medium setting, players will be forced to use drop shots, turbo boosts, and set up their shots with precision. Depth doesn't directly translate into fun in this case but the variety is appreciated.    Actually hitting the ball requires more skill than just running in the direction of the volley and hitting a button. Where the ball is in relation to the player results in a different type of hit. Anyone who's picked up a racket knows that lining up a decent shot means getting into position early. Centering a player in front of the ball will result in a dinky return, but setting up for a forehand will give the shot more power and control. A lot of this system is based on feeling and can only be learned through a few hours of practice. Even then, the computer's actions don't always feel fair or matched to what a human player is capable of.    To even the odds, players will have to use advanced tactics like turbo shots and fighting. Each player is given a small red meter that indicates the amount of boost they are able to use in each match. Hitting the boost meter when perfectly setting up a shot results in an explosive hit that is almost impossible to return. Serving is handled by a circular meter that fills up and quickly drops to zero by holding down one of the face buttons. Using the turbo in conjunction with a fully powered up serve also causes players to smash the ball over the net. These super hits can be returned, but the AI rarely makes the save. Fighting is handled through an incredibly simple button mashing system that is available when players collect tokens. Winning the battle (hitting the face buttons) results in 30 seconds of free turbo.     There are also a number of drills (mini-games) that allow players to bump up the stats of their tour character. The game opens with four available players who have different skill levels in serve, accuracy, power, speed, control, and endurance. The drills themselves are some of the most fun parts of the game, and unlocking all 20 of them can be reason enough to progress through the game.    The meat of Outlaw tennis is Tour Mode where players are pit against every character in the game over the course of 80 events. This is a whole lot of tennis, and fortunately Outlaw mixes up the rules enough to make sure each match is a little different than the last. Game types include clever variations on baseball, football, pinball, and ping pong. My personal favorite is tennis pinball where different bumpers appear on the court and the server has to aim their shots to win points.      These game types are just the tip of the ice berg when considering all of the wacky variables Outlaw throws onto the court. Matches can be given a time limit, bombs can be planted, the weather can shift, and a moving glass shot blocker can be set to slide back and forth across the net. Also, at the beginning of the match, the line judge will offer up challenges that can be completed to win stretches of unlimited turbo. All of these settings can be turned on or off for exhibition matches or multiplayer matches, but you'll have to face a good bit of wackiness in the tour mode.   The hook of any Outlaw game is the raunchy presentation and the ~humor~ that is forced into every aspect of the game. Former announcer Steve Carrel has been replaced with another member of the Daily Show, Steven Colbert. Fans of the comedian will enjoy his delivery but the writing is abysmal and almost every joke falls flat. The wacky cast is comprised of stereotypes and miscreants that rely on foul (but not too foul) language and slapstick gags. It's not that I disapprove of low brow humor, I like a good fart joke as much as the next guy, but Outlaw meanders between crass and tame to end up as just plain boring. The women are scantily clad and take every opportunity to shake what their character designer gave'em. If you're on the fence about purchasing a passable sports game but enjoy gratuitous displays of cleavage and thongs then run, don't walk, to your nearest retail outlet.    Jokes are delivered as short skits between points and the ones that do result in a giggle are hardly ever funny the second time around. The reactions can be turned off from the start menu and the announcer can be switched off, but this sort of defeats the purpose of the game.    The player models and animations in Outlaw Tennis are as realistic as they need to be in a humorous send-up. This is especially apparent with the sultry females and when characters duke it out during the cut scenes. Explosions and turbo hits result in some eye catching, if not overly impressive, special effects and the different court settings add some spice to the visuals.    The audio is thoroughly average, which is actually a huge compliment considering the cast of unknowns used for the soundtrack. Voice-over work is competent if you ignore the fact that it's not funny, and the game supports in-game Dolby Digital.    Outlaws Unite  The online element of Outlaw Tennis feels almost exactly like the offline portion, meaning we didn't run into any slowdown or hiccups during our time on Xbox Live. Taking on human opponents is more enjoyable than the AI because they're a bit more predictable and none of their actions feel cheap. There are rankings and stats available online, but no tournaments, which is a shame considering they are a basic component of competitive tennis.     Online doubles is an option, but only against another set of doubles and all players have to be signed onto Live. Offline, up to four players can get in on the action in doubles matches, so chalk this title up as a possible party game. Co-op is also available in Tour doubles matches in case you need some help beyond what the AI can offer. The multiplayer options in Outlaw Tennis are enhanced by the various gameplay options available in the single player game. With all of the different modes and crazy rules gamers are sure to find a combination they fancy.The humor in Outlaw Tennis evokes the uncomfortable feeling of watching a rookie comedian bomb in front of a large crowd. Fortunately the gameplay and plethora of options combine to make for a fairly competent sports title.", "date": "Aug 3, 2005"}