{"name": "Ghost Recon 2 Summit Strike", "name_review": "Ghost Recon 2 Summit Strike", "ref": "https://www.ign.com/articles/2005/08/03/ghost-recon-2-summit-strike", "text": "Roughly eight months after Ghost Recon 2 appeared on Xbox last fall, developer Red Storm has fashioned a ~sequel~ that satisfies in every possible way. A standalone expansion packed to the gills with new maps, skins, online games and extras, Ghost Recon 2 Summit Strike is one of those titles that gets overlooked because it's considered an ~expansion.~ Yet, the lengthy single-player campaign, combined with 24 online maps and a healthy fanbase of Xbox Live players to support it, means the $29.99 price tag makes this the perfect summer steal.   Presentation  For all intents and purposes, Ghost Recon 2 Summit Strike is exactly the same game as Ghost Recon 2, with a new single-player campaign and more online maps. The single-player campaign is nonetheless robust. There are 11 single-player missions, all of which feature the ability to replay them in Lone Wolf mode or in co-op with a friend.   The addition of new online maps is valuable in itself because they're wide open, created with strategic placement of trees, rocks, barracks, and a healthy infusion of urban settings to make things interesting. They're also heavily tested and well designed, rendering them excellent for online play. The additional gameplay modes, such as Helo-Hunt and Las-Tag and some minimally tweaked AI, are just a few of the reasons to lay down the easy $29.99.   In typical Tom Clancy fashion, the story is a basic military slog, i.e. not terribly inventive or engaging. Having moved from Korea in Ghost Recon 2 to Kazakhstan, your team of ghosts and you must move into the dazed and confused country of Kazakhstan. The Kazakh president was assassinated by a Pakistani warlord attempting to take control of the country, and your ghost team, in conjunction with U.N. forces, must track him down and restore order before the vacuum of power is filled by the insurgency. Your first guide is Gregory Kazlov, who feeds you intelligence to better attack the rogue enemies, and your missions range from countryside tracking to sniping in snowy mountains to urban assaults.   New helo-hunt modes break up the slow-paced action. Like its predecessor, Ghost Recon 2, however, the setup and presentation are top-notch. You watch as the team is presented with information on a laptop computer screen and a mouse cursor pinpoints insertion points, danger areas, and extraction points using surveillance maps, ~live~ footage, and ~snapshot~ images of your enemies. Your team leader vocally explains the mission and, as the game progresses, the HQ commander comments in ways that add conflict, doubt, and challenge. Each successful mission is followed up with a military closure, stats, and the ability to replay or continue. The overall presentation is very slick.   Ghost Attack  The missions themselves are a healthy mix of firefights, defenses, lone wolf missions, Helo hunts, and reconnaissance scenarios. Again -- similar to Ghost Recon 2 proper. You'll enter into one, and along the way HQ will radio in additional on-the-fly objectives that aim you across the map in different ways. So you'll use the whole map, each time crossing it for varied purposes and heading into enemy territory with AI appearing in new places.   Like in Ghost Recon 2, you control yourself and command a team of ghosts. You can tell them to stay put, attack, and flank left or right. The key additions to the AI in GR2 are intact in Summit Strike. You can command ghosts to provide first aid (bringing squad members to half health), mimic your stance (crouch, lie down, stand), or use weapons such as bazookas to level enemy tanks and jeeps. Ghost AI will die after about three hits, though only for that level (they magically return in the next mission). But your team AI is smart enough. If you command the squad to hold, it won't blow your cover (though if you travel too far, it will irritatingly return to your side). If you command it to attack, it will generally use the environment to its benefit, slaying enemies without taking too much damage. It's better than most the squad AI in other games -- it generally doesn't get in the way, it can aim and kill well, and in general, it makes a difference -- and for that I'm thankful.     Enemy AI also displays better than average, sometimes even quite good, behavior. Enemy soldiers on Normal Mode take cover, drop to their chests, hide behind trees, and are generally relentless in their response and attack patterns. They can hide for long periods of time, and if outnumbered, they'll take off. If you stay in one spot too long, they'll flank in numbers. On the other difficulty setting, Hard Mode, one shot kills are regular events. This mode is tough and especially good fun for seasoned vets.   All of your actions -- head shots, enemies killed, teammates survived or killed -- add into a point tally. With those points, you can unlock special bonuses. These range across the board from interesting to total fluff, as they're almost all fan-type additions. Want to see a really low-res video of the Red Storm office? It's not really worth the points, even if it's mildly entertaining. What to see what a future military warrior looks like -- what kinds of weapons he uses (like the SOF Combat Assault Rifle), or his headset, gear, and outfit? Your points will buy this kind of fluff/stuff.   Online Play  Following Ubisoft's stellar and consistent dedication to Xbox Live, Summit Strike offers a superb quantity of gameplay modes, a good lobby interface, generally quick load times, and, thanks to a squadron of diehard fans, regular online activity. While the addition of new maps might have satisfied most gamers, Red Storm went to town with unfinished maps unused in Ghost Recon 2 and bolstered that tally to 24 multiplayer maps and dozens of multiplayer modes.   With all those multiplayer maps, including a handful of new, more open designs, and 24 multiplayer game modes including the ever-favorite squad, solo, and co-op game types, ghost fans are in for a Kazakhstani field day. The multiplayer maps feature both rural and urban landscapes, as well as some maps from previous games in the series. The wide scope of maps provides a wealth of long-time online play. There are smaller, closer environments best used for King of the Hill type modes. A few good Helo-Hunt maps provide tense, action-packed experiences, and several maps featuring broken down buildings, houses, and huts that are prime for sniping, hunting, and tracking. Our half-day of online testing proved great fun with the right people.   The greatest explosions ever? If not, they're damn close. Sound and Vision  Red Storm's standalone expansion provides the beauty and finish that made Ghost Recon 2 so beautiful in its fall 2004 debut. Using the same engine, the developer has polished the levels with exceptional long-range vistas sans pop-in, a healthy employment of Bloom Lighting, excellent character animations, and great model detail. And Summit Strike delivers some of the best explosions this side of Kazakhstan. The game is slim in storyline, yet its snappy presentation makes up for it.    Aurally, Summit Strike holds firm to the Ghost Recon formula of fancy, clashing guitars and overly dramatic action-packed music in the cutscenes, while in-game, the crisp sound of firing guns, clanking gear, and exploding helicopters makes a convincing stand. The dialog is militaristic in nature, and while you'll have to listen to catch all the on-the-fly objective updates, a pull-up map always displays your new goals.   The only snafus I caught in the sound production department were the overly loud congratulations from your teammates while shooting enemies. While tracking enemies in complete silence, you'll hear ~GREAT SHOT, SIR!!!!~ when you nail an enemy with a headshot; sometimes from even two ghosts at once. This is the farthest thing from what's likely to happen in real life. While it's nice to hear the chatter, yelling ~GREAT SHOT, SIR!!!!~ probably could have been toned down from volume #11 to oh, maybe #3?I'll admit that Ghost Recon isn't the kind of game I'd rush out and buy myself. I have played the game in its various renditions for review, but it's just not my thing. Why? I like a little faster action, more dynamic situations, more speed. But after having spent the entire night slogging though the 11 missions here, I've realized the series' attraction. The gameplay is deliberate, methodical, and realistic. Red Storm's attention to militaristic detail -- from your character's heavy breathing and the clank and clatter of gear while you run, to the simple animations of switching from a rifle to a bazooka -- is convincing. The wide open fields, mountain with numerous trails, and the multi-path urban centers, all provide that mix of choice and danger. The large landscapes offer the freedom to take any direction, but the terrain is filled with enemy squads that are quick to drop, find cover, and scramble away to fight again some other day. The whole thing smacks of the ritual and methodical nature of militaristic practices. It's got it own kind of brilliance that I've come to admire and respect. It's the kind of game that grows on you, and along with GR2, it's entirely different than anything else on Xbox.", "date": "Aug 3, 2005"}