{"name": "Zelda: Ocarina of Time", "name_review": "The Legend of Zelda: Ocarina of Time Review", "ref": "https://www.ign.com/articles/1998/11/26/the-legend-of-zelda-ocarina-of-time-review", "text": "The new benchmark for interactive entertainment has arrived. The Legend of Zelda: Ocarina of Time, the fifth official installment in Nintendo's popular action adventure series is finally here, and like its NES predecessor in 1987 it is a game so enjoyable, it has the power to pull videogame players into its imaginative worlds -- and refuse to let go for days. Call us crazy, but when the final version of Zelda 64 arrived in the IGN64 offices, we stopped working, locked ourselves into a room with a big-screen TV and a surround system and played 17 hours straight. After only a few hours of sleep, we were back for more and we couldn't stop until we finished the game. Then, we started over again to find all the secrets.LoadingPlayRarely is there such a perfect mixture of graphics, sound, and gameplay that even the most cynical players will admit that Zelda 64 is poised to shape the action RPG genre for years to come.GameplayLike all games in the Zelda series, Ocarina of Time follows the adventures of a young boy named Link. After a nightmare involving a certain young princess and the evil thief Ganondorf (who eventually turns into the horned creature known as Ganon), the elven boy wakes up in his home village tucked away behind the mysterious Lost Woods. The only Kokiri without a fairy, Link soon meets up with his new traveling companion, the winged Navi, and sets out on the adventure of his life. The quest, which inevitably turns into a rescue mission for Princess Zelda, leads players through dark dungeons, picturesque villages, into the heart of a volcano, to the bottom of a lake, through a haunted desert, deep into a magical forest, into a giant tree, the belly of a beast, and even through time. To say that this game is huge is an understatement. Every time you discover a new corner of the Kingdom of Hyrule, you'll be amazed at the detail, the richness of scenery, the many things to do, and the amount of thought that went into designing it all. For example, players can spend hours just exploring a village, talking to the inhabitants, solving puzzles, and looking for hidden items.As soon as you pick up the controls for the first time and start to explore the vast universe that makes up this latest creation from the hands of Shigeru Miyamoto and team, you know you're in for a treat. At first, the control is very reminiscent of Super Mario 64, the game that single-handedly invented 3D platformers as we know them. But Ocarina of Time is not a platformer, a fact that takes some getting used to when trying out Link's various actions. There is no jump button. You can still jump at certain points in the game, but it is not integral to the gameplay that players actually control the jump themselves. Instead, Ocarina of Time introduces an auto-jump feature where Link will jump the last possible moment when running toward a ledge. It sounds annoying in theory, but it works very well for this type of game.LoadingPlayThe gameplay objectives will be instantly familiar to friends of the series. Push walls to find hidden rooms, use bombs to uncover secret passages, shoot arrows at certain objects to open doors, and so on. But Ocarina of Time doesn't only imitate its predecessors, it innovates at every corner. With the use of the ocarina (a clay flute), players need to play certain melodies to solve riddles or warp to new places, and even engage in numerous games of ~Simon Says~. When you bring out the ocarina, the controller's button layout actually mirrors a real ocarina, with the Z button acting as the bottom hole on the flute. To allow for a little more fun, the designers also added a pitch bend and modulation option via the analog stick. Compare Zelda 64 to other titles and you will find that even one single dungeon has more puzzles than all the levels in many other games combined.Things really take off once Ocarina of Time introduces the ability to travel back and forth in time (very much like light world/dark world gameplay). Without giving too much away, consider this one: at one point in the game, you talk to a character as adolescent Link, who tells you that a young boy with an ocarina did something seven years ago. Then you go back in time and actually do it. Or how about a fully functional fishing game, with Rumble Pak support and realistic fish behavior? This mini-game is so good, any other company would have released it as a game of its own. Then there is the ability to ride a horse -- it's so addictive, you'll catch yourself just galloping around and jumping fences. Or how about involving sword fights with a multitude of enemies that block your attacks with their shields? A shooting gallery? A super-cool hookshot that lets you traverse deep ravines? Secrets involving the use of sunlight and mirrors? Want to light some torches? How about catching the spirit of a slain ghost in a bottle? Changing daylight and weather conditions that affect the gameplay? The ability to wear different masks? Rumble Pak vibrations that give away the locations of hidden caves? It's all there. Oh, and let's not forget about teasing chickens... No matter which way you look at it, Ocarina of Time is simply unmatched when it comes to the variety and diversity of actions and puzzles. Do yourself a favor and play this game without the use of a guide! It's a lot more rewarding when you finally get your hands on something that you've been looking for for days than to read about it in a guide.LoadingPlayThe camera follows Link in a style similar to Mario 64. Like in Mario, the camera also zooms out to reveal Link's surroundings at times -- but that's where the similarities end. In order to give players more control over the viewpoint and enable better, more focused 3D fighting, Nintendo reached deep into its bag of tricks and came up with an innovative feature. First of all, tapping the Z button will force the camera behind Link, no matter where you are. Incredibly, clipping is kept to a minimum and the camera logic almost always guarantees a good view of the action. But there is more.When you see a character or an object that interests you or you're being attacked by an enemy, press the Z trigger. This will bring up a rotating yellow cursor that locks onto your target. Now, as long as you don't press the Z button again (or turn away to break your lock), the camera will stay on your target, retaining its over the shoulder position. This allows you to circle your enemies and slash at them while side-stepping, back-flipping and shielding yourself from the onslaught. While you are locking on to a target, the screen will become slightly letterboxed to let you know that the target mode is active. To additionally help you keep track of your attackers, your fairy Navi will hover over the target's head. There is also an alternate camera setting that requires you to hold down the Z button to keep a lock, but your fingers will probably get tired after a while. Needless to say that the Z button feature works impressively well and is sure to find its way into future 3D games. Ingenious.The upper C button will let you either switch to an alternate camera angle (inside houses or towns), or zooms in to let you look around.The attack system is equally impressive. Pressing B will make Link draw his sword. Press it again to slash at your enemy once. Press it three times to swing the blade from the bottom to the top. Press forward and B to slash downward. Turn the 3D Stick in a circle to do a roundhouse slash. And once you found the proper ~power-up~, press and hold B to charge your sword and make it glow, then unleash a nice helicopter slash that's sure to turn any stinking skeleton into a heap of bones. Similar controls are available for the other items, which can be distributed over any of the lower three C buttons. Press the corresponding key once to draw the weapon or item, then press it again to attack. For the projectile weapons (such as the bow or the boomerang), the designers also added an optional first-person perspective, kind of like the sniper mode in GoldenEye.LoadingPlayBut the crowning feature is the context sensitive A button. If you stand close to a ladder, the A button display at the top of the screen will change to climb or descend, if you run around freely, it will change to jump, stand next to a sign and it turns into read, and so on. Simply pressing the button will activate the function. Some of the available functions include open, pull, push, dive, check, talk and crawl. This A button feature is Nintendo's way to keep things simple and to deal with the limited selection of buttons on a standard console controller. Once in a while, the automatic selection will cause you to do something you weren't trying to, but 99% of the time it works perfectly fine.Once you get used to the radically different camera system and button control, navigating the environments and fighting against enemies becomes second nature. Many of the problems that plagued Mario 64 in the camera and control department are a thing of the past, and there is virtually nothing that distracts from Zelda 64's immersive gameplay. Being able to explore the wide environments, climb hills, fight monsters, pick up and use items and discover new areas becomes second nature fairly quickly and soon you will feel right at home Hyrule. Add to that an interesting quest, tons of mini-games, hidden items (how about a two-fisted sword that doesn't break?) and enemies (100 hidden spiders, anyone?) and a compelling storyline with plenty of time travelling. Sure, you can probably blast through the title in around 30 hours, but it's easy to see why some gamers are spending in excess of 80 hours to complete the title.There is absolutely no question about it. Ocarina of Time is the best game on the N64 and we can't think of any game that we'd rather play on any other system.Data ManagementThe Zelda 64 cartridge, which is also available in a limited gold edition, comes with a built-in EEPROM that lets you save three different files on the cart. There is no need for a separate memory pak.GraphicsRemember how impressive it was when you jumped around in the 3D environments of Super Mario 64 for the first time back in 1996? With Zelda 64, Nintendo is raising the stakes considerably. Once you step into the Hyrule fields, blinded by the early morning sun, you will be mesmerized by the incredible scale and depth of the landscapes. Rolling hills extend all the way to the far horizon, with Hyrule Castle barely visible in the hazy distance. After a few minutes, the sun will set, it will get dark, and the moon slowly rises in the sky. Far, far away, a wolf howls and skeletons with red glowing eyes ascend from the earth.LoadingPlayThe graphics are incredible. Whereas Nintendo concentrated on framerate and speed with F-Zero X, Zelda 64 is all about detail and visibility. There is no fog. The towns are highly detailed with elaborate wall textures that are directly affected by Link's glowing fairy, Navi, and the beautiful day/night changes. Characters animate fluidly and display several different expressions on their faces. While the framerate and texture design is not always up to par with Rare's Banjo-Kazooie (the blurry marketplace scene comes to mind), the polygonal environments, colors, and visibility are the best yet seen on the system.In addition to the many wonderfully designed enemy characters roaming the dungeons and levels, Zelda 64 also pushes the limits of the console with oversized bosses. If you heard a loud thud on Monday, November 23, then it was our jaws hitting the floor when we first laid eyes on Ganon. Stick with this title and you will see temples and dungeons that seem to have jumped right out of an Indiana Jones movie. Add to that minutes of real-time rendered cutscenes that shape the story and you have one of the best looking console games ever made.SoundKoji Kondo returns to deliver a whole songbook full of marvelous melodies. Some of the eerie dungeon tunes recall the work of minimalist composer Phillip Glass, others are vintage Kondo with sweeping string sounds and melancholic guitar picks. Unfortunately, there are a few stinkers with annoyingly dated synth samples (it's time to update your libraries, Nintendo!) and the legendary Zelda Overworld theme is NOT in the game. Boo! Luckily, there are plenty of returning melodies, such as the Adagio in Kakariko town and familiar ocarina tunes. But what really makes this game are the sound effects. Every location has a multitude of ambient noises, from the clanking of a windmill, the subtle trickling of water to the howling of the wind. The sound effects are brilliant. Depending on what you hit with your sword, you hear a cool metal clank, the bow and arrow are as convincing as the real thing, and the screams of the Dodongo are downright scary. The overworld is alive with bird calls, chirping crickets, animal noises and footsteps. In certain locations, thunder can be heard and it will start to rain -- and here's the kicker: the game is in full surround sound. Zelda is probably the first in-house developed Nintendo title that makes examplary use of the rear audio channel in addition to the L and R stereo channels. The sound virtually engulfs the player, drawing you completely into the world of Hyrule. A world, that players will be so content to live in while the game lasts that we can't put it any other way -- Zelda succeeds on every level.Flawless victory.I have to confess that I'm a long time fan of the Zelda series. Ever since Link to the Past, I have been waiting for another adventure with the same sense of freedom and interactivity. Although games like Final Fantasy, Secret of Mana, and Metroid filled the void, I had to wait six years for Zelda's jump to a next generation console. The wait was very well worth it. Ocarina of Time is easily the best in the series. Sure, the game has a couple of little flaws (the annoying Navi ~hey~ messages, for example) -- but unlike the hundreds and hundreds of uninspired gaming sequels that find their way into console and PC owners' homes every year, Ocarina of Time takes some basic gameplay and story ideas from its predecessors and rolls them into a completely unique experience. I don't know how many games I have played in my life where you see some cool scenery in the background and you're thinking ~wow, wouldn't it be great if you could actually go there?~ That's what Zelda is all about. You see something and you're thinking ~wouldn't it be cool if you could...~ -- and you can. The fighting system is fantastic, the new camera system unlike anything you have ever seen. Apart from a little slowdown and a few blurry textures here and there, the graphics are insanely beautiful. The sunsets and rain sequences, the projectile and smoke effects, everything is displayed in vibrant colors and with much attention to detail. Although the lack of the overworld theme is a bummer, the many returning Zelda melodies (such as the glissando announcing a secret or the fanfare when finding an item) and the moody dungeon scores are only outdone by the amazing surround ambient effects.In the gameplay department, the gap between Nintendo's in-house development and third party titles becomes painfully clear. The Legend of Zelda: Ocarina of Time should be recommended playing for ever aspiring videogame designer and programmer out there. If you're making games and you haven't played this game, then you're like a director who has never seen Citizen Kane or a musician who has never heard of Mozart. If you're a gamer looking for your next title to buy, then take it from me, this is as good as it's going to get for a looooong time.A break-through title from Nintendo that deserves all the hype and praise it's gotten. The limited gold edition is just the icing on the cake. My highest possible recommendation.", "date": "Nov 26, 1998"}