{"name": "Dodgeball: A True Underdog Story", "name_review": "Dodgeball: A True Underdog Story", "ref": "https://www.ign.com/articles/2005/08/06/dodgeball-a-true-underdog-story", "text": "Some mobile game based on movies have an itty-bitty window of opportunity for cashing in the source material. Once a theatrical run is over -- even if the movie is a blockbuster -- and the wireless game attached to it kinda fades into the digital ether. However, not all movies are created equal, and there is a vitality to ~Dodgeball~ that continues to this day.   Knockabout games and Superscape correctly identified this longevity and set about creating a game that would interest the movie's cult audience, but without having to shell out minor fortunes for likeness rights. The result, Dodgeball: A True Underdog Story, is a pleasing top-down action-sports game with about as much depth as the movie its based on, but enough going on to keep you interested for longer than you probably should be.   You control the team Average Joes, which was headed up by Vince Vaughn's character. You can either enter practice games, challenge rounds, and a full tournament to eventually unseat the favored team, Globo Gym. Unfortunately, Ben Stiller's delusional beefcake is nowhere to be found. Several of the teams that participate in the tournament are straight out of the movie, like the Clown Punchers and the Lumberjacks. Little touches like that show that somebody over at Knockabout actually cared.   The game follows the rules defined by the movie, save for a little minor tweaking. Two teams of ballers stand across from each other on a court. You control one of the ballers, rushing around and grabbing balls from the ground so you can hurl them across the line at the other players. If you are hit three times, you are out and you control a different player on your team. The game goes until you knock out the four players on the other team. Now, if you catch a ball thrown at you, one of your benched team mates can return to play.   Having a full team pays off, because if you are holding a ball and you walk over another one, you are linked up with another player, side-by-side. You can continue doing this until you stand in a four-man chain. Pressing the throw button will make all four hurl their balls across the court, and it's pretty tough for an opponent to effective dodge, duck, dip, dive, and dodge such an onslaught. Each team also has unique throws, akin to special moves.   The game plays quite well. Control is clean and simple -- moving your players around the court is easy and on the LG VX8000 I used for testing, the timing of throwing and grabbing balls was right on. As mentioned, this is something of a shallow game, but it doesn't promise to be anything more than a basic dodgeball game with a few whistles.Dodgeball is a good alternative to other sports games on the decks. If you just don't want to wrap your thumbs around football or baseball, something a little more streamlined like Dodgeball might be your proverbial bag of chips. Be warned that there's just not much depth, but what do you expect from a digital dodgeball game, though? The presentation is smart (if not a little basic) and it delivers on the promise of the source material. Recommended.", "date": "Aug 6, 2005"}