{"name": "NASCAR Challenge", "name_review": "NASCAR Challenge", "ref": "https://www.ign.com/articles/2000/01/05/nascar-challenge-2", "text": "You know, I've always been wary of licensed games for the Game Boy  and Nascar Challenge is perfect justification for my stance. Here we have a generic game in every sense of the word  right down to the unnecessary use of the NASCAR license. And the game isn't very good, either. In fact, it's downright lousy. Features  Three licensed tracks Arcade-based Rumble cartridge Only for Game Boy Color   Okay, so you got the Nascar license, right? What are you going to do with it...get the drivers? Get the cars? The tracks? Strike two out of the three. That's right. Of all the things Majesco could have done with the game, the only Nascar use is including three tracks from the Nascar circuit: Topeka, Sonoma, and Seneca. And even here, the only way you're going to know these are based on the real deal is by the shape. There are no real-life landmarks that indicate otherwise.  So what's left? Not much. The game only has two options: Race and Practice. Practice lets you on any of the tracks by yourself, and Race puts you on the track with other opponents. And the idea is to get the fastest time, and/or beat the pack. Not much variety here, either.   There's only so many ways to portray racing on the limiting Game Boy Color system, and Majesco went the more ambitious ~behind the car~ perspective  much like Top Gear Pocket or V-Rally. But in Nascar Challenge's case, the graphics engine is so plain and generic that you can't even give the game credit here, either. Cars look like station wagons, and the perspective is all screwed up since the cars get to be your size well before you ever reach them. Trackside objects are nothing more than arrow billboards telling you where the next turn is.   Amazingly, the game is put into the more expensive Rumble cartridge  and even here it's not needed. The system shakes when you go offroad or hit a vehicle, and that's about it. At least the controls are somewhat tight, that's the only thing that the game's got going for it. And if you remember our preview of the game, you might remember the game was supposed to have link-cable support. Well, that feature was pulled, apparently.  If there's any racing game that you should leave up on the shelf, it's Nascar Challenge. I don't know what happened here, but obviously zero time went into actually giving the gamer any sort of variety. This is a straight cash-in for name recognition only. Racing go-karts at the local arcade is more Nascar than this game is.", "date": "Jan 5, 2000"}