{"name": "Big Mutha Truckers 2", "name_review": "Big Mutha Truckers 2: Truck Me Harder", "ref": "https://www.ign.com/articles/2005/08/24/big-mutha-truckers-2-truck-me-harder", "text": "Just in case you weren't aware, THQ's Big Mutha Truckers 2: Truck Me Harder (yes, that's the classy subhead) is a arcade-style truck-driving game. What's it like? How does it play? Is it any fun? All these questions are answered, more or less, by this statement: it's an 18-wheel driving game. What else can truly be said?Well, there is just a little more. Sega-AM 2 started the whole 18-wheel truck driving madness in the arcades about five years ago with a fun, truly arcade-style driving game called 18 Wheeler. The giant arcade unit, big screen, rumbling sound effects and the novelty of it all gelled together in an extraordinary way to provide an inimitable coin-op experience. The silly idea, giant trucks, and bigness of it all were novel then, and Sega made it work in its own special way. But who thought it would last this long?The subtly named Big Mutha Truckers 2: Truck Me Harder recognizes the formula and brands it with a low-class level of humor, swagger, and an ever greater level of personality. It's a game in which raccoon-shooting, whisky-drinking truck drivers, women with enormous boobs, and an infinite quantity of cultural references to society's stereotypes at once repulse yet attract, due to its up-front and shameless appeal.As for actual game, it's barely passable. THQ's less-than-original arcade driver is filled with the kind of obvious timing schemes, fetch-quests, and witless gameplay standards we've all seen before. Yet, it's oddly compelling. For a mindless afternoon when you're feeling non-critical, it's a distraction at best. For 18-wheeling fans, whomever you are, this is more of the same, only more obvious and with more stuff to do.Truck Me Truck Me Truck Me!I have to say, to include the sub-name of this game ~Truck Me Harder~ in an actual open videogame market requires a certain level of gutsiness, a certain quantity of who-the-hells-cares attitude. Honestly, THQ is the last company I'd have thought to do it. So, kudos for being so targeted; the white trash effect is in full effect. if you like to drive trucks, well then... I'll get off the soapbox and into the gameplay. Truck Me Harder is essentially more of the same truck driving mayhem from the original title, with more things to do, a different story, a little more leeway to go about your business, and a whole lot more corny hick, sex, class, and related lowball humor. It essentially consists of all the exact same qualities of the first game with a slew of minor upgrades.The additional layers of gameplay come about in the form of alien attacks, a slew of new sub-missions, a slightly different menu system, more roads, locations, shortcuts, and different kinds of cargo and trucks required to handle said cargo. All of these are decent improvements, though they broaden the game's appeal rather than improve the Southern-fried recipe.The story is punchy yet forgetful. It's not so much an actual narrative as it is a set-up. The big boss, Ma Jackson, has been thrown into jail because of tax evasion. Yet, just like the best Mafioso, she has a cell phone and can direct her troopers to do her bidding while from behind bars. Her simple request is for you to bribe six different jury members so she can win the court case.    That's it. With a gameplan in mind, you pick a character (all of the same knuckleheads from before: Bobbie-Sue, Cletus, Earl, and Rawkus). These selections only affect who you drive as and the look of the truck, not your performance. This game is a simple economic simulator using truck driving as the means of delivery. Each time you bribe a new character, the amount of money increases for the next one, and of course, half the fun is to see what new caricatures you'll possibly be offended or humored by. Slutty biker girl (named Slits)? Check. Siamese country girls? Check? Money-grubbing executive? Check. The idea is to buy goods at one location and sell them in another for a profit. The simulation part comes in when you pick the goods and figure out which town pays the most for them. When selecting goods a helpful visual chart can be opened up to show the differences, and it lists the top bidders. You can flip down the graphic chart quickly just to see the ratios. Overall, it's an efficient menu system. A nice addition would be to show the locations of the towns in addition to the potential profits, so gamers could more easily pick and choose cities.Goods you'll buy range from fancy water, stinky cheese to powerful figs, illegal substances such as dynamite or radioactive chemicals, to top-secret government stuff, each ranging in price. The more illegal, the more costly it gets. Giving gamers the chance to carry more than one illegal item earlier in the game would have been a better idea, since those items are so risky. Plus, the game's level of repetition is great, so risking a lot more would have increased tension and the importance of each mission.While on missions, cops, boulders, aliens, and other random things distract you from the main goal, shifting the focus from ramps, jumps and side-streets to goofy distractions. With the cops, you'll have to evade them while at high speeds, but naturally, you can either out-run or smash them to stay free. While being chased, the game is forgiving when you reach your destination, whether by the pigs or aliens. You'll pick up various characters as part of side quests, such as hobos, who jump on the truck, while other less-than-likeable characters, such as bikers, will jump your truck to steal the goods. Over-the-top sex appeal is as easy to find as twinkies in a 7-11 in Truck Me Harder. The driving part comes in while hauling from hick town to bumpkinville. While driving a truck, the handling for each vehicle varies modestly. The trucks all handle like giant trucks do. They are difficult to turn and park, and even more difficult to back up and take sharp turns. This is the skill part of the game, learning how to drive these trucks well. None, except the super expensive special trucks, move very fast (unless you have a nitro upgrade). If you're a racing fan, they're all clunky and irritating to drive. The trucks and various other cars use a simple control scheme that are very forgiving, and the noticeably floaty physics create a simple, basic level of joy. But if you're looking for racing depth or variation, forget it.Once you've filled up your truck and picked a location, each trip enables you to pick a difficulty level, easy, medium or hard. And each offers an increasingly higher bonus reward if you get from point A to point B in the respectively shorter times. If you make it to the desired location on time, you earn a time bonus and you'll get the option to win a parking bonus (similar to in 18-Wheeler). The bad part of the deal is if you blow the initial race against time. If you fail it, the game gives you a fake option to win the parking bonus. Eutechnyx should have separated the two bonuses.    Personally, Eutechnyx went the easy route on Big Mutha Truckers: Truck Me Harder -- and it shows. The developer should have worked harder on improving physics and handling, creating more interesting side missions, and more dramatic challenges. A much wider variety of truck types -- each with distinct driving characteristics -- would have kept my interesting far better as well. As it is, there are more XXuck-me jokes (which admittedly are fun after a drink or two), more frivolous alien chases, and other simple yet disposable challenges that render this game so very ~meh~ it's hard to describe. Visuals for VarmintsVisually, you get what you pay for. At $19.99, Truck Me Harder delivers all the purposely, tongue-in-cheek comedic characters, dumpy truck-stop towns, and cartoon like visuals and style it can throw at you. The Xbox and PC versions have the visual advantage of the three versions, lacking the PS2's graininess, extra jaggies and over-saturated textures. Still, it's no visual masterpiece, so all versions essentially look the same. Everything is simplified, whittled down to the basics. Special effects, lighting effects, extra detailed background graphics, animations -- they're all on the budget priced production scale. Not bad, but good. Just very $19.99.Skunky SoundsThe audio is less underwhelming. The character voice-overs benefit far more from the robust comedic deliveries than the graphics do from the triple-sized D boobs heaving in your face. You'll sure to enjoy the characters the most, because strangely they're the most interesting parts of this otherwise frivolous game.Despite the resonance of cheesy,  clich-filled dialog that makes you laugh and simultaneously cry, the officially licensed music is appropriate. Bad Company's ~All Right Now~ (From Born to Be Bad) is the perfect title track (although ~Take This Job and Shove It,~ ~Sweet Home Alabama~ or any song from Burt Reynolds' Smokey and Bandit seem just as appropriate), and it especially rocks in this setting. Bring out the Budweiser 20-ozers! You also might recognize songs by Puddle of Mudd, John Fogerty, and Willie Nelson, which fill in the soundtrack with the appropriate color and mood.In case I hadn't left any comments out, THQ's low-budget truck driving game mixes tried-and-true arcade truck driving with a colorful cast of characters, country-flavored humor, and a whole lot of gigantic boobery. It's very light-hearted fun for a very short period of time. It's worth renting if you're just THAT curious. But the additions and changes aren't drastic enough to warrant another purchase. Still, if you're drunk, stupid, and bored out of your mind, and you require an absolutely brain-dead game to pass the time, Truck Me Harder might just be lame enough to fit the bill.", "date": "Aug 24, 2005"}