{"name": "Metal Slug 4 & 5", "name_review": "Metal Slug 4 & 5", "ref": "https://www.ign.com/articles/2005/08/25/metal-slug-4-5", "text": "The question anyone looking to buy this game should be asking themselves is: ~Do I really want to spend $40 on yet another Metal Slug?~ For many, the answer may be a resounding yes. However, if you're teetering back and forth, know the following: both games take around an hour to beat regardless of your skill level.   Both Metal Slug 4 and 5 grant the player an infinite number of continues. Although this is initially convenient, it really starts to take the challenge out of the game as you progress. What's the point of breaking your thumbs trying to dodge a yeti monster's frost breath if you'll be beating the game regardless? Purists would argue that the continues are there as a matter of convenience, and shouldn't be relied upon to beat the game. However, for players not looking to memorize every enemy position, attack pattern, and rocket trajectory, the infinite continues really undermine the challenge of getting through each stage and slaughtering the final boss.   SNK seems to be offering a Metal Slug purist-only product here. This is especially evident in the Xbox Live support, which enables players to post their top scores online for others to see. Casual players might do this once or twice before passing the whole thing off as trivial, especially when they see the scores some of the more hardcore players have posted. On the other hand, this online scoreboard is a great feature for those obsessive about nabbing the highest score possible. Mysteriously, this scoreboard feature is only available in MS 5, while MS 4 only offers you to access a friends list.   It's unfortunate that the Xbox Live feature didn't include online cooperative play, which is something that might have actually expanded the gameplay beyond just the single-player campaign. Other than that, both of these games get old fairly quickly. After the initial run through, there's just very little to return for. This is too bad, since both titles are a lot of fun while they last, they just don't last very long.   MS 5 is certainly the better of the two games, throwing many more interesting challenges at the players, as well as granting your character the ability to slide along the ground. Gigantic boss fights accompany an array of varied, detailed and dynamic gameplay environments, and the game does much better job of engaging the player in the action by offering more interesting weapons and slugs.   That's not to say MS 4 is devoid of merits, it definitely has some bright spots. Most notably, this includes a sequence where the player can actually get turned into a zombie. As with MG 5's fat mode, zombie mode grants players extra powers such as a screen sweeping blood spray. The enemy design in MS 4 is decidedly strange. It's difficult to try and logically piece together exactly how pirates, zombies, and militia men are all part of the same evil conglomerate, but then again what does it matter? It's Metal Slug, it's not supposed to make sense.   Bombs care about landing safely too. For 2D, the graphics are without a doubt impressive. Despite the sometimes overwhelming amount of discharged weaponry and explosions onscreen, the framerate never stutters. Soldiers in both titles don't just fall over and disappear when shot, but collapse to the ground clutching their wounds in a very animated fashion. Enemy design and explosions are very pretty to look at as well. Shrapnel, fire and blood spray across the screen in all its intended sprite-based 2D glory.   The sound is very workmanlike, and typically what can be expected of a Metal Slug game. Silly, synthesized music dominates the soundtrack with wailing guitars and tinny drum beats. The sound effects are basically limited to weapon fire, death screams, and explosions. Though all serve their purpose, none really stand out as spectacular or unique.   Despite an interesting first run, it's hard not to be disappointed with this Metal Slug combo pack. It's a series that has always been a great way to soothe the twitch-gaming urge and to blow tons of stuff up, but these titles offer very little beyond what was present in previous Metal Slug titles. In other words, it's much more of the same.   If you happen to be a huge fan of Metal Slug and your mouth is frothing at the opportunity to post your high scores and gloat to all your friends, then you might consider picking this up. Still, $40 is pretty steep for two hours worth of gameplay, especially since one of those hours is decidedly better than the other.   Check the new movies to see some explosions.The initial surge of nostalgia for the glory days of 2D action is impossible to keep down while playing through these games. Unfortunately, once it fades, theres little left to take its place. This combo pack will appeal only to those dedicated fans who take pleasure twisting their thumbs in knots trying to get the highest score. While its still a great shooter, its something weve all seen before. Both games definitively prove the Metal Slug series is slowing to a crawl and desperately needs to change if it wants to evolve and attract new fans.", "date": "Aug 25, 2005"}