{"name": "MotoGP 3: Ultimate Racing Technology", "name_review": "MotoGP 3", "ref": "https://www.ign.com/articles/2005/08/26/motogp-3", "text": "Re-creating the popular European sport of Moto Grand Prix in the videogame arena is a challenge Climax has approached and met now three times with each effort displaying incremental success. This third title is a more streamlined, more intelligent affair. It's faster, more realistic, and you're now able to expand the racing far deeper into the online realm.   What will really entice on-the-fence buyers are the new Extreme courses. Built into the Career mode, these courses consist of a suite of well-designed country tracks, based on real areas with fictional courses, and tweaked to game perfection. The positive result is a breath of fresh air from the grind of the pro circuit, as the courses reflect a greater feel for how gamers play and a depth of design mixing both challenge and fun.   But if you like, say, Need For Speed Underground or even Midnight Club 3 because of their arcade forgiveness, Climax's game will come as a hot smack in the face. MotoGP 3 is, more than ever, a racer's racer, meaning casual players are unlikely to fall in love with its sim-style gameplay and unforgiving tracks. It's built for motorcycle racing fans, specifically the followers of the GP championship, speed freaks, and the online competitors. The breadth of courses, this year's focus on online play as part of the single-player campaign, and the game's demand for precision racing are all well-done aspects deserving of kudos, but they're the stuff of hardcore, sim-fanatics, not your every-so-often gamer.   Gameplay  MotoGP 3 is different enough from its predecessors. Unlike MGP2, which offered stunt races, arcade modes, and online play, Moto GP3 focuses on realistic presentation, the gritty, second-by-second drama of these ridiculously fast bikes, and mastering the sport in its purest form. When you play Moto GP, you'll quickly learn how important racing skills are to winning. Not luck, power-ups, or secret shortcuts, but skill. Moto GP is a honed, refined game that does what it does very well, even if the focus has been narrowed from previous games.     The basic modes should be familiar to any racing fan. When you boot up the title, you'll be instantly prompted to log onto Xbox Live, and you can then enter Quick Race, Career Mode, Time Trials, and Tutorials. The Tutorials, for those folks who think they know everything, are quite necessary. While the rest of the game is well presented, these rather primitive text and audio screens are a bit of a mess. The audio doesn't match the text exactly, making it confusing to the gamer. Nonetheless, the tests (neither of which offer trophies nor different levels of training like in Gran Turismo) train you to learn a basic motorcycle vocabulary, and expose you to different tracks, turns, and techniques. Given the sophisticated twin brake system, this mode is a necessary tool.   Quick Race offers players instant access. You can select the bike class (Grand Prix and Extreme 600, 1,000, and 1,200), track, rider, and difficulty settings. Time Trials are single races based on achieving the best time stats, with your selection of ghosts.   It's the Career mode, however, that is the real meat of MotoGP 3. It enables you to dive into a 16-race career with the pros in the GP or Extreme circuits. The GP Circuit is the real deal. Each course is introduced with poorly compressed but nonetheless colorful FMV cutscenes showing the city in which the race is held, offering quick cuts of ordinary people, architecture, and countryside. It's a quick look at life in these 16 different European cities, and the effect works to bring a flavor and flair of its heritage. You can then practice, qualify, tweak your bike, and check standings and stats before the race begins. Or, and this is the new and very cool part of the Career mode, you can choose to play the race against online competitors (just like in Forza Motorsport).     For basic players, these choices make things easy. If you just want to race, pick ~race~ and the load time is about three seconds. For fanatics, these options offer a deep but not revolutionary set of customizations.  On the surface, you can customize your helmet, bike, rider leathers, logo, switch, team name, number, and nationality. The GP racing circuit is based on earning cash to upgrade, but each win also earns you racing points to customize your racing skills. Money earns you the ability to upgrade your bike and buy newer, faster vehicles. Skill points increase your four personal biking skills of cornering, braking, top speed, and acceleration, all of which can be distributed manually.   Underneath the hood, the Workshop is where hardcore types can tweak bike parts and stylize their rides. In this menu you can manage and buy bikes, buy parts, customize bikes, change setups, and test and experiment with settings. The areas you can upgrade are engine tuning, weight reduction, braking, traction and stability, and BHP upgrades.   Unlike the three difficulty settings standard in other games, here you can pick from four difficulty types: Rookie, Pro, Champion, and Legend (which is initially locked). The major difference between them is the aggressiveness of the opponent A.I. I recommend starting in Rookie and working your way up, but seasoned gamers can easily jump into Pro or even Champion without much frustration. During a race, you're given an excellent set of six perspectives, although the sixth one is more of a cinematic perspective that's worthless to use for driving.   MotoGP 3 is an intense, highly turbulent, extreme experience, and this iteration gives you that rush of adrenaline by conveying great sensations of speed. The feeling of riding a super-powerful motorcycle is captured beautifully in MotoGP 3, with an excellent burst of acceleration, a smooth 60 frames per second output, and an additional ~in-the-zone~ speed in which every visual object blurs out. There is little doubt about it, MotoGP 3 is one of the fastest racing games on the system.    Backing up the excellent sense of speed is a smooth driving mechanic. Climax's bike mechanics re-create with great realism the shifting weight and physics of an insane man driving an uber-powered motorcycle. The effect is like a pendulum, only you're able to affect the speed, direction, and intensity of its swing. Once you settle into a rhythm, the physics feel as natural as if you were a trained professional, though they all take time and practice to understand and master. This is one of those games that requires your full, uninterrupted attention to play properly, so don't bring it to parties.   While the AI is usually good, it's also problematic at times. It's generally tough, and the game doesn't suffer too much from rubber-band cheating. Though on Pro mode, I've seen bikes sneak past me at the last second several times, but it definitely gets in the way of appreciating the game's rhythm, and it represents a set of moderate problems in several areas to boot.   In the Pro difficulty setting and up, the AI is not trained or programmed to stay away from you. It will follow its own lines and if you're driving erratically or even well, the AI will bump, sideswipe, or even ram into you. It's not crazy bad, but it's not perfect either. Still, the result, naturally, is you getting heaved off the bike, followed by a few seconds of beautiful ragdoll physics demonstrating just how much punishment the human body can take at 300 MPH. Additionally, if you're getting back on your bike, there is no buffer zone, no neutral period to get up and running again. The game drops you back on course, and if a biker happens to be right behind you -- WHAM! You both go flying. To lose a race or a placement because of the game is not good. This, obviously, is a problem.      These AI problems, however, are just a foreshadowing of what the online experience will be like. After having experienced it ourselves while testing the game, MotoGP 3 is going to be tough on first-time Xbox Live users. Based on a seeding system, all players start out low on the ranking scale and move up by defeating opponent players of equal or higher ranking. Mixing the hairpin balance and sensitivity of these bikes -- which Climax has done perhaps too well -- and obnoxious who-gives-a-damn Live users, MotoGP 3 online may very well be an exercise in frustration and anger. The game itself is set up for a good healthy race, but the nature of two-wheeled, high-speed races is much more flammable and unstable than four-wheeled car races. Again, the nature of online play isn't something Climax can control, but that experience nonetheless affects the game.    MotoGP 3's online play, for the most part, is solid, respectable and deep. You can play any of the courses you've opened, or any the host has opened, online, from the GP proper courses to the Extreme courses, and with the exception of some lag here and there, the game is good fun online. Lag, which cannot be controlled, affects a racing game of this nature much more than it would a regular car racing game, due to the speed and instability of the bikes. So, it's there, and it doesn't look good. But if you can find a group of friends and you want to experience great riding fun, hit the Extreme Courses and go nuts. The Extreme Courses are a superb set of well-designed tracks that have a flow and naturalness that perfectly suits high-speed MotoGP racing.    Graphics  Visually, MotoGP is strong where it should be. The bike and rider models are tightly crafted and the environments are polished but a little on the dull side. The special effects used to create speed, from blurring, wind, sparks, shaking cameras, and whatever else, make this pretty and perfectly suited for racing freaks. You'll experience a great realtime lighting system replete with lens flairs and accurate reflections, and a robust 16-angle replay system with save options. The framerate is always steady and high, a major goal that Climax achieved in this iteration. The graphics carry over online with nary a hitch. The amount of detail is actually more surprising when you see it working online. The framerate holds, the graphics are crisp, and the bikes still blaze.    Even if the FMV is often a little rough looking, the game's presentation is solid. In fact, Climax included real-life highlights from a previous season, including duals, wipeouts, pileups, the winner speeches, and more. I got a much better feeling of the sport from watching these videos, and they actually helped me play better. Lastly, the humiliating yet humorous crash cam shots are great. In real life, these crashes might kill you, and rarely does somebody jump back on their bike for more. But in this game, the crash cam rocks the Kasbah. It shakes with real-life shakiness, it follows you tumble for tumble, and it provides that rough, uncut feeling of your body getting thrashed to shreds. The game supports wide screen and progressive scan at 480p.    Sound  Either MotoGP 3 offers a perfectly antiquated techno sound reminiscent of the late 1990s, or it has succinctly nailed the present-day English sound, meaning I haven't been to England for awhile. Either way, the soundtrack is a generous helping of techno and rock tracks that work well with the game, even if Climax chose to insert the music into the races themselves, and even if they sound old.    The sound effects here are mixed. The bikes sound like a hive of hornets, except tinny and high. The roar of these powerful bikes isn't deep. The crash and rip of bikes hitting each other is good, too, though I always expected it to sound harsher and deeper.  MotoGP 3 is a great game. In many ways, it's outstanding. It's not arcadey, it's not all that kind or friendly. But for simulation racing fans with a knowledge of MotoGP and who love to drive really, really, really fast, this game is for you.Climax has shucked any extraneous modes from the past and focused instead on a great set of Extreme courses, pure sim racing, and a knockout set of online modes including both the single-player campaign and versus. You can play with as many as 16 folks online in any course, and though there is a little lag, it's still just as fast as the offline play. It's easily the best MotoGP yet.", "date": "Aug 26, 2005"}