{"name": "InuYasha: Feudal Combat", "name_review": "InuYasha: Feudal Combat", "ref": "https://www.ign.com/articles/2005/08/30/inuyasha-feudal-combat", "text": "I can relate to Miroku. He's being swallowed by the ultimate wind tunnel power (a curse I compare to my own bubbling rage), and all the man wants is to impregnate a few sexy ladies. Sounds like my sort of plan! Too bad he and the semi-demon star for which this game was named are hardly represented in Feudal Combat. Too bad Feudal Combat also fails to feature any kind of exciting combat. But at least it's plenty Feudal enough.  Won't you get back to the impregnation? No? Oh, very well then.  InuYasha is a simple game... Begin. Pick one of three basic modes. Play. Turn off the PS2. Never play again. Simple!  It goes down like this partly because InuYasha features a totally uninteresting ~story~ mode. I use that word is loosely.   The collection of never evolving character-specific fights Bandai passes as a story tries to touch upon some elements from the fiction, but it explains nothing. It's also incredibly short. Playing through the story mode with a character takes less than twenty minutes. While it's true that completing the game will unlock another character, there aren't enough to keep things interesting.   While unraveling absolutely nothing, expect to participate in one-on-one matches with the possible addition of up to two AI controlled combatants, effectively making certain bouts two-on-one or two-on-two. The AI, when provided, can be assigned a basic attack style, but milling about and double teaming someone whenever an opportune moment arises is pretty much what it does regardless. As the computer blindly stumbles around and furiously hacks and slashes its way to victory, so too will the player.   Each InuYashan fight takes place in a very confined, static environment. It's a brawling game, but don't mistake it for PowerStone and give Capcom a heat attack. This type of simplistic gameplay results from underdeveloped combos, unbalanced characters and bland arenas, not a cool multiplayer idea. But if you're really good at all the crap, you'll at least be able to hold down block to fend off a combat string before initiating one of your own weak-sauced attacks. Then again, that offers little advantage, so just go nuts on the controller.  The only advanced move in the game is the spirit attack (press circle). Players can perform this powerful assault once they've built up the spirit meter by throwing out normal hits. I wouldn't use it until the enemy loses one of his three life bars, though. It's smart to save the spirit power up and then unleash it just as an opponent recovers from a second or third wind. Do that and victory is all but guaranteed.  Move #2  The same lame combat principles carry over to InuYasha's other two modes. Of them, ~mission~ is the most interesting, but only because it offers a good range of varying levels of annoyance.   Mission is basically a collection of mini-games lumped into a map. One mini-game asks players to knock arrows out of the sky (which is terribly annoying thanks to the unresponsive attacks of characters and unpredictable collision detection). Another challenge involves destroying fleeing ghost guys that can't be locked onto (it's almost as annoying as the arrows). Slightly less annoying challenges are also provided.   The other, less interesting mode is Battle. In it, players...BATTLE. This involves mindlessly slamming thumbs into the X and Square buttons to eventually achieve some sort of stupid end. I actually managed to beat another IGN editor in a test match by looking away from the screen and just hitting Square, X and Circle as fast as I could with my index, middle and ring fingers until the match ended. Now that's battling gameplay, baby!  InuYasha is pretty enough for a lowbrow button masher, but the primitive gameplay means looking at the screen is optional even if victory is not.", "date": "Aug 30, 2005"}