{"name": "One Piece Grand Battle!", "name_review": "One Piece: Grand Battle!", "ref": "https://www.ign.com/articles/2005/09/01/one-piece-grand-battle", "text": "Almost every published article on Bandai's upcoming fighter, One Piece: Grand Battle, references Power Stone at one point or another. The reason being that both games revolve around chaotic battles set in a series of interactive environments. Plus, One Piece: Grand Battle and Power Stone make good party games. Of course, One Piece is actually based on a popular TV series, which in turn is based on a manga series. And it's this source material that winds up being one of One Piece's greatest assets.    For those don't know, One Piece chronicles the story of Monkey D. Luffy, a young pirate captain searching for the ultimate treasure known only as the ~One Piece.~ And he's not alone in his search, either. Ever since a legendary pirate announced he had hidden the ultimate treasure, the aforementioned One Piece, scores of pirates set sail for the Grand Line ocean to try and find it. Regarding directions, all anyone had to go on were the vague instructions that the treasure would be found at that ~one place.~    None of the above information ever factors into One Piece: Grand Battle in terms of gameplay, even though it lends the game a few chuckles here and there. The game splits between a bunch of different modes, including: Grand Battle, Story Mode, Training and Grand Tourney. Grand Battle is the main event, featuring all unlocked fighters and stages in single-player or two-player battles. Story Mode follows each character through a shallow, nonsensical story complete with cutsenes and bad dialogue. Grand Tourney lets you select a series of characters and fight in a tournament. Lastly, Training lets you hone your skills by fighting against characters under your total control.    You'll spend most of your time in One Piece fighting against fellow pirates, all of whom look and sound as wacky as the game's long-limbed protagonist, Monkey. You can choose from a stable of 15 characters in One Piece, even though four of them are locked from the start. Fans of the show will appreciate that all major characters made it into the game, including Roronoa Zolo, Nami the Navigator, Sanji, Captain Kuro, Buggy the Clown, Chaser and others. Character design is actually pretty cool, as are each character's moves and special abilities (more on that later.)      Still, the number of characters won't impress many fighting game fans, but fans of the show probably won't mind. And while each character looks radically different, each falls into one of three categories. And it's not so much a character's strength or speed that sets him or her apart, but the style of special moves they execute. For instance, Luffy and Nami's secondary range attacks are identical, even though different in appearance. Meanwhile, characters in another group share the same dash maneuver as their primary range attack. So in the end, most characters feel like bits and pieces of other characters, which works fine but isn't as cool as playing with totally unique fighters.      Each fighter boasts the same number of moves split into nine categories. The first on the list, Support Attack, lets the primary fighter summon a support fighter (chosen before each fight) for a short time. The second, Super Attack, lets you perform character-specific moves. The third (and the largest) is Secret Attack, which lets you execute a devastating combo complete with accompanying cinematic. The rest of the moves split between Range Attacks, Air Attacks, Throws and old-fashioned punches and kicks. In all, every character in Once Piece has about 20 or so techniques at their disposal. Combat in One Piece centers on the above moves, as well as a number of simple, three-button combos.     The action can get pretty tense at times, especially considering the type of environments you're fighting in. Just as in Power Stone and Super Smash Bros., environments in One Piece make up half the fun in the game. While not as robust or dynamic as those in Power Stone or Smash Bros., One Piece offers a cool blend of obstacles and destructible items in each of its 7 environments. For example, you can fight in Luffy's hometown of Fusha Village, where you need to dodge rampaging cows. In Baratie Bistro, you need navigate a series of destructible planks between to sinking ships. And in Rogue Town, you need to fight in a small arena while jumping over an electrical current that passes through the area.    Add to this a bunch of items (think Smash Bros.) that spawn in each stage and you've got the makings for some seriously cracked-out battles. Items hide inside chests and crates that rain down on a fight at random. Chests can contain fruit (used to power your special meter) and a mix of defense and offense items. Finding a small sword, for example, increases the strength of all your attacks while finding a small shield increases your resilience to attack. You can also find things to throw, such as poisonous mushrooms (which sap energy) and honeycombs (which fuddles control.) While not an innovation by any stretch, these items add a groovy air of unpredictability to each encounter and make the game that much more enjoyable.    Still, things aren't perfect in the land of One Piece. Framerate bounces all over the place, for one, especially during effects-heavy special moves. It can be smooth one second and super sluggish the next. Character control feels awkward at times, but it's nothing so bad as to get truly frustrated. Then there are a few path finding issues, where enemy fighters get stuck behind crates, trees and other obstructions. It doesn't happen often, but it's still there and will happen more than a few times during a normal game session. Lastly, the nature of the game makes for some truly chaotic battles. And normally this wouldn't be a bad thing, but in One Piece things sometimes get to the point where you don't know what the hell is going on.      One Piece also includes a host of unlockable content such as mini-games, art, character profiles, stages and characters. Character profiles and art won't appeal to anyone but fans of the manga or show, but the mini-games are actually well-designed and fun. One mini-game, for example, plays like a competition between opposing bands of pirates. The competition spans three unique sports, including one where you need to knock an item into an opponent's goal. Another sees you defending a raft from attack by smacking enemy pirates who are trying to launch cannon balls at it. It's actually pretty fun and definitely one of the best mini-games seen in a game of this type. The stages and mystery characters are also pretty cool and worth your time to unlock.    In the end, One Piece: Grand Battle is a fun game marred by a lack of innovation. It looks good and sounds decent, but most of what you'll find in One Piece has been done before and done better. However, this fact doesn't make the game bad. One Piece offers a decent blend of action and humor in a nice looking packaging. Those looking for a party game along the lines of Power Stone should definitely check this one out, if only as a rental. Fans of the show will love the cel-shaded look and humor ripped straight from the TV show.", "date": "Sep 1, 2005"}