{"name": "Buck Bumble", "name_review": "Buck Bumble Review", "ref": "https://www.ign.com/articles/1998/12/02/buck-bumble", "text": "Unbeknownst to the human population, a careless chemical spill has made its impact upon the insect community somewhere in rural England. In the gardens and grasslands below the eyes of daily life, an evil bee army -- mutated and enhanced thanks to toxic chemicals -- has begun to take shape. Led by a devious bee queen, the dark force, utilizing powerful weapons, is bent on eliminating opposing forces and eventually conquering the outside world.It is up to one lone bee, Buck Bumble, to save the garden-life from being destroyed and prevent the Evil Herd from inflicting outside damage before it's too late.So begins Argonaut and Ubi Soft's Buck Bumble, a unique 3D shooter of sorts that pits players as a powerful, weapon-toting bee who isn't afraid to kick a little ass.The Facts 3D polygonal engine. More than 20 different missions. 15 weapons and the enemy to steal enemy artillery. Two different two-player multiplayer modes. Rumble Pak support.GameplayBuck Bumble pits players in the role of a flying, hovering, shooting bee. Developed by Argonaut Software (Star Fox Super NES), the game employs a third-person view and unfolds in a polygonal 3D environment. Control-wise, Bumble has a very floaty, hovering feel about it (go figure), which works out well considering that players are maneuvering a bee. The A button is used to fly or buzz above ground and the analog stick turns Buck from position to position, as well as ascends and descends. For example, pressing A and Up on the control stick results in the bee shooting upwards.The control, in spite of its floaty feel, is tight and well thought out. It really feels as if players are controlling a bee. Buck can flip, turn, sway from side to side, speed up or slow down and more.Argonaut has implemented lots of nice little extras like the ability to land and proceed on foot and carry a wide assortment of weapon -- more than 15 in all. There are standard lasers, cannons, nukes and more. Because some enemies can be disposed of most efficiently with specific weapons, part of the strategy is deciding which gun to use in certain scenarios. Add to the fact that players can acquire artillery from foes and there's quite a bit going on here.And speaking of enemies, the game features a good selection of them. Evil bees buzz around Buck at every corner and when hit, they fall to the ground like a crashing plane (sound and all). Giant tank-like land insects explode once their heads are shot off as one might imagine a real tank would. And so on and so forth.MultiplayerThere are two multiplayer modes in the game, both of which are designed with two players in mind. The first, Buck Battle, is a standard deathmatch which sees two players fighting it out over a handful of scaled-down levels. The object, of course, is to kill one-another (duh!). Unfortunately, the mode isn't so great, mainly because the game's overall look is confusing enough in single-player mode, let alone split-screen. It's difficult to find an opposing player and, supposing a battle does break out, it's even harder to land a shot as the bees can fly just about anywhere at the drop of a dime.The other mode is Buzz Ball, a more far more simplistic multiplayer mode that actually proves to be the superior of the two and very addictive. Two bees are set down on opposing ends of a play field -- a goal on each side. In the middle of the field falls a giant soccer ball. The idea is to run into the ball (or shoot it with rockets) and move it downfield into the competition's goal. It's sort of like Soccer, only it's being played by two small bees. Buzz Ball is tense and highly competitive. We found ourselves coming back to it again and again.GraphicsThink of Banjo-Kazooie's bee level. Picture how colorful it is, how well-crafted the bee is, and how smooth it all runs. Now add lots of fog, drop framerates a bit, replace cleverly-designed textures with brown, muddy ones and drop polygon count of 3D models significantly. Welcome to Buck Bumble. The epitome of ~first generation~ Nintendo 64 products.And that in itself isn't exactly bad. The only problem is that Buck's arrival is a little late and the competition has seriously exploited Nintendo 64's hardware. By comparison, Argonaut's title just doesn't stack up. Because of the game's excessive fog and bland, repetitive textures, it's extremely easy to get lost and, though Bumble controls wonderfully, games of this type need depth of visibility.Not to say that all is bad here as that isn't true either. Buck himself is cute and well-designed (though not on the same level as Rare's buzzer), and, once a new weapon is put into use, the bee reflects that. Argonaut has delivered up a nice batch of environmental visuals as well, from flowers and plants that aren't merely 2D sprites but polygonal 3D objects to smooth animation on characters and a mostly reliable camera system. But don't expect to be blown away by this game's appearance.SoundThe opening music to this game says it all. It's very drum-and-bass and features a rappy, scratchy vocalist repeating, ~Buck-to-buck-to-the-buck-to-the-buck...Buck Bumble~ over and over again. Not a Nintendo 64 norm for sure, which is to say that it isn't bland techno tunes, and it sounds great. In-game effects are equally impressive, with, as we said above, bees that crash to the ground with airplane sounds, giant explosion effects and so on. Nice job.Buck Bumble is a fun Nintendo 64 title that lacks the technical flair of today's current crop. The game controls tightly, it's smooth running (most of the time) and there are quite a few missions to keep gamers busy for a short while. That said, this isn't a very difficult game and though Argonaut has tried to hide the fact with easy deaths and single-lives, it can be beaten relatively quickly. However, the game's two-player mode, name Buzz Ball, is very addictive and will likely make a good party experience.But it isn't pretty. Fog, fog, fog, combined with low-resolution textures, low-poly 3D models and the like just can't compare with the competition -- especially after playing Banjo-Kazooie's bee level which is basically the same thing. In spite of its technical shortcomings though, I still recommend gamers give Buck a try. Rent it. If you can forgive the game's sub-par graphics and short quest, you just might like it.", "date": "Dec 2, 1998"}