{"name": "Tecmo Classics", "name_review": "Tecmo Classic Arcade", "ref": "https://www.ign.com/articles/2005/09/03/tecmo-classic-arcade", "text": "Just because a game's made in the 80s doesn't instantly give it ~classic~ status, and that's exactly the problem we run into with the Tecmo Classic Arcade. Tecmo follows in the footsteps of companies such as Midway, Atari, and Namco and produces its own selection of games from its history, but the issue here is that Tecmo didn't have a whole lot of classics back before the days of Ninja Gaiden. This package is beefed up with only 11 games, half of which were of bland quality when they were originally released more than 20 years ago.    The most recognizable game in the package is easily Tecmo Bowl, but don't get your hopes up. Because this is an arcade compilation, the company's offering the coin-op rendition that preceded the game that every classic sports nut remembers: the original Tecmo Bowl on the Nintendo Entertainment System. The arcade version was impressive in a technical sense, where the cabinet utilized two monitors and a special mirror rig to create a super widescreen image. But for gameplay, this is football at its most basic: players must choose their receiver before the play, players can't switch their controllable athlete while the play's running. It's also rather slow-paced and lacks excitement in single player fashion, but it earns a bit of merit because with two or more controllers the arcade action can get pretty hectic. It's a game that will wreck controllers since it encourages wiggling the control stick to break tackles, and that's most of the gameplay right there.   Bomb Jack is probably the ~Pac-Man~ of the collection, since it's one of the most unique, pick-up-and-play friendly game in the package, complete with a familiar personality in the starring role. The game has been updated in the arcade as well as ported to the NES back in its day, but it's the original version that still retains its charm. The idea is simply to pop all the balloons in the level while avoiding enemies floating around.   Rygar is also one of the ~gems~ in the collection, even if it's yet another side-scrolling beat-em-up. This game was lost among the many other scrolling action games released at the time, but there's something original about Rygar that made it stand out from the crowd. Tecmo updated this concept with a PlayStation 2 remake, but they failed to revive the original game as an extra in the PS2 update. Now everyone can check out the concept from its arcade beginnings, and for a nearly 20 year old action title, it has its moments.   Beyond these three games, there's a mess of games whose quality varies from average to awful, and none really ever stand out as a ~must play.~ Star Force is the vertical shooter that became Star Soldier on the NES, a solid blaster that gets old fast. Solomon's Key has a special place in retrogamer's hearts because of Tecmo's ports to the NES and Game Boy, but the original arcade rendition doesn't seem to retain the enjoyment people seem to recall. Senjyo is an awful Battlezone-style shooter whose only merit is its cool use of parallax scrolling to fake a 3D look. Tecmo Cup is a broken soccer game that doesn't work well at all on the Xbox controller simply because the original game featured trackball control. Pinball Action is a poorly-titled video pinball game that isn't as bad as its name, but Swimmer, an absolutely terrible game from 1982 is just as terrible as its branding. Strato Fighter is one of the more recent games in the package, an energetic two player R-Type-style shooter, and Pleiads, the not nearly as good ~sequel~ to Phoenix, is the pack's oldest, most dated, and maybe even the most uninteresting game.   The original content certainly covers the entire spectrum of quality, and it's up to the personal preference of the gamer which ones of this will be played the most. At the very least the emulation on the Xbox is pretty spot-on, even in Tecmo Bowl where both monitors have to be displayed on a standard television screen. Since some games are vertically oriented in their aspect ratio, these ~tall~ games have letterboxing graphics to fill in the voids created by the resolution, which is acceptable. But oddly, every game is bordered, even when the original game worked on standard 4:3 monitors. Players can stretch the image to fit their monitor, but they'll never get the exact resolution that the original games displayed.   Along with the pack come a few historical documents. Sell sheets and instruction papers given to arcade operators back in the day have been scanned in, and players can zoom in and view the pages. The interface to read these assets is pretty bad, though, and it's really clumsy paging through them the way the programmers lay everything out using the Xbox controller. This extras section was obviously thrown together.   In fact, aside from the decent emulation, the entire pack feels pretty rushed. The Xbox control configuration puts the coin-drop command and the ~pause/quit~ function on the action buttons where they can be accidentally bumped, making it far too easy to accidentally quit the game during the action. These buttons could have just as easily been placed on out of the way buttons instead.  Tecmo Classic Arcade does have a couple of enjoyable titles, but on the whole this pack is pretty bad. Even though Tecmo wasn't exactly king of the arcades in 1980, this compilation lacks some of the more recognizable and fun games in the company library, including Ninja Gaiden, Shadow Warriors, and Silk Worm. The emulation is spot-on, but the package is lacking in heavy polish and fun. And it's ten bucks more than other classic arcade packs with far fewer titles on the disc. Cut that price by half and maybe we'll talk. Until then, skip this one unless you really need every classic compilation made for the Xbox.", "date": "Sep 3, 2005"}