{"name": "Radiata Stories", "name_review": "Radiata Stories", "ref": "https://www.ign.com/articles/2005/09/07/radiata-stories", "text": "As a guy who liked Star Ocean: Till the End of Time more than most, Radiata Stories is a project I've been anticipating for quite some time. Developed by the same tri-Ace team responsible for the aforementioned RPG (and the very cool PSOne RPG, Valkyrie Profile), Radiata is, on the surface, what the Suikoden series might have been had Square Enix bankrolled it. While that doesn't mean that players can expect to meet the 108 Stars of Destiny or build ever-evolving fortresses, it does mean that they can anticipate a somewhat similar structure in regards to pacing, theme and the recruitment concept. At least, that's how it seems at first.Eventually, it becomes rather apparent that Radiata is actually an amalgamation of several different RPGs blended into one big fantasy hodgepodge. Presentational similarities to titles like Kingdom Hearts and Tales of Symphonia are obvious from the very beginning, while the game's ties to Star Ocean's battle system are just as evident. Factor in the aforementioned Suikoden influence, a dash of the Bard's Tale's humor and a time cycle inspired by Majora's Mask, and the building blocks for Radiata Stories are pretty much complete. Radiata is a beautiful game, both technically and stylistically. For me, Radiata's best feature is undoubtedly its colorful cast of characters. Though the storyline isn't anything too special (it's admittedly on the slow and  clichd side), the personalities within it are great. Lead protagonist Jack Russell and his cohorts Ridley Silverlake and Ganz Rothschild are as different from one another as you can get, and make for some truly funny scenes when interacting together. In fact, it's this commitment to humor that helps Radiata Stories' presentation transcend its somewhat cookie-cutter storyline. Had the creative team decided to go serious and treat its ~humans vs. fairy creatures~ plot and obvious sexual tension between Ridley and Jack in the traditional manner, playing through it wouldn't have been as interesting -- but because the crew stuck to its offbeat style, the final product actually works. After all, Jack is barely above the idiot level, which is something you don't typically see in today's role-players and that's what makes him cool.One of the reasons this humor works so well is because it's supplemented by two equally impressive elements: audio and visuals. The eye candy, in particular, really stands out with an anime-inspired big-headed look and the most colors I've seen onscreen since SaGa Frontier. Facial expressions and body language are done extremely well, too, and the art style is probably my favorite in 2005 thus far. It was also nice to see that tri-Ace managed to pull off a consistent 60fps during exploration mode and 30fps during battles despite its high level of detail. You won't find any stutter here. 480p and 16:9 anamorphic widescreen don't hurt either.Likewise, Radiata Stories' music and voice-overs are of the utmost quality. Never taking themselves too seriously, the actors play their parts with the same flippancy and fun that made this summer's Atelier Iris entertaining. There's a lot of spoken dialogue in here, too, and when coupled with the game's enormously long cutscenes, it plays out like a mini-featurette. Players can expect plenty of musical cues and variety as well, and while I've certainly heard better RPG soundtracks than this one, it still fits the mood and has a couple standout pieces worth listening to.Excellent presentation not withstanding, where Radiata Stories falters a bit is in its gameplay. As a fan of Star Ocean 3's combat system I was really looking forward to Radiata's simplified reinterpretation, and to its credit, it's certainly more accessible. You see, rather than using Till the End of Time's somewhat complex approach to fighting, Radiata uses a pretty straightforward hack and defend system that can be picked up in no time at all. Adding a little extra value to this system is the ability to customize what kinds of attacks Jack can pull off through a customization menu, and the ability to issue commands to NPC characters for combat help. ~Volty Gauge~ special attacks, dodge and parry techniques, and complete 3D movements during battles are nice additions as well.    If you don't mind the solo aspect, this system can be a lot of fun to play. But given Radiata Stories' combat-heavy nature (despite being able to see enemies that you can avoid), it gets disappointing that you never get to use your remaining characters to their full potential. It would have been a lot more rewarding if you could have jumped from combatant to combatant like you could in Star Ocean because, in a game where collecting a boatload of characters is one of the primary goals, being able to control them would have made a lot more sense.In that regard, at least it's possible to control your three additional teammates in a hands-off way. Using tactical formation and target commands, you can instruct your buddies to go after particular enemies or use special arrangements that give the team special bonuses. The NPC intelligence for these situations is actually pretty good, and in a way, might be too good, as you never really feel like your party is in danger until you get to the boss fights. Even then, things aren't as bad as you'd think. Overall, I think this is a case where a strong combat engine has been undermined by weak challenges and underused companions. The world changes with time, but so does your outfit. The good news is that Radiata Stories still has plenty of cool aspects that keep it in line with this year's more impressive RPGs. For starters, the load times that concerned me so heavily in my last hands-on preview have all but disappeared and transitions are near-instantaneous. Another welcome element is that the world of Radiata is always progressing with a time cycle that gives more than 175 collectible NPCs an air of realism. Like Majora's Mask before it, this time cycle provides each character with the ability to act out daily routines and set merchant business hours so that progress is dependant on when and how things get done. This is particularly true if you want to try and do all the subquests in addition to the mission-based storyline (and you probably will want to as the length of the main quest is relatively short compared to most RPGs...clocking in at around 20-25 hours). Players can even decide which side of the war between humans and faeries they want to fight on, and that means that you'll have to play through twice if you want to get everything.Like another personable PlayStation 2 RPG, Atelier Iris, Radiata Stories is a hard game to judge. On the one hand, the storyline rarely surprises, the battles are never too difficult, and the fact that you can never directly control teammates is a bit disappointing. Then again, Radiata's presentation is so undeniably beautiful and its combat engine is so flexible, it's easy to overlook its shortcomings (especially if you let the characters and their charming personalities win you over). All told, Star Ocean fans like me (or general RPG consumers) will probably enjoy Radiata Stories quite a bit and there's a lot of fun to have here if you want it.", "date": "Sep 7, 2005"}