{"name": "Skipping Stone", "name_review": "Skipping Stone", "ref": "https://www.ign.com/articles/2005/09/08/skipping-stone", "text": "If you don't smile while playing Skipping Stone, you must be dead on the inside. I-play has introduced the ultimate casual game for mobile, a simple, one-touch game with accessibility that could (and should) see all ages of mobile gamers happily downloading the game. The concept is deliriously common: Skip a stone across a lake. And you know how you do this? Press a single button, over and over, to an inner rhythm that will keep the stone aloft as long as humanly possible.   Skipping Stone has two game play modes: distance and splash. The distance mode measures the latitude of your run, the goal being to rack up the most mileage for a single toss. How much power you put behind the initial throw has a lot to do with success -- you definitely want to put as much ~oomph~ behind the toss as possible. Keep racking up consecutive perfect skips on the water by pressing the button just as the rock smacks the water's surface, and you'll find yourself a long way from shore.   The splash mode doesn't count distance, just the number of times you can bounce the stone on the water. Combos are important in this mode, but if you are clever enough to keep your rock low to the water, you can really juice your score.   Now, the day at the lake is not necessarily a pristine one. Environmental hazard will affect your splash runs. Tornados sometimes strike, which causes your handset to vibrate -- and if you're not of a steady hand, this can really upset your rhythm. Fortunately, there are power-ups and bonuses that help keep you less-than-waterlogged. Springs goose your bouncing. A whale, drawn oh-so-cartoonish, will hoist the stone on its water spout for added altitude.   Skipping Stone matches its infectiously happy design with an equally light-hearted set of production values. The time of day changes the longer you remain aloft, and eventually it seems your stone has been awake so long its hallucinating. it's would be unfortunate to ruin some of the surprise scenery, but needless to say, whatever they drink at Gamevil to come up with this stuff, it should be bottled and sold.  Skipping Stone is one of my favorite mobile games. Not of 2005. It's one of my favorite mobile games ever, and I've been on this tip since 2002, when color games were first being introduced. I love that I can spend either three minutes or thirty with it and still get the same buzz off of its engrossing, yet playful, design. Bouncing rocks on water doesn't get much more high concept, but the execution is so strong you're likely to spend more time just tapping that one button than playing some of the deeper mobile RPGs and action games on the decks. This is not just pure gaming, it's pure entertainment, and it deserves to be enjoyed by everybody.", "date": "Sep 8, 2005"}