{"name": "Brain Challenge", "name_review": "Brain Challenge Review", "ref": "https://www.ign.com/articles/2008/03/11/brain-challenge-review-5", "text": "My brain is in a pretty sorry state. It consistently lets me down at pub trivia nights, it rarely remembers my relatives' birthdays (sorry, Mom), and so far it has utterly failed at making me a million dollars. Now I know why. According to Gameloft's new Xbox Live Arcade game Brain Challenge, I'm only using about 6 percent of the mushy grey mass, 7 percent if I've just had lunch.    But Brain Challenge promises to help me turn my cognitive life around by coaching me through a series of mental tests on a daily basis, tracking my progress and encouraging me to improve along the way. It's a formula that's worked well for Nintendo, which has sold millions of copies of its Brain Age titles worldwide.   Gameloft jumped onto the brainwagon in 2006, debuting Brain Challenge on mobile phones in 2006. The company released a version of the game for Nintendo DS in January, and a 360 version hits Xbox Live Arcade on Wednesday. Brain Challenge is the first brain training game to come to Xbox Live Arcade, and it makes a solid entrance with its large variety of minigames, endearing (albeit graphically unimpressive) training doctors and progress tracking functions.   Must impress doctor lady...  The best thing about Brain Challenge (aside from the cute, fresh-faced doctors) is its ability to track your daily progress, a la Brain Age, in a variety of categories: logic, math, memory, visual and focus. If you're the type who goes for self-improvement, you'll enjoy loading up the game every day, taking the battery of tests and tracking your long-term improvement (or decline, in my case).   If you're unhappy with your performance in a certain category, you can pop into the Training Room to get some extra practice. Doing so will also help you unlock additional minigames in each category. You'll be graded on your performance in each game type, so no slacking unless you want to see big, fat Ds next to each. There's a Stress Test, too, which adds distractions and multitasking to the standard puzzles.   After each Daily Test, your friendly framerate-challenged coach will show you a visual representation of your brain and the percentage of it that you ostensibly used to complete the test. It's a humbling image designed to entice you to keep coming back to the game for improvement.    Whether Brain Challenge actually improves anything about your brain is an open question. By design, there are a limited number of game types, and once you understand how they work and what it takes to score well, it's just a matter of practice. So, basically, it's just like any other game that rewards pattern recognition and trial and error. Does it stimulate your brain and sharpen your thinking? Definitely. But does it do so more than your typical puzzle game? Probably not.   Bouncy, bouncy.  Brain Challenge's main selling point is its format, which gives you a nice variety of categories, individual games, play modes and unlockable content. Spend enough time with Brain Challenge and you'll open up different mini-games and a special Creative Mode for your efforts. There's an adapted Kid Test and an unlockable Physical Test too (although we didn't unlock it).   Although it's a nice addition to Xbox Live Arcade, Brain Challenge has its, er, challenges. The tests are fairly well-designed but the opening tutorials for each are a bit unclear, and it took me a few tries to understand what I was up against in some cases. Maybe it's because we use only grape-sized portions of our brains, but my fellow IGN editors and I made more than a few false starts because of less-than-lucid pre-test tutorials.   Brain Challenge's multiplayer mode is fun once or twice, but it's set up like a card game in which each player takes turns solving puzzles to receive points. To me, it would have been more fun to compete head-to-head with my friends using the same sets of tests to see whose brain was more gigantic. The card game system fell a bit flat, and I don't see myself going back to the multiplayer mode very often.If you have a puny, atrophied brain, spending some time with Brain Challenge will make you feel better about it. The graphics aren't much to look at but the menus are sharp and easy to navigate, and the controls are intuitive. There are some issues with the tutorials and multiplayer, but the basics of a decent educational puzzler are here.", "date": "Mar 11, 2008"}