{"name": "Burnout Revenge", "name_review": "Burnout Revenge", "ref": "https://www.ign.com/articles/2005/09/09/burnout-revenge-3", "text": "Criterion set quite a task before itself: create a sequel to what is arguably the best arcade racing title ever, Burnout 3: Takedown. Said game was praised left and right not only critically and by gamers everywhere, but by essentially everyone in the IGN offices, which is a very, very rare thing.  The answer to the challenge is Burnout Revenge, the fourth game in the highly acclaimed Burnout series. As was the case with the first and second follow-ups, Criterion has introduced a few new major changes that aim to enhance an already near-perfect arcade driving experience. Has Criterion succeeded in raising the stakes yet again, or had it previously set its own bar too high? Well, maybe a bit of both...  Checking Traffic With the original Burnout, Criterion set the foundation for what would become this generation's best arcade racing series with quick-as-lightning cars, exceedingly responsive controls and brutal wrecks. Burnout 2: Point of Impact took the first game's exhilarating crashes and turned it into the standalone, and now legendary, Crash mode. Burnout 3: Takedown added the ability to actually fight, grind and take out (or Takedown if you will) opposing cars, giving its racing modes a more battle-esque feel and giving birth to Road Rage. All of these additions were of brilliant design and implementation and resulted in unarguably better games each time.  The shiny new toy in Burnout Revenge is the ability to check traffic, or slam same-way vehicles from behind and send them into other traffic or your foes. As this is the biggest addition to the series this time around and is a major part of every mode in the game, in many ways the overall success of Burnout Revenge lies on checking traffic's ability to expand the series in a new, and more importantly, better, direction.     In some ways it does, but in many ways it's sort of a side-step (or even misstep) for the series. Let's start with the good:  Checking traffic looks cool as hell and can cause some seriously awesome mid-race crashes. Tossing a vehicle four car-lengths forward, only to have it come back reeling over your windshield at 200mph is sweet, especially when a bus is involved. Checked traffic also has the tendency to toss opposing vehicles into the air like a moving ramp, and since the game likes to slow down and show you how you took out your opponents, you'll get many nice views of your rivals taking off like a rocket, only to end up in some fiery disaster who knows where a matter of seconds later.   Burnout Revenge Guide    Conquer the World Tour. We'll show you how (to explode). Get the guide now! The ability to check traffic also adds to the returning Road Rage and Crash modes. Road Rage is much the same as it was in the last outing, only now that you can toss vehicles at your targets you've essentially got unguided rockets at your disposal, which we're always fans of. Road Rage is still at its best when you're trading paint with a rival car, but tossing a cab through its windshield is quite rewarding. These mobile missiles also help with Crash a fair bit as many of the junctions are so large you couldn't possibly cover them yourself without a bit of help. We'll come back to Crash shortly, though.  Now, the bad (or at least not so great):  Firstly, the new Traffic Attack mode pales in comparison to the additions of Crash and Road Rage in the last two Burnout titles. Sure, it's hard to three-peat, but Traffic Attack still seems like the weakest new mode the series has seen yet. It's not that the mode is frustrating or time consuming, but rather the opposite. As the mode's sole goal is to plow into other traffic for points, it's quite easy to finish every Traffic Attack event with a gold medal the first time through. The first time or two is kinda fun, but it just gets old rather quickly. Luckily Traffic Attack events aren't too common or very long at all (you might spend 15 minutes of your total singleplayer career playing them). So in reality, Traffic Attack is basically a throwaway.  Something that has a more lasting impact on the overall game though is that checked traffic is there for your benefit and your benefit alone. Computer-driven opponents seem incapable of taking you out with a vehicle they send astray, meaning that you now have access to a weapon they in effect don't, giving you a definite edge. You also don't need any skill to use checked traffic, so it's very easy -- and quite common actually -- to take out a rival without doing anything but plowing through same-way traffic. Sure, you lose a small bit of speed, but your gain in boost makes up for that somewhat, and your wave of chaotic destruction that'll take out any opponents nearby certainly makes up for that. Again, it can look pretty cool, but it makes races unbalanced.    Easy Does It The ability to plow through same-way traffic, that is, anything but buses or large trucks, makes it that much easier to keep your car in one piece. One of the absolute best aspects about Burnout as a series up until now has been the constant fear of crashing, a fear that could become almost overwhelming at times. Cruising down a highway, around bends and through intersections at 200mph+ with five rivals on your tail used to be a white-knuckle experience, but as you can drive straight through about half the cars in the game now a fair bit of that has been lost.  Later in the game it becomes quite easy to protect any lead you've gained as well. As you get to roughly the sixth ranking in the game (out of ten ranked segments) you begin to unlock Crashbreaker Races, Crashbreaker Eliminators and Crashbreaker Road Rages. As the name would apply, your vehicle is now armed with a Crashbreaker just like in Crash mode, so if you bite the bullet you can pull the trigger and pop a couple caps in your rivals' asses.  This works well for Crashbreaker Road Rages, though for Crashbreaker Eliminators and especially Crashbreaker Races (since they're more common) you essentially have an extremely powerful defensive mechanism. Cars no longer fly past you with ease after you've crashed as you can now just simply take them out with you.  Burnout 3 introduced Aftertouch, which in effect is a much more simplified (and infinitely more fair) version of this. While it did help you keep opponents from passing you after wrecking, it took skill to steer your wreckage well, your opponents could easily dodge you and most of all, if you weren't airborne you weren't really going anywhere.  With Crashbreaker Races, so long as you have boost you can set off your Crashbreaker after wrecking. It's much more common than not to take out three or four opponents with one explosion, effectively nullifying your crash. You can basically keep yourself in the race every time you total your vehicle without problem, so long as you use a car with a reasonably high (meaning wide) Crashbreaker Force rating. It wouldn't be quite as bad if all of the cars with bigger and wider Crashbreakers were slower, but with one of the easily attainable cars at the highest echelon you can trade roughly 5mph of speed for a 6X increase in Crashbreaker Force. The choice there is simple, really, though quite unfair.     And again, just as checked traffic is a weapon that only you can use, so are in-race Crashbreakers. Of course though, thinking about this from a design perspective, if your enemies could take you out with a stray car you've never seen or made it practically impossible for you to pass them after they've wrecked, it wouldn't be much fun. So it's understandable why the computer-controlled cars can't take you out with these means, but that doesn't mean it's any less unfair and unbalanced in the end.  Everything Else is Pizza While we've basically just proclaimed to the world that one of Burnout Revenge's main aspects is not as fun as it used to be, it's not the end of the world. In fact, almost every other aspect of the Burnout series has been improved upon, brushed up, spit-shined and stepped up in some fashion.  The game's track design, for instance, is absolutely fantastic. While we'd still like to see more of the massive 180+ degree turns that made up large parts of Burnout 2, the series' course design has never been this natural, fluid or possibly even fun.  One improvement to the courses is that they're now designed for battle. While taking down cars in Burnout 3 was some of the most fun we've ever had in a racer, the tracks weren't exactly designed for fighting. That was cool in some ways as you had to invent your own Takedown spots sometimes, but it wasn't as fun as it is this time around with many sections of the tracks having been built specifically for Takedowns. When you're tire-to-tire with a rival and you spot a thin three-pronged archway in the distance, you know one of the two of you is in for trouble.  If you remember the Chicago-esque level from Burnout 3, Downtown, the track contained a string of pillars that held up the city's elevated train system. You either had to race between them or to one side, but once you picked a lane it was a straight shot. Burnout Revenge features a somewhat similar section in its Motor City course, though this time the pillars are scattered about with little to no safe straightaway in site. While you're battling it out here with opposing vehicles, the same pillars that could mean your doom can quite easily meet your rival's front fender. The game features a whole slew of Takedown setups like this and every one helps to exaggerate the game's increased focus on battling.    While that's cool, the more impressive aspects of the course design this time around are the newly added alternate routes and shortcuts. Blue lights mark alternate and possibly shorter ways to take the course, but these routes often come with a major risk factor. While you might be able to shave a couple seconds off your lap time by taking a quicker route, you're more likely to meet the hard side of a pole this way.  The shortcuts generally provide the coolest jumps in the game as well. As they sometimes need to cross over the main course, you'll find yourself catching massive air as you fly over your competitors before either entering a narrow alleyway on the other side of the track or slamming into the side of a building. Again, risk vs. reward.  The natural flow of the alternate routes is simply outstanding. You might pop out of one back road and head naturally into another, or exit a tight alleyway, cross the main course and crash through a set of gates to continue on your shortcut. It sometimes feels like the shortcuts are the main route, a hallmark of the excellent overall track design.  Some of the courses are so replete with alternate routes that you're able to stick to them well over half the time during a lap. But while these shortcuts will net you a few extra seconds, none of them result in massive leads, meaning that you're still capable of winning a race even if you completely ignore them. Some of the Burning Lap events basically require you to take a fair number of shortcuts as they're very time-oriented, but races allow you the option of racing where you want, which we really appreciate.  A Bit of the Old The track design also brings back a few fond memories of the courses in Burnout 2. Some tracks feature the wide, looping turns that were so common in the second game that were mostly absent in Burnout 3. A few of us around the office are big fans of these sections as they're the perfect place to pull off a five second powerslide, which is always neat-o.     Even more than the tracks though, the general car design harkens back to the original designs featured in Burnout 2 quite a bit. The cars in Burnout 3 were essentially copied versions of real-life cars, and though we miss taking a fakely-named Ferrari 360 Modena through our favorite crash junctions, it's cooler to see what Criterion can come up with on its own, especially since the series' original car designs are quite excellent overall.  Crash Crash mode is arguably better this time around than it was in Burnout 3. Much to the delight of most of us around the office, all of the icons have been removed. While this means no more boost or insta-Crashbreakers to grab, it also means players aren't always gunning for the 4X multiplier on a junction, which essentially narrowed each section's tactics a ton. In other words, it's still possible to pull off a successful crash even if you mess up your original plan.  If you've been keeping up with Burnout Revenge's progress, you'll know that Crash now begins very much like a golf game. You'll see a starting meter on the left side of the screen, identical to a swing meter in many golf games or a kick meter in some football titles. Hitting a successful takeoff means hitting the right boost level and nailing the accuracy on the bottom part of the ~swing~.  Missing the meter causes one of two things: a quick restart if you're playing singleplayer or a quick change in plans. If you're going at it alone it's somewhat annoying to miss the meter as you'll just end up restarting anyway. Missing it when playing with buddies is a different story though as it requires you to think on your feet. As many of the junctions are multi-tiered, even many of those that intend for you to hit a massive jump and land on the top part of a multi-level freeway can still offer up some great crashes below, even if the end result is a less than ideal score. So while messing up your takeoff will likely result in a lower score, it's still possible to pull out a decent pileup if you can adapt to the environment, traffic, your speed and trajectory, which is neat.  Speaking of multi-tiered environments, the Crash junctions this time around are much bigger and more separated than they've been in the past. A junction may have you pass through two intersections before arriving at the third and biggest one, so in order to maximize your score you'll need to check a couple hapless cabbies into the first two intersections and let them cause some destruction for you while you take out a bus in the third intersection. Some junctions have freeway exits that essentially make it impossible to get the bulk of the vehicles without using checked traffic as an ally.  While essentially having to rely on checked traffic to nab high scores is cool, it also leads Crash to be a little more random than before, which can be a tad frustrating at times. Not enough to deter the overall fun mind you, but it can be somewhat frustrating when you see your buddy do something and nail most every vehicle, while you do the exact same thing and come in much lower because a checked car swerved this way instead of that. Yes, you can aim checked vehicles, but they're not exactly precise instruments of destruction so relying on them is basically a form of gambling.  So overall Crash is better this time around, though there will probably be folks out there who preferred the mode as it was in Burnout 3. We still miss the $100,000,000 scores of Burnout 2, but alas it's no longer meant to be...    Multiplayer and Online Ever since Crash was introduced in Burnout 2 the series has been great for simultaneous as well as hot-seat multiplayer gaming. Burnout Revenge keeps things interesting by introducing two new modes for multiplayer, Traffic Attack and Crash Tour.  Traffic Attack is simply a split-screen version of the singleplayer variant, though it's actually a little more fun than playing alone since it's harder to beat a person than a score, making each check feel more important. Still, you'll get your fill rather quickly and move onto the other events.  Crash Tour on the other hand is good fun. It somewhat resembles Crash Party in that up to six players can have a go at a various Crash junctions while competing for an overall total score, except that your goal is to take the least amount of ~strokes~ instead of gain the most amount of overall money. The basic idea is that each junction has a target dollar amount, and each player has to replay each junction and add onto their score until they meet that target. It's very similar to golf in that the player with the least amount of turns taken wins. It's a fun and refreshing take on Crash Party.  The standard multiplayer races, Road Rage, Crash Party and Crash Battle are all still present and essentially are the same they were last time around, so really the only thing that didn't make the transition from Burnout 3 to Revenge is the co-op version of Crash.  All six modes of play are available online with the returning online modes working much as they did last time out. Crash Tour is different online than it is offline, though. As players wouldn't want to sit around while l33tRaVeR69 takes seven turns to finish a junction, the mode had to be compressed a little. Rather than playing for strokes you play for points based on ranking, and everyone moves on to the next junction once a player has reached the target amount. It works OK like this, but it's not quite as cool as it is offline. Still, it's a decent alternative to Crash Party if you're looking to mix up the rules.  The overall online aspect has changed in terms of both rankings and player grouping. Firstly, the game has taken on a Party system, much like that found in Halo 2. You can add a group of buddies to your current Party and then said group will move together into each mode. This makes it easy to keep Road Rage teams together as well as keep track of player scores across a series of event types.  The online mode has also changed its ranking system in that total wins or Crash damage no longer dictates player rankings. Instead, Criterion has instituted ELO ratings, much like Rainbow Six 3 uses for its online rankings. Your score will increase faster for beating better players or decrease faster for losing to lesser players, making it more ideal for the top players to race against others around their own level. Separate ELO ratings are kept for Crash and Race modes, so that gamers who prefer to play only one of the two types are still able to hit the top of the list.  The ELO system has worked well in Rainbow Six 3 and a similar style of rankings has worked well for Halo 2, so we're excited about this system. It's hard to judge how well it works without having thousands of people online yet, but from what we've seen it's a nice improvement over the simple stat tracking of the last game.     Great Looks, Great Sound By now you've probably seen plenty of footage and screens from Burnout Revenge and may have even played the demo, so you know how good this game looks. While from a quick glance it may not seem like a massive improvement over Burnout 3, the game features much more trackside detail than the previous title. The environments are more fleshed out, though as you're blurring by at mach speed it's sometimes hard to appreciate the finer details.  The engine and environmental surround effects have been tweaked a bit from last year's title, but that game sounded so good that really no improvement was needed. The audio effects are more animalistic this time around as you'll hear bit of things like growls, screeches and such hidden in the sound effects that simply cannot be machine-made. It's more movie-like than realistic, but it perfectly fits the style of the game. The audio is once again freakin' awesome, and that's really the only way to put it. And yep, Xbox gamers will be pleased to know that custom playlists are supported, though the soundtrack is a little better this time around.  Conclusion While not perfect, Burnout Revenge is an excellent addition to the franchise. The game's track design is simply phenomenal, the break-neck speed is exhilarating and there are very, very few games on any current console that control, look or sound better than this.  A couple design decisions that may have sounded good on paper keep it from being the best Burnout title yet, however. The ability to check traffic and use Crashbreakers in later races wind up making the game too easy overall and take away the fear of crashing that was so prevalent in past Burnout titles.  But even with its imperfections, Burnout Revenge is a must-buy title for any fan of the last game, which is pretty much everyone with an Xbox or PS2.Burnout Revenge is a game ahead of its time and, as such, belongs here in the next generation. EA loses a few points because this title was released last year on current-gen consoles and doesn't add much in the innovation category. But Burnout Revenge proves you can successfully take a current-gen game and port it into a great next-generation experience. This is, of course, something we don't want to see made into a trend, and it's still difficult to recommend a purchase to anyone that already owns the current-gen title. But for everyone else, Burnout Revenge is the first white-knuckle racer on the 360. Solid single-player mode and excellent online and multiplayer modes will keep you coming back for a long while.", "date": "Sep 9, 2005"}