{"name": "Spider-Man 2: The Hero Returns", "name_review": "Spider-Man 2: The Hero Returns", "ref": "https://www.ign.com/articles/2005/09/13/spider-man-2-the-hero-returns", "text": "Spider-Man spins more than webbing -- he makes gold. So it's hard to blame Sony Pictures Digital for going back to the well again after a series of games based on the second film and a short string of horrendous 3D titles. Spider-Man 2: The Hero Returns is a pretty nice gesture from Sony to make us forget how truly awful those 3D games were, and a straight Spidey platformer is something gamers would have certainly preferred to, say, Spider-Man 2 Pinball. The only catch is that this territory has already been mined once on mobile, and while it didn't follow the exploits of Doc Ock, the game play wasn't all that entirely different: Spider-Man by Indiagames.   (Indiagames' game is pretty much out of circulation now, leaving Spider-Man 2: The Hero Returns with the Spidey platformer arena pretty much all to its own.)   Spider-Man 2: The Hero Returns chronicles Spidey's efforts to stop Doc Ock from ravaging the city. Before dealing with the tentacled menace, though, the webslinger must plow through a string of fairly bland, non-descript baddies, like thugs and security guards.   The move set and general overall ~feeling~ of being Spider-Man elevates the game above basic platforming tedium. You can stick to walls and crawl up them, wrap bad guys in webbing, smash through barriers by creating a webbing ~slingshot,~ and pretty much swing through the air like a trapeze artist. The number of moves, plus the addition of spider-sense and super strength is well-appreciated. Spider-man is able to easily engage foes in fistfights or kickfests and come out the winner.   The levels offer many challenges. Some are as simple as ~find the switch~ puzzles, but other force you to weave your way through labyrinths and take some pretty decent leaps of faith, just like Spider-Man does. I was a little discouraged to find out that this superhero cannot swim. It kinda kills the mood -- I'd rather they just didn't make any sequences that took place over water, and just has Spidey unable to land on, say, spikes.   Spider-Man 2: The Hero Returns has good control. I tested the game on a Nokia 6620, and found myself comfortable with using the numberpad to get around. Spidey's jumps are huge and with the direction keys, you can kinda ~nudge~ him in the air to land on a particular ledge. It's easy to attach to walls and ceilings, and the context-sensitive switch between webbing and fighting on the ~5~ key works fine.   The game isn't just to make your eyes bleed, though. It's clean and all of the characters are easily identifiable, but there isn't much flash to the proceedings. However, clean -- that's still worth something. The comic book colors are pleasing to see. The game starts off with a strong theme, and the in-game sounds aren't too bad. Webslinging is accompanied by an appropriate ~thwip!~  Spider-Man 2: The Hero Returns is a pretty decent little platformer that grants fans access to the webslinger's moves. Mobile gamers that played Indiagames' previous efforts might suffer from a little dj vu (and I know I did), but this should be new ground for most. If the previous set of ~Spider-Man~ titles didn't salt the earth for you, consider giving Spider-Man 2: The Hero Returns a download.", "date": "Sep 13, 2005"}