{"name": "GripShift", "name_review": "GripShift", "ref": "https://www.ign.com/articles/2005/09/14/gripshift", "text": "GripShift plays unlike any other driving game on the PSP. Hell, it plays unlike most driving games on any console, past or present. Most folks already know that GripShift, developed by Sidhe Interactive and Red Mile Entertainment, is what's known as a hybrid title. This usually means a developer blends two or more genres to make something (hopefully) fresh and unique. A good example of this would be Oddword Stranger's Wrath from former developer Oddworld Inhabitants. It combined first-person shooter elements with platformer elements to deliver one of the best game experiences so far in 2005.    Like most hybrid games, Oddworld Stranger's Wrath was intrinsically funky. GipShift is even funkier. And it's not the game's style or music that makes it so unique, but its gameplay. GripShift combines racing, platforming, puzzles and combat, for starters. And if that's not enough, the game's extra mini-games and track editor add another layer of funk to the package. But we'll get to those things later. For now, just know that GripShift wasn't meant to appeal to race fans. That is to say, it's meant to appeal to race fans, as well as combat, puzzle and platform fans.    Fortunately, the formula works in GripShift. Not perfectly, but it still offers a fresh, entertaining experience well suited to the needs of the mobile gamer. The game starts by letting you choose a driver among a pool of four, with two extra characters locked. This selection is purely cosmetic and won't affect the game much. Afterward, you need to select a car. You get a choice of four, each of which has different attributes such as weight, handling, top speed and handbrake turn. Unlike character selection, making the right choice in cars is paramount in GripShift. Luckily, you can swap cars whenever you want. So if a certain track is giving you trouble, you can try finding a car with better handling, etc.     After vehicle selection, it's off to the races. Gripshift's main appeal, the single-player challenge mode, offers over 70 tracks split between five difficulty settings, including: easy, intermediate, hard and insane. Every track in challenge mode has various goals, too, including collecting stars and special icons and just beating tracks under a set time limit. Beating each of these goals gives you credits, which you need to unlock harder tracks (to finish the game) and bonuses (because they're fun). Usually, you can't progress to harder tracks and subsequently, hard modes, if you haven't finished easier tracks first. Having said that, you can skip five tracks in every difficulty setting should you ever get stuck. However, you still need to fulfill credit requirements to unlock tracks in the harder settings.      Easy setting acts as a tutorial to help you get used to the controls. And damn, will you ever need to get used to these controls. In GripShift, cars don't handle like you'd expect. In fact, they barely qualify as cars they handle so strangely. It's almost as though every track is covered in a layer of muck and ice, making every car in the game (regardless of handling attribute) drive erratically. Throw in the fact each track hangs in mid-air with no guard railings, and things get very lethal very quickly. It definitely takes some getting used to. Here's one way to put it: it feels like flying a spaceship, Newtonian physics and all. In fact, until you reach that blessed moment when you've mastered the maneuvering capabilities of each vehicle you'll be hearing a lot of this:     ~Aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaah!~     Control aside, GripShift offers a bunch of really cool tracks. Every one of them boasts unique design, obstacles and platforms. You'll contend with loops, sharp turns, narrow roads, moving platforms, teleporters, jumps, explosives and the odd elephant standing in the middle of the track. Really, it's that crazy. Certain tracks force you to go through a series of checkpoints while others just ask you to make it to the finish line. This is where the puzzle portion of the GripShift formula comes in. With the number and style of obstacles on some of the tracks, you actually need to solve them in order to succeed.     As strange as it may sound, solving tracks in GripShift is pretty fun. You'll die an awful lot, for sure, but GripShift is surprisingly addictive. Even if you die 20 times in a row, you can't help but keep trying. Throttling through loops and sailing through the air between platforms is good fun, make no mistake. And once you're used to the controls, dodging obstacles and exploring tracks at high speeds goes from being a frustrating experience to a rewarding and enjoyable one. Yes, falling to your doom sucks, but load times in GripShift are short and sweet, unlike many other PSP offerings.     Still, the crossing of so many genres makes GripShift feel a little too whacky. Those looking for a good racer won't really find it in GripShift. By the same token, those looking for a platformer or action game may find GripShift to be too funky for its own good. By combining all these genres, you definitely get a unique experience, and as long as you understand what you're getting into then GripShift will deliver. But this doesn't change the fact that the first hour or so of the game feels all sorts of wrong because, well, you're in a car and cars are meant to go fast. They're not meant to stop, jump on a platform, boost, jump, turn around and dive through hoops. Still, get used to it and it's a fun trip.    As you progress through challenge mode, you'll unlock tracks in race mode. Race mode itself divides between four modes, including: single race, time challenge, championship and practice. Single race lets you drive unlocked racetracks from challenge mode. Here, you'll race against three opponents. But it's up to more than your driving skills since you (and your opponents) can acquire weapon upgrades scattered throughout each track. These racetracks are pretty fun, just not as fun as the lunatic courses in challenge mode. Time challenge and practice modes are pretty self-explanatory, and less riveting than race mode, but it's cool that they're in the game anyway.    Bonus games in GripShift come in two flavors: single player and multiplayer. You can play all but two of GripShift's six bonus games alone or with friends, not including Playground, which is a singleplayer game unlocked at the start of the game. Ever other mini-game is locked. As you gather points in challenge mode, you can unlock Penguin Bowling, where you ~ roll~ your vehicle down a lane and crash into penguins. Or Soccer Crazy, where you use vehicles to ~kick~ soccer balls into a goal. Most of the mini-games draw on Gripshift's slip-n-side handling dynamic in one way or another, so all the practice in challenge mode comes in handy. And they're all fun, too, even though some (like the two mentioned above) wind up feeling a little similar.    Playing GripShift with friends is as fun as you'd expect. It may be frustrating to watch yourself die a hundred times trying to finish a particular track, but watching friends plummet to their death on a track of your own creation using GripShift's track creator is all kinds of awesome. Plus, the multiplayer mini-games are fun too. Of special note are Deathmatch and Reverse Tag, two multiplayer-only mini-games. Deathmatch is just like it sounds. You and a friend fight to the death in arenas stocked with weapon upgrades. Whoever gets five ~frags~ wins the event. As for Reverse Tag, whichever player finds the GripShift icon becomes ~it.~ Competing players need to crash into the ~it~ player to become ~it~ themselves. Whoever is ~it~ for two minutes wins.     GripShift looks pretty good, although its style isn't unique or inspired. Design for each of the cars looks decent, but forgettable, and the tracks themselves look equally ok. However, the menus and interface look polished and cool, and the game has a good sense of speed overall. Plus, GripShift boasts slick animations on the track as well as in track selection and other areas. You can play in a variety of worlds, too, and although they all look good, they won't really blow your mind. As for sound, GripShift packs a number of original hip-hop tracks to race to. Whether the musical selections match the action is open to debate, but the quality of the music is good.  GripShift half succeeds at what it sets out to do. It certainly includes elements from all four genres it says on the box, but its the implementation of said genres that decides whether a game succeeds or not. While GripShift does in fact offer varied, unique and entertaining gameplay, it feels like these genres never really gel together as well as they should. Still, its fun once you get used to the idea. Plus, the mini-games, track editor and multiplayer tracks help establish GripShift as a solid title. Rent it if youre uncertain.", "date": "Sep 14, 2005"}