{"name": "Outdoor Adventures 06", "name_review": "Cabela's Outdoor Adventures", "ref": "https://www.ign.com/articles/2005/09/16/cabelas-outdoor-adventures", "text": "It used to be that hunting videogames were right up there with waiting in line at the DMV in terms of thrills and excitement. But all that has changed... at least in my town, when the DMV implemented a ticket system so that people could wander about and munch on some hot dogs and enjoy themselves without having to stand in line. As for videogame hunting, Cabela's Outdoor Adventures stands firm in the stance that hunting is for the amazing patient and nobody else. So for those who are excited about a decent simulation that nails the experience of watching a decoy for an hour or few to get a good shot, this is pretty much the one for you.   Cabela's Outdoor Adventures sticks to the genre in that it provides a bunch of different locations, each with multiple seasons, which can be explored for hunting trips. There's a wide selection of rifles, shotguns, bows, handguns, and fishing rods to be used to nab some animals. There are also plenty of accessories such as scents, decoys, and stands that can be used to help out. The beginner mode supplies an animal radar system and provides an auto-aim feature, but the meat of the game is in the simulation aspects. This means lots of long, long, long waits where you forget what you were doing, go grab a sandwich, and then come rushing back to the controller because you just remembered you were supposed to wait for some deer to show up. And then you fall asleep.    A good friend of mine once described hunting as a combination of meditation and primal killing instinct. The killing instinct makes sense, as does the meditation bit, but when placed into a game there's that whole fun factor that is sorely lacking unless you have a desire to keep your hunting and waiting skills honed to a razor-fine edge. If you thought that the Splinter Cell games needed levels that were five hours long, then this is for you.   Fortunately, Cabela's Outdoor Adventures has gone a little ways to improve the look of the game. The models are better detailed and the textures have improved a bit. It's nothing to get excited about, but it's less of an abomination than before and has moved on into the realm of decent to slightly above decent. The land has plenty of terrain to explore and there's a good variety of the different locations in the game.   And yet there are still plenty of technical problems that get in the way of some of the realism. The game is all about stealth and sneaking, but for some reason the developers made it so that walking slowly is damn tough. Push the left analog stick a teensy tiny bit and you're sneaking. You feel like you're almost upon a buck, but then your left thumb slips ever so insignificantly forward and you're off on a full run, scaring your prey to the other side of the map. Crouching is much easier for slow movement, but there's no need for a tiptoe to be such a delicate maneuver.   The forest is beautiful here, but the trees can be such a beast. Items in the game are given a large boundary box that make the character stop dead a few feet away from a tree or a fence. The problem is that two trees that are a good eight feet apart will form an invisible wall. Many a good hunt was ruined while slowly tracking a buck by having to completely reroute and waste time.   And yet none of these problems come close to the absolute terror that can be instilled by the fishing system. There's no need to fish here, really. And there certainly isn't a need to have a fishing mini-game that plays out the exact same way every time and requires a strategy of waiting for the game to tell you what buttons to push. It's beyond awful. And having a ~challenge~ where you need to catch 10 fish is pure punishment.The presentation of hunting has been improved, but the ~action~ of hunting is still a mystery for those who are fans of something called a ~game.~ With so many glaring errors and a fishing system that was developed in a couple days there's little to like. As a simulator of a long and slow sport, Cabela's Outdoor Adventures succeeds, but can't it be a little more fun next time? Please?", "date": "Sep 16, 2005"}