{"name": "Frantix", "name_review": "Frantix", "ref": "https://www.ign.com/articles/2005/09/20/frantix", "text": "Console gamers usually don't go for puzzle games. That is, unless there's some wildly competitive aspect to it. But for the most part it's safe to say console gamers prefer action, adventure and sports titles. When it comes to mobile gamers, though, the story changes somewhat. Gamers on the go enjoy the usual genres mentioned above, but they have a tendency of warming up to puzzle games more than their stationary cousins. And for good reason seeing as puzzle games often boast the kind of pick-up-and-play gameplay suited for mobile gaming.    Frantix, developed by Killer Game, is one such mobile-friendly puzzle game. Billed as the first character-based 3D puzzle-solving adventure for the PSP, Frantix delivers quick bursts of gameplay through 100-plus stages. The longest stage shouldn't take longer than a few minutes to beat, with many of them taking only a matter of seconds. Now if that's not handy when playing on the bus or when waiting for class to start, nothing is. Frantix saves the game automatically after every stage and whenever you quit to the main menu, so there's also no fear of losing your progress.  For those who don't know all that much about Frantix, it's a very simple, straightforward puzzle game where players control one of four characters in a bid to collect gems. Each stage in Frantix has a specific gem requirement, so once you collect enough gems all you need to do is find the exit and proceed to the next stage. In order to score these gems, you need to solve a myriad of puzzles, ranging from quick and easy, to quick and frustrating, depending on the stage. Usually, these puzzles require you to collect the aforementioned gems in a particular order. Certain doors will only open when you've collected enough gems of a particular color, requiring you to hunt yellow, blue, red and green gems accordingly.   Of course, actually getting to the gems (regardless of color) is the hard part. You need to contend with all sorts of puzzles to unlock doors and make your way through the game's six different worlds. The first of these worlds, named Tutorialandia, teaches you the basics. You'll learn how to push and pull crates, collect gems and how to navigate the environment. You need to make your way through quick sand, water and territory patrolled by the game's many creatures. Lastly, the tutorial teaches you about the game's power-ups that increase your speed (or slow it down), make you invincible and let you walk over dangerous surfaces.    After you leave Tutorialandia, the main ~adventure~ begins. And for the most part, it's a decent ride for puzzle fans. Puzzles are clever and well designed, though they're nothing revolutionary. Still, they're generally fun and require quick reflexes and equally quick brainwork. There's also a ton of them. Frantix offers over 100 stages crammed with all sorts of obstacles in need of solving. Usually, these puzzles revolve around the items strewn throughout environment. You'll need to move crates over water to form bridges, plant explosives to kill enemies and use walls for cover. There's also the usual lot of levers, switches and traps to exploit. And since every stage in Frantix is timed, you need to be damn quick about everything. Dying won't result in heinous load times, though. Stages load moments after death.   Alas, not all is perfect in the land of Frantix. It's almost as though the developers were so dedicated in making a streamlined, accessible experience that they forgot to include a bunch of ~fun~ necessities in fear that they would clog the experience. Take, for example, the total lack of story. If a company plans on making an ~adventure~ game then story needs to make it into the final product. Even if the plot is lame and the characters are less-than stellar, it's still a very necessary part of the formula. Instead, Frantix sees you running around collecting gems, pushing crates and pulling levers for no reason. You're not a treasure hunter or gem collector, just a random dude solving puzzles for the sake of solving puzzles. That aside, it feels like something's missing in Frantix.      The three different characters look different yet act the same. There's no real reason to choose one over another, except for aesthetic reasons. And since the characters look small anyway, there's almost no reason to have more than one. More over, Frantix only has one game mode. There's no multiplayer mode or unlockable content, aside from unlocking levels as you progress through the game. And the menu and interface, while decent, is very minimal. And not in that cool, Zen-like way, either. It all feels somewhat rushed to be honest.    Then there's the camera and control of your character. Frantix doesn't offer you complete control of characters. Instead, characters run in four directions along an invisible grid. And there's no walking or jogging. It's full sprint or nothing. Which would be fine, but Frantix often requires a degree of finesse to navigate obstacles safely. Sprinting through a level full of quick sand, lakes and lava just isn't fun sometimes. About the only thing you can do is tap on the D-Pad or thumbstick and hope your character doesn't dive into a river or a pit of quick sand. Also, moving crates is awkward. Instead of grabbing a crate by pressing a button, you need set a crate next to a wall, press toward the wall using the D-pad then push the opposite way. It's not the most intuitive way of moving things around.    Frantix lets you toggle between three different camera angles by pressing the triangle button. You can choose a top-down view, 3/4 view or a close-up third-person view. The top-down and 3/4 views are definitely your best bet, while the close-up view is next to useless. You can also cycle through four different perspectives using the L and R buttons. While the camera isn't broken, it certainly has its share of issues. You won't see enemies hiding around corners at times, or example. At other times, the camera makes certain obstacles hard to make out, making premature death an issue. This doesn't happen often, but it happens more than it should. While great for gamers on the go, Frantix winds up feeling like a rush job. There's no multiplayer to speak of, or any modes beyond the main single-player quest, for that matter. And the puzzles, while plentiful and reasonably well designed, can become frustrating due to funky control and camera issues. Frantix needs a little more polish, a few extra game modes and a lot more personality. If you love puzzles and don't mind the lack of multiplayer (and snazzy menus and extras) then you may want to check this one out. Just play a friend's copy first.", "date": "Sep 20, 2005"}