{"name": "Knockout Kings", "name_review": "Knockout Kings", "ref": "https://www.ign.com/articles/1998/12/04/knockout-kings-3", "text": "In the PlayStation's three-plus years of life, there hasn't been a single boxing game. Oh, sure, there's been talk over that period of time  in fact, if you were one of the die-hards who jumped on the PlayStation in the system's first month in the US, you probably noticed a screen-shot of a boxing game. But it never came out.  Well, who else but EA would break the drought? Using its keen sporting resources, EA Sports set out to start out its own boxing series on the PlayStation. While Knockout Kings isn't EA Sports' first attempt at the sports (4D Boxing on the PC, Toughman Contest for the Genesis, and Foes of Ali on the 3DO), this try on the PlayStation is an admirable effort. But it does have the usual quirkiness that accompanies boxing games trying to simulate it instead of taking exaggerated, arcade-style liberties.  The best boxing games are games that don't take the sport seriously  case in point, the classic Super Punch Out from Nintendo. But there's a whole slew of boxing fans out there who crave the real thing, and that's where EA hits  hard. You want the real fighters? How about 38 of them from past and present circuits. Including (take a deep breath):   Muhammad Ali, Evander Holyfield, Sugar Ray Leonard, Oscar De La Hoya, Archie Moore, Floyd Patterson, Sonny Liston, Ken Norton, Shane Mosley, Bob Foster, Pernell Whitaker, David Tua, Kevin Kelley, Jack Dempsey, Joe Louis, Roberto Duran, Leon Spinks, Rockey Marciano, Eric ~Butterbean~ Esch, Earnie Shavers, Carlos Navarro, Junior Jones, Virgil Hill, Lennox Lewis, Jake LaMotta, Danny Romero, Aaron Pryor, Larry Holmes, Ray Mercer, Marvin Hagler, Alexis Arguello, Ray Mancini, Terry Norris, Genaro Hernandez, Ike Quartey, Arturo Gatti, Michael Moorer, and Floyd Mayweather.  But if you need to tailor a fighter specific for your fight style and personality, you can design one from scratch. Decide how big he is, how he fights, and the little details such as facial hair and trunks color.  EA also recruited Jimmy Lenno, Jr. for ring announcements, Mills Lane as the voice of the fight instructor, and Sean Ogrady and Al Albert for play-by-play commentary. Plus, you'll fight in real rings like Madison Square Garden. So, EA Sports has got all the right players to make it the boxing simulation, but what about the gameplay?  The designers give a decent library of punches, from roundhouse to jabs to uppercuts, but unfortunately how they're executed, it doesn't feel like you're connected to the boxer you're controlling. It's a bit sluggish and unresponsive, and the way the controls are mapped out it just doesn't feel very intuitive. As much as you'd like to put in the strategy, most fights early in the learning curve end up being two boxers blindly and maniacally punching each other without any real rhythm or style. But once you figure out the somewhat-clumsy button combinations, you'll find the style and strategy boxing is known for.Honestly, despite being one of the deepest boxing titles I've ever plowed through, I have to say I just can't get into Knockout Kings. Yes, I love the graphics. Yep, the whole library of professional boxers sweetens the deal, too. The problem is control -- you have to memorize a lengthly laundry-list of standard punches. Not only do you have to know what the regular buttons do, but you also have to learn that those buttons, in combination with the R1 and/or R2 buttons do completely different moves. It's just not very intuitive.Controlling the boxer around the ring is also a little sloppy, since you really don't feel like you're in command of him. You push in a direction, hoping that he'll actually move there -- but sometimes he doesn't.Don't get me wrong -- if you're totally into the sport of boxing, you'll probably milk this game for all its worth because it focuses heavily on detail. But in my opinion, I'd rather boot up a game of Tekken or Street Fighter 2 to get my fighting aggressions out. Boxing just isn't exciting enough for me.", "date": "Dec 4, 1998"}