{"name": "Indigo Prophecy", "name_review": "Indigo Prophecy", "ref": "https://www.ign.com/articles/2005/09/20/indigo-prophecy", "text": "When was the last time you actually played a game where you cared about what happened to the characters, where you actually wanted to find out what happens next? If you're sick of generic shooters and reflex based games where high scores and headshots rule supreme, you'll definitely find solace in Quantic Dream's Indigo Prophecy. If you have a favorite chair or comfortable couch, this is the perfect game to sit down and play while wrapped in a gigantic, fluffy blanket and sipping hot cocoa with mini-marshmallows.   Right off the bat, you'll discover Indigo Prophecy to be a dark, brooding experience, as the opening sequence is definitely disturbing. Set in snow-covered New York City, the game continues to get darker as you progress and more sinister facts are revealed. Perhaps the most telling feature of how grim the game can get is the character mood gauge, which, when completely full, says your character is in a ~neutral~ state, whereas at empty your character is ~wrecked.~ In between are varying shades of depression. Despite the sometimes dismal, gripping nature of the storyline and atmosphere, it still remains an entirely engaging experience.   It's very apparent that the team at Quantic Dream really cared about making this game when I played through the introductory tutorial. Here, you're given a brief introduction into the game's action mechanics and general interface by a virtual representation of the game's writer and director, David Cage. You'll control a dummy model and perform a series of actions as you move around a mock movie stage. This stage setting is representative of the cinematic nature of the entire game; from the intricate, slow-motion action sequences to the picture-in-picture and split screen instances that advances the plot and conveys simultaneous action.    As a videogame trying to act like a movie, Indigo Prophecy really succeeds. In the game, you get to see sides of your three main characters you would never really expect to see outside of a theatre. You'll wake up, drink milk, lift weights, play basketball, dance with your girlfriend, play guitar, get dressed, wash your hands; the list goes on and on. You control almost every decision your character will make, right down to throwing dirty clothing in the dryer. While these details may turn some off, also know there are intricate twitch action sequences that play out like a Simon Says memory game on steroids.   Plot, characters, action!  Through Indigo Prophecy you'll mainly control three characters, the mentally ravaged Lucas Kane, icy detective Carla Vincent, and Carla's upbeat partner, Tyler Miles. Occasionally, you'll also control Markus Kane, a devout priest and Lucas' brother. Even though Tyler, Carla, and Lucas are the three main characters, it tends to be Lucas and Carla's storylines that are the most vital to the plot. Tyler, on the other hand, seems to have a more tangential relationship to the story, focusing mostly on his relationship to his girlfriend, the strain caused by his job, and also a basketball sequence with a coworker.   Every conversation in the game can take multiple paths. As soon as one is initiated, a time bar starts to decrease across the screen and above that are a range of conversation options. This works well to keep the player engaged in what's going on, as you'll have to stay focused on what's being said and decide quickly exactly what to ask. While sometimes almost every option can be selected, you'll often find you can select only three or four before the conversation ends.     This fits in with one of the major aims Indigo Prophecy seems to be trying to get across, which is to involve the player as intimately as possible with every action or decision that occurs. Whenever you're near an object that can be interacted with, a series of options will come up across the top of the screen. For instance, if you want to open a cupboard to the right of you to find something to eat, an option will pop up that indicates you should press and hold Mouse 1 and move your mouse up. You'll then need to enter another command to take the item out, and finish it off by entering another command to shut the cupboard. At first, this struck me as a very cool addition. In fact, it's even given a fancy name: MPAR, or Motion Physical Action Reaction.   While being able to directly control almost every one of your character's actions, such as using a semicircle motion with your mouse to climb down a ladder or unfurl a yo-yo, enables you to identify with your characters to a greater degree, it also adds an unnecessary element of complication in some sequences. Sometimes you're given the task of retrieving some items or covering something up before a time limit expires, say like the time before the police arrive. When you have to search to find where the items are to begin with, it doesn't help that you have to input commands to open, choose an item, and close a drawer. Instead of one command, there are three separate ones, making the task seem more like busywork than entertaining tension and highlighting the game's trial-and-error faults.   The time sensitive sequences also bring out one of the game's largest flaws: the character control. Indigo Prophecy is a game presented in a cinematic fashion. As such, the camera likes to hop around to highlight environments from certain set angles to infuse the scene with drama. Though the camera is fully controllable, it often gets stuck in close spaces or just won't point the right way regardless, making finding what you're supposed to interact with difficult and tedious.   The character control problem arises when the camera switches angles or you're forced to backtrack or turn around. For some reason, the directional orientation of your character freaks out, and you're character will wind up doing drunken figure 8's while you try and determine exactly which direction you need to press the directional keys to move forward. This flaw is annoying while leisurely strolling around the game world, but downright aggravating and cause to scream obscenities during timed sequences. However, the control issues by no means hamper the overall game experience, they're just sharply infuriating in short bursts.   An Action-Adventure, Sort of.  Indigo Prophecy enables players to actually switch playable characters while the game is going on, most notably between Carla and Tyler when they're investigating a crime scene. This feature works well, as both characters will notice different aspects of the scene and give a fuller picture of exactly what happened. Some areas of the game can actually play out differently based on what was done before. For instance, near the start of the game, how you decide to use Lucas to clean up a crime scene determines the details that come out in the ensuing investigation.    Since you're controlling characters on opposite sides of a struggle it gets confusing when they actually meet. While how the conversation proceeds is entirely up to the player, you'll most likely have grown attached to both characters. Inputting commands that seem to benefit one character over another is a painful process since you don't want to get either character in trouble.     To accompany all the character and environment interaction are twitch action sequences. There are two main types of sequences: pressing the directional and number pad keys in accordance with certain directional indicators or alternating between left and right directional buttons. These action techniques are put to use in sequences that would otherwise be much less engaging. In several scenes where a character is having a vision, players will have to properly press the indicated directions in order to see what is going on, otherwise their vision clouds over. Mainly, though, the game challenges players to replicate a set of button commands to successfully navigate treacherous obstacles and fight enemies. Despite the inaccuracies of the joystick movements on the Xbox and PS2, I found them to be more engaging than punching keys. The process becomes more confusing on the PC since you're forced to use several of your fingers to coordinate the sequences successfully instead of just your two thumbs.   On easy and medium settings these sequences are no trouble to get through, but on hard it can prove to be frustrating at times. This is mostly because if you screw up, the input commands are coming so fast it's difficult to determine exactly where the fault occurred. The game doesn't stop if you miss a command, so you'll wind up getting to the end of a sequence only to find that you'd failed. Also, sometimes even though you know which direction you want to move the joysticks, they don't precisely go in the correct direction, causing you to have to start the whole process over again. That being said, these sequences are a lot of fun, as inputting the correct button sequences enables your character to perform some impressive acrobatic feats. The action of the game is well choreographed, and getting through a sequence undamaged gives you that warm, fuzzy feeling of conquering a complex task.   The game's story progresses in chunks at the start of which the player must choose who to play as, which can be either Lucas, Carla, or a few others. Picking one of the chapters lets you play through a bit of the storyline from that character's perspective. While it is a neat feature to be able to pick and choose which parts of the storyline to uncover, it really doesn't affect the gameplay. Regardless of who you pick to play as first, you'll still wind up playing the other storyline all the same.    Anyone who is already convinced that this game is what they're looking for may not want to read the rest of this paragraph. I've tried to not mention storyline specifics as much as possible, but I do need to make one criticism of the later developments. While the game starts out following each character very closely, even to the point where you'll pick out wine glasses out of a cupboard and sit down to do a tarot reading, the last few sequences seem exponentially more removed. You'll be up close with everyone over the course of a few days in the game, but then the storyline skips ahead about 20 days with no indication of what happened during that time. Undoubtedly, after the story skips ahead, you'll see characters in certain relationships that you'll definitely have questions about, but you won't get the answers. It almost seems like the development team just ran out of time in this area.   It Looks Fuzzy but Sounds Fantastic.   Graphics are not this game's strong suit. The PC version is a step up from Xbox or PS2, obviously, and offers standard visual optimization tweaks. Yet even with everything turned up, it still looks like a high resolution Xbox game. Edges are fuzzy, and textures in some places are bland and washed out. Though these may fit in with the game's theme of snow and cold, it doesn't look all that great. Sure, in some areas the game is pretty, but up close the details just aren't there. Then again, people aren't playing this game for the graphics, and they definitely get the job done.     The animations are stilted and awkward in spots, which becomes apparent when characters go to hug each other or enter rapid fighting sequences. The facial animations for speech don't match up well either, as their mouths tend to move longer than the speech coming out of them. Generally though, these inconsistencies can be overlooked, and much like the textural details they get the job done and shine in certain spots, such as the slow motion action sequences.   It's in the sound department that this game really manages to grip you. Scored by Angelo Badalamenti, who worked on the soundtrack to David Lynch's film, Lost Highway, it's filled with creaking violin compositions that grab hold of you immediately. It's one of those scores you can recognize again at the first hint of the first note. The sound completely makes up for the graphics in terms of creating a believable and tense atmosphere, adds a significant tension to the action scenes, as well as providing an excellent accompaniment to the mental states of the game's characters.   Indigo Prophecy's voice acting is equally as impressive, and lends a large degree of believability to the game's characters. Lucas sounds as disturbed as he is, the cheese factor is very low, Carla is appropriately grim, Tyler adds a more light-hearted and genuine element, and the surrounding characters do their parts well, and in some cases very well. This is an absolutely crucial element in a game like this, an element that if done poorly could sink a game, but here it's executed to a very satisfying degree.   There are also a number of licensed songs in the game, such as four tracks by Theory of a Dead Man, in addition to more diverse and upbeat funk and soul compositions. The Theory of a Dead Man songs can actually be switched on through the MP3 player in Lucas' apartment, and provide an extra intensity to opening the fridge and drinking some milk. All these tracks are well implemented in the game, and provide an excellent variety and change of pace from the regular soundtrack.    As with any game crafted with care, there are plenty of extras for players looking to stick with their characters after the main experience is complete. These include tons of extra artwork, special movies and interactive sequences, and making-of movies that can be unlocked as players amass bonus points. Bonus points are scattered in out-of-the-way locations as you move through the game, and really aren't that difficult to find. If you don't have enough to buy all the extras at the game's completion, it might be worth another trip through the storyline to find them, in addition to choosing all the different conversation options to see what you missed.   Though the game looks much better on the PC, it still feels like a console game. I had more fun playing through on the console version, specifically because moving joysticks with my thumbs was more comfortable and intuitive than coordinating eight different buttons with different fingers in rapid succession.  After a while, though, you get used to the keyboard system, much like how typing without looking at the keyboard soon becomes second nature, but the curve in getting there is much higher than with joystick control. However, the replacement of the L and R alternation sequences with the left and right directional buttons is much easier. You'll welcome the difference during some of the game's later sequences where you'll wind up dying or getting arrested just because your hands are tired. It's still a very solid game on the PC, and if you have no other choice it's definitely worth picking up. However, if you're interested in this game and have an Xbox or PS2, I'd try those out first, even with the PS2's longer load times.  Indigo Prophecy is not a perfect game. There are camera and control issues, the graphics arent stellar, and the action sequences can be imprecise at points. However, the games sound, story, and characters are so strong, and the variety of situations players will find themselves in is so large, that at no point is this a boring play experience. An average gamer can expect to put in about 12 to 15 hours to run through this game, though depending on how good you are with the action sequences you can definitely get through faster. However, if youre rushing through this game, youre not playing it properly. For anyone craving a new, twisting suspense story with a little action mixed in, youll definitely come away from Indigo Prophecy as a satisfied gamer, and will remember it for a long while after.", "date": "Sep 20, 2005"}