{"name": "Tak: Great Juju Challenge", "name_review": "Tak: The Great Juju Challenge", "ref": "https://www.ign.com/articles/2005/09/21/tak-the-great-juju-challenge-3", "text": "Can there really ever be too much of a good thing? Not, according to development studio Avalanche Software and publisher THQ, whose partnership has wielded two successful platformers in the original Tak universe. The continuing adventures of the pint-sized sorcerer and would-be hero to the Pupanunu people have sucked in a dedicated fan base of platformer junkies young and old alike. Now, Avalanche and THQ have created a third installment in the series, Tak: The Great Juju Challenge. But with three Tak games in as many years, has the franchise run its course? The answer, thankfully -- surprisingly, even -- is no. Avalanche has injected some fresh gameplay dynamics into the title that breathe new life into the straightforward platformer mechanics of old. There are still some paint-by-numbers moments in the game to be sure, just as there remain some technical shortcomings. But more often this latest entry into the Tak franchise delivers well-crafted, two-character-enhanced puzzles and the same humorous presentation that has helped define the series over the years.  The Facts  All-new Tak adventure Humorous real-time cut-scenes drive the storyline Compete in Juju challenges against other tribes Play as both Tak and Lok to progress through puzzles and levels New two-player split-screen mode enables gamers to join and drop at any time A wide assortment of levels ranging from prehistoric mountains to desert ruins Top Hollywood actors like Patrick Warburton provide voices for characters   Back to Tak's World When the boys at Avalanche Software sat down to develop Tak: The Great Juju Challenge, they decided immediately to take the game into a different direction. As a result, the title no longer continues with a storyline that revolves around main nemesis Tlaloc and his dedication to the humiliation of the Pupanunu people. The loss of his overbearing presence is missed because he was an entertaining character. The game has, however, retained the same exaggeratedly colorful and genuinely humorous presentation style of previous Tak titles. Through a mixture of fluidly animated in-game cut-scenes and rendered sequences (using real-time assets) we learn of the basic setup that drives the gameplay scenarios. With Tlaloc out of the way, the Pupanunu people have devoted themselves to other challenges -- Juju ones, to be specific. The tribe has entered its two greatest warriors, Tak and Lok, into the Great Juju Challenge, a competition that pits the world's best tribes against each other in so-called obstacle courses and mini-games. Naturally, Tak isn't thrilled to be working with Lok, who comes very close to being Neanderthal dense, and some funny cinematics ensue. These clumsy heroes are made extremely likeable, which is an accomplishment given that so many videogame designers try and fail to create similarly inspired characters. Not all of the credit goes to Avalanche's graphics and animation gurus, though. Superb voice work from Hollywood stars like Patrick Warburton help define each of the identities in the game.     The Juju Challenges, defined as obstacle courses, are little more than straightforward, platform-heavy levels designed around timed checkpoints. Gamers who played Tak or its sequel will by and large find a lot in common with these stage make-ups, which are wide open and filled with trails, ropes, pillars and other structures, all waiting to be explored. An on-screen timer counts down continuously (and if gets to zero, the challenge is failed), but players can add time to the clock by reaching checkpoints strewn about each location. As a result, gamers are always racing the clock, although sometimes there's so much time to spare that racing isn't exactly the correct way to describe it.   The Great Juju Challenge feels in many ways like an extension to previous Tak outings, which is both good and bad. Tak is tightly controlled through the large, robust worlds and players who appreciate old-school platforming will be impressed with the selection of run-and-jump obstacles in place. Simply maneuvering through some of the platform-laden locations can be fun and satisfying. Avalanche has also included a wide number of location types, from prehistoric mountains to desert ruins and underground caves, all of which feature unique puzzles and enemies. There are, however, some templated scenarios in the game that refuse to go away. Tak is too many times forced to beat groups of enemies before some doorways will open up, for instance, and likewise portals remain inactive until various checkpoints in levels have been reached. These basic rules occasionally seem forced in an attempt to extend gameplay length, and that can be disappointing.  This latest Tak entry might have still been a decent platformer even without the following new addition, but it's made a much better one because of it. In the Great Juju Challenge, players don't merely control Tak -- they control Lok, too, and all the time. The two characters remain most inseparable, which makes for some humorous in-game antics and dialogue. More importantly, though, are the entertaining new gameplay dynamics made possible with the dual-character configuration. Gamers can switch between either warrior at any time with the tap of a button. When they take control of Tak, Lok becomes an AI-maneuvered sidekick and vice-versa. Tak is a great sorcerer who can swim. Lok is a great warrior who can climb.       Each hero also obtains unique upgrades throughout the challenges. For instance, Tak is later able to use a freeze spell and Lok can generate a temporary shield around himself. Avalanche has successfully designed levels to function around this relationship. In certain instances, gamers will need to change to Lok in order to pick up Tak and throw him to otherwise unattainable ledges. In other areas, the screen will actually split in two and players will need to frequently alternate between the characters in order to trigger doorways and eliminate enemies. These interactions are cleverly implemented and as a result very enjoyable to play through.  The dual-character process is not limited to a single gamer, either. A second player can jump into the action at any point to become either Tak or Lok, at which point the screen splits into two and the heroes must work together. The mode functions exactly like the single-player setup except, meaning that the layouts of levels and in-locale objectives remain identical. The mode is fun and accessible for anyone. The second player can jump out of the game just as easily as they jumped in, at which point the split-screen setup will return to full-screen. Players will be happy to know that even with two players going their separate ways in the game worlds the framerate holds up for the most part.    There's a lot for kids to like in the latest Tak outing, but the game is by no means perfect. Although most younger players are unlikely to care (or even notice) that the title sometimes re-uses the rules established in Platforming 101 -- some copy/paste puzzles and forced collection, to name a few -- they may not so easily forgive some of its technical shortcomings. The game's camera system is mostly very flexible, but it occasionally gets stuck in a corner or behind an obstacle and obstructs the view. Meanwhile, every so often we found ourselves wondering if character collision detection boundaries were up to snuff. When Lok dons his ridiculous, yet amusing Lobster Suit, for example, he must be positioned incredibly close to enemies before his attacks will be effective. On top of everything else, the game's colorful and detailed worlds, while pretty, sometimes cause the fluidity to stutter.Tak: The Great Juju Challenge isn't going to turn the platformer genre on its side, but the game -- like its predecessors -- is surprisingly fun all the same. This is due in large to a balanced marriage of old and new mechanics topped off with a stylized, humorous presentation. Tak and Lok are funny, likeable heroes who spring to life with impressively fluid animation and brilliant voice work. Kids will love them from the start. And the game's new two-character dynamic successfully breathes fresh life into the series. That's not to suggest The Great Juju Challenge is perfect. It still has its paint-by-numbers moments and occasional technical shortcomings. However, drawbacks considered, it remains a rock-solid addition to the series and also one that we can recommend to kids and platformer die-hards alike.", "date": "Sep 21, 2005"}