{"name": "FOX Sports College Hoops 1999", "name_review": "Fox Sports College Hoops '99 Review", "ref": "https://www.ign.com/articles/1998/12/05/fox-sports-college-hoops-99", "text": "It's taken more than two years, but the first college sports title has finally arrived on the N64. Originally intended to become BMG Entertainment's contribution to the N64 NBA basketball lineup, Fox Sports College Hoops was eventually converted when Fox took over the publishing duties when BMG went under. Unfortunately, the game's engine is showing its old age and apart from the college license there is not much new here to warrant a purchase.The Facts 120 college teams (no players, though, as that's not allowed under college basketball rules) Rival Mode: Automatically brings up rival team Bonus teams, such as All-American, All-80s, etc Accurate team rosters, showing strengths and weaknesses of players Customize starting lineups Fox Sports style menus and presentation Special moves Fan participation button Hot & cold streaks Six camera angles ~Open man~ markers Two-player mode Secret codesGameplayIf College Hoops would have come out more than a year ago, as its developer intended, it would have served as a decent first polygonal hoops game -- with its only competition Midway's Hangtime. But as it stands now next to the graphically impressive Courtside and Jam and the arcade basketball hit NBA Live, College Hoops simply doesn't deliver an experience even close to the big three.Control is simple -- or rather, should be simple. Use the analog stick for multi-directional passing or shooting, the Z trigger for shooting. Players can block dunk attempts, swat balls and even falter players at the free-throw line with intimidation. However, the game's overall pace is far too slow. Passing is often unresponsive (depending on the number of players on screen) and the ball physics are far too floaty, even for an arcade hoops title. Sometimes, the ball bounces off the rim in an incredibly awkward fashion and flies through the air at a high arch before finally landing in a player's hands.The CPU AI is pretty good, at least on the defense, as the computer players usually run their defensive plays intelligently. According to Fox, Rhode Island University Head Coach Jim Harrick (who led the UCLA Bruins to the 1995 NCAA Championship) provided team analyses for the game. To help you get around the defenses, Z-Axis added a first-step button -- a nice idea, but it also turns the game into a dunk fest. Offensive CPU plays are pretty poor, though, and even beginning players should have no problem putting a stop to the offense after a game or two by using first steps and the like.Although developer Z-Axis tried its best to make Hoops a genuine college game, the game can't shake its different heritage. Sure, it uses Fox's cool TV-style presentation and plays two digitized tunes to simulate the college feel, but other than that, there is really nothing else.Players either select the regular Exhibition mode, or try their luck in a Season Mode that enables players to compete in a full season, or take part in a Conf Tournament, NCAA Tournament or Final Four. While there are some basic options (such as adjustable length, auto-substitution, three skill levels), College Hoops is oddly devoid of options and features, even for an arcade game.The final kicker is that there is only a two-player mode.GraphicsThe graphics are nice and sharp and College Hoops has probably one of the best audience textures we have seen in a sports game (it's actually animated), but the framerate is very erratic and the animations jittery and robotic. On the positive side, the Fox-style presentation works very well, giving the game an air of authenticity that it otherwise lacks in its options and features. There are tons of different face textures for the players, the courts look pretty good (although they bear almost no resemblance to the real courts -- a fact that no doubt goes back to the fact that the game started out as an NBA title), but overall, the graphics are not up to par with either of the big N64 NBA games.SoundThe digitized music works well to set the stage, but there just isn't much variety since Z-Axis couldn't fit any of the college anthems/songs on the cart. Play-by-play is sparse and uneventful. However, players do shout phrases on the court and there is even a little ~fan participation~ option with which you can taunt the other player after a successful dunk. Sound effects are above average as well.College Hoops is a below average game. It does just enough to be called a college basketball game and doesn't go the extra mile to offer anything that makes it stand out from the NBA competition. The little ~trash talk~ option is a neat idea, but it gets old quickly. The lack of a four-player mode is another disappointment, especially since every other N64 basketball title is playable by four. When I first heard that Z-Axis was turning its basketball game into a college title, I was hoping for a fast, arcade-style hoops game -- unfortunately, the 3D engine isn't quite up to the task, and the game has far too few features to make it appeal to the sim crowd. Since there is no alternative in the college genre, give it a rent if you're bored with the NBA.", "date": "Dec 5, 1998"}