{"name": "Sly 3", "name_review": "Sly 3: Honor Among Thieves", "ref": "https://www.ign.com/articles/2005/09/22/sly-3-honor-among-thieves", "text": "When Sly Cooper came back on the scene last year with Sly 2: Band of Thieves we saw the game grow up as the whole gang become playable characters and the world opened up to provide a more free-roaming experience. A little bit of the original flavor may have been lost and some reviewers, myself included, might have overrated the large new worlds a bit -- but there were still so many things to do and in such clever ways that the game remained very much in a class of its own. Now, Sly returns a year later in Sly 3: Honor Among Thieves, but with even more buddies to show that more can be better -- though with the downside of stretching itself a little too thin.   Sly may still have his name in the title, but the emphasis this time around is more on the cast of characters as a whole. This leads to the upside that there are many more things to do. Sly 2 was no slouch in the ADD approach to game design, but Sly 3 ups the ante a little further in that the pace is more varied with different objectives adding new flavors as the game goes on. The only downside is that the game takes a little while to build up to the frantic action of the later levels that makes the whole approach so rewarding.   Don't mess with Sly, he'll claw your platforms out. Starting out, the gang is down to just two characters: Sly, a raccoon thief, and Bentley, a brainy turtle who is the mastermind. At the end of Sly 2, Bentley was horribly mangled and has ended up confined to a wheelchair. Of course, this wheelchair has a jet pack to float around and can do some wicked spin attacks. Murray is absent because he blamed himself for Bentley getting hurt and has gone off on a spiritual quest that led him to start wandering around the globe.   With Sly wanting to get into his family vault that is being defended by a maniacal genius who is trying to break in, the need to expand the gang emerges. This means getting Murray back in the first mission and adding on even more characters in the four missions after that. This leads to the gang getting larger and the game getting more interesting later on.   In the meantime, Sly 3 is instantly familiar to those who played Sly 2. Each mission takes place in a single large environment filled with guards and Sly and Bentley both have the ability to sneak around and pickpocket their foes for a few coins or a high-priced item (while Murray can wander about and beat up thugs for the coins that fall out of them). That's really just for kicks, though, as the free-roaming is best left to Sly and Bentley as they steal their way to fortune so that the whole gang can buy new abilities for themselves.    Upon leaving the gang's headquarters in each new level, players can see indicators that show where a mission is currently available and who is needed in order to start it. Thankfully, there are far fewer mission starts that require trekking across a huge level as happened last time. This time around there is a lot less of the clock used up wandering about trying to find the next spot or just get a decent amount of cash. Overall, this approach has streamlined the game down to a more reasonable 12 hours or so for the story mode.   Going beyond different missions for different characters, individual missions can see two or more characters being controlled in a ~hot potato~ design. The gang fills out to a healthy seven characters and a few times even Carmelita, Sly's nemesis and love interest, gets to be playable. The regular variety of the game let the designers cut loose so that a normal Sly section would be followed up by some RC helicopter action straight into playing as an Australian guru mind-controlling guards and smashing them into walls.    This time we see a bar fight where control swaps from Bentley to Murray to Sly for the finishing moves. The camera simply leaves one character for another and the action keeps on going. It's as if it was all some big action movie and being limited to one character is just silly. As for Carmelita, she gets to be controlled a few times when there's a mutual enemy who needs to be shot. Her dedication to bringing Sly to justice, however, remains constant.   All of the opportunities that are laid out here ensure that more ideas can be thrown at the TV screen and at a faster pace. Rarely do any of the tricks get repeated and if they do it's only because another idea has been implemented to use it in a new way. But with the quantity comes the issue of quality control and as such, there are some occasions where the mini-games feel a bit too ~mini~ or unbalanced or just not quite fleshed out enough yet. For all the guru's quirkiness and funny scenes he's still an awkward character when it comes to mind-control. There are also some RC car racing scenarios that don't provide enough of a diversion to justify their inclusion.    But one of the most disappointing aspects is that there's not too much difficulty in the challenges here. As a whole, this adventure is aimed at a bit of a younger audience that might want a bit less of a challenge. To provide some replay value the Master Thief challenges have returned but even these are mostly a cakewalk and repeat challenges in the game itself. The time limits and stronger attacks make for a few retries, but not that many. In just a couple hours I had knocked off the challenges and acquired the 100% for the right to brag.   Yeah, she's a sassy one. A similar feeling happens along with the two-player games that get unlocked. They're nice to have and a good bit of fun to play for an hour or so, but not much that will be worth looking back on or digging into. The amount of options here are generous and varied, but still don't quite propel the game to greatness.   If the individual elements are a mixed bag, the game as a whole has developed further in terms of the overall story. The boss battles are bigger and more interesting than before and each of them has a solid motivation for his actions. We even meet one character whose greatest enemy turns out to be ~himself~ as he enters into an introspective dialogue that lends new depth to the series.   And as mentioned earlier, the last couple levels are worth all of the work that led up to them. Later on, the gang heads out to some Caribbean islands, pirate territory, to find some buried treasure and end up fighting battles both on land and sea. Some classic elements from both Pirates! and The Secret of Monkey Island have been brought in here and are brilliantly updated. With plenty of seafaring and adventuring this is easily the longest mission in the game and almost worthy of becoming a new project unto itself. The last mission is well worth it for some tricky platforming challenges, but it was definitely hard to leave this colorful world and move on.   Speaking of colorful, there's also the option to play parts of the game with some goofy-looking 3D glasses. Make no mistake, anyone who walks by will make some stupid joke about how they look and fall down laughing at their own brilliance. It happened over and over again at the office and nobody caught on that they all made the same joke. But the extra bit of depth is a nice trick for a little bit. It's nothing to write home about and they can make your eyes hurt if you wear them too long, but it's a nice touch.Sly and the gang return with some new friends for another adventure that's tighter, more compact, has more elements and wraps it up with a better storyline. Hell, there's even a 3D option. The ADD school of design is in full effect here, but it takes a few missions for the game to fully come into its own and by then there are only a couple of missions left. It's still a fun ride and many of the new additions work out well, especially the pirate sections, but there are enough rocky spots to make the game feel kind of awkward and hold it back from being truly great.", "date": "Sep 22, 2005"}