{"name": "Milo's Astro Lanes", "name_review": "Milo's Astro Lanes", "ref": "https://www.ign.com/articles/1998/12/05/milos-astro-lanes", "text": "... albeit the only space bowling title for the console -- and, for that matter, any videogame machine or PC.  Introducing Milo's Astro Lanes, the second Nintendo 64 title from developer Player 1 (Robotron 64) and publisher Crave Entertainment. As with most Crave software, Astro Lanes falls under the chancy genre, ~niche title.~ But this unique game can't be classified as a bowler. In fact, we're not sure what it is, but the game is interesting all the same.   Story As with most space-based bowling-type-action-sort-of-thing-like games, a compelling storyline is of the utmost importance for Milo's Astro Lanes. It's the 22nd century. Milo is a teenage ~techno-wiz~ who enjoys playing ~Astro Games~ -- or, as we like to call it here in the 20th century, bowling. The ~Astro Games~ are televised across the galaxy and very popular, attracting all sorts of lovable characters and deformed alien races. Bent on winning the ~Astrolight Trophy,~ Milo decides to check himself into the games and voila -- here we are.  The Facts  Six playable characters. 12 out of this world bowling lanes. At least six ~astro~ balls to play with. Multiple gameplay modes. Four-player support. Rumble Pak and Controller Pak compatiable. It's astro-licious. OK, maybe that's not a fact, but it sounds cool.   Gameplay Weird. If there's one word that sums Milo's Astro Lanes up, it's definitely weird. The idea behind the game is this: players, selecting from a handful of various aliens and mutants, bowl across 12 questionable galactic lanes. The premise itself is simplistic enough, but there is a bit more to it than that. Because these are ~galactic~ lanes, they are severely different and in some cases more difficult than regular old bowling lanes. For example, the average ~galactic~ lane is much longer than your standard bowling league issued one and it's likely to be surrounded by space, rather than fat guys drinking beer.   Not only that, but the ~Astro Lanes~ tournaments present further problems with complicated rules and enhancements to the game. Whereas regular bowling sees the competition quietly waiting for an opponent to bowl, ~Astro Lanes~ athletes can try and muck one-another up. This is done, of course, by throwing obtrusive objects in front of the ball of a nemesis, thus stopping his/her chances of hitting a strike. It's perfectly OK, for example, to douse the competition's ball in acid as it rolls down a lane, or blow it up entirely with a bomb. As far as we know, these rules don't apply anywhere else except in space and Oklahoma.   Players start out with access to the first batch of lanes in a novice-like mode. Once they have completed these lanes successfully, which entails beating an opponent in a game, they can advance to more difficult lanes. There are a total of three different classes of lanes, from standard novice to Cosmic class. Whereas novice lanes work more similarly to Earth's own, Cosmic Lanes feature wacky jumps, bumps and other various gameplay-affecting obstacles.  The original design for Milo's Astro Lanes spoke of corkscrew lanes that twisted and turned, dropping lanes, thin and wide lanes in tunnel-esque form and so on. The final game has none of these, but that's only part of the problem. A larger fault of this game is that it doesn't seem to know what it really wants to be. Part of it is a bowler and the other part is a galactic gameshow. But that's no so bad considering the gameplay is intact. Unfortunately, Milo's doesn't deliver much in the way of that either. Physics, or lack thereof, are probably the game's lowest point. Balls roll forward and crash into pins in a dreary, faked style that simulates real physics with sprite animation, but hardly seems to possess them. The game Glover, by comparison, featured a bowling ball in it that rolled and reacted to its surrounding environment much more believably.   That said, we do like the idea of sabotaging a player's game with specials and anti-specials that may or may not prevent a ball from reaching the pins. And, it must also be noted that the game's multiplayer mode isn't bad at all. Both of these inclusions add a bit of strategy to what is otherwise a poor bowling experience set to the backdrop of space locations.   Graphics Imagine The Jetsons bowling on alien planets. You've got it. The game's colors are bright and vibrant, some levels are well-designed and some are on the boring side. Milo's Alien Invasion bowling lane sees players throwing the ball down a long extraterrestrial tongue and into a giant alien's mouth where the pins await. The Alien boasts two huge, elongated eyes that watch as players bowl and its mouth heaves up and down constantly with fluid animation. It looks great. Venus, another lane in the game, pits players down on an active volcano, which must also be bowled into. And it too looks pretty good. On the other hand there is Hyperspace, a lane which features nothing remarkable about it and is, for all purposes, boring -- if not downright ugly. And all of the lanes feature less than impressive backgrounds, consisting of dithered, blurred stars that scroll across the screen. For a game of this type, Player 1 really should have given players a bit more to marvel over. Bowling in space should not be, as this is, generic. Animation is sub-par and framerates suffer in the game's Lobby room, which doesn't appear to be heavily populated with system-straining polygons. There is no reason for this drop.   Sound The music in Milo's Astro Lanes sounds a bit like elevator music on a tropical island, which is, uhh, very space-bowling like. The tunes are quite cleverly executed in spite of their weirdness. Sound effects are a different story. They're very compressed, lifeless and forced. If Milo screws up a strike he'll say, ~Darn.~ Or, if players do well, they'll be rewarded with, ~You are a great Astro-bowler.~ Milo's Astro Lanes is a perfect example of ambitious project gone wrong. Everything Player 1 originally talked about implementing into the title is sorely missing. The game's physics are poor, graphics generic and control iffy. And yet, having played the game extensively, I still can't help but enjoy it just a little. Milo's four-player mode and special sabotaging system are worth a rental. But don't be fooled: this is bowling in space. And no disrespect to Player 1, but who in the hell wants to bowl in space?", "date": "Dec 5, 1998"}