{"name": "Capcom Classics Collection", "name_review": "Capcom Classics Collection Vol. 1", "ref": "https://www.ign.com/articles/2005/09/24/capcom-classics-collection-vol-1", "text": "Reviewing compilation packs is a tough thing to do... especially when the games involved all come from dissimilar backgrounds, are of varying quality, and use different technologies between them. Such is the case with Capcom's latest retro throwback, Capcom Classics Collection -- a 22-game anthology that revisits some of the company's best arcade titles from the 1984-1992 era (with only a few mediocre ones). And while this set may not be as fun or reworked as Capcom's excellent 2004 assemblage, Mega Man Anniversary Collection, it's certainly a lot more diverse.   Of course for me, Capcom Classics Collection Vol. 1 seems to be a tip of the old retro hat to the renowned videogame designer, Yoshiki Okamoto (after all, he was involved with the creation or development of almost half the games in this assortment). Best known to recent players for his contributions to Devil May Cry, Resident Evil, and the recent PS2 actioner Genji, Okamoto had an equally important role in titles such as Street Fighter, Final Fight, and 1942. Sure, his namesake in America may not be as recognizable as that of Kojima or Miyamoto's, but his games sure as hell are... and that's pretty impressive.   Can you ever get enough Street Fighter? What about those games anyway? To Okamoto's credit, most of the ones he was involved with are also the best of this collection. 1942, 1943, and 1943 Kai are all considered legends in the arcade shooter market, and Final Fight was probably the single most played beat 'em up in the history of American pizza houses. Likewise, the previously Japanese-only Pirate Ship Higemaru is an addicting homage to the SEGA puzzler Pengo, and his world-renowned Street Fighter series speaks for itself. Ryu and Ken fans in particular, should be happy to note that both SFII Champion Edition and the always-killer Hyper Fighting join the original Street Fighter II coin-op to triple your Hadoken fun.   The rest of the collection is no pushover either. Forgotten Worlds is still fun as hell, Ghosts 'N Goblins, Ghouls 'N Ghosts, and Super Ghouls 'N Ghosts are even better, and Gun Smoke and Mercs kick all kinds of double-barreled ass. Unfortunately Capcom has included the lackluster arcade version of Bionic Commando instead of the better console one, and Section Z, Volgus, Son Son, and Trojan are only moderately exciting. Whatever you do, though, don't overlook the surprise of the bunch in Exed Exes (you know it better as Attack of the Savage Bees) -- it's a terrific little Gaplus rip-off with better graphics and some neat variations on the typical wave shooter.   The console version of Bionic Commando was better... The bad news for big-time Capcom fans is that several high-profile titles have been left off the disc. Strider, Captain Commando, Magic Sword, Knights of the Round, Three Wonders, and Saturday Night Slam masters have all been omitted. Also, other than the SNES version of Super Ghouls 'N Ghosts, the only games available here are based off their arcade counterparts. This means that classic NES and SNES titles like Duck Tales, Gargoyle's Quest, and Demon's Crest have all been left behind.    Regardless of what you think about which games were left in and which were left out, one of the most important things to consider in a compilation like this is how well the games have been translated. Sure, you can have 20 of the coolest games you've ever seen, but if they were rushed onto disc with poor emulation, then that will show up in the final product. Luckily, Digital Eclipse doesn't appear to have hurried the production of Capcom Classics Collection at all, but it does run into a couple of small issues worth mentioning. Half the games in the set, for example, suffer from some pretty noticeable flicker and aliasing issues that weren't in the original versions (aka all the shooters), while the transparency effects are hindered by some obvious interlacing troubles (thank you frame skip!). It's not the end of the world, but it's there.   On the presentation side, Capcom has made sure to include a lot of really cool supplements in both the PS2 and Xbox versions of the game (they're identical). As such, every title in the collection boasts an assortment of little goodies to uncover like the history of that particular game, informational tidbits, official artwork, gameplay tips, and musical bonuses unlocked by meeting specific requirements. I can't say that I'm a fan of the bland transition screens and the aforementioned video problems, but the extras available here more than make up for it. There's even an enhanced viewing mode and remixed sound options for some of the bigger titles, and the load times are only a few seconds long from menu to game.   Forgotten Worlds is far from forgotten The coolest features of them all, however, are the ones that aren't immediately noticeable. I'm talking about the hidden gameplay extras that have been thrown in as an addition to the presentational ones. If you want to play through a hardcore version of Mercs instead of the regular quest, for instance, you can do that. If you'd prefer to stop playing the original Street Fighter II and pit characters from all three games against each other in an impromptu ~version match~ you can do that too. It's the little things like these that go a long way.The reason Capcom Classics Collection is so cool is because it does a number of things well that most compilation packs normally don't. Not only does it give you a lot of information and bonuses with every game in the set, it also (as one of my colleagues put it earlier today) forces you to play each game like a man. If you want to see and learn everything you can about a particular game, you really have to work at it and meet specific challenges to do so. It's a clever way of getting people to play games they might normally overlook in favor of the familiar, and an even more rewarding way to play through the titles you came to conquer in the first place.What else can I say? Capcom Classics Collection is a solid anthology that I'd easily recommend for history buffs and old-school gaming fans alike. Hopefully, another collection will be on its way soon.", "date": "Sep 24, 2005"}