{"name": "Total Overdose", "name_review": "Total Overdose: A Gunslinger's Tale in Mexico", "ref": "https://www.ign.com/articles/2005/09/27/total-overdose-a-gunslingers-tale-in-mexico", "text": "Hola, gringos! It's time for another classic drug czar tale, our second favorite kind of tale. It's the story we all love: father is killed, sons seek answers, drug lords come into play, so on and so forth... Essentially, the basis for a whole hell of a lot of good old fashioned bloodshed.   Total Overdose: A Gunslinger's Tale in Mexico is best described as a combination of Grand Theft Auto meets Max Payne, with a little Desperado or Once Upon a Time in Mexico thrown into the recipe to add some flavor. Fast, crazy and dynamic gunplay is set in an open city environment to create a title that is simultaneously a linear run-and-gun shooter and an open, exploration-oriented game.       The game's borrowed elements are both its strongest and weakest aspects. Its gunplay can often be on par with those of the Max Payne series, excellent shooters in their own right. Its exploration elements are certainly presentable, though some of this aspect could have been expanded upon or tweaked to match the polish of the game's more linear moments. In the end though, Total Overdose is a hell of a good ride that, like a junkie's blackened heart, ends rather quickly.   Guns, Guns and More Guns  As mentioned, Total Overdose's strongest aspect is its gunplay and combat elements as combined with its varied move set. As in the Max Payne series, players are able to pull off some Matrix-esque moves that slow down time and allow you to easily -- and quite bloodily -- pop a couple hundred caps into some fools asses. The game's entire success lies in the strength of this design, and fortunately it's great fun.   The game outfits you with a number of various slow-motion lunge and wall-hop moves, like cartwheels, back flips and the like. On top of this, you're given both always-active special shots, like timed headshots, and a set of short-time special moves that you need to earn tokens to use, like El Mariachi, where you're given two guitar cases that burn through shells like a Hummer burns through gas.   The special move set also includes tricks like the Tornado where you'll leap into the air, rotate like a twister and lay waste to nearby evildoers, Uzis akimbo. Raging Bull sends you charging full-speed into drug smugglers, somehow killing them with the top of your noggin. Far-fetched, maybe, but these sorts of moves fit in perfectly with the game's overall style.   While these special moves are cool, they're generally either not used very much or are essentially abused. Your standard combat moves are generally enough to take out most anyone you face, where moves like the Tornado are really only necessary when you're completely surrounded and entirely overwhelmed. We managed to make it roughly 80% of the way through the game before we were forced to restart a mission, relying almost entirely only on our basic move set.   On the other end of the spectrum though, a move like El Mariachi, with its dual-guitar case chainguns, is so powerful that you can take out any boss in the game with a single use of the move. The move can be satisfying if you use it against a horde of peons that you'd have generally had no problem with otherwise; the carnage can be quite satisfying. Used against a boss though, it's hard to see why we'd ever use anything else (we don't understand the word restraint).   Aside from this reasonably minor problem, the game's combat can be a sheer blast, especially during the latter half of the game when enemies are aplenty to be done away with via your glocks, sawed-off shotguns, rocket launcher or whatever. There's not really a whole lot more to it than we ever saw in Max Payne, but that's fine for us. The combat in said game was fantastic and Total Overdose recaptures many of its greatest aspects.   Leaping feet-over-head off a wall and nailing a couple headshots at some bad guys is whole satisfying, as is leaping backwards, firing a couple shots off at one foe, spinning around in mid-air and taking out another. Though you'll see the bulk of what the game's combat has to offer in the first hour of the game, it's fun enough to last you through the eight or nine hours that the game will likely run you on average.    Adventure, Excitement, and Taco Trucks  The other half of Total Overdose's overall design lies in its open city exploration elements. There's a decent bit of time to be had mulling about the game's various environments, looking for hidden power-up items and whatnot, though roaming about the city isn't nearly as rewarding as the game's combat elements.   Most of this has to do with the fact that the vehicles aren't tuned as well as they could be. Luckily there are only a few sections of the game that require you to get behind the wheel of a vehicle, and most of those are only for driving said vehicle directly at a large, fragile object before you bail at the last second. In other words, aside from a few racing side missions, the game's lackluster vehicle physics aren't as much of a problem as they are a bit of a disappointment. Having vehicles that were wholly fun to drive could have extended the title's longevity as you raced throughout the city looking for jumps and whatnot, but in the end, they're just not all that fun.       There is, however, a decent bit of ~puzzle solving~, for lack of a better term, for reaching some of the game's hidden secrets. Instead of placing most of them behind obscure dumpsters and in tucked away spaces like the Grand Theft Auto series likes to do, Total Overdose's pickups are more out in the open. It's not so much a question of finding them but rather getting to them. You might need to head to the top of a building three towers over, taking a few zip lines or leaping from rooftop to rooftop in order to snag them. While they're still not hard to get, it's more enjoyable figuring out how to get to something you can see than peering behind random trashcans in hopes of another pickup.   Another aspect that leads to the game's slightly underwhelming city exploration elements is that the game's story progression is very linear. There's an overall arching storyline that doesn't allow you to play multiple sides like the Grand Theft Auto series has, essentially forcing you down a narrow story path. You're required to complete side missions to essentially pass time between the major missions, though these are unconnected and really have nothing to do with the overall story in the game. Not that they aren't fun, because some of them are, but story-wise they're pointless.   Style  Though the game may look rather basic and even uninspired if you're judging it solely by screenshots, the game actually has quite a good sense of style, in terms of not only visuals but its music and overall attitude as well.   Graphically, the game is roughly on par with something from the Grand Theft Auto series at a glance, though said series features more little details here and there and a grander scope that sets it above Total Overdose. Still, while the game looks rather simple, as we said its visuals fit well with its overall style. The game's various cities aren't directly identifiable by us as resembling any real city, but they do well in bringing a mostly life-like environment to the world of Total Overdose.Total Overdose is a very fun, albeit short, action title. There's a whole lot to like within the game's control scheme and the gun battles that it'll allow you to carry out. A plethora of bullets, explosions, bloodied bodies and the like are the norm for the game's fight scenes, almost in a choreographed manner.The game's exploration elements are a little underwhelming, partly do to the fact that the vehicles aren't really all that fun to drive. It's also quite linear, though that hasn't really hurt many other titles in the past. On the flip side though, it's overall style makes up for some of these lackluster elements.While Total Overdose may not be the most original, deep or serious game to hit a console, the game benefits in many ways from being the exact opposite. Its proven gunplay, in-your-face action and witty sense of style make Total Overdose a game that deserves at least a quick play through.", "date": "Sep 27, 2005"}