{"name": "Star Wars: Rogue Squadron", "name_review": "Star Wars: Rogue Squadron PC Review", "ref": "https://www.ign.com/articles/1998/12/05/star-wars-rogue-squadron-3", "text": "Anybody out there remember Shadows of the Empire? Pretty much sucked, huh ... except for that first level on Hoth. Remember how you wanted a whole game that was just like the Hoth mission? Well you can ... it's called Rogue Squadron.Rogue Squadron takes places between the original Star Wars movie and The Empire Strikes Back. You assume the role of Luke SkyWalker ... bet you always wondered what he did between leaving the moon of Yavin and arriving on Hoth. Well, he was a member of the Rogue Squadron, an elite group of ace Rebellion pilots ... the best of the best.Rogue Squadron offers up 16 missions of pure arcade action. Unlike X-Wing or TIE Fighter, rhe designers weren't going for a realistic flight sim at all and you can jump into the game almost immediately without having to learn a number of key commands. Missions take place planetside and the big hard ground is always there to cause major headaches for pilots used to flying in the reaches of space. Many of the settings will be familiar to fans of the Star Wars series. You'll fly over the deserts of Tatooine, through the cityscapes of Corellia (Han and Wedge Antilles' home planet), and across the vast oceans of Mon Calamari on a variety of mission types including escort, base defense, and the basic patrol and blow the hell out of everything out there. There are even a number of secret classic missions from the movie, including a redone Battle of Hoth ... very cool!!!As a Rebel pilot, you have an impressive compliment of ships to choose from, ranging from the classic X-Wing to the experimental V-Wing (you'll even get a chance to pilot the Millenium Falcon if you do well enough in certain missions and earn the required number of medals). Not every ship will be available for every mission, but you occasionally be able to choose between a few different crafts so you can semi-customize the mission, even trying the mission with different ships to see which one is best suited for the situation. Each of the different ships handles differently (obviously the A-Wing is a lot more maneuverable than the Speeder) and is outfitted with blaster cannons and a secondary weapon, like cluster missiles, bombs, or the ever-so-handy tow cable.The Empire will throw a barrage of TIE Fighters, Bombers, and Interceptors your way and you'll even encounter the occasional heavily armored Imperial Shuttle. There are also several ground targets just waitin' to bust a cap in your ass like AT-AT walkers, probe droids, and blaster turrets.Being in the Rogue Squadron, you would think that your wingmen would really get your back if you got into trouble. Well, the AI isn't necessarily bad, but you do clean up an area pretty much by yourself, usually taking out more than 80% of the enemy forces. Of course, all of this combat is dangerous and you'll have to avoid enemy lasers if you want to get back alive. You usually don't die after one hit, but sustain a number of hits and you may find yourself spread out over the landscape. Fortunately, in the X- and Y-Wings you'll have an onboard R2 unit which will slowly repair damage you receive in combat, giving you a little piece of mind in those oh so difficult bombing missions in the slow-ass Y-Wing.The best thing about Rogue Squadron is its incredible gameplay. Rogue Squadron features fast framerate and an excellent control system. Since it is basically a console-type game, its style of gameplay probably favors a gamepad over a joystick. You have full control over your ship and, with the exception of the Speeder, you can perform rolls and loops to avoid incoming shots. You can switch from a variety of views (behind the ship, cockpit, and the mostly useless on the hood looking toward the back of the ship view), but you'll probably find the behind the ship view the easiest to use. You can also change the zoom of the camera, giving you the ability to follow the action from directly behind the ship or from far behind it.Rogue Squadron for the PC does require a 3D accelerator card so, if you don't have one yet, this may be the game that warrants an upgrade. Although the graphics and special effects aren't spectacular, they are pretty darn good and the low number of polygons really helps keep the framerate up and the action intense.Rogue Squadron is nothing but an arcade/action game ... it doesn't try to do anything new or innovative, but the designers certainly got the formula right on this one. It's not very long, there's no multiplayer mode, and I've seen better graphics, but, personally, with a game like Rogue Squadron I really don't give a damn. In the end, Rogue Squadron is just plain fun ... and isn't that really what games are supposed to be all about?I have to confess that I'm a big Star Wars fan, so I'm not sure how I would have liked Rogue Squadron if it didn't look, sound and feel like Star Wars -- but then again, who isn't a Star Wars fan deep down? Rogue Squadron is one of those games that will most likely trigger a wide range of different reviews. Many gamers will love the way it plays and get a kick out of the authentic Star Wars feel, others will complain about the lack of variety or the relatively low replay value. Essentially, what you get out of Rogue depends entirely on how you approach the game. Did you like the Hoth mission in Shadows? You will love this game. Are you looking for a console version of X-Wing/Tie Fighter (PC)? You won't like this game.One thing is for certain, the hi-res graphics (sorry, but 4MB RAM enhanced Rogue is the only way to play) and the surround sound are outstanding and really show off what the hardware can do. While the one-track gameplay isn't enough to challenge GoldenEye as the best movie game on the console, Rogue Squadron definitely emerges as a shining example that not all licensed games are quick attempts to get your hard-earned money. It's definitely my favorite console Star Wars title, and the bonus missions alone are worth the price of admission. Well done, LucasArts and Factor 5.", "date": "Dec 5, 1998"}