{"name": "Black and White 2", "name_review": "Black & White 2", "ref": "https://www.ign.com/articles/2005/09/29/black-white-2", "text": "Peter Molyneux doesn't do sequels. And though he's an ambitious and original game designer, the fact that he doesn't make many sequels puts him at a bit of a disadvantage relative to some other notable game designers. Where people like Will Wright, Sid Meier and Warren Spector can refine their designs over several different iterations, Peter and his team basically get one shot at getting things right before they move on to other projects.   To be fair, the original Black and White benefited from the lessons learned in games like Populous and Dungeon Keeper, but the best way to improve both the design and presentation of a game is just to try making it again. Given that the first game sold 2.5 million copies, a sequel makes good financial sense as well.   For those few of you who aren't familiar with the game, it put you in the role of a powerful god. You had followers whose basic needs had to be provided for -- you had to build their towns and assign them to jobs. Though you manipulated the game with your divine hand, you also had a small creature that served as a sort of incarnation on earth. Learning from your actions, it became a sort of tool that you could use. A wide range of spells and powers also gave you the chance to carry out your will on earth. A succession of challenges pit you against rival gods on a variety of islands.  One of the team's main goals in creating a sequel is to make the game more accessible. It surprised us to learn recently that 75% of the people who bought the original Black and White weren't really gamers. Accordingly, the new game goes to great lengths to explain the basic interface. Any one who's played a PC game in the last ten years is likely to find the extended tutorial a bit obnoxious. After learning how to move the camera to the left, for instance, the game will take the time to explain how to move the camera to the right. Thankfully, most of the remedial stuff is taken care of during the course of the first mission.   Black & White 2 Guide    Good or evil? We don't care. We just point the way. Get the guide now!  One of the bigger problems I had with the earlier game was that it didn't seem very rewarding to be evil. In games like Fable or Knights of the Old Republic, there's a real practical advantage in being a jerk. If you tried to play that way in the original Black and White, you did so at the expense of your own effectiveness. In other words, being evil tended to cut your support and forced you to compensate in other ways. Thankfully, that's not the case with the sequel.  The sequel determines your alignment based on your style of play rather than simple ~yes-no~ scenarios. If you focus on building an impressive city, your neighbors will start to take notice. At a certain threshold, the citizens of neighboring towns will just pick up and move to your city adding their manpower to your labor force. If you focus on building up a massive army, you can just march into neighboring towns and take them over by force. The civic improvement route shifts you more towards the ~good~ side of the equation while the militaristic route shifts you more towards the ~bad~ side.  What's particularly nice is that the game doesn't punish you for using a mix of the two styles. You can still be an evil warmonger who likes to make sure that his people have nurseries and schools. You can also be a benevolent farming god who also likes to engage in a little pillaging now and then. Either strategy works reasonably well and the game often requires you to strike a sort of balance between the two.  You can hope for peace all day but war comes early and often in the world of Black and White 2. The AI doesn't seem terribly active on some of the levels (at least not until he starts to take notice of your encroachment) but the challenge isn't just in outmaneuvering your opponent on the battlefield. You'll have to build up a city that will support the large armies that war requires. Early on this may mean less than a hundred soldiers. Towards the end of the game a hundred soldiers represents a small scouting force.    Soldiers are recruited from the general population of your towns. No surplus population, no big armies. So in addition to building the requisite armories for each troop type (infantry, ranged, siege), you'll also have to build all the other things that a peaceful society needs -- things like farms, houses, mills, etc. Once you're ready to start mustering men will begin to gather outside of your armory. Simply click on the unit flag and you'll be ready to move them into battle.      The combat commands in Black and White 2 are conveniently simple. Rather than relying on formations or complex movement orders, you'll just simply pick up a unit flag and move it to the location you want the unit to move to or to the building or enemy unit you'd like them to attack. At that point your involvement is pretty much over. The real key to successful military operations is creating a large enough army and managing your creature's actions during the fight. Even though it sounds relatively simple, the way that army creation interfaces with the other aspects of the game makes the military route very satisfying.  The way of cultural assimilation will require you to pay close attention to the needs of your people and the layout of your cities. City design is relatively painless. You can drag and drop blueprints for buildings anywhere within your area of influence. Builders will gather materials and begin constructing the building. Once it's complete, your area of influence expands, giving you even more room to build. In addition to making sure you have the right structures to support your society, you'll also want to assign a few villagers to certain roles. Though everyone pitches in where they see a need, assigning particular villagers to focus on key aspects of your society (farming, forestry, breeding, worshipping) gives you a chance to keep things running more smoothly.   A variety of feedback layers makes this much, much easier. At the most immediate level, your believers will actually call out what they need when they need it. If they're running short of food, for instance, someone will take the time to tell you. Beyond that, you can get all sorts of data at the various buildings. Storehouses will tell you what the demand is for your basic goods. The main town center will show you what structures the people want you to build next. A far more detailed breakdown of your society showing male-female ratios, job assignments, happiness, building occupancy and a variety of other factors is also available at a moment's notice. While it takes a while to orient yourself to all this data, you'll come to rely on these reports to gauge the health of your society and to discover what areas you need to focus on moving ahead.  Unforunately, all this building and job assignment makes me feel more like the mayor than The Almighty. Too often in Black and White 2 it seems like you're wowing people with sound civic planning and practical comforts rather than plagues of locusts and rivers of blood. Having a bit more of an emphasis on god powers would definitely contribute to a sense of divinity here. Sure, you can call forth some cool powers fairly early on (and even change day to night this time!) but the basic expression of your godhood is still sound city design and labor management. All Hail He of the Conveniently-Located Cemetery!  Through all this, your creature is still a powerful tool, either for constructing cities and harvesting resources or for stomping enemies and burning their buildings. Though the early levels spell out some of the basic creature interactions, you're left largely on your own with regard to combat and overall creature development. Figuring out how to make him stronger or more playful is largely a matter of trial and error but the AI is so expressive and reactive that you'll actually enjoy spending time trying to figure him out.  Where the first game had an abundance of scrolls that offered small story-related goals, the sequel prefers to present the player with a huge list of chores right at the start. You may need, for instance, to capture three towns by force, get your villagers to collect 6000 ore and have your creature build 20 houses. While it's nice to have two dozen objectives in front of you on each island, these chores don't really provide the human perspective I remember from the first game's missions. Helping out the residents of the island with specific (sometimes trivial) needs makes me feel much more involved than I do just trying to build five farms or erect a certain kind of monument.  The plus side of this chore approach is that each objective contributes to your infrastructure and helps you build a winning strategy. Given a choice between building a working farm system or simply helping some local alcoholics brew some beer, the former offers more practical benefits, the latter offers a greater sense of involvement in the human side of the world. All things being equal, I'd have liked to have seen a few more of the story missions and a few less of the chores.      In addition to building your strategy and giving you a human perspective, completing objectives gives you tribute points. Though it doesn't have the same immediate benefits, tribute is as important a resource as wood, mana and manpower. Tribute is used to purchase new god powers (for you and your creature), new building plans for your towns, powerful monuments, creature upgrades and a number of other toys. Spending your tribute wisely is an important element of success, particularly late in the game, but the game leaves it up to you to determine what's worth buying and what isn't. Resist the urge to go on a spending spree at the end of each map; you're bound to need a good bit of tribute to buy specific items you'll need on the next map.  The first game's interface was pretty solid but the interface in this new version completely blows it out of the water. Except for having to save the game occasionally, I played the entire game without ever once touching the keyboard. As long as you have a three-button mouse with a scroll wheel, you're golden. Moving the camera around is remarkably easy. The sometimes profound changes in elevation will cause a few problems with scrolling across the map, but the zoom function is so fluid that you can pop around the map with a surprising degree of comfort and consistency.   Interacting with the world is also relatively trouble-free. Your hand allows you to manipulate anything within your area of control on each map. Whether you're uprooting trees, flinging boulders, slapping your monkey or moving villagers around, working with the hand is wonderfully intuitive. As with the camera, there are a few aggravations here. Trying to pick up a farmer from the middle of a field is overly difficult. Unless you zoom in close, you're more likely to start picking up grain instead. As before the throwing motions are a little clumsy. You'd think a god would have good enough aim to ensure his fireballs are on target.  As you can tell from the screens, the game is simply gorgeous. The visuals are great at every level, from the stunning mountains to the individual villagers. Watching the game transition from the clouds to the city streets gives you a real appreciation of the scale of the graphics and the beauty built into each level. The higher levels come with glorious clouds and brilliant sun effects. The lower levels include grass that moves as your hand passes over it and small animals that roam around.  Though the game looks great at any distance, there are tons of details that can only be appreciated at the lower levels. Seeing your breeding villagers grow pregnant and give birth (sort of) or watching your soldiers spar at rest or build campfires at night really contribute to the feeling that your in charge of a living and breathing populace. The models aren't quite on par with those in Rome: Total War but they're good enough for the scale of the game. Since it's not terribly convenient to play the game from a street level perspective, you'll hardly notice that there are lots of duplicate models among your villagers.  The character of your land will also change to reflect your alignment. If you've been evil, the land around your towns will be grey and cracked with bits of magma showing through the small fissures. If you've been good the land around will be rich and lush. The same is true of your hand. By the end of my game, I had become so evil that my hand had long, pointed nails, was an unhealthy color and was covered in strange tattoos.  All this beauty comes at a price however. You'll definitely need a fairly powerful system to run this game. Even on our high end PCs, the game was a bit framey with all the details turned up. The good news is that you can tone down the details a bit and get an image that looks good and runs smoothly.  It's no surprise that the game sounds great as well. The sound track and small background noises serve as a great backdrop to the game. Hearing crickets and babbling brooks when you're zoomed in close or hearing the wind whistle by when you're zoomed out really adds a sense to the life of the game. The voicework is excellent as well, particularly with the pitch-perfect performances of the two advisors. The good and evil avatars have some truly wonderful interactions with you and each other that really help to orient you to the game in a very natural, amusing way.  Finally, as with some of the designer's other games, there are plenty of hidden treasures to be discovered here. We couldn't possibly hope to uncover them all but we've managed to find a few here and there. Patient players will have a strong incentive to be as thorough as possible in seeking out these small rewards.Personally, I didn't love the original Black and White as much as some others did. I certainly admired the basic concept and the core mechanics but there was something about the game that seemed a bit rough -- like it was hinting at some better game to come. And while I don't think that Black and White 2 is the best that it could be, it's certainly a step in the right direction. Using your preference for civic improvement or warfare as a determinant of alignment gives players a bit more latitude this time around. That you can manage being a god simply by using the mouse is commendable.Not surprisingly the overall presentation and graphics are fantastic. The scale of the game is easy to appreciate at all levels, from the pregnant mothers to the massive thunderstorms. From the very first mission you'll be won over by the charm of the game's characters -- from your two advisors to your creature to the little people who occasionally need your help. There are plenty of things that I wish the game had included, but the one thing the game definitely needs to do is build a greater sense of personal involvement between you and your worshippers. As it is they mean absolutely nothing to you beyond their occupations. There are a handful of scripted interactions between you and certain townsfolk but, as a god, I felt like I should have a more intimate perspective on the daily lives of the people who worshipped me. This is particularly attractive if you play as a benevolent deity, one who (presumably) is interested in providing more than just physical comforts.", "date": "Sep 29, 2005"}