{"name": "SNK vs. Capcom: Card Fighter's Clash", "name_review": "SNK vs. Capcom: Card Fighters Clash", "ref": "https://www.ign.com/articles/2000/01/08/snk-vs-capcom-card-fighters-clash-2", "text": "Magic: the Gathering and Pokmon: Trading Card Game are easily the two biggest card battling games out on the market. If I'd have to describe these games in a sentence, it'd be the result of crossbreeding pen-and-paper RPGs with the tradability of baseball cards. SNK enters the genre with its own take on the theme for its NeoGeo Pocket Color system with SNK vs. Capcom: Card Fighters Clash.  Card Fighters Clash doesn't really add much to the genre of card battling, but for what it is, SNK really put together a quality game that's extremely engrossing and addicting, despite its somewhat high learning curve.FeaturesTwo cartridges: SNK characters and Capcom charactersSolo and Two Player modes Trade and fight for specific cardsRPG-style story modeLink cable supportFor NeoGeo Pocket ColorCard Fighters Clash is definitely not for everyone  you'll need a lot of time and patience putting organizing your deck, trying to come up with the perfect set of cards that will demolish the competition. There is definitely a lot of strategy involved with this type of game, and it's no different with Card Fighters Clash. The game is essentially an RPG where you battle other players for cards to advance through the rankings of the game. You'll solve puzzles and activate certain things that will gain you more cards to put in your decks.The reason why this game is called SNK vs. Capcom is simple: every single card in the game has some connection to an existing SNK or Capcom videogame  each attacking character had a roll somewhere in a familiar arcade or console game, and you'll be playing your own game of ~guess the reference~ with many of the characters in Card Fighters Clash. Sure, you may know where Ryu, Claire Redfield, Mega Man, or Blanka come from, but what about Leo? The game comes in two packages  an SNK version and a Capcom version. The only difference between the two is that SNK characters are more common in the SNK version, and Capcom characters show up more frequenly in the Capcom version.You start with an extremely rudimentary deck of cards that contain two types: Character Cards and Action Cards. Character Cards are what do battle for you  each character card is assigned battle points and soul points. Battle points are how much attack damage you can inflict on another player's cards or the player itself. These battle points are also used to defend your character from being taken out. When your card runs out of battle points, it's taken out of the game. Soul Points are points that accumulate when you put a Character Card into the game. These points allow you to pull off special attacks that are described on specific cards  if you don't have enough soul points, then you cannot activate these special offensive or defensive moves. Okay, so now you've got your cards. The board only allows three spots for three attackers/defenders  the idea is to attack your opponent with your cards, but he/she can defend him/herself with cards of his/her own. Each player starts with 2000 hit points, and if a player can't defend him/herself with a card, he/she'll take the damage him/herself. Each player takes turns, which involves putting out one attacker at a time, as well as utilizing action cards that can harm the other player's cards or the player. At the end of your turn, you can choose to attack your opponent, but if you do, you'll put those cards out during the other player's turn (which means you can't use them to defend for you). When a card attacks, the damage inflicted is calculated by the Battle Points on your card. But the defender also inflicts damage on the attacking card with its Battle Points, so you better watch out during the attack phase. Some Character Cards also have capabilities which can be called upon during a match, from taking out a players card to enhancing the Battle Points of your own card. During an attack phase, you can even add back-up cards to special characters  for example, if you put down a Leon card (from Resident Evil), you can choose to ~back up~ this card with a Claire card, adding to the power of the Leon card.  Backing up benefits you because if you take out a character card with a backed up card, the additional points left on your card will transfer over as damage to the other player, instead of canceling out in a one-card vs. one-card attack.The rules seem complicated in a short description of the game (trust me, I really tried making this review read as easily as possible), but once you've played a round or two against the computer, you'll figure it out. It really isn't as complicated as it sounds. But if you still don't quite understand, the game features a training mode at the beginning of the game. The definite plus about Card Fighters Clash is the presentation. The graphics are absolutely gorgeous, with extremely detailed, colorful character cards, as well as flashy animations during the card battles. The game also heads over to an overhead view (much like every Japanese RPG in existence) during the ~quest~ modes, but even here the detail is really excellent. The game even features a bit of digitized sound at the beginning of the game, but it's just the announcer speaking the title. But hey, the games got good fluff!And, yep, the game has the dependable link-cable support so you can battle and trade with your friends. In fact, you're REALLY going to need to track down a buddy to find all the character cards.Like I said above, the game is definitely not for everyone. It's not a game you can easily pick up and play, and you'll spend a good hour learning the nuances to the computer AI. You'll lose many a game during your early days of the quest, but don't despair...if you're patient and willing to put the effort into the game, you'll get a lot of enjoyment out of the game. I found myself losing hours trying to sort through my hand, trying to figure a way to make things work. The game is engrossing, to say the least.", "date": "Jan 8, 2000"}