{"name": "DICE", "name_review": "DICE: DNA Integrated Cybernetic Enterprises", "ref": "https://www.ign.com/articles/2005/09/29/dice-dna-integrated-cybernetic-enterprises", "text": "Sounds like a pitch for pornographic content, doesn't it? In fact, no. My strapline is really intended to explain exactly what a purchaser of Bandai's D.I.C.E. will find in the box, which is the endless repetition of a few simple moves for a few simple hours, though I suppose that does sound a bit like-- Ah, nevermind.  You know, it was actually hard for me to come to terms with that truth. I found it difficult to acknowledge DICE's many faults and dish out an appropriate 5.5 because the game does still feature a few terrific ideas and some fairly solid technology... Well, the premise is at least one any gamer can get behind: Evil is running amok in some future or other time and place where outgoing youths can control transformable dinosaur-robot-war-machines to fight it. So get in your Dinobreaker robot things and go nuts.  Good idea! I'm applauding. Even the basic gameplay implementation of the idea is good, too. DICE offers up the transformable dinosaur robots and the enemies and the youths, so what's there to complain about?  Players pick a character and have at it. The having at it involves mindlessly smashing and blasting waves of enemies with basic melee attacks and ranged weapons. The endless armies of enemy drones spill into unexciting rooms with little to no variation, but they are at least eventually capped off by somewhat interesting pattern-based boss fights.  Dino Crush!  Not only is there a decided lack in opposition variety within DICE, the stumbling combat doesn't make any of the repeated fighting interesting. There's basically an attack and a ranged attack. While it's possible and even encouraged to occasionally transform into an alternate form to plow through enemies, it's hardly an add that will intensify all the smash, smash, smashing of silly things.   And on and on it goes...for 16 missions and countless uninteresting rooms. In each comes an assortment of plainly uninspired enemies designed to harass and harry (redundant pun intended). Occasionally there'll be races, and while I'm all for the inclusion of separate mini-games of different genres to breakup otherwise repetitive action, they're no good if they control poorly. And these extraneous modes control so poorly I suspect them of being designed specifically to kill the player many times in a row.  And this is where DICE leaves us. After the string of senseless robot beatings in square environments and against totally uninteresting opponents with the occasionally annoying race, what reason do we have to play? To its credit, DICE features a few cool boss fights and a respectable two-player multiplayer mode that's a fair bit more enjoyable than the simple poundings spread throughout the singleplayer game, but if only...  If only more effort were spent laying out the title and refining its gameplay. I'd really love to see a version of DICE that required players to quickly snap between the different Dinobreakers to solve puzzles or beat bosses. With the potential for such variety, DICE could have presented a very compelling cooperative game or at least something like LEGO Star Wars that featured independent AI characters. We could have actually been swapping between Dinobreakers to do interesting things, instead of the same uninteresting thing. You know?  Failed potential is a real downer, especially when everything is else is also so obvious. While it might be conceptually sound and technically solid, DICE suffers from a serious lack of gameplay variety. Ultimately, it feels...numbing.", "date": "Sep 29, 2005"}