{"name": "Rome Total War Barbarian Invasion", "name_review": "Rome: Total War - Barbarian Invasion", "ref": "https://www.ign.com/articles/2005/09/30/rome-total-war-barbarian-invasion", "text": "1500 years ago, one of the greatest political and military powers the world had known collapsed under the weight of systemic invasions by a largely disorganized, technologically inferior group of people collectively known as barbarians. The term was originally just a way of saying ~foreigner.~ The Greeks, who give us this term, apparently thought that the language of their neighbors sounded like ~bar-bar-bar.~ Still, for most of us, the word barbarian conjures up images of the shaggy, ax-wielding northmen who came knocking at Rome's door all those centuries ago.   With all that in mind, Barbarian Invasion makes a hell of a good title for the expansion that covers the fall of the Roman Empire. Unlike previous Total War expansions, the invasion here isn't speculative (as in the case of the Mongols) or exaggerated (as in the case of the Vikings). In this case, the Barbarians managed to demolish the political reality of a Roman Empire, at least in the West.   Attentive readers will remember that I proclaimed Rome: Total War one of the best games I have ever played. More than a year later, I still hold that opinion. Though the campaign is a little oversimplified, it's really only there to provide a sense of context and continuity for the game's brilliant tactical battles. Given Creative Assembly's track record, we were pretty excited to get our hands on the inevitable expansion.  So here we are, a year after the release of the original game, and we're holding a copy of Barbarian Invasion in our hot little hands. True to form, the expansion offers a wide range of new units and new factions. The Roman Empire has been split into two separate factions, one for Rome in the West and one for Constantinople in the East. Nearly a dozen playable barbarian factions populate the rest of the map, from the Saxons in the north to the Sassanids in the east. Some barbarian factions don't even have a starting territory at all. Instead they begin with a massive army and must capture a home.  The barbarian tribes offer plenty of new units. The Celts can make use of morale-boosting druids or the nearly unbeatable, purple-skinned Hounds of Culann. The Romano-British tribes can field mighty Graal Knights or their own version of the Roman Legionnaire. In the east, players will find Hunnish horse archers, capable of forming the dreaded Cantabrian circle, a formation that has them spinning in circles as they fire on an enemy. The Vandals can make use of a wide variety of mounts as well, including a mounted version of the priest.  While there are significant differences among the units for each faction, the barbarian tribes tend to run together after a while. Those in the west have great infantry; those in the east have great cavalry. It may be asking too much for there to be as great a variety among the new factions as there was in the core game, but there's still no escaping the fact that one barbarian faction seems a little bit too much like another.  In (mostly) keeping with history, the barbarian tribes are highly mobile. If their last settlement is taken, the barbarians merely take the form of a massive army that ranges across the land looking for a new home. Though this is relatively okay from a historical accuracy standpoint, it can create some problems with the actual play of the game. The Huns are an excellent case in point. Since they begin without any settlement, and with a sizeable army, it's damn hard to check their advance through Europe. The designers have made it so that once they settle down their entire army disbands but it's all too easy to make your way straight to the gates of Rome, knock them down and make with the pillaging. Since none of the rival factions want to contend with an army that large, the landless armies can pretty much have their run of the map.      One final note about the campaign: The actual map hasn't changed at all in terms of size or focus. While it might have been nice to see a bit more of the northern edge of things, the gang at Creative Assembly have been content merely to redraw some of the political boundaries to fit the new barbarian campaign. The campaign map is still as beautiful as ever with loads of cool geographic features. Given the way the map is rendered, the majority of your fights will still take place outside the walls of cities.  Speaking of city fights, the new expansion makes more use of the issue of revolts for the Romans. Keeping the peace seems much harder this time around and you're bound to face rebellions left and right, particularly if your empire starts to get too big. Leave the rebellions alone for too long, and you may even find that part of your empire splits off and turns against you.   The concept of religion also plays a new role in the game. Each city and commander has their own religious preferences and you'll need to make sure to match them up appropriately. Certain retainers and certain buildings can help speed up the process of religious conversion as well.  The new night battles are pretty much just a visual treat. Seeing tattooed Germans or Franks come pouring out of a dark forest or watching your onagers fling flaming missiles at an enemy formation is even cooler at night. That the flames light up the area around them is a nice treat as well. I'd love to have seen night carry some sort of tactical consequence with it. When you join a night battle and find that line of sight or command and control aren't affected, it kind of undercuts the game's realism.  The one area in which the night battles are strategically significant: Commanders who aren't competent enough to launch night battles themselves will fight at a disadvantage when night battles are forced on them. Admittedly, this is kind of a minor point, but it does come into play.  Swimming is another new option and one with a little more tactical application. Most of the lightly armed units (and some of the cavalry) can now cross rivers at any point. The only hitch is that unit are very vulnerable while crossing and tend to be kind of tired once they reach the other side. (You try swimming in a linen cuirass.) While it allows you to get around the flanks of an enemy, it's pretty much suicide against a prepared enemy who knows you're coming.  Graphically, the game looks pretty much the same. You'll find that the new night battles are a nice change of pace but beyond the cool lighting effects, the game is largely unchanged. Still, the new lighting is quite amazing. Seeing the torches of your enemy in the distance really helps to get you in the mood for the action to come.For fans of Rome: Total War, Barbarian Invasion is a sure bet. It offers more factions, more units and a couple of cosmetic touches that will be sure to have you falling in love all over again. Purists will lament some of the liberties taken with the history, but this is a game after all, and we're willing to forgive some of the inconsistencies as ~artistic license.~ What is less easy to look past is the relatively homogenous nature of the barbarian factions. While there are some key differences between those in the east and those in the west, it feels like so many variations on a theme.Nevertheless, Rome: Total War - Barbarian Invasion is a must-have addition for anyone who wants to extend the options of the core game.", "date": "Sep 30, 2005"}