{"name": "Kingdom Under Fire: Heroes", "name_review": "Kingdom Under Fire Heroes", "ref": "https://www.ign.com/articles/2005/10/01/kingdom-under-fire-heroes", "text": "A solid, involving action game with realtime strategy elements, Kingdom Under Fire Heroes does its predecessor proud by surpassing it in multiplayer modes and options, and makes an effort to give offline players more bang for their buck. While Heroes is not a distinct departure from Crusaders, subtle changes to the game's core mechanics makes Heroes play differently. While veterans of Crusaders may find themselves divided over the changes in Heroes, novices to console RTS-style games will either be duly impressed by the game's unique mix of game types or be utterly overwhelmed on their first try.   Kingdom Under Fire started its life as a dedicated PC RTS; when Crusaders came to Xbox, the introduction of real-time combat gave Kingdom Under Fire a unique feel. For those luckless players who missed out on Crusaders, the game plays similarly to an RTS -- at least for the most part. On the surface, it's similar to Dynasty Warriors in that it offers a massive field of characters on screen at one time, and a major component of its fun is the simple, combo-style combat. But once you get into it, Kingdom Under Fire is no different from the other magic and fantasy RTS games released over the years. The major draw with Kingdom Under Fire is when a player's personal unit enters combat with an enemy unit, the player has direct control over the chosen hero.    For the duration of the battle, the player actively controls his leader in direct combat much like one would expect in such games like Sengoku Musou (Dynasty Warriors), Bujingai Forsaken City, or Berserk. This degree of control is no accident; Phantagram had this concept in mind from the start. With such control over the hero, directing one's rage against the enemy's most lethal foe is possible while allied units (under some direct control) supports the main thrust. A properly played hero with a keen eye on the opposition and well trained units makes for a deadly force on the battlefield, whether on Xbox Live or offline on a campaign.    The Story  Heroes occurs before and during the events of Crusaders. Players who are familiar with the Encablossa War from Crusaders will find out more about the various personalities from Ellen's past to Walter's involvement in the Greyhampton incident. Six of the officers from Crusaders are playable in Heroes: Ellen, Rupert, Cirith, Morene, Leinhardt, and Urukubarr. A seventh playable hero, Walter, is the father of Thomas -- one of the officers from Crusaders. Each campaign tells a bit of the over all story from that hero's perspective. While the cut-scenes are not fully computer rendered, the realtime cutscenes and spoken dialogue convey enough of the story so players can piece together the whole picture themselves.   With seven story mode campaigns overall, one would figure Heroes has a tantalizing three dozen missions. That answer may be a ~Yes~ or a ~No~ depending on how one looks at things. While each character has approximately 10 or so missions in their respective campaigns, not every mission relates directly to the story. Well over half of the missions in each campaign rely on Heroes' new random mission generator to create random missions with enemy units of equal or slightly lesser effectiveness as a player's force. These unknown missions are optional and occur on one of the twenty odd small maps that are also available in the game's Custom Battle mode. While not particularly thrilling in the sense of having story, these random missions are crucial to a character's survival in the campaign since completing them will net the vital experience and gold otherwise missed from just fulfilling story related missions.   Initially, only three of the seven campaigns are available -- Ellen, Walter, and Leinhardt. Only by completing each campaign will players unlock access to the remaining campaigns of Urukubarr, Rupert, Morene, and Cirith. This brings Crusaders immediately to mind when only two of the four characters were available initially. Again, Phantagram planned this ahead, for if a player cannot even complete the early campaigns, one has little chance of surviving the later stages. All this preparation is not for naught. Once a player clears a campaign, the game saves cleared progress. This extends the replayability of Heroes but not by much since players can only access the stages and missions of that particular hero. Since the opposition in the campaign does not improve, players wanting a greater challenge may grow bored and abandon the cleared data.   The Acting  One major complaint of Crusaders was its lack-luster English dialogue. While it's true that great animated shows like The Simpsons and Family Guy are animated in Korea, it's another thing to showcase less than stellar voice talent on such a solid product. Luckily, for those players who don't care for English voice talent, there is the Korean voice option. Couple this with the English subtitles available in the game options and one pretty much treats the game as an interactive animanga. While much of the mission briefings are lengthy or involved, much of the vital battle information is revealed on the menu just before entering a mission. Brief messages such as, ~Prepare for enemy air units,~ are usually enough to warn players of impending death as opposed to the long drawn out dialogue from Korean speaking Orcs.   The Muzak  Another major complaint from Crusaders was the grating wannabe punk rock that served as the game's primary soundtrack. If one did not appreciate the muzak from Crusaders, nix the muzak in Heroes. Unlike last time, the box sports the correct information this time -- there are no custom soundtracks available for Heroes.     The Units  Kingdom Under Fire has achieved something that the much lauded Starcraft did years ago, and that is to create an interlocking web of units and counter-units divided more or less equally between two nominally hostile factions. For the most part, infantry serves as the main unit that does all the fighting in the game. Infantry are fairly slow but that is off-set by their innate toughness. While infantry are tough, they can be whittled down by archers, bombarded by long range units, or trampled to death by cavalry. Cavalry is fast and can destroy infantry and most other ground based units with ease but are stopped by archers and spear/axemen. Archers are useful for long range harassment. When archers are in range of infantry engaged in melee, their arrows quickly decimate infantry numbers. However, infantry not in melee and marching in tight ranks take little damage from arrows. Other units such as sappers, spear/axemen, ballista, wyvern riders, and mortarmen fill out the rest of the job tree.   Each faction (Human and Dark Legion) have access to similar units, although each side may have unique abilities. For example, human archers can set small patches of forest on fire to weaken foes or drive them out. Dark Elf archers lack this arson-at-range ability, but they have the ability to imbue their arrows with Elemental Boost and double the damage they do to enemies temporarily. Human and Dark Legion factions also have access to units unique to their cause -- the Dark Legion's Swamp Mammoth is invulnerable to everything except explosives; Human mortars are similarly devastating to the mammoths, but are torn apart by Dark Legion Dirigibles and Wyvern Riders.   Additionally, race plays a small part in drawing up a unit's various resistances. Human and orc infantry, for example, are vulnerable to cold while Dark Elf infantry are vulnerable to poison (despite the Dark Elf habit of wearing less clothing). Racial attributes also extend to unit performance on the field. Orc infantry are slow of foot but are physically tougher than human infantry; Dark Elf infantry can regenerate lost health under cover of forest but are physically weaker than humans.    Heroes adds to this already impressive roster of units with four new ~Elemental Units~ represented by Golems, Rhinos, Wraiths, and Maidens. Each elemental unit represents one of the four ~earthly~ elements (Earth, Lightning, Fire, and Ice) and are pretty much treated as super-tough shock unit designed to destroy enemy infantry and to support a player's personal hero in combat. These elemental units are available to both factions and -- considering the cost of training such units -- are designed more for online play rather than campaign play.   The Combat  Phantagram tries to up the bar with seven characters, each with supposedly interesting moves; however, most moves are difficult to execute or not terribly effective. Most battles quickly degenerate into a frantic pushing of the X button in the direction of the most enemies followed by the timely press of BLACK or WHITE to call upon subordinate officers to help. Occasionally, players may not even want to rely on officers, especially if these officers are not trained. A hero's special ability (usually the Y button) can be used to ~wide damage~ enemies but often, even that fails to make a dent in enemy troop strength early on.   Occasionally, players may find that their direct participation in combat is not always necessary since one is busy clicking on the mini-map and monitoring the status and activities of their allied units. Luckily, the player's hero is invincible (but inactive) during this time, so while a hero cannot be knocked-out when players are doing something else, the character is also not being very helpful on the battlefield either. While we're on the subject of direct combat, Heroes retains the same stiff motions of moves from Crusaders. Players who are accustomed to the smooth responses of 3D fighters like Sengoku Musou (Dynasty Warriors) or Mortal Kombat Shaolin Monks will find the motions of the Heroes characters stiff, uninspiring, and not-at-all smooth.   On the RTS side, accurate point and clicking with the Xbox's joystick and buttons are required for both Crusaders and Heroes. It's a universal complaint amongst the editors who are unfamiliar with Kingdom Under Fire that its controls are clumsy -- it is a fact. However, considering the alternatives, Phantagram has done their utmost best to make the Xbox controller-S work with the game and Heroes works, but takes some getting used to. The triggers are used both to bring up the mini-map for strategic control as well as for cycling through units. Again clumsy, but workable. In a frantic state of mind, it is not unknown for players to slip up and shoot past the unit they intended to select. This is one of the prime reasons for the relatively low number of units under player control. Support units and special units (such as Storm Riders or Ghoul suicide bombers) are selected differently than green ~active~ units. Ultimately, one's enjoyment will depend on one's ability to master the controls.   Still, there is much to crow about in RTS/strategy mode. Terrain height affects the effectiveness of arrows, as will the presence of the sun. Units wading or swimming in rivers will find themselves up a creek without healing salve when Wyvern Riders blast them from the sky. Forest plays a large role in almost every battle; Dark Elf units all regain life while in forest. Additionally all units are fairly protected from most air units and arrows from archers while under cover of forest. The option of setting forests on fire will remove the forest cover, but it will still show on the mini-map as forest terrain. Perhaps the lack of varied terrain on any one map makes for the same tried-and-true strategies in every battle -- Dark Elf units usually lose out in forest-less maps while archer and air units lose out in heavily forested maps.     The Differences  For those players who completed Crusaders, Heroes sports some changes. First and foremost is an officer's assist attack is no longer tied to the X, Y, B, and A buttons and instead are placed on the BLACK and WHITE buttons. Many times in Crusaders, an ill-timed press of a button results in a loss of 200 SP because one's fingers slipped. Another big change is how experience is allocated. In Heroes, a multi-skilled character such as a mixed role sapper, mortar, spearman leader will find that the cost of increasing skill proficiency goes up dramatically. Whereas Crusaders based a skill's cost on the current proficiency of the skill being increased, Heroes bases the cost on the sum total of all the skills of a leader. However, this is off-set by the ability to reset the skill levels of units in any mode and recycle the experience in building units with new jobs or re-allocating skill sets.   Still more changes include the subtle increase of the Dark Legion's Tree of Healing spell from 350 SP to a whopping 450 SP. The maximum number of units one may bring into a mission (story or multiplayer) are five active units and one support unit; in story mode, the limits may be even fewer. Many of these changes seem to stem from balance issues on Xbox Live; however, these changes are not for the betterment of offline play in the campaigns.   On the other hand, the amount of gold during a campaign has increased due to the presence of the random missions. With the ability to carry over one's earned skills, equipment and troop types upon completion of a campaign, players may find campaign missions more enjoyable the second time around. Unfortunately, one must survive the first time around to get that benefit!   The Live (Online) And Dead (Offline) Modes  By far the greatest improvement of Kingdom Under Fire has been to its multiplayer aspect on Xbox Live. Where Crusaders only had one-on-one deathmatch, Heroes improves vastly by offering three-on-three melee, three-on-three leader combat (close combat between leaders only), and a terribly addicting three-against-CPU Invasion Mode. As before, experience earned in Live matches are saved and enables players to increase their force's skills and change jobs.    If players are interested in polishing their combat skills or have no access to Xbox Live, one may play offline Custom Games. Players select any one of the seven leaders from Heroes or four leaders from Crusaders and can experiment or splurge the gratis one million experience points on their units as they like.  Experimentation in the offline custom game is a boon -- one may research the effectiveness of a particular troop job before making the change on Xbox Live and save themselves some much heartbreak when they realize a particular job type isn't what they particularly desired.Ultimately, Kingdom Under Fire Heroes is not for every gamer. While it has redeeming elements in the 3D combat geared towards mindless hacking, the game is too difficult and too specialised to have broad appeal to the everyman gamer.Rumour has it that Heroes essentially looks the way it does because much of Phantagram and BlueSide Studios has been drawn into developing Ninety-Nine Nights for the Xbox 360; if this speaks true, then one should be expectant of the up and coming title as a next-gen game-gasm for Kingdom Under Fire fans. Still, Kingdom Under Fire Heroes is not without its inherent charm. A truly dedicated RTS gamer will want to pick up and play Heroes; once he does, the controller will be hard to put down.", "date": "Oct 1, 2005"}