{"name": "Tak: Great Juju Challenge", "name_review": "Tak: The Great Juju Challenge", "ref": "https://www.ign.com/articles/2005/10/03/tak-the-great-juju-challenge", "text": "What's a ~Juju~? I'll admit, I haven't got a clue. Nickelodeon and THQ's Tak series has quietly been plowing along on consoles without me, running through brilliantly colorful adventures that seem decent entertainment for the young fans into the series. Tak is a guy that I've always wanted to get to know -- after all, folks like Patrick Warburton are part of his cast, and you can't pass up a chance to hang out with a fellow dressed up in a chicken suit for that long. This DS game, the first 3D Tak for handheld systems after a couple of 2D platformers on GBA, seemed a good chance to get to get to know Tak and see if there's more to go back through the old games for.  Here's the problem with my experience with Tak: The Great Juju Challenge: I still have no clue what ~Juju~ is.  That may not seem that big a problem -- a ~Juju~ (or the ~Juju~, apparently) is something that the world of Tak is all about, and you get to know all about ~Juju~ while you're bopping around and hopping on platforms in a few hours of videogaming. But I never figured it out. I'm sure I could have, if I was tuned in to what was going on, but this game fought me off every time I tried to get to know it. A dozen pages of scripted text popped up on the screen after each level, and no matter what helpful tips or directional notes there were in those pages, I just couldn't get through them fast enough.  Normally, presentation doesn't kill a game, but Tak: The Great Juju Challenge was so dry and so dead that it spoiled the main game for me. Critics knock FMV for being frivolous, but a little drama and comedy is the difference between weathering an average game (and in play, Tak isn't much better than average) and really enjoying the small fun to be had. Give me a story, toss in some conflict, juggle in some jokes, and I'll be ready to go for a few hours just to see what's around the bend and what might happen next. Tak DS was just pure text in an age of cinematic storytelling. If it were good text, that'd be one thing, but the writing here is as tasty as unbuttered toast. Characters aren't established, they just show up. Jokes have to be explained (and often are.) It's all written in a scribbly cartoon font, which doesn't help it go down any easier. There are animations and drawings to go along with the text sometimes, but the images are up on the top screen when you're squinting to read the nonsense down below, and the top screen is usually just showing a 3D character shrugging or a still picture of a character doing nothing particular. The DS sells enough copies of its games that these game companies can start footing the bill for some FMV or voice-over work, and this game could have gotten a big boost from having character brought to it.  It's a shame that Tak got short-changed on that side,  because the main game is promising -- nothing stellar, but with so few platforming romps on the DS this early on (and one or two of those being painfully hobbled in coming to the system), this would have fit the bill if it had shown off its goods. Developer Altron has a respectable rep in its GBA development with both its technical work and its game design, and its first 3D engine on the DS is one of the system's best. The lush world of the Tak console games is brought with only a little foliage plucked out in the translation to the DS's more meager but plenty capable system capabilities. The framerate is great in every one of the game's multiple play modes, which also include racing and chicken-floating (nominations for Olympic sport contention, by the way, start here) in addition to standard platforming. Tak himself is drawn with an eye for detail (the shadowing of his eyes and the big-footed steps of his walk are key to making Tak look like Tak.) There are plenty of special effects to dress things up as well, such as the mist drifting off a waterfall or the glow of Tak's feather when he's in the dark. The DS's low-res texturing abilities is usually hidden pretty well in the lush world -- you usually don't get hit in the face with blocks of textures except for close-ups in cutscenes, and as I said, cutscenes are rarely that detailed to begin with. And whatever problem Rayman DS had in making things bright and colorful, this game doesn't have to deal with -- some scenes could pop a little more than they do, but it's never like you're playing with sunglasses on like in that game.  It's a strong foundation for Altron's next game -- and they're a prolific developer, so I'm sure we'll see plenty more from them -- but The Great Juju Challenge is lots of prettiness and not much fun. The gameplay mechanics (which ditch the faux-control stick analog touchscreen play most 3D platformers have tried to do with the DS for standard D-Pad control, and it works fine here with the touchscreen mostly helping on the camera) are good, but none of Tak's abilities are special. Lok is only shades different in moves and abilities. The regular enemies are as regular as they come, and even though Tak has a lot of different combat combos, whacking at these punching bags can get dull quick. There are sometimes, neat puzzles or unique features that distinguis a level -- one of the most fun is when you sock a rhino to get it mad at you so that it breaks the barriers in front of you. That's good, but the story presentation is so droll that you sometimes are wandering a stage forever trying to figure out what the heck you're supposed to do -- there's no directional arrow or dialog from your pal to help guide you, and the only clue as to what you're supposed to do was in that long sprawl of text you skipped through in the cutscene that you now can't repeat. There's also a system for enhancing your characters (and car) with blessing gems from trinkets you've collected, but the system doesn't offer a lot of flexibility or experimentation, and the awkward system of placing gems in pre-set slots takes more time than its worth and isn't explained very well to know what's going wrong when you've hit a limit or are dropping a car gem on a character.  Despite the platforming being the meat of the game, the minigames are probably the most promising aspect of the game. The ones that use the DS's special features are usually the best, although they're also usually the most limited -- the Chicken Suit Tak, for instance, is brilliant in that you blow on the microphone while steering Tak to get him through perilous stages, but the first 10 seconds is the same as it ever gets. Each of the 10 games can be repeated off the menu (plus the bonus Shaman Games, which are fun rounds of a puzzler), either in Scenario mode or Endless mode, but there's no multiplayer to the game. There's also not multiplayer to the racing, which is just as well -- these cart races are prominent in the game (it's part of the story to be racing on new stages all the time), but they're underdeveloped and not much more fun than that one race every few stages. The graphics do their job in making the races look fast and colorful, but there's nothing going on with the opponents or on the racetrack to make racing worth your while.  My biggest problem with Tak: The Great Juju Challenge was that I got nothing out of it. I sat and played through it, and picked it up on occasion over the weekend as well, but I don't remember almost a single moment of it. I fought a couple of bosses that I punched until they died, I wandered aimlessly around stages looking for hidden sticks to light, there were some cart races that I didn't bother trying for first in when I didn't have to, and every once in a while, I would blow on the screen to make a chicken-suited guy float around. It it's all pleasantly decent 3D platforming play, but there was nothing to carry interest and inspire you to play through. Kids who are up on their Tak after going through the console games may understand more about the characters and story that I got to know from the game's snore-inducing text script, but they'll probably be just as bored to have exciting scenes and silly encounters play out with such lacking enthusiasm. Maybe next time, Tak.", "date": "Oct 3, 2005"}