{"name": "Looney Tunes Cannonball Follies", "name_review": "Looney Tunes Cannonball Follies", "ref": "https://www.ign.com/articles/2005/10/04/looney-tunes-cannonball-follies", "text": "Warner Bros. Online recently decided to take its fate in its own hands and open up a dedicated mobile division, which has enjoyed mixed success. Batman Begins and Constantine were both pretty solid mobile games while Harry Potter Find Scabbers, was, well as fun as picking a scab. But as a simple mobile game, Looney Tunes Cannonball Follies is better than all three. The game features a likeable character to all ages and some deviously addictive game play. It's the kind of game to permanently wash the last foul remnants of Looney Tunes Zany Racer off of your handset.   The rootin'-est, tootin'-est Yosemite Sam is behind the barrel in this puzzler. Using his cannon, Yosemite Sam must fire the titular cannonball into a receptacle placed somewhere on the screen. Early levels offer fairly easy challenges, so you can get used to the game's mechanics. You control the power and the pitch of the ball by moving the d-pad around. When you feel you have the magic combo, press ~OK~ to fire away and try to get it in the bucket.   In later levels, Sam must overcome colorful walls, bop switches, and navigate pipes. You have an unlimited number of cannonballs at your disposal, but the fewer you use, the better your score. Each level has a sort of ~par~ you need to really aim for to maximize end-level bonuses. Sam can also pick up cannonballs with special properties, such as tracers that show the ball's path even on the next volley. Screens are also littered with bonus objects, like coins and jewels that should also be picked up for extra points.  Looney Tunes Cannonball Follies isn't breaking any new ground here, but it offers a solid refinement on a basic game formula. The puzzles are smart, but not aggravating. Yosemite Sam is a lovable host, a fan fave right up there with Foghorn Leghorn. Looney Tunes Cannonball Follies is a good puzzler, and a good first volley for Warner Bros Online's sure-to-be suite of Looney Tunes mobile games. Let's hope they all keep their eyes on the ball like this one.", "date": "Oct 4, 2005"}