{"name": "Castlevania: Dawn of Sorrow", "name_review": "Castlevania: Dawn of Sorrow", "ref": "https://www.ign.com/articles/2005/10/04/castlevania-dawn-of-sorrow", "text": "Though the Castlevania series had moved on in the world in 3D incarnations since Castlevania 64 nearly a decade ago, the spirit of the series remains firmly in place in the handheld realm. The series has been way more hit-or-miss on the consoles since the release of what's been considered the pinnacle of the series: the PlayStation's own Castlevania: Symphony of the Night, proving that sometimes evolving a series into a 3D engine isn't exactly the best thing to do.   But the Castlevania series has thrived on the portable system -- Konami has produced three original games in the franchise (as well as a port of the original game in Nintendo's Classic NES Series). Each version of the series for the GBA, apart from the classic NES version, gets better with every incarnation, mostly due to the development team's constant balancing of gameplay devices as well as an improving knowledge of the system capabilities and limitations, and building programming techniques to really push the hardware functions.   Castlevania: Dawn of Sorrow follows this handheld trend to a T. Though the Nintendo DS is clearly far more capable in its hardware power to drive a more contemporary 3D design, the development team stuck to the game's roots on the handheld and have produced the best portable Castlevania game to date. Like past handheld Castlevania games, Dawn of Sorrow is more an evolution than a revolution, and the DS functionality is much more supplementary than integral to the design, but man -- this is one hell of an action adventure. You want a DS game with punch? This one's a knockout.   This original Nintendo DS design picks up very shortly after the happenings of the last GBA game in the series: Castlevania: Aria of Sorrow. Here, the lead character Soma Cruz, fresh off his victory defeating the undead threat in the previous adventure, now must once again use his skills to stop a cult threatening to give rise to Dracula. Once again. This guy never stays down.   Dawn of Sorrow builds off the gameplay of the GBA adventure, which in itself built off the classic Castlevania structure: platform hopping, enemy slashing, soul stealing, and the occasional puzzle solving. Though it's an adventure game in genre, Castlevania: Dawn of Sorrow is all action, and the Nintendo DS game doesn't disappoint with a never ending onslaught of enemies with different attack patterns and strengths. There are literally dozens of bad guys to hack-n-slash, some of which (like, say, Bigfoot?) aren't exactly in harm's way without a little special and not-so-obvious coaxing.   The ~hook~ of Dawn of Sorrow is the same hook that Aria of Sorrow featured: Souls. Each enemy has one, and Soma has the ability to take it. Defeated enemies occasionally (and randomly) give up their souls for Soma to acquire, and these souls can be used a variety of different ways depending on the creature. Some offer an offensive technique that can be used , others a special move to reach out-of-the-way items. And some souls can be used to fuse with weapons to create more powerful arms for the fight. For Dawn of Sorrow, the developers give players the ability to have two different ~profiles~ to make it easy to switch back and forth between Soul settings, an extremely handy idea most likely spawned out of Konami's own Castlevania-inspired GBA spinoff, Shaman King.     Castlevania doesn't exactly explode with amazing DS-based design ideas, but what's here works for the most part. Though the dual screen portion is really just a convenient way of displaying the castle map, but honestly, that really makes things so much handier. Players no longer have to pause the game and switch to the map to see where they are and where they're going -- now it's up there on a permanent basis. The touch screen elements created for the game aren't entirely creative, though there are some cool ideas in place: the best element, the ability to hack at ice walls to create platforms and staircases, isn't used nearly enough in the level design. The more prominent touch screen control comes in the form of ~seal drawing~ to banish boss characters after defeating them -- as unique as this feature is, it's not all that necessary and actually makes boss fighting, especially towards the end, a little unfair if your penmanship sucks.   In fact, most of the Nintendo DS functionality is utilized modestly in Castlevania: Dawn of Sorrow, but that doesn't hurt the product in the slightest. The designers kept the visuals along the same lines as Aria of Sorrow, looking at the two games side by side it's clear that there's been a vast improvement in both graphic engine and art design. Sprite animations are stunning and fluid, and enemy characters move (and explode) with grace using the DS systems' scaling and rotation abilitiesjust like the GBA versions, only at a much broader and more impressive scale.  The cutscene artwork, however, has been changed drastically from Aria of Sorrow, bringing the wonderful artwork of the GBA version down to the level of ~generic Saturday morning Anime~ quality. Luckily this style is limited to the occasional talking head cutscene and a full-motion video introduction.   The Castlevania series has been known for its memorable soundtrack accomodating the action, and Dawn of Sorrow definitely doesn't disappoint here. The Nintendo DS hardware is put to fantastic use providing tunes appropriate to the ~haunting~ setting of Dracula's castle. The dual speaker setup of the handheld system pulls off the game's use of stereo extraordinarily well...right down to the ~ping~ of the cursor on the map when it moves from one side of the screen to the other. The only thing missing is voice-over for the cutscenes. It's the best sounding handheld Castlevania game ever, and could even come close to beating Symphony of the Night in the audio department.   Added to the design is system link functionality for data trading and multiplayer competition. Just like Aria of Sorrow, players can trade souls from their collection to acquire ones they might not have stumbled upon in the adventure. Added to the design for the first time is a casual, basic multiplayer competition where players can race against each other in a custom castle layout. And a surprising treat: it doesn't matter which version of the game you've purchased: players can link up between the English and Japanese versions with no problems in trade or competition. So impatient importers with the Japanese card, don't fret -- you can hook up with friends with the North American edition.   And even when the single player adventure's over, it's really not. This isn't a spoiler, so read on: along with uncovering multiple endings to the storyline, players can, like in previous GBA games of the Castlevania series, return to the castle as an old-school member of the Belmont family, complete with the dangling whip introduced in Super Castlevania IV. Its an adventure that ends, but the designers give Dawn of Sorrow an enormous amount of legs even after it's completed.  Dawn of Sorrow doesn't take the Castlevania series to enormous new heights on the Nintendo DS, but that's what makes it so fantastic -- the development team has taken what worked on the GBA and built off that foundation, solidifying what worked and what could be improved, all the while offering a modest assortment of new elements specific to the Nintendo DS platform. The final product is what is clearly one of the best Castlevania games in the series, and an absolutely top-notch, beautiful, and most importantly, fun DS game that doesn't try to push a lot of unnecessary touch-screen ~gimmicks.~", "date": "Oct 4, 2005"}