{"name": "Brothers In Arms: Earned In Blood", "name_review": "Brothers in Arms: Earned in Blood", "ref": "https://www.ign.com/articles/2005/10/04/brothers-in-arms-earned-in-blood-4", "text": "Believe it or not, I'm sick of being a super soldier. I no longer dream of cutting my way, Rambo-like, through a group of Commie zombies who have taken over my high school. (I do, for the record, still dream of the after party where the entire cheerleader squad expresses its gratitude to me in what might most tastefully be described as a celebration of life.) Anyway, before we get too deep into my own personal issues here, the point I'm trying to make is that there are plenty of games that let you take on entire armies all by your lonesome.  Earlier this year, Gearbox challenged that model with the release of a sophisticated tactical shooter, Brothers in Arms: Road to Hill 30. Brothers in Arms punished those who relied on run-and-gun tactics. Trying to rush an enemy machine gun nest meant certain death. Attacking a nearby tank with grenades was utterly pointless. Instead of relying on the cinematic action hero approach, players of Brothers in Arms had to effectively lead their squadmates around the battlefield, using suppression fire and flanking moves to outmaneuver an enemy every bit as deadly as the player was. A thrilling story and intense attention to detail made the game all the more engaging.   Now, barely over a year later, the team is back with a sequel, Brothers in Arms: Earned in Blood. Now I use the term ~sequel~ kind of loosely here. While Earned in Blood is a stand-alone game with a fifty dollar price tag, the changes it makes to the core game are more in line with what we'd expect from an expansion pack. There are some new game modes, a new campaign and some impressive AI and texture improvements of course, but the content and gameplay still feel more like an update of the original Brothers in Arms than a full sequel.  Since the dust has barely settled form the first game's launch, some gamers may be inclined to pass on the new game. The ~been there, done that~ quotient is pretty high in this game. Still, the best argument against passing over Earned in Blood is that, discounting the original game, there really aren't any other games like it. Rainbow Six, Ghost Recon, Full Spectrum Warrior and others each contain small components of Brothers in Arms, but none put them together in quite the same way. What this game accomplishes in terms of its historical authenticity and innovative tactical combat system is genuinely unlike any other video game you've ever played.  But let's talk about what's new. This time around, you'll be taking charge of Joe ~Red~ Hartsock, the ~other~ sergeant from the original game. The new game covers much of the same territory as the original, but you'll be seeing it all from Hartsock's perspective. There are a few moments of dj vu here and there, and it's nice to see some of the connections to previous missions. The most satisfying moments come when the story takes you off into new territory and presents you with situations and environments that you didn't get to see the first time around.  One of the problems with the original game was that the enemies were fairly static. Though they responded to your own movements from time to time, they never really seized the initiative and tried to outmaneuver you. This meant that players could effectively stop behind cover and spend a few minutes contemplating their next move. You won't have that kind of free time in Earned in Blood. The AI is much more aggressive now, particularly on the higher difficultly levels, and you'll find them trying to move around to your flanks.  You'll need to refine your tactics quite a bit to combat this more fluid enemy. Seeing them race across a field to attack a flank that you left exposed is a hell of a lesson for budding NCOs. The levels are open enough and offer enough cover that you and your enemies will have plenty of opportunities for maneuver here. Even better, the enemy will often have fall back positions if your advance forces them to retreat. This makes fixing them in place and taking them from the side or rear an even greater priority. Thankfully, the ultra-convenient command system from the previous game hasn't changed at all -- although I do still wish that your own squad members could man the MG42s.      Road to Hill 30 shipped with spare multiplayer offerings, so we were quite happy to see that Earned in Blood included a range of single and multiplayer game types. Using the game's new Skirmish mode, players can create solo missions or play cooperatively or competitively online. There are plenty of new missions this time around (including a few from the previous game). These objective-based missions play out like missions from the campaign, but you can set a number of variables that will make them easier or harder.  The Timed Assault missions are good for players who like to play against the clock. In this mode, you'll have to race against the clock to kill all the enemies on the map. Each enemy you kill gives you a little time bonus; each enemy your squadmates kill gives you an even larger bonus. Players will also enjoy Defense mode. Since the main game almost always puts you in the role of the attacker, it's nice to jump into a game mode that lets the enemy come to you. Setting up the defenses against an unending wave of enemies is a nice change of pace. Though I've yet to complete it, the new Tour of Duty mode sounds like a great bet for hardcore fans. It's a series of five missions you have to complete without dying.   In addition to the tactical improvements and the extra modes, Earned in Blood has prettied up the world of Brothers in Arms. Most of the changes are fairly subtle, but their cumulative effect makes Earned in Blood a slightly better looking game. The textures are the most noticeably improved visual feature. Where the first game had rather muddy textures, the new game has increased the definition and detail to the point that you'll stop being distracted by cloudy roads and walls. If you have a good enough machine, you can benefit from an improved lighting system as well. Again, the improvements aren't really obvious, but they do help to add another layer of believability to the game world.  We're happy to say that not much has changed in terms of sound. Brothers in Arms still has some of the best sound design we've ever heard. The bullets whizzing past your head or sticking in the ground at your feet brings the battle to life. Add in a range of context-sensitive voice cues and a fantastic score and you've got a title that really shows off your new sound system. It sounds particularly awesome on my new X-Fi card.  As with the first title, the language and violence make it inappropriate for kids. Parents who are considering the game for their children should use Saving Private Ryan or the Band of Brothers miniseries as a benchmark for judging whether or not the game's content is suitable.  The one thing that really needed to be improved but wasn't was the gamey convention of resurrecting your squadmates at the start of each level. For a game that purports to focus so much on authenticity and believability, it completely undercuts the realism to build up such a strong sense of character and then completely destroy any sense of continuity by bringing them back from the dead between missions. Since the game is about your brothers in battle, I'd love to have it matter more (or at all) if they died. It's a tricky problem to solve, but one that really needed to be addressed.Some PC shooter fans were decidedly unimpressed with the original game. There's really nothing here to win them over. In fact, if you aren't craving an experience almost exactly like the first Brothers in Arms, you can definitely pass on Earned in Blood. For those of us who found satisfaction in the game's authentic presentation and sophisticated tactical battles, Earned in Blood offers another chance to jump into the boots of an airborne soldier in Northern France.Still, Earned in Blood is only an incremental improvement on the original. The greater flexibility of the AI and the new multiplayer options are certainly welcome additions, but the game still feels, as Charles said of the Xbox version, more like Brothers in Arms v1.5 than a full sequel. Furthermore, it fails to address the fundamental discontinuity of building believable characters and then making their deaths irrelevant.But you know what? I don't care. The mechanics of this game are unique and enjoyable enough that I dove enthusiastically right into the sequel. Fifty bucks is a lot to spend on what is essentially a large expansion pack but, short of the first game, you won't find a more authentic or original tactical action game.", "date": "Oct 4, 2005"}