{"name": "Brothers In Arms: Earned In Blood", "name_review": "Brothers in Arms: Earned in Blood", "ref": "https://www.ign.com/articles/2005/10/05/brothers-in-arms-earned-in-blood-3", "text": "When Brothers in Arms: Road to Hill 30 was first released earlier this year, it was a big deal. The game introduced several unique gameplay elements, namely the Situational Awareness View and the ability to precisely control multiple squads using a first person shooter interface. Combined with excellent graphics, crisp sounds and a compelling, character driven storyline, Road to Hill 30 managed to deliver to gamers what many had craved since the release of Call of Duty: a true World War II tactical shooter.   Despite its success, the title was not without problems. Some major criticisms included the relative immobility of the Nazi enemies and the lack of replay value. While Road to Hill 30 did have a multiplayer mode, it was somewhat limited. With the release of RtH30's sequel, Brothers in Arms: Earned in Blood, developer Gearbox Studios hopes to resolve some of these issues   For those unaware, the gameplay in Brothers in Arms consists of issuing move and attack orders to your squads and with the end goal of trying to secure a flanking position so you can wipe out the enemy and move on. You're also given the option of switch to Situational Awareness View, which gives you a bird's eye view of the battlefield and allows you to pinpoint enemy locations and plot your attack strategies.   In BiA: EiB players will control Joe ~Red~ Hartsock and play out a storyline that runs concurrent to RtH30's. Players will find new weapons and vehicles, including the M3 Grease Gun, but they don't add enough to significantly alter the play experience.  You'll even meet up with Matt Baker from the first title at certain points. The storyline takes place in flashback fashion as Hartsock recounts the story of his journey that spans 15 days after D-Day to an officer named Marshall. There's still plenty of personality during the game's cinematic sequences, even going so far as to poke fun at Baker's overly stoic and contemplative demeanor.   It's Still World War II and You're Still Fighting GermansThe main problem with BiA: EiB is that it feels way too much like its predecessor. While the fact that the game takes players through a separate storyline during the same time period as the first title may sound conceptually appealing, it ends up lending an overwhelming degree of familiarity to the game to the point where EiB seems more like RtH30 version 1.5, not 2.0.    You will venture to some new locations in EiB, but just because they have different names doesn't mean they feel different when you're playing in them. You'll still be battling across farm fields where you'll take cover behind downed cows and artillery craters, though there are some environments that weren't present in RtH30. The objectives for each mission follow largely in the same vein as the original as well, tasking you with securing structures or defending certain areas until reinforcements arrive. They reflect the sorts of missions soldiers might expect to receive in real combat, much like in the original game.   But enough of what's the same in EiB, let's focus on what's new: more maneuverable enemies and expanded multiplayer modes. First, the enemy intelligence. Your German foes in EiB are not afraid to move around. As you move around on the battlefield trying to safely position your troops while finding the ideal flanking angles new squads of Germans will often pop into view, rendering your once secure troop placements extremely vulnerable. Also, if your positioning proves successful and you're able to advance on your enemy, they won't be ashamed to retreat back to a more protected position.     In EiB you won't be able to set up your troops on one side of the battlefield to draw enemy fire while you sneak around to a flanking position unnoticed. Your enemies will watch and dynamically follow you. By the time you pop out of cover and expect to have a clear shot at an enemy unit you'll discover they've already relocated and are ready and waiting for your attack. Many times, this makes EiB much more difficult than RtH30 as the same assault pattern will not work every time. Sometimes, though, your enemy's mobility can work to your advantage. If you do manage to surprise a group of Nazis from an extremely advantageous flanking position, they'll occasionally retreat from your assault and run right into the bullets of the squad you had assigned to providing suppressing fire.   In terms of progressing from chapter to chapter, you're still awarded medals and bonus content based on which of the four difficulty levels you've completed. If one of your squadmates dies during the course of a mission, the game gives you to the option to either magically revive him and proceed onward or to replay the mission. This cuts into the sense of realism the game is able to generate. If your whole squad were to die during a mission because you screwed up, why can't they just be replaced by a new wave of recruits? Why don't your squadmates gain experience and have adjustable skill levels that can be augmented as they survive battles? This way, you're rewarded for your tactical prowess the more you're able to keep the same group alive across consecutive missions. These are the sorts of features that would qualify EiB as a true sequel instead of just a slightly expanded update.   New Game Modes, Same Gameplay  Perhaps BiA's biggest selling point is its Skirmish mode. In it, players can choose to play over Xbox Live, system link, or in split screen across four different game modes: Objective, Tour of Duty, Defense, and a timed assault mode. You can also play as the Germans in this mode as either Theodor Luether or Lukas Wilhelm.    Personally, I enjoyed the multiplayer way more than the story mode. However, while these modes do add a little depth to the game, especially since you can play cooperatively, they don't add anything new to the gameplay. It's still the same process of the game's story mode: find the enemy, find cover, move to flank, then kill. Defense mode is an exception to this since the enemy comes to you instead of you pushing toward the enemy, but still, the essential gameplay is not taken in any new direction. Instead, the multiplayer modes wind up feeling more like chopped up versions of the story mode. These modes are great for anyone looking to hop in for some quick action, and anyone who loves the story mode's gameplay will love this mode too, the problem is it just doesn't offer anything new, just more.   To make a clear distinction between what is more and what is new, consider Half-Life 2 and Warcraft III's multiplayer modes. HL2 deathmatch is nothing like the game's story mode; it's an insane action mode full of flying toilets, bouncing plasma balls, and constant respawns. It expands gameplay by offering something new, not just merely more. Counter-Strike: Source offers an additional entirely new gameplay revolving around tactical squad combat and pinpoint shooting not present in the story mode. The same can be said for Day of Defeat: Source.   Warcraft III is perhaps an even better example since its single player and multiplayer modes have almost identical gameplay models yet are played in entirely different styles. The single player mode can be successfully completed by slowly taking over resource nodes and building an army until you're able to outnumber your computer opponent and wipe them out. The multiplayer is entirely different and as close to twitch real time strategy as you can get, demanding precise building orders, highly specific unit combinations and micromanagement, and an in-depth knowledge of unit advantages and weaknesses. Whereas the multiplayer modes in these titles add something new to the gameplay, BiA: EiB's multiplayer just offers more of what's available in the story mode.    It Moves and Sounds Like the Real Thing  I've never been to war so I don't know what it looks or sounds like, but playing through EiB made me feel as though I was in a real combat zone. Like RtH30, dirt flies onto your face as bullets pierce the ground, the screen edges blur as projectiles whiz by, and blood splatters across your screen when you get hit. The death animations of enemy soldiers are highly realistic; they collapse to the ground with unsettling realism as blood spurts from where they're dealt fatal blows. The movement animations are smooth and believable as well. Your soldiers crouch down, duck, and react in a way that mimics someone legitimately concerned for their life. The textures, however, are washed out and in some places ugly, especially when close up against tree trunks. From a distance though, the game looks gritty and realistic, and is sometimes blanketed in a distractingly attractive sunset. The gun models are clean and well detailed as well, and have a nice blurring effect when you switch to the iron sight view.   While the game features an orchestral soundtrack during some menu and loading screens, it's the in-game sound effects that really draw you into the experience. Bullets zip by your head, gunshots are crisp and clear, and after putting some time into the game you'll be able to unmistakably tell what weapons are being fired by squadmates and enemies based on sound alone. The voices, too, have an inherent urgency to them. However, it was disappointing to hear that many of the voice samples used during battle in RtH30 return in EiB. You'll still hear your squadmates screaming phrases like ~pouring it on~ and it won't be long before you start noticing how often phrases like ~we need a better position~ and ~we're out in the open here~ repeat. Granted, the phrases were designed as informational tools for the player, but why can't you squadmates scream a few variations of the same phrase once in a while? You're also able to go up to your squadmates in battle and talk to them, but they rarely have anything substantial to say.   The fact that your German foes scream in actual German instead of English with cheesy German accents definitely adds to EiB's atmosphere of believability. Also, like in RtH30, there's an extremely high degree of profanity here. Characters including your own will regularly mutter and scream foul language when they get shot or the situation looks grim, and the cut scenes are peppered with it. This game is by no means for kids.    Now on to a few more minor gripes. There is a problem with the pathing of your squadmates. Though the game claims your allies are intelligent and will take cover when being fired at, this is not always the case. When you issue a move command to an area of cover, some members of your team will stand outside the cover zone, and sometimes actually stand directly in front of it. This can result in a lot of unnecessary team deaths, and a lot of game reloading if you're trying to get through without losing a single man.   Also, when moving your troop along trenches, sometimes one of them will veer too far up onto the slope. When he gets shot at, instead of ducking back down into the ditch, he'll kneel down and start firing. Again, more unnecessary death.   Since you'll be targeting enemies by holding down the L button and manipulating the cursor with a joystick, you'll sometimes wind up mistakenly issuing more commands that send troops right into enemy fire. Occasionally your troops will refuse the order, but sometimes they'll actually follow it and get wiped out seconds later. This, however, is less a fault of the game and more due to the fact that an Xbox joystick cannot match a mouse's precision. To resolve this issue, it'd be great to see the targeting and move order system fused with the Situational Awareness View.Anyone who loved the original game will absolutely love this one. EiB is a very solid game with a unique play engine that that rewards patience and precise tactical planning. If you're not precise, you're severely punished. This game is difficult, very difficult, you'll spend most of your time reloading your game and trying again. It's really a title that needs to be mastered in order to be completed, unless you're playing on the easiest difficulty setting.If you were turned off by any aspect of the original game, there's no reason to pick up EiB. Whatever bothered you about the first game is almost certainly going to continue to annoy you. For anyone who's been curious about the series and has yet to pick either up, EiB is the title to go with because of its expanded multiplayer.Brothers in Arms: Earned in Blood improves on its predecessor with a larger variety of game modes and a more dynamic A.I., but doesn't deliver enough to warrant its release as a sequel. It'd be better if the Skirmish mode with the new A.I. was offered as downloadable content for RtH30 and a sequel was held off until more significant changes could be made.I realize RtH30 was given a much higher score than I'm giving EiB, but I didn't write the RtH30 review. I played through RtH30 when it was released, and despite the qualities that everyone was raving about when it came out like the realistic combat, unique gameplay elements, and engaging storyline, I found myself growing extremely bored with the title about halfway through. I just never thought the original was as good as everyone said it was, and if I had reviewed it, I wouldn't have given it a score above 9.0. I found RtH30 to be repetitive, and I find this game to be too. Even with the multiplayer, which I found to be much more entertaining than the story mode, and enemy A.I., it's still virtually the exact same gameplay, and with EiB, I grew bored again.", "date": "Oct 5, 2005"}