{"name": "Pokemon XD", "name_review": "Pokemon XD: Gale of Darkness", "ref": "https://www.ign.com/articles/2005/10/06/pokemon-xd-gale-of-darkness", "text": "Pokemon Colosseum's release last year was a major event because it was the first example of the Pokemon RPG design on a system outside of the Game Boy platform -- Pokemon console titles have always been strict spinoffs that purposely remained separate from the handheld adventures. But Pokemon Colosseum started bridging a path towards the successful RPG formula, offering that familiar ~Gotta Catch 'em All~ battle-based gameplay, all the while keeping a safe distance away so as not to step on the Game Boy versions' toes.   Pokemon XD: Gale of Darkness approaches the idea of a Pokemon sequel almost exactly the way developers do for the franchise on the handheld: build a ~new~ game using the existing parts created in the original design. Pokemon XD is so close in design to Pokemon Colosseum that it's hard to get excited for the idea of ~Pokemon on the Big Screen~ this time around. Sure, there's a new character in the lead with his own unique experience in the world of Pokemon. But the designers didn't do enough to distinguish the overall production from last year's game. It's still an involved, extensive quest; it's just a huge letdown for what's most likely the last Pokemon ~hurrah~ for GameCube owners.   Last year's Pokemon Colosseum essentially extended the Pokemon Stadium multiplayer design with a unique single player adventure that slid in some of the familiar gameplay mechanics of a traditional Pokemon RPG. The twist, though, was that players didn't actually catch the critters in the wild like they did on the Game Boy system. Instead, players had the unique ability to ~snag~ the Pokemon creatures away from the trainers during a fight, something that the portable adventures didn't offer. Only evil, ~Shadow~ Pokemon could be snagged, and only when they're purified outside of a fight would they behave like normal Pokemon.   This design has been moved over to Pokemon XD completely intact, with a different character at the helm of a brand new adventure. Like Colosseum, Pokemon XD starts out with an impressive introduction that sets the overall mood for the storyline that follows -- a dynamic scene of a ship at sea being hijacked by a mysterious Lugia creature. The adventure that follows isn't quite as energetic as the scenario that introduces it, but for those already familiar with the battle-based, exploration gameplay of a usual Pokemon adventure it fits the series. The same ~wander around, battle Pokemon vs. Pokemon~ gameplay is the core to the Pokemon XD, with the occasional crate-pushing, switch-flipping puzzle mechanics to spice-up the action.     But first, you have to withstand one of the most unbearably slow starts of an RPG ever experienced. The game drags for the first couple of hours as it tries to establish the lead character, his abilities, his place in the Pokemon universe, and the task at hand. The early part of the game is dreadfully dull, but it picks up as players finally learn the art of catching and cleansing Shadow Pokemon. For people who have already done this in Pokemon Colosseum, it's repeating things you've already done in , changed slightly for the newer character's solo adventure instead of always carrying a Shadow Pokemon psychic in tow as in last year's game.     So, even with a slow start, it does eventually pick up to a pace that's expected out of a standard turn-based RPG. But the problem is its dj vu design: other than a new story told from a new character's perspective, the gameplay is nearly identical to last year's game. Genius Sonority, the development team from Pokemon Colosseum, essentially took all of the assets, graphic and sound engines, and general game design, slapped a fresh coat of paint on them and constructed a whole new adventure. The developers recycle an enormous amount from Colosseum -- in fact, there are many locations in the quest that are ripped straight out of the previous adventure. This was clearly done to get a new Pokemon game out as quickly as possible, as the team didn't have to create a design from the ground up once the first game was out the door.   It would be unfair to say that the whole game is a repeat, because there have been some improvements. On the visual side, the game improves the detail of the graphic engine by providing a bit more shading, lighting and shadowing on the characters, creatures and environments, all the while retaining the same 30 frames per second animation players experienced in the last game. A few new abilities have been added to the gameplay, such as the opportunity to catch Pokemon not just in battle, but in the ~wild~ -- this element still doesn't come close to offering the freedom and excitement of the Game Boy design since these ~wild~ locations are specific locations instead of the extensive grassy areas of the portable maps, but at least players can build up their army outside of a battle.   Of course, much of the gameplay moves over to a multiplayer competition where players can battle their collected Pokemon from the adventure with versions of Pokemon on the Game Boy Advance using the connectivity cable. This was the main draw with Pokemon Colosseum, and it's been tweaked for this sequel. Is it enough to justify a new purchase if you've already bought and played through the first? Not really. And surprisingly, though players can certainly export and import their creature collection out of Pokemon XD into the Game Boy Advance titles, it seems that they can't move creatures from Pokemon Colosseum to Pokemon XD directly.     The true Pokemon series is still tops on the Game Boy platform, and it's clear that, with Pokemon XD and its comparatively restrictive gameplay, Nintendo's still keeping the magic of that series on the handheld systems. This GameCube sequel isn't all that much different to Pokemon Colosseum apart from a couple of minor tweaks and additions to the graphics and gameplay. If you're a Pokemon fan and a GameCube owner chances are this is already on your list regardless of the score attached to this review, so keep in mind that you won't get a whole lot new with the Colosseum follow-up. Pokemon XD has merit on its own for players who may not have experienced the first GameCube design, but as a sequel this one doesn't have nearly the same ~oomph~ as the original.", "date": "Oct 6, 2005"}