{"name": "Shanghai: Second Dynasty", "name_review": "Shanghai: Second Dynasty", "ref": "https://www.ign.com/articles/2000/01/08/shanghai-second-dynasty", "text": "Every couple of years or so Activision rolls out another version of their popular Shanghai series each time adding a few new tile sets, game types or tile layouts to give players a reason to go out and buy the game again. This holiday season proved no exception and as a huge Shanghai fan, I dutifully trudged out to the local game store to pick up the latest rev of the classic title, Shanghai: Second Dynasty. After a couple of weeks I realized that Activision might have gone too far this time. With its amazing variety of different games, brilliant graphics and sound and brilliant AI routines, Second Dynasty is so complete that it will be very hard for anyone to improve on.  For those of you who don't hang out in the puzzle game section of the game store, let me bring you up to speed with the basic idea. Shanghai is a solitaire puzzle game that uses the mah-jongg tiles. You start the game with one of several different tile arrangements that are laid out in varied shapes -- from the familiar original design to more fanciful setups like fish, rabbits, rats and snakes or geometric patterns like crosses, pyramids or even a yin-yang symbol. Each turn you must match tiles that are capable of sliding to either their left or right in order to get them off of the board. The end goal is to remove all of the tiles. While it may sound pretty easy, the fact that there are two pairs of each tile makes it possible to have tiles sitting on top of each other that you need to win the game. In order to succeed, you have to be very careful about which tile you take off when and if at all possible, you must try to remove both pairs at once (that way you don't have to worry about them any more).  While this basic version of the game is entertainment enough (it's kept me busy for years), Activison has gone overboard this time adding new variations of the game that will challenge even the most skillful masters. In addition to the standard game (which has options for over 140 different layouts), Second Dynasty also includes: Windstorm, a variation that randomly switches the direction that players remove the tiles from the board, Dragon's Eye, where one player tries to build up the arrangement while the other tries to remove all of its tiles, an Arcade mode in which players must try to complete different tile sets before a timer runs out, Dynasty, a five player game in which each player attempts to clear his layout before the others, and Pandemonium, another five player game that has all five player trying to get the most pairs on the same play board. There's also a Kids mode that features super easy layouts and big bright tiles sets along with a voice tutorial to help get younger players interested. Simply put, this is the most complete version of Shanghai and related games I've ever seen. There're plenty of options here to keep almost anyone busy for months to come and when you take the multiplayer options (In addition to a special two-player version of Shanghai, Dragon's Eye, Dynasty, and Pandemonium are all brilliant online competitions) and the game's excellent AIs into account, there may actually be years of play in this box.  But none of this is even taking into consideration that the company has also included four full versions of mah-jongg in the same box, along with amazingly talented AIs for each. Chinese, Western, Japanese and American rules for the classic game are all included and work exactly like I remember them (although I must admit, Japanese and American rules were new to me). The AIs range from very basic, where your opponents will simply try to collect their own trios and quartets to the very challenging, in which the computer competition will actively try to make sure that you can't get the tiles you need to go out. The more I played the game, the more I realized how intelligent these computer foes were. Even experienced players will find that the computer on its own is more than enough challenge to keep them busy for ages. Even so, Activision has included a full multiplayer mode that lets you take on your friends in any of the different modes, and even allows you to fill out any empty spots at the table with an AI.  While it seems like there's only so far that Activision can go with improving the graphics and sound of this game, they've still managed to make another serious step forward with high-resolution images of over 50 different tile sets and crisp sound effects. Better still, each one of these tile sets has its own special animations that show up when pair are matched up. Finally, the company has dropped in a load of excellent game win animations that really make you feel like you've accomplished something after pulling off all the tiles. On the audio side, there are countless little gongs and other sounds that go along with pair matches, along with a soundtrack that is timeless and never irritating. The most impressive part of the sound production to me was the addition of loads of different player voices that call out the different hands in mah-jongg, using regional words and accents appropriate to the variation being played. Although I'm no master of the game, my mah-jongg experience was so lifelike that it came pretty damn close to passing the Turing test.  I only had one really serious beef with this game and that was the fact that, despite offering up an extensive help section that explained the rules of the different variations in black and white text, Second Dynasty had no real tutorial for any of the mah-jongg variations. This is a pretty serious exclusion as this game could be a real step forward in teaching those who are unfamiliar with the game more about what makes it so enjoyable. As it is, those who haven't played mah-jongg before will probably have a lot of trouble trying to sort out how the game works without someone to show them the way.  So what's the final call? I think everyone who's into puzzle games should run out and get a copy of this title. Mah-jongg fans won't find a better simulation of the game available on the PC and Second Dynasty's multiplayer options are unmatched as well. Those who haven't played mah-jongg before will still find that the Shanghai variations are still more than enough reason to keep a copy of this game close to the computer. A well thought out and brilliantly executed re-release of the original classic.  -- Trent C. Ward This is an excellent version of Shanghai, preserving all of the charm of the original game while throwing in enough twists to make it stand on its own. For fans of the original who want to play on the go, and for players interested in an engrossing, always-challenging puzzle for the Lynx, Shanghai is recommended without any reservations.", "date": "Jan 8, 2000"}