{"name": "O.D.T. Escape... ...Or Die Trying", "name_review": "O.D.T.", "ref": "https://www.ign.com/articles/1998/12/09/odt", "text": "ODT, ODT, ODT. It seems that's all we've been hearing about in the past three months. It seems that Psygnosis has pounded us with post cards, fact sheets, press kits, and demos of the game every other day. Kudos goes to the marketing department for trying to build up a game that's not worth the effort.  ODT, or Escape Or Die Trying, is Psygnosis' newest third-person, action-platformer for both the PlayStation and PC, and in many ways it's an interesting concept that is beautifully executed in some ways, and miserably flawed in others.   Gamers take on the persona of one member of a crashed gas-powered craft (the Nautiflyus) that's plowed down on in alien territory. The five or so members of this craft are on a mission to bring the mysteriously powered Green Pearl to the land of Calli to save the state's people from a terrible epidemic. You must collect gas to re-power the ship, and you've been chosen to explore a dark castle-like structure to get the containers. That's the premise, followed by a several subsequent missions like it.   Your four selectable characters are an eclectic bunch. There's Corporal Ike Hawkins (who coincidentally looks like 3DO's Trip Hawkins), a rowdy strategist who may be on his last journey; Julie Chase, the smart, athletic (sound familiar?) cartographer who charts unknown lands better than the rest; the impulsive Maxx Havok, the Nauiflyus' chief engineer who looks like an English version of Harrison Ford; and then there is Solaar, the ~Archbishop,~ a magician of sorts may be able to wield the dark and light powers of the Dark Pearl. Each is equipped with a balanced set of characteristics, consisting of armor, spirit, weapon control, and experience, but Solaar is the standout of the crowd with a better likelihood of harnessing magical powers while lacking in weaponry.   ODT is set in a mythical, strangely futuristic 3D world that meshes both technological advances and odd, old-world throwbacks (the Nautiflyus being the prime example). Each character is polygonal and texture-mapped, packed with a set of attacks and moves, such as walking, running, climbing, and jumping.   The game is decidedly couched in science fiction-based themes, and commands a nice set of well-produced audio sound effects that provide a creepy mood and disturbing set of unpredictable environments. In many ways, the alien creatures are exceptionally creative (that wacky frog-thing), and the game, which is really a 3D platformer, appears to take on an RPG feel, with strange characters, puzzles, and environments leading in that direction.   ODT is fully analog compatible and supports dual shock vibration.Unfortunately, while the title exerts a great set of graphic prowess in its renders and in-game movies (in which the characters are extremely well motion-captured), the gameplay is decidedly passe (in which the characters are extremely poorly motion-captured). Overall, this game is really rough in the control department. In fact, it's shameful. Players will sadly wish for the ~precision~ of Tomb Raider III while fumbling through the crude controls of ODT. Actually, the game's set of controls is quite nice, as are the onscreen menus and general abilities of the characters. In other words, you are given lots of abilities. But once you get to grips with them, you'll discover that so many of the levels are badly designed that you'll be swearing and throwing down your controller in vain. (I never did that though, never...) It makes you realize why developers created God mode  and why people get dependent on it. Other than that, ODT is a first-generation PlayStation concept with a second-generation graphics engine, and a penchant for glitchy, see-through walls, standard lock-and-key puzzles, and very obvious gameplay. ODT doesn't really fit in a genre and it doesn't do anything better than say, Tomb Raider (not by a long shot), and it doesn't really come off as an RPG or platformer that well either. Another title of this kind of Eidos' Ninja, which should be telling you something.You really have to love bizarre characters and strange forbidden lands to get into this game, which does have its few good attributes (menus, sound, good characters, and eerie environments). But frankly, ODT should be avoided at all costs. At best it's more of a socking stuffer than even a C-list game, and that's being generous. Ho ho ho's not included.", "date": "Dec 9, 1998"}