{"name": "Doom 3: Resurrection of Evil", "name_review": "DOOM 3: Resurrection of Evil", "ref": "https://www.ign.com/articles/2005/10/11/doom-3-resurrection-of-evil", "text": "Usually, people don't go out purposefully seeking death. If they do, it's not death at the hands of Hell's freakish, ravenous minions. Taking those rules into account, it's safe to say that the nameless marine in Doom 3: Resurrection of Evil must be the most depressed, suicidal individual in the history of human society. After all, everyone in the world already knows that the dig site on Mars houses the gateway to Hell. We can forgive characters like Dr. Elizabeth McNeil who runs this particular Mars excavation operation because she's actually seeking something of value. The marine, on the other hand, isn't seeking anything. He's voluntarily journeying to the exact spot where Hell's fanged, plasma spitting demons are known to exist. It's really hard to root for a guy if he's already proven himself to be the dumbest in existence.   Being the lucky devil that you are, you'll get to control him. As in past Doom titles, you'll have no personal attachment to your character. You're stupid and you follow Dr. McNeil's orders. In the process you get big weapons and kill tons of demons. It's a Doom game, and very little has changed since Doom 3. That's not to say that nothing has changed. In RoE, you'll get access to a few new weapons, fight a few new enemies, and battle over Xbox Live on some new maps. Perhaps the best addition in RoE is the Classic Doom content. Right from the game's menu screen you'll be able to play Ultimate Doom, Doom II, or Doom's Master Levels version. In each, you have the option of single player, cooperative, or deathmatch for up to 4 players on a split screen. When the bonus content begins to consume more of your attention than the game itself, you know there might be a problem.   Resurrection of Evil is really short. Even taking into account the time spent reloading your game and a few egregious saving errors, you'll still beat the game in under eight hours. Afterwards, of course, you could try a higher difficulty level if you haven't already, but there's really no reason to go back.    The Artifact needs to lay off the caffeine.    Your short saga begins as you discover of a new item, the Artifact. This item can hold up to three charges which are absorbed by pointing it at dead bodies on the ground. When a charge is used, it enables what is known as Hell Time, which is basically slow motion. Since the Artifact doesn't constantly charge, you'll be restricted to using Hell Time only in areas where there are bodies lying around. Chances are, if you see a body it's probably going to be a good idea to use the Artifact. This makes the item feel more artificial than useful, and also tips you off to where the large combat areas are going to be when you see a bunch of bodies lying around.   Sentry bot, your only friend. The mechanic of enemies teleporting into a stage when you cross a certain point in a room or pick up a certain item really needs to stop. It's scary the first few times, you might jump once or twice after that, then you'll just start getting angry as you reload your game for the fifth time because you still can't tell where that barrage of rockets is coming from. Though maybe the excuse could be given that they spawn in to the Mars base because they're transporting in from Hell, why then are they still spawning in the Hell levels. Don't they live there?   In terms of new enemies, you won't really find anything all that new. Most of all you'll be fighting new, improved versions of already existing monsters. Most notable is the improved Imp that tosses blue fireballs and moves around faster. You'll be fighting these guys constantly, and the mechanic for taking them down is almost identical to regular imps.     Other new weapons include the grabber and the double-barreled shotgun. The Grabber, also known as the Ionized Plasma Levitator, is a cool idea to try and make the Doom universe more dynamic, but in RoE it's just not that useful. While you can pick up and toss environmental objects like barrels and crates, its way easier to just shoot an enemy. Though the Grabber can reflect fireballs back at enemies, this becomes useless with multiple enemies around since there will be too much going on to keep track of. The game seems to be extra finicky about getting in exactly the right position for you to catch a fireball or snag a Lost Soul. Often you'll wind up taking big damage just trying to get in the right spot to reflect a fireball when you could have just blasted the enemy in the face in a quarter of the time.   The best thing about RoE is the double-barreled shotgun. This thing blasts absolutely anything to tiny bits. I didn't stop using it the whole time, right up to the final boss. Even with an insanely slow reload speed, I still found it to be the best gun. Though Doom has a large arsenal, I just wound up using the shotgun for enemies on the ground and the chaingun for enemies in the air. Once I fell into this weapons rhythm, the only reason to switch to anything else was if I ran out of ammo.    Pretty demons.    Everyone knows what Doom 3 looked like at this point, and RoE is no different.  Some of the levels aren't quite as dark as Doom 3 was, specifically levels like the Phobos Reactor. There's also a noticeable amount of running around outside, which definitely brightens things up. The animation for the Artifact is decidedly disturbing as it convulses erratically when charged. Monster animations are smooth and in some cases frightening, though the game tends to stutter and slow down in spots where two or three monsters are chasing after you. The slowdown usually clears up pretty quickly.   The sound is definitely top notch with its atmospheric and ambient effects. From hellish whispers, clanking machinery, hissing steam, beeping computers, and your marine's coughs if you stand under a steam vent, you'll be treated to a decidedly creepy soundtrack. I didn't care for the chaingun sound effect, but the double barreled shotgun came made up for it as well as some creepy whispers for the Artifact. The voice acting needs some work, though, it's pretty cheesy.   Double barreled shotgun blast for the win. Like in Doom 3, there are various silly arcade consoles scattered around the Mars base. These include Hellanoid, Sarge's Big Game Hunter, and Martian Buddy Blasters, all of which are entertaining but suffer from imprecise joystick controls. These provide some momentary diversions from the main gameplay, and don't really change the fact that RoE is basically point, shoot, kill mixed in with a few instances of exploring to find the correct PDA security codes.   For multiplayer the game offers Deathmatch, Team Deathmatch, Last Man Standing, and Tournament modes for up to four players, which can keep you busy for a little while after making it through the single player. With such parameters, the maps aren't very large, and none of the multiplayer maps feature the Grabber or the Artifact, so you may find yourself growing tired of this rather quickly.  While Doom tries to expand its basic gameplay formula, it doesnt do it with any sort of effectiveness here. Resurrection of Evil is entertaining at first, but the gameplay manages to get stale even though the game is only an eight hour experience at most. The Grabber and Artifact turn out to be too cumbersome to function as more effective alternatives to guns, especially considering how awesome the double-barreled shotgun is. For anyone looking to mindlessly blast Hells minions with giant weapons, this is the place to do it. For anyone who demands something more in their gameplay, check out Far Cry Instincts. It still looks and sounds great, but after playing through some of the Classic Doom extras, youll find not enough has changed since then. Unless you're a huge Doom fan, you might want to save your 30 dollars.", "date": "Oct 11, 2005"}