{"name": "Cold War", "name_review": "Cold War", "ref": "https://www.ign.com/articles/2005/10/14/cold-war", "text": "It's surprising that more developers haven't tried to replicate the success of the Splinter Cell Series. The stealth action genre is wider on the PS2 with the likes of Metal Gear and Tenchu but Sam Fisher reigns supreme on Xbox and PC. The stealth action game Cold War seeks to fill this void with its own take on international espionage and some catchy game mechanics. For a ~competitively priced~ product Cold War has some attractive qualities but Ubisioft's super-spy won't be giving up his crown anytime soon.    The star of Cold War is a journalist by the name of Matthew Carter. Instead of indulging in a meal of cheese doodles and firing up an intense game of Root Beer Tapper like most of the journalist I know, Matt is set on breaking the story of a lifetime. After receiving a tip, he heads off to Moscow to witness a secret meeting between the President of the United States and the head of the KGB. Cue the double crossing, back stabbing, and intrigue and Matt finds himself framed for an assassination attempt on the president.    The mechanics of Cold War are strikingly similar to the Splinter Cell series. Approaching an interactive item like a door brings up an options menu in the top right corner of the screen. So if Matt walks up to a desk covered in goodies he might have the option to pick up a folder, a can, or hide under the object. The same system is in place for opening doors, crawling through vents, and any other action event. It's a proven method of accommodating a wide range of actions by pressing a single button. Outside of these context sensitive actions Carter can only run and crouch so there isn't a lot to worry about in terms of movement. When players bring out a ranged weapon the camera moves into an over-the-shoulder perspective for better aiming. This is functional, but it also causes Carter to move as though he's on an automatic walkway. This is a small detail but is still unsettling.      Carter isn't a super spy so he can't perform incredible acrobatic maneuvers. At first he relies on a standard punch to the back of the head to physically disarm his enemies. Later, he must find or forcibly obtain ranged weapons and gadgets. One of these items is an x-ray camera that also has the ability to disable security devices, knock out guards, and ignite flammables. The camera is a spark of originality amongst all too familiar features but it's not strong enough to be a major reason to buy the game.     The major original element present in this title is the gadget creation system. Carter has MacGyver-like abilities allowing him to construct all sorts of helpful machines. Either by searching an environment or a recently incapacitated enemy Matt will come across a range of materials. Seemingly useless objects like an alarm clock and a tin can are combined to make a slingshot which is a silent projectile weapon. The creation system is an interesting idea but it also has a rudimentary layout. Players simply pick up items and press a button on the menu screen to transform trash into gear.   There are also blueprints hidden throughout the game that reward Carter with tech points. Players then spend these points to gain access to new gadgets. This clever addition to the game may be its greatest asset and it makes me wish that this sort of item creation had been applied to a game that had more to offer overall.      Like Splinter Cell, Cold War employs a stealth system that relies heavily on light. A small box in the bottom corner of the screen shows what item Carter has equipped as well as a few stealth indicators. There is a blue stealth meter that displays the likelihood an enemy will pick you out of the shadows as well as an enemy alert meter. Russian agents also react to sound which Carter can exploit by snapping his fingers or throwing an object. If you've played stealth action games before this is all pretty standard but Cold War reveals its shortcomings in the details.    Major sources of tension in stealth action are those moments when an enemy is duped into walking right by his target. This requires a wide range of awareness from the enemy AI allowing players to engage is drawn out games of cat and mouse until they can turn the tables. This is an element sorely lacking from Cold War. The enemies are quick to notice Carter, draw their weapons, and kill him with one or two shots. Thankfully there's a quick save system, but this can also lead to mindless repetition in some sections.    Using the gadgets to avoid confrontation is cool in theory, but once a guard is alerted it can be difficult to make him give up pursuit. There are hiding places scattered about the level but they are accessed through the menu so it's not likely that players will happen to come across one in the heat of a chase. In the end Cold War boils down to shooting guards in the back of the head to ensure that they never have the opportunity to draw their weapon.     Sneaking around behind the iron curtain doesn't exactly inspire thoughts of a bright color palette but Cold War takes drab environments to extremes. Stealth games require dramatic lighting and high amounts of contrast. Instead we are given murky darkness and dimly lit corridors. The character models are run of the mill and the voice acting boarders on passable but what really hurts the game are the cut scenes. The story unfolds with a series of animated stills that failed to drawl me into the story or create any sense of tension.If my assessment of Cold War sounds harsh its mostly due to the games resemblance to a top tier franchise like Splinter Cell. This title can provide a certain amount of fun for very patient gamers but it often serves up equal amounts of frustration.", "date": "Oct 14, 2005"}