{"name": "NBA Live 06", "name_review": "NBA Live 06", "ref": "https://www.ign.com/articles/2005/10/18/nba-live-06-4", "text": "NBA Live 06 is a game that if translated well, could potentially play remarkable fluid on its handheld counterpart.  Despite a few exemptions, the transition is as seamless as the Piston's playoff D. If EA continues to successfully capture the mechanics and playability of their console titles on the little brother PSP, than the handheld sports game market looks much more appealing than after the initial wave of launch titles.  A few compromises have been made, mostly involving the control scheme, but this has become par for the coarse when developing for the PSP.  NBA Live 06 still retains the excitement of arcade-style hoops that it's more complete console brother.    As soon as you pop in the UMD you'll notice the presentation has changed a bit from the console version.  New menus and load screens welcome you into familiar NBA Live territory.  Within the game mode menu users get the added bonus of a PSP exclusive mini game which lets you replay some of the greatest moments in recent NBA history.  The Superstar Challenge is a four tier event, where you take control of different Superstar players and try to complete a predetermined scenario like overcoming a five point deficit with three minutes left in the fourth quarter.     Each event requires using a different player blessed with the superstar skill set, and also throws in a statistical side challenge like dishing out 15 assists with the Canadian wonder-boy, Steve Nash.  The Superstar Challenge is the best addition to the PSP Live experience, and is so much fun it should have been in the console version.  Apart from exhibition matches players can jump into either Season or Playoff game modes, but regretfully no Dynasty mode. Online users can participate in either head-to-head ad-hoc matchups, or the across-the-internet infrastructure mode. Good luck trying to find someone to play with, though.    Apparently Online gaming isn't very popular amongst the NBA Live crowd, as rarely are their more than five other players surfing the web looking for competition.  The All-star weekend festivities are available on the PSP version as well.  The slam dunk contest and three-point shootout mini games, plus the rookie challenge and All-star game provide a fun alternative to when grinding through an 82 game schedule.  As default, the camera view is set to sideline broadcast which feels a little different if you've only played Live with the typical baseline low console angle, but works well with the widescreen on the PSP.   Of course the camera can be switched and manipulated to fit your preference, so don't fret over the alteration to the usual NBA Live view of the court.   The compromises mentioned earlier lay mostly in the realms of control scheme, but other features implemented into the console edition of NBA Live 06 were left out of the PSP edition.  Two of the Superstar types, Sharpshooter and Stopper, are not left out entirely, but to compensate (albeit quite generously for certain players) all guys given the sharpshooter skill set are now scorers on the PSP.  So guys like Peja Stojakovic and Michael Redd now have the same arsenal of moves as Kobe or T-Mac.  With only one analog stick on the portable Sony system, crossovers and spin moves were assigned to the square button, which takes a little getting used to, but doesn't hinder the relative ease of beating someone off the dribble and attacking the rim.        Dunks and lay-ups are assigned to the same button (circle) so be prepared to see a few attempted lay-ups in situations where you would expect to throw down a tomahawk slam.  The game is intuitive enough to which you're trying to pull off for the most part, so it's not as big a headache as it seems at first read.  The lack of the defensive stoppers makes D-ing up much less exciting as is was previously being that essentially, all you can do on the defensive side of the ball is try to strip it away or block shots (apart from the Dpad assigned formations).   Rebounding will be more difficult when playing on PSP.  CPU controlled teammates consistently go for tip-ins or put back slams after bricks and completely miss the ball, forcing a scramble (typically won by the computer) as the rock hits the floor.  But apart from all this, the control of polygonal ballas remains very fluid.  Executing the superstar moves and working the pick-and-roll circa Utah '98, feels as smooth and effortless as ever, recreating one of the main strengths of the console NBA Live 06.     All things considered; NBA Live 06 is one of the most accessible and fun sports title released for PSP to date.  The transition from console to handheld left only a few compromises, none of which hurt the fluidity of gameplay.  You'll recognize most of the same animations and player models if you're familiar with the console version, and arcade-style basketball experience translates perfectly to the PSP.  The loss of Dynasty mode is countered by the PSP exclusive Superstar Challenge, but the multiplayer features are a little subdued.  Steve Kerr and Marv Albert provide entertaining in game analysis, despite a downsize in their library of comments and anecdotes.  Any fan of the console NBA Live franchise will certainly enjoy its slimmed-down portable counterpart.", "date": "Oct 18, 2005"}