{"name": "Jak X: Combat Racing", "name_review": "Jak X: Combat Racing", "ref": "https://www.ign.com/articles/2005/10/18/jak-x-combat-racing", "text": "Remember Crash Bandicoot? Naughty Dog created the little marsupial that would eventually become Sony's PlayStation poster boy. His first shirtless adventure was so successful it quickly spawned a second, Cortex Strikes Back. Later came Warped, the third and most highly acclaimed Crash. But after three Crashes, Naughty Dog lost interest and decided to take its furiously spinning freak into a new world of speedy danger. And so Crash Team Racing was born.  Now it's all happening again, only Crash is Jak. After three outstanding Jak action platformers, Naughty Dog is cramming its second mascot into an automobile of sorts. Begin Jak X.  It must be for extreme, that X. This sort of racing is all about the extreme, anyway. It's the kind that involves a totally random arsenal of missiles, mines, electrical zap balls and oil slicks. And if it weren't so extreme it'd probably not be popular.   So thrilling is the chaotic Kras City Grand Championship Combat Racing that it draws the eyes of millions of viewers and the attention of unsavory folk like Krew. He lured Jak and Daxter to Kras City from beyond the grave and then had them poisoned with a fine vintage. Now Jak has to win the Grand Championship and secure an antidote else he and his buds will meet an untimely end. That's the long and short of it. To think, if Krew hadn't died so prematurely he would have made an excellent motivational speaker. There's no better drive than the promise of imminent death upon failure!  Back Draft  The plot develops throughout the game's sizeable four-cup singleplayer adventure (with cups that include dozens of challenges of varying difficulty). Between many races players will be treated to wonderfully animated, expressive cutscenes that further advance the story. These are all superb, as has been the case from Jak's early days, and they do a great job of providing incentive. The storyline's slickly presented segments act as rewards for completing missions -- rewards that are better than the usual assortment of perfunctory unlockable content most games offer. But even that Jak has in spades.  In keeping with the series, Jak X features an uncanny amount of bonus content to unlock, as well as new cars, upgradeable components and performance modifications. Many of the extras add to the game, though some only aesthetically. But the addition of so much stuff to find and do and see builds off the already impressive storyline to at least establish Jak as a product worth playing through. Of course, there are still a great deal of modes to enjoy, so getting to the goods is never a chore. Circuit Race, Turbo Dash, Death Race, Time Trial, Deathmatch, Sport Hunt, Capture, Artifact Race, Assassin, Freeze Rally and Rush Hour are all here.   You'll play them all in the singleplayer game. And often the modes will highlight courses you've already enjoyed. Each track is impressive, visually, but a few suffer from being too plainly decorated, which creates an overwhelming sense of obstruction free tunnel racing. The later courses are far more challenging, but a greater amount of interactivity and life could have really benefited Jak's many swooping banks and wide straight-aways. Then again, the tracks are at least designed in such a way to play well across all applicable modes.  Each mode offers a distinct sort of gameplay, and most can be played in a multiplayer environment. Some of the modes are pretty self descriptive, but the vaguer ones might include Sport Hunt, which requires a player collect the most points by destroying targets (as other cars attempt to do the same). Then there's the Artifact Race, which drops a few randomly generated objects racers need to get to first. Freeze Rally requires gamers to hit time stopping power-ups and survive for as long as possible. Rush Hour is like Burnout's Traffic Attack. Death Race fills circuit tracks with hundreds of drones to shoot. And finally there's the Turbo Dash...      Turbo Dash actually highlights one of Jak X's more annoying problems. In this mode players pick up turbo power-ups, charge them by holding the turbo button, and then earn points for every one they let off. Basically, you need to cram the turbo button down all the damn time. An excess of magic is ordinary, and so having to boost constantly is mundane. The in-game HUD also isn't that identifiable in heated races, so just to be safe, go ahead and keep your right index finger on the boost at all times. We do. Braking and powersliding through turns works the same, so there's really no point in letting off the super gas.  The other problem with Jak X is that maintaining a lead means little. In fact, not many accomplishments in any typical race are of any relevance until the absolute end. It can all change in a tenth of a second. Literally. There'd be times when I'd be in the air approaching the finish line in first place and I'd suddenly explode from the rear, only to be passed by four people. This happens quite a lot. Like, a scary amount of a lot. Seriously, it's absurd. To know my fate is so helplessly bound to the careless allotment of overpowered weapons that I often have little to no chance of escaping without the combination of rear firing mines and a well armored machine is just infuriating. It means that regardless of how amazingly I performed for the last ten minutes, the next second will determine whether I win or lose. In that way the game too often rewards luck over talent.  Thankfully, the very unbalanced weapons that can adversely sway the results of circuit races on whims don't impact the other modes so greatly. In fact, the odd combination of more missiles vs. less mines helps lend the deathmatch and artifact grab game types a very frantic sense of pacing. This is ever more so apparent in two-player splitscreen and online, where these modes are further accentuated by incredibly smooth performance, high quality voice chat, and a very considerate amount of stat tracking that proves just how amazing you are vs. them. The impressive online mode even works in a functional buddy system, clan system, tiered lobbies, and more.  We got a chance to play a good bit of Jak X's online mode and we're happy to report that our trials have gone flawlessly, though real world experiences may obviously vary some. Please keep that in mind when you play.  Three Reasons to Play Jak X is a nicely presented, well-rounded combat racer. A healthy collection of on and offline modes and a very satisfying story build real value for the title, but the actual play can sometimes feel a bit lifeless and often suffers from spontaneous swings. Still, its unbalanced faults don't take too much away from what is an otherwise great game.", "date": "Oct 18, 2005"}