{"name": "Blitz: The League", "name_review": "Blitz: The League", "ref": "https://www.ign.com/articles/2005/10/19/blitz-the-league-2", "text": "Break bones, pump steroids, throw your helmet, moon the crowd, and celebrate by sending some hookers to your opponent's hotel room to make sure they are too tired to play the next game.   This is Blitz: The League, a game that strikes fear in the NFL and aims with every second to hit professional football below the belt.   Betting, end zone celebrations by a receiver named TO Mass, quarterback named MexicoI'm surprised the game wasn't delayed to include some kind of sex cruise with a character called Pepper Smoot.   But in the end, when you're finished laughing at the various jokes and cut scenes, what matters is the gameplay, and while Blitz: The League has its moments, especially during two-player contests, overall the title suffers from inferior AI and unbalanced gameplay to the point where if the computer takes the lead with 15 seconds left, you know that's 15 seconds too long. Time to break out the money plays and win with plenty of time to spare.   The Game  Treat or juice, that's the question. Do you send your player to the bench and lose him for the game or inject him with a substance neither of you really want to know about and throw him back in the lineup at any cost? Real lifeI'm sitting my player out. Blitz: The League? You're getting a needle in that polygonal ass, best believe it. And these are the types of decisions that you'd never see in a game like Madden. The types of things that a licensed game would never allow you to do. And I think the designers behind Blitz did an amazing job in the initial planning stages of the game. From the substances you can purchase for your players to ~juice~ their abilities to watching player profiles that include stars who just got out of jail, it's a clever concept, and probably one of the only ways that a non-licensed sports game will ever compete with the big boys (why isn't Jose Canseco Baseball already in development, anyway?).    The problem I have with Blitz is in the execution. This is old-school Blitz, 8-on-8, first and 30, late hits and all that, only with a new gameplay twist called Clash Mode. Clash Mode is supposed to replicate what it's like for a player to be in ~The Zone~, with everyone on the field moving in slow motion while you're moving at full speed. Again, cool concept, but when you learn how to time it, it really makes playing offense too easy, especially running the football. Call a toss left and use turbo to clear the tackle, then as you see the defensive backs run up in support, use clash to make your way up the sidelines before they can even lay a hand on you. And don't worry about your Clash meter being drained, because you're rewarded for making a big play with, you guessed it, more juice for your meter.   To top it off, the more moves/combos you pull off while in Clash, from taunts to even touchdowns, you're able to unlock special Unleash moves, moves that will have defenders spin kicking quarterbacks, literally trying to break an opponent's neck, or pulling off amazing, unbeatable one-handed catches to score the game-winner. These moves are stunning, even breathtaking, especially when your star player is hit, then a CSI-like x-ray pops up, showing his bone snapping in two. The problem is, once you figure out your money plays, it doesn't even matter who is in the game. It's not like you know who the hell any of these guys is anyway, because without the license, you have no emotional tie to any teams or stars. Your halfback breaks his leg, sure his backup might be slower, but using  the slow motion Clash works just as well to pickup big yards.     And even if you keep running the same plays over and over, the AI doesn't adjust the way it should to defend it. Streak patterns down the sidelines almost always work, and if/when the AI finally decides to double team the receiver, it leaves that side of the field wide open for your QB to take off and run. Any short yardage you need, go back to your toss and you've got it made.   When you look at the replays and start to breakdown the game, you'll really see the flaws on defense as players take terrible angles to try and make tackles, defensive backs will be in position to knock down a pass and don't even try to make plays on the ball, sometimes you'll see linebackers who won't even get out of their stance as a play transpires around them, and there are even punts at the end of games that the computer won't bother to pickup with the clock running down, even though they need all that time on offense. There are also an inordinate amount of missed extra points and field goals by computer controlled teams, not to mention the catch-up AI (including fumbles and interceptions out of nowhere) where it's commonplace to see four to five scores back and forth in the final minute of the game. To top things off, there are some strange play clock issues to deal with. When calling a play, your play clock will be ticking down. You can actually let it get down to 1, call a play, then when you go to walk up to the line, you're given more time on the play clock to snap the ball. Very strange.   Campaign Mode  Midway hired one of the writers from the acclaimed ~Playmakers~ to pen the script for the game's story, a tale of a disgruntled owner who basically cleans house to start his team over (new GM, new coach, new roster) while at the same time striking a deal with the mayor in a plot to exploit fans and taxpayers alike for millions of dollars in a bond issue for a new stadium. Throughout your campaign, there are a series of movies updating the plot, but I expected more, not only in terms of the number of scenes, but in terms of interactivity in the story. Sure, you can decide whether or not to spend money on hookers for your opponents when the situation arises, but there should be scenarios like that between every game, and for the most part, you're expecting a new scene and all you get is forwarded on to the next matchup. This might be the building of something bigger, though, with next-gen. Imagine an interactive world where you can actually walk around with your players and go to the club, get in fights, flirt with cheerleaders on your own. That might be the future, but right now what you're stuck with are short cut scenes, and while some are humorous, I was really expecting more.     On the plus side, there is a great deal of customization involved in your team including everything from team name to city (everywhere from Albuquerque to Wichita) to the colors and logo. There are 82 helmet color combos, 72 jerseys, 18 different pants to choose from, even 46 styles of socks. You can select from three different stadiums to play in, three different head coaches (from the old school Bill Parcells type to a young Jim Mora Jr. type), and depending on the assistant coaches you hire, you will actually receive attribute bumps to certain players that fall under their expertise, like giving you an improved quarterback and faster wide receivers. Best of all, you can choose a team doctor, including an aggressive type who ~lives for experimental medicine~ to someone who is more into increasing your players through actual training.   Moving on, you're able to draft one young superstar to help build your team around and can select from a quarterback, halfback, or receiver, then you can sign a veteran to anchor your defense. Here, your options are a linebacker, defensive end, or safety.      Before every game you're given the ability to wager money on your team (including point spread), and before you suit up for your first start, you're given $100,000 to spend on items like gloves, shoes, helmets, shoulder pads, and sleeves that will give your team boosts in certain aspects like hands, speed, agility, and breaking tackles. You can also buy ~performance enhancers~ like Flax Seed Oil, TGP, Andersol, Droxilyn, Triophene, Suluston, something called the ~Mystery Pill~ and even a Pissinator to mask the results. Just make sure your star running back doesn't try to bring his Pissinator through the airport. Nothing says concealed weapon like a prosthetic penis.    The league is setup almost like it is in soccer with three tiers of teams. The campaign starts with your squad being dropped to the third tier after a big loss, and it's your goal to win the championship of tier one by season's end. You're just kind of thrown into tier three without really knowing how the system works, and you don't even know your schedule of games, all you really know is how many more wins you need to advance to the next tier.    When you've built your team to your liking, you can take your custom team online and play head-to-head against opponents who have mouths as foul as their players. Online play is smooth and playing two-players really helps hide a lot of the AI issues as it's up to you to switch players on defense rather than watching the computer fail to make plays.   Graphics and Sound  Blitz looks amazing, really giving you that ~Any Given Sunday~, camera close-to-the-field, cinematic feel. The hits are brutal, the blood splatters, bones crack, and you can almost feel those devastating hits thanks to the detailed animations. There are some hiccups though, like a player who has his helmet ripped off one second, then a cut scene showing him with his helmet on, or a touchdown by #81 and a TD celebration showing #45.   One thing done right, however, is the audio. Fans chanting ~Outlaws suck!~ in the background, grunts and groans on the field, actually hearing your leg snap in two. No football game delivers this much impact to your ears. L.T. even did his own voice over to make sure all the cursing has a more authentic feel.Blitz: The League is a game perfect for people who like shiny boxes without really caring what's inside. The game uses profanity, cheerleaders shaking their ass, and broken bones to distract you from the lackluster AI playing out before your eyes... and it almost works. The thing is, the more you play Blitz, the more the flaws overtake your senses, and the jokes just aren't that funny anymore. Definitely worth a rent to check out, but in the end, your money is better spent just buying Playmakers on DVD.", "date": "Oct 19, 2005"}