{"name": "Tony Hawk's American Wasteland", "name_review": "Tony Hawk's American Wasteland", "ref": "https://www.ign.com/articles/2005/10/19/tony-hawks-american-wasteland-4", "text": "With what is essentially the third ~reinvention~ of the series, Pro Skater being the first and Underground being second, Tony Hawk's American Wasteland sees the series shy away from the unfettered destruction focus of the last two games and head back to its pure skateboarding roots. In fact, the game's story mode is based around old-school skaters, building a skatepark from the ground up and basically earning everything from scratch.   Though every other game in the series has allowed you to take a created character into the main story mode, American Wasteland starts you with a selection of one of five characters, and takes you into LA to begin a hopefully progressive skating career. After meeting Mindy, who basically becomes your tutor and guide of sorts for the rest of the game, the first two tasks that you're required to do are to get a new haircut and pick out some new clothes. You can also wander into the local skateshop to pick out a new deck, but you'll need to wait until you're a bit further in the game to come across accessory stores (for sunglasses, backpacks and such) or tattoo parlors.    While you can essentially outfit your character anyway you want over time, being as you're forced to pick from one of five character choices at the start of the game and then modify them as the game goes on, you're not given the same amount of control over your character's look as you've had in the past. The Tony Hawk series has always had a really good character creator so it's somewhat disappointing that you can't take advantage of it for the Story mode. You can use your fully original characters in the Free Skate and Classic modes of course, just not in the Story mode.   At any rate, the main drive behind the game is your relationship with a group of local LA skaters, its leader, who happens to be a skating legend, and their running ground called Skate Ranch. Much of the game's goals revolve around either directly helping this group of characters in some way or earning pieces for Skate Ranch.   When you first arrive at the ranch, it looks something like a rundown skatepark built on a landfill. A fair bit of the game's main story goals revolve around collecting various objects, big and small, from the sections of LA in order to outfit Skate Ranch proper. You'll collect things like dinosaur heads, broken sections of the street, pieces of hangers and so forth. It's kind of a cool progression in that if you continuously visit it throughout the game, you'll essentially be able to skate on the progress you've made.    The end result of Skate Ranch is that it turns into somewhat of a littered skatepark, but one with a whole slew of different ramps, rails to hit and so on and so forth. If you take your sweet time in returning to the ranch after you've collected a bunch of stuff, the place may seem rather foreign and may actually be reasonably hard to navigate as you won't really know how it's laid out anymore. Skate Ranch is a cool addition to the series, and something of an idea that might be cool in future titles, especially if you could place the collected pieces where you want, like in the Park Editor.   As a whole, the story, attitude and overall focus of the game is much better this time around than what we've seen from the two THUG games. The series' return to the purer elements of skateboarding is a welcome one, and being as there are very few missions that don't require a skateboard, this is what we like to see.    Streaming, but no GTA  One of the major features that American Wasteland has been pimped as having is a streaming environment where it's possible to skate from one side of LA to the other without stopping, and even pulling off one major combo if you're good enough.   While this is a true statement, it's not exactly what it sounds like. Los Angeles is broken into smaller areas, or levels if you will, that individual goals are set in. These areas are connected via loading tunnels, which do indeed include things to trick off of, but aren't full environments. For example, the tunnel that connects Beverly Hills to Skate Ranch is modeled like something of a large sewer system or aqueduct, filled with pipes, wires and so forth to grind as you make your way to the ranch.    On the one hand, it's cool that you're never really presented with a load screen once you're in the game, but on the other hand, it's not exactly what everyone originally thought it would be. It does help with the goal system however, as you can easily tell which level something needs to be completed in rather than having to figure out which city block you need to focus on.   Even though the areas are essentially broken up as levels, you don't work through them in a linear fashion like the previous games. New areas connect to past ones, and goals will continue to pop up in every section of the game. If you need to skip a large area of the city to get to your next goal, you can just hop on a bus and then pick from any bus-accessible area. You won't be able to travel directly to Skate Ranch for instance, as that isn't on the bus route, but you'll be able to stop off at Beverly Hills and then wonder over quite quickly.   The individual areas in the game are designed in classic Tony Hawk fashion in that they're representative of the feel of an area of LA and contain various landmarks and such, with all of this squished into a Tony Hawk-sized level. A couple of the levels in the singleplayer portion of the game will look familiar, including Santa Monica, which somewhat resembles the Santa Cruz level from THUG 2 Remix on the PSP, only it's a similar section of a different city. That sounds funny, but once you see how its rails line the beach, features a large pier and various storefronts off the beach, you'll see what we mean.    Speaking of classic levels, the game's Classic mode resides in entirely different areas than the Story mode, most all of which are refitted levels from past Tony Hawk games. The oldest levels, like The Mall from the original THPS, have been reworked to feature things like reflections, higher-resolution textures and the like. They're still rather bare-bones when compared to newer levels, but we wouldn't want it any other way.   The original Story mode levels are all jam-packed with lines to hit, though they're actually less automatic than the previous handful of Tony Hawk games. Personally, I've always like the level layout of the first two games the most because you had to become inventive with your lines, whereas by the time THPS3 and especially THPS4 and the two THUG games came out, lines seem to be drawn out for you, saying ~Grind here, then here, then here.~ There's still plenty of that here, but it's not as prevalent as it was in the last three or four games, a trend that I hope Neversoft continues to stick with.    Ease Into It  The Tony Hawk series has a reasonably deep control system, with much of it contextual in many different ways. As such, Neversoft decided it would be wise to essentially start the player from the beginning with what breaks down to the basic move set from the original Tony Hawk's Pro Skater. You'll quickly learn how to perform manuals, reverts, transfers and so forth, and it's worked into the story reasonably well. The section where you learn about Specials and Focus may not be the most realistic part of the game, but it's funny as hell.   While the ~from scratch~ design will indeed help newcomers yet barely incapacitate veterans, the game's difficulty has also been turned down a notch. Granted, I've personally beaten every game in the series, and some of them so many times the number wouldn't fit on this page, so I realize I'm pretty decent at the game, but most every goal in the game is very much on the easy side. There are only a few goals late in the game that remind of some of the middle-level goals from THPS4, which got to be a nice challenge towards the end. You can of course select the Sick difficulty level to turn things up a notch, but we'd have liked to have seen the Easy difficulty receive the challenges we got from Normal, and the Normal difficulty get something a little more challenging.   BMX  While American Wasteland is still a very skateboard-centric title, Neversoft has thrown the ability to ride BMX bikes into the mix. You only need to hop on a bike for a very short bit of the game, and what goals you have to complete are rather simple, and even though riding the bike is fun, it's nice that Neversoft didn't shove this down our collective throats.    The BMX stuff does work very well, though it's a tad jerky. You have some simple tricks assigned to the face buttons with most of the larger, bike-swinging or handlebar-rotating tricks assigned to the right analog stick. This setup works really well and transfers a bit of the feeling of riding a real BMX bike into the controller.   As mentioned though, the bike is a little bit jerky to ride. If you played either of the Mat Hoffman titles back in the day, you'll know what I mean. It's not much of a problem and is really just a side effect due to the amount of control you have over the bike's movement, but it's worth mentioning. As a whole, the BMX aspect of the game may be minor, but it's quite fun.   Everlasting  American Wasteland's Create-a-Modes are essentially the same as they've ever been in the series, which is to say they're very good, though there's not much new about them. Still, replayability is definitely extended due to the game's Create-a-Park, Create-a-Trick and so forth options. The PlayStation 2 version of the game now also includes EyeToy support for its Create-a-Skater editor, which means you no longer have to upload images just in order to download them.   The Tony Hawk series has always had some good split-screen competition modes, such as HORSE, but this year things get co-operative. The Classic mode allows two players to hop on their boards and work together for a common goal. For instance, both players can work together to collect SKATE, or one could go after nabbing COMBO while the other focuses only on nabbing the various high-score goals. You can even load up a saved singleplayer game of Classic mode and have a friend hop in, then save and come back solo later on. Co-op works really well and is a fantastic addition to the series. And of course, the game features the same great online play it has since THPS3. It hasn't really improved much since the last outing, but it's still a great online experience.Tony Hawk's American Wasteland is a nice return to the series' purer skateboarding strengths. It's still essentially more of the same, but it's also dropped some of the zanier aspects that had taken the title away from its roots. I'd say it's the best Tony Hawk game since THPS4, and I'd recommend it to anyone who's either a fan of the series, past or present, or who hasn't tried out a Tony Hawk title in some time as it's great fun.", "date": "Oct 19, 2005"}