{"name": "Black Bass with Blue Marlin", "name_review": "Black Bass w/ Blue Marlin", "ref": "https://www.ign.com/articles/2000/01/11/black-bass-w-blue-marlin", "text": "Forget about 3D fighting, racing, RPG's, or sports for that matter, the hottest genre on the PlayStation is fishing. While that statement has very little to no truth to it, the sheer number of bass fishing games on the system would make one think otherwise. For whatever reason, the PlayStation seems to be a haven for fishing games based on the fine art of catching bass. Hot-B has decided to jump on bass fishing bandwagon with its Black Bass with Blue Marlin. However, as the title suggests, not only do players get the pleasure of trying to land a big bass, he or she gets to partake in some spine-tingling attempts at hooking and reeling in some marlin.   Gameplay Black Bass with Blue Marlin is one of the most decked out fishing games available for any gaming console. There are varied locales that include lakes for bass fishing and exotic areas for where the marlin roam. Additionally, with the substantial number of lures, single player and multiplayer gameplay modes, there's loads of play value.   Control-wise, the game plays well with either the dual shock controller or the standard digital pad. The player is given control of the type of cast, direction of the rod, line tension, and so on. Furthermore, the game offers several camera views that drastically change the feel of the game.   For those looking for more of an arcade experience, there's an underwater view that let's the player check out the fish and all the action under the water. And for those looking for more of a simulation of the true fishing experience, the game can be played from a view from above the water.   The one thing that really hampers the game (aside from it being a fishing game), is that it doesn't appear to support any of the fishing controllers. There's no mention of it working with any particular fishing controller in the game's manual and it didn't work on Agetec's wonderful reel. The fishing reel does wonders in increasing the enjoyment of a fishing game, therefore the lack of support for them really hurts the appeal of this particular game.   Graphics This is one of the best looking fishing games on the system. Then again, it doesn't do anything that will make anyone say ~wow~. There are various lush fully 3D polygonal environments and the water textures are pretty nice, but again, nothing great.   Sound Black Bass with Blue Marlin offers some authentic sounding engine noises, reel sounds and ambient sound effects. Plus, there's occasional voice from fishing legend, Hank Parker. Overall, much like the graphics, nothing out of this world, but sets a good general mood for a fishing environment.  Black Bass with Blue Marlin marks my fourth fishing game review just in the past three months. While I've found moments of enjoyment while playing a few of the games, I'm still bewildered at how many of these games have been releases. This is probably one of the deepest of fishing games on the system because the bass and marlin fishing experiences are completely different and offer different techniques and challenges, but the overall experience is greatly hampered by the lack of support for a fishing controller. If you're a fishing fan and have no interest in getting a controller, go ahead and pick this up, though. Better yet, go out and catch some real fish.", "date": "Jan 11, 2000"}