{"name": "Wayne Gretzky NHL 06", "name_review": "Gretzky NHL 06", "ref": "https://www.ign.com/articles/2005/10/21/gretzky-nhl-06", "text": "Gretzky NHL 06 has already made its way to the PlayStation 2 for gamers who want to get their game on at home, but for hockey on the go, SCEA and Page 44 Studios has taken the Gretzky series on the road for the PSP in Gretzky NHL 06, the franchise's second outing on Sony's portable.   The PlayStation 2 version of Gretzky NHL 06 is a bit of a mixed bag. Its gameplay is problematic for multiple reasons, one of which is that it simply doesn't feel like hockey, but the game does have a nice set of game modes, like the new Wayne vs. Wayne game type where teams can call out the Great One as the sixth member of their team for a short bit, as well as a pretty decent franchise mode.    The PSP version of Gretzky NHL 06 is better in some areas than its console brother, but it's also lacking in others. For one thing, the PSP version doesn't have any sort of franchise mode option. You're able to play a full season of hockey, but you're unable to try and create a dynasty over a sequence of years. You also don't have the ability to create players, so if you like to stick yourself in every sports game you play, you're out of luck here. You also then aren't able to add in real rookies or prospects on your own.   It does however include WiFi play via both Ad-Hoc and Infrastructure mode, which is a nice bonus. WiFi play feels slightly lagged and not as tight as the game normally plays, which is a little disappointing. We also had problems finding people to play online and hopping into a game. At one point we had two systems in the online lobby, but neither could find each other. The WiFi play options are also very limited, allowing you to only play a standard game of hockey rather than Gretzky's cool Wayne vs. Wayne or 3 on 3 modes, sadly.   While the gametype options aren't nearly as replete as the console version, Gretzky NHL 06 on the PSP plays a fair bit better overall than the home version. Player movement isn't perfect, but it also doesn't feel like you're running on pavement like the console version does. Players don't have quite the natural arcing directional-change as they should, where they instead tend to stop and change directions more often than they should.    The AI is a little more natural as well. There's still a bit of the pinball passing, where the puck becomes impossible to follow as the computer passes it between itself in an incredibly quick and unnatural way, but it's not nearly as prevalent. It's still disappointing that it happens at all, however.   Graphically, the game is fairly decent looking for a PSP title. There are a lot of ice effects that look to be faked by placing them directly on the ice's texture rather than dynamically moving a decal or overlay, like the overhead light reflections, but it works. Player detail is pretty good for the PSP, though they're not showpieces by any means. Shadows are simple circles underneath the players, but again, it works well as you generally see them from way up high overhead.Gretzky NHL 06 for the PSP is a decent version of a mixed console game. While it lacks common features like player creation or a franchise mode, it also has better (or less cheap, at least) AI than the console version. WiFi play (online even) is nice, but it isn't perfect by any means. If you're a fan of hockey, this is the only option you have on the PSP this year anyway, and it'll do you well for quick one-off games. Just don't expect a whole lot of depth or customizability.", "date": "Oct 21, 2005"}