{"name": "FEAR", "name_review": "F.E.A.R. Review [by Voodoo Extreme]", "ref": "https://www.ign.com/articles/2005/10/22/fear-review-3", "text": "Monolith is a developer that many action fans are familiar with after playing the likes of Aliens vs Predator 2, Blood, Shogo, No One Lives Forever and TRON 2.0. They're also synonymous with the LithTech Engine, an ill-fated technology that even today may make the most hardened gamer grimace. LithTech may be dead, but they have a new game engine and it's one to really F.E.A.R.    Visually, F.E.A.R. is the best looking first person shooter currently on the market. Sure, Quake IV looks great as well, but F.E.A.R. uses its game engine better, integrating gameplay into the graphics. See a gas leak? Shoot it! A satisfying jet of flames springs forth melting people in its path. Killer graphics help drive the gameplay.   (Click to Enlarge!)      Audio is also good, although I think they went a little overboard dropping the F-bomb every other sentence in the script. I'm not a prude when it comes to using four letter words myself, but when they're repeated to the point where it hurts the immersion factor, it's too much. Swearing doesn't make the story more edgy.   F.E.A.R. (First Encounter Assault Recon) is about an elite team of special forces who handle especially delicate disasters of the supernatural nature. Mixing inspirations from games such as Half-Life, Max Payne and Deus Ex, Monolith also blended in elements of popular movies like ~The Ring~ and ~The Matrix~ to craft the game's story. Presentation is splendid, and the plot builds until the very end, climaxing like a massive explosion.  Combat really kicks ass, not only because of the Max Payne inspired slow-motion, the cool guns or the over the top particle effects, but because Monolith added melee combat. Interesting? Yes. Better than using guns? Not really. The weapons have a satisfying feel to them and body parts go a-flying when enough damage is delivered. The only weapon I truly didn't like was the sniper rifle, only because it was automatic fire and the scope was awfully primitive.     The advanced artificial intelligence the enemy demonstrate will remind you a lot of Half-Life. Baddies will actively seek cover, try to flank, support each other and generally act very clever while fighting. Sure, there are a lot of scripted events, but they also display very solid live reactions. I was surprised the game didn't come with some sort of multiplayer practice mode with bots since the AI was so good; maybe Monolith can add it later?   F.E.A.R. does come with eight multiplayer types, but the slo-mo - which half of them have -- makes it odd to say the least. I doubt the multiplayer will ever threaten to topple Counter-Strike or Battlefield's popularity, but it's there if you want it to check it out. There are usually several hundred people online playing if you check Gamespy.   Level design in F.E.A.R. is solid, but lacks variety. If I was to voice one major concern it would be that the levels are too open ended and I spent more time getting lost and backtracking than constructively moving forward. This isn't necessarily a bad thing however, as it beats cranking out linear levels that require no imagination or strategy to finish. It's just a matter of taste and having a good sense of direction. The odd parking structure or city block is a welcome change of pace from the oppressive warehouse, office building and underground complex motif.  F.E.A.R. has awesome graphics, second-to-none AI and a compelling story. While it may borrow a lot of influences from other games and movies, the end result is a unique and outstanding first person shooter. If you have an older PC I'd first check out the demo to see how it runs before getting the full game; for people with newer more powerful systems, it's go-time. Whenever a developer goes out on a limb to create a new IP (intellectual property) they should be commended, and even rewarded. Even the best intended sequels often lead to stagnation, so it's great to see a new game of this caliber released.    9/10 - Awesome - Editor's Choice  The good - Killer graphics, A.I., presentation and spooky story  The bad - Need a top of the line system to really enjoy it   Other reviews: Serious Sam 2    Comments  Return to Voodoo Extreme", "date": "Oct 22, 2005"}