{"name": "Elder Scrolls: Redguard", "name_review": "Redguard", "ref": "https://www.ign.com/articles/1998/12/11/redguard", "text": "Redguard is the latest installment in Bethesda's Elder Scrolls universe, a world that has been carefully fleshed out by such previous roleplaying games as Arena and Daggerfall. It is a rich fantasy world of swords and sorcery, magic and monsters--and while it really isn't all that different from any of a dozen other such fantasy game worlds (Ultima, Norrath, Greyhawk, Forgotten Realms, etc.), the sense of history and geography is fairly well developed, providing a solid backdrop for traditional fantasy fare.  But Redguard is not a roleplaying game; instead Bethesda has taken a different tact this time, creating a fresh mix of action and adventure. When you say a game is an 'action/adventure' title nowadays, the first thing that comes to mind is Tomb Raider. While Redguard does have some Tomb Raider style elements--the game plays out in a third person perspective, and many (probably too many) of the puzzles require some good old fashioned jumping--the game goes well beyond the skeletal story of a Tomb Raider, and instead provides a bona fide plot line (go save your sister) and some genuinely developed characters and villains.  In fact, a better comparison for Redguard is to one of the traditional adventure games of the pre-Myst era--to succeed in Redguard, you must talk to NPCs, find out about quests, collect items, solve puzzles, and travel around the island. What makes Redguard different from such adventures is its 3D engine and environment, which make the world far more believable and immersive than clicking through a series of 2D screens.  And because Bethesda decided to confine the action in Redguard solely to one small island, it was able to create an entire, believable stretch of territory that is self-contained. Definitely the right choice for a game that depends so much on adventure elements, yet lets the character roam freely throughout a 3D world. Exploration is one of the high points of this game.  The use of 3D acceleration really brings out the island and makes it feel real, which is all-important in a story-driven game, and some of the environments are truly visionary, such as the working orrery. However, the game is limited to 3Dfx support, limiting those with other cards to software rendering.  That leads us into Redguard's biggest problem, its technology. It uses an updated version of Bethesda's Xngine, the same DOS-based technology that has seen service in Daggerfall and Skynet--a decent engine for its day but one clearly surpassed by today's code, stuff like LithTech, Quake, or Unreal.  This DOS-based nature of Redguard can cause any number of problems for Windows users, such as random lock ups, mouse freezing, and keyboard snarls. But the most persistent problem I experienced was with the audio--all of the voices in the game sounded muddled and incoherent, as if they were talking over a cheap walkie-talkie. This problem was exacerbated by some of the stylized voice acting used by many of the characters--if it's hard enough understanding someone in this game if they're talking in plain English, so it's twice as hard when someone is affecting an Elven accent and peculiar speech mannerisms. Speech interaction is essential to playing the game, so this problem is a serious one.  Furthermore, the controls are sloppy, especially in the jumping puzzles, which is unforgivable, especially when some of the jumping puzzles are of the unduly harsh do-this-right-or-die-instantly variety. And the character, even when running, moves extremely slowly, makes searching for some NPC in what is really a large 3D town needlessly time-consuming.  Combat is hardly awe-inspiring either, and it is pretty much limited to hand-to-hand fights because of the game's fantasy swashbuckler setting. While hand-to-hand more or less worked in Daggerfall because of its first-person perspective, the sluggishness and unresponsiveness of Redguard and its third person point of view makes combat a bore. You can move forward, execute a few sword swings with variations of the attack or guard buttons, but suffice it to say that is no Die by the Sword.  But for gamers who love a good story in a fantasy world, and can look past technical deficiencies and a lackluster action mode, Redguard should be a fulfilling gaming experience, and many of the design decisions--such as limiting the environment to one island, emphasizing NPC interaction--are good ones.  It will be interesting to see how Redguard stacks up to the other 3D polygonal action/adventures that also emphasize story over action--games like Quest for Glory V, the new King's Quest, and Ultima Ascension.  --Jason Bates", "date": "Dec 11, 1998"}