{"name": "Call of Duty 2", "name_review": "Call of Duty 2", "ref": "https://www.ign.com/articles/2005/10/25/call-of-duty-2-4", "text": "Being the little brother of one of the most highly acclaimed shooters of 2003 is not necessarily an enviable position. While it means a certain degree of easy sales, you have a lot to live up to. However, Activision and company were careful not to crank the Hype-O-Meter up too high, choosing instead to talk about the game in small doses; an interview here, a batch of screenshots there. When I got the 6-CD package amid a flurry of other shooters coming out in the same time frame, my initial reaction was mild. Then I began the install, the music swelled, and all those fuzzily warm memories of ricocheting bullets and constant explosions came back like long-lost friends. Call of Duty, it's been a while. We're glad to have you back.    Like its older sibling, CoD 2 covers World War II across three interwoven campaigns featuring the Russians, the British, and the Americans. However, now you can skip ahead from one faction to another, once you've played through a batch of missions. I personally wasn't champing at the bit to play one or the other, but I guess it's nice to have the functionality there. The game also auto-detects 16:9 and 16:10 widescreen ratios, as well as the funky 5:4 ratio for LCD monitors (like 1280x1024). You'll have a solid selection of performance tweaking options, or you can let the game set what it thinks will be optimal settings. With a 6800GT, 3.0GHz P4 and 1GB of RAM, the game plays quite smoothly at 1280x1024, with anisotropic filtering (to make textures look nicer) and 4xAA (to reduce jagged edges).  There were slowdowns when it rained and when there was a lot of smoke on screen, but it was otherwise quite playable with the latest official nVidia drivers. Speaking of those guys, there's also an ~Optimize for SLI~ toggle, but I don't have the luxury of two hot boards, so let's move on.    Many of you who grabbed the single-player demo noted that the game didn't run all that great. All I can tell you is that the retail version appears to have been optimized. Textures look great, and there's lots of shiny stuff going on. Normal mapping is fairly subtle, except for a few elderly character models who look like they're bathed in a sheen of sweat. It's not quite on par with FEAR, but I think even the hardcore shooter fan will find little to complain about. Most importantly: I saw little sign of cutting corners for multi-platform development (as the game is also coming out on the 360). I'm pleased to report that everything looks quite sharp.    And CoD 2 is about the grisliest game I've seen get the ESRB T rating. There's no blood and guts splashing all over the place, but you will have dying soldiers attempting to drag themselves to safety, only to be bludgeoned to death by a nearby enemy. And they'll scream bloody murder when they die. On the other hand, the only blood you'll see is when you shoot someone, and the profanity stays firmly in PG-13 territory. And there's none of the chunky dismemberment we've seen in Brothers in Arms.      One of the other things I noticed is that CoD isn't as oppressively scripted as the first installment. You'll typically only have one path to one objective, but the game often breaks things up by putting you in a battlefield and giving you a batch of locations you have to reach, typically to kill people or blow something up. And in these situations, you can choose what order you want to go in. There are still the dreaded minefields painted into areas that diverge from where the level designers want you to go, and objects piled up just so at key junctions, funneling you down one arbitrary path.    But it's good to see that Infinity Ward is making an effort to open things up a little. I also noticed that there didn't appear to be the Infinite Soldier problem, where the bad guys (always the German army) keep on spawning from behind an obstacle until you've crossed an invisible threshold on the map. They will eventually stop coming (and I also noticed that it's a good idea to keep your eye on any nearby MG42, as they tend to gravitate towards the emplaced machine gun). Lastly, there's no Medal of Honor-style sniper gauntlet to deal with, and few snipers in general -- which is not to say that the Germans don't have any tricks up their sleeves. But I won't spoil anything for you.  You'll have plenty of other gauntlets to deal with, a gameplay loop that Infinity Ward has honed to a science -- almost to a fault, in fact. The tempo almost always leads up to ~defend this location while waiting for reinforcements,~ complete with a timer that, while helpful, does reduce immersion, in my opinion. Then the cavalry comes in, the music swells emotionally, and someone says something dramatic. It's still an effective device, but it does get a little exhausting at times. The climactic mission of each campaign doesn't have the nearly cartoonish difficulty and scope of United Offensive, instead choosing to emphasize a lower-key but nevertheless crucial engagement, like Brothers in Arms did. You'll still go through some famous locations, like Stalingrad and the American landing at Normandy, but the bulk of your effort will be in securing key locations and gradually pushing back the German offensive. CoD still often meets and sometimes exceeds the grandeur of the original, but it does so typically by pitting you against an amazing number of enemies, rather than letting the historic scenery and cinematic music do a lot of the legwork.    Your non-interactive squad mates will also do a good deal of legwork on their own, and I think their power level was nicely balanced. This is a very difficult thing to get right apparently, with some games turning your cohorts into cannon fodder and others making them dumb automatons who don't move out of a line of fire unless you give them enough space nearby. No, the soldiers here do a great job of sticking with you, opening fire and calling out targets and enemy grenades. They do such a good job of following along with your progress that they'll position themselves and wait apparently forever if they get a little too far ahead of you, which is another one of those moments where scripted gameplay can be a blessing and a curse. It doesn't happen often, but you'll notice when the invisible choreographer is waiting for you to pick up the cue and continue on.      But for a script-oriented game, the enemy AI is pretty darned impressive, especially with their grenades. They might catch themselves in the face every once in a while, but hey, who doesn't? The overwhelming majority of the time, they'll be menacing you with ~potato mashers~ flung expertly at your location, forcing you to back up, potentially into their line of sight. Your cohorts don't do a consistently good job of getting out of the way, but they're constantly and subtly replaced, which is another element you make like or dislike. Personally, I thought, ~The more, the merrier,~ but I could see how the constant refill of meat shields will feel a little artificial. Believe me, though, there will be times when you be extremely grateful for every extra hand.  If it wasn't for the grenade indicator popping up every time a German decided to turn me into soldier salad, I would have been toast more times than I can count. Yes, another potentially immersion-breaking artifice, but also a life saver. Especially when you have more than one of them coming at you. The enemy will also progressively retreat, stay behind cover, run from grenades (which you can't cook, unfortunately), aim effectively, savage you with melee attacks when you get too close, and generally provide a challenging opponent who's nearly as good at the game as you are. If the terrain is wide open enough, they might even flank you, although it's typically not an option. But they will toss the mashers at you just when you think you've gotten comfortable behind that wall. They won't really use the smoke grenades that much, but you certainly will, because there are a lot of guns, people, and other problems sitting between you and victory; a little extra battlefield haze goes a long way.    However, smoke grenades won't be the difference between life and death, since you can rapidly regenerate health. Yep, as long as you duck behind something for a few seconds, after taking a bullet or three in the face, you'll be just fine. You won't be able to sit on grenades or dive into a nest of angry Germans, but you'll be able to stick and move like Arnold Schwarzenegger. Even an MG42 is manageable, as long as you have something solid in between it and you. Hide, pop up, fix, fire, drop back down, repeat ad infinitum. This Wolverine-like feature will be essential in certain high-powered engagements, but I would sooner have health packs or a medic, rather than be able to take hordes of enemies almost single-handedly. It's cool for a while, but then things get a little too easy, once you get the rhythm down. And it's there on all difficulty levels, and in multiplayer. The only way you're going to die is if you can't somehow escape from a grenade or if you stumble into several enemies at once, where their melee attacks will make quick work of you. The amount of damage you can handle dwindles quite a lot as you ramp up the difficulty levels, but you'll always be able to fully recover from pretty serious damage.  Fortunately, this dynamic isn't as useful in multiplayer, because the damage model is pretty steep. Unless you're on a large map with few people, you'll get popped before you can regenerate. Snipers can get one-shot kills, and other weapons can as well, if you aim for the head. In addition to deathmatch, team deathmatch, and CTF, you'll also get an HQ Mode and a Search and Destroy Mode. The last two are objective-based, with icons showing up on the map indicating where you need to go. In HQ mode, each side must attempt to establish their base. When their HQ is enabled, your team members can't respawn when they die, and you must destroy their HQ object to bring those folks back to life. If everyone on your team dies, it's game over. You'll also get one point for every second that your HQ is up, with the winner also determined by who gets the highest score, but primarily by who survives. Search and Destroy is pretty self-descriptive. You have to get to a object, typically an 88 gun or the like, and blow it up. The defender can defuse the bomb, or they can also win by killing your team before you plant the explosive.  All in all, the weapons feel pretty well balanced, and the gameplay should be familiar to those who played the original Call of Duty. It doesn't outdo the single-player portion (nor did we expect it to), but it serves as a fine complement that should extend the life of the game. It has 13 maps, including three remakes from the original game, up to 32 players per server, VOIP chat, and two weapons not available in single-player. The levels I played felt generally balanced towards the maximum, and most of them are wide-open and multi-tiered. Campers will have a tough time finding a place to roost.Call of Duty is part of a proud, if tired, subgenre of shooters, and once again it manages to rise above the weariness of the material to find something not only fresh but visceral and immediate. It looks great, it sounds awesome, and it provides both meaty single-player and multiplayer.However, I find implementing regenerating health to be a little troublesome. It allows you to experience a kind of combat only a mythical super-soldier could withstand, and in so doing, propels the game from gritty authenticity to John Woo fantasy. It's difficult to feel like you're really there when you continue to move unabated after taking several MP44 rounds to the chest. Maybe I've just become to accustomed to the necessary fiction of health packs, but this doesn't feel like an honest alternative. Perhaps Call of Duty did fall sway to the evils of multi-platform development after all in implementing a Master Chief-like health system -- but without the science fiction context to go along with it. In the long run, it's up to the gamer to decide whether he can she can dig it. If you do, there's a really fun game to be found. It's just not as fun as it might have been.", "date": "Oct 25, 2005"}