{"name": "Soulcalibur III", "name_review": "Soulcalibur III", "ref": "https://www.ign.com/articles/2005/10/26/soulcalibur-iii", "text": "Soulcalibur is great because it's Soulcalibur and yet...  Had Namco focused more on developing a better storyline and adding additional characters and environments -- highlights of the Soul series -- while focusing less on the new unrefined modes, we'd have a fighter worthy of worship instead of praise. For Soulcalibur III, that is the difference between pure excellence and simple greatness...at least according to our scale, anyway.   Major additions include a retooled story mode, a brand-new character creation system, and a Chronicles of the Sword game type that attempts to merge several dissimilar genres into one tromping beast.   The lattermost addition is worthless. Chronicles of the Sword's supposed strategy lies in tediously forcing a few uninteresting characters about a terribly unapproachable map to seize some boring strongholds. Do it before they do you! Only the play mechanics that govern all this doing offers little. The problem is that there's no actual strategy involved. Chronicles of the Sword demands players outfit their characters with whatever weapons and attire they prefer and then trudge along until colliding with an enemy or enemy base, at which point a spontaneous Soulcalibur fight erupts. It's absurdly menial and plagued by an excess of aggravating loading, which diminishes the allure of any bonuses attached to obsessively improving a character with newly acquired skills and items.   Tale of Souls is a more conventional singleplayer adventure that ships the major characters in Soulcalibur off on the equivalent of a ~Choose Your Own Adventure~ quest. Regardless of whomever you choose, the game will offer a quick bite of explanatory text before nonsensically parading your hero about the Earth. Fights are usually written off as chance encounters via the use of more text, but occasionally Soulcalibur breaks up the routine by offering alternate paths, suddenly imposing specially designed missions with specific objectives, or even dropping a sudden fit of Dragon's Lair-like reflex gaming out of the air.  Tira Likes it Low  I really wish Tale of Souls had received more attention, and certainly at the expense of Chronicles of the Sword. I want to know more about these awesome characters I play! I want a story that makes sense instead of 20 that contradict one another with every ending. I want the basic concepts behind the ~Choose Your Own Adventure~ navigation to be expanded upon with choices that yield disparate results. Even in-game generated cutscenes that hearken back to ancient games like Wing Commander would be incredible for SC. Instead, the solo adventuring feels like a trite way of funneling players to an eventually uninteresting conclusion that justifies the arrival of new content. But oh is the fighting ever good!   It's still Soulcalibur, remember? The fighting is rad.   Attacks are lightning fast, combinations range from simple to complex and are extremely numerous, and all characters move with startling grace. The sort of combat one can expect from Soulcalibur is the same kind that made the series a favorite for casual and enthusiast gamers alike for many years. It's forgiving enough to allow anyone an opportunity to be competitive (or at least feel like they're being competitive), but precise enough so that only those with the coordination to counter attacks at varying levels and then quickly segue their counters into complex combos will rule. And after a fair bit of singelplayer gameplay, you too will appreciate just how much this is not a button masher.   It seems Namco took primitive criticisms to heart and created a computer opponent so challenging it takes steel nerves and flashing hands to best. In one match I eventually succumbed to Mitsurugi, who after a seven hit string of back and forth counters (like an intense tennis volley), finally landed a devastating upward swipe that raked me low to high and sent my character skyward, where I was promptly juggled before being kicked off a precipice. It takes real speed to hit the counters, but even seven of them didn't save me. Several of our own supposed SC pros also took turns trying to best one particularly hard version of Siegfried on ~You're an idiot for playing at this difficulty level.~ It was over an hour before Jason Allen eventually scored a win.  The challenge is there.  The underlying gameplay mechanics that have always made the series so endearing are also there, even if the new gameplay modes aren't quite so invigorating. But the revamped graphics engine is actually a more impressive accomplishment than how Namco managed to increase the AI proficiency and retool the fighting system to focus a touch more on skill.      Some of Soulcalibur's environments are breathtaking. It's an astonishing game despite the lack of progressive scan support. Passersby will marvel at the use of color and brilliant effects that permeate every background and those same people will gape at the exotic, vivid and vast arenas. Much more than any other game, Soulcalibur surrounds its combatants with decadence and magic, treating its levels with as much care as the characters themselves, so the besieged castle and burning world are just as memorable as Kilik's pole skip reversal to vertical smash. Characters like Kilik won't startle players as much as the backgrounds will, but they're all extremely polished and feature distinct personalities and subtleties. I do, however, find the new combatants to model a bit much. That is, they don't feel built for battle like some of the earlier characters that have been with us since Soul Blade do. They're more made for show.  Note that the detail at least carries over to all characters. And there are a bleeding damn lot of 'em. Not all of that care transfers to those created by the included tool, though. Then again, that's probably just because you suck. Really! The character creator is deep enough to allow for some very well made fighters, assuming players like us have enough style to bring them about.   We've created fruits and freaks and fighting machines. You can too. It just takes patience, because you'll need to play a great deal of Soulcalibur III before you can unlock many of the coolest parts. The game, for however uninteresting its new singleplayer modes may be, at least rewards gamers handsomely for partaking in them. The amount of unlockable content is just ridiculous. Totally ridiculous, actually. There's so much crap to gather and find and buy that you'll be occupied for weeks. And as it specifically pertains to the character creator, new snap-on parts will be discovered until the end of time. These can be used to create some really awesome fighters. But they are snap-ons. There are no sliders or such when making a bloke or lass.   High Stepping  SC's character creation is not as accommodating as a different system that might let us define heights, weights and augment faces dynamically before setting our own moves, but it's a great start. But truly, what are we to do with all these pretty men and women when they're made and done? There is no online play and we cannont take them into most singleplayer games (or take them out of certain singleplayer games, as is the case with Chronicles of the Sword). And since these characters are neither personalized nor professionally developed enough to be loved or worthwhile competitors, gamers will flock to the old mainstays, which is where more development time should have went.   In with the old, out with the new. And there you have it. I am obligated to use one word to describe Soulcalibur III. According to our rating scale ~great~ equates to a score between 8.5 and 8.9. And so I must use that funny little word and accompanying score to sum a whole enormous game up, because SC III is simply great. But what does that actually mean? In short, it means the additions to Soulcalibur III aren't very good, but the refined base game that was previously so excellent is still quite great. It means that regardless of how interested a player may be in creating a character for little reason or partaking in many of the less interesting modes for no reason, that player will still adore the smooth fighting and incredible design of this fast, neatly presented title with loads of extras and immense replay value. It's great like that.", "date": "Oct 26, 2005"}