{"name": "Ty the Tasmanian Tiger: Night of the Quinkan", "name_review": "Ty the Tasmanian Tiger 3: Night of the Quinkan", "ref": "https://www.ign.com/articles/2005/10/27/ty-the-tasmanian-tiger-3-night-of-the-quinkan", "text": "Krome Studios has made a name for itself with the good, but far from great Ty the Tasmanian Tiger games. The titles have for this generation represented a kid-geared alternative to the A-list platformer heroes like Mario and Jak and Daxter, to name a few. In an industry trying ever harder to shed the image of traditional platformers with new gameplay designs and gimmicks, Ty has instead embraced the old ways, where run-and-jump mechanics went hand-in-hand with collection quests. And that is, of course, just fine and dandy, because this simplified approach remains well-suited to younger players. The drawback to the first two Ty outings was not that they were simple, but that they lacked both originality and polish, and this is exactly the shortcoming of the third iteration of the franchise, Ty the Tasmanian Tiger 3: Night of the Quinkan. The end result is a predictably conventional, albeit sometimes enjoyable platformer that certainly has its own unique brand of charm, and yet it so closely resembles its predecessors that it may as well be an add-on pack and not a new game.  Ty 3 picks up shortly after the last game left off. Through a series of cinematics players learn that the outback has remained quiet since the Tasmanian Tiger and friends jailed villain Boss Cass, but naturally the peace doesn't last long. Dark spirits known as Quinkan have invaded the mystical sub-area The Dreaming and it's up to Ty to first reunite the Bush Rescue team and then dispose of the enemy threat. The cut-scenes in Ty 3, which take place in real-time using the game engine, passably set the mood by way of some humorous spoken dialogue. The visual presentation of these sequences, however, lacks the flair of the aural delivery; low-polygon characters forego detailed facial animation while lighting and particle effects are subdued, to say the least.  Any gamer who played Ty 2 will find themselves immediately familiar with the control scheme and gameplay challenges in Night of the Quinkan. For better or worse, the title has not changed much from its predecessor. The good news is that the game retains the same mostly tight and intuitive control mechanics that made moving the Tiger about the previous adventures both easy and fun. Ty is able to explore vast 3D environments that spin off in every direction, fight off hordes of enemies with his trusty ~'rangs,~ perform simple combos, and jump through all kinds of platformer challenges. Some experienced gamers may be immediately turned off by the title's overbearing collect-a-thons, which rage out of control. Ty picks up everything from Opals to buy items to Bunyip Stones to advance through the game. However, the majority of kid players will likely have nothing to fuss about as many of these goals are at least straightforwardly explained and easy to navigate.    There are a variety of environmental puzzles and platformer obstacles for Ty to traverse and most of these are well-crafted, if a little easy. Ty will be required to clear paths through mazes in order to guide allies to safety, or platform across floating tiles without falling. Veterans will recognize all of this as pretty basic, and it is, but it's mostly enjoyable all the same.  Ty 3 is made more entertaining by the inclusion of various vehicles that the character can equip to his benefit. He can, for instance, don powerful mech-like robot shells such as the Shadow Bunyip or Extreme Bunyip, just as he can go below sea level with the Crabmersible or take to flight with the Gunyip. Each craft is fun to control for different reasons. Krome Studios has successfully conveyed a believable sense of weight and power as Ty takes control of these giant-sized machines and each comes equipped with primary and secondary weapon functions for added usefulness. Maneuvering these vehicles through the world and fighting enemies helps break from the monotony of the standard quest.  Additionally, Krome has included sub-modes, such as battle arenas and cart racing, the latter of which is not nearly as impressive as it might be thanks to sloppy vehicle control.  Perhaps Ty 3's biggest drawback, other than being a copy of a copy, is that the design and functionality of its overworld can be confusing, which is not compatible with the title's target audience. Gamers will need to make use of a map so that they don't get lost exploring the big hub world and even then, they often won't know what to do when they encounter some structures; a selection of buildings houses shops and other areas while the other selection is strictly for show. Meanwhile, we were momentarily stumped several times when we encountered the doorway to a new area and it didn't open. We walked away twice and explored elsewhere before returning, waiting next to the door and realizing that there is oftentimes a five-second (or longer) pause before these gateways slide open (because the world beyond is likely being loaded). Younger players who encounter similar issues may sometimes be perplexed.  On the visual side, Ty 3 is a mixed bag. The title's large worlds are varied in themes and design, which is a plus. Krome Studios has added simple shrubbery to fill out landscapes and water comes to life with reactive ripples when Ty jumps into it. On the other hand, the make up of both characters and worlds has a decidedly low-polygon look to it -- or in other words, most of the visuals lack roundness. Ty and the environments he explores are colorful and still look pretty good for the most part. But they don't compare with the visual finesse of other younger-skewed platformers such as the Tak games, for example.Ty the Tasmanian Tiger 3: Night of the Quinkan is a predictable sequel to the first two iterations of the franchise. That doesn't make it bad. In fact, it's still enjoyable, especially as straightforward platformer for kids. My younger nephew plays and really likes the first two Ty outings and I'm confident he'll like this one, too. But the Ty series has never been original and this latest version feels like a copy of a copy. Gamers who played and didn't like the other two versions will find nothing new here and Ty fans may find themselves wondering why very little has changed.Like the other Ty platformers, Night of the Quinkan has its moments, but the series needs some dramatic changes to reach new heights.", "date": "Oct 27, 2005"}