{"name": "Flanker 2.0", "name_review": "Flanker 2.0", "ref": "https://www.ign.com/articles/2000/01/12/flanker-20", "text": "Welcome, comrade.  You are obviously here because you are interested in Flanker 2.0.  But I must warn you, this is not a flight sim to be trifled with.  If you are looking for cheap easy Western thrills, go fly Jane's USAF or something from Novalogic.  Flanker 2.0 will separate the hardcore simmers from the casual armchair pilots.  And even some of the hardcore simmers will throw their hands up in frustration and boredom and run back to their precious Falcon 4.0.  Flanker 2.0, like its predecessor, is not a sim that will welcome you with open arms.  It is not warm.  It will not hold you or coddle you.  It is as cold and harsh a mistress as Mother Russia herself.  Sure, there are some very good training missions to get you started.  But once you've run through them, your options are limited.  You can play the dogfighting match-ups, but this will hold your interest for only so long.  Eventually, you will want to take this nimble Russian bird on a combat mission.  And this is where you will slam into one of the thickest walls since the middle of Berlin in the Cold War.    The single missions in Flanker 2.0 are, of course, self-contained nuggets.  Everything going on around you is strictly scripted.  Built-in random chances can vary which scripted elements occur - perhaps the 50% chance of those incoming MiG-23s attacking your airfield won't come through if you play a mission a second time.  This sort of combat in a vacuum isn't surprising for the single missions, but where do you go when you want a sense of accomplishment and progression?  Welcome to the campaign.  It's not dynamic.  It's simply a branching structure of single missions.  It has no elements of strategic management.  Each mission is self-contained except for a few conditions that determine the branching to the next mission.  And the debriefings, which offer plenty of detailed information about who did what to whom when, offer no information about overall performance in the context of these branching missions.  Did you fail and move on to mission B or did you succeed and move on to mission C or was it something in between?  While this branching structure could have been used to create some interesting campaigns (a la Jane's F-15), the developers decided to include only a single campaign.    And what a mess it is.  The missions, as best as I can tell, are more like puzzles built to try the player's patience to the extreme.  In the missions I painfully suffered through (over and over, since most of them are almost impossible to finish the first time you play them), there was nothing approximating a real combat situation.  Instead, they were like nightmare scenarios designed to make the player fail repeatedly.  Plowing through this campaign is harder than farming Siberian tundra.  The developers should have included a few choices, including a beginner's campaign for new players who want to burn through a few missions and get a sense for how the sim's branching mission structure works.  They could have at least ported the random mission generator from the original Flanker to make the game a little less discouraging.  But if you're willing to deal with this limited accessibility, there's a great sim tucked in here.  The first thing you'll notice are great graphics that represent a lovely compromise between speed and beauty.  Although there are some unsightly seams between terrain textures and a disarming pop-up effect for polygonal objects like buildings, the graphics come together very nicely to create compelling, realistic and attractive terrain.  And there are numerous options to configure the engine to a wide range of hardware.  A lovely fluid flight model seems to have been preserved intact from the original Flanker, which had one of the most uncompromising and satisfying flight models you'll find.    The avionics can be a handful.  It would have been nice to have some sort of HUD repeater for the Electronic Warning system, which is tucked in a lower corner of the instrument panel that you can't see without changing your view.  But since there's no way to track incoming missiles (a serious oversight that gets the player killed far too often), you have to keep your eye glued to this instrument.  It's also difficult to juggle modes because engaging any combat mode disables the autopilot and navigation data on the HUD, so you can't follow your waypoints while you're scanning for enemy aircraft or locking a target down on ground radar.  This means that playing Flanker 2.0 involves a lot of flipping around, which feels like unnecessary busy work.  Perhaps this is part of the limitations of an older craft like the Su-27, which is flown from an analog cockpit.  Admittedly, this is a nice change of pace from most contemporary flight sims, which are modeled on slick Western aircraft with glass cockpits.  But it's hard to know where the line should be drawn between annoying realism and unrealistic playability.  A fairly patchy manual doesn't help matters.  At first glance, it seems thorough and detailed.  But once you start hunting through it for specific information, you'll be dismayed at some of the important omissions.  There's lots of theoretical data about radar systems and not enough practical data about actually playing the game.  For instance, there's no information about communicating with your wingman.  Not that there's much interaction here in the first place.  There's also no interaction with the AWACS, ground control, or carrier crews.  After all the swarms of activity and interaction in games like MiG Alley and Falcon 4.0, Flanker 2.0 feels like it's set in a ghost town.  The end result is that there's very little to compel you to play unless you're already a fan of the jet simulations or Russian hardware.  Like Terminal Reality's Fly!, Flanker 2.0 makes the nearly fatal mistake of expecting you to get yourself interested.  It will not entice you with its features or engaging gameplay.  It does not offer the promise of advancing a pilot's career or fighting through an evolving war.  It does not reach out to you.  What's worse, it actually pushes you away with an ill-conceived unfriendly campaign.  Luckily, there's a strong enough sim lurking in this hostile game that passionate flight simmers will find a real treat once they've cracked the shell and accepted the limitations.  Anyone else need not apply.  -- Yuri Gagar", "date": "Jan 12, 2000"}