{"name": "MLSN Sports Picks", "name_review": "MLSN Sports Picks", "ref": "https://www.ign.com/articles/2005/10/29/mlsn-sports-picks", "text": "Digital Chocolate's search for identity comes to a satisfying end with the release of Mobile League Sports Network Sports Picks, a defining application that I think few hardcore sports fans can go without. Whether you follow football, basketball, soccer, or even wrestling, MLSN Sports Picks can be tailored to your personal tastes, making it also one of the more user-friendly apps I've seen in some time.   Fantasy sports leagues are increasingly popular, and MLSN Sports Picks taps into that market by assembling an easy to manage community that allows friends to one-up each other not by making trades, but calling the outcomes of various sporting events every week. The Mobile League part of the title is no simple marketing term; the app provides smart software for easily inviting friends to join a cabal of sports junkies. Within minutes, I was able to quickly link up to a few partners and get started with making some educated guesses (and some wild picks) about upcoming games.   MLSN Sports Picks doesn't just limit itself to asking simple questions like who is going to win the big game this weekend? It throws some extra stumpers in there, asking if perhaps one player is going to get more hits than another, or if one team will accumulate more passing yards than the other, regardless of the final score. That gives MLSN Sports Picks some depth, because just guessing winners has the potential to get old fast.   To its credit, MLSN Sports Picks' customization actually allows fans of different sports to still play together. You can log in and tell the app which sports are your favorites, and the game will start only asking you questions about events in the chosen sports. It figures out which questions will be worth the same amount of points, so I could sit there and make educated guesses on football while a friend leveraged his knowledge of baseball.   After every round in your mobile league tournament, MLSN Sports Picks tabulates scores and promotes the inner to the other players. However, there is more glory than just being right. Your in-game profile will be adorned with badges and ribbons for special performances, which all MLSN Sports Picks players can see.MLSN Sports Picks is an immensely clever application that I cannot imagine many mobile sports fans ignoring. The ease of setting up a league with friends, the customization of the sports preferences, and the smartly written queries all amount to a highly satisfying application. Users will also appreciate that the app is as time-consuming as they want it to be. You can pour over questions for an hour if you want, or just let the computer pick the answers for you (at decreased point values). This eliminates the problem I find with some fantasy sports leagues -- some weeks it feels more like a chore to log in. DChoc has found its true killer app with MLSN Sports Picks, and I am officially excited to see how else the mobile maker approaches the nascent community market for cellphone games and applications.", "date": "Oct 29, 2005"}