{"name": "Greg Hastings 2", "name_review": "Greg Hastings' Tournament Paintball Max'd", "ref": "https://www.ign.com/articles/2005/11/01/greg-hastings-tournament-paintball-maxd-2", "text": "Anyone looking for the best paintball experience on PS2 should look no further than this game. Though it's definitely a niche genre, Greg Hastings' Tournament Paintball Max'd effectively captures the mix of action and properly using cover in arena paintball. Fans of shooters in general may not really be interested in this game since there aren't any bullets. Still, for anyone going into this game with the expectation that they'll only be playing paintball it's a solid experience with plenty of play options.   After creating your profile name you're able to jump right into Max'd's Career, Exhibition, and Multiplayer modes. In Exhibition you can compete against others or the computer in Elimination, Capture the Flag, or Single Flag competition. For a more engaging single player experience, the Career mode definitely needs to be checked out. Here you'll be able to join in competitions that increase in difficulty across the game's field layouts. As you progress you'll get new gear, teammates, and eventually get to face off against professionals. On top of that, you'll also get a surprisingly deep multiplayer experience and a map editor.    It May Be Paintball, But You Can Still Get Headshots.   While there may be a variety of modes, the most important component of any game, the gameplay, could still suck. Thankfully, Max'd is able to properly satisfy the urge to coat your opponents in paint with responsive controls and few cool duck and cover options. Once on the field in any of the game's modes you'll be able to dive forward, sprint, switch your gun, or marker as it's called, from hand to hand, and lean out or above stage obstacles. This makes it really easy to successfully hide yourself and lean out at precisely the right moment or sprint at your enemies, dive down, and then shoot them before they have time to react.   In addition to your variety of moves, you'll also be able to command your squadmates to a certain degree. Before a match you'll have the option to layout how your squad will position themselves right after a match starts. You can even set secondary movement objectives and control periods of cover fire that they can provide. After setting your pre-match strategy you'll be able to manipulate team positions once in the game. You can tell your teammates to move up, and you can also get them to assault certain areas. Given that your teammates act in a somewhat intelligent fashion, it's definitely to your advantage to plan team positions and move them around on the battlefield when trying to be the first to capture a flag.    Along the lines of A.I., your opponents prove to be challenging adversaries, though at some points they seem a little further towards the stupid side. For instance, some enemies take questionable cover positions. Generally, though, they'll stick behind cover and pop out occasionally to blast paint at you. As you move your opponents will react by darting between cover points. They're even smart enough to make risky ventures into a flag capture point to try and win the game before your team is eliminated.   At some points we charged into an area of cover to try and surprise an opponent behind it and we found ourselves getting our plastered with color. Our opponent had apparently been smart enough to see us coming, creep along the opposite edge of the obstacle, and then hop around behind us. While at points it seemed like the enemies behaved intelligently, at other times they wouldn't notice if we fired several shots at them.   When you are hit in the single player game the option to cheat becomes available. While this may seem unfair to some, it definitely lessens the degree of frustration in single player modes. A timed mini game pops up on the screen when you get splattered and you'll need to stop a moving cursor at a specific point in order to have the hit be counted as a miss. If you do you'll move on. If you time it improperly you'll either be knocked out or even take a huge penalty like losing several of your teammates. You don't need to cheat in Max'd, but it's a nice feature and balanced with its share of negative outcomes.     Another feature is the range of things you can do in career. By winning tournaments you'll be able to accumulate experience points as well as credits that can be put towards new markers, clothing, carrying harnesses, and a bunch of other items. Yet despite the apparent depth, this mode still gets old after a while. Though you can progressively hire more teammates and improve your skills across 29 tournaments, each tournament eventually starts to blend into the one before it. This is primarily because each map is very similar. Granted they differ aesthetically, but mostly each map is a small arena with inflatable obstacles or piles of wood among other things. After a while, they all start to feel the same. Also, it's difficult to get a sense of how your skills are improving and how your movement is affected by weight. You can tell what improvements are being made based on what the game tells you, but actually feeling the difference while playing proves to be a more evasive matter.   Shoot Your Friends. It's Fun.   The feel of your marker in Max'd is yet another strong point. Even with crap equipment and low skill rankings, you'll still get a reliable cone of fire where you're aiming. It's not like you'll be nailing targets with laser-like precision, but you won't be missing your opponents at point blank range. As might be expected, it's more difficult to be precise at longer distances, but the paintball trajectories remain well within the domain of reason.    The game's graphics aren't going to win any awards. There isn't much movement in the player models and some of the game's textures are boring. The gun models, too, aren't overly detailed, but they have some nice reflections in them and the different parts you have equipped are represented onscreen when you change parts. Perhaps the most noticeable graphical feature is the fact that your first person view is encircled by your goggles, giving you a better sense of immersion. There are some lighting effects, but overall the graphics are tame.   Players will occasionally shout and the announcer that chimes in at certain points is easy enough to listen to. The game's soundtrack is decent, incorporating music from actual recording artists that accompanies the gameplay appropriately. Mostly, though, you'll just be hearing the repetitive pops of your gun.By combining an enjoyable Career mode with an exciting multiplayer element, Greg Hastings' Tournament Paintball Max'd successfully delivers an entertaining experience. Though on the whole it's a solid title, it does have limitations. First, even though the Career mode does offer a degree of customization and character development, it still manages to get old after a while. This is simply because each map feels similar to the one before and you'll find youre just repeating a succession of arena battles. The graphics and sound can be bland at times but never really detract from the core gameplay. You'll definitely want to play over Xbox Live after a while, since that's where most of your replay value is going to come from.", "date": "Nov 1, 2005"}