{"name": "Story Studio: Mulan", "name_review": "Mulan", "ref": "https://www.ign.com/articles/2000/01/12/mulan", "text": "When the Mulan PlayStation game first came acrossed my desk, I assumed it was some sort of platformer, similar to other Disney animated movie-inspired action games before it. Movie license aside, games like Tarzan, Alladin, and The Lion King are definitely nothing to scoff at.  Somewhat to my dismay, after getting into it, I found that it's really not a game, per se, but an interactive storybook experience geared toward young children. Don't get me wrong, it definitely has its place amongst its target demographic -- But only a very young audience will get any enjoyment out of it, as all of the premises are exceedinly simplistic and feature that Sesame Street Fisher Price ~hold my hand as I play~ feel.  Gameplay The gameplay consists entirely of a number of ~mini gamish~ activities, ranging from dressing our heroin up to playing a friendly game of Mahjong. The basic premise consists of retrieving the Kingdom's mystical scrolls and using your cunning to restore the magical powers to each. Accomplishing the various goals is never overly challenging, and is clearly designed with the very young and inexperienced in mind.  The mini games are varied quite a lot, each being represented by a different area of the map. While some are definitely more involving than others, all of them are very charming and non-threatening. The Village There are several things to do here, such as plopping Mulan in the bath tub and bugging the cat. Your basic goal is to retrieve the various items that Grandma Fa asks for by picking them up and dragging them to her. The Dressmaker This is the area where the player gets to dress up Mulan. You can choose from a variety of hats, tops, bottoms, shoes, and accessories, with the end result hopefully looking very fab! Mulan will express her distaste for any outfit that is particularly gaudy, so try and have some fashion sense. You can also dress up Mulan's faithful sidekick, Mushu. Mulan's House This is the pre-battle stage, and the idea is to get some protective armor for Mulan. The goal is to unlock the cabinet that contains the armor, and this is represented by a standard fare mix and match puzzle. After obtaining the armor, Mulan must pack for her journey -- Mulan's pet dog isn't going to make this easy, though!  The Temple In this mini-game, Mushu must awake his ancestors by hitting a series of Gongs in the correct order. It's a puzzle of memory and cunning, as certain gongs will put an ancestor to sleep, and certain ones will wake them up -- You must determine what gongs to hit and in what order to awake all the ancestors. The Army Camp The mean bullies at the army camp have taken Mulan's belongings! Through a series of trades, you must retrieve the stolen goods. Mahjong As mentioned earlier, a dumbed down version of Mahjong is included as a mini game. The Tung Shao Pass There's a few things to do here. Mulan can throw snowballs at her fellow soldiers, fire a cannon at the enemy archers, and start an avalanche. Yay! Avalanche! In this game, Mushu climbs down a snowy mountain face to pick up all the goodies scattered acrossed the screen. The Imperial City This is the final mini game, and your goal is to eliminate the Huns by dragging watermelons over top them. After you defeat them, you will be able to participate in a few other activities such as lighting lanterns, setting off fireworks, and playing drums.  Aside from the mini games that make up most the gameplay, after you defeat them you will be able to make your own story scrolls and sing along to the game's soundtrack. Hooray!  Graphics The graphics in Mulan are a mixed bag. On the one hand, the game features well-drawn Disney characters right out of the movie. On the other hand, there's noticable slowdown and choppiness in many areas. Most importantly, everything appears very docile and colorful, which is the name of the game when it comes to young children.  Sound The sound scheme in Mulan is great. Featured is full voice from the movie including many all new samples, as well as music taken directly from the sound track. Top notch stuff here. As I said in the very beginning, this is a game designed for young children. Don't walk into a store and buy this expecting to enjoy it for yourself -- You will not only be immensely disappointed, but feel pretty stupid as well. If you have a young child who is a big fan of Mulan or other Disney animated flicks, this may be just the thing.", "date": "Jan 12, 2000"}