{"name": "FIFA '99", "name_review": "FIFA '99", "ref": "https://www.ign.com/articles/1998/12/12/fifa-99", "text": "FIFA '99 is the next in line for EA Sports' soccer franchise, having been released a short five months after the debut of World Cup '98 on the PlayStation.  It almost seems as if Electronic Arts is cashing in its FIFA license as much as possible, but playing the '99 edition and you'll see why this game is the soccer game to have.  True, the design of the gameplay is designed totally around the existing World Cup '98 engine  the game looks very similar. But grab the controller and you can definitely feel the differences. Controls have tightened up significantly  if you want to turn or stop on a dime, the game will let you. The response from button press to on-screen action is instantaneous finally. The last versions relied on the characters running through their set animations before letting you change the motions. This time, you want to change direction or shoot at a precise moment, you can. It's about time.  The graphics engine is also extremely detailed. The framerate never drops to an uncomfortable level, and the speed of play  while being soccer  flows at a peppy pace. The players' motion capturing is absolutely some of the best ever seen in a sports game, from dribbling down the field to goal celebrations. Players also have their own look  each member on the team have his own skin color, hair style, and height on the field. The only downside is the players are made of few polygons  their hands scale down to an awkward knob at the end, which looks really odd when they're high-fiving each other or patting each other on the back.  The play-by-play has the EA standard quality: excellent. The two commentators follow the plays of the game to a 'T' and even call players by their last name. Sure, after a few matches their quotes get a little on the repetitive side, but since there's so much speech in the game it won't get annoying.  The AI of FIFA '99 is also very well done, with players switching from aggressive to conservative coverage during the appropriate plays. There is one major flaw, however  and it almost kills the fun in a one-player game. Since the players are more lax in coverage when you hold the ball, you can keep the ball on your side of the field without the defenders ever touching the ball, and you'll never be called for the foul. If your ahead by a goal or more, this bug in the AI enables you to run the clock out illegally. In games with two players or more this is never a problem (since human players will attack the player with the ball), but for players who want to play a solo match, this makes it too easy to cheat.  If you own the previous EA Sports soccer games, don't judge the game by the screenshots. You really have to play the game to feel the difference. This is the best soccer game on the PlayStation.  -- Craig Harris", "date": "Dec 12, 1998"}