{"name": "Star Wars Battlefront II", "name_review": "Star Wars Battlefront II", "ref": "https://www.ign.com/articles/2005/11/03/star-wars-battlefront-ii", "text": "Battlefront was LucasArts' most successful Star Wars title to date (in terms of sales). And so the release of Battlefront II on PC, PS2 and Xbox should be no surprise. But can it achieve as much success as its father?  Unlike Battlefront senior, part two doesn't have the luxury of being new -- it's not the game to finally deliver every Star Wars fan's fantasy of large scale interactive battles. That already happened.   Despite whatever flaws were present in the first Battlefront, the ultimate fulfillment of that fantasy was partially responsible for the title's almost universal praise. Being second to bat puts Battlefront II at somewhat of a disadvantage. What then can a sequel do to earn the same kind of love? Well, a sequel can fix issues from the first outing and feature a more refined experience that doesn't require any kind of 'close enough' leniency.   Unfortunately, Battlefront II is so similar to Battlefront many gamers might be put off by an uncomfortable impression of having been there and done that. There are many of the same levels, classes, weapons, vehicles, sounds, graphics, animations, characters and problems. But then Lucas is at least trying to keep the dream alive by providing new content we all wished we could enjoy the first time around. Only some of that extra material goes in with mixed results, which ultimately leaves us with a product that doesn't measure up to the potential of the first game, its success, or even the dream that spawned it all.  I'm Cool.  New to Battlefront II are revamped singleplayer modes. In addition to a reinvigorated Galactic Conquest (with more earned goodies and a deeper level of freedom), players can now partake in Rise of the Empire. This mode chronicles the exploits of the galaxy's famed 501st cloned infantry division with a variety of cool objectives and planned battles. It begins with a simple tutorial on Geonosis, but then spirals out of control as the clones march across the galaxy on one deadly operation after another at the whim of a mad supreme chancellor, Palpatine.   Narrated by a clone soldier and spread across a galaxy of war, Rise of the Empire servers as an enjoyable introduction to the basic mechanics and premise of Battlefront II, but also as a worthwhile experience in its own right. This thanks to the varying objectives that update in-mission and the political workings that carry the 501st through Star Wars' major betrayals. The sinister nature of the supreme chancellor, the secrets being kept from the Jedi, the devout preprogrammed obedience of the clones, and the always intense action make for quite an improved game.  Two of our gripes with the first title's singleplayer mode were a lack of cohesion and challenge. Both problems have been fixed -- one because of a story and the other because of more demanding objectives. But our third complaint... Bot AI is simply still an issue, which will ultimately leave many players looking at the more enjoyable multiplayer gameplay to pass their time. Singleplayer is fun, definitely, but it doesn't merit a purchase on its own. This is doubly true since the singleplayer game, good as it may be, lacks both the polish of a more heavily scripted and directed title and the character of a more focused action game.  Splitscreen on Xbox and PS2 is provided, but most gamers (and all of those on PC) will immediately want to play online. Expect up to 24 players on PS2 with a default of 32 on Xbox and PC. But crucial to the potential greatness or terribleness of online matches is not the number of players. Two of Battlefront II's biggest additions are Jedi and starfighters and they can either make or break online games.    Jedi and other super powered hero units (like Han or the Fetts) -- when added to already heated matches by way of a simple rewards and criteria fulfillment system -- create a more intense environment. The side with the hero usually rallies to take additional control nodes or strike more devastating blows against the enemy, while the enemy either flees in horror or assails the hero in force. It's flee or fight. But running is rarely any fun. On the other hand, stubbornly combating a hero unit with thoughts like, ~I'm going to kill you in spite of your crazy powers~ is really terrific. That's not to say most players should just run headlong into some lightsaber wielding master's grip, though.       On PS2 and Xbox, it's not a good idea to square off against heroes. They will kill you, hard. But frantically dodging and trying to gain a better vantage point is still quite satisfying, so don't just lay down lightly. Think about it this way... When a powerless victim in some horror movie dramatically escapes the wrath of a psycho killer and then quickly turns the table, do you not cheer inside? Trust us, you'll cheer when you score that first engineer vs. Jedi kill without any help. Unless you're playing on PC anyway. It's actually pretty easy to topple Jedi over on that system because with such precise mouse aim comes great power. We found ourselves circle strafing Jedi and pinning them in the head with multiple pistol shots as they flailed about hacking and slashing with little effect.   The wild undirected assaults of Jedi often feel clunky, and from a third party's perspective, it can look like marionettes being violently pulled around by some unseen force. This is because in action games of the sort melee fights are typically a bit awkward. And here, with lag and the greater inconvenience of other human players that never hold still, the clunkiness can become incomprehensible insanity.   Cruising for Cruisers  While the spastic combat of the hero units is tolerable in the game's singleplayer modes and even in multiplayer matches where few are present, the hero vs. villains games get way too wild. With any number of players force jumping, sprinting, pushing, pulling and electrocuting their way around a map, a gamer looking for a slick action game will find themselves helplessly bombarded by an array of sloppy in-your-face spurts of sword slashing. It gets so hectic and frustrating, applying any kind of skill to save yourself or vanquish a foe can become impossible. Again, helplessness of the sort is limited to those games exclusively focused on massive battles between equally overpowered characters. For the multiplayer modes that are more conventional (like conquest and the amazingly enjoyable one flag CTF), Battlefront II's heroes feel manageable.   In terms of rides, vehicles this time are perhaps not so dominating as they once were. While players that use grenades and the heavy assault classes over stationary defensives will still have trouble taking out larger machines, the imposing nature of the more destructive vehicles has been toned down. But for all intents and purposes, the basic back and forth shooting of Battlefront is still very much the same.   Unlike most sequels that usually follow closely to their predecessors out of choice but often offer new designs and styles, Battlefront is less capable of creating a new experience because of its branding. It's Star Wars, and so there's the Hoth level, the Geonosis level, the Kamino level, the Wookie level, and all the other goodies you'd expect of a Star Wars title. Those maps that have been included look and feel very similar to their original counterparts, albeit with some slight and some heavy design changes (more platforms in Kamino, a reworked pier setup on Kashyyyk). This is one of Battlefront's more pressing problems. There's such a heavy reliance on established Star Wars planets that it doesn't ever feel like we're doing anything particularly new. Even in the original levels, the game feels used.  Most of this sense of overpowering dj vu is because of the environments and available factions (all seen in previous games or the film). It might have been cool to get a handle on some ancient Sith or Republicans from KOTOR's era or even the armies as they were represented after the Imperial fall, where Thrawn's remnant still caused trouble for the New Republic. But another reason for all the 'been there and done that' talk is because Battlefront II doesn't add many new gameplay enhancements to the original formula. The basic principles are exactly the same, and no new advanced concepts (like progressive objectives, BF2 style command & conquering, or cycling conquest maps) have been implemented. And so we shoot, shoot, shoot.  The shooting itself seems to have been subjected to little change, at least on ground. Now, however, we get to venture into the deep void of space and battle between frigates and destroyers and cruisers of varying shapes and sizes.       In terms of control, space combat in Battlefront II is more comparable to Jedi Starfighter than to Rogue Leader. Turning and targeting is smooth, but can become problematic in multiplayer matches with high pings and heavy lag. In an astonishing amount of matches we actually could not even see the missiles and torpedoes we fired. And sometimes, even though the sound effects would play, we couldn't even see our lasers! These problems carried over to all three versions of the game, but on PC it was less evident thanks to an abundant supply of readily available dedicated servers for us to join.   In one memorable online match on PS2, I and six other teammates were tailing an enemy flag carrier in a game of one flag CTF. He wasn't even trying to avoid us. We just followed him casually, shooting like madmen and pelting his rear with volley after volley of missiles. There were seven of us, laughing hysterically over the USB headset as none of us could see any of our own attacks, but all of us could see the impacts of the others'. And yet it was to no avail. Our opponent casually sauntered through our goal and then randomly exploded a good 10 seconds later for no apparent reason. Much laughter followed.  Fair Fight  Inexplicable drops in performance are very, very frustrating in space and land combat, and can be especially damning in those matches that focus on the hero units, frantic as we've established them to be. And the problem is everywhere. All three platforms and all three versions suffered. On PC there is a good supply of solid servers on which to game, and PS2 seems to be very well supported by officially hosted matches that help alleviate the lag issues, but on Xbox, each and every game we tested suffered terribly from a wealth of poor performance issues so bad players within earshot over Live just sat around joking and complaining with one another while trying to do the simplest of things like walk and shoot. It seems then that quite a bit of polish work and a greater amount of dedicated hosts over high bandwidth pipes needs to be provided.  But when it works, it really works. Moving from spaceship to spaceship, taking flags, gunning down AT-ATs... It's good. But it's also just like Battlefront.  While Battlefront was a dream realized for many Star Wars fans, Battlefront II is an odd case of dj vu that boasts two major additions: Jedi and starships. Conceptually, those bonuses complete the Star Wars mystique and lend a much greater degree of authenticity to the game -- even eliciting a deep sense of satisfaction if only because we finally can wield lightsabers and fly starships. Now even though these additional options are granted, their implementation is flawed. And so more than its predecessor, the faults and quirks of Battlefront II stand out and become glaring because the new adds feel unpolished while the old gripes manage to rear their heads for a second time. In a product that should have remedied issues of the past without adding to them, this is a problem.It's because of this that we're inclined to rate Battelfront II a considerable amount lower than its father. Of course, we must still consider that the underlying mechanics behind online shooting and the collaborative use of Star Wars branded vehicles is still obviously decent. So we must then come to a nice and healthy 7.0.", "date": "Nov 3, 2005"}