{"name": "Teenage Mutant Ninja Turtles 3", "name_review": "Teenage Mutant Ninja Turtles 3: Mutant Nightmare", "ref": "https://www.ign.com/articles/2005/11/03/teenage-mutant-ninja-turtles-3-mutant-nightmare-3", "text": "Fans of the Teenage Mutant Ninja Turtles live privileged lives. They admire a property that will probably never die. The last decade has proved that nothing, be it shifting social trends, calamity or an increasingly-volatile political arena can affect the release of Ninja Turtle products. Just take a look at Turtle videogames; they just keep on coming. The most recent release, Teenage Mutant Ninja Turtles 3: Mutant Nightmare follows the same basic formula as its two predecessors (TMNT and TMNT 2: Battle Nexus) without adding much to keep things fresh.   It still follows the plotline of the new animated television show, so you can expect the same style of futuristic shenanigans from the last two games. This time, though, you'll actually be fighting dinosaurs. Specifically, you'll be fighting armies of triceratops. From the future. What better foe for a group of mutated, man-like turtles to fight than dinosaurs packing laser cannons and grenades? Hey, it works for the show. It's a pretty funky situation, sure enough, and it lends the game a splash of unintentional humor.    Most missions in the game start with an animated segment from the show, so there's an attempt to tie in the action in the game to the story. Mostly though it's just about beating things up. And remember, it's all about a prehistoric (yet futuristic) invasion of savvy dinosaurs hell-bent on crushing the Earth. For those who really dig the show, however, these sequences are a nice touch. The actual video quality isn't that great, unfortunately, so those expecting crisp footage will most likely walk away disappointed.    As for the actual game, it looks and plays like TMNT 2: Battle Nexus and TMNT before it. In fact, were it not for a few tweaks and additions, Mutant Nightmare would play exactly like its predecessors. Unfortunately, neither game in the series has risen above mediocrity and this latest installment is no different. It's still a very basic, straightforward action game with very few surprises when it comes to gameplay. Mission variety is decent at best, with the expected mix of street brawling, driving sequences and boss encounters. Enemies look different, sure, but they behave just like the enemies in the last two games. You can clump them into three distinct groups: those that shoot, those that don't shoot, and those that throw explosives. There are also the expected platform sequences, as well as a few easy puzzles to solve. Again, nothing new or terribly exciting.       The turtles themselves don't have much offensive prowess, either. Each has his weapon of choice, of course, including Leonardo's swords, Donatello's staff, Raphael's sai and Michelangelo's nunchucks. But man, what you really need when fighting pistol packing dinosaurs is contemporary firepower. And that's not a joke. You'll find there are several instances in the game where you'll need to evade or block lasers from five or more dinos at once. Which would be fine if the controls worked perfectly, but they don't. You'll end up taking a lot of unnecessary damage throughout the entire game. It's basically the same problem that has plagued the series since the first installment. Seriously though, fighting laser cannons and grenades with swords and sticks may work in the cartoon, but damn, it's not much fun in this case.  Each turtle still has two basic attacks (weak and strong) as well as a block, jump and evade command. What's different in Mutant Nightmare is something called Ultimate Turtle Mode, which allows each Turtle to evolve into advanced, super powerful versions of themselves. You'll need to collect scrolls scattered throughout specific levels to initiate the change, but once it happens there are new abilities, powers and upgraded weapons. Ultimate Turtle Mode helps you clear the screen of foes at a faster pace, plus it looks cool and lends the game a little extra flash, but it's just not enough to distinguish Mutant Nightmare as an action title. It makes it more interesting than its predecessors, but for those who didn't like the first two games won't find the addition all that exciting.    What does make things somewhat exciting is the new upgrade system, where you take crystals found during the game and trade them in for new moves and combos. The game has a bunch of different colored crystals, each of which offers a different number of points. The more crystals you find during a mission, the more combos you can unlock afterward when you hit the upgrade shop. In addition to combos, you can also purchase skills. You can ~learn~ skills such as the Run Attack, Shell Strike and Slash Wave. The upgrade menu is also where you take the scrolls you've found in the game to unlock Ultimate Turtle Mode. You can find various scrolls for each turtle, so there are actually a good number of rewards for those who want to spend the time searching for every last scroll. Lastly, playing four-player co-op is always nice, and the addition of team attacks helps add a little variety, but the experience still feels hallow. TMNT: Mutant Nightmare plays too much like its flawed predecessors to warrant a look from anyone besides diehard fans. The action wasn't great the first time around, and while the third outing fixes a few problems, it's still largely the same game. It's a vapid action game without the refined control and visual flair required of a game with no soul.", "date": "Nov 3, 2005"}