{"name": "F1 Formula 1 '98", "name_review": "Formula 1 '98", "ref": "https://www.ign.com/articles/1998/12/15/formula-1-98", "text": "The small but proud group of gamers who love Formula racers will be moderately pleased to see that the annual sequel to Psygnosis' classic F1 series, Formula 1 98 has arrived. The new game gives gamers a number of excellent new elements to toil away with, but a level of polish and finesse was lost along the way, bringing this game down to a more mortal level.  But maybe it's not Psygnosis that should take all of the blame for this year's average successor. Last year's developer was Bizarre Creations and this year a new team, Visual Science Production, has taken on the daunting task of re-creating a better F1. Like any perennially updated sports game, F1's alterations and upgrades are subtle and nearly unnoticeable without having played serious hours in the previous title.  The list of changes is quiet long, but the crucial aspects include: Two-player link-up mode (eight AI opponents)   Four-player split-screen via link cable   Improved pit commentary   Arcade Challenge mode   More driver and track details   Less pop-in, further draw distance   Quick race and Arcade race  In the beginning, racers have a solid selection of 16 official worldwide courses from which to choose, and 11 racers/teams. More courses open up as you win more races, and any of the courses can be chosen right away in Arcade or Quick Race, or can be opened up through the Grand Prix course by course.  Graphically, the game has changed for the better...and for worse. In many ways it looks better: lots of little details appeared to clear up last year's miniscule problems -- mostly. The main dilemma was pop-in, which is far less noticeable this time around, at least with buildings and crowd stands. Another strange change, for the worse, is the lighting, which is all encompassing. Last year's version featured more shadows and changes in lighting along the course, and this year's title is mostly colored with fully, sunlit days and full lighting situations, providing little chance for the subtle complexities of the past. (Note: we did mess around with weather alterations.)  Best of all, though, is the ability to play one- to two-player games in either split-screen mode, or via link cable. Added to that is the excellent capability of vying with as many as four-players via link cable with 10 AI cars on the screen. This adds a new level of replay value that shows the developers' desire to improve each year. Gamers should also notice an increase in the opponent AI, who'll drive smarter as the races get tougher, in addition to the differing strengths and weaknesses of the pro drivers themselves.  Players will notice the updated courses and racers (narrower chasis and grooved racing tires instead of slick racing tires), and the decals and visual changes in the cars themselves that are up to date, keeping this game contemporary. These are enhanced by the drivers, including the popular '96 F1 champion Michael Schumacher, Damon Hill ('94 F1 World Champion), and current points champ Mika Hakkinen. Gamers will also notice a more substantial pit stop crew that's more communicative and interactive.  F1 98 is a digital and analog compatible game and drives wonderfully with the analog controls turned on.This game is a decent one without any comparison, but unfortunately, games don't exist in vacuums. Compared to last year's version, this one not only doesn't look as good, it actually creates new problems. The graphics are flatter and less detailed. While pop in isn't as bad in the background, it's worse on the cars themselves. They're flat as hell, and then the lines and contours pop in a surprising manner. Ouch. I suppose that since the cars and racers are more detailed (once you're in close), the team had to give up something somewhere, but still to make the game looks worse? The level of detail in the lighting/shadows is greatly decreased, and so the overall polish is denigrated.Overall, the actual driving feel is relatively the same. The reaction times are still excellent, and the options to change collisions on or off, steering and brake assistance on or off really does change the game. It's excellent for beginners to have these and then turn them off as they progress. The frame rate is still awesome, too.I have to agree with Julian, minus two points. With the exception of the multiplayer aspects, which are really sweet, and the option to play in arcade mode, F1 '98 doesn't have much new hard-core sim realism to offer the gamer who owns F1 '97.In the end, this version has aspects the previous didn't, but it's got new problems, especially in the graphics department that may turn off the detail-oriented fans of this kind of racing game.", "date": "Dec 15, 1998"}