{"name": "Codename Kids Next Door", "name_review": "Codename: Kids Next Door - Operation V.I.D.E.O.G.A.M.E.", "ref": "https://www.ign.com/articles/2005/11/08/codename-kids-next-door-operation-videogame", "text": "[Please note that this text was ported from a review of the PlayStation 2 version of this same game]  Since 2002, Cartoon Network's Codename: Kids Next Door (or KND) has been entertaining children in half hour segments with its rowdy depiction of five well funded ten-year olds and their ongoing operations against oppressive adults. Most of these exploits make good use of bathroom humor and prepubescent acts of heroism to elicit laughs. This game tries to saturate its own set of similar adventures with that style, but fails to deliver any semblance of enjoyable gameplay to augment its reliance on the source material and create a compelling product for any age group.  Despite a penchant for the continual use of nonsensical acronyms (found in the show, as well), the principles that comprise Codename: Kids Next Door Operation V.I.D.E.O.G.A.M.E. are not flawed. In fact, the ideas behind multiple character use, platforming, ranged combat, melee combat, and the occasional appearance of brief on-rails sections have served as the foundation blocks of similar games for many years. Unfortunately, no single type of gameplay in KND is developed enough to support itself and the greater whole comes off as a series of disjointed missions with little staying power.  The biggest portion of KND is the basic platforming. To keep the game accessible for younger audiences, KND employs a simple jump and double jump type of world navigation system. With controller in hand, players can leap around the game environment landing on a variety of moving platforms, dart between perilous lasers, vault over electrified grates, circumvent pools of toxicity and otherwise move around miscellaneous obstructions.  Numbuh Five's Laser Dive  While none of these platforming segments is original, most problematic is the game's clunky collision detection and strangely uncooperative camera that prevents players from obtaining clear views of environments. This makes it hard to quickly predict a course of action or determine where you are in the immediate area. This added level of frustration makes the already lacking amount of interesting content a little more bothersome. If we are to leap through a series of treacherous timed platforming events, we should at least not be limited by basic control inadequacies.  Between all the platforming comes KND's other types of action -- melee and ranged combat, namely. Neither shooting nor clumsily beating foes into submission is particularly exciting. And again, the game feels incapable of maintaining a solid pace and a good sense of control thanks to the platforming bits and an always irksome camera.   KND does at least try and create some distinction between its levels by forcing players into different roles (those of the various Numbuhs, or kid agents) but the characters don't feel special or better equipped to handle particular tasks. Instead, it's as if they were arbitrarily stripped of certain powers to make the switch plausible. That is, there is little reason to not being able to do something we could do earlier. The game does also include some interesting on-rails shooting segments, but even those drag on a bit much in the end. The first revolving aerial dogfight against a monstrous snot spewing bomber is a little too much, for example.  To its credit, there are some interesting boss fights to be found in KND. These usually involve manipulating environmental objects or running through a series of platforming challenges to reach a point where the environment can be manipulated. That would then allow a player to exploit a particular weakness of the boss at hand. Though we suppose most of these boss encounters are most appealing because they're different and highlight some of the better production values KND exhibits.  For instance, it's in the boss fights that we could really appreciate the good music and ample amount of professionally done voice content. The boss fights also represented the most visually appealing areas of KND, though the primitive design, polygonally challenged characters and sparsely populated environments never transcend a very basic level of graphic quality. Operation V.I.D.E.O.G.A.M.E. is a limited action platformer with an unhealthy amount of problems only devout KND fans will be able to appreciate.", "date": "Nov 8, 2005"}