{"name": "Donkey Kong Country 3", "name_review": "Donkey Kong Country 3", "ref": "https://www.ign.com/articles/2005/11/08/donkey-kong-country-3", "text": "When Donkey Kong Country 3 originally hit the Super NES a decade ago, the 16-bit console was already on its way out in favor of the next generation of consoles. Because of this, much of the gaming public had already moved on and missed out on Rare's final 2D SNES platformer. It didn't help that, after two games in two years, a third game might have felt a little ~me too~ at the time of its release. And besides, after the massive impression that the first game made on the industry, to see the same elements again and again certainly watered down its impact a third time in so many years.   But there's no denying that Donkey Kong Country 3 still featured some very tight and challenging gameplay, and kept with the feel of the past couple of platformers that came before it. But this game never really had a huge impact in its original release because of its Dj vu design and its reuse of the same visual style of two previous games. The Game Boy Advance version is even more run-of-the-mill not just because of those mentioned elements, but also because Rare went more conservative in the GBA's exclusive content this time around. Apart from a new set of level challenges unique to the handheld version, that's all she wrote this time around.   For the third iteration of Donkey Kong Country, not only is Donkey Kong missing, but so is Diddy Kong this time around. Dixie Kong from the previous game headlines this adventure with an additional character, Kiddie Kong. The new character opens up the opportunity for new abilities, techniques and challenges, but to be honest even with some of the added elements the game still feels like the same ~run, jump, collect banana~ gameplay that's already been established.   The game's presented a little differently for the third game; the level progression is still linear, but for some reason the designers force the player to actually find that particular line. Right from the start players will have to poke around and find the first level instead of actually being thrust into the action, which may seem like a clever change of pace. But in reality it more confuses the issue and clutters up the design. Donkey Kong Country 3 does add some new sub-games into the mix, and it's cool to see Rare take a step back and reference the company's gaming past. Compete is a fun throwback to the company's Cobra Triangle NES game, racing through a series of speedboat challenges to earn some collectible bananas and other trinkets. The development team also throws in a nifty ~Stun Runner~ style mini-game that's using a very simple graphic technique for a stunning visual effect.   Unfortunately, the third game runs into the same problem as the previous two games: to make the game pop out better on the lesser contrast GBA LCD, the development team oversaturates the colors of the original art assets. This truly waters down the visual impact of the classic SNES series, and the game just doesn't look nearly as good as it did a decade ago. And now that we're in the era of the better backlit LCD screens of the Nintendo DS and GBA SP screens, it would have benefited the game had the designers offered a mode to turn down the louder color palette.  It's definitely hard to get excited for the third game in a series that, once again, does everything well, but nothing spectacular. Donkey Kong Country 3 is another really solid platformer that's fun and challenging, but it's not something that's really going to grab you with anything new. The new elements, while decent, don't add up to a better design compared to the first two games, but if you're itching for more Kong gameplay and haven't hit Number 3 yet, you'll have a good time.", "date": "Nov 8, 2005"}