{"name": "Kingdom of Paradise", "name_review": "Kingdom of Paradise", "ref": "https://www.ign.com/articles/2005/11/09/kingdom-of-paradise", "text": "There's been a serious lack of role-playing games on the PSP ever since it launched back in March. Apart from two dungeon crawlers, Untold Legends and X-Men II: Rise of the Apocalypse, there just hasn't been much to appease role-playing fans. In steps Kingdom of Paradise from developer Climax. It's the only action role-playing game set to ship before Christmas, and fortunately, it's pretty good. Kingdom of Paradise offers a full-fledged role-playing experience that's been missing in the PSP's library.   That's not to say the game is perfect. It most certainly has its share of problems that you'll discover as you read this article. But considering the fact that Climax has managed to squeeze a lengthy, entertaining and reasonably polished role-playing game on a handheld, it's easier to forgive the problems in Kingdom of Paradise. And yes, there has been complex, time-consuming RPGs on handhelds before, but few have offered an experience that resembled something you'd find on a console. And most haven't used full 3D engines.    Fewer still have combined a 3D engine with a highly flexible combat system that let you custom create combo chains. Kingdom of Paradise has all of that. It also presents the entire experience very well. It sets up a distinctive mood from the opening credits that pervades most (not all) of the 15-plus hour adventure. And it does so through good voice work, a nice musical score and well-directed cutscenes. In short, it's a game with an above-average level of polish; something made even more impressive given the fact many PSP offerings look and feel somewhat bland.   Once Upon a Time in Paradise  In terms of plot and narrative, Kingdom of Paradise gets it mostly right. Story is an integral part of any role-playing game, and it's no exception in this case. But the story here, while entertaining, is pretty basic. You play a young man name Shinbu, a former disciple of a martial arts school who got kicked out for doing something stupid. You'll have to figure out what for yourselves. Anyway, he sets off on a quest to avenge his parent's murder and inadvertently ends up on a quest to recover ancient swords, unite the land and generally trump villainy the world over.    Dialogue in the game ranges from genuinely funny to sobering to seriously hokey and dull. There's even a bunch of lines that are downright hilarious in that totally absurd, inappropriate kind of way. It's definitely surprising stuff, anyway. But for the most part, it works without ever getting too cool or too dull. Conversations actually look pretty good too, since each character talking is represented by a large, crisp 3D model. Facial expressions are pretty average, but the whole setup is far better than plain text. Oh, and these plot-critical conversations feature full voiceovers as well. Just like the dialogue though, voices range from believable and cool to whiny and annoying.     Of Swords and Harmful Things  But enough of dialogue and story. Kingdom of Paradise is, after all, an action role-playing game so that's actually a bulk of the experience. The combat system revolves around combos, but how you make these combos is what makes the whole thing interesting. It's a two part system consisting of ~bugei~ scrolls and ~kenpu~ forms. Each bugei scroll has a certain number of slots open that dictates how many individual moves each combo will have. The more slots a bugei scroll has, the more powerful (and lengthy) your combos will be. Kenpu forms are the individual moves you slot into the bugei scrolls. So, if you have a bugei scroll that has 7 open slots, you can put in 7 kenpu forms to form a 7 move combo.   It's an intriguing system. One that initially seems too complex for its own good. But after you get used to the idea, it's fun searching every town, forest and mountainside for crates or treasure chests containing kenpu forms and bugei scrolls. You can earn them by defeating boss characters too, but most of the time it feels like a sprawling Easter egg hunt. Only here, the eggs help you kill stuff real well.  It's possible to craft pretty wicked combos by finding the right kenpo to go into the right bugei scrolls. There are 150 different moves and 15 different styles of martial arts so there's plenty of room to customize.    And then there's Chi. It's basically your magic ability. You can master five different forms, such as fire, earth, water and so on. You start the game knowing how to use wood chi, and it's up to you to develop the skill. Your chi evolves the more you use it, so at first wood chi lets you cast the ~crawling dragon~ offensive spell, but it later advances to ~flying dragon~ and finally ~soaring dragon.~ These spells are effective, maybe even too effective and look downright cool. The spell effects are one of the coolest things in the entire game, actually, and there's plenty of variety.   Danger, Shinbu Robinson!   The combat system as a whole, including chi arts and the combo system, is fun to use in battle but ultimately feels a little hallow. Regardless of the size and intensity of your combo, for instance, you still only need to press the same attack button a bunch of times to execute it. Have a six hit combo? Hit the attack button six times. It never gets more involved than that. Actually making  the combo is fun, and watching it unfold is fun, but executing it is a pretty bland experience. Granted, Kingdom of Paradise isn't a full-fledged action game, but a little variety could have gone a long way here.    Also, the game feels very unbalanced in parts. Chi arts, for instance, are far too powerful. Once you've advanced to the third phase of your very first Chi, it's possible to slay hordes of enemies with little opposition for a good chunk of the game. And since chi power never runs out and only needs to be recharged (a process taking about 5 seconds) things end up severely unbalanced in your favor. It gets to a point where combat becomes dull unless you make an effort to lay off the chi and survive on the power of your combos alone.       But there's no sin greater in Kingdom of Paradise than the tweaked-out block command. It's almost impossible to block an attack from an enemy, even if you're pressing the block command (same as the attack command, by the way) well before the enemy attacks. You invariably take three or four hits before the block command executes. While this isn't that big a deal during normal combat, it's downright infuriating when it comes to certain boss battles. There's absolutely no way your character should take damage if you're blocking well before something attacks you. Any system that forces you to take damage regardless of your skill level is simply ill-conceived.   In between all the combat, you'll visit an array of nicely detailed towns, harbors and forests. And while towns are large, full of chatty NPCs and look downright impressive, they bring about another problem. Navigating towns, and the world at large, is more difficult than it should be.  There's only one camera angle in the game and you can't movie it manually, so you'll find that trees, columns and pillars will sometimes obscure your view. Also, it's hard to see where your going since you can't see more than a few feet ahead of you. Furthermore, whenever an NPC tells you to head toward a specific tea house or other location, it's never pinpointed on the map. You just have to head toward the correct city or province and hope someone points you in the right direction. That, or run around a city or town (and they're big, remember) in hopes of finding it.   While time consuming, getting lost on the way to an objective isn't all that bad. You can usually just retrace your steps and get back on the right track. Plus, you gain the ability to board ships and travel across a giant lake dividing most of the known continent, which cuts down a lot of travel time. Also, you can save your game whenever you want, so if you happen to get killed when out in the wild trying to find a specific NPC or something, you can always reload. About the only time you can't save is during boss battles and cutscenes. Apart from this, though, you can save whenever. A very, very nice addition.   Slice it up Multiplayer Style  Kingdom of Paradise includes wireless multiplayer for up to two players. You can participate in one-on-one battles using your character from the single-player portion of the game, so the more experienced the character the better. You can choose from a list of environments and arenas to fight in, as well as set time limits, defensive attributes and whether you want upgrade items. It's a fun little mode, and it only makes an epic game feel more, uh, epic. Plus, you can even trade kenpu forms you've found during the main game with friends using Wi-Fi, so you can get the whole Pokemon thing going. These two modes round out the Ad Hoc functionality, but guess what.    There are also online goodies.  The game lets you download exclusive kenpu forms, swords and bugei scrolls using infrastructure mode, making Kingdom of Paradise one of the few games to use this functionality. It's about damn time, too, and fortunately, there's real substance in this case. About the only problem with downloading stuff online is that you need to head online using a PC to find a password, plug that password into a webpage on your PSP, and then access the goodies. It's somewhat of a cumbersome process, but hell, just having the option to get extra stuff online is cool.  Kingdom of Paradise offers an interesting, complex combat system and blends it with above-average production values. Combat, while not perfect, is rewarding and the 15-hour quest offers a decent story and nice visuals. The musical score, too, is impressive and lends the game an epic feel. While camera problems and a few balancing issues hamper the game somewhat, the game overall is pretty good especially considering what's currently available on the handheld market.", "date": "Nov 9, 2005"}