{"name": "Resident Evil 2", "name_review": "Biohazard 2 (Import)", "ref": "https://www.ign.com/articles/2000/01/13/biohazard-2-import-2", "text": "You've just arrived in town on the first day of your new job. You've been looking forward to this for ages, as all those months of training have finally paid off. It couldn't get much better, could it? Unfortunately the answer is a resounding ~yes,~ as you encounter a few snags with the new gig, entering what appears to be hell on earth. The vast majority of the town is dead, there're horrible creatures everywhere trying to devour your brain, and further still, you don't have a clue what the hell is going on. No, you're not gearing up for your career as a customer service representative for Microsoft, you're the newest member of the Raccoon City Police Department, and this is the madness that awaits you in the chaotic world of Resident Evil 2.  A port of the original PlayStation version, released a few years prior, it's no surprise that Capcom has re-released Resident Evil 2 on Dreamcast to what is basically a brand-new market of hungry gamers, eagerly awaiting their own piece of the flesh-eating pie. By enhancing the graphics, adding in a few extra modes and packing in a demo of Code Veronica, they've managed to put together one helluva piece for adventure fans to chew on.   First off, for those of you who've never heard of Biohazard 2 (and where have you been living?), allow me to explain what the game entails. Basically, this is an expedition in ~survival horror~ and as such, it's down to you to survive against the hordes of monsters which seem to lurk behind every corner. Along with that, you've also got to try and rescue any remaining survivors and find out who or what is causing all of this (a hint: it's not Martha Stewart). During your search you'll find different weapons, items to help you solve puzzles and diaries explaining what happened.   Players can take control of two different characters, Leon Kennedy or Claire Redfield. Leon is the aforementioned police officer while Claire, sister of Chris Redfield from the first Resident Evil, is searching for her brother who recently went missing. Like Leon, she has no idea what awaits her in Racoon City. The two meet in the introduction sequence, but are separated shortly thereafter.   Depending on which character you choose, you'll meet certain people, pick up certain weapons, and solve certain puzzles. Although the majority of the two missions are the same, there are enough differences to justify playing through the whole game again. However, in order to complete the game properly, you'll need to play through at least four times, as both Leon and Claire have two quests each, the latter of which is longer and has a huge monster chasing your behind! If you manage to complete the game enough times with a high rank, you'll be awarded extra missions, in the form of the 4th Survivor and Tofu.   Luckily for Dreamcast owners though, you don't have to spend hours obtaining these special bonuses, as they're available from the beginning. That's not all though, as along with an art gallery, you can also play Extreme Battle. Here you can pick between Leon, Claire, Chris or Ada Wong. Each one has an assortment of different weapons, including pistols, shotguns, grenade launchers and bowguns. Once you've begun, forget all about the story surrounding the game, it doesn't matter whatsoever. What you have to do here is reach a certain point in the fastest time limit possible. Although you'll begin with a ton of ammo at your disposal, you'll soon be left with nothing as there are monsters everywhere gagging to take a bite out of you.  If you owned the PlayStation version before, and don't wish to play through the whole game with just the standard weapons, you can opt for the Arranged Mode, which gives you a chaingun packed with unlimited ammo. Reach one of the treasure chests and you'll be awarded the gattling gun and rocket launcher. Forget about topping up your health, just enjoy wasting those zombies in style!  Apart from the extras mentioned, Resident Evil 2 on Dreamcast is pretty much the same as the PlayStation incarnation. As a port of the PC version, the visuals are a lot cleaner, but unfortunately, the loading time between each room remains as slow as ever, except for when you happen to be travelling up and down a set of stairs. It's nice to see that the introduction sequence now runs in full screen, making use of the Dreamcast's video playback capabilities, but overall, I was disappointed with the pixelated effects which unnecessarily plague this update.  Of course, the main reason for Resident Evil 2 Value Plus is the demo of Code Veronica. As we've told you before, it's absolutely breathtaking. The graphics reek of quality, the music is as scary as ever and the whole thing is about an hour long. From prison to a spooky castle, the different environments incorporated in the latest RE have been wonderfully produced. It's no wonder Code Veronica is one of the most anticipated titles in Japan, as it's sure to be one of the best games of 2000.  The whole thing comes packed on three discs, with one for each character and the other for the demo. As an owner of the original Resident Evil 2, I had to ask myself, was it worth forking out for what is essentially the same game with a few extras? Being a huge fan, yes, it most definitely was, but only because of the Code Veronica demo, which provides you with a lengthy preview of what is to arrive later this year. Because the game won't be getting a release in America (although it'll hit Europe thanks to Virgin), it's only really on offer to those of you with a Japanese machine. If you do own one and loved the original Resi' games, there's no way you'll regret paying out the extra few bucks for Value Plus. Since all the speech is in English, you'll have no problem playing through, making this one very import friendly.  If however you've never liked Resident Evil, this re-release is hardly going to change your mind. Of course, Code Veronica may well do so, but we reckon $50 is a little too pricey for an hour of sheer enjoyment [Ed's note: ~We~ do not reckon anything.  Matt is obviously not a gamer.]. At the end of the day, what you're getting here is a lot of game, but if it's not your cup of tea, you'd be best to wait. Speaking on behalf of myself though, it should be clear to you by now that I've loved every minute of it. Afterall, it includes a taster of what could save the Dreamcast in Japan, which makes this package something very special indeed.   -- Matthew Langan, IGNDC", "date": "Jan 13, 2000"}