{"name": "Mortyr", "name_review": "Mortyr", "ref": "https://www.ign.com/articles/2000/01/14/mortyr", "text": "For good or bad, Mortyr has received a lot of publicity over the last two years. Unfortunately, a large portion of this exposure cannot be credited to its better qualities and good design. Most of it had to do with the fact that the Polish developers, Mirage Media, had a tough time finding a publisher. In addition, Mortyr's story content stirred up enough controversy on its own. It was in and out of schedules, and all of that was echoed in the gaming community. After playing the game for a while, I feel that it received way too much attention in comparison to its actual value as a game, as it's a game that is full of near misses in terms of conception and execution.  By many standards Mortyr is a very conventional first person shooter. By conventional I mean it has the same gameplay-driven story as titles like Wolfenstein or Unreal. Engaging cinematic scenes and interesting dialogues are sadly lacking, while plot development is solely based on random notes left by key figures throughout the levels. It's your classical scoot and shoot situation awkwardly punctuated with bits of narrative here and there. It's a shame, because the idea had some potential.   It begins in an alternate reality where Nazis (remember them?) are ruling the world. They won WWII by designing a time machine, and acquiring a powerful artifact from the far future that holds the source of all their power.  In 2093, the planet Earth is nearing its final days. Global cataclysm is directly attributed to the use of the time machine. It is therefore necessary to pay a visit to the past and try to change history. A brilliant scientist and his crew decide to send one person to the past just before the time machine was invented. Sebastian Mortyr, son of the aforementioned scientist and an elite commando capable of handling the shoot-em-up, situations with calm precision and ease, agrees to journey back and set things right. Since things like this never work out, Sebastian finds himself transported back to a chapel instead of the home of the time machine's original inventor. Without giving too much of the game's plot away, let's just say our hero returns to the present (which is 2093 ... is this getting confusing yet?) where he's now viewed as a traitor and a criminal. Worse yet, he still has to destroy the artifact that is the source of the Third Reich's military power.  Now, I don't want to get too philosophical here, but ~time machine~ stories require a little more sophistication in the story to work right. Tampering with time just brings up too many unexplainable situations and phenomenon that Mortyr's storyline is poorly-equipped to handle. The plot is a compelling idea that isn't fully exploited nor adequately developed. These flaws are usually found in much older FPS games, like id's first games. We could forgive early FPSs for focussing on the technology over story out of necessity. It would've been much better for Mirage Media to actually license the Unreal Engine technology and concentrate on game design, rather than to try to come up with a whole new engine (the IC engine) as well as create a good single player game.  Mortyr's visual experience is a blend of good and bad ... to say the least. The game starts inside a Gothic cathedral where you're surrounded with beautiful shiny surfaces, visages, and reflections of light. Take some time to admire the beautiful scenes of light gazing through the painted glass and reflecting on the smooth, shiny floor. It is a pretty sight, although seriously lacking in originality. Gothic cathedral environments remind me all too much of Unreal. Sometimes you'll be pleasantly surprised by the quality of the environments and other times you'll simply wish you were playing this baby with a more powerful engine. Take outdoor scenes for example. Outdoor textures of the scenery are poorly done, in strong contrast to some good work displayed indoors. Weather effects are also lacking. The rain is somewhat acceptable, but the snowflakes look like a child's drawings on a Christmas card.  Graphically Mortyr is a mixed bag ranging from awe-inspiring lighting to horribly pixelated atrocities.  If we examine the models of the nearby German officer, it becomes clear that it's not only a low poly count affair, but also a lack of design skills and imagination. OK, so what about their intelligence? Usually, good looks are seldom related to high intelligence (Sharon Stone excluded). In that sense, German soldiers in Mortyr should be a pretty smart group of men. Unfortunately (or fortunately, depending on your level of FPS skills), these Nazis are about as dumb as they get. I couldn't help thinking of Extreme Paintbrawl. It's not a rare occurance to find a Nazi stuck trying to run through a wall, and at that point all you really have to do is fire away with whatever you're packing ... The bulk of the AI routines consist of running left and right, not strafing, but actually running. Also, some of the soldiers will do certain acrobatics like throwing themselves on their side in an attempt to dodge a bullet. All in all, the AI is definitely the weakest element of the game. Saying that it is outdated is an understatement, especially considering that the designers had the chance to play games like Half-Life, Unreal Tournament or Quake III.  And the game doesn't challenge your intelligence either ... at least not as much as it challenges your patience, especially in the area of puzzles. The concept here is as old as hell. Puzzle solving is all too conventional -- find a key, push a buttons, open a door ... you get the idea. There is precious little originality in Mortyr's ~mind-benders.~ If you've been getting nostalgic about playing first person shooters that have nothing to do with the recent innovations in the single-player, story driven aspect of the genre, this game is your cup of tea.  One thing that can keep a player going despite the puzzle solving is a pretty colorful and visually dynamic level design. If putting keys in the keyholes time and time again gets you a bit down, you can always enjoy the changes from castle interiors to wide-open, snowy areas, and then back to sewers and underground tombs. The set of colors changes drastically with the environments. As an added bonus, the dynamic time cycle of the game brings with it sense of realism. While the WWII part is done in a Gothic style with lots of antique elements, the futuristic era carries the industrial feeling of a global dictatorship regime, with massive metallic structures and stylized swastikas. Level design manages to achieve something that is sorely lacking in the rest of the gameplay -- a breath of fresh air to break down the monotonous, and unoriginal running, shooting, and button-pushing exercises.  Along with the changes in scenery comes a constantly shifting arsenal. The player starts with weapons appropriate to the WWII time period, and ends up blasting out with Plasma Launchers and futuristic Sub-Automatic Rifles. Better still, there is supposed to be some kind of balancing between the weapons. The Sub-Automatic Rifle and its earlier version, the MG42, are very powerful in close range but ineffective at long range. The Mouser Rifle is a great distance weapon, as is the all-powerful Plasma Launcher. There is also some fun to be found when toasting people with the Flame-Thrower or blowing them to bits (well, it doesn't actually show) with the Panzerfaust rocket launcher.  Although programmers are trying to convince us that the weapons aren't too devastating and that we shouldn't enter the room all guns blazing, it works a little differently in practice. Weapons are too powerful for the feeble enemy AI, and although ammunition on the futuristic levels is a bit scarce, there is still plenty of firepower to bring down an army or a platoon of mech-like robots. Probably the best thing about the weapons is the crosshair which in the words of its creators: ~constantly computes where your impact point will be depending on what gun you are using.~ It gives you that cool feeling of not having a steady aim because of the weapon's weight. It's a pretty neat idea that I haven't seen in FPS games before.  I can't say that playing Mortyr was a rewarding experience. And I can't say that the game is addictive since I had to force myself to continue playing it. The puzzles are tedious, the AI is awful, and the story is practically nowhere to be found during gameplay. The fact that there are a few polished up 3D effects and that some levels look and feel nice wasn't enough to keep me going through the game with anything approaching satisfaction. As I said earlier, the US release of the title came a year or so later than it really should have, and the game looks unoriginal, old and outdated. I hate to break it down like this, because generally, I'm a nice guy, but hey -- I call it as I see it.  -- Uros Jojic", "date": "Jan 14, 2000"}