{"name": "Professional Bull Rider", "name_review": "Professional Bull Rider", "ref": "https://www.ign.com/articles/2000/01/14/professional-bull-rider", "text": "Given the PC entertainment market's tendency to grind out clone after watered-down clone, it's rare that a truly original game crosses our desks.  We've played enough Command & Conquer lookalikes to emit a collective sigh whenever we hear the term ~real-time strategy game,~ so when we spied Professional Bull Rider (PBR) at the local Electronics Boutique a few weeks ago we were more than happy to lay down some cash to try out something new.  While we've seen a couple of bull riding sims in the past, I don't think anyone would say that the gaming scene is flooded with them.  Even so, after playing games like Extreme Bullrider and Extreme Rodeo, we can't exactly say that we were expecting to have much fun with another bull riding sim.  And since an entire bull riding run only lasts eight seconds, we didn't expect a game based on bull riding to be very exciting either.  Boy, were we wrong ...  First, let me start off by saying that there's not a lot to PBR, but what's here is well done.  There's not an extensive weapons list, there's not a lot of intricate levels, and you're not going to be wowed by lots of floating particles and colored lighting effects. It's simple, but it's fun.   In PBR you can play as either a snorting mass of male cowness or swaggering mass of masculine cowboyness.  You can even create your own cowboy or bull by setting their statistical ratings and decking them out with western duds (well, the cowboys at least).  As a cowboy, the game is simple to control, especially with a gamepad, and consists of little more than tapping left, right, up or down to keep your balance while occasionally hitting a button or two to regain your grip or spur the bull.  It can be a little disorienting to remember which way is left or right as the bull turns and twists wildly around the camera, but it makes it that much more realistic as riding a bull in real life can be pretty disorienting as well.    Surprisingly, if you opt to play as the bull, the control system is a little more in-depth, but still easy to use.  As the bull your main motivation is to send the 160 pound nuisance on your back sailing through the air (as well as giving him a good goring after he hits the dust).  You'll use a number of combo moves to try and dislodge your passenger.  In my opinion, this is the best part of the game, because there's nothing quite as exciting as going after a downed cowboy with both horns pointed at his back.    Graphically this game is superb, at least as far as the meat of the game is concerned.  The high-polygon bull and cowboy character models look great and display different facial expressions during the ride. The arenas look pretty generic and, while there's not much that moves in the game, the animation for the cowboys and bulls is silky smooth.  You can even opt to watch a replay of your run and see everything slowed down so you can analyze each frame of your ride.  In-game menus are sharp, slick, and easy to navigate while the high-quality movies (mainly used in the training sequences) show few signs of compression problems and artifacting.  Overall, PBR is a sold package both visually and control-wise.  So, it's not hard to recommend this game for anyone who's looking for something that's not a cookie-cutter title. PBR is one of those games that turned out to be a lot more fun than we first expected, and while it my not have the gameplay options of a game like Unreal Tournament or the depth The Operational Art of War, it offers up a lot of simple fun that should keep you busy for a little while at least.  PBR doesn't have infinite playability, but it's a great example of a game that's done right for the subject matter it covers.  So, while it isn't going to win any awards, PBR a great bull riding simulation and well worth the money if you're looking for something a bit different.  -- Tal Blevins", "date": "Jan 14, 2000"}