{"name": "NBA Live 06", "name_review": "NBA Live 06", "ref": "https://www.ign.com/articles/2005/11/14/nba-live-06-3", "text": "Remember when Michael Jordan was more than just a bald head? When players like Tom Chambers could dunk from the three-point line and Sir Charles threw down gorilla slams from the free throw line. Those ~good old days~ of basketball videogames introduced individuality to the genre, separating His Airness, The Glide, and Larry Legend from the role players lucky enough to ever sub in a game.   For some reason, as basketball videogames evolved, the individuality disappeared. Sure, with improved graphics you could actually read the tattoos on your favorite player's bicep, but you couldn't tell the difference in move sets between a player like Baron Davis and Andre Miller. They're drastically different players in real life, but in videogames, a point guard is a point guard, and as long as he's quick, he's your man.   NBA Live 06 brings the individuality back into the game of videogame hoops as EA makes the old school new again, showcasing dunkers as high flyers, flashy passers as playmakers, and shooters as, well, shooters, separating the best of the best from the rest on the bench and turning NBA Live into a game where it actually matters what team you play as.    A game where the Suns will run you off the court with Steve Nash, Amare, and The Matrix, and the Pistons will lock you up with defensive stoppers from the point to the paint.   And by finally focusing their attention on the superstars of the NBA and the individuality that makes them special, EA Sports has finally developed an elite five-on-five basketball game worth buying the second it hits shelves.   The Game  The NBA Live series has had its ups and downs over the years, and a few years ago, the series was more down than up... and I mean way, way down. But as the series started building back up and EA Sports started to add innovative features into the mix, from Freestyle shakes to the Pro Hop, the series continued to improve, but at the same time, never felt quite right. They were on the verge of something big, but never delivered the complete package that basketball fans have wanted. But with the addition of Freestyle Superstar moves, the highflying dunks of Vince Carter and the slick shooting of Peja from beyond the arc, the gameplay all comes together as not a work in progress, but the game we should've been playing all along.   What I mean is that you can now link the moves that have built up throughout the years to pull off show-stopping sequences the likes have never been captured in a videogame. Bring the ball up the court with Steve Nash, use freestyle to break the ankles of your defender, Pro Hop into the paint to slide past the trap, then use the simplistic Superstar controls (hold the left trigger and the face buttons become your move set) to use Playmaker passing to whip the rock behind your back to Amare who grabs the ball and uses his Power moves to not only dunk the ball with authority, but swing the Stoudemire family jewels in the face of the man who was trying to guard him. There are Superstar moves out of the triple threat, passes, blocks, steal, dunks, outside jumpers, set shots, and leaners. You can bank the ball off glass as Tim Duncan, throw no-look passes as Jason Kidd, even rise to the rim for a thundering slam as King James.   These are the moves that made the superstars famous, and now these are the moves that truly make a difference in every game of NBA Live 06.   There are six Superstar characteristics in total (Power, Playmaker, Scorer, Shooter, High Flyer, and Stopper), and depending on the player ratings, players can be assigned one Superstar ability on both offense and defense. So players like Kobe Bryant have the option of being a High Flyer, Inside Scorer, Outside Scorer, Playmaker, or Shooter, on offense, and an Outside Stopper on defense. Other players like Josh Smith don't have those options and will be limited to simply being a High Flyer. But hey, that's better than his Atlanta teammates as no one else on the team even qualifies for a single Superstar ability. Again, player ratings determine what players can be assigned specific attributes, so if they don't bring the goods in the NBA, they're not going to all of a sudden start bouncing the ball to themselves for a self alley-oop on the break.    Speaking of self alley-oops, if there's one drawback to the Superstar abilities, it's the fact that the superstar players dominate a little too much. Take for instance the NBA record for steals in a game. Kendall Gill (basketball player turned boxer) and Larry Kenon hold the record with 11. Using the Outside Stopper steal moves, I was able to force 20 steals on Superstar difficulty as Stephon Marbury during a game with five minute quarters -- so while the Superstar moves add the realism of individuality to the court, don't expect to play any realistic type of basketball game here. Sure, you can call plays and players act more realistically than in the past, but this is far from a basketball simulation. As a videogame, it's extremely fun and addicting, especially playing two-players, but if you're looking for a true sim, you're looking in the wrong place. There are way too many blocks, way too many steals to mirror anything close to a real game. There are also times at the end of contests where the computer will have a player like LeBron, but you wind up watching Eric Snow take all the shots. To its credit, the AI does call more plays against you, their clock management in terms of timeouts and intentional fouls at the end of games is great, and you can see players running around screens, even pushing off from defenders in hopes of getting the ball. But in the end, while the game is as close to a sim as the Live series has ever been, it's still far from the days of Inside Drive in terms of pacing and that true-to-life NBA feel.    Another drawback is the amount of missed layups and dunks. Not only will your Superstar players miss some of their Superstar shots, but there will be times when you can't make a close shot to save your polygonal life. Dunks clank off the back rim, layups roll out, and there were times playing this game where I thought a few editors were going to throw their controllers through the window. A passionate response to passionate gameplay (especially the way we talk trash), but when you have a Superstar player who goes in for a special layup and he blows that opportunity and costs you precious points, it makes you wonder why you were so happy to have that Superstar in your lineup. Then again, you really have to have an understanding of when to use the special moves and when to hold back. If you're driving the lane and there are two defenders in your way, you can try to jump over them for the dunk, but most likely you'll get called for the charge or your shot will be blocked. Same goes for Playmaker passing. Behind-the-back passes aren't meant for every situation, and if you try to get too fancy, the computer will pick your pocket every time.   Building a Dynasty  Superstar is the name of the game in Dynasty mode as well as you are able to mold your younger players and draft picks into the superstars of the future. As the General Manager, you're able to hire scouts, assistant coaches, and trainers. You send the scouts out to find your future draft picks, then send your current players to work with the assistant coaches to help develop certain aspects of their game. You can hire defensive minded coaches to work with players to make them Stoppers. You can hire coaches who specialize in Athletics to help train your players and help them get in better shape. You can even transform out of shape vets into reborn, muscular players who can once again contribute to your team. And through the system called Player Evolution, at the end of each season, you will even see a picture of your transformed player, what Superstar abilities he may have acquired, and even catch him pointing to you like ~thanks for making me a Superstar, man, I won't let you down.~ At least, that's what it look liked to me.   This mode really enables you to craft a team to your liking as you can take a young team like the Bobcats, work with their young players on the Superstar types you prefer to play as, then draft for any holes on your team and send those players to the assistant coaches as well. Over the years, as the older teams start to fall off, you'll have a rising team of defensive stoppers that will put the Pistons to shame or a squad of outside shooters that can fill the bucket with 3's at the drop of a dime.  pagebreak>  Graphics and Sound  Sporting an all-new graphics engine, these are the best looking Live players to date, and on hte PC, they really shine. I am loving the Superstar animations, from the fluidity of the passes to the swooping dunks, the game goes a long way to capture the look and feel of the NBA. Speaking of feel, you can even spot players pumping their fists after a big defensive play or flexing their muscles and pointing to their biceps after a big slam. This just adds to the emotion of the contest and, while it's a small thing, it really adds to the overall enjoyment of the game (not to mention, gives you time to talk a little smack to your opponent).     In terms of the audio, Marv Albert and Steve Kerr provide the commentary during games, but once again it's Ernie Johnson and Kenny ~The Jet~ Smith who provides the most laughs with their comments during the dunk contest. It's amazing to hear Smith's reactions to the dunks right after they happen; almost giving you the feeling he's watching them live. I just wish the same could be said for Albert and Kerr who sound a bit stupid saying things like ~They've been giving up easy baskets like that all night,~ when the score is 2-0, and commenting so late on some plays that the ball will be on the other end of the court after a steal, you'll hit a three, and then they'll make a remark about how great the defense was. The soundtrack is typical EA, with songs from big name artists that you can't escape even if you try like the Black Eyed Peas.    This is my favorite two-player sports game of the year so far. The Superstar moves really change the way you play the game, and for the better, as for the first time in years you can really tell the difference between players like Shaq and Eric Dampier. I also really enjoyed the deep Dynasty mode and Player Evolution. The ability to take a team like the Bobcats, develop your rookies any way you want, and watch as some young shooter off the bench becomes the next Reggie Miller is something that will keep you in the game until the real Bobcats make the playoffs for real.", "date": "Nov 14, 2005"}