{"name": "Uno Challenge", "name_review": "Uno Challenge", "ref": "https://www.ign.com/articles/2005/11/14/uno-challenge", "text": "Many a household has whiled away ~family game night~ to the classic card game Uno. Summus and Mattel have teamed up to deliver the card game experience to mobile withUno Challenge, which also introduces an online multiplayer function that really elevates it to a level that approximates sitting around a table and playing cards with other people. Sure, it's not the same thing necessarily to star at a cellphone screen, but let's face it, playing against another person by whatever means is always going to be more engaging than assuming the computer is cheating you.   Uno Challenge follows the exact same rules as the actual card game. The goal is still to empty your hand first, matching color or number cards. You can screw the player next to you by slapping down a card that skips their turn or forces them to draw. In the traditional off line game, you can play against either three computer opponents, or human ones if you opt just to pass the phone around. Then, you can set up how many ~win~ points are required.   Back to what I said about playing against the computer... it's merciless. I don't think I'm a terrible Uno player, but somehow I always seemed to end up with 10 cards while the computer players had maybe three or four per player. On one streak, I was skipped, told to draw two, and then told to draw four. I'm not saying somebody dropped in an algorithm to make the computer cheat, but sometimes it felt a little uncanny.   I liked Uno Challenge a lot more when playing against people. After choosing a name and avatar, it was easy just to connect. I only had one minor hiccup while playing online. Against other people, I fared a little better than playing alone.   Uno Challenge has a nice interface that shows off all four avatars and the number of cards they currently hold. You have a clean, easy to view row of cards at the bottom of the screen. Drawing and discarding is handled with the two soft keys. There are little ~fwip!~ effects for drawing cards, and chimes when good or bad things happen.  If you fancy a little Uno, then Uno Challenge is a solid investment. The pass-the-phone feature is dubious, because if you have four people just hanging, why not bust out the actual cards? But online, Uno Challenge really sings. The game is just the right pace to be effectively handled with current network speeds, and there's no fishy bidness with you suddenly having to draw six cards while the computer magically empties out its decks. Do I smell collusion between two of the computer avatars? Maybe.", "date": "Nov 14, 2005"}