{"name": "Croc", "name_review": "Croc: Legend of the Gobbos Saturn Review", "ref": "https://www.ign.com/articles/1998/12/16/croc-legend-of-the-gobbos-saturn-review", "text": "Seeing this game being played on the Saturn brings tears to the eyes of many a Sega Fan. While Croc brings nothing really new to the gaming experience, it takes the best and most familiar from many popular games and stuffs them into a 3D world that puts Sonic Team's best efforts to shame.Croc, himself, is a terribly cute little critter trying to save his foster family of Gobbos (even cuter little fuzzballs) from the evil Baron Dante and his minions. Amazing attention to detail is evident in the character's movement and sounds. Croc toddles his ways around beautiful landscapes, caves, and snow scenes, leaping and butt stomping in a Mario 64-like way.Everything about him is derivative, but cute. His basic attack is a Crash Bandicoot-like spin, while he swims like a girl (Lara Croft, that is). Each level consists of six trapped Gobbos, five brightly colored crystals that open an optional area where the last Gobbo is normally hidden, and a whole bunch of white crystals that spill with your first injury, protecting you just like Sonic's rings. Just don't get hurt when you're out of crystals. If you're carrying a whole mess of crystals when you get whacked, only a few of them are there on the ground to pick up again.Even though the formula is a re-hash, the game is bright, brilliant, and amusing. The cuteness and simplicity may not be too much for more fanatical gamers, but Sonic or Crash fans should enjoy this one. The background graphics get re-used quite a bit so there isn't as much variety as one would like. The Playstation version does do the transparencies that the Saturn version is lacking, even though the developers promised us these. I'm not sure I understand the point of the bouncing jello molds, but what the heck, they're fun.Basic control with the digital pad is responsive. The 3D pad is supported, but I found it a bit too jumpy and unreliable. Much of what you want to do is small precise movements and very careful leaps onto itty bitty platforms. Right and left on the digital pad turns Croc while the shoulder buttons slide him sideways. In the middle of a jump, however, these switch, and it takes a bit getting use to. I had the best luck staying with the digital pad and always making a practice jump if I could.It's a cute game that borrows without offending serious gamers. While there are better games out there, few have been programmed so well, and considering the lack of a solid Sonic competitor, it ain't so bad at all.To be kind, the game is fast. That makes it better by far than valueless games like The Muppets or Rugrats. Also, the environments are large, and there is some exploring beyond the left-to-right gameplay. But Croc simply isn't as sharp and enjoyable as it should have been, and it's fatally deficient of everything that made the 3D versions at least enjoyable. It's a very average game, and really not worth the time. Maybe this failed attempt is why THQ is going for a whole new engine and top-down design for the sequel.", "date": "Dec 16, 1998"}