{"name": "Kameo", "name_review": "Kameo: Elements of Power", "ref": "https://www.ign.com/articles/2005/11/15/kameo-elements-of-power", "text": "Over the course of the last few years Kameo has been written about by more IGN editors and for more consoles than almost any other single game. That's why it's a bit unbelievable that in less than two weeks the world will finally get to play the Rare title that has been around longer than Microsoft has been in the video game industry. In the past week we played through the retail version of the game on a retail Xbox 360. This is it folks: the version you'll find on shelves at launch day, under the tree on Christmas morning, and in the disc tray of your gleaming new console right after you plug it in. So are the adventures of the shape-shifting fairy been worth the wait? Read on to find out.    Probably the most pressing question in people's mind is how the game holds up technically. There's been plenty of chatter over the past six months over the power of the X360, frame rates, and Rare's ability to ever complete a game. Know this: the visuals are silky smooth, there are no hang-ups, loading times are breezy, and the frame rate rocks. I have to admit that seeing the game in motion had me breathing a sigh of relief and I'm sure upon reading this the wealthy consumers who purchased the omega bundle are getting the same warm fuzzy feeling.   Powered By Elvin Energy  The game opens dramatically as Kameo storms a foreboding castle in hopes of rescuing her family. Players begin with access to three alternate forms which have been displayed prominently in our earlier previews. As a refresher, the premise of Kameo is that the main character has the ability to morph into different creatures. Each of the forms has powers that allow players to access certain areas, solve puzzles, and kill individual enemies.     The opening scene acts as a prologue and a tutorial and as it comes to a close Kameo loses all of her powers and must start from scratch back at home in the Enchanted Kingdom. The rest of the game is a quest to regain the ten elemental spirits and eventually take on Kameo's evil sister and her accomplice Thorn, The King of Trolls. The search takes gamers to four themed areas that lie on the outskirts of a huge open expanse known as the Badlands. There's a murky swamp, an aquatic paradise, an icy village, and Thorn's piping hot base of operations. Each of the zones in Kameo are a mix between habitable towns, puzzles, and hazards. When gamers enter the forest to recapture one of their first elemental spirits they'll find shops and townspeople scattered about the level. Mixing the ~friendly zones~ into the levels makes the world feel more like a whole and it means that every section of the game is dense with activity. There is hardly any dead space in Kameo, players are constantly engaged and challenged with clever puzzles.    The only real traveling takes place on the Badlands which is also the setting for an ongoing battle between armies of the elves and trolls, so if players choose to cross this area on foot they'll have to plow through continuous warfare. The Enchanted Kingdom works as sort of a hub that can warp Kameo to all of the areas, but if she does choose to make the trip without the help of magic there is also a trusty steed that accelerates the journey. These excursions into the Badlands are a great change of pace to the puzzle solving that comes with each zone. Gamers can spend long stretches of time engaged in endless combat on the Badlands toying with hundred of trolls and elves while practicing the various moves of their new-found creatures.         One element that took me by surprise was that gamers hardly ever play as the main character. Her wings make her useful for jumping off ledges or traversing flat terrain, but other than that she's not much of a warrior. It's more fun to roll though the environments as a pile of living rocks than a skinny tart. Also, when not using one of her 10 alternate forms Kameo is a fairly ineffectual character. Her hover ability makes for faster traveling and she's able to perform a flip kick breaks boxes but that's about it.    The other 10 forms that players take on vary in terms of usefulness and how much fun they are to control. For example one creature that breaths fire is mainly utilized for puzzle solving (lighting torches) and isn't as fun to use when battling trolls. The good news is that there are enough well balanced characters to make the constant switches between characters enjoyable rather than annoying.   Rare's choice to only use the triggers and the analog stick for controlling the actions of the characters was an odd choice but works well in most instances. Unfortunately there are some characters that have frustratingly bad control setups. Swimming with Deep Blue (an aquatic blob) is hampered by both how a trigger must be used to propel him forward and how the camera fails to dive underwater along with the character. This wouldn't matter if players weren't forced to use him in one of the otherwise very clever boss battles.    If novice players end up having trouble with some of the challenges they always have access to a talking hint book in the menu screen. The book is named Ortho and he'll allude to solutions upon first inspection and then if players are really stuck he'll offer a straight up solution. Sometimes I wished that there was slightly less help available but I suppose that's what difficulty settings are for.    The combat segment of Kameo is one of its draws and while it is rarely difficult it can be a lot of fun. Trolls are little more than fodder for Kameo's many powers and they are often dispensed in a gory and humorous manner. Some variations of trolls force gamers to get creative with their characters. It's pretty obvious how to get rid of enemies imbued with elemental powers but others have to be slammed into hazards or attacked with a specific enemy. Beating down Trolls is accomplished with the help of a meter that tracks combos, kills, and rate of attack. When Kameo completely fills this meter the game enters a slow motion mode where players are given free reign to beat down on enemies that move at a snail's pace. Taking on an army in this mode is incredibly satisfying and offers some of the most fun in the game.    Kameo isn't quite the epic adventure that I was hoping for. I was able to beat the game in just over eleven hours with a minimal focus on side quests and collectables. Returning to the adventure to tie up loose ends is made easier by the world's physical layout which starts players at a central hub and a magic mirror that lets Kameo return to any of her previous mission to try for a high score.      Another element that lengthens the experience is that each of Kameo's ten forms have around four to five combat upgrades that can be accessed by collecting hidden pieces of fruit. My first play through the game was rather rushed and I didn't come close to fully upgrading the cast. Replaying levels for a high score is a good idea but not necessarily very attractive after thoroughly exploring one of the zones. The joy of Kameo is mainly derived from solving puzzles so this dramatically cuts down on replay value.   The HD Era  The problem with rating the visuals of a next-generation title is the lack of a reference point. It's impossible to say how Kameo will rank graphically on Xbox 360 a year from now, but it intermittently delivers on satisfying our need for something that feels ~next-generation.~ There is an extremely high level of detail in the environments making the experience almost overwhelming in some areas. This is assuming that the game is being played on an HD screen with a 5.1 sound setup. The game still shines on a non-HD set but not nearly as bright because super hi-res texture and excellent particle effects are often lost in the blurriness.      Graphically the game also feels somewhat segmented. Many of the levels that were clearly designed around earlier consoles don't necessarily feel like they completely use the power of the new console aside from the textures. Other areas, like the massive battles on the Badlands, stand out because they are obviously only currently possible on 360. So if you take someone on a tour of the Enchanted Kingdom you'll likely hear praise for such eye-catching beauty while other areas just don't have as much of a ~next-gen~ aura about them. Of course all of this only matters in terms of bragging rights. If you want to discuss how the visuals work in conjunction with the gameplay then Kameo doesn't miss a beat.   The orchestral score for Kameo is a high caliber arrangement that enhances the atmosphere and often times makes the environments feel a lot more grand and sweeping than they actually are. The voice work is top notch, although Kameo is far less interesting than everyone in her surroundings. The small creatures that inhabit the Enchanted Kingdom and its surroundings have plenty of personality and usually have something entertaining to say if players choose to interact with everything possible. Kameo is a game that will last players weeks but not months. The core gameplay is intelligent and almost always fun with a few areas that boarder on frustrating. While the game isn't quite the Zelda killer that it's sometimes been touted as its still a fun adventure that will appeal to a broad audience. Each level is packed with examples of intelligent game design and at its best moments this game should be counted among the reasons to go out and get that new console everyone's been talking about.", "date": "Nov 15, 2005"}