{"name": "Tee Off Golf", "name_review": "Tee Off Golf", "ref": "https://www.ign.com/articles/2000/01/15/tee-off-golf-2", "text": "I'm not into golf. So, it's no big stretch of the imagination to assume that in general, I'm not into golf games. Coming into Tee Off Golf, I was determined not to have a good time -- But, being the fair and honest reviewer that I am, I gave it a fair shot (no pun intended). After logging some hours into the game, I can honestly tell you that while it may not be for everyone, this game certainly has its moments.  Is it as good as Hot Shots Golf? Maybe not, but it is definitely a fine addition to the goofy golf scene that has been all the rage in recent years. Despite the seemingly boring nature of pro golf, there are actually some really entertaining elements in Tee Off, thanks largely to the fact that the game is presented in such a wacky fashion. Tee Off Golf starts off with an eerily campy montage of the various characters, setting the tone for the entire experience. It may be a golf game, but Tee Off's anime roots are extremely central to the gameplay. This was definitely a conscious effort by Bottom Up to help endear gamers and further push away that ~boring~ stigma that seems to follow golf around. Their efforts paid off to a point, as the game's appeal has been broadened enough to reach younger gamers whose attention spans have yet to develop. On the other hand, even though I'm no golf expert, I can tell that some hardcore golfers may not get everything they're looking for, which is a bit unfortunate, but considering the nature of the game, somewhat expected.  If you can get by the opening sequence, you'll find that the gameplay is basic, charming, and somewhat addictive. You start out by selecting one of four characters (there's seven more that can be unlocked) and picking one of the game's play modes. There are several, but the meat of the gameplay boils down to World Tour. In it, you golf it out in five different courses: Japan, Australia, US, England, and South Africa. Your goal is to become the ultimate golfer, of course, but the points collected in this mode also go towards unlocking new characters, as well as special hidden golf gear.  All that is well and good, but one of the problems with the game is the decided lack of challenge. I know next to nothing about golf, and still had little trouble scoring consistent birdies after getting a feel for the gameplay system. True, I am a seasoned gamer -- Super human, if you will -- But I was expecting the basic mechanics to be a little more challenging. Actual golfing in Tee Off is your standard, tried and true three-tap meter. Tap once to start, tap again to determine power, and tap again to determine angle. The problem is that the meter moves almost ridiculously slow, making it very easy to tap at the optimal time. [Ed's note: Translation  even ~super human~ gamers like Matt can do well without much effort...].  Even though the decided lack of challenge to the action detracts from the single player experience, the overly-simplistic mechanics are actually one of the contributing factors to its addictiveness. It won't prove to be that hearty a challenge to defeat the CPU, but bettering yourself or other players is definitely a good time in the waiting, and, to its benefit, is an experience that lacks the micro management that slaughters the ~pop and play~ element of many golf games. Throw in the hyper-futuristic croquet action of the Gate Ball mode, and you've got enough variety and addictive action to last you a while.  Visually, Tee Off is colorful and charming. The game is based on a rich anime theme that, while definitely colorful, may alienate some people. Anime can be a good thing, but this game is almost too cartoony -- The huge heads and over-exaggerated facial expressions are all too central to the game, sometimes making it so completely gaudy as to turn off potential players. Regardless, every aspect of the game screams ~non-threatening~, ultimately bouncing along at a relaxed pace that, while at times annoying, if taken for what it is, becomes quite charming. In a purely technical sense, Tee Off is a mixed bag. While it's immediately recognizable as a 128-bit game, the various course layouts, textures, and abstract models such as trees seem to really lack much variety. Although there are various locale-specific landmarks, the courses, for the most part, look very much the same. While this doesn't really damage the experience, which is driven by addictive play mechanics, there is definitely room for improvement.  To wrap things up, Tee Off Golf is a fine effort and, as the only golf game currently available on Dreamcast, definitely worthy of checking out. While the decided lack of depth and challenge may turn off the hardcore golfers out there, the simplistic fun and extreme ~pop and play~-ness is definitely enough for casual gamers, as well as golf junkies who don't take themselves too seriously. If you're like me, and have no real interest in the sport, (video game or otherwise) you may want to proceed cautiously -- However, I truly think Tee Off has at least some amount of fun in store for just about anyone.  -- Matt White, Tee'd Off Contributor", "date": "Jan 15, 2000"}