{"name": "Earth 2160", "name_review": "Earth 2160", "ref": "https://www.ign.com/articles/2005/11/16/earth-2160", "text": "The Earth series has been popular throughout the years but has definitely had its ups and downs. The newest in the series, Earth 2160, is a great attempt at making a classically paced sci-fi RTS. Considering there hasn't really been much to choose from lately aside from Dawn of War, it's positioned well enough in the marketplace to be a surprise hit. But while the game survives on the merit of some creative design choices it sags because of a dull campaign and bad story telling.   The Earth series is actually based on a good enough premise that it's a little surprising how flat this latest installment feels. Basically, the Earth went spinning off into the sun and three factions managed to make it off alive and colonize the rest of the solar system. The Eurasian Dynasty, Lunar Corporation, and United Civilized States all went in search of greener pastures and ended up fighting over resources and power. This latest installment continues the story as the ED and LC fight over the same things and the UCS has disappeared from the system. In the course of slapping each other around over some research, the ED and LC dig a little too deep into the surface of mars and strike a well full aliens that pours out onto the planet. Meanwhile, rumors of Eden persist amongst the populace as both companies search for answers.    The newest plotline isn't an exercise in originality and it doesn't help that the story is presented with some horrifyingly bad voice-overs. Whether it's a ED hero that sounds like he's always drunk, LC heroine that sounds like she'd rather be in front of a mirror checking herself out, or nerdy scientist pining after said heroine, you won't find any impressive voice-over work in this game. When the story cutscenes interfere with gameplay by removing control of units causing one of your heroes to die and the mission to be lost, it's even more frustrating.   The sad part about this is that the actual factions themselves are excellently realized, which makes you wonder why the story makes them all seem so vapid. The three human based factions are a bit similar in some technologies but play differently enough that it's hard not to enjoy them. The base building alone is creative enough to win applause. Whether it's the modular bases of the ED with their sliding turrets, efficiently stacked LC buildings, or the slightly more traditional style of the UCS, these humans all provide very different challenges when laying out a base.   Units are also handled in an interesting way for each of the human factions, which has its strengths and drawbacks. Instead of creating specific faction based units, players research different technologies that they can then attach to different chassis allowing for a high number of possible units. This is great in theory, but there are some problems. The first problem is that a lot of the technologies are the same so aside from having different visuals, the units are very similar in what they do. Secondly, it's can really be a crapshoot as to how effective the types of armor and weapons you've placed on a unit will be in battle. Using the wrong types of technology can get your entire army destroyed in seconds or if you balance the types of armors and weapons, you'll soon have a ton of different types of units that are hard to separate in the heat of battle to fight against the right targets. All this is complicated even more by an interface that doesn't let you sort by chassis type or at least configure the list order when building new units. Still, battles can be very interesting in multiplayer matches as competitors use different technologies.    But the final faction sits above any of these others in terms of creativity, though it sits below them in micromanagement hell. The alien race spewing forth from the bowels of Mars are one of the best races I've seen in an RTS in quite some time. Instead of using materials to construct buildings, basic units can be cloned or upgraded into different types of units after they've absorbed enough resources. More advanced units can also absorb more resources to turn into bigger and better units. These turn into some of the most powerful units in the game to balance what can be crazy micromanagement of making sure units are absorbing resources and then turning them into different types of creatures. Still, even with this great mechanic, many of the units are very like their human counterparts. The diversity didn't quite make it past the cosmetic and into the functionality of units as much as I would have liked, but even so, what's in place here is pretty great.   If the campaign had been near as interesting as the factions that fill it out, Earth 2160 would have been more of a success. Unfortunately the insipid voice-overs and pedestrian plot aren't helped by creative or exciting missions. Four campaigns (one for each of the factions) manage to bring attack and destroy, defend, and corridor missions, most of which are paced towards inactivity. Yawns replace surprises as the predictable plot turns push the predictable gameplay. That's not to say that some of the missions aren't challenging. In fact, some of the missions are infuriating until you figure out the trick to beating them or bring out weapons powerful enough to run through enemy lines, it's just that they're not incredibly fun.    Thankfully, multiplayer doesn't have a lot of the same deficiencies of the campaign. Games are actually pretty fast paced once the units start rolling out of the hangars. My only real issue with multiplayer is that defenses are very, very powerful against everything but artillery. Tanks do little to no damage against defenses leaving little option to destroy enemy bases in later parts of the game should all resources be gone and no more artillery units be available. Otherwise, the action is usually very intense.   Oddly skirmish, which plays like multiplayer, has one noticeable absence. There is no free for all option meaning it'll be you against all on every map. The computer enemies won't attack each other at all and considering the aggressive nature of the AI, even on easy, games can be pretty challenging. I suppose there's nothing that will make you better like taking on multiple computers, but sometimes I'd rather have fun than be run down.   No matter how you decide to play, Earth 2160 has some sweet visuals. It takes advantage of many of the new features found in today's high end graphics engines. Units and buildings are detailed and wonderful to behold, especially Lunar Corporation tanks thanks to the awesome particle effects. Effects and lighting in general are sterling. Whether it's explosions, smoke trails, chemical spray, or energy off the engines, these are some very pretty effects. The only thing unimpressive about the visuals are the environment textures, which are pretty bland. Low lying fog and some base buildings help to keep interest, but much of the game's environments fairly lifeless... which I suppose isn't incredibly surprising given the nature of the other planets.Earth 2160 is an interesting case study for the successes and failures of the real-time strategy genre. On one had, it has amazing faction balance that include some awesome base building strategies and terrific tech tree. On the other hand, it has a campaign that simply plods along with a slow pace, lack of creativity in mission design, and a story that is fatiguing thanks in large part to some amusingly bad characters and horrible voice-overs.It recovers with some great multiplayer gameplay that lets the factions shine in their own right, but it's not enough to rocket these humans to the paradise where classic strategy games live forever. However, there's enough to like here that it's worth a purchase to those looking for classically styled RTS gaming in a sci-fi setting.", "date": "Nov 16, 2005"}