{"name": "Vijay Singh Pro Golf 2005", "name_review": "Vijay Singh Pro Golf 2005 3D", "ref": "https://www.ign.com/articles/2005/11/16/vijay-singh-pro-golf-2005-3d", "text": "Gameloft has a nice side industry going on where they take their successful 2D games and release smart-looking 3D editions of them. They don't necessarily offer many new game play elements, but they most certainly don't break anything, either. Refinement is more at work in these updates -- and that's definitely the case in Vijay Singh Pro Golf 2005 3D, newly launched on Verizon's V CAST service.   Vijay Singh Pro Golf 2005 3D offers two 18-hole courses: Harbor Town and Freewater Creek. Harbor Town offers a reasonable challenge, giving you several holes to really get the ropes. The controls are fairly easy to get a handle on. Regular swings are handled with a system of two meters: power and accuracy. At the start of a shot, you power up the meter and stop it depending on how much oomph you want behind the ball. A red thatch on the meter details exactly where to hit if you want to ball to go as far as you designated it before the shot.   Once nailing the appropriate power, you have to work an accuracy meter. The meter starts to fill, and you need to hit it perfectly in the center for a dead-on shot. Any to the left or right of center, and you're stuck with a hook or slice. I found the meters to be extremely responsive, and I like the speed at which they fill and empty.    Golf games, however, are all about nuance. You have to always take the wind into consideration before blasting your shot. An on-screen icon shows the direction of the wind as well as the speed. While the ball is in the air, you can also give it a little english by pressing either 2, 4, 6, or 8.   One of the big benefits of the 3D in a golf game is that you can really scope out the course before your shot. Using the 0 and # keys, you can swing the camera around the fairway and gather some a nice pre-shot intel. These angles also let you really appreciate the care that went into course construction. Hazards are deviously laid out to ensnare players that don't practice up on nailing the meters and taking the elements into consideration. That, and they just look cool. The crane shot where the camera sweeps above the fairway is particularly slick.   Vijay Singh Pro Golf 2005 3D offers quite a bit of value. Don't let the low number of available courses fool you into thinking Vijay Singh Pro Golf 2005 3D can be burned in an afternoon. If you want to succeed, you're going to need to practice. Fortunately, the game offers a free hole for getting your game together before entering a tournament -- and that's where the real fun starts. While playing in a tourney, you can earn money by winning holes are performing specific tasks, such as blasting the ball a certain distance in front of ~the sponsors.~ With your earnings, you can further customize your career character. When not playing in a tourney, you can play through a course just for fun as Vijay himself.    Vijay Singh Pro Golf 2005 3D has some serious production values that don't necessarily affect game play, but they definitely enhance the experience. The 3D engine is pretty smart. Players aren't necessarily constructed of many polys; it seems the majority of geometry was saved for the course itself. The player animations are great, especially the little jump and jig Vijay does when hitting a perfect shot. Vijay Singh Pro Golf 2005 3Dopens with a pleasant little melody before giving way to in-game sound effects, like the swing of a club, the ~thwack~ of hitting the ball, or the simple call of birds while you survey the course. Top notch.  There are very few sure things in the world, but finding great satisfaction while playing a Gameloft game is definitely starting to look like one. Vijay Singh Pro Golf 2005 3D is a superlative golf game not only because of its exquisite production values, but because it has solid control, good course design, and a meaty career mode. If you have any interest in mobile golf, either version of Gameloft's golfer will fill the bill, but Vijay Singh Pro Golf 2005 3D is just another reason why, if you're serious about mobile gaming, you should look into upgrading your handset.", "date": "Nov 16, 2005"}