{"name": "The Legend of Heroes: A Tear of Vermillion", "name_review": "The Legend of Heroes", "ref": "https://www.ign.com/articles/2005/11/17/the-legend-of-heroes", "text": "While Bandai's The Legend of Heroes: A Tear of Vermillion may represent the PSP's first dip into the conventional Japanese RPG genre, it's hardly a new experience worth getting excited over. In fact, The Legend of Heroes was a tale told years ago by an unremarkable franchise that never made a fantastic North American splash. And this one's gameplay is actually just an amalgamation of several other aged J-RPG mechanics.  The Legend of Heroes follows Avin, a young would-be adventurer who grows up and journeys to find his lost sister, Eimelle. The two children parted after their cathedral was raided by zealots pledged to an opposing god. While separation and a quest to reunite two siblings bound to the same destiny seems interesting enough, The Legend of Heroes simply fails to deliver.  The first major problem is one of pacing. The initial four hours of this 30 some odd hour adventure will be spent doing little more than running around on errands and occasionally battling most pathetic monsters. When the game ultimately does pick up in the final two chapters, it funnels players back into the earlier environments, giving The Legend of heroes a remarkable sense of dj vu. Conversations, too, have a tendency to loop as characters will shuffle about acknowledging talks they've just had, while also reiterating major plot points. In terms of direction, Legend of Heroes suffers from explaining too much, too often. At times the conversations feel like they're being slowly ripped out of unwilling participants word after word, even though what is going to be said is plainly obvious.   Because of the slowly paced development, bogged down by unnecessary talks, it was hard for us to get behind the sudden mood swings of our hero Avin or fall into the dutiful role of Mile the sidekick and his deep longing for friendship. It didn't help that The Legend of Heroes' localization was wrought with a number of grammatical errors and Japanese to English quirks we'd expect from games translated decades ago.  These pacing issues also carry over to portability.   Talkative Room  Despite some odd collision detection and an imprecise control scheme, The Legend of Heroes won't cause nausea on busses or trains. Sprites laid atop plainly decorated polygonal backgrounds -- with portraits that slide in to represent major characters during conversations -- are simple, bright, clean and easy to digest. Likewise, the clearly contrasted blocks of text and an easy-on-the-eyes menu make for one smoothly rounded, if technically limited game. But Legends is, by nature, still not very potable. Lengthy quests and even longer in-between development sequences are typical of classic console RPGs, but for the gamer on the go who plays in spurts, The Legend of Heroes won't fare very well. And all this in spite of the game's considerate inclusion of a history tracker that tidily stores the latest happenings so players won't ever get lost.  We didn't have quite as many issues with the battles. The chance encounters spread throughout The Legend of Heroes aren't as spontaneous as some other Japanese RPGs and can often be avoided thanks to visible enemy parties (the weaker ones will even flee before a mightier hero). When in battle, the game zooms to a simple combat field representative of the player's immediate surroundings. Heroes and foes line up on opposite sides of the engagement, but it's not an RPG that disallows movement. Legend of Heroes falls somewhere between a basic turn-based RPG with rows of immobile combatants and a turn-based, grid-driven one with a deeper layer of strategy.   When on the field, players and enemies take turns attacking, casting magic, using items, initiating deadly assaults, utilizing specific skills, waiting, fleeing, or even suffering through the unpredictable whims of a satisfied or upset pet. All actions have ranges, but movement is a direct result of another action and not really a strategic choice in and of itself. By not binding characters to a grid and allowing them that greater degree of freedom when it comes to positioning on wildly differing terrains,  The Legend of Heroes diminishes the overall level of strategy it could have offered and instead focuses on the easier to grasp but harder to enjoy target prioritization systems.   It's just not difficult to identify a threat and group attacks or apply character bonuses and items to counter that threat. Without having to worry about the extra level of strategic depth that comes from positioning, there is little challenge here. This, in part, helps make the game incredibly easy. And because of that, as well as the poor conversations and reused locales, The Legend of Heroes doesn't wind up being very rewarding.  What The Legend of Heroes: A Tear of Vermillion is, however, is the only real game in town. Knowing that, and recognizing that Legend is still years old and marred by many of the most basic problems associated with the genre, is it good enough...?...Simply, no. I don't believe The Legend of Heroes is good enough to warrant an unthinking purchase by avid RPG fans. There are too many issues here I cannot bring myself to look past or over. Slow pacing, tedious backtracking, inane minor quests, problematic controls, and unfulfilling combat combine to make one very non-portable title that has too many problems to ignore, even if this is the only game in town.", "date": "Nov 17, 2005"}