{"name": "Diplomacy", "name_review": "Diplomacy", "ref": "https://www.ign.com/articles/2005/11/17/diplomacy", "text": "Though it hasn't always been easy to find players, I've been a fan of the board game Diplomacy for years and years. Getting six other folks interested enough to gather together and take part in this game of strategy and negotiation is almost as difficult as finding six people who've read Guns of August. As with so many other board games, Diplomacy's presence on the PC promised to offer a ready online forum for multiplayer games and an offline option against the AI.  Six years ago, Hasbro released a PC version of Diplomacy that was uninspired, managing to reproduce the mechanics of the game without ever really capturing the essence of human interactions that separate Diplomacy from more mechanical games like chess or checkers. Now Paradox Interactive has released a new version of Diplomacy for the PC. Though it manages to offer a more polished presentation, the overall weakness of the AI and the inconsistency in the multiplayer interface keep the game far short of an attractive alternative to the board game.   If you're not familiar with it, the basics of Diplomacy are relatively easy to grasp. Seven players each take charge of a European power in the Spring of 1901. Maneuvering fleets and armies across a map of Europe, each player tries to occupy supply centers that will entitle him or her to maintain more armies and fleets. The units all have the same strength so you'll have to have the support of adjacent units if you hope to dislodge your enemies.  In between turns, you can negotiate with the other players, offering and requesting tactical maneuvers that are beneficial to you both. None of the negotiations are binding however, which is where the game reveals most of its excitement. Players will need to rely on each other to advance in the game but everyone is ultimately out for their own best interest. Like the TV show Survivor, your allies' success eventually becomes a threat to your own hopes of victory. Knowing who to trust and just when to turn against them is key to winning (and enjoying) the game.  For a PC version of Diplomacy to succeed, it needs to present either a solid AI or a slick multiplayer interface. Paradox Interactive's version fails miserably on both counts. The AI here isn't going to present much of a challenge to even inexperienced Diplomacy players. I've beaten the game again and again without breaking a sweat. Even when playing the oft-beleaguered Italians, you'll find that you can still win without making any diplomatic deals at all, what veteran Diplomacy players call ~gunboat~ style.  Diplomacy is a game of decisions rather than dice, so the psychological elements are key to recreating the experience. Like some recent poker video games, you'll find that the simulation of personality and behavior is relatively good here but still no substitute for face-to-face human interaction. Even so, the developers have done a good job of creating AI personalities that are willing to offer (and break) deals with you on their own initiative. Sometimes it's hard to see the logic in an opponent's decision but at least they're taking an active role in the game.  Your opponents are represented as a variety of 3D characters. Though each avatar has a unique, stylized appearance, the expressions they run through in response to actions on the map are relatively limited and generic. When attacked, they'll simply pop up, make a bizarre grunting sound and disappear. The responses get monotonous after a while, completely killing any sense of personality or life in your opponents.  The interface for crafting proposals is convenient and uses icons so players who speak different languages can still cooperate. Unfortunately, the interface doesn't allow the AI to tell you why they're rejecting a given suggestion. All you'll know is that they didn't think your idea was so hot. The same problem holds true in multiplayer. In the absence of any sort of private chat channels, you'll find it hard to figure out why your opponent likes or hates a particular strategy.      And though your own moves are clearly laid out on the board, the camera jumps around so much during the resolution phase that it can sometimes be hard to tell just what's happening. Pieces are sliding around but the camera cuts back and forth so quickly (and changes angles as well) that it's easy to get confused. While this is only mildly annoying, what's really aggravating is that the game doesn't tell you why certain moves fail. While it's easy to puzzle out most of the time, there are occasions where support gets cut in a non-obvious way.  Unfortunately, the game's online play really stinks. Gaining access to the metaserver is more complicated than it should be for one thing. The patch required to play online isn't even located on the download page. Instead you'll have to hunt it down in a post on the paradoxplaza.com message forums. That a developer would hide a patch in this way just boggles the mind.   If you do manage to get access to the metaserver, you're not likely to find many opponents. Even when you do, there's no guarantee that you'll be able to join their games. We've tried several times to make this work and eventually just gave up out of frustration. I know some people have been able to play; I see the results of their matches on the ladders. But assuming you can get online and join games, there simply aren't enough people playing this game right now to make it worth your while.  Why is this the online option for online play? Diplomacy would work great in hotseat and PBEM formats but they're simply not included here. It makes you wonder if the people who designed this game actually played the board game or simply designed the whole thing from the ground up based solely on the rules they found in the manual.  Strangely, Diplomacy requires a 32MB video card. The game board is certainly attractive but the slightly rippling waters of the Mediterranean don't do much to bring the board alive. Even on systems with 256MB cards, the scrolling and panning is very rough and jerky.The original board game is magnificent but even the strength of the basic design can't redeem the PC version's shoddy AI and thoroughly inconvenient multiplayer experience. While it's unrealistic to think that an AI opponent will offer the same level of personality and challenge you'd get from a human, the victories in Diplomacy are pretty much guaranteed.  I'd love to have seen more variety in terms of multiplayer options. Hotseat modes and PBEM options would definitely be welcome. Short of that though, it would be nice if the game's current multiplayer options actually worked.", "date": "Nov 17, 2005"}