{"name": "Condemned", "name_review": "Condemned: Criminal Origins", "ref": "https://www.ign.com/articles/2005/11/18/condemned-criminal-origins-2", "text": "When you were in elementary school, didn't you at least once fantasize about what hitting someone with that gigantic razor on the paper cutter would do? Of course you did. Well, thanks to Monolith Productions Condemned: Criminal Origins, you can actually live out that fantasy as well as do the world a favor by brutally ridding it of drug addicts and their pesky homeless cohorts. This game is dark, it looks great, the sound is insane, it's got an engaging melee combat system, and it's one of the scariest games I've ever played. Even though the game's level progression and puzzles are extremely linear, you'll have a hard time being disappointed by this one. That is, unless you've got a severe aversion to ramming your head into the pulpy face of a grotesque sledgehammer-wielding sewer-dweller.   You play as Agent Ethan Thomas, an F.B.I. agent assigned to the Serial Crimes Unit. As such, you spend your time tracking down serial killers. Though you've had much success in the past, your most recent cases have all gone cold. The game opens as you investigate a grisly murder scene set up by a killer known as the Match Maker. Soon after you arrive, strange things begin to happen around you, and you'll suddenly find yourself framed for the murder of two F.B.I. agents. Your only option is to track down the real killer and clear your name.   Pretty much everyone in Condemned wants to hurt you, badly. It's a pretty standard set up, but circumstances quickly get much stranger and more sinister than they'd initially seemed. Throughout your quest you'll be in regular contact with Rosa, an agent with the bureau that still trusts you and processes the forensic data you collect and send back to her. You'll also get calls from a few other characters, in addition to being prone to the occasional lapse in sanity and frequent premonitions. As you continue on your increasingly surreal quest across 10 levels to bring down a serial killer and undo the source of evil that's sending those around you into murderous frenzies, you'll gain access to some crude and vicious weaponry and probably scream out loud a few times. I know I did.   Though there are a few guns scattered around Condemned's dilapidated levels like sawed-offs, pistols, and eventually SMGs and rifles, its way more fun to avoid them. If you do pick one up, you'll find there's rarely enough ammo to take out two or three enemies anyway, so why bother? Besides, what's the fun of shooting someone if you can hit them with a taser, steal the piece of bent rebar they're carrying, kick them and then while they're stumbling bring the rebar crashing into the side of their neck with a revolting, squishy thud.   Especially this guy. Melee combat and exploration are the heart of Condemned's gameplay, and both work very well. The melee system is responsive and lets you deliver blows without flaw. You and your enemies are able to block attacks, which opens up an opportunity to counterattack. You can't just hold your weapon up to block, either, you'll need to time it according to when your enemy's swing will hit you, so there's actually some depth here. Combining your kick, taser, and weapon effectively is a decidedly entertaining experience and the responsive controls help to more accurately give you the feeling that you're actually beating your grimy opponents senseless.     You'll have to take into account each weapon's speed, block, damage, and reach when choosing one from the environment. Pipes and pieces of wood are always lying around, and there are also some weapons unique to certain levels, like fire pokers, locker doors, meat cleavers, and my personal favorite, the paper cutter blade. You'll find the best weapons are the ones with medium damage and medium speed, like the cutter blade, gas valves, or sticks you find later on in the game, since they're the best balance between damage and responsiveness. Some of the heavier weapons like the sledgehammer and fire axe take a long time to swing around and don't respond immediately when you go to block. This makes sense, since you're hoisting up heavier objects. The variety of weapons is great fun, though, especially since when you tear a valve or conduit off the wall it actually affects the environment by bending pipes, blowing steam, and shorting out power.   The way weapons are acquired and used contributes to this game's strongest asset: atmosphere. Condemned is a game that when you play, you fear for your actual life. Well, maybe not, but it's a certainty that this game will worm its way into your dreams, for better or worse. Much of what pulls you into the game world so effectively is the first person perspective. When you swing a weapon, you'll see a slight motion blur trail behind it. When you're hit by an enemy, your vision will distort and blood will splatter across the screen. Sometimes you're hit from off-screen and the game will stay in a first-person perspective as you tumble down an escalator or plummet through a shoddy floor, really giving you the sense that you are Agent Thomas.   This guy is friendly. Oh wait, no, he wants to kill you. Finishing moves are the most shocking example of the first person perspective being implemented effectively. When you beat an enemy close to death, they will occasionally drop to their knees and wobble dazedly. If you approach them, an icon of your D-Pad pops up in the bottom left hand corner of the screen. Each direction corresponds to a method of dealing the killing blow. You can snap their necks, pound their heads into the floor, deal a wicked punch, or deliver a thunderous headbutt. Though this element doesn't really factor into gameplay, it's an amazing immersive tool.   During each killing sequence you never leave the first person perspective, so you'll zoom right in with Agent Thomas as he rockets his forehead toward theirs for a fatal crack. Right before you snap their necks or loose a finishing punch, you'll be able to see every detail of your opponent's face. They'll look you right in the eyes and you'll be able to make out the damage that you inflicted on them. To a gamer like myself who's consumed many forms of ultra-violent media, it still caused me to wince and turn away. It's really a horrific, excessive effect, and it's great.   Sucker! The excellent surround sound factors in to a huge degree as well. Through each level in the game you'll usually be able to hear your enemies before you actually engage them. Their positions are given away by the click of a piece of metal they knocked over, the clunk of a barrel, the crunching of debris they tripped on, a hoarse grunt or a curse word. The effect of this sound, especially on a 5.1 surround setup, is so powerful it might make you bite your tongue in apprehension of the coming battle. The sounds of the weapon impacts are downright sickening. You'll be especially disgusted with the popping of necks and the wet crack of your forehead against your downed opponents when you pull off a finishing move. It may be gross, but it goes a long way towards hooking you into the game world, and is another reason why this game is so much fun to play.     Given how dark the game is, the importance of paying attention to sound is intensified even more. Your flashlight, which you should constantly have switched on and thankfully does not run out of batteries, only lights up small sections of passages in front of you. In the darker areas of the game, you'll be using the sound as much as you will your cone of light to locate enemy positions. Since you'll need to use your sight and your hearing to survive in Condemned, you're going to be paying much closer attention, and therefore be absorbed into the gameplay to that much of a greater degree.   Throughout the game you'll also find that music will play over the occasional sequences. It's usually a collection of moaning strings with metallic sounding drums and will frequently cause your spine to rattle with nervous tension. In one level that takes place in a department store, you'll be treated to the creepiest rendition of Deck the Halls you've ever heard. Combined with the tooth shattering ambient clinks and clanks, the hushed pants of awaiting enemies, footsteps in the darkness beyond you, and the sharply realistic grunts and yelps of pain that accompany the battles, Condemned's sound is it's most frightening aspect. A few effects in particular, like one scratching effect that repeats throughout the game and a laugh you'll hear later on, are so unsettling they'll make you want to immediately shut off the television and leave the room.   Fear the grain filter. One aspect of the sound that isn't so stellar is the voice acting. There are frequent cut-scenes in Condemned and even more frequent cell phone calls. The character voices during all of these sequences are just on the border of being good and being cheesy, which is too bad given how great the grunts and yelps of battle are. As a side note, I had a hard time trying to figure out why Agent Thomas was willing to have loud cell phone conversations in such close proximity to people that were looking to break his body into pieces.   Condemned is a very linear game. Though there are twisting hallways and you'll frequently get disoriented because of the dark and your lack of a map, there's always one way in, one way out, and one way to get through. Though the levels are filled with an impressive amount of detail and feature excellent textures, many of the early levels look and feel exactly the same. It's not until you get to the shopping mall that the settings begin to differentiate. Even then, many areas of the mall and levels afterward look very similar in spots, though there are distinct sections among the levels. After playing, you'll have a hard time forgetting areas like the swimming pool, meat locker, and microfiche vaults. Through the entire game you'll always be limited to corridors and closed spaces. There's no wandering around expansive environments in Condemned, it's just a progression of self-contained levels.   Another rough day at the office. There will be points in every level where you'll need a specific weapon to advance. Sledgehammers break locks, fire axes smash doors, shovels slice open fences, and crowbars pry open safes and boxes. Consequently, every time you find an axe or a sledgehammer lying around, you're going to have to use it sometime soon. This comes off as slightly artificial, but not as much as the investigative sequences. You may have heard of the forensic investigation elements of the game, but they don't really count as gameplay, they're more like interactive story sequences. This was disappointing, since being able to use your forensic tools at any time to pick up clues and solve crimes on your own seems like a great idea, especially when mixed with the visceral combat elements already present.     Unfortunately, you're always told when to pull out your forensic tools and it's predetermined which tool you're going to use. It's still cool in some of the sequences to uncover evidence that leads to the confirmation of certain facts, but it would have been way better if you were free to search around on your own accord instead of having to follow someone else's rules. The game even goes so far as to include directional arrows on your tools that point to exactly where you need to look. Even though you can only pull out certain tools in certain areas, they're still neat tools and produce cool graphical effects. You'll get UV and laser lights, a digital camera, a 3D scanner, a Gas Spectrometer and a Sampler. How exactly they're able to transmit data to Rosa so fast is unknown, but it can be ignored for the sake of making the game playable. Nobody wants to play a game where you need to wait two to three days for express shipping every time you find a new bit of evidence.   The graphics can be described as filthy, cluttered, grimy and jarringly revolting in a gorgeous sort of way. This is definitely one of the best looking titles launching with the Xbox 360, even if every character has a plastic sheen over their faces and clothing. The environments are gritty and packed with content, the smoke and fire effects are very impressive, and the lighting is disturbingly accurate. If you slap around a light fixture it will sway realistically, sending its light careening around the room which is particularly frightening if you're being charged by a manic with a crowbar.   Here's what really happens when you don't pay to use the subway. Aside from excellent texture work and level of detail, the enemy animations are really what stand out visually. Addicts and some of the creepier beings you meet later on move with a disturbing fluidity that will have you slamming feverishly on the right trigger to bash them in their faces. If you knock an enemy's weapon out of their hands, they'll frantically look around as if they were genuinely panicked  and acutely concerned that they'd no longer be able to kill you as brutally as they wanted to. At other times, enemies will spit blood out of their mouths when you've hit them in the face. If it wasn't already obvious, your enemies in Condemned want you to die very, very badly, which is another reason the game is so frightening. They charge at you with a shocking amount of ferocity reflected by the way they eagerly swing their weapons. Some of the later enemies approach you by crawling across the floor like some sort of jittery lizards, so you'll definitely want to use the bathroom before loading this title up.   There are also special graphical effects that accompany your breaks in sanity. When you're about to have a psychotic episode or premonition, the screen will be blanketed in a grain filter. You'll soon after suffer from hallucinations and see shadows and strange shapes of characters flitting just beyond the periphery of your vision, much like in F.E.A.R. for the PC. You'll need to stay alert in these sequences since in some of them you're attacked by grotesque foes that can deal actual damage to you. The hallucinations are yet another example of how this game is able to draw you in and scare the crap out of you.   Now is probably a good time to duck Not only do enemies move in a highly realistic fashion, they also behave intelligently. They'll run away from you at times and hide behind walls, then pop out and bust you up as soon as you approach. Occasionally they'll even completely run away from you so you won't know where they are, then pop out at the most unexpected times. Enemies are also capable of attacking each other, and you can actually use this to your advantage. By the last level, it becomes almost necessary to get enemies to hit each other in order to survive.     After you're done with the 10 levels, you'll have put around ten hours into the game. Condemned has a total of fifty X360 Achievements you can earn, including bonuses for finding hidden birds, completing each level, completing the game while fulfilling certain conditions, and restricting yourself to only melee weapons. There are also some hidden X360 units in the game with a Condemned: Criminal Origins faceplates, not that you can actually play them. Once you've earned the Achievements you can go back into the game's main menu and access special character art and development videos. Beyond the 10 missions, though, there isn't much content here. Of course, you could always go back through to earn the achievements you missed or work to improve your standings on the leaderboards, but the gameplay is limited to the single player campaign.   Don't worry, there aren't any shaving sequences. We did notice a few bugs in the game. At one point later on a few enemies seemed to get stuck on a ledge and not be able to advance. At others, fallen enemies would slide around like they'd landed on an oil slick. Overall, though, the game was solid, and none of these bugs detracted from the gameplay. If available, you'll definitely want to run this title in HD and with a surround sound setup to get the full experience, especially the surround sound. On a regular 4:3 television this game is still going to look really good, but you're not going to get all the grisly detail that pulls you into Condemned's game world so effectively. After all, where's the fun in headbutting someone if you can't see the blood that's pooling in the corners of their eyes.Condemned: Criminal Origins isn't a long game and it only has one game mode, but it's an unforgettable experience. At no point in the game will you be calm or feel comfortable, and that's the best part about it. Even if you're squeamish, be sure to play this at least once at night with all the lights off and by yourself and you'll understand just how frightening it really is. The graphics, animations, enemy behavior, and utterly unnerving sound make this is easily one of the most immersive and atmospheric games I've ever played. I honestly yelled out loud at certain points, and was getting goosebumps on a regular basis. Though the forensic investigation sequences and level designs are almost painfully straightforward, the game manages to excel despite them. If you're looking for one of the Xbox 360's most unique and thoroughly disturbing titles at launch or you're a fan of any kind of horror media, you should definitely pick this up.", "date": "Nov 18, 2005"}