{"name": "King Kong", "name_review": "King Kong", "ref": "https://www.ign.com/articles/2005/11/18/king-kong-2", "text": "The movie ~King Kong~ is currently alleged to be three hours, which is about how long it will take most gamers to play through King Kong the mobile game, unleashed this week from master mobile maker Gameloft. It raises an interesting question about game length and value -- if a game lasts only a couple hours, but provides wall-to-wall play, is that better than a title that features ten hours of decent action?    After playing through this most excellent King Kong, I'm apt to wonder if short and sweet isn't preferable.    Much like the ballyhooed mechanic of Ubisoft's King Kong video game for everything from the DS to the 360 to the Vectrex, King Kong for mobile lets you play as both human Jack Driscoll and King Kong. Over the nine levels, you will see the jungles of Skull Island and the skyscrapers of New York City. To be quite honest, I preferred the visceral thrills of the Kong levels over the Driscoll sequences -- but who wouldn't want to control a beast that can tear open a dinosaur's maw with the single press of a button?   The Driscoll sequences remind me of the adventure games in Gameloft's Prince of Persia series. There is some puzzle-solving by means of platforming. There are switches to be pressed, which open up parts of the ancient ruins on the island. You'll swing from vines like Taito's old Jungle Hero game and shoot blow darts at avenging natives that are displeased with your trespassing. These levels are fun in their own right -- Gameloft has this kind of game down to an absolute science without it feeling like as mechanical as a science class -- but when you know that the ability to play as Kong is out there, you definitely want to hurry through them.   When you do get to play as the big guy, King Kong really explodes on the small screen. The gorilla has screen presence, that's for damn sure. I've played the game on the Xbox 360 this week, and even though Gameloft's game diminishes him in size, they cannot contain his, uh, animal charisma. The move Kong moves is organic, with his massive lope as he charges a dino target.   Fighting off dinosaurs with Kong is a gasser, especially when you can unlock Kong's rage attacks. When he gets mad, dinos die. And they die gruesome deaths, such as getting their mouths torn asunder or choked out and then smashed to the ground. Once off of the island and in New York, the fish out of water stuff kicks in. Here's something primal, tearing apart police cars. And when Kong scales the buildings, leading up to the inevitable conclusion -- there's actually a wisp of regret in the air. Not too many mobile games inspire emotional attachment, but King Kong does on its own scale.   As expected with a Gameloft game, King Kong controls fantastically. It could be said that the game offers a little too much help on this front, but I can appreciate Gameloft wanting the game to be accessible to any age of gamer standing in line for the movie. King Kong is also one of the few mobile games where you want to turn the sound up. The music is quite good and the sound effects are exquisitely sampled.  King Kong is an excellent companion to the upcoming film, as it smartly tells the story, but gives you full control over the proceedings -- unless you count the game's drive toward the predestined ending. Playing as Kong is a delight, watching his beastly moves destroy dinosaurs with seemingly so little effort. Even the human sequences are good, even if they feel a little like a Persia game. (There are worse games to be reminded of while playing...) However, it must be said that King Kong is a bit short. I didn't exactly mind, as I don't mind console games that last eight hours -- but provide eight incredible hours of game play, like Sony's God of War, which I paid full-price for. King Kong is one of those rare example of short games worth their admission price, as the Kong segments offer a level of action fun not often found in mobile games.", "date": "Nov 18, 2005"}