{"name": "Quake 4", "name_review": "Quake 4", "ref": "https://www.ign.com/articles/2005/11/22/quake-4", "text": "Over the years id Software has grown into the fattest cat in town. Originally a small, hungry Texas developer whose games were first distributed through shareware, id then pioneered the first-person shooter genre and has moved on to become one of the industry's most commanding developmental forces. Anyway you look at it, id now sits real pretty right now.   The company's Quake 4 comes on the heels of 2005's Doom 3, which wowed gamers with atmosphere and technology over simple shooter gameplay. The funny thing about Doom 3 was that, if you had played the original Doom games, you would have re-discovered something: it played a lot like its predecessors. So, even if it disappointed many hardcore gamers because the gameplay wasn't terribly new, it was still undeniably gorgeous and atmospheric.   On many levels, Quake 4 demonstrates Id's, and long-time development partner, Raven's, all-too-comfortable position in the industry. (Id is the executive developer on Quake while Raven is the actual developer.) Quake 4 doesn't show off either company's brilliance as a level design powerhouse, and it proves that the once young and hungry company is growing older and more conservative in its approach to games. The fourth title in the series won't wow you with stunning AI or a brilliant narrative. The gameplay itself is fundamental run-and-gun shooting. But it will hammer home an undisputable first-person mechanic, smooth and fast on Xbox 360, upon which a blood-spattered, Starship Troopers-style adventure turns horrific, brutally fleshy, and ultimately more rewarding than not. I admit, I experienced genuinely thrilling moments over about 11 hours of play. That said, Quake 4 didn't provide me with a new next-generation experience. It gave me a comfortable, familiar and well-rounded game that I ultimately liked despite its problems.   Revving the Doom Engine Quake 4 immediately woos your graphic sensibilities. The Doom engine re-emerges to take advantage of Xbox 360's power with superb lighting systems, corrosive industrial environments and generally smooth framerates. While id's character design leaves much to be desired -- there seems to be four basic marine models mixed and matched with minimal changes -- one cannot deny the engine's technical diligence. Walking up close to a marine, his eyes will track you. You can see newly shaved hair stubble on the back of his head, and the motion capture work has helped make a more fluid moving set of characters. The normal mapping gives everyone that distinct shiny leathery texture, which is a little unsettling, yet there are enough minor touches that are convincing.    QUAKE 4 Guide    Don't stand there quaking. Read our complete guide. Get the guide now!  The lighting is fabulous, just like Doom 3. Unlike its brethren, Quake 4 enables players to strap a flashlight on a few guns, and it illuminates the dark industrial corridors with bright, clean light that casts perfectly clean shadows upon objects, characters, and monsters. The crispness is easily seen in 480p, but it sharpens into fine lines in 720p and 1080i, where it's preferable. The lighting is less noticeable outside, where most sections are less than impressive. In the PC version of Doom 3, a few choice-looking outside areas were striking. In Quake 4, the Strogg planet surfaces are empty, dustless, and strangely sanitary. To make matters less appealing, the sky and the background imagery don't fit into the game; instead they look like unfinished artwork, dull and out of place. I know it's a background shot, and that it's supposed to be a long ways away, but it could at least be a little more convincing.   In many respects the Xbox 360 version stand toe-to-toe with the PC version. It comes in cleaner in a few areas, but gets a little framey in some of the later missions. In both versions, you'll notice that on the one hand the anti-aliasing keeps jaggies down to a minimum and that most objects and characters show off a sense of realism and curvilinear design. On the other hand, while the marines are razor sharp, the aliasing shows up worst along the perimeter of their bodies and heads. Even in the intro trailers, you can see these errors. Does this ruin the game? No. Does it displace your sense of immersion and look imperfect. Yes.    What you'll really notice about the game's visuals and presentation, however, are how flagrantly gory they are. I'm not moralizing about this. I don't mind the gore at all; In fact, I like it, having grown up with movies such as Jaws and The Shining. But Raven and id have gone out of their ways to take a drill into your mind and fill it with freaky, nightmarish scenes of mutilation of the most inhumane kind. And it's there, in this horrific dehumanization that's so bloodily displayed, that the game makes its stand in both graphics and in narrative.      An Actual Story Raven and id aren't known for their game storylines, having relied on excellent gameplay and cutting edge technology to make their millions. All of the original Doom games were so void of storylines in the fullest sense that it was almost comical: Marine enters freakish warp hole to hell and fights everything. The end. The Quake series also flourished without a story. While Quake 4 is Raven's best narrative yet -- and its only real genuine attempt at one -- it's far from the high-quality narratives found in The Chronicles of Riddick: Escape from Butcher Bay or Half-Life 2.   What makes the generally mild, even common story interesting has entirely to do with the Strogg. Much in the way that Starship Troopers the movie created a sense of fear and tension around the horrible ways one could die while captured by or fighting the bug-eyed aliens, Quake 4 develops empathy and humanity in the face of the brutal, nightmarish practices of the Strogg. You start off as Matthew Kane, a marine with a mysterious but wide-spread reputation, and together with a band of marines, your dropship crash lands on the Strogg's planet, you establish a base and then work to take them out entirely. As you progress you'll see the enemy brutally slay your squad, which die one by one.    Small spoiler ahead: After you're captured and go through the transformation process yourself, you'll realize how awful, dingy and inhumane the Strogg really are. Raven puts you through the hideous surgery from a first-person perspective -- and you'll feel it, wincing and cringing all the way through. Every part of your body is massacred, re-built, and strewn together like hamburger into a bio-weapon killing machine.  Soon thereafter, once a certain member of your party is captured and transformed, the bond process is complete: you'll genuinely want to keep your guys alive and you'll fight for them. This is the crux of the story. While the dialog isn't bad, the narrative is based on a rudimentary military, so its mechanistic and predictable. You will, however, find out a lot more about how the Strogg's freaky bio-mechanical world operates as you pass through layer after layer of industrial technology, and the cast of enemy characters grows significantly. Raven has done a workman-like job of providing a limited amount of dialog for the soldiers in your squad, and once you're transformed, particular guys will throw insults at you. The reaction to your change is well done in this way. Some guys just look and you and go about their business. Others actually analyze the hardware build into your system, while others either stare suspiciously or come right out and question your allegiance. Once you see the change, you'll understand their feelings.   The Meat of the Game Along with an actual story there is an actual single-player game. It isn't just filler and it's not just mindless fragging. OK, there is a lot of mindless fragging, but it's different than in any other Quake game before it. The single-player campaign is relatively long at about 11 hours, comprising of a wide variety of levels. The game structure is organized much like Doom 3: You can save at any point. They saves are organized weirdly, so you'll have to look for the latest save in amongst the list, instead of instantly pulling from the latest one. It's more odd than annoying.   The interior levels are, not so surprisingly, a lot like Doom 3. If you walked up to a friend playing it, you seriously wouldn't know the difference in several portions of the game. The Strogg levels are a little visually different, and it's refreshing to get outside and enjoy the scenery. A nice little touch is how you replenish health and armor. While a regular marine, medics and engineers will inject you with serum or add to your armor, if depleted. This isn't new for the genre, but it's a cool touch and it's one more reason to keep everyone alive. You'll constantly be rewarded with new weapons by killing the next tier of enemy, and by marines back at HQ. Almost every weapon gets an upgrade like extended clips and faster firing times. Like Doom 3, there are hidden items in dark corners and in secret sections, where you'll also find armor. They're not terribly well-hidden but they provide a small sense of exploration to break up the fragging. The load times are not next-gen; unlike the under 15-second load times of the speedy Call of Duty 2, these load times are 30-plus seconds long. When you die and have to restart from a previous load, they're also 30 seconds. There are no squad commands, there are no voice-commands, and unlike Doom 3, there is no co-op for the Xbox 360 version. Another minor bummer.   Still, the game follows the human invasion of the Strogg planet, in which you fight with teammates, solo out of your own, indulge in a bunch of escort missions, fight a few bosses, and pilot a few vehicles. The game is roughly divided into two parts: Before your capture, and after your Stroggification. Prior to being captured, you're a basic marine with a good range of weapons and all the basic abilities. You've can walk and run, strafe and shoot, switch weapons using the two new shoulder buttons or the Dpad, and crouch. Once you're Strogged, your speed increases 25% as does your health bar, and you'll be able to use the gruesome, pumping Strogg health machines to replenish health.       The first third or roughly half of the game is relatively easy on the Normal setting, increasing once you've been mechanized. If you're a hardcore player who likes a challenge I would recommend bumping this up to the third setting immediately. The gaggle of baddies -- from the standard Strogg grunts to the Berserker -- can jump out of the way a tick or two to the left or right, but they're basic in AI functionality. They won't challenge you; they're aggressive but neither tactical nor smart. The first half is fun, and you'll really get into the part of the marine, but it's not as fast or as frenetic as you'd expect a Quake game to be. In fact, it's strangely slow paced.   There are a handful of vehicle sections too, which are medium to mild entertainment. With the exception of the one turret elimination run, they're all really easy. But they serve to break up the basic shooting sections with a different kind of gameplay. You'll pilot a hover tank (the Gav), ride on a set-turret tram, and walk in a giant Mech Walker, the last of which is the most fun. In the Walker you can switch from missiles to heavy machine gun fire, and your health and armor regenerate over time. In one of the more disappointing moves, the strikingly cool looking Harvesters -- the giant red spider-like creatures that look like they'll kill you in an instant -- are totally easy to kill. They're fun to fight at first, but the fight itself lacks any kind of frills. It's a letdown.   Once you're Strogged, the game changes. You'll start facing Strogg marines, who look just like you. Thy take cover, flank, and they know how to hit their target. The enemies just get meatier and increasingly larger in numbers and you'll finally face your first real boss fight deep in the heart of the Strogg facilities. The game from there on out is faster moving, so in some cases you'll literally be zipping around blasting the hell out of these bastards or you'll work with fellow marines in teams and tactically work through waves of Strogg marines. But the framerates do cause serious problems in several areas. A few ghost characters and some zombified Strogg rejects change up the pace of the action to make things fun. Personally, the second half of the game is way more fun than the first, despite its problems. Quake 4 should have moved faster from the beginning and supplied a smarter variety of enemies from the get-go. Once you've been Stroggified, you look back and say, why didn't this happen sooner? Also, the first part of the game runs more smoothly, while the second part slows down more frequently.   This multiplayer mode is similar to the PC version in content, but there are a few exceptions. It's only eight-player online, not 16. That's a bummer, and it hurts to see a first-wave game not support more than that, seeing as how Perfect Dark Zero supports 32-plus. And especially given that this is made by a notoriously big multiplayer game maker with a PC background. Obviously, Raven felt that with eight players the game ran best, so that's what it felt comfortable supporting.    The second thing about the multiplayer mode is that, if you're primarily a console gamer and haven't played that much Quake, it's super fun. I played online with seven others and while it's nothing terribly new -- in fact, it plays just like the 1999 version of Quake III -- it moves really fast and it's terribly addicting. There are 13 multiplayer maps (including The Edge and Longest Day fro Quake 2), and a handful of Quake III maps to boot. The full game of Quake 2 is included, too, which features the four-player co-op, and multiplayer and SystemLink, but it's not Xbox Live. In my experience with Quake 4 on Xbox Live the game moved well, it played swiftly and looked good, and I had no problems with it. The only issues with Quake 4's multiplayer modes (which include Deathmatch, Team Deathmatch, Capture the Flag and Tournament modes) are that it's really an old paradigm that hasn't changed over the last five years and that there are only eight players.Quake 4 is one of those games that will appeal to console gamers who haven't owned a PC for years. It's a decent port, though it lacks 16-players online (it supports eight-player Xbox Live and SysLink), and the framerates drops significantly in the second half of the game, but Raven has done some good things, too. The single-player campaignn is varied and pretty interesting, getting better after you're Stroggified. The enemies go from dumb and running right at you to diverse and more interesting in the scond half of the game, and there are a few cool boss fights worth your while. The gory graphics and excellent lighting are well done and they'll appeal to many gamers looking for a fast, shiny game to just let loose on. Quake 4 isn't the next coming, but it's an entertaining game with a solid multiplayer component (and the full Quake 2 PC game bundled in). It's definitely worth your while.", "date": "Nov 22, 2005"}