{"name": "JetFighter 2015", "name_review": "JetFighter 2015", "ref": "https://www.ign.com/articles/2005/11/22/jetfighter-2015", "text": "In ten years, the Global Struggle Against Extremism (nee War on Terror) will have been won...sort of. You see, those terrorists have been chased out of their current homes and have shacked up with South American drug lords. With their backing the terrorists are now preparing to launch new attacks on the United States. Your job, as a pilot in the US Air Force, is to take the fight to the terrorists and keep them from striking against the US. That's the premise behind the latest JetFighter game, JetFighter 2015.  The previous two JetFighter games were a bit schizophrenic. With one foot firmly in the realistic sim camp and another in the lighthearted arcade camp, it was hard to know just how to approach the games. Arcade enthusiasts found the games too complicated while die-hard stick and rudder types found the games too forgiving.   This time around, the developers are unapologetically clinging to a more arcade-influenced style. JetFighter 2015 feels more like a first-person shooter than a flight sim. Hell, the game doesn't even offer joystick support. Thankfully, the mouse and keyboard controls are very intuitive. As with Freelancer the nose of the plane will track towards your mouse-controlled aiming reticle saving you from having to repeatedly scroll your mouse in the direction you'd like to go (see: Battlefield 1942).  Flight characteristics and plane systems are also much simpler this time around. There are no more red outs, no fuel levels, no flares, no stalls, no take offs or landings, and no more one-shot kills. You'll find three flyable planes in JetFighter 2015 but apart from carrying different numbers of bombs and having different top speeds, there's really very little to separate the planes in terms of performance.  The three planes in this installment of JetFighter are all fictional and can fly in jet or hover mode. Switching between the two allows players to adapt to the tactical circumstances in front of them. The jet mode is useful when you need to get somewhere in a big hurry, or when you're trying to dodge nimble enemies. Switching to hover mode provides a much steadier, more precise firing platform but it also leaves you open to enemy attacks.   The 15-mission campaign offers a nice variety. Sure, the basic premise is to shoot the hell out of pretty much everything you see, but there's a nice range of encounters, from smashing up drug labs to taking out giant submarines to extinguishing derrick fires. While it's great to have the fun all to yourself, it would be very nice to actually have some help on some of these missions. You'd think that the threat of drug-dealing terrorists right on our doorstep would encourage the US to send in more than just one Air Force pilot, but you'd be wrong.  We criticized JetFighter V for not being hard enough. In the future, we need to remember to keep those opinions to ourselves. The developers have made JetFighter 2015 much more difficult this time around, more in line with the experience we had with JetFighter 4. I still have keyboard marks on my forehead from that one. Levels are nearly always filled with multiple threats -- from helicopters to fighters to fixed rocket emplacements to mobile AA trucks. To help ease the burden of repeated failures, the appearance and location of each enemy is the same each time you play the mission. It kills the replay value a bit but it sure helps you to get through particularly tough missions.      Multiplayer is included right out of the box this time around but good luck finding someone to play with. The servers aren't crowded enough to make multiplayer a real factor when considering whether or not to pick this game up. At the very least, the developers should have included a mission generator to add a little more variety to the options here. There's a free flight mode but since it doesn't have any enemies I can't really see the point of it.  I quite like the game's visuals. To be sure, you won't find this one topping the list of the best-looking games of 2005 but the graphics are quite good for a budget title. Previous versions suffered from muddy textures and non-descript landscapes but this time around the ground is a much more exciting place. The buildings look like more than just glassy boxes this time around and the abundance of trees help to give you a real sense of speed when you're flying close to the ground. The water is also surprisingly detailed for the series.   Vehicle models are also well done but if you're doing your job right, you won't get to appreciate how they look up close and personal. Instead, you'll be treated to the game's satisfying explosions. Helicopters, planes and the rest of your enemy's vehicles explode in big puffs of smoke with loads of debris sent spinning off in the air.  In terms of sounds, the music in JetFighter 2015 is pretty good. Though I don't normally go for that kind of hard rock, it fits the action well. The explosion sounds are also fairly satisfying. Sadly, the rest of the audio effects are terrible. I can't believe that the main cannon sound is so wimpy. It hardly gives you a sense of power when you unload at an enemy and all you hear is a tinkling. Over the last few iterations I've felt that JetFighter series needed to commit either to being an Ace Combat style arcade game or a Top Gun style sim. The new emphasis on arcade action is definitely a welcome change for the series but I can't help but feel that most casual gamers will find themselves in well over their heads in terms of the game's difficulty level. For $20 it's not a bad risk to take, particularly when you consider that they're throwing in a copy of JetFighter V as well.", "date": "Nov 22, 2005"}