{"name": "Brunswick Circuit Pro Bowling", "name_review": "Brunswick Circuit Pro Bowling", "ref": "https://www.ign.com/articles/2000/01/22/brunswick-circuit-pro-bowling-3", "text": "THQ, the publisher of Brunswick Circuit Pro Bowling will be quick to tell you that bowling is the ~#1 participation sport in the country.~ Whether this true or if it's simply a way for the world of bowling, not to mention THQ, to maintain its self-esteem against other big participation sports like badminton, lawn darts and croquet, isn't clear. What is clear is that Brunswick Circuit has some great ball-pin physics and this makes for an extremely slightly better than average bowling experience on the N64. We say slightly better than average because as good as the pin physics are, there's a whole lot of ugliness going on in this game and we're not just talking about the shoes.  The Facts   Superior ball and pin physics makes them react just like the real things. Comprehensive Create-a-bowler feature to start a career of your own. Play as the top players on the Brunswick ProStaff team. Multiple game modes like Tournament, Open, Practice and Skins Cosmic bowling with loud music and glow in the dark action. Authentic Brunswick bowling equipment.  Instant replay and multiple camera angles.  Multiplayer games for up to 6 players.   Gameplay The local bowling often serves as the scene for early social interaction for teens and young adults eager to get a taste of nightlife. Brunswick Circuit does very little to capture that aspect of bowling, but there a variety of ways to get into this game and none of them involve wearing hideously designed shoes that have been on the sweaty grimy feet of countless beer swilling bowling enthusiasts.  The variety of game modes only serve as the setting for refining and mastering the tedious art of rolling a heavy ball down a wooden alley at some weighted pins. You can chose from Exhibition, Skins, Tournament, Career, Practice and Cosmic games, which is just about all you can ask of a bowling simulator. If they had a chili dog relay sprint mini-game, that would be something, but for now the Practice Mode and Cosmic Bowling games are the best bets for beginners.    The attention to detail is what makes the bowling such a treat in Brunswick Circuit. You can play in a variety of different venues around the world including lanes in Germany, Japan, South Korea and Ohio. While it's neat to have all of those places in the game, once you're inside and playing, all of the bowling alleys look alike. The only difference you'll notice is the oil distribution and pattern on the lanes. These oil patterns are important because they determine the reaction of the ball and conditions change over the course of a ten frame game. These are the things that make BCPB as authentic as a bowling sim can be.  The great pin physics are the saving grace of the game. In fact the game is downright ugly until you get to the tight close up of the pins as the ball comes crashing into them. The speed, angle and spin of the ball are different just about every time you roll the ball no matter how automatic your technique is. This results in some authentic looking pin movements when they come in contact with the ball and each other. The pins will ricochet off of the lane and each other, spinning and rolling all over the place. You can actually see the pins move as if they're actually heavily weighted at the bottom as the heads knock into each other but remain upright at times. You can really get a glimpse of this when you check out the excellent instant replay. You can see just how close you came to nicking that seven pin as you tried to pick up that split.  Brunswick's name is on the box so all of the equipment used in the game comes courtesy of that powerhouse bowling company. Not only do they operate bowling facilities all across the world, but Brunswick showcases some of its finest bowling balls in BCPB. It may only be a bowling game, but you've still got to have some good balls.  The Balls  Danger Zone  Zone Defense  Speed Demon Speed Zone Quantum Jade Quantum Raven    Each ball has unique qualities that you'll have to take into account when you play. The speedy balls like the Speed Demon and Speed Zone will of course react differently on a pyramid shaped oil patterned lane than the Quantum Jade and Raven balls will react on a top-hat shaped oil pattern. Brunswick even threw in its team of professional bowlers and they all have their own strengths and weaknesses as well.   The Players  Mike Aulby Chris Barnes Parker Bohn III Steve Jaros Johnny Petraglia Ricky Ward W. R. Williams Jr.   Believe or not but that's quite a constellation of bowling superstars there and about $10 million dollars worth of 1998 earnings. If you're still not impressed with that the Create-a-bowler feature is always an option. Of course you'll  have to keep yourself from laughing as you go through the lists of brown, black  and tan bowling pants and style of spectacles your bowler will wear. The fact is, we went through every conceivable combination of created bowler and couldn't come up with an even slightly cool looking character. This could just point to the authenticity of the game since it reinforces the idea that bowlers just aren't cool.  Sound The crashing of the pins and that bowling alley music are all you can really ask and that's just what you get in Brunswick Circuit. For the record both are pretty good, but repetition does eventually kill any good feelings you have.   The Cosmic Bowling begs for some Young MC, Winger or other appropriately energetic tunes but you'll have to be happy with the base heavy sinister spy music.   One thing that is actually well done is crowd reaction. They clap as you release your shot and they clap even louder when you get a strike. If you leave yourself with a difficult seven-ten split, they'll react appropriately. The best is when you don't pickup that split, though. They know when you've blown a golden opportunity and they'll moan as they share in your pain.   We figured it would be too much to ask for some loud drunken obscenities or tacky humor coming over the public address system.    Graphics In a word, ouch. The game doesn't look right even though it plays well. Starting with the crowd or rather the sepia toned, motionless, newspaper cutouts of human forms that pass for a crowd of bowling enthusiasts, there are a lot of areas that just fall short.  The pins, while they move very well, look like something out of the Flintstones animated television program. They're not cylindrical with rounded parts, but rather they're a little clunky with flat sides that looked as if they were chiseled with prehistoric tools. The same goes for the bowling balls themselves. If they followed the rules of physics as well as the pins, they wouldn't roll.   The ball rolling down the alley towards the pins actually makes the game chop up.   The high resolution of poorly textured objects comes off as a very bad idea. You can clearly see how bad the player models look. Some of the ~famous~ pro bowlers don't look much different than some of the anonymous characters you can come up with in the create-a-bowler feature.  The ~cosmic~ colors are a lot more exciting than the standard bowling alley colors if you can stand bright  blacklit signs for Brunswick and other sponsors.   The dynamic television style camera angles are definitely a plus. Bowling may not be that exciting on television, but BCPB makes sure the game is as exciting as an ESPN late night pro bowling extravaganza.   We did appreciate the different approach and bowling techniques of the variety of pro bowlers and it really helps those unfamiliar with the sport get into it.   Bowling is one of those activities that I've always enjoyed playing more than watching. And that's not just because of the drinking and social excitement that goes along with it. The point is, that BCPB focuses, very well I might add, on the essence of bowling. It forces you to appreciate the nuances of the game and the importance of technique over all else. This is commendable and you really can't ask this game to do much more. In the same way that Madden brings the NFL sim experience to life on the N64, Brunswick Circuit gives you the best bowling has to offer. As far as bowling games go, look no further because you've found your cart. If you're anything less than an absolute raving fan of bowling then you may want to give this game a rent before adding it to your collection of niche titles.", "date": "Jan 22, 2000"}