{"name": "SEGA Casino", "name_review": "Sega Casino", "ref": "https://www.ign.com/articles/2005/11/30/sega-casino", "text": "It's not so far-fetched to expect a little Sega essence in a Sega-branded game, but in Sega Casino, there's not a whole lot of Sega-ness at all. Oh, sure, you'll get the promised gambling, but the Sega? Where are the Nights-licensed slot machines? Why isn't Sonic dealing out the cards? Couldn't Virtua Fighter's Akira host Keno? This collection of casino games dishes out part of the package, but it's a whole lot of missed opportunities for a game that's generically named.   In fact, it's not just a generic name, it's a generic compilation. What you get in Sega Casino are nine different, popular casino favorites including Blackjack, roulette, craps, baccarat, texas hold 'em, Chuck a Luck, keno, seven card stud, and video poker. These nine games are only tied together by a basic and lifeless menu system, and even when you select ~Casino~ mode, you never get the atmosphere of ponying up to the proper table at a Vegas hotel.    While I'm sure that there was good intention in the decision, the fact that four of the games are locked away until you earn enough credits to unlock them is just a little insulting. Adding to that insult is another ~unlockable~ element: to hit the high roller tables, you have to earn that right. So, you may have a thousand dollars to blow, but you can't bet the farm until you've spent some time at the kiddy tables. And this makes it extraordinarily difficult to obtain the ~unlock~ status of the games that you might actually want to play. I suppose this adds a bit of risk involved, since virtual casinos really do lack the sense that there's something valuable at stake, but it's still annoying that I can't hit the Video Poker machines without earning the right.   The versions of the casino games are solid enough, though, and are controlled well through the touch screen of the Nintendo DS. They're mostly just a step up from Shockwave versions of the same table games that are available online for free; very no-frills in presentation. The non-Poker games lack opponent AI - games like Keno and Roulette don't exactly need additional players at the tables, but Blackjack's strategy changes the more hands that are played at a timeand in this version, it's only the player vs. the dealer unless you take advantage of the game's single cartridge multiplayer option.   And that's Sega Casino's main saving grace: multiplayer through local wireless and only needing a single copy of the game for as many as five systems in the chain. The games are simplistic enough to fit in the internal memory of the Nintendo DS system. Blackjack, Texas Hold Em, and Seven Card Stud are available for multiplayer, but without a copy of the game for other people, the money earned doesn't go anywhere.   Sega Casino doesnt really feel like a casino, nor does it feel like a Sega game. Its a very generic, very unenergetic gambling compilation thats definitely playable, but it certainly will win no awards for an impressive presentation. Its extremely minimal. Playable and challenging, but way too blah.", "date": "Nov 30, 2005"}