{"name": "Burnout Legends", "name_review": "Burnout Legends", "ref": "https://www.ign.com/articles/2005/12/01/burnout-legends", "text": "There's not a single doubt in my mind that Criterion's Burnout series is one of the finest arcade racing franchises ever developed. In short, these games are incredibly fast, enormously furious, and over-the-top violent. Burnout is one satisfying franchise that takes racing and amplifies it to exaggerated levels. And the Nintendo DS version brings all this to a grinding halt. The development team hit a brick wall when it was commissioned out to bring the PlayStation Portable design to ~the dual-screen portable that could~ and just fails miserably at recreating that outrageous, energetic, adrenalized racing action on the Nintendo DS. The team at Criterion is either laughing themselves silly over this shoddy conversion, or caught dumbfounded that they allowed someone else to try their hands at their bread and butter. Either way, if you want the Burnout experience, you'd be more than doing yourself a favor by skipping this one and going for the console or PlayStation Portable renditions.   Burnout is Criterion's baby. The development studio uses this game series to show off the strengths of its in-house technology and the team's love of arcade action. So to see this all boiled down to something as bland, unappealing and unimpressive as what the Nintendo DS game ended up becoming is incredibly depressing. And yet, it's amazingly laughable at the same time simply to see horrific renditions of the Burnout experience scaled back to ridiculously basic levels that wouldn't even fly on consoles ten years ago.   Essentially, Visual Impact made the attempt to bring the technologically and visually cutting-edge experience that is Burnout onto a handheld that even Nintendo itself downplays the technical prowess of. With its past GBA efforts (which include Corvette and SSX), Visual Impact pushed the handheld hardware in a direction -- texture-mapped 3D -- that was honestly never the way the system was meant to go. So, of course, that may seem like a strength for the development team, especially when put to a task as daunting as re-creating Burnout on the DS. But alas, the game ends up looking, sounding, and feeling like a 3D GBA game: clunky, limiting, and almost completely unnecessary.   OK. The idea is to bring this fast 'n furious arcade racer to the Nintendo DS. Is it possible to get all the action, all the control, all of the complexity in the traffic patterns, all the gameplay onto this dual screen system and make it feel like it's a part of the series? Does it make sense to try, even if the development consensus is to leave the DS system to more casual and more creative games, and keep the console game ports on the hardware that can handle both the rapid gameplay as well as the polygons, textures, particles, and lighting effects?   Oh, the team does make the attempt. Slam a car into the guardrail and they'll go flying into a slow motion cutaway to show the viciousness of the hit. It sort of looks like a Burnout moment. But it's only made to mimic what Criterion did on the consoles and the PSP. The technique lacks the grace and attitude, and when the viewpoint zooms back to the player's perspective it's a gamble if the car will survive once control returns to the player. Criterion has made an art of this balance in the four renditions of Burnout, and it's clear that simply copying the effect isn't nearly enough to make it work.   That's just an example of what's wrong with this game. At its heart, this is just something made to seem like Burnout, replicating what it does without actually playing or look like Criterion's baby. Most importantly, the engine created for Burnout Legends DS just can't handle the required Burnout load. Roadways are sparse with very few innocent (but very hazardous) cars for traffic, so tracks and challenges feel incredibly empty and hollow. Races are one thing, but when you actually take this technology into another Burnout staple, Crash Mode, whatever good can come of the project comes off as pathetic and sophomoric. Look, a mode where the intention is to slam into packs of vehicular traffic is just weak when there's very little traffic to slam into. Seriously. On the console, players are rewarded with hundreds of thousands, if not millions, of dollars of damage in a single Crash Mode. On the DS? You'll be lucky if you crack twenty thousand. You'll earn a CrashBreaker for causing as few as three cars to collide (not counting the first impact).   But the worst element of Burnout Revenge is its sloppy attention to an actual driving model. There's zero sense of speed, even with the Burnout turbo activated. Steering the vehicle more feels like the environment's rotating around the car. And collision detection? Expect to crash into vehicles simply by touching them with almost no inertia involved. In fact, they'll be times where you'll be passing an opponent that's a good dozen feet away, and suddenly you'll find yourself smacked into an airborne, crumpled heap. Bugs are not uncommon in Burnout Legends DS, and this is only one of many that anyone with the patience of an air traffic controller will find in this horrible racer.   And we wouldn't be surprised if Electronic Arts itself didn't have a whole lot of faith in the Nintendo DS rendition, as the company didn't even bother to license popular music to accommodate the action. Instead, what we get is absolutely horrendous original pieces featuring highly compressed electric guitar and generic drum and bass.Sometimes you just have to know when to cut your losses. And Burnout on the DS? This should have been on the cutting block the moment the development team realized that the experience couldnt even come close. The only positive that can be said about this game: at least it runs at 60 frames per second. Weve played some bad racing games, but Burnout Legends takes the cake. Really.", "date": "Dec 1, 2005"}