{"name": "Jane's WWII Fighters", "name_review": "Jane's WWII Fighters", "ref": "https://www.ign.com/articles/1998/12/30/janes-wwii-fighters", "text": "Appearing on store shelves after Microsoft's Combat Flight Simulator and Microprose's European Air War, Jane's World War II Fighters completes the triumvirate known as this holiday season's ~Big Three.~ WW2F is another classic example of the ~survey~ type of simulation for which producer Paul Grace is well known (as opposed to the more hardcore ~study~ simulation so often found coming from Jane's other sim figurehead, Andy Hollis). While survey sims can have some appeal for the most purist of computer combat pilots, it's obvious the moment you padlock your first enemy plane that this game is targeting a much broader audience. But whatever concessions WW2F may make in areas of realism, it more than makes up for when it comes to the visuals and atmosphere. You've never seem a sim like this before, and you're not likely to see anything as pretty again for quite sometime to come -- at least, not until next time this year. The flight model might not be as good as the one found in CFS, and the missions might not engender the role-playing attachment one gets to a pilot when playing EAW, but the visual quality of WW2F is stunning. When running in all its 3D-accelerated glory, the sheer ~wow~ factor of WW2F at times actually delivers a better ~you are there~ feeling than the competitors.  World War 2 Fighters hits you with that Big Band era music at the start, just like EAW. Similarities end once you've seen the interface: Jane's created an incredibly detailed virtual museum that looks as though they spent as much time rendering it as they did programming the game itself. It's definitely a unique approach and works quite well. Each flyable plane is on display, showing off Jane's knowledge of the era's aircraft as well as offering playable video footage taken from the war, showing the plane in action. There is also an option to test-fly the airplane right away, something we all wish we could do at such museums in real life. Interesting commentary is available from the war's surviving aces, including two German pilots. Interesting stuff, but unsatisfactorily short. Different rooms will lead you to either campaign play, single missions, or the mission editor.   Amazingly enough, the cockpits inside the planes you fly look as real as the rendered planes on display in the museum. No 2D panels here: strictly virtual cockpits all the way, with an adjustable point of view if you so desire. As one would expect, all this visual splendor comes at a price, determined only by how far your hardware can take you. Short of having the latest, greatest system, expect to turn down a lot of detail settings, especially the 3D clouds. Explosions, concussion rings, smoke plumes, and life-like fire make for an incredible spectacle that will awe you into watching the plane you just shot down instead of tracking another bad guy. Combined with a stirring musical score and the sound of your pilot's heart pumping louder with each g you pull, WW2F is an effective ~cinematic~ experience. If only this sim had a movie recorder . . .  Yet, no matter how much I drool when flying this sim, the gameplay isn't all it could be. Ultimately it feels a bit hollow. If there is one gaming feature that has proven itself to be 100% successful, it's the addition of the role-playing element. Flight sims in general have long included this element, so its omission in this game is curiously strange, if not borderline lethal. Evidently, it's possible to take a survey sim too far, as World War II Fighters eventually proves (maybe Jane's choice of titles was the big hint). The campaign takes place during the Ardennes offensive, more commonly called the ~Battle of the Bulge.~ Better known for its tank battle, the Bulge represents an interesting air war to recreate because so many unique and famous plane types were present.   However, the campaign -- if you can call it that -- goes overboard by switching you back and forth amongst the various planes in an attempt to give a wide variety of mission types. Although the missions are indeed interesting, the game suffers by being far too cinematic rather than sim-like, more cookie-cutter than role-player. You're not a pilot with a personality, you're just a body flying a plane. If something happens to you, no big deal, as long you took that bridge out before you bought it (and even if you didn't, there's an option to revive yourself). This makes your pilot's death irrelevant. As a result, the ~you are there~ feeling so prominent from the pageantry drawn to the video screen becomes temporary at best, leaving one without a sense of continuity. Still, this campaign is infinitely better than Combat Flight Simulator's, but a bit too similar in that they both reinforce the completion of a mission's objective rather than the notion of you bringing your pilot back home alive. Even with the plane and squadron hopping, WW2F could have exceeded European Air War's dynamic campaign -- as scripted missions can sometimes do -- but there's nothing personal at stake here, so who cares?    For those who could care less about campaign play and are looking for just a plain, old fashioned, honest-to-goodness dogfight, World War II Fighters has its strong and weak points. The AI is the strong part: Friendlies are competent, and the enemy make good use of the planes they fly, as opposed to a generic implementation, where maneuvers are the same regardless of aircraft flown. Although WW2F's AI makes better use of the 'boom and zoom' tactic over EAW when flying a Me262, its use of jinking is not nearly as strong. This ultimately means that if you fly smart, it's a bit easier to shoot down planes in WW2F. As for the flight model, I'm of the opinion it ranks third behind CFS and EAW, but not by much. ~Mushy~ is probably the best way to describe how WW2F's planes feel relative to the other two sims. Jane's latest patch addresses joystick calibration routines that might not be responsive enough (some were experiencing Me262's out-turning Spitfires prior to the patch, and that's just not right), but even with the patch, energy bleed doesn't feel strong enough and the spins are hardly an ensuing threat. There's nothing wrong with this at an arcade level, but on the hardest of settings, WW2 dogfighting should be about mastering your plane first before trying to put bullets or bombs on a target. WW2F's flight model is challenging at times, but not challenging enough.  To date, no WW2 sim offers the same kind of multiplayer experience provided by LongBow 2 or EF2000. World War II Fighters is no exception. Cooperative multiplayer is an option, but only via individual missions. Still, co-op is a lot of fun and works fairly well over Jane's Combat.net if the right mission is chosen. When it comes to adversarial multiplayer, WW2F is just as guilty of the ~too much information~ system of views as is both EAW and CFS. I'm definitely biased by how Air Warrior and Warbirds handle this, because multiplayer should reinforce the notion of ~lose sight, lose the fight.~ Knowing where your opponent is at all times should be the key determining factor in the dogfight against another human, just like it was during the war. This element is all but obliterated with the ability to use a multitude of viewing options beyond those realistically available from inside the cockpit. In fact, why fight at all when you can turn on the auto-pilot and let it do it for you? Again, there's nothing wrong with allowing these features if players so choose to take advantage of them, but an option to disable them before the fight should have been made available.   We have yet to see the definitive World War 2 simulation, but the Jane's effort can definitely boast that it does some things better than the others. This is especially true in the area that many gamers think counts the most - the graphics. WW2F makes a fantastic entry-level product for those looking to sink their teeth into a flight sim -- assuming they are comfortable around a joystick and related accessories, and have the necessary horsepower to truly enjoy it. WW2F is also ideal for those looking to show off their brand new system's capabilities. And yes, even the hardcore flight-simmer can appreciate elements of the game (we can all use a little ~Quake in the sky~ now and then). Nonetheless, this product won't have the lasting value it could -- and should -- have had. With the WW2 flight sim market quickly becoming more crowded with each passing month, PC pilots will inevitably compare WW2F to its competitors. Under that spotlight, they'll see that in some ways WW2F is as weak as it is beautiful.     --  Gordon Berg", "date": "Dec 30, 1998"}