{"name": "Prince of Persia 3", "name_review": "Prince of Persia: The Two Thrones", "ref": "https://www.ign.com/articles/2005/12/02/prince-of-persia-the-two-thrones-3", "text": "Once upon a time... To appease the lowbrow demands of 100 million casual gamers unwilling to spend cash for Ubisoft's brilliant Sands of Time game, the company took Warrior Within into the more digestible realm of ~action~ and away from the realm of ~thinking-man's platformer.~  Swords and shadows! Dirt and ~bitches!~ Warrior was to be Ubi's sinister, consumer friendly modification of the fundamental Sands mechanics that were ever so thrilling and critically acclaimed. But despite best efforts and a healthy dose of hard rocking, Warrior Within cheesily fell short of the amazingly high bar its predecessor set. In trying to appeal to more folks by lining the game with more stuff, much of the original magic was lost. Indeed, an excess of scantily clad women, shadowy beasts and heavy riffs made Warrior Within ordinary, for when all is dark and grimy, even the dark and grimy become bright. A good rule of thumb is to understand when one more stroke is too many and when an excess of magic is drab.  Sadly, it seemed back then that a title of Sands of Time's caliber would just not come, given the new path laid down by Warrior Within for the Prince series. Boy does it ever feel good to be wrong! I'm dazzled. Prince of Persia: The Two Thrones is Sands of Time reborn.  Vantage Point  Music, art, acting, acrobatics...story! Each universally applauded part of Ubisoft's first marvelous foray into the Sands of Time trilogy has been recreated here with care and cunning, save for the scarred and craggy, battle-hardened face of our champion. And yet, while this third game offers so much indisputable greatness, it still grips tight to the failing philosophies of Warrior Within in just enough key areas. Two Thrones also suffers slightly from an imposing holiday deadline and the preposterously lofty expectations fans of Sands carry with them at all times.  Narrated now by the somber and knowing Empress of Time in a way that neatly ties the end of Two Thrones to the beginning of Sands, this Prince's journey begins much like Warrior Within or Shadow and Flame, in sea and turmoil. Approaching his home port of Babylon with Empress Kaileena under arm and the Dahaka defeated, the Prince looks forward to rest and comfort, though the smoking ruin of his city will give him none. With his land besieged, his vessel burned, his woman bound, and his house in ruin, the Prince sets out to free his love, reveal his enemy, punish his rivals, and put his home to rights. But even champions are subject to the whims of fate. Along the way the Prince will encounter old friends, older relations and new foes. His story will unwind backward and at once spring forward into a climatic choice between light and dark -- the Two Thrones, one of self-serving indulgence and personal achievement, and the other of unbridled heroism despite consequence.   Reforming the Prince into his original shape was a bloody good idea! Genteel as he is, Yuri Lowenthal's Prince of Persia in The Sands of Time is far preferable to Warrior Within's Wolverine Clone #818. The gruff, self-serving madman who sought to stop the Empress's Sands at any cost was not the young royal plagued by distrust and delusions of glory we all loved. #818 was simply out of place in such a fairytale. Being back in Yuri's shoes just feels right.   Ubisoft also expertly balances Yuri's third Prince between two lines of starkly contrasting motivation, or the two thrones. Throughout the course of this adventure, the Prince must decide what's truly important. He must confront his Dark self as it struggles to gain a foothold on his conscious and he must also fess up to past crimes and move past them regardless of hardship, while listening to awesome music.  By linearly forcing the game on a railroad ride to an inevitable conclusion, and not focusing on the paradoxical ~Superman can now fly around the Earth backward real fast~ time traveling mechanic to undo old problems and create new ones, Ubi has done away with backtracking and also recaptured the sense of urgency and achievement that were so prevalent in Sands.       There's an actual story here worth seeing. Truly! There're people to meet and save, a villain to thwart and problems to overcome. So move along, young hero, for time is short! Spite the cost of progress and keep going. People will die, but that's unavoidable. Without loss and the potential of greater loss, there can be no satisfaction in victory and Two Thrones knows this -- knows how good it feels to climb that one extra step toward a goal while regretting the few irreversible missteps along the way.  For the most part, Two Thrones also has its gameplay priorities straight: there's combat and there's platforming. Sands of Time separated the two. Warrior Within tried to marry them by populating platforming runs with a fight or two or three. Two Thrones, smarter than the lot, uses platforming as a device to expand combat. The Prince must climb, swing, wall-run and leap his way to a vantage point from which he can quickly dispatch unaware enemies. It's still possible to meet every foe with swords swinging, but there's a real incentive to scurrying up and around enemies before killing them. For one, the new quick kills mean not having to deal with the exact same combat system from Warrior Within, which unfortunately is still marred on occasion by odd character-on-character and character-on-environment collision detection (a byproduct of cyclical development, we assume). Second, climbing with intentions of speed killing means actually being able to enjoy the ensuing God of War-ish mini-games and their visceral conclusions, which also sound great.  The Chain Hurts...A Lot  I really think it's important to appreciate how novel an idea the quick kills are. The best part of Prince is platforming, but without sword clashing action the game runs the risk of feeling lifeless, and so Ubi tied the combat into the platforming in a way to make both types of gameplay better. It's exactly where the series needed to go.  The series also needed some good bosses. Good being the operative word there. Well, Two Thrones has them as well.   Exciting on-rails chariot races and a series of vicious super fiends help break up the classic assortment of sharp traps and new speed killing. All of them are pretty cool. The end boss fight, for instance, is a multi-tiered battle that involves time sensitive platforming, pattern-based combat and even portions of the new quick killing. Those battles that come before it are similarly themed, but differ wildly in execution. Like the finale, the jawless gladiator also requires platforming, combat and quick kills, but the leaping wench is all about the use of existing sand powers to gain an advantage, whereas the axeman and his swordsman companion require tireless parrying and dodging with an eventual speed kill thrown in for good measure. Then there's the enormous garden beast that gets his ass kicked straight away if Prince can stick him in the eye and rein him in like a bronco. Better, the game concludes with a dizzying end sequences that squares the Prince off against his demented alter ego in a dreamlike world reminiscent of the subtle and stylish secret bath Prince and Farah discovered in The Sands of Time's kingly tomb. It's really terrific.  All the while, the adventure is spanning burning rooftops, decadent palaces, palatial gardens, cavernous sewers and towers of such enormity you're sure to walk away with acrophobia. Sands of Time-ish design decisions like those prove Ubisoft was listening to disgruntled fans...intently. But, oily bits of Warrior Within still soak through on occasion.   Though the Dark Prince is an entirely new character exclusive to Two Thrones, he follows the same ideology behind the Sand Wraith in Warrior Within. In terms of gameplay, the Dark Prince is intended to transform players into predators. Unfortunately, he feels underpowered, unpolished and incapable of fulfilling his role. His many chain attacks flail around wildly and his health diminishes constantly, forcing players to snatch up sands of time in convenient crates or by killing more enemies.       This reluctance to drop the ~must fight now~ combat themes found in Warrior Within -- the Dark Prince and the inevitable rounds of numb goblin hacking that go along with him -- take away from the new ideas of Two Thrones and the better parts of Sands of Time it revived. After a brilliant section of platforming and a very cool interaction with one of the other characters in the game, suddenly we'll become the Dark Prince and have to seek out sands within random crates while chopping goblins. That's how it works, and it puts a serious hurt on the game's flow. The Dark Prince does wield the dagger-tailed chain, which allows him to swing over larger gaps by latching onto sconces and the like, but in combat the whip works like any other sword and doesn't imbue the Dark Prince with any powers more extravagant than what the Prince already has. Thankfully, the Dark Prince only really appears in snips, so he doesn't overwhelm the normal gameplay.  Now we come to it...Godsmack. Dare they resurface? Praise be, they do not. All unnecessarily hard rocking beats have been omitted from Two Thrones. The dynamic music here is crisp and stereotypically Persian in a way that melds Moroccan mixes with the soft wails of spicy Eastern women. The voice, too, as done by series mainstays, is either suitably lively and energetic or appropriately morose and forlorn. Even the effects, complete with spatial echoing and the soft clops of wet leather on stone ring clear. But we have encountered a few minor bugs that abruptly cut tracks off, cause effects to collide with voices and sometimes even stammer speech. Those have been rare, however.  There are less bugs on the graphical side of things, since Two Thrones uses the third iteration of Ubisoft's heavily modified Jade engine. The game still exhibits the smoothest animation around and some of the most dazzling backdrops (that rarely, if ever load), but we would like to see more physics applied to characters and objects, which might improve a missed collision or two. Otherwise, technically Two Thrones is very much like its predecessors. Its style, however, differentiates it from Warrior Within. Its style is what so dearly reminds us of Sands of Time.  Blocks Help Prince Kill Two Thrones is great. The story is cool, the heroes are likable, the weak are pitiable, the villains are bastards, the major plot points are exciting, the art is grand, the sound is wonderful...and then the gameplay comes. The established Prince platforming is terrific! The new emphasis on acrobatics as a means to extend combat (and vice versa) is exactly where the series needs to go, too. But there can't be so much light without touches of darkness. On paper, the Dark Prince is a nice way of establishing the real Prince as a character. The darkness's personality highlights the changes the real Prince has undergone throughout the series and elaborates on his motivations, while at the same time contrasting our boy's princely nature with identifiable human failings. It's a fun way of making players feel like champions when they do something heroic. But the gameplay that comes along with his sandy highness works against the overall experience. At times it feels like every bit of wonder is always followed or preceded by the Dark Prince, which represents the sum of Warrior Within's faults -- a reluctant admission that Prince of Persia still aspires to be a simple action game when it's so much more than goblin chopping. Still, this game is great...damn great. It's a terrific end to a satisfying series.", "date": "Dec 2, 2005"}