{"name": "Asphalt: Urban GT 2", "name_review": "Asphalt: Urban GT 2", "ref": "https://www.ign.com/articles/2005/12/02/asphalt-urban-gt-2", "text": "Gameloft's new Asphalt: Urban GT 2 pulls up to the starting line with every intention taking first place -- and after several hours of time in the game's plethora of mode, and jumping behind the wheels of several high-class rides (including a dup of motorcycles), it's a pleasure to award the game its well-earned victory lap.   The original racer was seen in a few incarnations: 2D, 3D, 3D with real-time multiplayer, and 3D on the Nintendo DS. It set a base level of expectations for this new edition I wasn't initially sure if Asphalt: Urban GT 2 could replicate. Many sequels are built with the desire to cram more, more, more into a game, and often the original charm is lost sight of. Asphalt: Urban GT 2 offers up exactly what made the first game such a winner -- great racing with licensed cars. However, it also flanks this with some new modes that serve not as a distraction, but as a worthy compliment to the main drive of the game.   Duel racing pits you against a rival car in a race for an established purse. The AI behind the other car is smart, but not overly vicious. Cop Chase takes a cue from the classic Need for Speed franchise -- before it became whatever it is now -- and lets you break up street races. This mode is solid fun, as you get to slam into the middle of a pack of racers and try to bring these bad boys down.   Even in the main modes of Asphalt: Urban GT 2, you'll have to interact with the po-po. You have a WANTED meter that is filled up by performing daredevil moves on the highway. The more wanted you are, the more the police will concentrate on bringing your racing career to an early end. At first, a mildly aggressive cruiser will pursue you. Keep it up, though, and the cavalry gets called in -- more cars, roadblocks, and helicopters. Adding cops to the challenge gives Asphalt: Urban GT 2 a nice extra bit of thrill.   The licensed rides in Asphalt: Urban GT 2 look fantastic. When you earn enough cash to do a little shopping, you can scroll through the likes of a Viper or Aston Martin. As mentioned, Asphalt: Urban GT 2 also offers a pair of motorcycles to race: a Kawasaki and a Ducati. Both handle differently from cars and are most prone to crashing, but it's good fun to weave with them. The cars can be slightly customized with new paint jobs, etc.   Asphalt: Urban GT 2 suffers from the same drawback as all mobile racers: controls. This isn't to say that they are horrible -- they're not. But they sometimes don't feel as tight as you want them to be, thanks to the shortcomings of use keys as inputs. You will especially notice this when you juice the nitro, which gives you a speed burst. Drifting, a huge element of arcade racing, is performed pressing the left or right button while in mid-turn. Until you get this mechanic down, you may find yourself doing a few unwanted drifts.   As with all Gameloft games, Asphalt: Urban GT 2 looks fantastic. The different tracks feature exquisite background detail. The cars themselves are expertly recreated on-screen. Even with their smallish size, if you are a car fan, these rides are unmistakable. There is also a solid sense of speed in Asphalt: Urban GT 2, which is imperative for racer's success. Gameloft continues its trend of using licensed music by pumping a Moby song into the main menu. Classy.  Asphalt: Urban GT 2 is a superlative racing game -- but who here is surprised? The only shortcomings in Asphalt: Urban GT 2 are due more to the limitations of handsets than Gameloft's technical prowess. The number of licensed cars is great, the extra play modes add mucho value, the new cop element works well, and the graphics look great -- even in 2D! If you want a deep racer to fill many a boring business meeting with, look no further. Asphalt: Urban GT 2 puts the hammer down with authority.", "date": "Dec 2, 2005"}