{"name": "Prince of Persia: wo Thrones [Mobile]", "name_review": "Prince of Persia: The Two Thrones", "ref": "https://www.ign.com/articles/2005/12/03/prince-of-persia-the-two-thrones-2", "text": "Once again, as the Prince takes up arms against evil in a new chapter of the Prince of Persia franchise on consoles, Gameloft follows suit with a mobile version of the same adventures. The Two Thrones is a two-dimensional side-scrolling adventure game that mixes equal parts combat and platforming into an ultimately satisfying romp through Babylon.   The game picks up after the events of Warrior Within, with the Prince returning home to Babylon after defeating the evils on the Island of Time. However, an evil vizier has taken control of the Prince's beloved home and is eliminating all who seek to protect the throne. It's up to the Prince, who never seems to cut a break, to clear Babylon of these encroachers.   Exposure to the Sands of Time, though, has awakened a darkness inside the Prince that manifests itself. The Dark prince is a shadier being that explodes into action when the Prince gives into his harder intentions. The Dark prince is lethal in battle, as he come fully equipped with a sword-like whip -- if you saw ~The Brotherhood of the Wolf,~ you'll recall seeing a blade like this during one of the film's climactic showdowns. The regular Prince has his two swords, so already we have an interesting wrinkle to the game. Combat essentially has two tracks, and players will start to figure out which Prince is the best for the job.    Gameloft has always done an excellent job in introducing new elements found in the console game in the mobile edition. New to The Two Thrones are chariot races and speed kills. The chariot races are nice little mini-games that break up the action sequences. The Prince must commandeer his horses through the dangerous streets of Babylon, eliminating enemies that attempt to flank him. Of course, the avenues are hardly empty, and obstacles must be avoided. These races are fun, and more importantly, quick. Had these few races taken too long, giving you too many opportunities to blow it and start so far back in the race you want to give up, I would have been severely disappointed.   The stealth kills work quite well when you need to dispose of enemies, but my complaint about them feeds into my singular complaint about the entire The Two Thrones. Sometimes the Prince feels out of control. You initiate movements, such as stealth kill, but then the game just sorta... takes over from there. For example, you'll slowly work down a rope to drop on a guard, and as soon as you hit the button to drop down, the Prince drops, pulls out his sword, and slashes the foe wide open. I appreciate the need for simpler controls since the cellphone hardly handles like a Dual Shock, but I'm also not crazy about being a spectator in cool moments.   Many moves the Prince originally possessed return in The Two Thrones. You can still wall run to cross chasms and use poles to swing to higher ledges or come crashing down on enemies. The platforming stuff that everybody fell in love with all the way back in Sands of Time are still present, but in a somewhat diminished role.   Wait for it -- The Two Thrones looks fantastic. (Come on, you knew it was coming.) The Babylonian scenery is gorgeous, whether you are inside a palace or racing through the city streets. The Prince sprites, both normal and Dark, are imbued with great detail and smooth animations. And if that wasn't enough, Gameloft even infused a little cheesecake in The Two Thrones, with the Prince saving some mighty fair maidens.  The Two Thrones is a rock solid action-adventure game that really nails the theme and does a pretty sweet job of bringing over some of the new series elements introduced in the console edition of the game. The animations and backdrops are amazing, with the Prince (and his dark alter ego) responsible for some pretty sweet moves. However, sometimes I felt like I was riding shotgun with the Princes. I like big, sweeping acrobatics, but I want to feel like I'm in charge of them. Other than that, I have no other complaints. This is a good adventure for fans of the genre, and a pretty nice mixture of the platforming from the original Sands of Time and the brawling from Warrior Within.", "date": "Dec 3, 2005"}