{"name": "PoPoLoCrois", "name_review": "Popolocrois", "ref": "https://www.ign.com/articles/2005/12/05/popolocrois", "text": "When it comes to role-playing games, it's been a little dry on the PSP front. Apart from Untold Legends: Brotherhood of the Blade and the recently released Legend of Heroes, fans of the genre haven't had much to play. So when Agtech announced it would release Popolocrois on the PSP, fans had a legitimate reason to get excited. And not just because it's an RPG, but because it's the first time a game in the Popolocrois series has released outside Japan. It's a reasonably popular franchise overseas, where you'll find television shows and several games honoring it. But for whatever reason, publishers deemed Popolocrois unfit for American audiences and kept it strictly a Japanese thing. Until now, that is. Sony Computer Entertainment and Agtec decided to pack the Playstation titles Popolocrois I & II into a portable package for release on the PSP. And it's pretty decent, too.   Since there are two full fledged games in here, there's plenty of RPG gaming to be had. More than 25 hours to be exact, and probably closer to 30 hours for most. The game splits into a number of different books, spanning five years in total. And just to clarify, both Playstation games have been reworked in a way as to provide one long adventure. It's not as if you play one game, see credits, and then start a whole new adventure. There's a sequence cushioning the two games, making the experience relatively seamless. It's far better than just offering two separate games from the menu, anyway. The story centers on a 10-year old boy named Pietro. He's your regular 10-year old, except for the whole need to save the world thing. But at first, things start rather small. At the beginning of the game, Pietro learns that his mother, who he thought died during childbirth, is actually alive. She's been afflicted by a curse that's forced her to sleep for 10 years. Learning of this on his 10th birthday, Pietro sets out to find a cure for his mom. The plot, while simple, offers a handful of genuinely moving moments. It's also relatively free of violence and adult themes so it's ok for younger kids, even though the game itself may get too difficult at times for unsupervised play.   Since it's a remake, it doesn't really innovative in any particular area. In fact, were it not for a few twists in the game's combat engine, Popolocrois would stand as the quintessential Japanese RPG. You explore the world through a three-quarter perspective and you visit a number of towns full of chatty NPCs, merchants and hotels. It packs few surprises when it comes to narrative progression and character development, and the plot itself doesn't offer anything truly inventive. The game sports random encounters, too, and relies on the usual list of items, weapons and armor upgrades. In short, you've played this type of game before, perhaps many times.     Having said that, there's something undeniably charming about Popolocrois. You could point to the game's cute visuals and soundtrack as the reason, but that's not it, though that's part of it. You could also say it's the game's characters, which all seem unwaveringly innocent and noble, but that's not entirely it either. The only thing left would be the gameworld itself; a world filled with quaint merchant towns, fishing communities, mystical forests and island cities that float in the sky. In the end, the culmination of all these things lends Popolocrois its uniqueness. What seems  clichd at first glance ends up feeling genuine when knee-deep in the plight of the gameworld. Maybe it's just nostalgia. Or maybe a good story is just a good story, even if you've heard it dozens of times in the past. Either way, hardcore fans of the genre will dig the old-school mechanics and narrative behind Popolocrois. And new RPG fans, well, they'll probably find a lot to enjoy as well. Not to say the game is perfect, of course. Far from it, in fact. Certain aspects of the game will bother even the most hardened RPG fan. It's an interesting dilemma, actually, since most of these issues stem from the game's ~traditional~ elements, an area that developers wanted to keep as genuine as possible, problems and all.   The first of these problems, the one that will undoubtedly rob the most time, is random encounters. Sure, they're a staple of the genre and an acquired taste. But in this case, they happen so often throughout the 25-plus hour journey that it gets a tad annoying when you have a lot of time to kill, and simply maddening when you're in a hurry. Monsters literally start attacking seconds after you leave the safety of a town or city and won't stop until you get to your destination. Monsters aren't overly powerful, but the game pauses whenever executing a special attack or magic attack, so fighting doesn't feel very fluid. And again, these little pauses wind up taking a lot of time in the end. As for the combat itself, it's a cool blend of strategy and classic turn-based action. Each character engaged in combat has an ~active gauge~ like in the Final Fantasy series. When it fills up, it becomes that particular character's turn. They can then position themselves on a grid, orient themselves in four directions using the L and R buttons, then attack. Characters can choose between an ordinary attack, magic (to attack or heal), special attacks and items. The system works well and leads to tense, strategic combat in the later stages of the game. It's easy to pick up for beginners and offers enough depth for experts. And while the spell effects (including elemental attacks and summons) work fine, using magic in Popolocrois isn't as flashy as it could be.   As far as portability goes, the game features a robust save system. First, you can manually save the game whenever you visit a hotel, but the game also saves automatically using another save file. Using this autosave feature, you'll be taken back to the nearest hotel save when your party's wiped out in battle. Of course, you'll lose experience and coin, but it's better than the alternative. Lastly, you can access the save menu by pausing the game at any time and save your game manually. Not a bad setup. The game's ultra bright color scheme helps when playing in sunlight as well, and the odd blur effect that plagued earlier builds isn't that noticeable. Also, Popolocrois won't kill the PSPs battery, as it usually clocked in about three hours of life.      In terms of visuals, Popolocrois looks old. A nicer term would be ~classic,~ but on a portable system as powerful as the PSP, there's too much capacity for cool to be ignored. Not that the game looks bad, of course, because it doesn't. But it looks more like a GBA game than a PSP game. About the only thing that's somewhat impressive, in terms of visuals, are the animated sequences that dot the game. And when it comes to sound, the game has a handful of catchy tunes, but they tend to get a little tiresome.   In the end, Popolocrois offers a decent role-playing experience. It has a simple, effective story that matches its straightforward game mechanics, something that hardcore fans of old-school RPGs will certainly appreciate. At the same time, preserving the aged story elements and game mechanics means there's little room to invent. As such, those looking for a fresh, original experience won't find it here. But if it's a classic RPG experience you want, then Popolocrois delivers.", "date": "Dec 5, 2005"}