{"name": "Star Wars Galaxies: Trials of Obi-Wan", "name_review": "Star Wars Galaxies: Trials of Obi-Wan", "ref": "https://www.ign.com/articles/2005/12/05/star-wars-galaxies-trials-of-obi-wan", "text": "Coninciding with the release of the New Game Experience the gang at LucasArts and Sony Online have recently offered up the third full expansion for their popular MMO, Stars Wars Galaxies: An Empire Divided. The new expansion, Trials of Obi-Wan adds to the galaxy an entirely new planet full of new ground-based combat content. We'll be focusing on the NGE in a future, separate review but for right now, let's focus on the exciting new world lying off to the left of your hyperspace maps.  Given the timeframe of the core game, you might expect the expansions to focus on locations more appropriate to the original trilogy. Rather than letting players uncover Imperial activity on Cloud City or battle the elements on Hoth, the developers have instead opted to ride the marketing coattails of the prequels by offering planets featured in the more recent films. This time around players are getting the chance to visit the vulcanic world of Mustafar, the scene of the climactic battle at the end of Revenge of the Sith.   The first thing to know about Mustafar is that it's incredibly dangerous. I mean, Darth Vader was almost killed there for crying out loud, so you can imagine what your chances are. Though it's not marketed as such, Trials of Obi-Wan is exclusively for high-level ground combat classes. Anyone who thinks they'd like to see what crafting opportunities might await them on the new planet is likely to find a giant insect ready to bite off their precious loom arm and spit it into a river of lava. Even the tougher 65+ crowd will find it advisable to take along a few friends when exploring the wilds of Mustafar.  There are tons of enemies all over the planet, from limb-gnawing reptiles to gigantic lava fleas to limb-crunching crustaceans. The animal side of Mustafar is only half the story. There are also unscrupulous treasure hunters, diseased miners and the mysterious blackguards to contend with. Point is, pretty much every where you turn on Mustafar, someone is waiting to kill you. Happily, you can usually outdistance your enemies on the back of a speeder bike but there's plenty of fighting to be found if you're so inclined.  Rather than simply grinding out loads of combat experience, you'll definitely find plenty of quest-related activities on Mustafar. Granted, most of them involve killing something or other but there are plenty of opportunties to get credit for retrieving lost items, performing mining-related maintenance and uncovering the various mysteries located around the planet. A handful of quests even involve fighting, finding, fixing and figuring things out all as part of a single mission. You'll also appreciate the fact that some of the missions offer a choice between two contrasting solutions.  Though you can find a few quest givers out in the wild (and even stumble across the ghost of an old jedi master), most missions are offered at the main mining complex that also serves as your point of arrival and cloning facility. You can gather all sorts of tasks by talking to the miners and travelers located in the complex. While it's nice to have a single location to get most of your quests, it would be more convenient if the facility was centrally located. As it is, you can really only travel in one direction out of the mining complex.  What makes the location of the facility more obnoxious is that the landmass of the world are divided by dangerous rivers of lava. Though you can sometimes jump your speeder bike over the narrowest laval channels, there are also bridges that lead from one island of rock to another. Unfortunately, the landmasses are all linked in a chain so you'll have to set out from the mining complex, zig zag across the entire world to get to the other side and then zig zag back to claim your rewards at the mining complex. You're bound to get bored of it before long.      Where Kashyyyk was full of arbitrary barriers that prevented players from traveling over even the most modest rises, Mustafar allows players to zoom up and down massive mountains. This can cut down on your travel time quite a bit as you head from one mission to the next. The game's new mount, the lava flea can be very useful in this regard. Occasionally you'll still run across a few mountains that you simply can't cross. For the most part, these barriers are meant to preserve the flow of a mission area, keeping you, for instance, from just dropping down in the rear of a mission area.  There are also some interesting restrictions on the few instanced dungeons located on Mustafar. Once you leave one, you'll be prohibited from entering it again for an hour. Unfortunately, there are some frustrating bugs in some of the dungeons as well. Exploring ancient ruins for a local historian proved particularly frustrating as I kept being warped back to the entrance before I could manage to get more than a few feet in.   While Mustafar is mercifully free of major bugs and glitches there are still some issues that need to be addressed. Some hostile NPCs don't have animations so it can be hard to tell if you're being attacked. The only excitement you get from fighting these mannequin is in wondering whether or not they'll actually ever fall down.  There are some basic design problems as well. For some stupid reason, Trials of Obi-Wan ships with absolutely no new space zone. You can't fly your own ships around the planet at all. Hell, you can't even fly to the planet in your own craft. You'll have to take the shuttle directly to the mining complex. There is one new ship that you can get through a quest (and there are some neat tie-ins to other Star Wars games here) but, given the developers' claims that they want to make the game feel more like Star Wars, the absence of new space content is perplexing.  Likewise, the expansion does little to bring the Galactic Civil War home to players. In fact, it doesn't seem like the Empire or the Rebel Alliance even exist as far as Mustafar is concerned. Though I don't want to see stormtroopers on every planet, it certainly would have been nice if the expansion had tried to incorporate at least a little bit of the bigger picture in the goings on of this new world.  Finally, as you can see from the screens, Mustafar offers some impressive visuals. The lava world offers delights at every level -- from the massive volcanoes and lightning strikes at the far limit of your vision, to the small lava-filled cracks and vents of gas on the ground. The design of the inhabitants and the architecture (what little there is) is also very striking. The whole affair is intentionally designed to be a bit dark and dreary but it's still an exciting place to be. Sure, the monochromatic approach can get a little monotonous but that's more a consequence of the Star Wars tendency to define an entire planet based around one type of geography. If you're playing a powerful combat class at the very top of the food chain, you're pretty much guaranteed a fun time on Mustafar. There's loads to do in terms of hunting and questing and you'll uncover a fairly satisfying story during the course of your stay. But that's it. There's really nothing else going on here. While there are some small design problems here and there, that's the real problem with Trials of Obi-Wan -- that its content really only serves a very select group of players. Low-level characters and those interested primarily in crafting or space combat won't find anything worthwhile here. Designing an expansion pack that can only be enjoyed by the most experienced, most powerful players seems shortsighted to me, particularly so given the developers' recent attempts to broaden the appeal of the game through a substantial redesign of the core system.", "date": "Dec 5, 2005"}