{"name": "The Bible Game", "name_review": "The Bible Game", "ref": "https://www.ign.com/articles/2005/12/05/the-bible-game", "text": "Crave Entertainment's latest addition to the GBA library attempts to mix action and adventure with edutainment in The Bible Game.  Over 1500 questions are taken from books in both the Old and New Testament, and though The Bible Game claims players can ~Learn about the Bible while you have fun,~ only half of the statement is remotely true.     The Bible Game begins with a small cut scene showing a young boy and girl asking their parents about the armor of God.  After a short blurb on what that armor actually is, the kid of your choice warps away to a far off land where sin has overridden a small village.  It is your goal as the child to walk the land, squishing evil bugs and answering trivia challenges to rid the world of evil.  While this title boasts the ~combination of action/adventure with trivia challenges~, it is severely lacking on both fronts.  Control is far too simplistic, as is the challenge of actually navigating from place to place.  The action described is comprised of only gap-jumping and bug squishing, and the trivia is actually very difficult for a kid's game.  Challenges are found by exploring each of the seven levels and finding demons who have stolen town keys.  The only way to rid the world of such evil is, you guessed it, through a trivia battle!  Battles are boring, however, offering no real entertainment aside from simply answering the questions.  Based on the difficulty of play, a certain number of questions must be answered correctly to defeat the deceiver.  Unfortunately, the questions will be amazingly difficult for kids, and ~difficulty selection~ doesn't change the questions asked but rather the amount needed to pass.  What kid is going to know ~Whose face was changed as if 'it had been the face of an angel' while before the Sanhedrin~?  The questions are tough, and the action is sparse.     Since The Bible Game is meant for the younger crowd, actions were taken to try and simplify the game.  Designers opted to take the GBA addition in a different direction than its console counterparts, trading in a more simplistic style of mini-game play with a full adventure.  It just doesn't come together.  When wandering the lands small scrolls can be found which will contain the answers to the questions that will be asked during the next trivia challenge.  Amazingly, however, even this play mechanic was ruined!  The player is allowed to read each scroll only once, and during the actual trivia challenge there is no reference for the scripture.  If the idea was for kids to actually learn this information it would seem like a smart move to let them reference the material needed, or at least dig into the actual Bible to find the answers to the questions.  Giving kids only one chance to read each piece of scripture is cruel, and that is assuming the kid will take the time to find every hint in the level before doing battle.  It was as if steps were taken to purposefully hurt the value of this product.     As if the weak gameplay and baffling design choices weren't enough, The Bible Game is littered with flaws within the game's functionality as well.  The game controls very clunky, and art doesn't always match up with collision points.  A load screen is used between each level which makes no sense for a GBA game, and it actually displayed for more than a few seconds.  There is no battery save either, which simply reaffirms the idea that this was a game never meant to actually be played.  Recorded audio for the kids and townspeople skips like a bad CD, and the music will randomly cut out during scripted sequences and battles.  This title screams rush job, and even the aspects that had promise were ruined completely.     While weak overall design is what truly plagues this title, poor graphical presentation doesn't help in the least.  The worlds created for the player to explore are bland and void of life.  Character art looks like it is taken directly from a 1995 web game, and there is simply no life put into the choppy, sub-par animation.  Items that are ~hidden~ across the land are amazingly small, using the tiniest icons possible to create holy water, scrolls, hearts, and crosses.  Good luck playing this one on the Game Boy Micro.  Everything from design, sound quality, and graphical presentation in this package is evidence of a rushed development.    The Game Boy Advance has been around for over four and a half years, and gamers have seen everything from blockbuster hits to total flops.  It is astonishing that after this many years the quality for products can actually go down.  The Bible Game manages to take a simple mini-game based franchise and attempt to go above and beyond by constructing a full adventure on a smaller platform without the help of a strong design, battery save, or console inspiration.  Sadly, The Bible Game is a failed attempt plagued with troublesome bugs, weak gameplay, and little to no style.  What could have been an entertaining and educational childrens game turned into yet another casualty of the industry.  Avoid at all costs.", "date": "Dec 5, 2005"}