{"name": "Global Domination", "name_review": "Global Domination", "ref": "https://www.ign.com/articles/1999/01/01/global-domination", "text": "Ever since I heard about this game I've been waiting for it in wet anticipation.  Man, the concept sounded great: a real-time strategy/action game that combined elements of Risk, Missile Command, and the global warfare game featured in Never Say Never Again. For those of you who remember the James Bond film, Sean Connery and Klaus Brandauer play their own electrifying version of Global Domination on a holographic projection of the Earth.  Well, unfortunately, the boxed copy of Global Domination leaves much to be desired, especially in the implementation of the control system.  Speaking of the control system, the manual reads ~Commit the method to memory, Phoenix, and then dispose of the evidence.  It is vital that it does not fall into enemy hands.~  Well, no need to worry about that.  It seems that Psygnosis has already taken the liberty of disposing of any hints on how to actually control this game.  Sure, they give you a list of key commands, but they fail to mention how to effectively implement each of these commands in the game.  To make matters worse, the game uses symbols to represent the various weapons and facilities available to you.  Well, Psygnosis dropped the ball on explaining this one too.  It seems that they were nice enough to list the weapon symbols in the manual (thank god since the symbols they used weren't very intuitive -- sure, three arrows and a diagonal line is a great way to represent a satellite laser strike ... a laser being shot out of a satellite would have just been stupid), but they give you no clue as to what the separate facility symbols mean.  Sure, you can figure some of them out fairly easily.  A circle with an anchor denotes a shipyard, three criss-crossing lines is an airstrip ... but what the hell is the square on an orange background?     To make matters worse, the confusing control system is paired with equally frustrating micro-management during the heat of battle (as if there was anything else but heated battles in Global Domination).  Unit management comes down to what you can perform while still keeping your main territory safe (read: how many keys I can press with my left hand while my right hand feverishly mashes the mouse button to launch defensive missiles).  Sometimes you have to let an ally get obliterated because you're fighting with the control system trying to select which airfield you want your F-15s to fly out of.  The designers promised an intuitive, easy-to-use interface that would allow you to jump into the game without having to meticulously scan the manual and memorize a series of confusing key commands.  Bah!!! This is one of the least intuitive interfaces I've ever seen and, although Psygnosis promised a tutorial mode for the boxed release of Global Domination, there is no such beast in the final copy.  You're simultaneously in control of land, air, sea, and space units including cruisers, submarines, satellites, fighters, bombers, tanks, missile turrets and mobile rocket vehicles.  There's simply too much happening on screen at once for it to be any fun. Does the action stop so you can select different units?  Nope.  Can you slow down the action a bit when the battle gets a little too hectic?  Huh-uh.  Is this game satisfying in any way?  That's a negative.    And what's even worse is that key combinations for performing such tasks as selecting specific buildings to target work sometimes and don't others.  For example, on the territory zoom view you can click your mouse buttons to cycle through the different facilities ... in theory.  About every fifth click I got the facilities to change.  Sometimes the arrow keys would work, sometimes they wouldn't.  It's extremely baffling.  Although the missions seem simple enough when they're presented to you in FMV briefing sequences, you'll repeatedly see the Mission Failed screen and you'll have no idea exactly why you lost.  You'll think you're doing really well and then that big red LOSE will appear over the globe view.  The problem is that the mission objectives are constantly being updated during the scenario.  The new objectives will scroll up the left-hand side of the screen and, since the ongoing battles in Global Domination require nearly constant attention, you'll often miss an objective that was displayed for mere seconds.  ~Who cares if the included missions are confusing and nearly impossible to win!?!,~ you say.  ~I heard Psygnosis has included a scenario editor so I can setup my own battles any way I want.~  Sure ... there's a scenario editor included.  But as with all the other important information (like how to play the game), Psygnosis only included one page of instructions in the CD-booklet sized manual on how to allocate resources for all 56 territories available in the game (and remember ... you still don't know what all of those symbols represent).  Global Domination does actually offer up some fun in multi-player mode, but at what expense?  I haven't found any sites to play against others on the Net and, if you run a LAN game like we did at the IGNPC offices, every computer will require a separate disc for playing Global Domination ... and I don't even suggest you sink your hard earned money into a single copy of this game.  Ultimately Global Domination is just a futile exercise in frustration. The graphics on the globe are nice enough and the FMV acting is surprisingly good, but the interface is just too damn confusing, and there's no excuse for the lack of detailed instructions.  Companies have been producing video games for nearly 30 years -- you would think they would realize the importance of sound documentation by now.  All I can say is avoid this one.  If you see someone eyeing the box in the store slap 'em in the back of the head, because the storyline is compelling and the box art looks pretty tempting.  Remember, it's for their own good.   -- Tal Blevins", "date": "Jan 1, 1999"}