{"name": "Tokobot", "name_review": "Tokobot Review", "ref": "https://www.ign.com/articles/2005/12/07/tokobot-review", "text": "The PlayStation Portable has so far been dominated by familiar names and famous faces, so anything that shows up fresh and unexpected is always welcome on the system. Tecmo looked to the PSP to freshen up both the system's line-up and the in-remission platforming genre with its first PSP game, Tokobot. A unique idea in the platforming genre, the game has a lot of charms, which it needs to help it coast past some frustrating control qualms and unremarkable design elements.   Tokobot is all about its star characters, the Tokobots. In a curious land run by both ancient and modern mechanisms, these set of hive-minded robots will be your tools, weapons, and friends as you make your journey through the game. Nobody seems to know exactly what Tokobots are, as they have just now been discovered amongst the ruins of an ancient civilization by a young researcher named Bolt. In time, however, they'll give the boy great powers as he sets off for adventure on a quest that unexpectedly intertwines with ambitions and dangerous higher powers.  Bolt is your typical school-aged hero with spiky hair (well, he probably would have spiky hair if he wasn't wearing a hat), adventuring through locales filled with hazardous platforms and cunning block puzzles as regal villains of the shadowy military try to stop your progress. As you've probably recognized, it's a story that will seem routine to anybody who's played anything to come out of Japan, and Tokobot's ~Japanglish~ translation makes a story already filled with brow-raising non-sense feel more corny. That being said, the polish on the production elevates the experience, with simple yet effective dialog scenes between Bolt and the game's villains, as well as his cute female mission operator, Ruby. Even this generation, handheld games have come up short on story presentation (especially in style -- Tokobot doesn't have much by way of CG or animated sequences, and voices were not recorded for the main characters, but it still shines because it does right by what it has), and the warmth and style of the storytelling is enticing even if it's not original.    For originality, look to Tokobot's gameplay, which offers a refreshing variation on platforming action. When joined together, the Tokobots are able to be used as one for a variety of tasks, and with a flip of a button, you can switch their formation for different uses. Three basic formations are your main forms of play through this platformer -- a trailing line formation which you can whip into enemies or use to swing across chasms and ladder up platforms, an arms-out line formation where you can spin the Tokobots around yourself to knock out enemies and helicopter down to ledges or up through updrafts, and a circle formation which you can use to butt-stomp enemies and trigger buttons.   Tecmo's designers were able to get fairly far with the Tokobot's three main skills, although you'll quickly see most of the innovation spent in the game's early stages. Seeing as how games like Super Mario Sunshine and Ratchet & Clank were able to make guns do amazing and unexpected things, it's hard not to imagine that the developers couldn't have come up with many more skills for this set of obedient robots than what's here. We would have loved it if there were more physics-based properties or AI assignments to the Tokobot's skillset, since it would have made going back through stages a second time more fun to just play around with the otherwise straight-forward level designs. As it is, the Tokobots are just tools and weapons to make use of, and you don't feel like you're a Tokobot team until you all fall down from getting too dizzy or lose a couple in a ravine (they'll respawn in time, but it's still a loss when you're needing them in battle or for a jump.) Your set of Tokobots can also be joined to create special shapes such as a train and a crane, but they're only useful for solving special puzzles. The cool-looking Knight ability almost never came into need since he wasn't useful in battling bosses and there were rarely more enemies on-screen than we could handle.      Purely as a platfomer, Tokobot is only decent, but the Tokobot help bring a new dimension to your standard platform-hopping and block-pushing challenges. Because there is a difference in whether your Tokobots are just blissfully following you or are in formation (they all form a line and hold each other straight when joined), there are often times when you have to both manage the Tokobots and maneuver on precarious platforms. I do have a problem with the Tokobots only operating when joined, however -- except for the butt-stomp, the Tokobots don't do anything when you push a button without first holding down the joining trigger. It doesn't make sense why the designers went this way, because for one, the ability to use the Tokobots joined or unjoined would have given alternate abilities for each skillset. (As it is, we have no clue why they bothered with the essentially useless Circle's joining power, or why you can't join and butt-stomp as you'd assume.) When you're trying to move fast over cliffs and across chasms, it's easy to move too fast for the trigger and suddenly find yourself mid-air without the needed Tokobot skill to keep you alive.   The Tokobot's swing skill is also frustratingly under-developed, which is a shame since it's used for so much of the gameplay. Swinging is semi-automatic once you're latched on, and because you can't aim where you swing or build up speed, you might find yourself on the edge of the third in a swing pole set facing open air instead of the final ledge. You'll also miss a ladder sometimes when you jump and try to swing -- sometimes the Tokobots will just bounce off a ledge instead of sticking, or sometimes you'll hit the ~floor~ of a chasm before the Tokobots swing and grip the ledge when you're trying to jump low and act late to avoid a flying or swinging enemy. The game's difficulty is usually balanced nicely, but sometimes the control doesn't play fair.     As a unique PlayStation Portable game, Tokobot again runs on charm to enliven pretty if unspectacular visuals. Having all those little robots bouncing around behind you makes you feel close to the game, and the use of color and texture detail is solid for the portable. Special effects, on the other hand, are kept to a minimum, without much lighting or particle effects to spice things up. When it does go for special effects, it doesn't always work out so hot -- a waterfall in the game stopped falling half-way down if you had the camera in the wrong spot. The anime-styled character designs are cute, but it's a day in the life of any given Japanese game to have still pictures of a cute girl smiling as she talks to you.   What was really cool was the enemy robot design, which combines cutesy style with unique mechanisms that were often surprising. One mini-boss battle has you fighting a pillar of laser cannons that turns out to be, once you've knocked enough levels away, the hat on the head of a bigger robot who comes out of the ground, stretches out his legs and arms, then comes swinging at you as ~The Windmill!~ Control over the camera is also generally good in Tokobot -- a plus for a PSP game -- since it often uses locked viewpoints while also allowing you to look around or re-adjust your viewpoint. There is a problem in when it shifts to a locked view, however, since your control may awkwardly adjust -- you may have just landed on a platform, then have the camera flip 180 degrees, and suddenly you go walking off the edge. Those instances, however, are rare, and you thankfully don't lose much life when you respawn from a cliff fall (though it may hurt if you lose some progress through a tricky spot.) Orchestrated music plays throughout, and it's surprisingly decent and varied (although always peppy.) The music has a bit of that jazzy vibe popular in Japanese games like Katamari Damacy and Feel The Magic. And thankfully, the loadtimes are as short as we've ever seen on this system.   I'll be honest with you: Tokobot fell off my radar when I played parts of the import version. The game's characters were endearing, but the play in the early going seemed like it wasn't going to deliver on the promising concept of what the Tokobots were capable of. With just three major abilities, it felt like I had probably seen everything in the few stages I played through. However, the game won me over when I played through it on my own, with little surprises constantly thrown in when the gameplay got stale and boss battles that were worth playing up to. I wasn't entirely wrong that the game only had so much gas in the engine, and everything about this game feels like it's foundation for a great sequel rather than its own must-play game. (Next time, multiplayer? Full physics? Difficulty challenges? Collectibles? More special skills? Extra Tokobots?) Even so, with PSP gamers yearning for both unique game experiences and classic platforming challenges, Tokobot slips into both roles and does its job well.", "date": "Dec 7, 2005"}