{"name": "Brady Bunch Kung-Fu", "name_review": "Brady Bunch Kung Fu", "ref": "https://www.ign.com/articles/2005/12/09/brady-bunch-kung-fu", "text": "The road from concept to completion has been a long one for Mobliss' Brady Bunch Kung Fu. I've seen the game at more than a few semi-annual CTIAs, and each time it seemed the game was taking a turn in another direction. However, each time it also appeared that Mobliss was inching ever closer to creating a fabulously whacked-out take on one of America's greatest pop culture icons -- the nuclear family of the Nuclear Age: The Brady Bunch.   When one ponders landing the Brady Bunch license, a fighting game is not exactly the first genre that springs to mind. But deep inside Mobliss HQ, people look at things a little askew. And when the final decision was made to not only make Brady Bunch Kung Fu a fighter, but also to make it an anime-influence fighter where a doe-eyed Alice whips up Greg with her super-powered mop, I had to bow my head out of respect. That kind of game takes cojones to release in a market that is practically terrified of anything that proudly stakes its claim in Weirdsville.   The excuse for such madness? Remember the Hawaii episode? Apparently one of the gang brought back an enchanted tiki idol, which tainted butcher Sam's meat. The Brady clan ate said meat and transformed into bizarro anime caricatures of themselves, where Peter wears the same yellow running suit that really only looks god on Bruce Lee. Oh, and Uma Thurman.   Now, this being a mobile fighter -- which bears the limitations of the platform -- it must be said that Brady Bunch Kung Fu is not exactly the deepest brawler out there. Gamers wanting a more fighter-esque fighter are better served by Gameloft's Age of Combat. But that doesn't mean Brady Bunch Kung Fu is all goof and no game, as each combatant has a nice series of moves that are appropriate for their character, such as Greg's ~Disco Finger Punch.~ However, some matches will simply boil down to button-mashing bouts, since you seem to win just as many times slamming on attack keys at will than when you try to plan your assault.   Brady Bunch Kung Fu seems to proudly admit that some of its merit rides strictly on its style. And in the case of a five dollar cell game, that's a little more forgivable than a $60 Xbox 360 title. After all, sometimes it's cool to have a ~you gotta see this!~ game on your handset. And if you are a fan of the show, you'll appreciate that the good people at Mobliss are obviously fans, too. Look at Bobby's fighter form. He's flying in that UFO his brothers teased him about in what was one of my personal favorite episodes.   In fact, the game makes references to facets about the show at almost every turn. The Grand Canyon serves as backdrop in one fight, while that icky orange kitchen hosts another match. Mobliss has also infused the game with direct trivia about the show that will surely amuse fans.  In the end, Brady Bunch Kung Fu really is for the fans. And that's a pretty sizeable audience. Almost the entire clan is present, save for the dad who refused to be a part of the show's afterlife, including a hidden character. The anime style is very clever -- it reveals that Mobliss really put some thought into how to make this more than just a slapfest with licensed characters. Gamers looking for a deep brawler may be dissatisfied, but as a strictly casual game where anybody can fight a few rounds with their fave Brady, Brady Bunch Kung Fu succeeds.", "date": "Dec 9, 2005"}