{"name": "Ghosts 'N Goblins", "name_review": "Ghost 'n Goblins", "ref": "https://www.ign.com/articles/2000/01/25/ghost-n-goblins", "text": "The Game Boy Color's been around for a little more than a year, and unfortunately there's been one publishing company that hasn't exactly pounced at the opportunity right from the get-go to bring games to the system: Capcom. As the saying goes, better late than never, especially when you see what the company has cooking for the portable. Ghosts 'n Goblins is the first of four Game Boy Color games to release this year, and if this game is any indication of things to come, Capcom is going to be pestered for a lot more handheld games, let me tell you.  Features Port of the NES version Multiple levels Multiple weapons Password continue For Game Boy and Game Boy Color Ghosts 'n Goblins on the Game Boy Color is, essentially, a pixel for pixel port of the Nintendo Entertainment System (NES) version of the game, an excellent conversion from the arcade back in the mid-late 80s. What kids were playing from Capcom during the NES days is what we're playing now on the Game Boy. Even though I know for a fact the game could have looked just as good as the arcade on the Game Boy Color, this portable version of Ghosts 'n Goblins is still fantastic -- as well as hard as hell.  You play Arthur, noble knight on a trek through haunted lands to rescue his fair maiden Guinevere kidnapped by the demon of Hades. The game is one of the original sidescrollers from the 8-bit era, so the game is pretty straightforward in its action -- wander from left to right, lobbing spears at wave after wave of zombies, ghosts, goblins, demons and other non-descript beings. You've got a suit of armor that protects you from a single hit, but get nailed in your underwear and you're bones, baby.  The game is just as it was more than a decade ago -- one of the hardest games around. You're assaulted from every side, and you can't throw weapons upward. This gameplay limitation really made things difficult, and you'll find yourself hitting the continue a half a dozen times at least to get through some of the levels. Yes, that's right -- not only can you continue in the game, but you're also awarded a password at the end of each level (something the original needed...remember leaving your system on for days because you didn't want to lose your place?). The challenge gets even worse at the end of the game, when you have to return to the very beginning to start over, at a harder level. Yup, you have to beat the game twice to actually complete it. Talk about a challenge...sheesh.  The controls are extremely tight, and feel just as they did on the original NES version. The game would have been even more ~perfect~ if Digital Eclipse was given the go-ahead to port the arcade version instead of the NES version -- but I definitely won't count that against the game since the NES version was still an outstanding port. You'll also have flashbacks when you hear the accurate music tunes of the Ghosts 'n Goblins theme piping through the speaker -- the unit might not have the sound hardware, but at least it can emulate the classic games well. As far as action platformers go on the Game Boy Color, Ghosts 'n Goblins is definitely on the top. It doesn't have any real extras (I still can't find the promised two-player or Game Boy Printer modes), so I wouldn't put it up with, say, Super Mario Bros. Deluxe as a ~perfect~ game -- but it comes pretty darn close.", "date": "Jan 25, 2000"}