{"name": "Backyard Football 2006", "name_review": "Backyard Football 2006", "ref": "https://www.ign.com/articles/2005/12/10/backyard-football-2006", "text": "It astonishes me that even after over four years of content the GBA still doesn't have a truly amazing football experience for portable gamers.  We would love to tell you that has all changed with Atari's Backyard Football 2006, but that just isn't the case.  Backyard manages to look amazing, seem inviting, offer tons of great options and then completely blow it on the gameplay.  Read on to see a perfect example of how good and bad control can decide the fate of an otherwise attractive portable package.   Backyard Football begins with tons of potential, especially when looking at the strong presentation it offers for portable football fans.  Backyard is geared towards kids, that is obvious, but it also offers the simplicity necessary for a great portable sports title.  There are tons of play modes available for all skill levels and types of gameplay.  Pickup games are great for quick-play, practice mode is perfect for new players, and the season mode is shockingly deep.  Create-A-Player is also included as part of the season mode, and while it is as basic as a few stats, a nickname, hair style and body type it is exactly where it should be for a younger crowd.  For those that want to go deeper into the world of football, however, the season mode offers a full playbook editing screen for tweaking every play in the game, as well as full roster management for your handpicked team which can be based on any of the 32 NFL teams or 19 exclusive backyard teams.  The game is extremely attractive at first glance, and the presentation elements are well integrated.   While presentation may be the ~good,~ gameplay is most certainly both the bad and the ugly of Backyard Football.  The in-game play can best be described as Tecmo Bowl with terrible control, slow game-flow, and an overall clunky feel.  When the ball is snapped, pass icons appear for all available receivers.  Unfortunately, quarterbacks have terrible aim and power, often tossing the ball nowhere near the intended receiver or extremely short for an incomplete pass.  The controls are mapped to all the wrong buttons, having a virtually useless switch character function on the L button, and turbo on the R button.  When tackling on defense, the player seems to simply fall on top of the ball carrier rather than actually wrapping him up.  Switching players is also very flawed, as it doesn't switch to the player closest to the ball.  When swapping control for another teammate you literally have no clue as to who you will become, thus killing any strategy possible.  At the same time, it doesn't really matter that the character swapping is less than intuitive since each team member looks exactly the same on the screen.  Even if a character is made with crazy hair and a massive build they will look exactly like everyone else on the squad.  The only indication for specific players comes with small on-screen portraits that show up, though they look nothing like the actual pros they represent and thus are as useless for quick reference.   Aside from below-average gameplay, Backyard Football has everything going for it.  Graphically the game can hold its own, especially when being compared to other games for its age demographic.  The sound production is also fairly decent, offering recorded VO and average but passable sound effects.  The game has a great personality as well, having hilarious scripts for the chubby little Madden kid.  There is nothing better than hearing the little porker exclaim that ~Today's game is brought to you by the fine folks at Big Boys Underpants, now with extra elastic!~  In all honesty, I would rather hear this little guy every Sunday over Madden himself, and that is exactly what this game is going for; entertaining portable football.  The only problem is that entertainment has to be found off the field, making the game virtually useless.    It is a shame to see a game with such promise fail because of weak gameplay, but that is exactly what has happened with Backyard Football 2006.  This is the second Backyard Football game for the GBA, and it is virtually the same as the previous title in both its strengths and weaknesses.  There is a multiplayer mode available which helps the replay value, but it virtually useless since it just takes too much work to try and enjoy the exceedingly flawed gameplay.  If this series makes the leap to DS it has a great chance to start over, and hopefully it will take that chance to improve on gameplay.  Backyard Football literally has every section of presentation taken care of, but cant be recommended to anybody because of the seriously lacking and amazingly insulting gameplay.  If a strong football experience is a must on the GBA, Madden 2003 still holds the crown.  Even with great presentation and an entertaining style all its own, Backyard Football 2006 simply doesnt make the cut.", "date": "Dec 10, 2005"}