{"name": "Chronicles of Narnia", "name_review": "The Chronicles of Narnia: The Lion, the Witch, and the Wardrobe", "ref": "https://www.ign.com/articles/2005/12/10/the-chronicles-of-narnia-the-lion-the-witch-and-the-wardrobe-2", "text": "When a blockbuster movie bows in theaters, a mobile game is always quick to follow. As ~The Chronicles of Narnia: The Lion, the Witch, and the Wardrobe~ bows in theaters today, Disney Mobile Studios releases a duo of mobile games based on the film about precocious British kids and talking lions. In the past, Disney has shown its ability to think a little bigger than slapdash platformer when porting its movies to mobile -- remember the clever Hitchhiker's Guide to the Galaxy: Adventure Game? That same line of thinking has led Disney to release a 2D strategy game based on the Narnia world.   Narnia unfolds over thirteen chapters, letting the game guide the children through the world of fantasy from a useful isometric angle. The storyline follows the book and film, with the children taking up arms against the White Witch and her scheme to freeze the realm in a forever chill. It's an epic yarn, and this Cliff's Notes version of it fits into the mobile game quite well, thanks to series of very well written dialogue boxes that do well to evoke mood and grandeur of the story.   The scenes in Narnia get progressively more difficult as you move through the game (as you would expect), as the White Witch sends out stronger units straight outta the book to defeat you. Movement and attacks occur on grid spaces, as is typical for the genre. The battle system is streamlined and easy to use, following the most basic strategy game conventions without complicating matters with near excessive ratios and percentages. It's not as deep as Glu's Ancient Empires II, but it gets the job done right -- and is probably a little friendlier for potentially younger players.   As players defeat monsters and earn experience points, they can purchase cards. These cards up character abilities, such as offense and defense. Without a massive number of power-up items to keep track of, players are able to simply enjoy the battles and keep moving and groovin' through the story. Again, this may seem too simplified for some gamers, but Narnia in general skews younger.    The game is liberally drenched in characters and situations fromt he source material. The children all appear, as does the White Witch, the mighty Aslan, and even the beavers. The isometric angle gives developer UIEvolution extra space to craft detailed environments and characters.  Narnia's 2D edition is a nice surprise -- I wasn't exactly expecting a turn-based strategy game from Disney on this one, but the genre fits the epic snugly. Personally, I thought the game was a little too simple -- but I also recognize that the majority of people wanting to play it are going to be younger than me. But for what it is -- a streamlined strategy game based on an epic work -- it works.", "date": "Dec 10, 2005"}