{"name": "Dragon Booster", "name_review": "Dragon Booster", "ref": "https://www.ign.com/articles/2005/12/13/dragon-booster", "text": "Nintendo DS games generally fall into two distinct camps: on the one hand, you get the quickie ports from the Game Boy Advance or console systems that simply take an existing idea or design, shoehorning it into the dual screen portable, and in most cases you'll get a game that's all over the quality spectrum.  On the other hand, you also get the ambitious first and third party games that take the time to create an experience that's unique to the market, something that exploits the unique control of the Nintendo DS system. In most cases, the latter usually turns out to be in the good to great range. But then you get the occasional stinker like Dragon Booster that tries to do so much on the system and simply loses its focus. The only positive I can say about this game: at least they tried something new. If you thought touch screen racing was clunky in Pokemon Dash, wait until you try and challenge a few ugly lizards on the DS.   Dragon Booster is a Nintendo DS game based on a very average, syndicated CG cartoon series featuring dragons and their riders in a futuristic fantasy setting. What the development team tried to do for the portable game was to capture an air of combat racing with the dragons and riders combinations, offering both D-pad control for the dragons as well as touch commands for jumping, attacking enemies, and switching acceleration modes. Players will also have the opportunity to fire off a series of special weapons using the A, B, X and Y buttons, with the upper screen telling players which weapon is assigned what button. Yes, this control scheme is as overly cluttered as it sounds, and it's amazingly clunky to try and maneuver the dragon around the playing field with the digital pad while frantically tapping all over the screen with the other, all the while remembering to glance up at the top screen to see when and where they can use their special powers.   On top of the absolutely, horrendously cluttered control is some of the least sensitive touch screen mechanics yet experienced. You literally have to be spot-on pixel perfect with the stylus, otherwise your rider won't fire his weapon at the proper target, and your dragon won't jump over the oncoming hazards. This game boils down to a frantic game of ~tap the touch screen as fast as you can,~ because a single tap most likely won't trigger the collision point needed to actually nail the target you're aiming to hit. It's an unbelievably frustrating game design that really has nothing going for it in the ~fun~ department.   Even though the game's fully 3D in its engine, the environments are ~on rails~ like one of those failed full-motion video racing games back in the heyday of CD-ROMs more than a decade ago, or some of those technically-cool-but-clumsily-controlled Game Boy Color racers that tried to look the part of a console racer. And even with the engine forcing the path on the player, it definitely doesn't improve the appearance of Dragon Booster. These are very average looking visuals, and there are 3D games on the Nintendo DS that look and move far sleeker and smoother than this title does.   Outside of the dragon race are target shooting mini-game challenges that are super uncreative and poorly thought out. In these levels, players simply shoot at red, blue, or green targets as they zoom by in the background. This would be heated competition if the challenge was to shoot at the same targets, but the way this is laid out, the red rider shoots at red targets, the blue rider against the blue targets, with both racers shooting at the much rarer green targets. So, essentially, no matter how sharp each player's aim is, each player is limited to the targets the computer decides to throw at the two riders.    The multiplayer aspect of Dragon Booster is equally as bad as the single player component. But not only do you have to contend with the lousy touch screen and D-Pad control, but there's also the small issue of some ridiculously chuggy slowdown issues for, honestly, no apparent reason. There have been far more taxing wireless networking games on the Nintendo DS system, and to see a two player game brought down to a crawl simply because of the systems being networked together speaks volumes for this game's design and development incompetence.    Konami managed to squeeze this one out at the holiday season's last minute, and honestly the company shouldn't have bothered. What seems like an ambitious design turns out to be overly complicated, completely frustrating and totally confusing. Racing dragons sounds like a cool concept, but Dragon Booster doesn't end up anywhere near a cool DS game. The production is totally broken, and the only thing nice we can really say about the game is that at least it wasn't a crappy, uncreative console port. Dragon Booster proves that just because the developers put its focus on the DS functions doesn't mean that the game will be an instant success.", "date": "Dec 13, 2005"}