{"name": "WWE SmackDown vs. Raw 2006 [PSP]", "name_review": "WWE SmackDown vs. RAW 2006", "ref": "https://www.ign.com/articles/2005/12/13/wwe-smackdown-vs-raw-2006", "text": "Editor's Note: If the text in this review looks somewhat familiar to you, that's because it is. You see, the majority of our article here is recycled from our PlayStation 2 review of SmackDown vs. RAW 2006 that we ran last month. The content and performance of both games is almost completely identical to one another, and therefore, so are the reviews. That said, we have played through the PSP version of this game quite extensively and have judged the product on its own merits and have noted any differences between it and its console brother accordingly. Now that we have that out of the way, let's get on with the show. Last year's transitory SmackDown vs. RAW for consoles was somewhat of a letdown. Strong game that it might have been, it didn't build on the evolutionary changes that 2003's Here Comes the Pain did. Instead, it opted for the ~minor update~ route that's plagued professional sports titles for years and even lost a couple of features we enjoyed from the previous season. Sure the game was a lot of fun and did plenty of things right, but it didn't do enough to set itself apart like Here Comes the Pain or Aki's No Mercy did. WWE SmackDown vs. RAW 2006, on the other hand, definitely does. imageUrl=http%3A%2F%2Fpspmedia.ign.com%2Fpsp%2Fimage%2Farticle%2F675%2F675055%2Fwwe-smackdown-vs-raw-2006-20051212041607931.jpg&caption=The old adage ~...everything but the kitchen sink~ should be the first thing that comes to mind if you were to step back and realize just how much of an improvement SVR2006 really is. The teams at THQ and Yuke's Media Creations have done a spectacular job of listening to fans and critics to formulate one of the most feature-packed wrestling games around... especially on a PSP. Be it presentational, gameplay, customization options, or the excellent ad hoc support, almost everything in SmackDown vs. RAW 2006 is a step up from most other wrestling games out there.  At the forefront of SVR2006's list of features is a combination of the new stamina and momentum systems. A much more important addition than first thought, these meters add a lot of strategy and balance to a title that used to have issues in that category. In the past, it was easy to find a couple of repeating 'money moves' that kept your opponent floored or permanently dazed so that you could beat him up with few problems (how many of you, like me, would exploit this fact in tag team matches to keep one guy from ever reaching his partner?). Because of the addition of stamina and momentum bars, however, move duplication isn't as problematic anymore. imageUrl=http%3A%2F%2Fpspmedia.ign.com%2Fpsp%2Fimage%2Farticle%2F675%2F675055%2Fwwe-smackdown-vs-raw-2006-20051212041607119.jpg&caption=The reason these systems bring such balance to the action is because they penalize players for repeating similar maneuvers. If you continually bodyslam an opponent over and over again, for example, your momentum will begin to drop and you'll lose the support of the crowd. This makes a comeback from your opponent a lot more likely and also prevents you from earning a SmackDown finishing maneuver.  But let's assume that you do decide to mix-up it up and start delivering power grapples and signature moves until your momentum meter is charged. That's the way to do it, of course, but you'll have to be smart about it or suffer the consequences. String together too many high-end attacks and your stamina bar drains to almost nothing. This makes your movements slower and your character prone to easier exhaustion (opening up another opportunity for your enemy to attack). Knowing when to press select to manually regenerate your stamina between big spots is essential to winning main event matches on the higher difficulty levels.  Be warned, though, the meter does seem to drain a little faster than it should and may take some getting used to (and should probably be tweaked a bit for next year). Nonetheless, it's a great feature and it's hard to imagine any SmackDown game without it from now on. imageUrl=http%3A%2F%2Fpspmedia.ign.com%2Fpsp%2Fimage%2Farticle%2F675%2F675055%2Fwwe-smackdown-vs-raw-2006-20051212041609697.jpg&caption=Another nice gameplay addition this year is the inclusion of a Power Irish Whip. Performed like a Tekken throw (Triangle and Circle together), the Power Whip adds a small (but appreciated) new layer of offense. It's an ideal move to use for the Royal Rumble too, as it makes throwing people out of the ring a whole lot easier. Of course, you still have to contend with the Rumble's struggle meter from last year should you choose to grapple someone on the apron, but the stronger whip makes that process less painful.  But the mechanical additions don't stop there. One of the most impressive new features in WWE SmackDown vs. RAW 2006 is the ability to customize your character's grapple categories. In the older titles, grapple types were identical for every character (Signature, Power, Speed, and Submission to be exact) but that's not the case any longer. Now users only have to share two commonalities: Submission (down and grapple) and Dirty/Clean (grapple button by itself) maneuvers. The remaining three grappling categories can be customized with seven open choices (Power, Speed, Technical, Brawler, Martial Arts, Luchadore, and Old School) and it means that your wrestlers can be a lot more varied (or specialized if you prefer) than before. It also gives them a higher number of possible grapples compared to last year too, and that's a good thing. imageUrl=http%3A%2F%2Fpspmedia.ign.com%2Fpsp%2Fimage%2Farticle%2F675%2F675055%2Fwwe-smackdown-vs-raw-2006-20051212041607369.jpg&caption=Amazingly, there are still several other mechanical tweaks worth mentioning. The reversal system first implemented in last year's game, for example, has been fine-tuned to allow users to chain moves together for an attack / counter-attack string of up to three turns. It's a pretty cool little feature that adds even more reflex-based strategy to an already-better-weighted combat system. In fact, the reversal system gets a bit addicting once you've nailed the timing down and it made me wish that you could do a few more moves before ending a sequence. Other cool new additions this year include a brand new sleeper hold system (long overdue in my opinion), the ability to play possum for surprise ~small package~ wins, and two new player attributes (Hardcore and Stamina) that affect how well you can wield weapons and how fast your energy will regenerate.  As has been the case every year, though, SmackDown vs. RAW 2006 does run into a problem that shouldn't be too unfamiliar for seasoned players. Naturally I'm speaking of the AI. Though the CPU has been touted as ~much improved~ this year, it's still a little rough around the edges. Yes, players will have a harder time with dominating their computer opponents than before, but that's just as much a result of the new strategic gameplay elements as it is the AI's decision making. The actual planning and strategy of your computer opponents doesn't seem different from the older titles much at all (unless they're severely hurt, at which point they'll start searching for weapons to help). Otherwise, most wrestlers seem to approach you with the exact same tactic.  That said, the harder difficulty levels will still challenge you for sure, but that's mostly due to the fact that the computer's counter ratio gets pretty ridiculous and is harder to hurt. Longtime fans of the SmackDown series should welcome the new challenge just as I did, but as I alluded earlier, it would have been nice to have more diversity in opponents (at least you can customize a whole boatload of AI options with adjustable sliders, though, but it affects everyone as opposed to individual characters). Either way, this shouldn't be an issue in the long run as SVR2006 is meant to be more of a multiplayer game anyway. imageUrl=http%3A%2F%2Fpspmedia.ign.com%2Fpsp%2Fimage%2Farticle%2F675%2F675055%2Fwwe-smackdown-vs-raw-2006-20051212041606087.jpg&caption=While we're on the subject of multiplayer, it goes without saying that SmackDown vs. RAW 2006 supports the notion very well. There are a huge number of modes and options that players have at their disposal and there should never be a shortage of things to do. Gamers can hook up and duke it out with three other players for some serious four-person action. One of the best multiplayer features, though, is the ability to win and defend championship belts. Be they individual or tag team, you can win up to ten of them and even bet people money for titles if you want to raise the stakes. With a couple of friends and enough PSPs, the title match option can take up a good chunk of your time. The only thing I would have liked to see (just as I did in the console version), was the ability to create your tournaments.  Nothing says multiplayer like online... but the PSP version of SmackDown vs. RAW 2006 doesn't have that ability as its console predecessor does. As I mentioned earlier, though, the ad hoc option does offer a great deal of close-proximity fun. Almost every major match type is supported too, and just as in the set-top version, players can get together and trade created wrestlers with one another pretty painlessly. Even better is that you can move created wrestlers from the PS2 version of SmackDown 2006 and import them into the handheld one. Not bad at all. imageUrl=http%3A%2F%2Fpspmedia.ign.com%2Fpsp%2Fimage%2Farticle%2F675%2F675055%2Fwwe-smackdown-vs-raw-2006-20051212041609259.jpg&caption=Whatever your preference for multiplayer or single-player experiences, SVR 2006 still has a number of match types and goodies for even the most discerning wrestling fan. Personally, I really like the new backstage brawls and their highly-interactive environments. Likewise, the refined cage match (you can leave out the door now), ladder matches (multiple ladders), and Fulfill Your Fantasy bouts (half-naked ladies) bring new life to some old favorites as well, and the option to setup 2-on-3 matches or over the top rope battle royals has been a long time coming.  Of course, the new match type that's received the most press is probably the oft-requested Buried Alive contest. Allowing users to wrestle from the ring all the way down the ramp and into a giant mound of dirt, this mode can't end until one player stuffs another into a casket and piles a couple hundred pounds of earth on top of him. Personally, I found the match to be somewhat of a chore after the first couple of playthroughs (these things can take forever), but the effort is there and there's nothing wrong with it mechanically other than its length of completion.  Strangely, the season mode is both an improvement and more disappointing than last year's version. On the plus side, its more structured setup, better voice-acting, and WWE-style presentation really makes you feel like you're in the middle of World Wrestling Entertainment programming. The cool twists and turns and nods to classic feuds and storylines is a big bonus too, and the ability to play two entirely different years on two different shows is awesome. But then you have season mode's more unsatisfactory elements -- most notable the lack of customization and flexibility afforded to its earlier ~text-only~ counterparts. There's a lot less opportunities to branch off and do your own thing too, which gives it a little less longevity than season modes from the past. imageUrl=http%3A%2F%2Fpspmedia.ign.com%2Fpsp%2Fimage%2Farticle%2F675%2F675055%2Fwwe-smackdown-vs-raw-2006-20051212041608978.jpg&caption=To help combat this, THQ has also included the GM Mode (which frankly, I was surprised to see added to the handheld version). Borrowing its inspiration from the Madden and 2K line of sports titles, the GM Mode gives players full control over the WWE. They can draft all-new rosters for their shows, setup rivalries and feuds, try to raise the ratings of their favorite program, and move mid-carders like Heidenreich all the way to the top. It's a pretty cool diversion from the typical season-type match that we've grown accustomed to over the years and the ability to hop in and play or simulate any and every match is great. Those who don't like to cycle through a bunch of menus and read text, however, may not like it as much as I did.  But even if GM Mode isn't for you, the lists of things that can be done are pretty extensive. PSP gamers, for example, get three exclusive ~Arcade Mode~ mini-games that are surprisingly addictive (steer Eugene's arm-airplane down to the ring, play Texas Hold 'Em Poker, and take part in trivia), while your profile saves a complete record of everything you've accomplished. The console version's locker room feature is here too, but you can't customize it or explore it as you could before -- now it's just a collection of still screens. imageUrl=http%3A%2F%2Fpspmedia.ign.com%2Fpsp%2Fimage%2Farticle%2F675%2F675055%2Fwwe-smackdown-vs-raw-2006-20051212041608790.jpg&caption=Create-A-Wrestler and Create-A-Stable have been streamlined for easier access too, and you can even make stronger tag teams by developing the chemistry of your favorite squads. I'm also a huge fan of the new ~Create-an-Entrance,~ it's so much more flexible than the canned stuff from before that it'll be impossible to go back. There are literally dozens of other cool things to talk about as well, from the higher polygon count and post-match celebrations to the awesome challenge and better weapon balancing. The list is highly impressive.  Naturally, one of the biggest questions for PSP players who own the PS2 version of SmackDown vs. RAW 2006 is, ~What visual sacrifices does the handheld version make?~ Luckily, the answer to that question isn't too severe. Besides the lower polygon count for the wrestlers themselves, there's a slight loss of detail in the textures and audience members, but it's almost impossible to notice these unless you're actively looking for them. Unfortunately, there are a couple of random pauses that seem to happen in the middle of matches while the UMD loads (not an issue for the PS2) and the load times can get pretty bad sometimes.  There's almost almost no commentary except for during story cutscenes (which is okay, because it isn't so great), but at least we get an exclusive Jake Roberts character that can be unlocked and uploaded into the PS2 version... so that's something. imageUrl=http%3A%2F%2Fpspmedia.ign.com%2Fpsp%2Fimage%2Farticle%2F675%2F675055%2Fwwe-smackdown-vs-raw-2006-20051212042507584.jpg&caption=What makes WWE SmackDown vs. RAW 2006 such fantastic fun to play is its total accessibility. While everyone may not care for the Buried Alive match or Fulfill Your Fantasy, they can always retreat to GM Mode or defend one of their titles instead. If those options still don't tickle their fancy, they can always just make someone with the excellent create-a-character feature, or drop into an impromptu Season, or simply engage in an old favorite like Hell in a Cell. What's more is that the gameplay has made another noticeable step forward with its strong stamina and momentum systems and the adjustments to the rest of the gameplay are just as effective.What impresses me most, though, is that other than the load times, all of the same goodies from the console version were ported to the PSP with few technical sacrifices (the loss of a second analog stick and two shoulder buttons didn't hurt the gameplay one bit). And while I'll be the first to admit that the series could still work on its list of recurring problems, there's no other handheld wrestling game currently available with this much replay, value, or depth. In short, SmackDown lends itself extremely well to the handheld format.", "date": "Dec 13, 2005"}