{"name": "Snowmobile Racing", "name_review": "Snowmobile Racing", "ref": "https://www.ign.com/articles/1999/01/06/snowmobile-racing", "text": "Sponsored by GOAT Industries, makers of the ice-ripping GOAT HighMark, Snowmobile Racing throws you in the middle of sub-freezing temperatures strapped to the back of a high-powered engine on skis. Unfortunately, as inciting as this title sounds, Snowmobile Racing just doesn't have what it takes to place in the top ranks.  The biggest problem with Snowmobile Racing is the lack of menu options.  There are only four tracks to plow around: a frozen lake in Minnesota, a snowy farm setting in Iowa, a New England forest, and Yellowstone Park.  You'll wear these locales out quite quickly and, unlike some of the other racers on the market, raising the difficulty level doesn't increase the length of the track.  There's also only five different snowmobiles to choose from. There are no hidden tracks and no hidden vehicles - this game offers absolutely no surprises at all.  Maybe I'm jaded, but I've come to expect more out of contemporary racers than this.  To make matters worse, neither the documentation nor the in-game menus describe the difference between the five types of snowmobiles.  Some make tighter turns, some have higher top speeds, but you have no idea which is which until you actually try them out.    Another major problem with Snowmobile Racing is that it offers no real challenge.  Even in expert mode I was able to beat the computer-controlled opponents the first time I raced against them on every track.  This is ridiculous.  You'll play this game out in under two hours and then it's just a shiny $30 coaster.  The graphics in Snowmobile Racing are nice enough at a distance, but objects quickly become pixelated as you approach them - especially the snow that flies in your face from your opponents in the rare occasions that you're actually behind them.  The tracks are extremely sparse and everything seems extremely stiff ... the hay bails don't move, the snowmobiles don't dent, and there's even an invisible barrier that shoves you back onto the track if you happen to go over the guardrail after hitting a jump.  On the positive side, Snowmobile Racing really gets it right in the playability department.  The designers have paid special attention to icy surface physics and you really get the feeling of speeding through snow as the back end of your snowmobile slides around corners.   But, in the end, the gameplay isn't enough to make up for the lack of racing options.  The game is fun to play, it just doesn't offer enough variety to deserve your hard earned dollar.  -- Tal Blevins", "date": "Jan 6, 1999"}