{"name": "Rainbow Cotton", "name_review": "Rainbow Cotton (Import)", "ref": "https://www.ign.com/articles/2000/01/26/rainbow-cotton-import", "text": "I'm all for a mindless shooter - two of my favorite games are, afterall, Lords of Thunder (on the Turbo Duo) and Panzer Dragoon (on Sega's ill-fated Saturn).  Rainbow Cotton, a title whose roots lay in a series of 2D shooters (and one pseudo 3D shooter) for systems in previous generations, looked to be a dream come true for shooting fans everywhere, but something went horribly wrong somewhere down the lengthy line of development.  While the import is still worth a few play-throughs for shooter and fairy fans alike, one can't help but feel that with a li'l bit 'o play testing, we could've had a classic on our hands here.  There's big trouble in York Country as the demon Suede sends in his gooniest goons to steel the legendary Willow candy held therein.  With no counter measure on offer from the folks of York Country, the Queen of Fairy Country is more than just a little embarrassed, and calls upon her subjects to regulate.  One subject in particular, the fairy Silk, drafts Cotton, a mischievous witch who isn't particularly interested in retrieving the Legendary Willow, save for the fact that she wants to eat it.  You take control of Cotton, flying atop her broom through five stages of 3D shooting, taking out enemies ranging from giant eyes to flowers with giant eyes to fish-like things with multiple . . . giant eyes.  The crew at Success has assembled a wacky cast of villains, all of which perfectly compliment the game's wacky theme.  The end-of-level bosses are the best, as even the cutest creature manages to offer up untold, cheerful carnage.  The actual game system in Rainbow Cotton is the basic forward scrolling stuff found in Space Harrier - but, shooter fans wouldn't have it any other way.  Cotton has a life meter and shoots a single form of fire from her broom stick.  This attack can be powered up by shooting and striking enemies and objects, and one of the keys to advancing in the game is to make the blast grow powerful quickly.  Also available to Cotton are four different forms of bombs that can be picked up through the level.  And just like in the previous games, Cotton has a fairy companion following her throughout the levels and both attacking enemies and absorbing enemy fire.  By freeing up to five fairies through the level, you'll find yourself with quite the army.  Five stages may not seem like a lot, and, in fact, I was sorta hoping for a couple more.  However, the stages themselves are loooooooong, and usually consist of a mid-boss followed by the final boss at the end.  There are obstacles everywhere, and much in the way of variety.  You'll find yourself ducking beneath bridges, and blasting open walls to advance forward.  What's better, the stages aren't entirely linear.  By veering in a certain direction at key points, you'll find yourself on a completely different path, somewhat like what was seen in Panzer Dragoon Zwei years ago on the Saturn.  This all may sound like heaven in a GD-ROM for shooter fans, but it's not, and the reason is quite unfortunate.  Success screwed things up in major ways here and there, primarily with regards to control.  You move Cotton about using the analogue thumb pad.  Sure, no problem there.  Unfortunately, if you let go of the pad, Cotton floats back to the center of the screen.  Whoa!  Someone fell asleep in Analogue Control 101.  Keeping your sights centered on an enemy long enough to destroy him is incredibly difficult until later in the game, when you can usually kill the standard enemies with just one shot.  You'll find yourself missing out on so many enemy kills as a result of the weird controls.  In fact, I'm not sure if it's actually possible to kill every enemy you encounter in a level.  I was able to get used to the controls after a while (maybe Rainbow Cotton actually managed to improve my analogue control skills), but it never really felt right.  Beyond that, there are other problems that make the package come off as somewhat unpolished and poorly planned.  There are some collision issues, where I managed to get Cotton stuck in the ground, getting hit over and over again until she died.  And as much as I can't get enough of hyper-cute Cotton's back and her well-animated broom, your view of the action is obstructed far too much by these foreground objects, making it difficult to see an enemy, much less kill it.  It's too bad Success couldn't fix some of these problems, as most of it could've probably been discovered through play testing.  They've assembled a cool package in Rainbow Cotton, in all areas of presentation at least.  The game looks absolutely superb, running in high resolution and at a consistent 60fps with lots of animation for Cotton herself.  It looks like a cartoon world come to life on the Dreamcast, and fits in perfectly with the cell-based animation sequences before levels and boss encounters.  Success also did great things with the sound, as the game features a memorable score and non-stop commentary from Cotton and her fairy companions as they fly through the levels.  These things don't save the game, unfortunately.  There is, without question, some amount of good gaming to be found in Cotton, but the controls will frustrate initially, and anyone who gets far enough into the game will probably find themselves frustrated at not being able to ever realistically make an attempt at killing all the enemies.  It's salvagable, though, and shooting fans everywhere would no doubt appreciate it if a US gaming company would take the game, implement a few quick fixes here and there (see Space Harrier and Panzer Dragoon for an example), and bring this game to us, fairies, witches, and big-eyed enemies in tow.   -- Anoop Gantayat, IGNDC", "date": "Jan 26, 2000"}