{"name": "Bankshot Billiards 2", "name_review": "Bankshot Billiards 2", "ref": "https://www.ign.com/articles/2005/12/22/bankshot-billiards-2", "text": "While pool games have never really taken the videogame world by storm, there is a small niche out there dedicated to virtual pool, gamers that enjoy their billiard action without tattooed hustlers and pesky prostitutes blowing smoke in their faces in crowded pool halls. For 1,200 Microsoft Points, or roughly $15, you can now download Bankshot Billiard 2 on Xbox Live Arcade and get your hands on a pretty nifty pool title. With a wide variety of games including trick shots and golf, along with spot-on ball physics, Bankshot Billiards 2 is as close to a full-production title that you are likely to find on Xbox Live Arcade.    Eight Ball, Nine Ball, Three Ball -- if there's a pool game out there, you can probably play it in Bankshot Billiards 2. Especially enjoyable is golf, in which you play 35 situations, each with a set par, and try to avoid hitting strategically-placed red balls that act as hazards. There's also a great Trick Shot mode in which you can do thinks you may have thought impossible on the felt. In fact, after playing a few trick shots, you'll get a hankering to set up your own table and play. If you don't know all the different kinds of pool games out there, like Euro 8 Ball and 14.1 Continuous, then you'll find Bankshot Billiards 2 doesn't do the greatest job explaining the rules and that you'll spend a lot of time in the help menu.    Try some trick shots to impress the ladies. All of this would be mute if Bankshot Billiards 2 didn't have a great physics system, which it does. The first thing you'll happily notice is that breaks separate differently, even when using the same exact aim and power settings. After some practice, you will really feel like you can get the balls to do exactly what you want them to do. With the ability to aim your stick on any part of the cue ball, you can throw some English on and curve your way to victory. You can also adjust the angle in which you aim the cue, so you can come straight down on the ball if you like. The power setting is self explanatory, but you'll notice that 100 percent sends the cue ball off in a light-speed blur that may just be physically impossible. Still, it's fun.   The single-player mode could have been better if there was some personality in the game, like computer characters to play against. Instead, you play against good old CPU1 every time, which sucks because he's pretty good and CPU1 will probably beat you most of the time. Where the game shines is in multiplayer mode as you can hustle your friends in person or via Xbox Live. $15 is kind of a stretch for the game, but if you know and enjoy pool, you'll get to know and enjoy Bankshot Billiards 2.", "date": "Dec 22, 2005"}