{"name": "DOA 4", "name_review": "Dead Or Alive 4", "ref": "https://www.ign.com/articles/2005/12/29/dead-or-alive-4", "text": "Team Ninja might work in mysterious and confusing ways, but the well-known Japanese development team always delivers tough, beautiful, and compelling games. Dead or Alive 3, Ninja Gaiden, and its re-make, Ninja Gaiden Black have all spoken to and been targeted to hardcore players willing to put in extra time to reap the riches found deep inside them. And now Dead or Alive 4, the team's first creation on Xbox 360, takes the fighting series to new, divergent levels with Tomonobu Itagaki's infamous brand of knockout graphics and a much more serious level of fighting.   At first glance, Dead or Alive 4 might seem like more of the same...with better graphics. The visuals comprise relatively similar looking characters heightened in detail with backgrounds that will make you look twice. But graphics don't a fighting game make. The Dead Or Alive series always has been criticized for its simplistic counter system and lack of depth. Dead Or Alive Ultimate was adept at taking the game online, but didn't provide the long-term fighting experience for which gamers were hungry. Dead or Alive 4 addresses every issue thrown at the previous iterations in the series with varying degrees of success, tackling everything from the counter system to cancels, the ground game, blocks, and interactions with the environment.   But once you get past the button-mashing phase and are finished enjoying the novelty of having a new Xbox 360 game, you'll find the game has changed pretty significantly. The counter system is less forgiving and will definitely challenge fans of the series, especially those fond of DOA3. This affects every other area of the game. The harder characters to master are even more powerful now, and there is more of a ground game, in addition to careful use of the backgrounds. And the online game is definitely improved. The question, however, remains unanswered -- will you like the changes?   You too can capture screens and save them with as much blur effect as your want. Hey, Good Looking  In this first wave of Xbox 360 games, one is hard pressed to argue that Team Ninja's final version of Dead or Alive 4 isn't one of, if not the best, looking game on the juvenile system thus far. Anyone worth their salt making fighting games these days has to endeavor to match the intensity and layered fighting styles of Sega's Virtua Fighter, the profound technical depth of Namco's Tekken, or the smooth grace and immense fun of Soulcalibur -- all of which look excellent on the current generation of systems. DOA4 does a few things extremely well, while remaining relatively static in others, but does indeed move the graphic factor up a notch in this next generation.    For starters, the speed with which each of the characters moves is incredible. This game blazes away at 60 FPS with nary a hitch, and the art team worked diligently to create smooth animations that blend between every move, fall, throw, and taunt. With the powerful Xbox 360 grinding away in the background, Itagaki and team have created a fighter that will satisfy your twitchy split-second demands without any issues. Oh yeah, and DOA4 loads in four seconds. Yes, it will load in four seconds from any mode of play.   The characters, on the other hand, are a mixed bag. It's not that they aren't good looking. They are. They're intricately detailed and imagined with flourish and style. Kasumi, Leifang, and Ayane, for instance, show off noticeably flowing silky hair. All the characters display special moves and superbly motion-captured animations that are worth watching repeatedly. When the characters grapple each other you won't see the clipping or body melding seen so often in wrestling games. These characters grab each other with precision and eye-catching animations. Characters such as Ryu Hayabusa, Jann Lee and Bayman all show increased musculature and heightened emotional intensity. Bungie's Spartan-458 looks excellent too, fully suited in specialized Mjolnir armor.   But none of the characters have made a significant graphic jump in design above their predecessors. The women still look like satin dolls and the guys like burly thugs. It's not a big gripe, but one that's worth discussing a little given the advances in current videogame facial expressions and potential emotional output. The character design is more of an amplification of the previous roster's clean looks than a major shift or advancement. And when compared to the spiffy backgrounds, they stand in even greater contrast, looking simple and unrealistic. Perhaps that's just a peeve of my own, because the game overall really does look great.   On the other hand, from both a visual and a functional standpoint, the background environments are terrifically designed. Following the dynamic set of environments from DOA3, this year's model features levels that highlight destructible objects, exceedingly gorgeous effects, multiple breakaway sections, moving backgrounds, and animated creatures and vehicles. There are dozens of examples. Waterfall Valley, Kyoto in Bloom, and Temple on the Mountain boast the game's gorgeous photorealism. The trees still look like cross-polygons when viewed under a microscope, but on first and second inspection, they're damn good looking. Falling leaves and cherry blossoms create a feeling of place and realism. You'll constantly see up-close focus and distance blurring working all the time. And the river water looks and moves with impressive motion. The Las Vegas level, Gambler's Paradise, shows off water, too, only you'll see reflections with more intensity: puddles on the street reflect the city's bright lights and structures with impressive realism, while also affecting the fights themselves.     The cheetah in the Savannah Safari level, among a handful of newly implemented interactive levels, exemplifies DOA4's new meaning of fun. The cheetah will pace between a tree and a large rock while you fight. If the fracas gets close enough he'll pounce from his spot and run you or your opponent (or both) over. You can also use logs and rocks to your advantage by knocking enemies over them. Unfortunately, the opponent who tries to jump over to get back into the fight is usually at a disadvantage. Likewise, in Vegas, cars will plow down the street and, if you're not careful, they'll do serious damage. You'll see the Warthog drive down the street, too.  In Experimental Playground a pterodactyl will fly around the level, and if you're not careful, it will perform a fly-by and graze you to cause a little bit of damage. Even the water, whether it's in the form of puddles or streams, increases the amount of health taken off by an attack. The environments are impressive from all angles.    Mo Subtle, Mo Deep  In the past, Dead or Alive's fighting game generally consisted of hurling hefty combos at enemies while mastering a generous counter system and using environmental damage to one's advantage. Some characters required slower, timelier grabs and punishing throws, while others were built on quick combos, pokes and mixed high-low attacks to get the job done. The game always relied on a short, quick life cycle making for devastatingly speedy games. DOA3 wasn't terribly deep but it wasn't that shallow either. DOA4 adds a significant move count to each character, while changing some moves around, which is bound to annoy regulars of the series. The charge move is fiercer, the cancel moves are relatively new, and the throw counters pretty much blow by everything. Some of these changes are relatively easy to adjust to, given that everyone will begin from the same starting point.   The counter system will, however, make or break your love for the game. While we weren't able to get an exact breakdown of the frame count in DOA4, the window of opportunity for counters has probably decreased in frame count by nearly half. So, if you had about 22 frames for the old counter system, you'll have about 12, maybe 13 or 14 for this new one. The result is a far greater level of precision to execute a counter, making them harder to pull off. Additionally, each counter doesn't do as much damage. This significantly affects every aspect of the game. Before, you basically had a giant counter bonanza at your fingertips. Now, counters are neither free nor easy. You'll have to time the opponent's attacks at a high, mid, or low level in addition to throws (a second mid level) with a press of a button and a direction to counter.   Of the two new characters, La Mariposa stands out with a vibrant Capoeira fight style. It's not that hard, but you'll need time to learn the new counter game. In the long run, the adjustment is good for the series. It deepens the fights to a subtler, more complex level, requiring better timing, a wider reliance on specific blocks, and even a better knowledge of the environments around you. In the short term, you're going to be a little pissed off. You cannot simply play this game like DOAU or DOA3.   In addition to the tougher counters are the resulting fighting elements such as stuns and pokes, and a slightly deeper ground game. You'll also notice that each attack doesn't diminish the enemy's health as quickly as before, so most matches will last a little longer. On this same topic, an environmental attack such as knocking an enemy down a flight of stairs won't kill the opponent. It may take off a healthy chunk of life, but Team Ninja's health meter differentiates between enemy and environmental damage, so when you are knocked down a flight of stairs or rammed off a bridge and you were already low on health, you'll always have one sliver of health remaining.    The new ground game is interesting because it's based on your ability to counter successfully, tying the two together and really pressing the need to learn the timing on counters. If you attack an enemy with a high or a mid punch, for instance, and he counters these successfully, you'll hit the ground and be denied an instant get-up attack, unlike DOA3. This leaves you vulnerable to guaranteed ground and jump attacks. While on the ground you can roll, however. Also, if you are knocked down by a regular attack, you can stand up again with a get-up attack -- so that move still exists, but just not for high counters or counters. This makes things interesting, favoring the skilled counter player over the button-masher.    There is a slightly greater diversity in all the characters because of the new moves, but the new counters and blocking also force players to specialize more. Characters such as Tina and Eliot, which are great for linking multiple moves together, are even more powerful. A character like Jann Lee seems incredibly powerful to the novice user -- and he is indeed powerful -- but all his moves can be blocked and if done successfully, he's left open for long periods of stun time, granting the opponent a bigger window of opportunity. Bass, who is pretty hard to master and is built for the grappling fan, is even more powerful than before. The SPARTAN-458 character is also fun with which to experiment. The Spartan fights like a combination of Bayman and Bass. She is a slower character dealing heavy damage with sweeping powerful attacks, and the sweet plasma grenade combo will have Halo fans in a tizzy. It's a three- to four-punch attack ending with a sticky grenade that gets shoved in the enemy's rib cage for a knockout finale. You'll have to really like the slower, meatier characters to get into the Spartan; she's one of those fighters who, once you learn, will be hard to combat.   Big Diversity  DOA4 is a hefty game filled with modes, unlockable costumes, hairstyles, characters, and levels, and enjoyable things with which you can fiddle. From the moment you turn on the system, you'll be able to play as Kasumi, Kokoro, Brad Wong, Bass, Jann Lee, Tina, Bayman, Ayane, Hayabusa, Hitome, Eliot, Zack, Leifang, La Mariposa, Christie, and Hayate in the Story mode. The six other characters, which are unlocked by beating the game in various ways, include Gen Fu, Leon, Ein, Helena, Tengu, and Bungie's very own female SPARTAN-458.      The game offers many modes of play: Sparring (a deeper, better training mode with tons of useful options); Watch (program two AI characters to fight it out endlessly), Album (you can take shots in Watch Mode) and place them in this gallery; Movie Theater (watch all the ending movies); Ranking (how you rank against the world's best); User Profiles; Battle Viewer (playback all saved games); DOA Online (online play); Story (eight single-fight matches including the final Alpha 152 boss fight), Time Attack; Survival; Team Battle, and Versus.   The Story mode end-movies are extremely far reaching in content and style. Some are insanely hilarious, while others are dead serious. Zack's is an Indiana Jones/Bugs Bunny/Mortal Kombat parody, for instance, while Brad Wong's is a trip down psychadelic lane. They're all worth watching.   There are 45 achievements spread across all modes, which is an extraordinary amount of achievements. You'll unlock one by beating the story mode once, another by playing the game for five hours, another for playing it 10 hours, another by beating the timed mode in a certain time, and more. A bunch are unlockable by vying online, like playing 50 matches unbeaten for an achievement, or surviving 100 matches unbeaten online. Itagaki likes to make you work for everything. Team Ninja's trademark sense of humor is also well captured in the online mode. If you lose five times in a row, you'll earn an achievement...of zero points. Nice.   Hang out with trees, pandas, and foxes for fun while waiting to fight.  Online  DOA4's online game, the mode many fans are most anticipating, doesn't disappoint. In fact, the online mode, which is one of team's biggest technical challenges, is easily the most fun component of the game. The modes, Quick Match, Custom Match, and Optimatch, are standard in design, but the options are designed for online players to tweak and fiddle each fight setting, creating diversity and keeping players' interest over long periods of time. You can customize an avatar, play matches, check user profiles, and see world rankings.   The funky lobbies and avatars are stupid fun. Each fight earns you a higher or lower grade as well as Zack dollars. The grades help distinguish your ranking as a fighter (which can help make for better balanced fights when setting up matches in custom or optimatch), and Zack dollars enable the purchase of avatars, custom parts, lobbies, ornaments for your lobbies, additional costumes, and items with which you can outfit your character. For instance, you can purchase a scuba mask or a top hat for your character, who will wear that item while fighting (a little like the system in VF). Avatars range from ninjas to pandas to octopii to ghosts and trees and they're all superdeformed. The online visual design is far, far removed from the offline game's design, so visually it's a little offputting. Wait, my avatar is a pig? A tree? A squid? But like I said, it's stupid fun, even if it's a little bit of a disconnect from the game proper.   The actual online fighting is technically sound and impressive. Graphically, the game doesn't suffer in any noticeable way. The game looks and plays the same. Nintety-nine percent of my fights were totally lag free. One of my matches hit big-time lag, but the result wasn't a repetition of Call of Duty 2's assault on your sanity. Instead, this game moved in consistent slow motion, so even though it was clearly affected, the result was like fighting in slo-mo. The online mode features excellent game types and an assortment of great options. You can pick game types including winner stays, tournament, team battle, survival, loser stays and kumite. The tag team matches are awesome: you can play with three other people in team-switching fights, which makes for an enormous amount of fun. The lobbies hold 16 people, too, so you can goof around while in all sorts of weird environments.   Both Custom and Optimatch are well handled. While searching for an online game in Optimatch, you can see all the stats of the host and game type before joining, or search for another match. Details include important things like connection speed, language, status, match point, and round count. When setting up an Optimatch, the options are really impressive. You can pick an avatar, receptionist, lobby, session name, game type, TV kind, battle type, life gauge, match point, round time, max number (2-16), friend slot (2-16), grade, language and flag. The most important parts are the last ones --max number and friend slot. With these you can not only create custom sessions, but you can save spots for your friends instead of mistakenly letting a bunch of random people show up to your party. When you're not playing, you're either sitting in a lobby goofing around or you can enter into watch mode and take a peek at the upcoming competition. Even in Quickmatch with the preferable ~winner remains~ setting, the online experience is good. You win and stay, while the next challenger picks the setting, and you can pick another fighter in between bouts.DOA4 is a move in the right direction for the series in the long run, even if, in the short run, the changes to the counter system, blocks, throws and the ground game are a little annoying at first. The fighting is now deeper and more sophisticated, and while it may not seem so at first, there is a solution to every attack. For instance, if you see the warthog driving toward you in Gambler's Paradise, you can jump it. You can still counter nearly everything, and the ground game and the use of the environment is much greater. DOA4's online mode is also a tremendous improvement, giving the series another layer of play that should take off and breathe new life into the series. The game is also incredibly funny, too. The breadth of game endings is vast, and some are incredibly hilarious (Zack and Kasumi for starters).", "date": "Dec 29, 2005"}