{"name": "King Kong", "name_review": "Peter Jackson's King Kong", "ref": "https://www.ign.com/articles/2006/01/05/peter-jacksons-king-kong", "text": "There's no avoiding this big guy. Thanks to the big-budget movie from cinema craftsman Peter Jackson and the similarly intense videogame creation by videogame auteur Michel Ancel, King Kong is everywhere. Arriving a little bit later than the console equivalents, Kong has now taken on the PlayStation Portable. For this handheld edition, Ubisoft has trimmed down the main Kong game (unlike the ill-fated DS version,) for a slimmer, shorter portable version of the ferocious console adventure (with some multiplayer frills thrown in for a little extra to stomp through on PSP.) Shrunk down to just a few inches instead of his usual 25 feet, Kong is still strong, but some flaws and shortcuts taken to make this port take a lot of the power out of his roar.  The trims to the PSP version generally leave it still with a mean-looking face, with levels cut out for technical reasons as well as for time restrictions in re-fashioning a handheld version of the game. The Montpellier team at Ubisoft worked with Phoenix Studio (who some might recognize from the cute kid's game Winnie The Pooh's Rumbly Tumbly Adventure ... although I doubt it) in bringing the game to PSP, and for the most part, the trims are excusable. We get fewer of those cool minor critters, but the key creepies (the crab monsters, the megapedes, the raptors, the vampire bats, the swampcrawlers, and the rexes) are here. Unless you've played the console game, you probably wouldn't even notice that anybody's missing -- a gaggle of spiders crawling over a key have instead been replaced with a brushfire puzzle, and only one Rex chases you on the river instead of two. Your shipmates have also mostly been given the boot, showing up in cutscenes but never accompanying you on the island. Since Ann was the only character that really made a difference (all of her puzzles are either given to Jack to do alone or else trimmed out), that's no big loss either. Instead of interactive cinemas of Jack rowing to Skull Island or being tied up as Kong steals Ann, you get FMV from the console game of the sequences -- again, no big loss. Some cuts actually streamline the game, getting the annoying characters out of your face and putting you man-on-beast with your enemies.    However, there's only so much you can excuse for a game that's left with only half of what it once was. Sure, it's a portable version, but you're still paying the full $50 here, and even if there wasn't a console Kong, the short 4 or so hours you get on PSP doesn't feel substantial. I hadn't played the console game before I played the PSP version, but I still could feel a big gap when I got to NYC and had just barely caught a glimpse of the T-Rex -- the famous encounter in the ruins isn't in the PSP version, and other than as Kong, you only see the Rex as you escape in a short raft sequence. You don't get natives attacking with fire arrows, you don't get to hunt raptors while on the ground of a brontosaurus stampede, and apparently, you don't get one of the T-Rex encounters shown on the box (we're a little confused about that, as it's clearly PSP game engine, so maybe this was cut at the last minute?) You also don't get cool unlockable extra features (handheld version or not, those trinkets could have easily been packed in,) and unless there's some heroic feat that we haven't been able to accomplish, there may be no prize in playing through the game a second time for points (the rumor going around says you need 250,000 points for the hidden ending, but Ubisoft wasn't able to confirm this, and good freaking luck scoring that high.) Overall, the PSP game contains 15 chapters, while the full console game has over 40.      Is what's left in for the PSP version good? Mostly, but again, even those experiencing Kong for the first time with this version will feel like this is short on the meat. You can really feel that something's missing in the stages where you play as Kong. These stages still look mighty, with the big ape beating the pulp out of dinos and creatures, but every one of them was a breeze -- it was hard to get killed, and it never made sense why Kong was fighting or where he was going. One look at the console game and you'll know why. Because Ann isn't shown to be in Kong's hand or in the grips of enemies, there's no danger of losing her. The game just goes through the motions of the fights. Kong goes from point A to point B, beating up everything in his path. Because you don't have to race to save Ann or fight and suffer to give her time to get away, there's no risk in these missions. As Jack, you're only ever facing maybe two or three creatures at a time, and since the hit points are the same on creatures as the console game, it's not difficult for players to clear out the predators. There are still bugs and critters to lure bigger enemies away from you, but since there are few creatures in any given area, baiting does little in gameplay.  When the PSP game is running strong, with the creepy megapedes slithering through caverns and ducking under bridges or with the raptors leaping across chasms to come get you, it's as harrowing as anything you could imagine from a King Kong game. The gameplay is fine on PSP, with a decent framerate throughout and some key thrills will grab you. The FPS stages playing as Jack control just fine with the single-analog set-up of the PSP (it doesn't take pixel-perfect accuracy to throw a spear at a dinosaur.) Kong is a force to be reckoned with, and aside from a little glitch when the big ape lands (he floats in the air for a second) as well as some frustrating control limits in New York to keep him limited to single-story buildings, the great ape comes across as fierce on the handheld screen. The key memorable moments from this game are something you have to experience at least once in your life, no matter what system you play the King Kong game on. I'll probably never forget when I tossed a speared fish over a giant dinosaur's head so that I could reach a fire I could see off in the distance, only to have a smaller raptor surprise me as he leaped across a chasm just as I got there.     The visuals on the PSP version are surprisingly faithful to Peter Jackson's lush valleys and dim caverns ... just do yourself a favor and wear horse blinders until you've finished the PSP game before you look at any console version. Kong, of course, looks awesome, with detailed animation on his face and a sense of scale that proves he's king. The levels are gigantic and filled with trees, brush, bugs, and dinos. There's a surprising wealth of background detail, with statues modeled in corners of temples most would never think to explore. Stages are technically the exact same as the console version, with almost every rock and bush in its place. Physics are the same as well, with spears falling at the same rate and many of the cool little extra abilities (like the ability to knock a T-Rex off a cliff) represented well by this advanced portable. However, there's almost no lighting in the PSP game, which is disappointing, leaving everything grey and dark until you finally hit New York (and especially heartbreaking when you see the brilliant dusk stages from the home game here rendered in the same nighttime gray as the rest of the game ... it would have been hard to think those kinds of bloom effects could have been done on a handheld, but still, give us something, please.) There's also severe texture tearing, sometimes leaving the edges of polygons outlined in white dots that really hurt the realism. Sound effects are also ripped straight out of the big version of Kong, and with good music and nasty sound effects, the audio comes off well with this pocket version.     As decent as the control and visuals are, the impact of the PSP Kong is lessened greatly because of how it was rushed, which is a shame since the developer took care to get some other things right. In a game that's all about presentation and emotional impact, the PSP game has so little to feel, expect maybe confusion. The story is hardly here in this handheld game -- you almost have to play the console game to know what's happening since much is rescripted from Peter Jackson's movie. A biplane flies overhead in the opening stage, which would freak out anybody who's seen the flick -- what's a plane doing flying over this previously undiscovered island?!? -- and you're never told that this is the guy dropping the crates full of guns that you find (which aren't on parachutes here, they're just boxes of modern weapons in the middle of the lost world.) The ~Kong To The Rescue~ stage never says who you're rescuing, or where they need to be rescued from. Kong just leaps in and goes, and then after you beat up a T-Rex and open a gate, the stage ends. A few cutscenes or extra dialog lines would have done wonders, but instead, we get whatever scraps that could be scuttled from the home version. (And by the way, the map cutscenes are stupidly shown on PSP as letterboxed inside letterboxed, taking up about a quarter of that big, beautiful screen -- how the heck did that happen?) A silly multiplayer mode was grafted onto the game, which offers mild extra value. On one hand, it's got both competitive and co-operative modes (you don't deathmatch, but co-op is set at double-difficulty, while competitive has each monster get double hit-points for your opponent if you're the first to kill it), but neither mode has you actually seeing or fighting the other player, and since the monsters have scripted AI, the experienced player will still breeze through it and leave the other guy in the dust. There's also no Game Sharing (or online, which is typical for PSP unfortunately), so unless you have a friend who has the game, actually playing multiplayer might be a rare occurrence.   After playing the PSP version of King Kong, I was left wondering what the big deal was with gaming editors raving about with the handling of the Kong license. It felt like a good game, and I certainly figured that the home game had some cool stuff that just couldn't be done on PSP, but this didn't feel like the great and amazing game that I had heard about. Then I played the home game, and found out what it was that I was missing...Which leaves the PSP version in an odd spot. The control is decent enough for some fun dino hunting, the kind of deep jungle danger that we haven't had much of since the original Turok (and haven't had any of on PSP), but the handling of the story is messy and confusing. That, and the lack of bonuses, the easiness of the second play-through, the ho-hum multiplayer, and the short overall length make it only worth a borrow or rental. And if you're going to borrow any version of this, it'd be silly to get this one -- every home version of King Kong towers above this one, and it's really not the kind of game that you'd want to settle for just a little bit of. If everything was tight in the PSP game and the developers had been able to open up the levels or AI a little bit, it might have been a handy second copy to keep with you and romp through -- maybe if this version had been given time and shipped with the DVD in a couple of months rather than rushed out with the movie release -- but that's not the case. King Kong just isn't that big on PSP.", "date": "Jan 5, 2006"}