{"name": "FIFA '99", "name_review": "FIFA 99 Review", "ref": "https://www.ign.com/articles/1999/01/08/fifa-99-6", "text": "1998 was a strong year for Electronics Arts. After World Cup 98 and the excellent NHL 99, EA Sports' Nintendo 64 titles seem to be pushing the N64's hardware more with every release. FIFA 99, the latest in the successful FIFA series is no exception. Rivaled only by Konami's International Superstar Soccer series, the Software Creations co-developed title is easily the best-looking console soccer game so far -- and it's got plenty of gameplay to boot.The Facts Real-time lighting effects, such as tribune and goal shadows. 20 new stadiums from around the world. Improved response or player commands for pinpoint passing, shots, and dribbling. New chest trapping for more directional control, allowing you to shield the ball from defenders' attacks. Better AI for wing play and tackling. Better air control, with bicycle kicks, volleys, headers and scissor kicks. Player fakes and jukes Semi-automatic goalies. More than 250 clubs from 12 territories. Season mode with more leagues and cups, and cup/league creation. European Dream League play. Quickstart Mod. N64 Rumble Pak support. Multiple speed settings. Four players simultaneously.LicenseOne thing EA's soccer always had over Konami's ISS titles is the strong player, team and stadium licenses. Instead of primarily trying to recreate the World Cup tournament like most of its competitors, FIFA 99 squarely focuses on the European league, with a whopping 250 soccer teams battling for the cup. You can also select plenty of non-European teams, but with the exception of the Brazilian league, they aren't faithfully rendered. EA should have spent a little more cash to include the MLS and all the major South American league licenses as the game's appeal is definitely diminished without them outside of Europe. And how much could the J-League license possibly cost for a game published outside of Japan? As usual, Ronaldo fans will also have to do a bit of name editing since he's under contract with Infogrames for a while. These small gripes aside, this game certainly comes across as an authentic representation of FIFA soccer.GameplayIf you've been following the FIFA series on N64, you know that EA Sports has been improving gameplay and graphics steadily from the beginning, and FIFA 99 is no exception. For starters, the AI has received another upgrade. Instead of blindly attacking at all times, the AI opponents are more relaxed when the ball is still in your half and tend to not run around so much until you get closer to their half. This definitely makes for more realistic soccer, although it also promotes time play to a certain degree. If you're ahead one goal, simply keep the ball in your half and slowly play back and forth. The ref should whistle after a while, but he doesn't. Naturally, this isn't a concern in the multiplayer mode.Allied players behave more intelligently and allow for much better wing play. Say you're attacking over the right wing and turn to pass towards the goal -- in FIFA 99, you can be sure that one of your players will be there, ready to intercept the ball (unless the opponent is there first), take it volley or try to head it into the goal. Another AI improvement concerns the goalie behavior. In addition to the fully automatic goalie support seen in previous installments in the series, FIFA 99 also features semi-automatic controls. Not only can you pick up the ball if the goalkeeper has trapped it with his feet, but you can also take control of the goalie at the touch of a button if you're worried that the computer might mess up.On the control side, the developers finally tightened things up with interruptible motion capture animations. Previously, turns weren't interruptible, which meant if you started turning around, you had to complete the motion before changing direction again. In FIFA 99, you can fake the opponent out by quickly changing direction, resulting in a much faster, better controlling game. It is also much easier to keep the ball from going out of bounds when near the sideline. It's still not as responsive as the ISS games, but controls become second nature after only a few minutes of play.Compared to its predecessor, FIFA 99 also dishes up a much more varied lineup of game modes, including a European Dream league and Cup Creation modes: Training: Play a practice match with a selectable number of players or practice penalties, etc. Friendly: Your basic friendly match. Select from more than 250 club teams from 12 territories. Quick Start: Set up two default teams and save them to your memory pak. Everytime you select Quick Start, you will instantly play with those two teams. European Dream League: A league consisting of the best European clubs, including Liverpool, Manchester United, AC Milan, Real Madrid, Barcelona, Arsenal, Paris St. Germain, Bayern Muenchen, Feyenoord, and more. You can choose to play as many teams as you like. Golden Goal: Play a quick golden goal match with two teams of your choice. Season: The heart of FIFA 99 lets you create either a full league or a cup by selecting the participating teams, naming the cup, and so on. You can even determine the starting month, number of teams, matches per team, and more. Too bad you're confined to playing a single season and can't keep the same team for another year.In addition to its wider variety of modes, EA wisely included a Player Edit and a Team Edit function (which was missing from World Cup for some annoying reason), so you can keep your teams up to date. Like in FIFA 98, you can change face maps, give your players names, adjust attributes, and so forth. However, there are still no separate height and weight attributes for players. You need a memory pak to save, of course, and FIFA's quite a memory hog, much like EA's other sports titles.As every year, EA has also increased the number of motion-capture moves in the game. New animations include directional chest traps (where players use their chests to guide a lob to a desired location), slide hooks (a spectacular looking one-timer shot), and dummy moves (fake the receipt of a lob to mislead defenders). Like in FIFA 98, injured players will also limp visibly if you don't exchange them for a new player.You can pull off the following standard moves: Defense: through pass, intentional foul, jump slide tackle, juke left and right, 360 spins. Goalie: goalie charge, pick up ball, drop ball, throw, punt. One-Timers: first-time pass, lob, through pass, and shot. Offense: chesting, offensive header, head to team mate's chest, head to team mate's feet, volley or bicycle kick, volley to teammate's chest, volley to team mate's feet. Skill Moves: Fake, rainbow kick, step-over nutmeg, dive (intentionally fall to get a penalty).Naturally, the game features the usual array of in-game strategy management (IGM), popularized by Konami's ISS. In addition to determining formation and attack pattern, players can also choose four strategies that can be toggled on the fly (by pressing Z and one of the C buttons), such as offside traps, wing attacks, through-ball runs, and so on.MultiplayerFIFA 99 wisely continues the tradition with multi-colored markers for the four different possible players (instead of same colored shapes for ISS team mates). As in FIFA 99's predecessors, multiplayer matches is where it's at. The customizable speed settings help make things more interesting for action sports fans as well.GraphicsWitness the return of NHL 99's gorgeous medium/hi-res mode. FIFA 99 runs at 640x240 and pumps out almost photo-realistic graphics at times. The players still look a little robotic and it's time for some new hair and face textures, but the motion captured animations are fantastic. EA has managed to speed up not only the controls and the overall game (it takes only a split second for the game to cut to corner kicks), but also the framerate. While it's still not as smooth as ISS (why do I feel like I've written this before?), it's definitely more playable than any of the previous EA soccer games. And considering the amount of detail and the sharp resolution, the overall lower framerate (mostly notably during the kick-off animations and when many players are on screen) is really a small price to pay.A non-publicized hi-res option for 640x480 graphics (dubbed ~super hi-res~ by EA) can also be found in the options menu if you've got the RAM Expansion plugged in, but the difference is almost negligible and it knocks down the framerate even further.Presentation is fantastic. Players argue with the refs after fouls, limp when injured and console their buddies when a penalty kick misses its target. The stadium models look great, but EA has taken quite a few liberties, so don't expect 100% accuracy. Like in NHL 99, the surface deteriorates over time. Cool. And as with every new EASports title, the menu designers have worked overtime to come up with beautiful looking, well conceived interface graphics. This is definitely the best-looking console soccer game out there.SoundThe sound, like in all previous FIFA installments on N64, is in Dolby Pro Logic Surround with John Motson taking over the commentary. Yep, Andy's gone, probably out of space reasons. With Acclaim and Factor 5 pumping out hour-long commentary in their games, it would be nice if EA finally made a step forward and licensed (or developed) more efficient speech compression to include all the commentary. Still, Motson's sparse play-by-play is usually on target and the overall audio is certainly impressive. As an added little bonus, Fat Boy Slim's Rockafeller Skank plays during the menu screens.It's no secret that I'm a big fan of Konami's ISS series, but I have to admit that FIFA 99 is right up there on the winner's podium for best console soccer game. FIFA still doesn't have the smoothness of ISS, but its presentation, incredible number of moves, strong AI, and beautiful medium/hi-res graphics run circles around Konami's game. The new custom league modes are great and make for an engaging one-player experience, but hook up three more controllers and you'll be in soccer heaven. Control is much tighter than in its predecessor, but I'm still waiting for that one soccer game that combines the smoothness of ISS with the options and presentation of FIFA. A definite upgrade from World Cup 98 in all respects (player creation mode, league play), but owners of the previous FIFA game will want to look for some kind of a trade-in offer. Good job, EA.", "date": "Jan 8, 1999"}