{"name": "Cross Racing Championship 2005", "name_review": "Cross Racing Championship 2005", "ref": "https://www.ign.com/articles/2006/01/10/cross-racing-championship-2005", "text": "2005 will be memorable as a year when big-name licensed racing sims for the PC were few and far between, and the sims that were released were largely unlicensed, with generic car body types.   Surely this saves money for developers, as sales of hardcore racing sims have dwindled since the heydays of Formula One and NASCAR.   Into this rather quiet genre, Invictus introduces Cross Racing Championship 2005.  Having the word ~Cross~ in it suggests that this is a Rally Cross style title with lots of off-road vehicles trading paint in the dirt.  Indeed, much of the game is exactly that.  But the box flap also promises: ~autocross, rallycross, off-road, rally-sprint, rally, road racing, and circuit racing~.     Cross Racing Championship 2005 is not as hardcore as a NASCAR sim or the recent GTR title.  But it is not an arcade pedal mashing affair, either.   If you're looking for the successor to the old Monster Truck Racing series, this isn't it.   Neither is it a license-stripped Rally racer with longer segments of road where you race against the clock, repair your car, and listen to a co-driver shouting out turn types.   Fair warning: my first impression of this title was not so great. If you have downloaded a demo, or for the first few hours with the full version game, you may wonder when you'll actually get to do any real racing.  The first problem is that the software is really going to tax your hardware.  My 3.2 Ghz box with 1 Gb of RAM and an ATI Radeon x600 delivered a very unappealing slideshow when I fired up the game.  It took a fair amount of task-killing and visual-tweaking to get the frame rate into the neighborhood of acceptability.  You could easily spend the first hour just trying to find a decent frame rate.  Fortunately, the ~Free Ride~ mode of the game lets you drive around and tweak the game until you're happy with the way it looks, sounds and behaves.    After the initial adjustments, the next few hours were spent wrestling with the game control settings.  While the degree of customization of controls is impressive, it is poorly documented (if at all).  You may or may not guess what the three ~steering speed~ settings control.The first setting is for turning the wheel, the second is for unwinding the wheel and the third is for centering.   Another setting controls how far you can turn the wheel past its grip limit, and another undocumented setting that seems to suggest a more oversteering or understeering behavior.   Using the Logitech GT Steering wheel that was initially released for the Playstation 2 and Gran Turismo 4, I had 900 degrees lock-to-lock available, and to its credit, the game allows up to that 900 degree limit.   [A note for widescreen laptop users: If you operate in 1680x1050 mode, you'll see that the names of the settings in the options menus are cut off on the left. In order to read them and re-align all the text boxes in the menu system, you must revert to a lower, more conventional resolution.]   Then it was all tweaking and testing, tweaking and testing, tweaking and testing.  That was my first several hours spent with this game, just trying to get the game to feel something like driving a real car.  Making it more difficult was the lag between my steering and the in-car view of the driver turning the wheel.  If bad lag between actual and on-screen steering disorients you, then you may want to turn off cockpit view and drive over the hood or some other view.  I would have been happy with the option to just draw the in-car view with no steering wheel as NASCAR sims have done, but this is not available.   Once I finally felt I was ready to drive competitively, I naively set the difficulty to medium and started off on a quick race.  I was immediately left in the dirt by the AI cars, since they had no qualms bumping me in turns and saying, ~Take this!~ as they did so.  I only know this because that message prints on the middle of the screen as I'm forced into the nearest guardrail.   I also got a nice taste of the physics model fairly early on.   I rounded a corner at speed and jumped out of the throttle as I saw the turn tightening.   The car unloaded the rear wheels and whipped around into the guardrail on the inside of the turn before I could save it.   Clearly weight transfer is modeled nicely!   Damage is also modeled.  Hit too many immovable objects and your car will sputter to a stop at some inopportune time, or worse, expire in a plume of smoke.  You can hit a button to repair the car, at a bit of a delay, as well as rescue the car in case you drive it so far into the weeds you can't get back out.  Both appear to cost you some indeterminate amount of time.   Your car starts out clean and shiny, then slowly accumulates mud and dirt as it laps the track.  The screenshots included demonstrate this as you see my shiny yellow car turn slowly into a mud-hen.    The game presents you with quick race mode, free ride, time trial and multiplayer options.  After doing time trials and free rides to get my options settings tuned, I turned to the career mode.   Career mode starts with most of the tracks locked away and only two of the six car types available .  The cars are in a stock configuration, and are slow to the point of being boring.  The only exciting thing about the stock models is the degree to which they lean on their stock suspensions in the corners.  At first, you may wonder whether the game ever gets interesting, as the car seems to crawl around the tracks at 30-50 mph.  Another unpleasant surprise was how awful the auto-shifting is.  In auto, the driver shifts almost constantly, and hearing the on-screen driver clunk up the gears every few seconds set my teeth on edge.  It also killed my lap times.  So as I had intended to do eventually, I put the car back into manual (though ~semi-auto~ modes are also available).    Graphically, you'll find that the Invictus has done a good job of creating natural-looking terrain, and this is reinforced by the force feedback support that makes bouncing through the ruts of a dirt road or river bed feel pretty convincing.  You'll be running through the country side with tall forests surrounding you, transitioning from paved country roads into river beds, dirt and mud gravel roads, driving through the plumes of dirt churned up by the cars in front of you, and swapping paint and insults with the AI drivers.  Although your speedometer reading may not be impressive, it is still challenging to drive these cars through the tight, twisting confines of the circuits.  Elevation changes on the tracks give new meaning to even the most benign-looking slalom, as a bit too much steering or poor timing of a throttle lift can spin you backward or hurl you into the car-crunching foliage.    I quickly learned that I could put the car on its roof by hugging the slopes on the insides of the turns!    Many off-road games seem to drive in perpetual oversteer, so that you are seemingly driving sideways around the track all the time.  But understeer is modeled as well, so it's just as likely you will enter a turn too fast and plow to the outside, tires squealing.     CRC 2005 supports the Track-IR head-tracking peripheral (which any PC racer or flight sim fan should own to get their money's worth from their sims).  This helped me get around the twists and turns through the forests and around hills.  A slight turn of my head to the left or the right gave me an edge looking through the turns to see what was coming up, and helped eliminate some otherwise nasty surprises.  A rotating track map provides a bird's eye view of the circuit, along with your position and those of your opponents.  However, because of the constantly changing terrain and the surprising elevation changes you may encounter, you cannot simply assume that a slight bend in the road can be taken flat out.   Engine sounds in the game are gritty and loud.  They initially drown out almost everything and had to be turned down.  3D sound is also supported, but since I was running with a standard stereo configuration, I turned it down to a 2D sound configuration, hoping to improve my frame rate.  In spite of this, there was a fair amount of unavoidable hissing and popping accompanying the sound, but your mileage may vary.    The AI cars are fast enough to force you to start in novice mode with the stock vehicles, because the cars in their stock configurations are simply not competitive against the higher levels.   Most of the races present you with 3 or 4 opponents, of uneven capabilities.  You may find yourself working hard to slowly catch up to the leader, while easily lapping the third place car.  It is a little odd that there would be such a disparity when there are so few cars on the track.    As you place better in races, more stages of car kits become available.  Such items as transmission, bodywork, engine, and suspension all have several stages of upgrades.  I liked the user interface for tweaking the setup of your car.  Invictus resisted the temptation to give the user an inscrutably complex setup screen with a ton of settings.  Instead, you can freely change what stage of part you want to use (bigger isn't always better), and the part description dynamically pops up for that stage, allowing you to configure it.  The appealing aspect of this design is that it doesn't just show you a ton of settings and then disable them all as if to taunt you for not having gotten a certain upgrade.   It just shows you what's available, and if you see it, you can change it.   The user interface also thoughtfully supplies hints for each part and upgrade.  I only wish that such attention had been paid to the game options!    As I indicated earlier, the game centers on career mode, where over 60 races wait to be unlocked, as well as the new car types and car upgrades.  Some races will limit your choices in car, though, so the full 6 types may not be available for career racing.     It will take many hours to complete the career mode, and if your interest in the game is intense enough and you don't mind a repetitive feel to the races, you will get your money's worth from this title.     Multiplayer is also available, though I was unable to find any servers online during the review period.  Full race replays can be viewed and saved, and a wide variety of in-car and trackside cameras bring you the action and use some sweet-looking angles to capture all the action as you mud-wrestle your way to the top.     The game is not without its glitches.  Force Feedback has a way of cutting out completely in the middle of some races, and quite often you'll go from one race to another to find that it is completely gone.  If you can drive with no resistance from your force feedback wheel, you'll do fine.  Otherwise, you'll need to abort the race and either trick the game into re-initializing force feedback or restarting the game.  Only a complete shutdown and restart of the game seemed to fix it in some cases.  This badly needs to be addressed.    Also, I believe the title was optimized for off-road racing and is not as believable on pavement.  After several satisfying mixed-surface races, I tried the racing circuit and selected setups that seemed like they should match that kind of track, but the car felt different from anything I've felt before, and I found myself thrashing around on the track like an idiot, slamming into objects fairly regularly.  More time on the dreaded options screen was needed to compensate for this.     Perhaps the nicest thing to do is look at the replays, which really show off the camera angles and graphics (as you can see from the attached screenshots).  Clearly, Invictus is talented at designing highly-detailed environments and believable-looking cars in action.  Whether you'll be able to get a smooth frame rate on these replays with all those details on is another matter, however.   There is a niche for games like this, and it will have its fans.  It is unlikely that this game will appeal to the more mainstream virtual driver, however, because it's simply too much of a simulation to be easily mastered, and there's no early high speed payoff as the cars truck along at speeds that wouldn't get you pulled over in a school zone.  It's like someone giving you an old beat-up compact car and telling you to go run it around in the woods.  It might be fun for awhile, but it'll never convince you that you're driving a WRC Rally car or a GT Touring Car. In addition, the lack of name-brand licenses doesn't help suspend disbelief.   Further hurting the game is the 'unlock the tracks' nature of the game.  Racing titles use this technique to keep the game interesting; keeping some mystery may keep gamers playing when they would otherwise get bored with the repetition and quit.  Unfortunately, the game starts feeling redundant all too soon, and the 60+ circuit designs in the game don't really feel like near that many.Its hard to pinpoint any one area where the game really falls flat.  The visuals are excellent, the sounds are aggressive, and the physics are respectable.  But as a total package, the game just fails to thrill.  The replays are far more interesting than the actual driving.  After several of days racing for the purpose of writing this review, a feeling of been there, driven that has set in, and it becomes harder to motivate myself to spend more time with the game.   The best hope for this title is with multiplayer racing and a thriving mod-community to build new tracks and cars on the game engine.  I havent really SEEN a thriving mod-community, but it does need one if its going to have a longer-term appeal.  The game engine itself could also use more performance tuning to run better on medium-range hardware. More configuration support from the developers would be nice.  The games website (http://www.crc-game.com)offers no updates, but the online forums have many customers like me trying to figure out how to tweak game settings to get the thing to be run smoother or control better.  Im always concerned when I see long forum threads of users sharing their extensive lists of personal control settings that make the game work for them.", "date": "Jan 10, 2006"}