{"name": "Electroplankton", "name_review": "Electroplankton", "ref": "https://www.ign.com/articles/2006/01/11/electroplankton", "text": "With the Nintendo DS handheld, Nintendo has offered up a very enticing blank canvas for aspiring designers to try new and unusual ideas of entertaining themes. It's almost as if the company challenged the creative minds. ~Here,~ Nintendo said. ~Have at it. Go to town. Have some fun and see what you can do.~ In 2005, Japanese designer Toshio Iwai picked up that gauntlet, used his visual and audio experience to produce Electroplankton. What he's created is more of a stylized, aural toy than a game, a casual diversion instead of a skillful challenge. The entire experience is essentially whatever the user can get out of it: Electroplankton is as much of a canvas to the gamer as the Nintendo DS is to the interactive designer.   It's a very difficult title to review simply because Electroplankton is not a game. Its accomplishments aren't level based and there's nothing here to tax the minds or hand-eye coordination of the player. It's meant simply to explore the different ways the touch screen can be used as an interface to create audio and transform it into something melodious. Though much of what's produced in Electroplankton could be musical, this experience is not intended as a music maker. And, ultimately, that's where the experience takes a dive: as creative and impressive and original and, most importantly, fun as Electroplankton is, it lacks a specific set of expected elements to keep the players' interest beyond the initial hypnotic sessions.   There are ten outlets for the DS owners to mellow out and explore their musical aptitude, each putting the handheld's touch screen functionality, as well as its relatively powerful audio and visual capabilities to use. Players create the audio in Tracy, for example, by drawing a path for one of four little microbe fish to follow - notes triggered by the speed and direction that the player drew the path. Hanenbow's melodies are performed by leaping tadpoles and the players' focus on manipulating a plant's leaves for them to ricochet off of like a harp's strings. Sending star-like Luminaria around a grid of arrows produces a harmonious experience that's enhanced by the players' manipulating of their direction on the field.    A few of the audio toys also utilize the Nintendo DS system's microphone: Rec-Rec mixes four user-recorded tracks with a series of beats, challenging players to produce some clever, rhythmic pieces. Volvoice simply takes what the player records into the Nintendo DS and alters it into oddly haunting audio by reversing, speeding up or slowing down, and otherwise digitally manipulating the sample. Nanocarp's goes one step further and gives players unique control over musical sprites, schooling them into unique and melodious formations simply by clapping or whistling at them.   At the very least, the game does what it sets out trying to be: interactive art. The game looks beautiful and, depending on player input, sounds even better. It's just like staring at a series of classic painting in a museum for hours: the enjoyment is simply appreciating the creator's intentions. There are no set rules and no set challenge in any of these ten audio toys, other than to simply mellow out and give your ears and eyes something pleasant to hear and see. It's a wonderful outlet for a player's creative flow.   But, admittedly, it goes against the grain as a full-fledged gaming experience, and perhaps Nintendo should have nudged for something a little more fleshed-out. If you're content simply spinning around disk-like fish to produce tunes similar to John Carpenter's ~Starman~ soundtrack, then there's absolutely no problems. Without the ability to internally save any of the ~compositions~ you may end up creating, though, is a little disappointing;  granted any recorder hooked up to the DS system's headphone jack can grab the audio portion. But since much of the ~art~ of Electroplankton is matching the visuals with the audio, half the experience is lost simply because there's no way to save the creation that produced the user-inspired melody.  It's extraordinarily hard to pick apart Electroplankton as a game, because that's not the intention of the designer. What it and the designer set out to do they do it extremely well, and there's nothing quite like chilling with a Nintendo DS and a set of headphones, creating something haunting and melodious simply by rubbing the touchscreen with the stylus. It's as deep as the player makes it. But without the helping hand of the developer to offer some set goal or accomplishment, it ends up a smidge too shallow and empty to really be something as fulfilling as a final Nintendo DS product. I do recommend the experience, but don't be surprised if it's relegated to the shelf quicker than many of the other 30 dollar products in your collection.", "date": "Jan 11, 2006"}