{"name": "Ridge Racer", "name_review": "Ridge Racer", "ref": "https://www.ign.com/articles/2006/01/11/ridge-racer", "text": "There is something inherently cool about of the idea of playing a fully 3D, polygonal rendition of Namco's classic arcade driving game, Ridge Racer, on a cellphone. The actual execution of the game? Not so cool, especially for fans that have followed the series since its inception and think they are going to get a solid recreation of the experience on a handset. But therein lies the biggest hurdle for existing vids that want to make the leap to mobile -- they carry the baggage of pre-existing expectations with them.   For the uninitiated, Ridge Racer is one of the purest arcade racers ever created, right up there with SEGA's superlative Daytona USA. Throwing your ride into the perfect powerslide while negotiating a hairpin turn was as exhilarating then as causing a fifty-car pile-up in Burnout is now. But this mechanic doesn't work very well in the mobile edition, and for a series that hangs so much of its appeal on this one game play hook, the results are disappointing.   The fault is divided between two parties: Namco and handset manufacturers. A game like this just isn't that playable without analog control, and handset manufacturers need to pick up the slack and get analog controls on to the next gen of handsets. Ridge Racer's default control scheme offers automatic acceleration, which makes the game easier to control, but it also makes effective powerslide impossible. Too often, you'll brake and slam into a wall or come to a dead stop in the middle of the lane.   Fortunately, Ridge Racer does allow you to configure the controls to your liking -- and there is a setting that assigns the gas and brake to number keys. Because a phone like the LG VX8100 (my test rig) can handle chording, I was able to eek out a few powerslides but none of them were particularly effective. I finished better with auto-gas and just slowing down before a tight corner. It works, but it's not Ridge Racer.   The mobile game offers much of the content from the original, with all of the vehicles (including the sought-after Devil Car) and tracks. You can unlock reverse courses, too, for completing all tracks in first place. Visually, the game looks only few steps back from the PSone original, which some dulled textures and less-complex car models. There is some wonkiness with cars appearing in the horizon or the other side of a curve or a hump in the road. The game feels somewhat sluggish at times, too, which affects the sense of speed. The audio is pretty limited, which a beep-boop variation of the original RR theme is constant loop. You will turn it off in the options menu after a few races, trust me.  Ridge Racer was a tough one to bring to mobile -- it's just one of those games that demand analog control, and without, the game feels really lacking. Part of the problem is just the powerslide mechanic itself, it's so important to a RR game -- which is why something like Need for Speed Most Wanted succeeds in the face of only digital control. RR faithfully replicates the amount of content in the original RR, too, which is better than several racers out there, but has been effectively lapped by NFS and Asphalt 2. Newcomers may be able to get around some of the issues that hold RR back, but fans will be sorely disappointed, even if they do understand the differences between regular vids and mobile games.", "date": "Jan 11, 2006"}