{"name": "25 To Life", "name_review": "25 To Life Soundtrack - Disc 01", "ref": "https://www.ign.com/articles/2006/01/17/25-to-life-soundtrack-disc-01", "text": "Undeniably following in the footsteps of games like Grand Theft Auto, True Crime, and other gritty, urban based flights of violence, 25 To Life capitalizes on the thug influenced lifestyle of inner city street gangs and their continued battle with law authorities. As can be expected, the game draws heavily upon rap music for its soundtrack, which is broken into two basic sections: Law Enforcement and criminals. The former is represented in the first half of the soundtrack by artist such as Gang Starr, UTP Playas, Tego Calderone, Xzibit, Locura Terminal, KRS One, and more.   For the most part the song choices run the gamut of recognizable and legendary acts that have dominated the rap genre since the early '80s. These include the likes of Gang Starr, who represent with the appropriately titled ~Code of the Streets~ off their 1994 classic Hard To Earn. KRS-One delivers ~Black Cop~ from his solo classic Return of the Boom Bap, while Public Enemy serve up a little ~Black Steel In The Hour of Chaos~ from their seminal It Takes A Nation Of Millions To Hold Us Back. Plus the original bad boys of NC-17 linguistical terror, The Geto Boys, chime in with ~Yes Yes Y'all~ off their 2005 comeback album The Foundation.    While the old guard of the New School are represented lovely, quite a few members of the younger set are on tap, as well. The Xzibit joint ~Enemies~ from his 2002 effort Man Vs. Machine is included. Ghostface Killah and Jadakiss tag-team on ~Run~ from the former's 2004 release The Pretty Toney Album. Midwest underground legend Tech N9ne drops his lurching, electronically charged surge on ~My Wife, My Bitch, My Girl.~ New Orleans rap kingpin Juvenile even pops up with the UTP Playas and their blazing single ~Nolia Clap.~   The real gems on this disc, however, are the tracks that aren't from the most likely of artists. For example reggaeton-cum-rap stalwart Tego Calderone is given airtime with ~Circa De Mi Neighborhood.~ The other Latino crew on hand is Locura Terminal with their stripped down piano driven Spanglish lament ~Prisonero,~ one of the few exclusive tracks written specifically for the game. For folks not used to such multi-culti off-shoots of rap, both of these tracks come as a welcome rush of fresh air.   The first portion of the in-game soundtrack also contains its fair share of exclusive tracks, which is what the diehards are really fiending for anyway, right?  For starters there's ~Freeze's Anthem,~ by Pook Diesel. Down with P.O.D., Diesel delivers a dark, dirge-like bit of thunder that's meant at the theme song for one of the key characters in the game. Longtime mixtape vet (and no stranger to having his songs pop up on popular games) Grafh gets busy on the militaristic chant style of ~Bad Company,~ his erratic flow snaking over and under the staunch rhythm.    Los Angeles' Shade Sheist teams up with N.U.N.E. for the slinky ~You Got,~ another exclusive track original to the game. The duo deliver that trademark West Coast slither over a post-modern G-Funk inspired groove. And unsigned Midwest rapper Jackpot lets loose with one of the most head twisting numbers on the collection. Amidst swerving electronic swelter he verbally pops, locks, and tweaks his liquid slang tang.    While not an essential collection, the first disc of the 25 To Life in-game soundtrack deserves kudos for representing a wide array of regional rap, including birthplace bangers from NYC, Latino tinged goodness from Florida-by-way-of-Puerto Rico and Los Angeles, on down to unsigned hype, Midwest flavor, and Dirty South exultations.   Definitely Download:  1.~To The Finish~  2.~Circa De Mi Neighborhood~  3.~Freeze's Anthem~  4.~Bad Company~  5.~You Got~There's really no reason to buy this game. The single player is boring, arrestingly conventional and entirely forgettable. The multiplayer is slightly better, though mostly because of its options and not because of its gameplay. This game sorely needed some kind of unique movement, such as diving, rolling or a much more sophisticated duck and cover mechanic. As it is, the entire game consists of running up to foes and hoping you can shoot them more times than they shoot you. In the end, 25 to Life turns out to be a flimsy product that feels tacked together strictly for the purposes of producing a ~gangster~ game, which apparently sells copies. In the future, hopefully the developer can pair the theme with an interesting game design players can actually enjoy, or just stop making them altogether.", "date": "Jan 17, 2006"}