{"name": "25 To Life", "name_review": "25 To Life Soundtrack: Disc 02", "ref": "https://www.ign.com/articles/2006/01/17/25-to-life-soundtrack-disc-02", "text": "The second half of the 25 To Life in-game soundtrack is loosely subtitled ~Break The Law~ and is intended to represent the other in-game character option (i.e. playing one of the 22nd Street D-Boy gang members and running rampant throughout the cityscape committing all manner of illegal activity). In some ways this portion of the soundtracks comes a little bit rougher and a little bit rawer.   Things kick off with one of the staples of the modern hardcore rap scene in the form of DMX's ~Where The Hood At?~ It more or less sets the tone for what follows. Midwest hero Tech N9ne joins forces with verbalistic madman E-40 on the bugged out gurgle and splurge of ~Jellysicle.~ The song is one of the more avante garde offerings, both musically (stripped down lumber electronic static) and lyrically (it's got E-40 on it, 'nuff said).    Guerilla Black comes with his Notorious B.I.G. styled flow on ~Yes Sir,~ his resemblance to the dearly departed king of New York more than a bit uncanny. That this track is paired next to 2Pac's duet with Nutso ~Ghetto Star~ makes for an all too eerie segue. Latino bad boys Locura Terminal, one of the few groups to have two songs included on the soundtrack, again bring the Spanish flavoring, this time with a much more aggressive stance (not to mention the track is entirely sung in Spanish as opposed to their English drop-in on their other contribution ~Prisonero~ off of Disc 01).    Insane Clown Posse homie Blaze kicks out no less than two tracks here, beginning with ~Shot-Gun~ featuring Detroit acid rapper Esham and ABK. It's a caustic, brash blast of intensity. Blaze's other joint; ~Look Out!~ is one of the game exclusive numbers. It features Lavel joining him for a little lyrical melee. While not as outwardly gritty as ~Shot-Gun,~ it's still no-holds-barred.   In terms of other exclusive tracks Bay Area underground superstar Yukmouth (of the legendary Luniz) shines on ~On The Run.~ A fuzzed out bass/guitar blitz sets up the monotonously ominous chug rhythm over which Yuk gets busy. The album concludes with ~In The City~ by New York indie rapper Franchize. It's a dark, minimalistic strut that allows Fran to kick his deep-seated voice and create a ruff, rugged, and raw blast of true hardcore thematics.    Aasim and Jae Millz deliver ~God With The Flow.~ The Queens rapper teams up legendary NYC battle rapper for a slick blast of Harlem juice. That both of these cats have been touted as the next big things but still have yet to drop albums makes the track a wonderful appetite whetter. Additionally Jay Live gives us ~Dark Corner,~ one of the more musically upbeat numbers included. And another one time hyped MC, Shyne, is represented with the dark angelic floss of ~More Or Less.~ (as with the segue of Guerilla Black into Pac, this one seems premeditated as both Aasim and Shyne were once heralded as the saviors of Bad Boy Records).   Interestingly enough there's really only one bona fide classic included on this portion of the soundtrack. ~Criminal Minded~ is the titular jam from Boogie Down Productions' 1987 debut album. It serves as an interesting juxtaposition to ~Black Cop,~ the other KRS-One dominated track used in the game as it presents the rapper at two distinctly different periods of his career.   As with Disc 01, the second 25 To Life disc delivers a nice cross-section of rap, pulling from all the dominant regions: NYC, the Midwest, the Dirty Dirty, Los Angeles, and the Bay Area. While it tends to focus more on less established and more off-the-beaten path artists, it also seems to lack some of the overall transitional flow of Disc 01. In this respect it comes off like a slightly more disjointed mixtape.   Definitely Download:  1. ~Jellysicle~  2. ~Soma Cabrones~  3. ~God With The Flow~  4. ~Dark Corner~  5. ~In The City~There's really no reason to buy this game. The single player is boring, arrestingly conventional and entirely forgettable. The multiplayer is slightly better, though mostly because of its options and not because of its gameplay. This game sorely needed some kind of unique movement, such as diving, rolling or a much more sophisticated duck and cover mechanic. As it is, the entire game consists of running up to foes and hoping you can shoot them more times than they shoot you. In the end, 25 to Life turns out to be a flimsy product that feels tacked together strictly for the purposes of producing a ~gangster~ game, which apparently sells copies. In the future, hopefully the developer can pair the theme with an interesting game design players can actually enjoy, or just stop making them altogether.", "date": "Jan 17, 2006"}