{"name": "Power Rangers: Space Patrol Delta", "name_review": "Power Rangers SPD Review", "ref": "https://www.ign.com/articles/2006/01/18/power-rangers-spd-review", "text": "While many franchises seem to disappear and then return years later in an attempt to recapture the next generation of fans, Power Rangers just never seems to die.  The series has gone though revision after revision, and with it comes a whole slew of mediocre products.  Although the Power Rangers have seen more facelifts than Michael Jackson, the potential for a quality product still remains.  Unfortunately, Power Rangers SPD comes up short, offering strong presentation and average production value at the expense of suffering gameplay.     While it is very difficult to capture the cinematic nature of the television show into the cramped space of a Game Boy cart, this is one area where Power Rangers SPD showed strength over previous Power Ranger titles.  Cut scenes are included for the bulk of storytelling, and though backdrops and character portraits are reused to save space, the entire front end is quite impressive.  Most of the main art is shrunk down pictures straight from the show, offering the ability to put sprites over the main art to make each scene seem unique.  The enemies, vehicles, and settings all translate well to the small screen, offering a feel that is reminiscent of the show itself.  The in-game production, however, is a bit on the weak side.  Ranger animations are identical aside from a few tweaks, offering very little personality to come though.  A more complex move set would have helped a great deal, though with a cast this big it is tough to not double up in order to save much-needed space.  The cart uses password rather than battery save, and while it is a total cop-out to save a buck, the password is only three slots long and can be retrieved at any time.  So, despite a few nagging flaws, Power Rangers SPD manages to retain the look and feel of the show.   Gameplay, however, is a totally different story.  The bulk of the design focuses on action platforming, though each ranger has only one attack.  The entire bulk of fighting can be done by mashing the B button as players are forced to execute the same four hit combo over and over again.  The level progression is very similar to Ninja Turtles GBA, offering character-specific stages to keep the cast balanced for the duration of the adventure.  The experience itself just isn't entertaining, however, and the shallow combat won't last more than a level before its charm wears off.  The R button triggers a character specific special move, though they are used mainly for navigation rather than combat, with only the Yellow Ranger as an exception to the rule.  The L button, which is used only for limited range camera movement, could have easily been assigned as a kill-all or attack booster to add much needed flavor.  Enemy AI is also terrible, having bosses repetitively hit the player over and over while basic henchmen can actually be ran through to complete the level even on the most difficult settings.   Rather than spending time to add depth to the main mode, the design incorporates extra sequences that make use of the Rangers' vehicles, though the bulk of it is too basic.  These events include a missile command clone, Megazord battle, and multiple racing variations, though the design ends up hurting the main game in an attempt to add multiple play modes .  While fighting in the Megazord can be fun, giving fans a theatrical feel, the gameplay is just too shallow.  Racing is also extremely basic, offering nothing more than scrolling ground and lateral movement.  In the end, players will wish for deeper core gameplay rather than the cluster of mediocre sequences that has become Power Rangers SPD.   The production value of Power Rangers is also on the weak side, offering only the most basic of soundtracks teamed with a total grab bag of graphical presentation.  The entire score has an 80s arcade feel, and while it isn't perfect by any means, it gets the job done.  Sound effects get annoying, however, since players will be host to the same combo move over and over again.  Varying sound effects would have helped in a few key areas.  There are very little special effects, and the visual presentation is basically limited to what can be seen on the back of the box. Some areas look decent, such as the Megazord battle, though others such as the racing levels are simply a cluster of assets. Pictures have been shrunk down to play out cut-scenes, and though it works relatively well, the ability to place sprite art over these low-res pictures wasn't the best design.  It is obvious that some pride was put into this one, however, as there manages to be a cinematic flare that is uncommon in many licensed products.  As an overall package Power Rangers SPD just doesnt have enough depth to be a worthy purchase for casual action fans.  Gameplay is far too basic to recommend in and of itself, and though it holds solid presentation and decent sound and graphical production the overall uninspired gameplay will discourage most gamers.  There simply isnt enough here.  Combat is limited to one button, and environments are far too straightforward for strong puzzle platforming.  While some diversity was used between the Rangers there is still duplicate move sets, and aside from double jumps and rolls the same basic strategy can be used for each character.  The main adventure isnt strong enough to warrant a purchase, and the in-between sequences tend to hurt more than help, leaving players wishing for a stronger core design rather than yet another all-in-one attempt.  Stronger core gameplay and graphical presentation can be found in Power Rangers Time Force, though the franchise itself has changed a ton over the last three and a half years.  Presentation may be solid, but fundamental gameplay is never achieved, making Power Rangers SPD a generic and unimpressive package.", "date": "Jan 18, 2006"}