{"name": "High Seize", "name_review": "High Seize", "ref": "https://www.ign.com/articles/2006/01/18/high-seize", "text": "Advance Wars with galleons.   That's perhaps the easiest way to describe High Seize for the N-Gage, and according to Occam's Razor, if given multiple choices, the simpler one is almost always the best one. And I doubt developer Red Lynx would terribly mind the comparison to what is arguably one of Nintendo's best portable franchises. And if the Advance Wars angle doesn't sell you, sonsider the Red Lynx made Pathways to Glory, which is largely considered one of the best games on N-Gage, period.   High Seize takes its cues from almost every single pirate picture you can think of, with swashbuckling heroes, treasure maps, dreaded pirates, and tall ships that cut through the briny blue in search of the next port to pillage. If you like this setting, there's actually a good chance you may even enjoy High Seize more than Advance Wars. (Case in point: Me. I dig Advance Wars' smart game play, but I like pirates a hell of a lot more than tanks.)   The mechanics of High Seize are established fare. You must lead your units to victory through a series of battles that unfold over grid-based environments. The different types of terrain have an affect on your units, so you must always keep an eye on this as you move your units across the field. Units have different movement and attack patterns (cannons have devastating offense maneuvers, for example, but little defense), too, so you need to bear this mind as you plan your assault on enemy pirates and forces. Fortunately, you have plenty of time to monkey around with movement and attack proposals before committing -- especially when playing with expensive units, like your bigger ships. Use this time to your advantage, because once you perform an action, there is no mulligan.   (Word of warning: There are time limits in multiplayer games.)   There is also some resource management happening in the background of your battles. You must capture and maintain control over properties to haul in a continuous supply of booty. And you are going to want to capture a variety of properties, too, because different buildings enable to construction of different units. For example, to build naval units, you need to control shipyards.   And there's another wrinkle to consider -- and it's something you won't find in the basics of Advance Wars. Units use supplies while they are in the field, whether its perishables or ammunition. You must ship supplies to outbound units or have them return to ports to resupply. Whew.   Commanders are a big part of High Seize. Officers have different strengths, which you'll discover as you challenge pirates and other salty dogs. As you play, you earn skill points for wiping out enemy units and capturing your opponent's headquarters, which you use to beef up your character. You can also buy ~perks,~ which are more fleeting benefits, but can really save your bacon from time to time.   RedLynx's game fully supports both Bluetooth multiplayer and Arena contests. Fortunately, since the number of N-Gages floating around amongst your friends is probably low, you can also pass the rig back and forth to take turns.   High Seize really does have some great production values. The introduction is first-rate, but where you'll really see the game shine is in the overworld view. The Caribbean is a lush landscape, full of jungle-covered islands, white beaches, and listless waves on cobalt blue oceans. The battle scenes are full of information that never clutters the screen. The N-Gage screen is not as high-res as one would hope for now, but all text is readable. The game is also accompanied by digitized speech and a solid score.  How unfortunate is it that the N-Gage is experiencing a torrent of great games at a time when few people (at least, in America) give a damn about the system anymore? Hopefully, Nokia will expedite its plans to get the N-gage tech inside other handsets so games like High Seize can be enjoyed by a wider audience. This is a great strategy game with good story, excellent presentation, and some really strong game play. If you have an N-Gage and have always wanted a turn-based strat game like Advance Wars, your wait is over. Dammit, this is a good game.", "date": "Jan 18, 2006"}