{"name": "Ape Escape Academy", "name_review": "Ape Escape Academy", "ref": "https://www.ign.com/articles/2006/01/19/ape-escape-academy", "text": "Ape Escape Academy, from developer Shift, seems like the perfect game to play on the road. It's easy to pick up and play for a few minutes, then carry on with whatever it is you're busy doing. It's bright and cheery, too, so it's easy to see when hanging outdoors. It's also the type of game designed (at least in part) as a multiplayer affair. Sounds like a near-perfect mobile game. But, as the development gods would have it, it's not.  To start, Ape Escape Academy packs 45 mini-games. It's still an Ape Escape game, even without the platforming, so fans of the series will definitely dig the aesthetic and audio. Fans may also appreciate cameos from famous villains and characters, not to mention hundreds of semi-intelligent, very mischievous monkeys. Having said that, Academy is purely a mini-game compilation, so those looking for any platform action won't find it here.   The game splits between different modes, but the main one enrolls you in a six-year curriculum. The aim, of course, is graduation. You'll need to contend with six instructors, each of which you may recognize as villains in previous games. So basically, they're all here to whip you into shape; turn monkeys into apes, as it were. A Tic-Tac-Toe grid of nine squares represents each ~year~ in the academy. Nine squares make up the grid, with each square representing a mini-game. In order to ~graduate~ into a higher grade, you'll need to form lines by winning these games.   That's all swell, but things get progressively less-groovy the more time you play. The one element that needs great execution in a game like this is, obviously, are mini-games. They need to be fast, fun and full of variety. Look at WarioWare, for instance. It packs a slew of addictive, super-fast games. They're shallow, sure, and they last no longer than a few seconds, but there are enough of them and they come at you so quickly that it doesn't matter; they're fun. Not so in Academy. They suffer from a bunch of issues that rob much of the enjoyment out of the experience.   First, there's the issue of control. Controlling your apes feels sluggish and unresponsive. A fact made worse considering much of Academy requires quick reflexes. Certain times, you'll need to collect a fast-moving item and all you're given to accomplish this is a monkey with partially cemented legs. This scenario repeats in numerous games. Not all, but definitely more than a few. Bottom line, it happens more than is excusable. Second, the controls in certain games are a tad confusing. Again, WarioWare never suffered from this. Each game took about a second to learn.  Now, having a game with slightly more complicated controls is fine, but when you only get one try to beat a given challenge, it's not so fun. Say you're playing through the main curriculum, once you lose any mini-game you permanently lose a square, unless you want to start that particular year over again. And all it takes for you to lose is a matter of seconds, so if you don't get what's going on in that specific scenario you're officially screwed. Yes, the game does in fact explain what's going on beforehand, but not fully.   Take, for instance, one game where you need to catch bombs on a plate. In the two-second tutorial before the game starts, you see a monkey running around catching bombs perfectly. What this doesn't explain is that the bombs can slip off the plate and explode. Not a big deal, but enough to make you lose the first time you play, costing you one of those precious Tic-Tac-Toe squares. What's worse, this doesn't happen just once or twice. This happens repeatedly. And when you die, or lose a game, rather, the PSP needs to load data off the UMD. The load times aren't that long, mind you, but you'll have to deal with loads constantly since games only last a matter of seconds.   And here's a quick recap on the multiplayer, in case ya'll didn't remember: you can play four mini-games, two over a local wireless connection and two using game ~sharing.~ Now, don't confuse this with the usual PSP game sharing feature, where it's possible to download content from a friend's PSP. Game sharing in Ape Escape Academy means you physically share one PSP to play. The games you can play wirelessly are fun, but options are pretty limited. Plus, it's not all that fun swapping one PSP with multiple people.  Ape Escape Academy suffers from a number of issues, namely sluggish control and poor design. While there's a decent number of games to choose from, very few of them will strike you as memorable or worthy of addiction. And the multiplayer modes, while not terrible, feel very limited in scope.", "date": "Jan 19, 2006"}