{"name": "Mega Man", "name_review": "Mega Man Mobile Review", "ref": "https://www.ign.com/articles/2006/02/03/mega-man", "text": "Mega Man is enjoying something of a renaissance these days. Not that the Blue Bomber has ever gone away -- he's always popping up in two or three games per year -- but with his recent anniversary, Capcom has been releasing Mega games that are more akin to his original adventures, such as the new Mega Man X port on the PSP. But mobile gamers are getting the original adventure, the one that started it all back on the NES.I originally saw this game back in 2004, courtesy of the now-defunct Lavastorm Engineering. The version just released on Verizon's Get-It-Now service seems to be the exact same, but time erodes all memories. Well, not all -- because I remembered having a lot of fun with this game on the NES back in the day, and I had a lot of fun with it this week while testing it out for review. It feels incredibly close to the NES game, but I have this feeling that there may be a few missing enemies here or there. (I don't have a copy of the original handy.)The game structure is the same, though. Mega Man must defeat a series of boss robots named after their super-powers, like Iceman, Gutsman, Cutman, Fireman, etc. After navigating several platforming screens, you jump into a boss battle against these brutes. Beat the robot and you hijack its special weapon for later use. You can tackle the bosses in any order you wish -- every kid always had their own strategy, but most seemed to start with Iceman. I always did. You can switch weapons in a side screen, easily accessed by hitting the 9 key. Each weapon, save for Mega's regular blaster, has limited ammo. However, by searching all over levels and defeating enemy 'bots, you can find health and ammo restocks.Mega Man's classic platforming is still fun to play, and the game offers a few control schemes for you to test drive before jumping into the full game. I ended up using the d-pad in combination with number keys for jumping. I would miss a few jumps from time to time, and it was occasionally grating, but it just ends up being more of an argument for handset manufacturers to start shipping these phones with dedicated game controls.Mega Man looks remarkably like the original 8-bit game, with just a few things scaled back since the screen is vertically oriented instead of landscape, like a normal television. The colors, the sprites -- everything else looks intact. All of the tunes are recognizable, too, and for an old schooler like myself, it's impossible not to smile when you hear the music that accompanies the boss introduction following the level select screen.Mega Man never really left, but my appreciation of him sure was on the wane thanks to a litany of Mega Man games that deviated from the core game play. But seeing the original in action again, even on the smallest screen, was a real treat. The controls may frustrate a few snooty purists out there, but they are manageable, and after a while you find a scheme that suits your style. The music in some of these classics is almost as important as the graphics, so in the case of Mega Man, hearing all the familiar tunes again was a lot fun. I'm not sure how this one will go over with the whippersnappers, but 8-bit fans like yours truly will enjoy this short trip down memory lane.", "date": "Feb 3, 2006"}