{"name": "Action Octopus 3D", "name_review": "Action Octopus 3D", "ref": "https://www.ign.com/articles/2006/02/09/action-octopus-3d", "text": "In previous months, I have used these pages to espouse the need for more original, unlicensed mobile games. Last night, I got what I asked for in Wider Than's Action Octopus 3D. Or Octopus Man. I'm not exactly sure what it's called, because the name on the deck and the name in my personal catalog are different from what appears on the title screen. Whatever the game's true name is, just know that it's just another way to say ~miserable~ and ~waste of money.~ After a few rounds, I wanted to run right back to the warm embrace of Need for Speed Most Wanted.   Octopus Man, at first glance, is a very attractive game. The colors are bright, the world is rendered in 3D, and the game features a dynamic camera system that zooms in on the action when you step into tight quarters. Don't let these visuals fool you, because about two minutes after playing the game, you'll want to call your carrier and demand a refund. This is a plodding excuse for an action-puzzler, made doubly disappointing by the fact that the hero hardly deserves the name Octopus Man. He only has two arms!   Control is unintuitive, to say the least. Want to jump? Press down. And while in the air, you can press up to attempt to grab on to a ledge with about 70/30 success. Need to cross a gap? You don't jump across it, but press toward the gap a couple times to hop down, hold on to the ledge, then stretch your arm across to the other side.   And Octopus Man moves very, very slowly. About as slow as the whole game does, which mainly consists of scouring large maps to find jewels or occasionally bop enemies. Navigating the maps requires jumping around and watching for the jewels to appear when the camera zooms out. While the camera moves, you can sometimes treat yourself to an unintentional fall because you were still pushing right or left as the perspective changed. And then you have the climb all the way back up to where you were -- ugh. Zzz.   There are a few 3D stages and boss battles that break up the monotonous maze navigation, such as a scene where you run away from the camera and avoid rolling logs. But even those aren't very exciting. The whole thing is just so slow and dull it drove me crazy.  Avoid. I know I said we should be embracing more original efforts -- but let me amend that. We should be embracing good original games, like Tower Bloxx or Stick Fighter Fury. Octopus Man was made in Korea, by Ghem4U, a firm I can find little information about via Google. But I have had the distinct pleasure of visiting Korea and playing many mobile games from the region. There is some incredible talent over there, creating games that deserve American release. Octopus Man is certainly not one of them.And by the way, Wider Than is one of the coolest company names I've ever heard.", "date": "Feb 9, 2006"}