{"name": "Rugby 06", "name_review": "Rugby 06", "ref": "https://www.ign.com/articles/2006/02/11/rugby-06", "text": "Before delving into EA Sports Rugby 06, let's do an educational flashback to 1982. It's Cal vs. Stanford in the Big Game. John Elway has just marched downfield and given Stanford the lead with seconds remaining. On the ensuing kickoff, Cal takes the ball from its own endzone and, after an endless stream of laterals, Kevin Moan barreled into the Stanford marching band and the endzone for the win. In the words of announcer Joe Starkley: ~Oh my God, the most amazing, sensational, traumatic, heart rending... exciting thrilling finish in the history of college football!~   That, my friends, is basic rugby in a nutshell, minus the wussy marching band, of course. (Coincidentally, Cal also has one of the finest club rugby teams in the nation, with 21 national championships, including one in 1981.)    Seriously, that's an easy way to describe the gameplay of Rugby 06: like a great stream of laterals in college football, except faster, more fun (passing, not the game), with, believe it or not, harder hits. While Rugby is the furthest thing from America's pastime, EA has put together a very enjoyable game with its latest rugby title. In fact, if IGN editor Chris Carle called Rugby 2005 the greatest rugby game ever, and Rugby 06 is even better, then, well, you do the math. If you're new to the game, check out Rugby 101 with former Canadian national team captain Ryan Banks.   If at first you don't succeed, try, try, try again. And while not a giant leap over 2005, 06 is a subtle improvement, thanks to the addition of even more tournaments and a few on-the-pitch enhancements. Rugby 06 starts off with a basic tutorial for those new to the sport, and although it doesn't explain the finer points of the game, it does an adequate job as an introduction to the rules of rugby and to the game's controls. It will, however, take a lot of lopsided losses and some Internet research before you grasp the finer rules of rugby, like when to punt or make a run for it. Fans with knowledge of the game can skip the tutorial and head straight for the pitch.   On the field, not much has changed from 2005, and that's a good thing. EA added off-load passing, which is basically passing as you're being tackled. In 2005, when you entered a tackle animation, that was it. You were going down. This year, you can dump the ball to a teammate and continue the run, which works great because you are basically eliminating the tackler from the defense. Obviously, the accuracy of the pass is not as great, but an off-load pass in a two-on-one situation is a guaranteed try.    That's one example of the little things EA did to spruce up its already impressive game. The Haka, the Maori dance-ritual and pregame tradition of New Zealand is included in the game, as well as waving flags in the crowd, smoky lighting, three-dimensional grass, visual player breath and quick lineouts and penalties. All of this adds to the most immersive rugby experience to date.     EA also added impact players, which are denoted by gold stars above their heads. There aren't many to be seen on the club teams or weak international sides like the U.S.A., but it's a virtual starburst when you line up with the All Blacks or Australia. Impact players don't have any signature moves, but you'll notice a definite increase in speed and broken tackles. As the All-Blacks, you can pass out of the ruck to Dan Carter and break off a try or drop goal like that. Speaking of cover boy Carter, check out our interview with ~the new superstar of the global game beyond any question.~   The side camera angle works well the entire game, but, like in Rugby 2005, is a hindrance when you go for a drop goal, which is rugby's equivalent of a field goal. When you press and hold the drop goal button, an arrow appears and you can aim in the general direction of the goal posts, but it takes a very long time to start making kicks. It would be a fantastic addition if the camera could immediately swing behind the kicker and we could actually see the goal posts. Drop goals are a significant part of rugby, and while the computer pulls them off with ease, you will be forced to go for the try unless you are in the very middle of the pitch.   Conversely, the animations are fantastic. From all angles, tackling is a treat to watch, especially the new high-tackle that EA added this year. Most of the time it results in a penalty, but giving an opponent the flying-forearm is amazingly satisfying. There are some of the biggest crunches in all of sports games, right here.   Chicks dig All Black Dan Carter. Click on his mug to read the interview. Advanced players will really appreciate the new set plays EA has added. Before each game, you can choose four of more than 25 set plays, which are mapped to the D-pad. Coming out of rucks, mauls and scrums, you can call the play and throw in a change-up from the pass left, pass left, run outside routine.    Visually, Rugby 06 looks great. The cutscenes after tries and before kicks are gorgeous, and there's even a smattering of emotion on players' faces after key moments. At times, if you don't button through the cutscenes, you'll feel like you are watching a rugby broadcast, and that's high praise. The addition of TV-style overlays helps, too.    EA cleaned up the ~flock-of-birds~ issue from 2005, in which players ran exactly in unison. The game is not without graphical hiccups, though. Animations, especially rucks and lineouts, occasionally pop, and there is a strange collision-detection issue when a ruck is forming. If you're offside, and try and run back, you can actually run right through the players in the ruck, as if they were invisible. While these issues occasionally annoy, they are not bad enough to take away from the incredible feeling of breaking from the pack to score a try.     EA secured the license to the Guinness Premiership, the UK club league, so the list of tournaments has grown quite vast. Included are the licensed Tri-Nations, RBS 6 Nations, Ten Nations, Super 12, Super 14, Lion's Tour, Guinness Premiership and the unlicensed World Championship and European Cup, meant to represent the Rugby World Cup and Heineken Cup, respectively. Also included is the World League, a franchise mode in which you start with a Division 3 team and move on to bigger and better things.    In the audio department, the alt-rock EA Sport Trax return, as well as play-by-play man Ian Robertson. Former All Blacks star Grant Fox joins Robertson in the booth and does a fine job, although the commentary is a bit repetitive. For instance, every time there is an interception, Robertson shouts, ~It's an interception!~ Every time. The crowd is pretty spectacular, and you'll get excited right along with it when your player breaks into open space. The crowd does a fine job after big hits and open runs, and there are plenty of team-specific cheers too.   Chicks dig the Haka, if they live in New Zealand. While some argue that the PS2 version controls a bit better with passing being mapped to the shoulder buttons, Xbox does just fine as well with passes on the face buttons. There is no online play this season -- EA says the market is just not there -- but when you play a friend that knows a bit about rugby, you're going to have some fun. By the way, Rugby 06 costs only $29.99.  Rugby 06 improves upon its predecessor in almost every way. Breaking through the defense for a try or nailing an opponent with a high-tackle is immensely satisfying. The additions of the off-load pass and impact players, while subtle, improve the gameplay experience and help the game more closely resemble the actual sport. The crowd is excellent and draws you further into the match, while the commentators do well before the repetition sets in. There are some definite graphical hiccups, but thankfully they don't detract from gameplay, and during cutscenes, this is easily the prettiest rugby title yet. If priced at $49.99, Rugby 06 would have been easy to recommend to hard-core rugby enthusiasts. At $29.99, however, this game is a modestly-priced introduction to one of the toughest sports on the planet. Ruck up!", "date": "Feb 11, 2006"}