{"name": "Finding Nemo: Escape to the Big Blue", "name_review": "Finding Nemo: Escape to the Big Blue", "ref": "https://www.ign.com/articles/2006/02/16/finding-nemo-escape-to-the-big-blue", "text": "Finding Nemo: Escape to the Big Blue is best described as Feel the Magic for the young ones. Though it ties up a bit of the loose ends left at the end of the original theatrical flick,  it's not an adventure - it's a collection of mini-game challenges in similar vein as Sonic Team's DS launch title. Instead of being frisky with a hot chick, players are simply challenged to help the Tank Gang get the heck out of the dentist office and into the big Australian ocean. The developers do a nice, solid job offering up a decent amount of variety-filled challenges, but unlike Feel the Magic, the presentation isn't quite as tight or interesting. Still, for the kiddies this game's a decent DS outing for some quick-shot gaming.   At the start of the ~adventure~, players choose from a starter bunch of fish to help get to the Big Blue. Each fish begins in a Super Monkey Ball-slash-Pac 'n Roll style challenges where players use the stylus to stroke the fish bag through landscaping, across the highway, and over a pier while, of course, avoiding obstacles along the way. In this challenge, players can jump with the shoulder button to cross chasms or holes, as well as blow into the microphone to send the Ziplock baggie zooming forward for a quick burst of speed. These are pretty well designed apart from a goofy fixed camera that gets jammed up especially in the harder fish levels, but the biggest downside is that there are too few of them. It's only one fixed level per fish.   Once a fish's rolling level's complete, it opens up the additional challenges, and this is where the real variety comes into play. Each of the fish has his or her own grouping of three different mini-game challenges of varying difficulty and technique, most of which put the DS system's touch screen to use in different ways. In one challenge, you have to flick Bloat the blowfish like a balloon to avoid getting snagged by the angler fish. In another, the task is to guide a falling pearl down a network of coral by spinning the screen with the stylus, a la the classic SNES game On the Ball. There's even a Dance Dance Revolution game with the ~mine!~ seagulls, played with the touch screen and stylus. There are 28 set challenges to play, along with another batch of unlockables that open up when certain criteria are met.   The game pushes a solid 3D engine for many of the games, though when both screens are needed for the mini-games, you won't get the slick 3D. The music is a mixed bag, and the quality (or lack thereof) is usually due to poor compositions that many times sound more than a little generic.    The biggest issue is, like Altron's previous DS project Tak 3, a lack of real polish in its presentation. Other than the familiar characters and several nods to the previous movie's plot, Finding Nemo: Escape to the Big Blue lacks recognizable elements from the movie. The generic music isn't based upon the film's movie score, and beyond the seagull ~Mine!~ outcries, there's no speech from the film's stars or supporting cast. All this game offers is a string of games linked together via a generic menu system.   But the designers at least do a decent job building up the replay value with its customizable aquarium. By completing games and getting a high score, as well as collecting shells in each fish's first level, players can purchase unlocked characters and items to place in a terrarium. It doesn't do much but sit there for the player to scroll and zoom in on, but it's still a neat addition for the kids to play around with their own version of the movie's aquarium. It's just a little ironic that you're helping these guys escape, only to throw them right back into captivity.  Finding Nemo: Escape to the Big Blue is clearly for the younger crowd, so it's obvious why not a whole lot of effort went into tightening up the bland presentation. Even with the age demographic skewing towards the kids on this one, the developers put together a decent set of clever and creative mini-game challenges that really do push the DS system's capabilities. It's not as fulfilling as Feel the Magic or even the Wario Ware series, but Finding Nemo holds its own, especially for the audience it's aimed at.", "date": "Feb 16, 2006"}