{"name": "Empire Earth Mobile", "name_review": "Empire Earth Mobile", "ref": "https://www.ign.com/articles/2006/02/22/empire-earth-mobile", "text": "This site has hosted much discussion over the nature of mobile gaming -- casual versus ~hardcore,~ bite-sized play versus extended gaming sessions, licensed fare versus original IP. VUG Mobile's Empire Earth Mobile touches on all of those issues. This is a deep mobile game that requires a sizeable time investment, based on a very popular PC strategy game from VUG and Sierra. Does a major land war strat game belong on mobile? Does it play well enough to satisfy fans of the original series?   My exposure to the source material is admittedly limited. Empire Earth Mobile mirrors the epic approach of the PC game, as you command a civilization over the four great eras of human history. You start the game in the Stone Age, with Homo Sapiens pushing back against the Neanderthals. The game then moves into the Middle Ages, stretching through the Modern Age all the way to a sci-fi society grudge match in the Nano Age. During each era, you will see time-appropriate units, such as cavemen and French troops -- so while there is a definite fantasy element to the proceedings, there is always one or two toes firmly planted in history.   This mobile edition has all of the basics of a strategy game in place. You must seek out and capture resources to build and upgrade units. You can upgrade units to make them stronger. You have to build structures (mines, oil rigs, etc.) that generate resources as well as those that generate units. If you have a solid grasp on the category, Empire Earth Mobile won't throw anything necessarily ~new~ at you.    Empire Earth Mobile offers three different game modes: Campaign, Skirmish, and Multiplayer. The Campaign mode is the single-player game that stretches across 10 different levels. You have different objectives in each mission, so the game does offer some variety beyond the basic army buildings and enemy smashing. You will need to escort units to safety or try to capture an enemy building, for example. The Skirmish game sets up battles outside of the main story arc. Multiplayer sets up one-on-one battles between two players that pass the phone.   There is a learning curve to Empire Earth Mobile, which is helped by an extensive tutorial. It takes a little time to get through, and during play, you might be apt to forget some of the lessons learned. For example, during the beginning, I had neglected some of the resource management tolls (such as spending resources to upgrade units) that my opponents had no problem doing. With so much going on in such a little game (and by ~little,~ I'm referring to the mobile nature of it -- the game itself is quite large) you have to keep track of epoch improvements, capturing buildings, making sure you don't burn through too many resources too quickly which creating units, etc.   At least all of these features and upgrades can be easily controlled -- the game doesn't use the number pad. You can play the whole thing with just a single finger on the thumb pad or stick. That's a very welcome feature, because I felt like I had enough to keep track of without committing a bunch of commands assigned to the number pad to memory, too. When you need to perform an action, such as move or attack, you bring up a radial menu with all available options. You can quickly cycle through it to get to the command you want.   My main complaint about the game is the pacing -- it feels slow. Moving units, launching attacks, setting plans into motion -- it just moves at a pace that the average bus stop mobile gamer might have a hard time accepting. If you were just going to sit at home and play, I might be tempted to argue why not seek out a fuller strategy experience on a computer, should one be available.   Empire Earth Mobile is not an unattractive game. The units are small, but look exactly like what they are supposed to be -- gunner, bazooka, tank, etc. The fields are presented from an isometric view, which shows off quite a bit, but doesn't necessarily make moving around the screen that easy. (I preferred the overhead view of Ancient Empires II.) The game is accompanied by looping music that sounds fine.  Empire Earth Mobile is a slower paced mobile game that's not exactly suited for quick pick-up-and-play sessions. You don't just hop on for a few minutes between meetings to turn back the French and then settle in for an hour-long presentation on ROI. If you are looking for a mobile game, though, that is decidedly meatier than, say, solitaire or Tetris, Empire Earth Mobile does offer some solid play.", "date": "Feb 22, 2006"}