{"name": "Black", "name_review": "BLACK", "ref": "https://www.ign.com/articles/2006/02/23/black", "text": "BLACK is a 100% visceral experience, 100% of the time. It's engaging, enthralling, and moreover, it's simply the definition of fun imbibed into two analog sticks and a handful of buttons. You'll have an extremely hard time finding a game that does a better job at placing a gun in your hand and letting you blow the utter $@%* out of everything in front of you.   But in the end, that's all it is. While Criterion has basically nailed every single aspect of pure destruction via 1,412,758 bullets and a crateful of grenades, it's essentially as straightforward a shooter as they come.   It's somewhat odd to say this, but nearly every aspect of BLACK's strengths and weaknesses lie in its pinpoint focus. It's such a direct and no-holds-barred FPS that it almost entirely ignores the ways that other shooters have branched out in recent years and attempted to bring storytelling and outside emotions into their games. In this way, it feels like something's missing, something almost intangible. But at the same time, what BLACK attempts to do it does so well that it's an experience that shouldn't be missed. This is a popcorn game through and through, but it's really damn good popcorn with the perfect amount of salt and butter to make it taste just right.    Explosions and Fire  The essence of BLACK is destruction. It's not meant to be a game where you precisely aim every shot and conserve ammo like it's a natural resource. Rather, you're encouraged to unload round after round after round in the general vicinity of your enemies, and should your bullets not find their way directly to your target, the explosive crates, barrels, oil tanks, mines, chunks of cement or whatever else near your foes will surely get them.   One thing that BLACK absolutely nails, unquestionably, is the way that each and every single bullet fired interacts with the environment in some fashion. Each shot gives you some sort of visual feedback in one way or another, be it as simple as dust kicking up when a bullet hits dirt or an absolutely enormous silo exploding upon impact with a rocket.   This is really the bread and butter of the game's experience, and it's rather amazing how well Criterion has done this on current-gen systems. While a simple cloud of dust might not sound amazing, when this happens multiple times per second, per shooter, and said dust begins to rise and fill the air, you begin to see visual confirmation of how chaotic the gunfights are. When shards of glass begin flying through the air and muzzle smoke mixes with that of plaster and metal, completely clouding your vision, and then you hit a gas canister and its explosion cuts through the smoke like a knife, you'll actually be glad you'd been missing your target.   On top of the smoke, dust and shards of glass that'll become the footnote of your way through the game, much of the environment in the game is destructible as well. Not only will barrels and vehicles explode as you'd expect, but you can chip off pieces of concrete, blow holes through walls, knocks chunks out of pillars and so forth. Not everything in the game is destructible, mind you, but what you'd assume should be, probably can be destroyed.   This is not only for visual kicks and giggles but it ties directly into BLACK's over-the-edge gameplay as well. If there are heavily armored guards near a pillar, you can take out chunks of its higher section and crush your enemies below it. If a hallway is filled with steadfast enemies, you might be able to blow a hole in the wall of an adjacent room and flank them. If an enemy has taken cover behind something, you can very likely chip away at it until you have a clean shot.   Honestly, it's rare that graphics really do make a game better, but in this case the visual cues that Criterion has thrown into BLACK really do go hand-in-hand with its core design. Had bullets simply left decals on the environment, the game would have fallen apart. But the fact that every shot leaves some sort of signature really goes a very long way into making the game a truly visceral experience.    Any Which Way  Being able to take out some walls and barriers for alternate routes is only a small piece of BLACK's somewhat open level design. It's still a very linear shooter, mind you, but many areas have multiple ways to not only tackle situations as they present themselves, but multiple routes of navigation as well.   For example, in the Treneska Border Crossing mission, the level that begins in the forest area, there are caves on either side of the level. Each will net you a few more kills, ammo and health packs, though neither are necessary. One of the caves will lead you up the level a bit closer to the border, your eventual target, allowing you to skip a bit of the forest. There are sections like this all through the game, be it either hidden houses or huts to the side of an area that will net you extra goodies, or entirely alternate routes that you can take to progress.    Early in the Naszran Foundry mission, you're presented with a path to the left and one to the right. The right path is an uphill battle and one with little cover, so it may seem like a bad choice and a route that you might want to skip altogether. However, nailing a few shots at a large shelving unit at the top of the hill will cause a few large cylinders to roll down the incline and crush some of your enemies, thereby bettering your odds to something more manageable. After clearing out the path, you wind up on the second level of the building you would have come to had you gone left, but being on the upper floor allows you to grab an extra hidden document, important for completing each level's secondary objective.   There seem to be a ton of cool little areas like this to explore, enough that it's unlikely that any of us here have seen everything in the game. This'll help a tad to extend the game's length, which we'll hit on in a bit.   Fire Blankets  Going back a second to taking out cover, this brings up one major misconception about BLACK: it is not a run-and-gun shooter. Sure, you can play it like this and it'll be fun as hell, but you will die again and again.   BLACK is all about finding cover and using it to your advantage. As much as you'll feel completely empowered when you unload a clip into an as-yet untouched area and demolish everything in sight, the enemies can do exactly the same thing. In other words, you'll be just as afraid of BLACK's destruction and free-firing nature as you are in love with it.   Now, though cover is extremely important, it's not actually a ~stop-and-pop~ game like something along the lines of what Gears of War has been made out to be. The only time you'll ever stop firing is when you need to reload, but even when you're unleashing hell you'll want to have something nearby protecting you from at least one angle. Cover is important not really to cower behind, but for use to keep every enemy in the area from firing at you at once. You need to use cover as protection from one group of enemies while you take out another. Consider it your best friend in the game, at least until it's gone.   It's this sort of play between complete destruction of your enemies and only partial destruction of yourself that makes the game intense. You will be shot, but how much and how often is up to you. You don't need to be patient, but you need to be careful. There are fine lines here that BLACK touches on, and it all works really well once you ~get~ it.   Tactics  Now, speaking of getting gunned down by the AI, your enemy generally does a pretty decent job of taking cover and finding decent spots to set up at. Enemies off in the distance will close in to attain better cover and more accuracy, though usually only when it makes sense.   Aside from moving from point to point, they don't really run around too much and generally act as cannon fodder, which seems to play into the game's overall movie-esque style. What we're getting at is that it's not intended to simulate an online deathmatch. This does mean that from time to time they'll stand out in the open and are seemingly glad to take a clip to the chest, though luckily they don't run around like chickens with their heads cut off.    In certain missions you'll have a couple teammates at your side who tend to abandon you if you disobey orders and head into dangerous territory without backup, which, of course, you'll do. Your squad generally behaves about as well as the enemy does, which is to say that they'll find a spot and stick to it until their target is dead, sometimes even if they're under heavy fire.   While your squad-mate AI isn't perfect, it doesn't really matter as they do end up enhancing the experience, even if only a little bit. You'll basically just run off on your own anyway and run into them again from time to time, usually happy to see them taking some fire for you. Again, the AI isn't great, but it does work reasonably well and doesn't ever really detract a whole lot from the overall experience.    Denouement  Now, while the straight-up shooting elements of the game really are exceptional, as mentioned, that's about all there is. There are some cool shootout sequences, but very few specific sections that make you look back and say, ~Man, that part where X happened was awesome!~ It's almost as if the game set its bar right from the get-go and never really strays from it, neither lower nor higher. To its credit, BLACK really has zero downtime throughout the course of the game - all of it is awesome, trigger-always-pulled action. But none of it is flat-out phenomenal in the truest sense of the word. There aren't really any moments in the game that rise above everything else around it, creating any sort of contrast within the context of the game.   This is a little hard to explain, so I'll use a movie example. Raiders of the Lost Ark is, in my opinion, the most perfect movie ever made. It's not my overall favorite, but I have absolutely no faults with it and it's fantastic all the way through. But even though I love every second of the movie, certain standout sequences come to mind when I think about it, like the face melting sequence at the end or when Indy simply shoots a man after an impressive display of swordsmanship. Or the part where Indy is being dragged by a truck and fights his way into the cabin. Or hell, the classic intro. I could go on and on, but you get the point. Each of these sequences stands out on its own.   This isn't really the case with BLACK, however. Some sections are cooler than others, sure, but only slightly so. You're always shooting at soldiers and things are always exploding. There aren't sudden shifts in this scenario where you're in total control one second and then being chased by a helicopter the next. The environments change, but the action doesn't.   Really, this is more of a missing aspect of the game than a fault. What's there is great, but had there been something more every now and then, it would have shaken up the feel of the entire game.   Content, or Lack Thereof  One thing that's sure to be a sore spot with many gamers is BLACK's overall play length. Taking various play times from around the office, it seems like the average gamer will finish the game in somewhere between five and six hours.   No, it's not long, but that wasn't ever the intention. Honestly, I personally don't mind its short length as much as others do and will. I'm certainly not happy about it and would liked to have seen a few more hours tacked on at the end, but I can live with it, mainly because it makes it more likely for me to play through BLACK every now and then than something that packs five hours of gameplay into a 10 or 12 hour experience. Again, it's very short, but those five or six hours are jam-packed.   The other thing that people will groan about is its lack of multiplayer. In a day and age where 99.426% of all first-person shooters have some sort of online play, BLACK doesn't. There are a number of possible reasons for its exclusion, like technical problems or sole focus on its single-player portion, but it doesn't make it suddenly appear. And coupled with its short play time, people may be turned off by this. Let me say that I'm looking forward to playing through the game yet again when I have a copy that I can run at home and that I do think it's worth the purchase price, multiplayer or no.    Pretty  I've already talked a fair bit about the visuals earlier, but it should be made very clear: this is a fantastic looking game. The amount of whiz-bang technology that Criterion has been able to implement on the PS2 and Xbox is pretty damn amazing. Burnout looked great, but BLACK looks better.   From the destructible environments to the absolutely outstanding particle effects, BLACK is a true showpiece for both systems. Enemy units feature nice ragdoll physics that, when coupled with the plentiful amount of explosions in the game, make for some very satisfying kills. The physics are tuned to react very quickly, meaning that bodies carried in an explosion don't float, they fly, impacting walls with brutal force.    Volumetric lights, specular highlights, bloom effects and even a bit of depth-of-field during reloads are all seen here, and even if they're faked due to current-gen hardware restrictions, every effect is pulled off beautifully.   The draw distance is also fantastic and plays perfectly into the size of the levels. These things are not only huge but often encompass either outdoor or city environments that truly test the engine's capabilities. There's hardly a person that walks by and sees the game that doesn't immediately comment that it looks great, especially ~for only being on the PS2 (or Xbox).~ Really, with all of the buzzword tech features going on here, were the game simply put out in a high-def resolution with sharper textures it would find a nice home on the 360.   Alas, all of these visual tricks come at the cost of slowdown on occasion. It's fairly rare, or at least it's rare that it's obvious, but it does happen. The somewhat bright side to this is that the game simply slows down rather than becoming choppy, meaning it still runs smoothly, just slow for a short time. This kinda gives a cool, unintentional slow-mo effect, that, although we wish weren't there at all, is the lesser of two evils, the other being a chuggy framerate.   Boom!  On par with its visuals is BLACK's audio. The various weapon effects are second to none on either platform and sound amazing. Ricochets and bullet effects all have multiple samples associated with them, so even if someone's lighting up the ground around your feet, you'll swear you can't hear the same sound twice.   Let's make this very clear: your neighbors will hate you while you play BLACK. This is a game that screams to be cranked to 11. The subwoofer effects that kick in when a grenade goes off will jump a still heart back to life. As mines goes off in sequences or explosion after explosion ignites around you, you'll be deafened not only by the volume you'll want to play this game at but by the intensity of the sounds.   Somehow, even with all of these effects going on, the sound doesn't get bogged down and directional audio is always apparent. I'd go so far as to say that BLACK shows the limits of the PS2 and Xbox audio systems. It's so good that the PS2's Dolby Pro Logic II can't keep up and the Xbox's 5.1 mix is barely up to the task. If this were a movie, it would be a requirement to see it in a THX-certified theater with a 1 billion-watt audio system.   Oh, and one last note on audio: BLACK has one of the coolest soundtracks I've heard in a while. Its opening theme is amazing, and though you don't hear much of it while playing, the in-game cues are excellent as well.   Presenting BLACK  The last things we'll hit on here are a few of the game's presentation aspects. Real quickly, we're not going to ruin the game's cinematics or the overall story involved therein, but we'll just say that it involves international affairs, terrorist acts and the like. Your character, Jack Keller, is a member of an elite force that has been tasked with putting an end to some evildoings. All of this is cool so we won't really spoil it.   But this is where there's something a little odd. Each level has a secondary objective which simply requires that you collect or destroy a certain amount of classified documents, some that the US wants for keeping and some that it wants destroyed for obvious reasons. These are generally easy to come across and collecting them isn't a problem.    The semi weird thing though is that the cut-scenes and the titles of the documents themselves all deal with very heavy themes - things like blueprints of real terrorist targets or the US helping terrorists in one way or another. A fair portion of the documents and blueprints are named after real-world occurrences and potential targets, making this very weighty. But on the other hand, all you ever see is a quick title and then you're back into what amounts to brainless action. It's as if Criterion wants to bring these sorts of things to public attention and give the game plenty of political weight, but then brush it aside the next second and go back to more simplistic videogame stuff.   Granted, none of this really hurts the game in any way since you probably wouldn't have realized some of these documents were based on real things unless you're really into international and terrorist affairs. Maybe that's the point, I'm not sure.    Regarding the game's more option-oriented stuff, BLACK delivers in spades. While you don't have the ability to tweak the control's sensitivity, you do have the option to configure essentially any button to any action. This means southpaws will feel at home as would people who want to make the game control like Halo or any other scheme they like. Additionally, you're able to replay any mission you've already beaten, which we always appreciate, and there's a fair set of stats for your overall play, like number of kills and such. Icing, if you will. Oh, and the menus are cool as hell.BLACK is everything you'd ever want in a shooter if all you ever wanted to do was shoot stuff. It's an extremely focused game that offers one of the most visceral gaming experiences you'll find anywhere. But, it offers little variation outside of blowing things up and its short length and lack of multiplayer will irk some people.No matter its faults, however, this is a game that everyone really should play through. After going through it ourselves, we can't help but think of the leaps that Criterion made with its Burnout series and are anxious to see if they'll carry over to BLACK as well. If nothing else, BLACK really, really makes us hunger for a sequel.", "date": "Feb 23, 2006"}