{"name": "Sonic Riders", "name_review": "Sonic Riders", "ref": "https://www.ign.com/articles/2006/02/24/sonic-riders", "text": "Someone at Sonic Team has really got to lay off the Marketing for Dummies books. Undoubtedly discovering that players sometimes gravitate toward games with guns, the pioneering Japanese studio last year created Shadow the Hedgehog, which was more or less Sonic Adventure with weapons. The added shooting mechanics were arguably the weakest additions to the formula. Now comes the racer Sonic Riders, a concept that initially seems to make sense for SEGA's speedy mascots. After all, Sonic R for the defunct Saturn console had potential and the best bits about recent hedgehog games have been the frenzied, rollercoaster areas. Unfortunately, the developer once again opened up its marketing book, took a look at the success of EA's SSX franchise, and decided that its blazing fast characters would be better served on snowboards. They aren't.  We can't write that we agree with the direction that Sonic Team has seen fit to take its classic characters, but neither can we state that Sonic Riders is a catastrophe of an effort. Fact is, this is a much better game than Shadow the Hedgehog, whose mechanics were flawed at every turn. Riders, in contrast, never fails to deliver gamers an engaging sense of speed and mostly unpredictable tracks. Control is neither as tight nor as deep as we would have liked, but it's competent, and forgiving fanatics will find some thrills waiting when Sonic and friends catch air.  Presenting the Hedgehog For as much as we may gripe and grumble about some of Sonic Team's design choices, we don't have too many complaints about its presentation of the famous hedgehog and his friends. Riders begins with a crispy clean full-motion animation that details the minimal storyline, which serves as the backbone for the races that follow. Sonic comes into a new Chaos Emerald, but before he can snatch it up, a snowboarder drops from the sky and steals it. When Sonic follows, he discovers that his old nemesis, Dr. Eggman, is behind the thievery and, further, has challenged the hedgehog to compete in a series of events to win back the stolen item. Players are required to trek through the title's story mode in order to unlock tracks and characters and there are pivotal cinematics between levels, which adequately separate the action and move the premise forward. This tale won't win any awards, but it does at least unfold with real-time cinematics, which are themselves complemented by overcooked, yet somehow appropriate, voice acting.    The SEGA hardcore will be pleased to know that Sonic Team has not skimped on the license. In addition to a story mode, the title boasts a massive selection of old and new mascots, including everyone from Sonic, Tails, Knuckles, Amy Rose, Jet the Hawk, Storm the Albatross, and Wave the Swallow to Dr. Eggman, Shadow the Hedgehog, Rogue the Bat, Cream the Rabbit, Robo 1 and Robo 2. Gamers can also use collected rings to shop for new snowboarding gear for their favorite characters, extending replay value.  Really, though, Riders is all about the fast and unpredictable races and Sonic Team has done a solid job of delivering on speed and anarchy. As in any racer, the main objective is to finish ahead of any competitor, but Riders serves up a few twists, some of them literal. The mascots hop onto hovering boards and blaze through courses, spitting out the occasional trick, grinding the rare rail, and catching air when the opportunity arises. There is a shallow, but enjoyable trick system in place. Gamers need only press in a given direction to execute in-air moves and then land for more points. Players looking for any extra depth in the setup, however, will find themselves very disappointed.  Sonic and friends can execute speed bursts to catch opponents and for added air time, which adds welcomed flexibility in matches. The downside is that using too much boost causes the characters to run out of energy and they'll need to stop for a recharge, a tedious, unnecessary process that slows the racing experience.  The game introduces a unique turbulence system, which enables riders to literally surf the wind trails of their competitors. It's a refreshing idea and it's made more enjoyable by the fact that tricks can be executed and linked into combos between different turbulence systems. Some level of skill is additionally required to identify the turbulences, ride and link them. If there's a drawback to this element, it's that the wind trails tend to play the racer for gamers. Once inside a turbulence system, participants could set their controllers down and advance anyway.   Sonic Team has done respectable work of mixing up the levels. Riders will race through everything from a futuristic Metal City and Splash Canyon to Dr. Eggman's Factory, a lush jungle known as Green Cave, and even some Sand Ruins. The variety is commendable. That noted, we think the studio missed an opportunity with the design of the courses, which as a whole lack the twisting corkscrews and loop-de-loops that have rocketed Sonic the Hedgehog to stardom. There are also occasional camera issues to contend with despite the fact that the action is mostly forward moving. We have to also note that we kept wondering why SEGA didn't simply contract Amusement Vision, which made the spectacular F-Zero GX, to design this racer? The F-Zero engine - everything from sense of speed to control and graphics - is well beyond the code serving Riders.      On top of everything else, Riders boasts a variety of multiplayer modes, all of which run smoothly even with up to four players in split-screen competition. The action is more enjoyable with two players simply because it becomes difficult to ascertain exactly what is happening on-screen in four tiny windows, mostly because the title moves at a speedy pace and features unpredictable track work.  Sonic Riders looks and sounds like Sonic Adventure with snowboarders. The same visual and aural ups and downs exist, in other words. What that translates to is a colorful experience that runs at 60 frames per second and in progressive scan on GameCube and Xbox. Sonic Team has injected levels with some added graphical effects, from advanced particles that stream and explode to welcomed depth of field blurs and heat distortion shimmers. Many of the backgrounds come to life with animation, from falling sand to flowing water. Even so, the stages lack geometry and texture detail, which means objects tend to look blocky, undefined and, in some cases, blurry up close. We're willing to sacrifice image quality for a smoother framerate, particularly for a racer, but there are prettier competing games on the market that simultaneously boast a silky fluidity.   The audio portion rocks out with typical cheesy guitar riffs, but also features a few surprisingly ambient and worldly tracks that in our opinion better fit with the themes of the different locales. Of course, everything runs in Dolby Pro Logic II for full surround sound.   Sonic Riders has its moments and I think that some diehard fans of SEGA's mascots will be able to appreciate these instances more than anybody else. Whizzing forward at a fast jaunt, catching some air, landing into a turbulence system and blazing along can be a fun and entertaining undertaking. Meanwhile, purists looking for a big selection of characters and a new Sonic storyline, although thin, will definitely find both waiting for them in this new racer. Sonic Team has with Riders cut out the tedious exploration elements found in previous hedgehog outings and instead tried for a game almost entirely centered on rollercoaster thrills and speed  and I admire that. But some silly and unnecessary design choices remain. Sonic is one of the fastest videogame mascots alive, so why has he been made to ride a sluggish snowboard in this new racer? I could forgive this were it not for the fact that Riders is neither as fast as a game like F-Zero GX, nor as tight or deep as a snowboarder like SSX. It lacks the beauty of both aforementioned racers, too. What we're left with is a game that arrives as a mildly enjoyable alternative to better offerings  and likely one that only unrelenting fans will be able to celebrate.", "date": "Feb 24, 2006"}