{"name": "Ice Age 2: Arctic Slide", "name_review": "Ice Age 2: Arctic Slide", "ref": "https://www.ign.com/articles/2006/02/24/ice-age-2-arctic-slide", "text": "Ice Age 2: Arctic Slide arrives just in time for the upcoming 20th-Century Fox animated movie, starring Scrat, a squirrel/rat hybrid that isn't a protagonist in the actual movies, but the star of a series of short films that accompany the movies in their theatrical and DVD releases. Kids love him, adults chuckle at him -- he's a great character for Glu to focus on for their new mobile game.  As always, Scrat is after acorns and he'll go to pretty amazing lengths to get his little claws on them. In this side-scroller, Scrat slides across several arctic landscapes to collect his coveted nuts. He must collect a pre-determined number of acorns to move on to the next level -- if you fail to pick up enough nuts, Sid the Sloth sends you back to the beginning of the stage to try again.  The levels are designed like roller coasters, with big slopes and slides so Scrat can build up enormous speed and make big jumps. All the basics of Platforming 101 are in here, from moving platforms to hidden icons that require occasional leaps of faith to discover. He'll have to propel himself across pits to grab nuts that hang in mid-air. He must avoid thunderous avalanches and carefully slide away from falling icicles.   After just a few minutes with Ice Age 2, the inspiration for the game is undeniable -- Sonic the Hedgehog. And that's no slight on Glu's game. Those original Sonic games from the Genesis (and the new DS game) are still great gaming, so you can hardly fault Glu for wanting to lift a page from such a successful series.  While I have no idea what the second Ice Age movie is about, I'm glad Glu decided to just go with a simple action game based on Scrat rather than try and shove a bunch of film beats into the smallest screen. This makes the game feel less like a marketing tool than a real, honest-to-goodness game that somebody would have created independently of the movie. And while that might not mean a lot to many gamers, it certainly says something to me -- and I think it helps out the gameplay quite a bit, too.  Ice Age 2 looks a lot like the classic 16-bit games it draws inspiration from, from the nicely detailed Scrat spites to the parallax scrolling that gives the backdrop some solid depth. The game uses almost every hue of blue imaginable, which is appropriate for the wintry theme. From time to time, Scrat will encounter characters from the film franchise, like Sid the Sloth. I liked Ice Age 2 for what it was -- a light, breezy platform game that reminded me of some good, classic games I enjoyed on the Genesis and Super Nintendo. A good side-scrolling platform game is hard to deny, even in this era of gangster shootouts and high-speed racing thrills. But even more than entertaining somebody my age (and my references to the Genesis should help out with your guesses regarding that), I can see Arctic Slide really wowing younger gamers. Especially as they wait in line for the movie.", "date": "Feb 24, 2006"}