{"name": "TOCA Race Driver 3", "name_review": "TOCA Race Driver 3", "ref": "https://www.ign.com/articles/2006/02/24/toca-race-driver-3", "text": "Codemasters, the long-time racing development and publishing team from Europe specializing in European car simulations, has for years given gamers simulation style games. Critically and commercially, these games have done exemplary in Europe, but in the US their reception is mixed. Some games do well, others, well, meh. TOCA Race Driver 3 is, in a way, Codemasters way of maintaining its racing morals, if you will, while broadening the game to newer levels for the huge US racing market.    I admit, Criterion's Burnout series has spoiled us all. And in light of its success, you might ask how a simulation can be fun. TOCA Race Driver 3 makes it happen. It gives you the chance to drive more than 35 different racing disciplines, and it improves the great physics, graphics, car deformation, and handling that have made all Codemasters' games so likeable. This doesn't mean you get to drive 35 different kinds of sedans or 35 different kinds of trucks. No, it means you can drive everything: GTs, muscles cars, open-wheel roadsters, F1s, 4X4 monster trucks, rally cars, and heck, even 18-wheelers. Bored of one style of racing? No sweat. Play another. Codemasters has put a lot of control into the hands of gamers, and this third iteration continues that trend with great success.    Codemasters brings its normal level of professionalism to the game. Modes range from World Tour, a 30-plus tier set of challenges to Pro Career, which requires you to pick a racing style and launch into a full career competing in that style. A third mode, Simulation Mode, enables players to partake in free races, time trials, and 12 player multiplayer races over the Internet. Each race is packed with a substantial replay playback feature that enables saves, rewinds, fast-forwarding, camera options, and more.   Pick a car, any car. The World Tour is the game's designated launching point. Using a vertical branching system, Codemasters enables players initially to pick from two styles of races, play through three to four races in that style, and progress up the ladder. Each win opens up two to three new racing challenges, and each time it's a surprise. What delighted me was the full range of vehicles. Fans familiar with TOCA will be happy to know the GT and modern day licensed vehicles are in full supply. The menu layout is easy to use, and before each race you can check telemetry, tune your car (downforce, transmission, anti-roll, tire, brakes, ride height, suspension, and toe and camber), learn about the course, and in some cases switch vehicles. The way it's laid out is different than most Codemasters games. You have the option to tweak the car, but it's not necessary. This opens the game up to casual gamers, but gives pros the chance to fine tune their vehicles.   You also have the chance learn from an experienced coach. Codemasters has done this before -- used a fictional character to serve as a guide -- and it's certainly a different, less sexy tack than putting Josie Moran or Brooke Burke in your game. Interspersed between championships you'll receive input from your new trainer/coach/enthusiast, an aged, white-haired, pot-bellied, and highly charged GM type. He's got a wonderful Scottish accent and he's full of sayings that should entertain for a while. But sexy he is not. Codemasters has also peppered the game with a humble amount of cutscenes of opponent races who react when you drive badly. One particular driver comes after you again and again. You'll find that crashing into cars and thwarting opponent AI sends ripples throughout the game, at least in the cutscenes. It's mildly amusing.    Which brings us to the game's artificial intelligence. Generally, when playing a game with one kind of car, you'll find that mastering it over dozens of races enables you to cope with aggressive AI. Codemasters generally programs AI to stick to its driving line, but not rigidly so. If you bump an opponent out of its line, it will scramble to realign itself. In most cases, this isn't an issue. But with TOCA 3, given the range of cars that you'll drive, the result is a heightened challenge. If you're in an open-wheel car, an older car with a slim body and extended wheels, you'll lock with other cars. It's easy enough to detach: just slow down and pull away. But if you're driving really fast you could snag another car and slide into the grass. You could be hit from behind by an opponent trying to regain its line, which could spin you out. Or you could be tipped by an opponent, forcing you into the grass again. Each time you slide into the grass, the race is essentially over. Although it's possible, you're very unlikely to catch up.     There are ways around this dilemma. You can drive better; that always helps. Learning to master each car's idiosyncrasies is one of the game's biggest appeals. You can slow down and be careful, another amazingly helpful hint. Or you can just restart every game until you get a good race. The most likely scenario is a combination of all three. Regardless of your skill or experience, the enemy cars will drive dirty. You might be driving a perfect first lap, but an opponent car can drive close, slightly tip your back end and shift you instantly into the grass. Restart. This game is even more trial-and-error than that. In the lighter, less grippy cars, if you touch the grass or sand, you're potentially hosed.   All of these scenarios are dealt with Codemasters' new philosophy: let gamers decide. Simply restart the race. That's right, unlike any Colin McRae Rally game, restarting is enabled and there is no punishment. Screw up? Enemy thwarted your perfect lap? Catch a sliver of the infield? Restart. The end result is a more trial-and-error game than most Codemasters' racing sims. Given the developer's AI design, it's a decent way to handle such a huge variety of car styles. And it's a relief but it also feels fishy. Like a really easy way out. The lack of consequences is also another way to let more casual gamers in, but anyone who's serious about the game will find the AI irritating.    Pick the wide flamboyant World Tour or the deep, satisfying Pro series. Of course, you can skip World Tour, the game's sampler mode, and go straight to Pro Career. This mode is designed to head to after you've picked a driving discipline -- if you're that indecisive. For those for prefer the classic Touring Car experience, it's in attendance in its best attire. You'll get practice runs, qualifying runs, an excellent garage of cars to choose from, upgrade and adjust, and the handling, speed, and sense of feel are all classic Codemasters. The cars are fast and grip well, the engine sounds are tight, deep, and realistic, and you'll feel right at home in some of the finest cars there are to drive in a simulation. The upgraded and more powerful cars just enhance all these great qualities. Again, you can choose from any discipline you want, be it classic cars, oval racing, the newly added sprint car racing, 18-wheeler cabs, you name it. For fans of the series, however, pick Touring Car Championship and you'll be home free.   Whether your own a PC, PS2, or Xbox, Codemasters has created a beautiful racer. Cars deform, fenders scrape against the ground causing sparks, the detailed cars create excellent shadows and are gorgeously modeled. The deformation isn't wildly extensive beyond previous games in the series, but it's definitely noticeable both visually and from a performance standpoint. You can lose wheels, fenders, hoods, and more, and you can flip, lose axles, experience tire wear, flaring engine temperatures, and turtle. All of these can be seen from four different perspectives -- one from above the car, two traditional views from the cockpit, and one, side-mounted view similar to that seen in Project Gotham Racing 3.    All systems support online play. Online play is functional, occasionally riveting, and sometimes annoying. The list of options is huge, and all of the races support up to 12 cars onscreen simultaneously. The framerate sticks to about 30 FPS, just like in the game proper. The online set-up, nonetheless, is tuned for all sorts of great options, from basic lap quantities to course and damage choices, to car types, and more.TOCA Race Driver 3 is a different tack for Codemasters, and for the most part it works. Not only is the game filled with cars to race, car disciplines to pick from, and an enormous amount of replay value to enjoy, it also manages to healthily balance noobs and hardcore gamers. The later stages of the game really put you to the test with extremely fast and powerful cars, each one demonstrating the full evolution of that particular discipline. TOCA 3 is both fun and frustrating, depending on which route you take, but no one can say that it's shallow or poorly programmed. The game is beautiful, it offers an impressive array of authentic vehicles from old to new, and all of the classic race courses from Nurburgring, Oschersleben, Laguna Seca, Manama Bahrain International, Bathurst and others are there. It's definitely a worthwhile addition to your racing game collection.", "date": "Feb 24, 2006"}