{"name": "Super Monkey Ball Touch & Roll", "name_review": "Super Monkey Ball Touch & Roll", "ref": "https://www.ign.com/articles/2006/02/25/super-monkey-ball-touch-roll", "text": "The introduction of Super Monkey Ball to the arcades and, for most people, the GameCube system brought back some extremely enjoyable old-school-inspired gameplay to the scene. Though the idea of monkeys thriving inside sealed clear plastic spheres may have been an original concept, its ~roll them around an environment~ idea was not - Atari's Marble Madness did this more than a decade and a half before Sega's Amusement Visions team's production. But it was how far the team took the whole ~monkey in a ball~ idea that made the series flourish in not just a pair of arcade/console games as well as a brilliant Game Boy Advance production and countless ports to the mobile platform. The Nintendo DS version is a revival of much of this concept, but the execution is a bit underwhelming because it does nothing special, and in many cases it's a step backwards from the style that made the series stand out from the crowd.Super Monkey Ball Touch & Roll is, at the very least, the core of what the games were on the console side: several dozen maze-style, ~beat the clock~ challenges where players roll their ball from start to finish, trying to stay on course and avoid countless hazards that can, and most of the time will, cause it to plummet off the structure. Players don't necessarily take control of the ball - instead, they tilt the environment to cause the Monkey Ball to roll down the incline created by the tilting. It takes a steady hand and a keen eye for physics to get through many of these rolling mazes, and admittedly the game could get pretty frustrating in the original design. But this frustration level is increased five-fold on the Nintendo DS.On the console and arcade, precision tilting was handled by the analog control stick. On the DS, the tilting mechanism is placed on the touch screen - to roll the ball, players slide their stylus on the lower screen to tilt the environment in that direction. Early on it feels like this control works, but that's only due to the straightforward level designs. On the later, more complex levels, that's when the downsides start coming into play. It's less about rolling the ball and more about fighting the camera to point in the right direction, and when you don't have a whole lot of tactile feedback in how far you're pushing the environment it just adds to the aggravation. To remedy the awkwardness of the non-traditional touch screen control, the developers mapped the D-pad for digital control. Just as touch screen compromises tactile feedback, the D-pad compromises precise movement. Yes, you can play and conquer Super Monkey Ball with either control mechanism, but in both cases much of the challenge is in fighting the environment and the camera system more than it is figuring out how to get to the finish line the quickest way possible. And neither way is what you'd consider the optimal way of playing Super Monkey Ball. That said, f you're willing to put in the time and energy to ~fight~ the controls, then this main game in the Super Monkey Ball Touch & Roll experience will put up a good amount of challenge. That's only half the gaming experience, though. Super Monkey Ball has always been about the extra stuff - the ~party~ games that are both readily available and unlocked through the single player experience. But for a game that's essentially an original game design and not a ~sequel,~ it's a letdown to see very few original modes in Touch & Roll. Sure, the classics are here: Monkey Bowling is exactly what its namesake suggests: bowling with your Monkey Ball. It's very similar in design to the original Super Monkey Ball console version, with touch screen control instead of timing-based commands. But the physics are very slow and floaty, almost as if the pins were filled with concentrated helium. Monkey Golf is a clever miniature golf design, again using a touch screen control for the DS rendition. But then we get Monkey Fight and Monkey Race, two modes that worked on the console, but just aren't any fun to play on the DS simply because of the sloppy touch screen interface.The two exclusive modes are a grab bag of enjoyment. The Monkey first person shooter could have been a classic in the style of Faceball 2000, but instead comes off extraordinarily clunky due to some of the worst controls ever conceived for a DS first-person shooter. And Monkey Hockey is an underwhelming ~me too~ air hockey game, something that's been done in seemingly every other mini-game compilation on the DS system. Its hook is that you can actually draw your paddle ahead of time, but (and it's  clich to say this in any Nintendo DS review) this is more gimmicky than it is cool or different.The Nintendo DS game is close to the console game in visual technology, as the development team produces a slick 3D engine that pushes a 60 frames per second rate on the system screen. On the downside, the Touch & Roll team completely change the look of the Super Monkey Ball style by altering the look of the characters into something even more sugary cute than the original arcade and console versions. Even worse, the music in Touch & Roll is absolutely atrocious with background tunes that overpower the action - on the console, the sound engineers produced mellow and subtle music that complimented the gameplay, but here the sound team clearly wants to make itself known with blaring and unnecessary melodies, and it nearly kills the experience.Super Monkey Ball: Touch & Roll is simply an example of a game that just doesnt live up to its namesake. Its fun in spurts, and at the very least the designers lay out the challenges in a very handheld-friendly structure. But the touch screen control just doesnt work all that well in a game design that was established with an analog interface, and even after mastering the compromising touch controls, theres the reality check that this original Monkey Ball game just isnt all that special on the Nintendo DS.", "date": "Feb 25, 2006"}