{"name": "MLB 06", "name_review": "MLB '06: The Show", "ref": "https://www.ign.com/articles/2006/02/28/mlb-06-the-show-2", "text": "What a difference a couple of years makes to a much maligned sports franchise... Two years ago, if someone asked you about the relative merits of 989 Sports' baseball game, you might be hard pressed to come up with one.  Buggy gameplay, weak graphics and questionable control schemes all conspired to hamper this first party title.  Fortunately, last year's installment rectified a lot of these problems, inspiring hope that the franchise was not on its last legs.  For the most part, that glimmer of hope is well placed.  MLB '06: The Show is the best looking baseball game in the series to date, improving broadcast-style presentations for its players and menus while including two brand new game modes for gamers to enjoy.   No, one of these modes doesn't include a swing stick; in fact, it's somewhat refreshing to find that MLB '06 still utilizes the old school button press mechanic to determine when you swing the bat at a pitch.  You are given the ability to influence ball placement by trying to push or pull your hits, and you can attempt to provide your player with a boost to their power by accurately guessing the Zone Control Batting system to determine where the ball will be placed (as well as what kind of pitch it is).  MLB '06 raises the difficulty level from three to four, adding in the Hall of Fame Mode that splinters the strike zone into nine specific areas to more accurately represent the strike zone.  This level makes it much harder to make the sweet spot of the bat connect with an incoming pitch, but it definitely makes it more realistic.    The easiest way to become accustomed to the redefined Zone Control Batting system is with the new King of the Diamond mode, which presents the system in a fun mini-game replete with cardboard standouts of fielders, wild card areas and oversized targets.  Unlike the Home Run Derby which only counts balls sent over the fence, King of the Diamond allows players to actively hit for base knocks or acquire bases on walks.  However, it also penalizes you for infield flies or ground outs.  Each King of the Diamond inning is a two minute scorefest where you try to get as many runs as possible.  Actively hitting certain wildcard items, such as the tarp in center field, can get you time bonuses to extend your game clock.   It may seem somewhat confusing at first, but it slowly introduces concepts with batting with each new level, such as the difference between a contact and a power swing.  The only thing that I wish was a bit more clearly explained was the determination as to what's an acceptable hit, since it's really just pitcher against batter.  There are no outfielders (unless you pretend that they're invisible), so you can only assume that easy pop flies will always be called out, while hard chops down the line or into the outfield have a better shot of getting a man on base.    The other new feature is the Rivalry mode, which gives players the option to set up a series of baseball games between two teams.  That might not sound so exciting until you realize that you can set anywhere between seven and eighty-three games to play between you and your friends and the computer.  The game will actively track the stats of the rivalry as it's going on, including your hit streak at bat, which pitcher has the most saves and the team batting average for the series.  It's an easy way for baseball fans to pit their favorite teams against each other for bragging rights.    While the Career, Franchise and Season mode are relatively untouched feature wise, the thing that makes them stand out almost like new is the newly polished presentation for the game.  In particular, the plain, unimpressive text menus from previous years have been replaced with a slicker, bolder image system with animated backgrounds and rotating stats.  It's a lot more like the graphics you'd notice during the pre-show prep of a ball game.  Players also look much more defined, particularly when it comes to facial detail, and with more than 8000 motion capture moves included for the game, you are presented with a number of personal touches, such as player specific walks to the plate, batting stances and celebrations.   Many of these can also be applied to newly created characters, particularly with the EyeToy, and while there are still a number of shadows that are cast on your character model ~face,~ around the textured area your face is matted on, the feature works a lot better this time around than last year.  Taking a page from other sports games, MLB '06 also features a ton of additional camera angles and cuts to make the gameplay feel like it's pulled directly from a telecast.    Some of the stadiums look great:  U.S. Cellular Field, Angel Stadium, and Fenway Park are a couple of stand outs.  A number of the advertisements that have been scanned on the back walls, such as the faces of star players or detailed billboards look great.  The main problem arises when you start comparing some of the more polished graphics to some of the sloppier ones, which is where the number of bugs, glitches and other problems start cropping up.  While definitely more reduced than last year's game, they are lurking beneath the surface of MLB '06.  For instance, athletes in the foreground of a play will look great, but those in the background will resort to lower resolution faces and textures, with a couple instances of pop in on the latter man as a play develops from one part of the field to the next.   Depending on the stadium (primarily with AA and AAA teams), background textures are really generic and unimpressive or full of aliasing issues.  One stadium looks like it had square, boxy cars rolling across the bridge in the background.  (Don't even get me started on the same basic, choppy crowd textures that the MLB franchise has had since the PlayStation One...)  Other parks have an odd rendering pass issue that afflicts their scoreboards, making a jagged, stuttering animation as the camera pans across them during pre-game shots and other game moments.  Character model hands still have a relatively plastic, action figure presentation.    There are apparent seams on the character models where the hands or other parts connect to the model's ~trunk~, which will result in strange clips in animation on certain plays.  For instance, the AI for the game will sometimes assume that it's got the ball and start to make the throw animation into the infield while the ball squirts past them to the back wall.  Once it recognizes that it's run the incorrect animation, it slowly attempts to correct it.  It happens every now and then, and it's strange enough to make you laugh at the oddity while you score an in the park homerun or land at least a triple.    While the visual style of the crowd might suck, the comments from them are simply hilarious.  During one game, I overheard spectators call out, ~We're going to tune you up,~ or razz a poorly performing batter with, ~We've got your number!~  The number of responses, from exuberant when the home team was performing well to total dejection was excellent, and felt great along with the 16 song soundtrack, which ranged from rap to modern rock.  I only wish that I could say the same for the three man team of Dave Vasgersian, Rex Hudler and Dave Campbell, who are relatively tame and restrained in their calling a ball game.  Even worse, they're often five to seven seconds behind a call, which usually makes a comment that one of the team makes out of step with the game action.     The AI for MLB '06 is much better this time around:  It will actually throw a number of balls or even pitch out this time in an attempt to walk batters during certain game situations where it's better to put the pressure on the player, and it will vary its pitching style enough to keep you guessing.  There are still a number of things that are questionable for the AI, such as its decision to tag one player trying to steal a base while leaving another player on the same basepath relatively unmolested, or pitching to bases that aren't for a force play any longer when the cut off man is a much better decision.  I still question certain gameplay features, such as the ability for some defenders to be able to fire the ball from the back wall to the infield with speed and accuracy in midair or from their back foot, but I digress.    Apart from these hiccups, you will notice a lot of improvements to the gameplay, such as being able to hold up players in the middle of a basepath on a pop fly to determine if they need to tag up or go ahead on a defensive error.  On defense, it's much easier to get double plays by preloading your throws to specific bases, allowing you to move the ball around the horn as well.  The Total Control Base Running system that was presented last year has been re-examined, with leading off or recalling individual runners turning into a much simpler process: The L1 button indicates advancement and the R1 button indicates retreat.  You can either issue a full advance for every player on base or specify who you want to get a lead or retreat by indicating the base along with the corresponding button, which is an excellent touch.MLB '06: The Show is a good baseball game, but not great.  In fact, it almost feels like a patch of the previous year's game: The unreliable voice command system has been stripped in favor of simple chat and taunting via microphone. The EyeToy feature is much cleaner than last year's system.  The spreadsheet-like feel of the menus in Career, Franchise and Season mode have been replaced with flashier screens.  Character faces are much sharper.  But apart from a new mini-game and the inclusion of Rivalry mode, MLB '06: The Show doesn't really do anything revolutionary to the game system except fix a number of bugs that plagued MLB 2005.", "date": "Feb 28, 2006"}