{"name": "Onimusha: Dawn of Dreams", "name_review": "Onimusha: Dawn of Dreams", "ref": "https://www.ign.com/articles/2006/03/04/onimusha-dawn-of-dreams", "text": "Usually when something is supposed to be ~last~ in a series of popular movies, it rarely ever is. Friday the 13th, Nightmare on Elm Street, Star Trek, and a host of other fashionable franchises have always found a way to continue as long as there was a demand for them. This sort of mentality is even more prolific in the videogame market, though, where almost every piece of successful software is eventually met with some kind of follow-up, spin-off, prequel, or alternate universe-type cash-in no matter what the cool CG ending has you believe.   Naturally, Capcom's highly-accepted samurai action series, Onimusha is the latest member of the ~I survived past my final installment~ club -- and though it's certainly easy to point fingers and cry ~Greedy~ or ~Sell Out~ when first exploring the thing, it wouldn't be very fair to do so. You see, despite its perceived forceful extension, Onimusha: Dawn of Dreams is arguably the best of the franchise so far. In fact, regardless of what name appears on the front of the box, the game is blatantly badass.   It's a brand new cast of characters for this dream... well, mostly anyway. But what is it that makes Dawn of Dreams so appealing in the first place? Well, to begin with, it's a highly accessible game with an all-new storyline that requires absolutely zero knowledge of the previous trilogy. This means that if you were hesitant about trying the series before because ~Samanosuke~ was too hard to pronounce or Jean Reno's sleepy zombie eyes gave you the creeps, you have an all-new jumping-off point to play around with. It also doesn't hurt that the story is actually pretty interesting and that characterization is done extremely well. There's even a surprising amount of levity and comic relief scattered into what has classically been an otherwise somber franchise.   Since I'm on the subject of the narrative, I might as well tell you all about it. It's been almost two decades since the fall of Nobunaga at the hands of Samanosuke, and the fallen ruler's own vassal and lead chimp-face Hideyoshi Toyotomi has finally united Japan under the banner of peace... that is, until one fateful June evening when a strange glowing planet appears in sky. From that moment on, Hideyoshi becomes a power-mad dictator and earthquakes, volcanoes, and other Bruckheimer plot devices start brutalizing the land. Soon afterwards, the evil Genma begin to reappear, disorder spreads across the country, people are lost, and villages are burned to the ground. But just when it seems that we're approaching Japan's darkest hour, a mysterious warrior with plenty of power appears on the scene to stop it. He's Soki, Oni of the Ash -- otherwise known as ~The Blue Demon,~ and he's the hero of our story.   Expect plenty of CG cutscenes like this to tell the tale. The tale's remaining bits of fun I'll leave for you to discover, but as you've no doubt surmised from the various screenshots and movies already out, love triangles, family betrayals, world domination, and unfettered revenge definitely work their way into things. Thanks to an excellent mix of strongly directed cutscenes, appealing CG, and an occasional plot twist, the story itself is told very, very well (though I do have a bit of a sentimental preference to the Nobunaga trilogy). Plus, at a size of two discs and a length of 18-24 hours, there's plenty to get involved with here.    The game's strongest feature, however, is most definitely its high-action focus. More interactive than all other Onimushas before it, Dawn of Dreams has a surprising depth of gameplay that, frankly, I wasn't expecting. Multiple playable characters, different fighting styles, cooperative AI puzzles, and a number of other additions make this fourth installment a more complete gaming experience. This is especially true if you found the combat mechanics and camera work of the previous Onimushas somewhat bothersome.   But what did Capcom specifically do to please you? For one, the fixed camera angles have been cut back considerably. Other than in a few select areas, players can now rotate their view a full 360-degrees to get the best possible vantage point. When fighting against ranged enemies or foes located on multiple sides of your character, this addition alone is a pretty big deal (and a long time coming at that). The days of being nailed by off-screen fire archers are long gone.   If you like combat options, then Dawn of Dreams is definitely your game. More importantly, though, the battle engine is a lot less repetitive. With five playable characters and a slew of varying weapons between them, gamers have a substantial number of combat styles and techniques they can choose to implement. So whether you prefer Soki's heavier, more traditional broadswords to his standard ones, or have a penchant for using Jubei's blades instead of Ohatsu's projectiles, that's entirely up to you. Giving players the ability to upgrade common and unique moves through two different enhancement systems (souls for weapons / armor, experience points for skills / abilities) was a good idea as well.   But the coolest benefit to having so many available characters is how Capcom has designed its levels to compliment them. Rather than simply allow users to do whatever they want with any fighter in any stage, there are multiple sections that can only be accessed by certain characters, which allows you to go back and re-explore areas you've already been to (just talk to your upside-down buddy Minokichi, who lives in a clay pot of all things, to warp between the levels). You'll also run into these situations the first time you're playing through as well, and it's great fun to swap between your fighters (using L2 in real-time) to solve the puzzle that's keeping you from advancing. As an example, the second stage in the game has narrow ledges and doggie doors that can only be traversed by the smaller, nimbler Jubei, while the corpses of fallen warriors that litter the ground around them can eventually be communicated with once you've recruited Tenkai. Other special functions like item creation, grappling hook canyon jumping, and heavy box moving are also available to those that want to use them.   Each stage is designed with multiple character strengths in mind. Unfortunately Dawn of Dreams' character-focused stage design, while a powerful strength, is also one of its few weaknesses. Specifically, some of the restrictions put on your characters make no sense -- How can the all-powerful demon-killing pretty boy Yuki, for instance, manage to slice a five-story monstrosity in half with nothing but his sword and his scowl only to be halted by a box that's roughly the same size as a wastebasket because he can't move or jump past it? Other environmental obstacles like that can be found in all 17 stages too, which makes me hope that when Onimusha 5 comes along one day, that Capcom may want to consider opting for a jump button.    Another point of contention I have with Onimusha IV is its lack of enemy AI. The standard demon's thought process seems to be based entirely on an opponent's aggression level and their own weapon damage instead of situational reactions. Throughout the adventure, if I was silly and told one of my AI-controlled teammates to ~wait and recover,~ (one of four possible commands) it wasn't uncommon for a horde of lowly demons to gather around them and attack very sparingly. It saved my hide on a couple of occasions, sure, but it was still sort of silly to watch them stand around and do next to nothing with a sitting duck.   The good news is that the greater demons, sub-bosses, and main bosses are all incredible fun to fight and most of them bring a pretty decent challenge to the table. Even slaughtering the dim-witted lesser demons mentioned earlier is fun, because in a way, it feels like proper justice (the flexible and fun combat system helps with that too). Oh, and I must say, there really are some pretty crazy looking beasties to run into along the way -- sick, twisted, awesome... those are just a few of the words that sprang to mind as I battled them.   Boss confrontations rock our world, and they'll rock yours too. Onimusha: Dawn of Dreams definitely exceeds our expectations. It manages to overcome a couple of AI flaws and some dopey environmental complications to continue the franchise's trend of perpetual improvement. What's particularly impressive about it, though, is that it's hard to imagine a gamer that won't enjoy it on some level. Action hounds, for instance, should go crazy over its combat, cool combos, and boss battles, while proper Onimusha fans should dig it because of improvements to the puzzle and camera systems. Likewise, RPG nuts should enjoy the adventure because of its deep customization and a determination to tell a good story, while graphics snobs should get a big kick out of its stellar visuals and excellent artistic design.Regardless of which group you may consider yourself a part of, however, just be sure to do the right thing and don't pass it up. Onimusha 5, here we come!", "date": "Mar 4, 2006"}