{"name": "Ys: The Ark of Napishtim", "name_review": "Ys: The Ark of Napishtim", "ref": "https://www.ign.com/articles/2006/03/07/ys-the-ark-of-napishtim", "text": "I liked the PS2 version of last year's Ys: The Ark of Napishtim quite a bit. Though there wasn't anything particularly groundbreaking about it, its charming characters and action-oriented combat made it strangely interesting. It reminded me of a time when RPGs weren't about super-complicated battle systems or depressed and brooding anti-heroes, but rather, getting caught up in a fantastic adventure that told an exciting story. Sadly, this new PSP port doesn't continue that tradition.   But before we get into why, let's enjoy a little history. Around since 1987, the often-overlooked Ys series has been forever caught in the shadow of more mainstream titles like Dragon Quest and Final Fantasy. Despite this handicap, however, the franchise has still managed to garner a solid hardcore base and has helped inspire multiple game developers with their own RPGs. TurboGrafx maniacs in particular remember it fondly.    Regardless of your familiarity with the series, though, the Ark of Napishtim is still newbie friendly. Following the continuing adventures of the legendary red-haired traveler Adol Christin, the story picks up three years after the events of Ys V. On the run from the Romun Navy, Adol boards an escape ship that belongs to an old acquaintance only to be pulled into a Bermuda Triangle-type anomaly known as ~The Great Vortex.~ He wakes up a few days later in a place known as the Canaan Islands (a hidden chain of communities made up of other sea victims), and soon finds himself solving a mystery centering on a strange Red Fairy and an item of mystical origins.   As you may have surmised from the above description, the story isn't exactly Shakespeare and it's definitely one of the game's biggest weaknesses. The number of twists and turns that Adol takes as he retrieves the fabled ~Mirror of Zemeth~ could honestly be counted on the single ring finger of a one-armed Muppet. Even so, Napishtim's NPC portrayals are nothing short of excellent as nearly every character in the game has dozens of different lines to flesh out their personas and backstory. It's this compensation of personality and individuality that helps make the narrative feel bigger and more important than it really is; quite a rewarding little trick.    But honestly, the storyline is what you'll experience least in Ark of Napishtim, as the real meat of the game is the constant and addictive combat. Uncomplicated by every definition of the word, warfare is best compared to titles like Alundra or Legend of Oasis (attacks relegated to a single button). Hacking and slashing is what it's all about in this adventure, and the variation of your attacks is more than you'd first suspect.   This variety is accomplished thanks to the inclusion of a jump button that allows players to perform air strikes in both upward and downward motions -- as well the ability to swap between three different swords on the fly. All together this means that while your Wind Sword may be able to do basic combos, it can also create mini-whirlwinds for additional damage. Similarly, the Flame Sword requires you to hold down the button to charge a multi-hit flame strike, and the Thunder Sword lets you add a penetrating after-touch to the standard combo attack. These three types of assaults can then be made even more powerful with upgrades acquired in special ~Emelas Studios~ (that work like blacksmiths), and in total, makes for a pretty fun little system (that won't require hours of practice to understand).    Gaming purists may also be happy to note that the PSP version of Napishtim has reverted back to the PC original's 2D spites instead of the revamped 3D polygons used in the PS2 disc. This means that other PS2 additions like the CG intro movie and full voice-over work has been axed as well. Luckily, the new character and stages that were designed specifically for the PlayStation 2 version have been included here too; and the musical score sounds just as good on mini-speakers as it does a television set. The PSP edition even boasts a few handheld exclusives like a character database, some unique mini-games, and a media player.   So what's there to dislike about Ys? One of its most pressing issues is its incredibly short playing time. As you may remember from my comments regarding the characterization of NPCs, they have terrific moments... but you'd never known it unless you intentionally seek out conversations with random people. Otherwise, you'd never have a single reason to speak with roughly 90% of the islanders in Napishtim at any time. In short, sticking to the storyline and doing what's asked of you can end the entire experience in less than a dozen game hours. The enemies aren't too challenging either.    Of course, the real trick is making it through those 12 hours of game time because if you're counting actual time, it's going to take a hell of a lot longer. Among the nastiest examples of UMD access we've seen on the PSP yet, The Ark of Napishtim's loads are downright criminal. Almost every new screen in the game -- be it the menus, new stages, a leveling up celebration, whatever -- requires some kind of wait that can take as much as 15 seconds to complete. The interruptions happen so frequently in fact, that I seriously lost track of how much time I spent playing and how much time I spent waiting. It ruins things for sure.The Ark of Napishtim was a guilty pleasure of mine on PS2 last year because it was personable and gave me a great sense of nostalgia. For the most part, those sentiments were brought to the PSP as well, but the absolutely terrible load times injure the experience so greatly that it makes fighting through it hard to bear. Ys is a fun game to be sure, you just have to be incredibly patient to enjoy it. Get the PlayStation 2 version instead.", "date": "Mar 7, 2006"}