{"name": "Pokemon Trozei", "name_review": "Pokemon Trozei!", "ref": "https://www.ign.com/articles/2006/03/08/pokemon-trozei", "text": "The last time Nintendo's Pocket Monster critters adorned a puzzle game, it was to brand the company's Puzzle de Pon design as Pokemon Puzzle League and Pokemon Puzzle Challenge on the Nintendo 64 and Game Boy Color. Pokemon Trozei goes one step further: this is a completely original puzzle design that incorporates the whole ~Gotta Catch 'em All~ theme of the franchise.  Believe it or not, it's surprisingly fun and pretty darn unique, and most importantly, it's not ruined with an unnecessarily cutesy Pokemon presentation.   Don't be surprised if you don't find the word ~trozei~ at Dictionary.com. A ~trozei~ is the game's terminology for a match-up of Pokemon critters, which is what you're supposed to do in this game. As Pokemon drop into a five-tile-wide bin, it's your task to slide the critters left, right, down, and up by rows and columns in order to match them up into pairings. Matching four or five in a vertical or horizontal grouping will remove them from play, but more importantly, will trigger a temporary session called the Trozei Chance. While Trozei Chance is activated, you can match three Pokemon at a time, followed by two at a time. Continuing to string these two, three, four, or five groupings will extend the Trozei Chance moment, but it only lasts for a couple of seconds if you fail to do any matching.   Unlike other games in the tile-shifting-and-matching puzzle genre, Pokemon Trozei's gameplay isn't focused entirely on trying to race the stack of falling pieces before they fill the bin. Oh, sure, the game ends if the Pokemon tiles spill over the top, but because it's not hard to keep a combo string going, and because combos can happen just by randomly sliding the stack, you'll rarely end a game this way. Instead, the challenge comes from skillfully shifting the tiles around to wipe out as many as possible in a single move - just because you can remove two at a time during the Trozei Chance doesn't mean that's the best way to snag the points necessary to reach each level's score quota. Four and five-link huge Trozei score far more points than two and three link Trozeis, but they're much harder to get during the Trozei Chance. Coins are awarded for reaching the set score, which can be used in special options to open up more of the gameso it's a really good encouragement to get better and faster at the gameplay.   On top of this, the other challenge is to figure out how to snag rare Pokemon critters when they show up. Since they show up infrequently and without a matching pair, the only way to remove them successfully is to start a Trozei Chance chain then arranging the bin to match that rare Pokemon tile with the wildcard Ditto tile. But the game moves so rapid-fire that it's a tough task to pull this off most of the time, and since these rare Pokemon will vanish uncaught after a few seconds, they're all the more special when you manage to score one. If you miss the opportunity, there will be others, but it will take a whole lot of Pokemon Trozei tile-shifting strategy to catch 'em all.   And it's this quick, energetic pace that really gives Pokemon Trozei an original feel, even if it borrows from other puzzle games, like Yoshi's Cookie and Puzzle de Pon for much of its gameplay mechanics. It's also a design that probably wouldn't be nearly as much fun on a non-touchscreen system - it's the fast-paced swiping control that gives the gameplay its energy. On the other hand, the game's ~Endless Mode~ isn't quite as fulfilling as other puzzle games because it's more score and combo-based than challenge based - it can almost literally go on forever because of its lack of focus on filling the bin at an overwhelming rate.   Genius Sonority, the game's development team, poured a lot of effort into the game's multiplayer component, and this is a design that becomes extremely maniacal in its multiplayer competitions. And the studio makes it easy to get people into this mode through the single cartridge Download Play mode. And like many Nintendo games nowadays, Pokemon Trozei features a ~bark mode~ of sorts to trade data between player profiles wirelessly. The only thing missing is a Wi-Fi Connection option.  Pokemon Trozei is a new take on the familiar tile-sliding puzzle design, and it's a really good one. It's not the usual fare, and its heavy focus on combos may be a bit misleading that there's not a whole lot of challenge. It's actually quite tough, and in some cases, addictive to try and grab the high score quotas and random, rare Pokemon critters that wander onto the playfield. It's not a classic in the same way that Tetris and Puyo Pop have become in the genre, but it's still a lot of fun and definitely a unique diversion for DS owners.", "date": "Mar 8, 2006"}