{"name": "Galactic Civilizations 2", "name_review": "Galactic Civilizations II: Dread Lords", "ref": "https://www.ign.com/articles/2006/03/08/galactic-civilizations-ii-dread-lords", "text": "Tastes are funny. Some people out there will play anything just so long as it has the word ~tycoon~ on the box. Others will only really respond to mowing down legions of alien zombie Nazi robots with a handgun the size of a Civil War cannon. Still other gamers will spend hours online lying in wait for the appearance of the evil Frog Queen just so they can kill her and report her demise to Lord Sissypriss Fitzpansy back at the castle. Let them enjoy those experiences if they want. Me? I'm a 4x guy.  For those who don't know, the 4x genre lets players run entire empires, using the four X's -- expansion, exploration, extermination, and exploitation -- as guiding strategic principles. Whether it's the historical past, an inventive fantasy world or a star-spanning sci-fi future, the 4x game is strategy at its highest level. Empires are won and lost based on shrewd diplomacy, speedy technological research, sound economic management, and ruthless military action.   Last year's Civilization IV pretty much set a new standard for the genre, becoming the reigning king of historical themed 4x games (and took the multiplayer crown as well). This year, another sequel, Stardock's Galactic Civilization II: Dread Lords, brings the same level of polish and sophistication to the science-fiction side of the genre.   Though there's no relationship between the franchises, Galactic Civilizations picks up where Civilization leaves off, telling the story of what happens to humanity once they start reaching out to the stars. Beginning in the year 2225, the game sees the human race come into contact with several other space-faring races, all of which are competing for ownership of the planets and resources found beyond their own homeworlds.  It's the same story that was present in the previous Galactic Civilization games, but the sequel feels like it really delivers on the promise and potential of the original. Though the basic setup is still the same, the interface, campaign, and presentation have all been so greatly improved that it's hard to know just where to begin praising the game.   One of the bigger changes is that the sequel finally offers a full, scripted campaign. The humans find themselves fighting against the evil Drengin. In a series of inventive missions the humans will have to convince other races to join in the struggle while also fighting off the races that the Drengin have won to their side. I won't spoil the story here but the Drengin soon become small potatoes compared to the real menace that will soon be facing the galaxy. The acquisition of important new technologies and allies in a struggle that finds its way to the Earth itself makes for a hell of a fun experience and one that provides a bit more context than the regular sandbox campaigns from the original game.  One particularly interesting aspect of the story is that you can completely fail a mission and still move forward in the campaign. Sure, it'll take a while to recover, but Galactic Civilizations II doesn't force you to stop and restart once things stop going your way. I was a little annoyed, however, that each new mission saw you starting over from square one. Having to research the same techs again and rebuild the fleets that you had at the end of the last mission not only kills the continuity a bit but is also a real pain in the ass.      If the campaign doesn't seem like your style, you'll be happy to know that the cool, open-ended campaigns from the previous game are still here. There are tons of starting options here. You can set up a tiny galaxy that you can play through in an afternoon, or set up a massive system with dozens and dozens of stars that it'll take the better part of a week to conquer. Options for accelerated starts, planet frequency, different victory conditions and a wide variety of other factors are included.  Best of all, you don't have to play as the humans anymore! This was a sore spot for some of us with regard to the original game, but we finally get the chance to try our hand at leading some of the other races. Those who are of a mind to play a more militaristic or scientific game can pick an appropriate race this time around. And if none of the existing races appeals to you, you can completely design your own custom race, using a point system to buy from a long list of bonuses and abilities.    There are several levels of AI difficulty here but even the lowest setting will still provide a bit of a challenge. The strength of AI here doesn't rely on the inequalities found in most other strategy games. Rather than giving the AI players a boost in terms of resources or opportunity, Galactic Civilizations II actually offers opponents who think through their options. Presented with an inevitable defeat, AI players will even surrender their last remaining world to your biggest rival in exchange for their protection. Seeing an enemy find such an inventive alternative to complete extermination is quite surprising. Luckily, the game is full of these profound tactical maneuvers.  The way the victory conditions are set up gives the AI plenty of opportunity to exploit your weaknesses. Since strengthening your diplomatic, scientific or military position is likely to leave a few chinks in your armor, the AI is quick to pounce on them. Spend too much time focusing on technological research and the AI will actually adapt by taking a more militaristic stance. If it turns out that your technology trumps their military might, they may begin to incite the other races against you. The way the AI intelligently changes strategies within the course of a single game really makes Galactic Civilization II stand out from the crowd.   Fans of the original game will see lots of improvements in the interface. There's tons of information found at nearly every level of the game, from the small ship stats at the bottom of the main screen to the detailed planet summary view to the relations panel that shows your diplomatic status with the other races. Like Civilization IV, the numbers in this game are all very visible. There's definitely a lot of information to digest here but once you know where to look, it's easy to take it all in.  One of the coolest features in the game is the ship designer. I must have wasted hours and hours just tinkering with this aspect of the game, making everything from nimble scouts to hulking battle cruisers to bulging colony ships. There are plenty of pre-generated ships for boring players who aren't interested in tinkering with their own designs but the ship design tool here is so versatile and so convenient that there's really no excuse not to try it out.      The various hulls available are all equipped with different hardpoints that you can use to mount sensors, shields, weapons, engines, troop pods and pretty much everything else your ship needs. Space and cost restrictions help balance out the designs, of course, and I found it interesting that the more advanced weapons and engines tended to take up less space overall. It's a nice way to reward players who take the time to research the higher-level technologies. A seemingly endless variety of aesthetic attachments are available as well, so you can pimp your ships out with tons of fins, antennae, pods and the like.  The only real problems with the tool is that you can't really edit the roster of available designs so, if you're like me and make an entirely new ship every time you unlock a new component, your ship list will become confusing. There should also be a simpler way to twist and turn the components as you place them. Given the strength of the tool overall though, these are minor complaints.   While I like having so many different technologies available, the technology tree is one of the weaker aspects of the game. To begin with there's just not much of an explanation about the technologies. Civ IV's Civilopedia made the relationship and purpose of the technologies much more apparent and reasonable than is the case with Galactic Civilizations II. True, you'll get a bare bones explanation of each potential tech's benefit but you'll actually have to play through a few games before you start to really understand what those benefits mean in terms of practical application.  Also, the tech tree isn't made up of branches so much as a series of trunks. Laser I leads to Laser II leads to Laser III, and so on. It's not as if researching lasers is ever going to lead to anything other than better lasers. I'd love to see more obvious relationships between the technologies. Maybe a sensor technology allows for more accurate weapons; maybe better logistics allows for more efficient trade routes as well as bigger fleets. As it is, the technologies here seem almost completely isolated from each other.   There are definitely other areas of the game that could stand to be improved. Land and space combat is largely passive. I'll allow that the design of the ships and the three-weapon, three-defense system gives some tactical flavor to the space battles, but the ground battles are really one-dimensional. Researching better troops and deciding whether or not to bomb the hell out of a planet before landing are really the only options you have to improve your chances of winning a land battle. I'm not expecting Heroes of Might and Magic or Empire at War here but I'd still love to have seen a little more interactivity.   I have to admit that the lack of multiplayer is a bit of a strike against the game, particularly so in the wake of Civ IV's stellar multiplayer offerings. The gang at Stardock reason that the game can do without multiplayer for now, hinting that the architecture required to include it is in fact lurking somewhere within the game. The justification that the game is a full ten bucks cheaper because multiplayer wasn't included makes it a little easier to swallow. Still, I'll never allow that this whole Metaverse concept, whereby players compare their scores online, is a substitute. That's like claiming Pac-Man is multiplayer because it has a high score screen.      The tutorial, though a welcome addition, doesn't go far enough to actually educate players about the interface or the basic strategies of playing. The movies that serve as the game's tutorials could be much more effective if they took an interactive form and let the players actually go through the motions of designing ships, setting rally points, expanding influence, etc. Perhaps it would have worked better if the actual missions from the campaign had given players a bit more direction.  The game's visuals are a huge improvement over those of the previous version. Planets are present on the game map this time around, which allows opposing races to occupy the space around the same star system. The planets look amazing. They have their own continents and cloud cover (which match up perfectly with the appearance on the planet screen. Some planets even have moons and rings around them. All the planets orbit stars of varying colors and qualities. If you zoom in far enough you can even see the swirls and spots on the stars themselves.   The whole range of ship models add a lot of variety to the game. When you consider all the various parts that have to fit together on the ships, the artists are to be commended for making everything seem so consistent. The flanges, pods and missile packs all show up perfectly on the actual game map, so you can really see the results of all the hours you spent adding giant tail fins to your colony ships.  The sounds in Galactic Civilizations II are passable. On their own, they're not going to win any awards, but they're sufficient to support the action in the game. Beyond the ambient music and the ship sounds, there's really not much going on with the game's sonic palette. Bringing the music a little more to the front and adding some garbled alien voices would definitely have added a little more to the game's personality but it's not something you're really going to miss anyway. Just play some MP3s in the background and you won't even think twice about it.   As with so many games of this type, we just can't talk about all the treasures players will unearth as they dig into Galactic Civilizations. Suffice it to say that there's much more waiting below the surface, from the intriguing ramifications of different government types, to the galactic equivalent of the United Nations, to the exploitation of minor races, to the moral decisions you make when settling planets, to all the others we don't even have the time to mention. Each of these subjects contributes to the sophisticated nature of the game and opens up worlds of strategy for would-be conquerors.Firaxis really raised the bar for other 4x developers with last year's Civilization IV. Galactic Civilizations II actually manages to rise to the challenge. Some of the underlying concepts (technology in particular) aren't quite as intuitive as they ought to be but the game is full of personality and offers up hour after hour of strategic satisfaction. The AI in particular is one of the high points of the game, providing an experience that's as unpredictable and challenging as just about any we've seen in games of this type.I'm still aggravated that there's no multiplayer in the game, particularly since the potential seems so obvious. This talk of ~indirect competition~ via the Metaverse is ridiculous. Even so, the single player experience is so dense and so enjoyable, that we're likely to still be playing the game offline long after the developers finally add multiplayer to the game.", "date": "Mar 8, 2006"}