{"name": "Golden Nugget Casino DS", "name_review": "Golden Nugget Casino DS", "ref": "https://www.ign.com/articles/2006/03/09/golden-nugget-casino-ds", "text": "Golden Nugget Casino DS is the perfect example of a Nintendo DS game simply being adequate. If all you want is to satisfy a blackjack, roulette, slots, video poker, or craps itch, this will certainly work. But if you want to learn each of these games, or have a reason for building up a stockpile of money, this isn't going to fit the bill.   Each of the games within this collection offers the basics of gambling gameplay, using the Nintendo DS system's touch screen for most of the control. Putting down a bet is a simple matter of dragging the chips from your collection onto the table. That part's done well. But the programmers, for whatever reason, failed to make the game control with the touch screen exclusively.  Standard options, like backing out of a menu screen, have to be done with a corresponding button press instead of tapping the on-screen option. It's a little nuance that's a nuisance, but this is far from a game breaker.    No, there's really nothing ~broken~ about Golden Nugget Casino. It's just that the developer didn't exactly go above and beyond the call. All you're getting is the ability to play these casino games in a single player fashion. Throwing craps without anyone else's bets on the table isn't all that exciting, and the game's missing a key opportunity for multiple human players to sit at the blackjack table.  You can have other people to play with and off of, but they're controlled exclusively by the computer.   And, of course, there's the little issue of the game not being much of a training tool. You can use it to practice the game, but it's not going to teach you the rules of something as complex as craps. The game also lacks an incentive to play - the cartridge will save your money as you win or lose, but it never saves the high score, and since you can reset your bankroll to $2000 at any time, this game lacks the urgency to be frugal with your dough.   It has the bare minimum of what's expected out of a casino game and that's it. The addition of multiple slot and video poker machines beefs up the list of available games in the cart, but let's be realistic - most of the machines are the same design but with different artwork.  Adequate is really the best word to describe Golden Nugget Casino DS. It doesnt do anything really wrong in its design, other than being totally basic and unexciting. Its tough to emulate the rush of a casino win in a virtual version where money really isnt an object, but Golden Nugget Casino doesnt do anything to compensate for its lack of energy. This is simply a way to play multiple casino games on the go  its just not the best way of doing it.", "date": "Mar 9, 2006"}