{"name": "Ghosts 'N Goblins", "name_review": "Ghosts n Goblins", "ref": "https://www.ign.com/articles/2006/03/11/ghosts-n-goblins", "text": "Capcom's storied history is to be envied -- the game maker has so many fine franchises to choose from when searching out games to port to mobile, each with an immediate built-in fan base. Of course, this is a two-edged sword. As I pointed out in my review of Street Fighter II earlier this week, hardcore SF fans that see the game on the deck and download it without proper expectations might be disappointed. I seriously doubt this will be the case with Capcom's Ghosts n Goblins, an old-school platformer that makes sense on handsets.   Ghosts n Goblins has made many appearances in the past, from its arcade roots to the NES, and spawned several sequels (and heirs, like Maximo). Franchise fanatics cannot get enough of Arthur's quests to save his princess from the denizens of the dark, including demons and zombies. The game succeeded due to its spot-on platforming mechanics, excellent design, and serious difficulty. In the mobile area, two out of the three make the transition.   Although Ghosts n Goblin eschews some level space and monsters to squeeze the adventure on to the smallest screen, the game very much looks the part of a classic 8-bit side-scroller. Arthur's little sprite flings his lances at demons and other beasties across a series of colorful landscapes that evoke a sweet trip down memory lane. Capcom had to make a choice between the musical themes and the sound effects for mobile, and wisely went with the former. Capcom's tunes have their own fan sub-set, and the Ghosts n Goblins music is a big fave amongst those that still appreciate the talent that went into making those classic soundtracks. (Hey, Karl!)   The game is still surprisingly tough even without the sheer number of undead enemies storming the scene. However, some of this difficulty can indeed be credited to the controls, which are not bad by any stretch, but not nearly as responsive as, say, an old NES d-pad. But that's hardly the fault of Capcom -- they just played the cards they were dealt. Seriously, manufacturers it's time to update the control scheme on cellphones if you want to keep mobile gaming on course.   Ghosts n Goblins stretches across six areas, so even without some content, the game still packs some good value -- especially for fans.  Ghosts n Goblins has always been a personal fave series of mine -- which likely reveals something about my age. I have been enjoying Arthur's adventures since the NES, and will likely snap up his upcoming PSP remake. But, until then, this mobile edition is a good way to get a go-go fix of classic 8-bit action, along with Capcom's well-made Mage Man mobile episode.", "date": "Mar 11, 2006"}