{"name": "Ghost Recon Advanced Warfighter", "name_review": "Ghost Recon Advanced Warfighter Review", "ref": "https://www.ign.com/articles/2006/03/15/ghost-recon-advanced-warfighter-review", "text": "Ghost Recon Advanced Warfighter isn't an exact replica of the Xbox 360 version, as has been well advertised, and that's unfortunate. The Xbox version, which shares the same story, scripts, mission objectives, weapons, and characters, plays dissimilar to the PC and Xbox 360 versions for a reason. Ubisoft wants each version to look and play to each particular system's strengths. You could also say that getting the Xbox version to play, or even somewhat look, like the Xbox 360 version is a tough, if not impossible, task to achieve. As it stands, Ghost Recon Advanced Warfighter on Xbox is a disappointment on many fronts.    Visually, Ubisoft's military shooter has some boast-worthy assets. It offers a striking new color palette, slick new first-person visor, and streamlined level design. The game offers different geometry, assets, AI behavior, maps, and level designs, too, giving it a unique look and feel. The stark contrast between dark and light, sunshine and shadow is highlighted in the majority of fights, which take place in the rebellious future metropolis of Mexico City, Mexico. Ubisoft's design team has infused the landscape with baking hot sunlight and calls its visual element the ~colors or war.~    The colors of war affect the game's tone through contrast and saturation. When you and the other Alpha unit soldier are guardedly walking through the blazing streets of Mexico City, the sun is displayed with a strong, oversaturated effect. The sunshine is brighter due to the closer proximity to the equator, and the contrast between the lit areas the shadows is immense. This distinction between light and dark works into gameplay intelligently: Players are blinded in certain areas because of the sun's strength, and shadowed areas, in comparison, will grow darker. When you encounter an area of action or you encounter enemy fighters, the colors of war change. The scenario will darken a little bit and the colors will show a greater intensity, filling in the heavily bleached landscape and giving it fuller, richer colors. When the action settles down again, the colors will shift back to the heavily saturated look before the fight. Ubisoft feels that will affect the intensity of each fight and produce a visual effect that will swing your emotions and provide unique focus. The idea works both in theory and in practice, and we like it.   Too bad the game has a next-gen brother that looks so much better than it. And too bad the rest of the visual elements aren't worthwhile. There are textual resolution problems and more anti-aliasing than a last-gen game of this game of this nature should have. Comparing the two isn't fair, but even without comparison, overall, the Xbox version looks less like a final hurrah! And more like a strained, somewhat unfinished game.   The sound follows the graphics in suit. While there is decent voice acting and typical music for this type of game and the quick rattle of bullets streaming out of your guns is satisfying, there are issues. The mixing is rough, filled with artifacts, and regularly there are issues with mission and voice synching. You can easily run past an event and listen to the dialog well after the event has happened. Not clean, not precise.   From a gameplay standpoint, the Xbox version, in a way, returns the series to it roots, at least a little. Unlike the popular Ghost Recon 2 and Summit Strike, both of which offered first- and third-person perspectives, Advanced Warfighter can only be played using a first-person perspective. Additionally, the game strips your team down to one other team mate, and the prone position is replaced with the ability to sprint.   Since the game is played strictly from a first-person viewpoint, the visor plays a major part of the new game's ~advanced warfighter~ concept. In the upper left hand corner of your screen, you'll see the newfangled cross-com. The cross-com is a video monitor enabling you to see from other ghosts' viewpoints. By switching to it, you'll see what they see. So, for example, when they peak around a corner, you'll see what they're scouting. Or perhaps while using the new spy drone unit -- a self-propelled drone with a wireless camera to give you visual access to enemy hideouts, kidnapped allies, or danger zones, you can see from larger aerial views to help you strategize your next move. In either case, the cross-com gives you greater access to the larger war around you in Mexico City. The cross-com works well enough in GRAW on Xbox, even if the game itself isn't as fun as it could have been, partly due to the lack of teammates and the less frequent use of the cross-com as a result. Unfortunately, the actual footage that comes in is ridiculously choppy and annoying to watch. The visor, on the other hand, is even less utilitarian. While it's not all that new -- the concept was first established in Metroid Prime on GameCube -- it works decently in GRAW. But for instance, the curve of the lens makes hazy enemies in your periphery and shrinks the screen just more than I'd like.   The other gadgets and meters function properly enough. On the lower left hand corner, the health bar and heart beat indicate your personal health level, while on the lower right hand corner of the screen, you'll see the currently selected weapon and ammo count. The upper right-hand corner highlights the new NarCon system. This little box shows off a chunk of territory around you, a basic map, but can switch screens to show off your commander calling in from his comfy well-adorned office.   The weapon list is lovely, for those who pay special attention to guns and the military. The Xbox version features at least two exclusive guns, the M109, a 44 mm anti-tank grenade launcher, and the Zeus anti-tank missile launcher. Visually, the Zeus, is super sweet. The missile plops out with a clunky drop and then the burners kick in, creating a nice arch in the sky. There are other nifty ones, too: the CRY rifle (a caseless assault weapon enabling more bullets per magazine), a svelte sniper rifle (with 8X and 16X zoom angles), the SCAR, M6, M4, M16 and OSCW. Gamers can still pick primary and secondary weapons, use frag and smoke grenades, and command their alpha unit teammate using the D-pad. Also, your lone teammate can be commanded to use a fixed gun, regroup, attack on go (sort of like Rainbow Six's Zulu command), and ~peak~ around corners.     With all the special gadgets, visors, and a huge selection of modern guns from which to choose, GRAW's actual gameplay isn't as tactical or as smart as it is on paper. For starters, your physical speed is surprisingly fast. For a sneaky ghost, this is odd because the extra speed turns supposedly tactical encounters into run-and-gun bouts. Peeking around corners is also weird; it's more of a head tilt than an actual lean, so it's less useful than expected. As mentioned before, one can't lay prone, and unfortunately, one can't hop short walls or climb over simple obstacles. Even the best parts of Ghost games, the sniper shots, feel wrong. You'll find the drift is extreme while using the scope, and since you can't lie down flat, kneeling while doing this feels even more awkward. At least southpaws will be happy to learn the controls are built with lefties in mind. There is a standard control model that can be reversed and modified. And the inclusion of Legacy controls, which enables moving and looking on a single stick, also will make many a gamer happy.    On Xbox, you'll only control one AI ghost. That's right, one single trooper. Ubisoft's thinking was that it could channel tons of new changes and better, smarter tactical fighting techniques into one single fighter instead of compromising and giving a moderate amount to two or three AI units. Sounds like a good pitch. And while it does simply the game, it also drags down the gameplay. Just like the quick movement and awkward controls, the lack of a team makes this feel more like a generic military shooter and less like a Ghost Recon game. You will be able to call in special support, though most situations calling for helicopter, tank, RPG and tactical teams, are contextually based. Additionally, the Xbox version is based on the Unreal Engine 2, so the heavily modified software enables players to watch and laugh as ragdoll physics make enemy deaths look darkly funny.    At least the multiplayer is moderately fun. Gamers can play with up to four total players on split-screen or up to 12 people on Xbox Live or System Link. Most gamers will be happy to know there is an online cooperative mode for up to two players enabling a pair of gamers to tackle the campaign missions. In MP, gamers will find standard game types (assassination, last man standing, team sharpshooter, etc.) with average map layouts and relatively respectable load times and lobbies. You can create online teams, check leaderboards, and use friends list like most online games. There isn't likely to be too much activity, however, considering most people will be playing the Xbox 360 version! And just like the offline play, the tactical aspect of the game is really lacking. GRAW on Xbox will almost assuredly whittle down to run-and-gun shooting matches, drawing all the fun out of it. GRAW on Xbox feels like an incomplete Xbox 360 version. In other words, it feels a little like a bastard child. The graphics are OK in some respects, like the HDR lighting and high contrast Mexican landscape, and even the visor feels kinda cool at least at first. But technical issues such as low resolutions, tons of aliasing, and an overall lack of polish, hurt it. The audio track is essentially the same as it is on Xbox 360, which is a good thing, and the sound separation is generally well done. But the game itself, the actual shooting, the missions, and the tactics, they've all been messed up. With somewhat quick movement, some awkward controls, and gameplay that lends itself to run-and-gun bluntness instead of precision ghost strikes, you'll really wish you had waited for the Xbox 360 version or skipped this one altogether. Summit Strike and Ghost Recon 2 before it are all around better games.", "date": "Mar 15, 2006"}