{"name": "Neopets: Petpet Adventures -- The Wand of Wishing", "name_review": "Neopets: Petpet Adventures", "ref": "https://www.ign.com/articles/2006/03/25/neopets-petpet-adventures", "text": "Neopets: Petpet Adventures defies any expectations for a franchise title and manages to create an action-RPG that largely holds its own. There are still problems that prevent it from becoming a great game, but there is so much potential here that we hope the folks at SCE Studios Santa Monica make a sequel.   While it's probably true that being a Neopets fan will make this game even better, it really doesn't even matter. Fans looking for a light version of Champions of Norrath for the road will find a lot to like here.   The storyline here is pretty ridiculous and, if you don't take it seriously, can be often hilarious. There are four insanely cute Petpets to choose from, each with slightly different attributes. Don't worry about them too much, though. Just pick the cutest one and go since the differences aren't all that effective. Once that's done, you begin the quest to go and retrieve the Wand of wishing from the alternate universe of Petaria where the Petpets can stand on two feet and become a mighty warrior. A very, very cute and mighty warrior, that is.  Once the game begins the general action is very similar to the Norrath games on the PS2. The view is top-down and the Petpets can use melee weapons, bows and arrows, cast spells, block, and munch on some food to get health back. They also have five different attributes that can be developed to make them stronger and faster. The main story is very linear with some side quests along the way that can help to earn money or get new items.   What works here is that there are many different worlds in the quest, each with its own distinct style and feel. Again, the feeling is that of a Norrath game as there is the fire level, the water level, the desert level, the ice level, and even the level that takes place in the clouds. Each level has its own monsters and playing through the game has a solid feeling of being a big adventure even if the storyline is a little goofy and kind of weak. But there is that silly smile on the Petpets' faces that makes up for it.  Adding to the adventure feeling is the surprising level of detail for the items and magic that can be found here. Petpets can have unique items, but even more importantly there is the idea of there being six elements that a Petpet can align itself with: air, dark, earth, fire, light, and water. By focusing on one element, different spells then become available. The elemental alignments can also provide protection against an elemental attack. If a boss' attacks are all dark powers, then a dark defense will soften them up a bit.      Throw those details onto a hack 'n' slash type of action that focuses on encounters with just a few enemies at a time and this is a great diversion. When Petpet Adventures is moving along at the right pace it's easy to be surprised that this is a Neopets game. Not all of the monsters are pushovers and getting through some areas definitely requires some careful tactics if not completely avoiding some monsters. Toss in some side quests and you have a whole game here.  Well, almost.  As good as Petpet Adventures can be it can be so much more frustrating when it falters. The main problem is that the game isn't very balanced. Fighting through the missions is a challenge in the beginning when swapping between melee and magical or ranged attacks, but it gets much, much easier when you pick up a powerful enough bow or crossbow. Once this is acquired the rest of the game is a breeze. The last few missions are by far the most visually interesting ones out there, but when everything can be killed even when it's barely on the screen there's not much of a challenge and you can fly right through them.   The other problems are with the stat building and the elemental alliances. Instead of gaining experience to advance a level, the Petpets get more gold that they can use to enter fights in the Battledome. Tokens are earned by winning a fight and these can be used to increase an attribute. This means fighting the exact same fight over and over again to get more tokens.   It's not very challenging, it's not very fun, and it takes far too long to justify being in the game. Playing through the game, I eventually gave up leveling my characters because my bow was very strong and I couldn't stand going back to the Battledome. This wasn't a problem even though my skills were at level 15 out of a maximum of 25 since I had my trusty Bow of the Gods (not its real name).  As for those elemental alliances and the magic, they're more trouble than they're worth. They're also completely optional. Again, having a killer bow renders everything else obsolete once it's acquired. The Petpets can themselves get a pet that will change their stats. It's yet another interesting idea, but again it's largely wasted since the effect is not as big of a difference as it needed to be to justify worrying about it. Petpet Adventures has so many good ideas in it that it's a shame that it doesn't come together as a whole. The many different details that affect the Petpets are very interesting and in a bigger adventure they could have had a bigger impact. Many of the pieces are in place, they just need a home. But problems aside, the lush levels and the general action keep the game moving along at a good pace for the 10 hours or so it takes to complete.", "date": "Mar 25, 2006"}