{"name": "The Elder Scrolls IV: Oblivion", "name_review": "The Elder Scrolls IV: Oblivion Review", "ref": "https://www.ign.com/articles/2006/03/25/the-elder-scrolls-iv-oblivion-review-2", "text": "How much free time do you have? It's a legitimate question if you're considering Bethesda's epic The Elder Scrolls IV: Oblivion, as it's likely to engulf whatever tidbits of unoccupied hours permeate your life. It might even start chipping away your daily responsibilities. With over 200 hours of gameplay, Oblivion's depth is nothing short of staggering. However, depth means nothing if it's paired with crippling bugs or frustrating gameplay. Though Oblivion has a few issues, it thankfully avoids any major blunders, making this the best single-player role-playing experience to come along in years.   To briefly sum up, Oblivion has no multiplayer. It's an entirely offline role-playing game, meaning you'll complete quests, level up and progress through a rich storyline. As you grow more powerful you'll acquire better weapons, armor and spells to kill monsters and, if it's your preference, innocents. Oblivion's four guilds, Mages, Fighters, Thieves, and Dark Brotherhood, all have their own unique questlines and provide opportunity for added perks. Designed to be an open-ended experience, Oblivion's biggest draw is its massive world. Set in Cyrodiil, a province of the larger land of Tamriel, practically everything is accessible right from the start. You can head in any direction you like, playing to beat the story, to complete side quests, or wander around fields, mountains and streams exploring at your own pace.    Though the main quest is usually a game's primary draw, that isn't the case here. The game starts out with the world in danger and you're destined to save it. Pretty standard stuff. The largest threats to Cyrodiil are the Oblivion Gates opening up across the land. Flanked by ominous stone columns, these flaming portals are doorways to hellish dungeon settings where better armor and weapons can be found. Which ones you enter is totally up to you, though some are required by quests. While the story missions are great, there's a ton of excellent content you'll be missing if you stick strictly to the main plot. The guilds, for instance, all have epic storylines of their own. There's a gladiatorial Arena in the Imperial City where you can engage in mortal combat with one, two or even three enemies at a time for cash rewards. It's a wonderfully open-ended game, yet also surprisingly focused once you decide what you want to do.   Anyone who played through the previous The Elder Scrolls game, Morrowind, will remember the almost total lack of direction, a feature which turned many off. While in that game that main quest didn't even begin until around 15 hours after starting, Oblivion kicks off with a major plot development and thrusts you immediately into the main adventure. Once given your initial task to restore order to Cyrodiil and shut down the demonic invasion from Oblivion, you'll never have trouble figuring out what to do next.    This is mostly due to the intuitive map and easy to use quest log. Whenever you accept a task to perform or are assigned a duty, an entry is made in your journal. By clicking on the quest you can see a brief description and set it to ~active.~ Any active quest in your log is highlighted on your map screen with an arrow. Red arrows mean you need to pass through a door, green ones mean you're in the right place, and the arrow also pops up on the compass at the bottom of your screen for extra convenience. Unless you're a total masochist, it's a much welcome improvement, making quest objectives and locations much easier to find.   On top of that, you're given the ability to fast travel around Cyrodiil. Every location in the game pops up as an icon on your map. To be eligible for fast traveling, you need to first visit the location on foot, although the major cities are accessible right from the start. After a location has been made fast travel accessible, you can pop open your map, select it, and arrive there instantaneously. Though time still passes when you travel, you don't have to actually spend it hoofing the journey out. If you'd rather walk, that option is always available, but fast traveling effectively eliminates the tedium of fetch quests so prevalent in the RPG genre. On top of that, it's great for when you want to buy specific spells or armor only available in certain cities. With the improvements to the map, journal and travel system, the world of Tamriel just got a lot more user friendly.     These improvements make Oblivion a great title for anyone still wary about RPGs. Though the depth and gameplay options may be daunting, there's always plenty of information available to tell you how to go about getting things done. Of course, the goal of any game is to make your character an utterly unstoppable force, capable of destroying friend and foe alike with the mere twitch of an eyelash. To become an unconquerable world dominator in Oblivion, there's a mind boggling array of options.   Before doing anything, you need to create your character. Bethesda has implemented a great creation feature, allowing you to meticulously customize your character's appearance and class. Whether you play as a reptilian Argonian, stout Orc or sneaky Wood Elf, you'll be able to adjust skin tone, facial structure, hair styles, eye color and many other options. When moving through the initial sewer area, you'll also choose a class, which can be completely customized should you wish to do so. We could list all the options available, or we could tell you that it's entirely possible to create a thief-mage High Elf with albino skin and bruised eyes, a penchant for haggling with item vendors and nasty accuracy with a bow. What this all means is Oblivion lets you create as fine-tuned and personalized a character as you could possibly want.    Despite the range of options, some of the skills and attributes are useless given the effectiveness of others. For instance, Luck is a terrible attribute to choose for one of your two primaries, since it doesn't directly affect anything. A few of the skills, such as acrobatics and athletics, are useless as well as one of your seven main. The way your character levels up is through use of skills, not experience. The more Destruction spells you cast, the more monsters you conjure, the more you heal yourself, the higher those skills rise. Once your skills bump up enough, you level up and can increase attributes. Since you're going to be running and jumping (athletics and acrobatics) constantly, there's no need to build those into your main attributes.   If you do pick a few useless skills, you're going to know it a few levels down the road and likely want to change them. Once you're outside the first dungeon, however, you can't change your character. So read all the information provided by the game and choose whatever you feel best. Yes, it's going to require thinking. If that prospect turns you off, then this game probably isn't for you. Better yet, make a game save right before leaving the initial dungeon you can reload should you be unsatisfied with your character choice. In fact, save about every five minutes. Since you'll never be sure how powerful an enemy is going to be, the chance of a brutal death is always high when trekking across Cyrodiil. Having a recent save is a requirement, otherwise you could find yourself losing hours and hours of progress. Though the game will auto-save, it's a better idea to have a hard save available, since the auto-save always overwrites itself.    Once outside the initial dungeon, you'll start to understand just how massive Oblivion's world really is. Opportunities for new quests and stories are everywhere, and there's no pressure as to which path you should follow. Thanks to the map, journal and fast travel system, it's way easier to follow a path once you pick one. Throughout each of Cyrodiil's towns you'll find nearly everyone has something they need done, and each task has a story behind it. Though many quests turn out to be standard dungeon crawls, there's usually a twist or turn along the way. For instance, buying a house at a discounted price in Anvil seems like a great deal. That is, until you actually sleep there and get attacked by ghosts. Upon investigation, you discover there's the corpse of a long-dead Necromancer haunting the crap out of your basement, and he's still pissed off. This kind of attention to detail is present in many of the game's bevy of quests.     Interacting with people around Cyrodiil is surprisingly realistic, and Bethesda's much-hyped Radiant A.I. system works well. NPCs engage in random conversation from which you can glean quests should you eavesdrop at an opportune time. We witnessed one branch of the fighter's guild sit down to eat dinner in unison. NPCs will take naps, engage in everyday activities, and occupy themselves with swordplay or spellcasting for fun. Some of the random conversations still sound stilted and unnatural, starting off with lines like, ~Hey, so how about that local Mages Guild.~ It's basically water cooler talk, but it's interesting nonetheless. Sometimes, you'll overhear more intriguing topics, like one NPC hitting on another.   Actually engaging NPCs in conversation is absolutely impressive, as each character in the game has spoken dialogue. Considering the titanic amount of NPCs in the game, that's a lot of spoken dialogue. Though in many cases they're just canned responses using a repeated voice (every Argonian female sounds pretty much the same), there are always some unique samples for every quest. Whether the NPC is pouring their heart out to you because they need help or detailing an intricate history of a specific item, it's all voiced, though not free of occasional excessive cheesiness.    There's also an engaging persuasion system in place in case an NPC won't give you the information you're looking for. Like the rest of Oblivion, there are multiple ways to get them to see your side of things. Depending on the kind of character you're playing, you can use speech skills to charm them, use a charm spell or just toss some money their way. Rewards from doing so include getting information necessary for quests, and gaining an NPC's trust so you can buy a house, among other things. So, the system isn't there for the sake of its own existence, it serves a function which at times can be very beneficial.   Once out in Cyrodiil's wilderness, these persuasion skills become much less relevant. You'll instead need to rely heavily on your combat skills. One criticism of The Elder Scrolls since its beginnings has been awkward combat, and that remains true here. Oblivion's fighting mechanics are much improved and interactive over previous versions, but still not perfect. You're able to block and swing with separate buttons and have another for casting spells. Blocking can knock enemies off balance for free swings, but also do the same to you, so the fighting is no longer a mindless procedure of hitting attack ad nauseum; you'll actually need to pay attention and properly time your swings, blocks and casts. In one-on-one situations, these controls function well but run into problems in confined areas or in group battles.    A good strategy in Oblivion is to lure all opponents to an open area, allowing you to move around. While you don't need pinpoint accuracy to attack effectively, you do need to be facing the general direction of your opponent. In tight quarters, the dizzying effects from getting smashed by swords and maces make proper aim overly difficult. While in open spaces you could recover by backing up, you're pretty much stuck in many of the smaller cave tunnels. This problem intensifies when in group battles, especially with friendly NPCs. Since getting struck occasionally makes you wobble, you'll have a difficult time discerning who you're slashing at in a group melee. Given the fact that friendly NPCs will actually start attacking you should they take enough damage from your weapon, it's important that you're targeting the right person.   During the confusion of battle, you'll need all your important spells and weapons readily available. Enter Oblivion's hotkey system, which allows up to eight items from your inventory to be accessed without returning to your menu screen. It's a wonder the system was limited to only eight, given the depth of the rest of the game. There are literally hundred of icons to choose from, be it items, weapons, spells and armor. Trying to limit that to eight is a little extreme, especially considering the range of situations you can find yourself in. Why not implement a system where you can switch between multiple hot key sets? That way, you've got a hotkey set for magic, one for combat, one for fighting undead, one for marksman, etc. As it stands, you'll have to constantly switch appropriate icons in and out of hotkey assignments, which is more of a hassle than it should be.     For PC users, the hotkeys are conveniently mapped on your keyboard, but Xbox 360 owners will be faced with a more annoying control setup. The D-Pad's vertical and horizontal directions work fine, but the icons you assign to the diagonals will prove difficult to select with any sort of regularity. You'll often find yourself mistakenly switching to a healing spell when you meant to pull out a shield and sword, or siphoning health when you meant to summon a Frost Atronarch. Combine this with the imprecision during battles with multiple foes or in close quarters, and you'll find combat in Oblivion requires a little more patience that you might have expected.   Despite those issues, the rest of The Elder Scrolls IV controls very well. Basically it just comes down to whether you prefer a mouse or a thumbstick. Though the game offers a third-person mode, don't bother using it save for checking out your armor. It's nearly impossible to fight with the camera pulled back, and some of the third-person animations look unrealistically silly (sideways moonwalk, anyone?). All in all, Oblivion functions better than it did in Morrowind, but there's still room to improve.    Though you'll spend a lot of time fighting in Oblivion, you'll also spend a good deal of it just wandering around. Mostly, this will be an unconscious result of Oblivion looking absolutely fantastic. Environments sprawl for great distances in front of you, trees and grass sway to and fro, and the lighting and level of detail in the sky can be breathtaking at times. The environments look so good, it's nearly impossible to resist the urge to plunge into the unknown. Weapon and armor models are intricately detailed, towns have their own unique architectural flair, and though some of the dungeon designs may get repetitive, they're always pretty to observe.   Character and enemy models are highly detailed, though some of the NPCs have odd facial features and questionable speech syncing. Creature animations are generally very good, and the physics system embedded in each model can produce some impressive results at times. For instance, a conjured Daedroth can effortlessly smash an enemy several feet through the air on a killing blow. Downed wolves roll down hills, and enemies can be blasted right out of midair with a well-placed magic blast.    Unfortunately, the graphics aren't without their faults. Though you can see extremely far into the distance, far off hills will be blanketed in low-resolution textures that otherwise mar a beautiful scene. Loading times may also be a bother. Not the loading times when entering doors or fast traveling around the world, those are entirely manageable. It's the loading that occurs when traveling across the land that will cause the Xbox 360 version to stutter, as well as any mid to lower end PC. The game needs to load in grass and environmental objects at regular intervals, and the ensuing pause in the action may turn some off. There's also a very visible amount of pop-in, as grass, rocks and even houses appear at the edges of your vision.     This loading setup was obviously implemented to keep framerates manageable. For the most part, it's excusable considering the stunning graphical heights Oblivion is able to reach in other places. Still, the loading stutter and the framerate may bother you as well. While the game runs at a steady clip in dungeons and indoors, you'll notice a performance hit when traveling quickly through outdoor areas and in crowded towns. These framerate drops don't so much affect the gameplay, but remain an annoyance as it takes you out of the experience. On high-end PCs these framerate and loading issues are diminished, but most PC and all Xbox 360 gamers will have to put up with them to enjoy the otherwise visual delight that is The Elder Scrolls IV.   While wandering and wondering at Oblivion's visual prowess, your ears will be equally entertained. As previously stated, the game is packed with an amazing amount of spoken dialogue, for the most part well acted. The musical score is excellent and fitting for the game's medieval fantasy setting. Depending on the environment, you'll get cheery daytime adventure type of compositions, tense battle music, and ambient, unsettling string arrangements for dungeons and ruins. Sound effects are equally impressive, with crisp metal clangs for clashes in battle and eerie, otherworldly audio for magical happenings. Wraiths and ghosts boast unearthly wails and residents of the Oblivion plane bellow in deep, hell-tinted cadences.    With a game this gigantic, you're going to have to expect some bugs. Morrowind had quite a few, some relatively serious, specifically with the Xbox version's ~fall through the world~ bug. Thankfully, Oblivion has so far proven to be a more stable product. That being said, if you play this game, you'll likely encounter crashes. Bugs include the PC version crashing to desktop and freezes during loading screens on the Xbox 360. When we first popped in our Oblivion disc it has absolutely painful loading times, but they went away the second time we fired the game up and haven't returned since. Other bugs include monsters and NPCs disappearing, clipping through walls, and strange sound glitches. Do the bugs make the game unplayable? Absolutely not. Sure, they're annoying, but they don't break the game. The sheer amount of content and breadth of gameplay options that went into this title outweighs any minor gripes that can be made about errors that crop up here and there.I've done enough blabbering and hairsplitting. Is the Elder Scrolls IV worth a purchase? Definitely. Currently, it's as good as gaming gets on the Xbox 360. If you're an RPG fan, it's an incredible experience. If you regularly beat RPG fans with hockey sticks, you should still try this one out. It's got combat issues, the hotkey system could have been implemented better and some may be ticked off by the environmental loading stutters. However, none of those criticisms hold back Oblivion from being a thoroughly enjoyable, user-friendly, gorgeous experience with enough content to keep you returning time and time again.", "date": "Mar 25, 2006"}