{"name": "RF Online", "name_review": "RF Online", "ref": "https://www.ign.com/articles/2006/03/29/rf-online", "text": "Gaming might very well be the best form of entertainment to cross over culture barriers without losing too much in the process.  Unfortunately for us, MMORPGs exemplify what each culture loves and hates in its games.  Whereas titles like World of Warcraft weave a detailed storyline with the actions of your own character, Rising Force Online is an exercise in power leveling and repetition.   Although RF Online is no less in-depth than most of the titles already on the market, it seems like an MMO designed for those who enjoy spending long hours in a cyber-caf (which don't really exist in the United States).  Although leveling up and non-stop questing for ~loot~ is the norm, the sheer monotony in RF is ridiculous.  As such, it is not the best-suited title out there for an American audience (or for anyone who must work 10 to 12 hours a day).  Whereas titles like Star Wars: Galaxies and Guild Wars encourage you to choose a profession and join a guild for social interaction, RF Online is practically the antithesis.  Much of your time will be spent solo questing or mining for ore without speaking to anyone.  In this respect, Rising Force can be a very personal and almost anti-social experience.  Hardly the sort of thing you would expect from an MMORPG.    To compound matters, RF has a barebones back-story with no epic heroes or character development (even in terms of customizing your character with relics or unique abilities).  With the exception of its sci-fi theme, RF brings nothing new to the genre (and even then you could argue that Anarchy Online did it first).  What's more, it comes at a time when the U.S. market is already saturated with quality MMOs like WoW and the upcoming expansion.  Due to the sheer amount of level grinding, RF will leave the casual gamer out in the cold.  Only those who are getting bored of their current MMO will be interested in this title.  Even then, the question must be asked - is the $50 price tag and the $15 monthly subscription fee worth it?  In a nutshell - no.   The time commitment required to play excludes RF from a general audience.  Unless you are of the sort who live and breathe MMOs, RF is not for you.  Even if you are a die-hard MMORPGer, chances are your time will be better spent divvying it up between games already out there.  At its very core, there just isn't enough here to satiate even the most fanatical gamer.  Why?  For one, the first 29 levels are little more than ~grinding~ your way thru monotonous quests and mining for ore.  Don't expect to jump into the PvP battles anytime soon.  No matter which race you choose, the quests, loot, and character dialogue are all the same.  It isn't until you reach the vaunted Level 30 that you get into the core gaming experience - PvP combatand that by itself is not enough to warrant the asking price.   The box art touts ~First 30 Days Free~ but in my estimation, this is little more than a ploy to get you to drop 50 big ones up front.  Once you get into the game, you will be welcomed by an abysmal tutorial which does little to flesh out the paper-thin back-story covered in the User's Manual.  As you get the feel of the game, which should take you 30 to 45 minutes, you will find that your options are rather limited.  With no PvP combat until Level 30, you will be forced to quest PvE style.  Many have stated that the leveling-up experience is quick and painless (in comparison to other MMOs) but the fact remains that, unless you spend large amounts of time in that 30 day ~free~ window, you will not reach a high enough level to get into the good stuff.  The ~First 30 Days Free~ is little more than a ploy to get you to buy the game, only to find that you must pay the monthly subscription fee ($15) after the fact.   To break the gaming experience down succinctly, Levels 1 - 29 are straight-up PvE combat, solo quests for XP, and mining for ore in Crag Mine (which is protected by the game's only epic creature, the Halostone Keeper).  At Level 25, you can enter PvP combat, but expect to die easily and often, as you don't have access to your faction's super weapons and abilities.  Level 30 is where the game truly begins (and why gamers who like this game will defend it so vehemently).  At this point you gain access to the special abilities of your race.  The Accretian Empire gets large deployable mortar cannons, the Cora Holy Alliance gets to summon magical spirit creatures, and the Bellato Union gets to utilize cool giant mechs.  Take a wild guess which race everybody wants to be.  From this point on, you do battle with the opposing factions roughly every eight hours in PvP combat for possession of the Crag Mine.  That's all there is to it.  There's a lot of ore processing, trade, and tax changes (based on whichever side has control of the mine) but what you see is what you get.  Don't expect much derivation from this pattern, as you won't get any.    Unlike titles like WoW or Star Wars: Galaxies, there isn't a wealth of back-story or intrigue to set up the game itself.  The User's Manual and in-game tutorial do little to help.  Rather, you are given a scant description of the game world and little else.  Taking place on the planet Novus, you start off on a hotly-contested piece of real estate.  Three sides look to take this planet because of its resources and strategic value.  Not a bad start, but the main problem here is that nobody truly wins control.  Roughly every eight hours, all three sides battle for control of the Crag Mine.  Whereas other MMOs take place over multiple planets, RF Online only does so on one.  Even if one side does gain possession, the other races can still enter and mine ore.  After eight hours, another PvP battle between the factions takes place for controlrepetition at its finest.  If you're looking for a compelling story-driving MMORPG, look somewhere else.  RF Online has none to give, as it is merely PvP combat which rehashes itself every few hours.    The PvE quests are uninspired and tedious at best.  Most of the time, quests are nothing more than collecting items for a scientist or killing a certain number of monsters.  Don't expect to explore magnificent dungeons with epic beasts and powerful relics, none exist.  The quests would have been the perfect time to flesh out the back-story and spice things up, but here the game fails.  The result is sheer grinding just to level up.  After a few short quests, the game feels less like a diversion and more like tedious work.  Although this might be acceptable for a Korean audience, it isn't really appropriate overseas.   Another downer can be seen in the bland, generic quests.  No matter which race you choose, the quests are always the same (e.g. collect plants, kill monsters, etc.).  This means that replayability at levels below 30 is practically zero.  It isn't until you reach 30 that the differences between the three factions becomes apparent, and by then you've already sunk a massive amount of time into a single character.  If you want to get the ~goodies~ of another faction, you will have to go thru the PvE tedium until 30 all over again.   Combat against the monsters is also very slow going.  With a point-and-click interface, it feels like a card battle game.  What's worse is that because of this turn-based style, you have time between each monster attack to ~tank up~ on health potions.  Opting for potions to regenerate health is the only choice as there is no cleric class (or anything resembling one).  By doing so, you can chug potions (ala Diablo) while your opponent gears up for another attack.  Not only does this negate any sense of danger which you might feel from facing a bigger baddy, this allows you to take on far STRONGER opponents than is normally feasible in an MMO.  Whereas games like WoW only allow you to fight high-level monsters if you are in a league comparable to their own, RF Online has no such limitation.  The consequence is that you can take on virtually any monster in the game without too much fear of death.   While others might feel that the game is worth the level grinding to reach PvP status, I feel there just isn't enough here to warrant the purchase.  Whereas titles like Guild Wars have large areas devoted to PvP, RF Online only has ONE.  You read that correctly - just one PvP battleground.  As previously mentioned, the conflict between the three factions erupts around control of the Crag Mine.  Each side attempts to destroy the transport nodes of the two rival factions, so the combat takes place around the mine itself.  And that's all there is to it.  Although you can attack members of rival factions elsewhere, say when you are off on a solo quest, the fact remains that you are still fighting on Planet Novus and there will be no variation in terms of terrain or combat conditions.  Once you hit Level 30, most of your time will be spent battling the opposing factions for control of Crag.  This means that roughly every eight hours, you will do combat with the same opponents in exactly the same setting over and over again.  For some, this might be acceptable.  For the rest, combat will become repetitive and tedious very quickly.  All the hard work to reach Level 30 are quickly negated.   Another problem of note is the lack of mounts, or any sort of transportation which could ferry players from place to place.  Considering that this game is sci-fi in nature, at the very least there should be some sort of transportation tech.  If walking distances were short, this wouldn't be a problem.  Alas, they are not.  To compound matters, much of the world detail and environment is bland and undetailed.  After ten minutes of walking thru such drab surroundings, I found myself wanting to load up WoW instead.  You can sprint, but once your stamina runs down, you are forced to walk at a VERY slow pace.  In the game's defense, at least you don't have to walk back to pick up your loot after dying (you respawn back at one of your faction's bases with full health and inventory).    Although you can quest with fellow players, you will find most of your time spent solo questing.  Why?  You will find that you will gain XP at a much slower rate when working with a group.  This almost sounds like a penalty, rather than an encouragement to forge relationships with fellow members of your faction.  What the game does reinforce is questing on one's own in order to level up as quickly as possible.  The game, without intending to, encourages isolation rather than banding together with those of your race.  And yet, once you reach Level 30, you are expected to be a team player and defend the Crag Mine every eight hours.  To further deter questing with others, there is no ability to do so with members of the other races.  This is in keeping with the warring nature of the three factions, but doesn't lend itself to creativity, strategy, or fun.  Whereas the cool factor of PvP will gradually wear off, the questing could have become the element to keep players coming backbut only if you had access to the abilities and job specializations of all three factions.  Unfortunately, RF Online does not do so.  If you opt to quest with others, you will do so only with members of your own faction, and thus be limited to that particular race's qualities.    As it stands, the game still has a number of issues which further drag it down.  The largest of these is the inability to remap the keyboard commands and shortcuts.  Considering how complex MMOs are, it is a must that players learn the shortcuts in the shortest amount of time possible.  This is usually accomplished by remapping the commands to their own liking.  Without this option, gamers may feel a bit frustrated with the control scheme given to them.  Another shortcoming of the game is the limited number of character models per race.  Even with the ability to change your hair style, face and ear type, the top half of your clothes, and the bottom half, chances are you will encounter a number of players who look EXACTLY the same as youall the way down to weapons and items.  This leads me to another point - the game is very limited in terms of weapon forging, upgrades, and the ability to quest for epic items.  With these limitations, players cannot expect to have the same level of immersiveness they might find in a title like WoW or EQ.  RF Online is a repetitive title which enters an already saturated MMO marketplace.  Without a compelling, evolving storyline, players are left level grinding until they reach Level 30.  PvP is limited to only one battleground, and must be fought for every eight hours.  As it stands, this title will appeal only to those who are bored of the other MMOs already out.  Unfortunately, it doesnt bring anything new to the genre.  Whats worse, it is actually a step back with the potion chugging and lack of strategy involved in PvE combat.  You will spend much of your time leveling up on solo quests, collecting ore in Crag Mine, and taking it to NPCs to have it refined.  For a massively multiplayer game, you spend far too much time on your own.  If its a single player experience you want, play an RPG.  An MMO should have a strong social dynamic to it.   Alas, RF does not.  Dont expect to make lasting friendships like you would in other games.  Most of your time speaking to your fellows will be in the midst of combat for Crag Mine, hardly the best circumstance to do so.  Only the most hardcore will find this game to be a welcome addition.  For the casual gamer, and those happy with their current MMO, RF will leave them out in the cold.  From the standpoint of a quality gaming experience, money, and time, this title cannot be recommended to any but the most hardcore.", "date": "Mar 29, 2006"}