{"name": "JAMDAT Sports MLB 2006", "name_review": "JAMDAT Sports MLB 2006", "ref": "https://www.ign.com/articles/2006/03/31/jamdat-sports-mlb-2006", "text": "Of the big four sports -- football, basketball, soccer, and baseball -- the latter makes the most sense on mobile. The rhythm of the American pastime is such that it can be consumed in small doses and without continuously pounding on controls. In past years, JAMDAT (prior to the EA acquisition) has done its best to own this category, but has recently seen some very fierce competition from the French mobile maker Gameloft, whose Derek Jeter series has upped the ante, culminating in last year's edition, which I proclaimed to be the best mobile baseball, period.   EA Mobile has struck back with a vengeance, as JAMDAT Sports MLB 2006 is one of the first mobile games that -- in my opinion -- doesn't really think of itself as a mobile game. JAMDAT strives for console quality game play with MLB 2006, and largely succeeds. Again, I think it helps that baseball lends itself to mobile gaming. Trying to replicate console football on today's gen of handsets would be a tricky task, as evidenced by the lackluster performance of EA Mobile's Madden NFL last fall.   One of the hallmarks of EA Mobile games -- presentation -- is definitely improved in MLB 2006. Not that last year's game was a slouch in any respect, but touches like the Jumbotron and full speech accurate commentary will rock your Red Sox. I tested the game on an LG VX8100, and of course to get the kind of sound and visuals you find in MLB 2006, you'll have to download a mighty sizeable game file. But, as mentioned, the game starts blurring the line between mobile and console with production values like this.   The game play hasn't been completely overhauled, and nor did it need to be. But there are enhancements that definitely make this a better experience than last year's crop of baseball games, such as the color-coded diamond that hangs in the top right corner of the screen. This diamond expertly helps keep track of base runners. When a runner is standing firmly on the plate, the diamond is green and you have little to worry about when lining up a pitch. When one of the quadrants around a base turns yellow, you know the runner is leading off a little. Throwing to that base will not catch them on a steal. But when the quad turns red, the runner is far enough off base that you might be able to catch them. When two of the quads light up red, you are faced with a tough choice, because the AI seems smart enough to use these pressures to its advantage. Maybe you'll hurry through your pitch selection and throw a meatball. Maybe you'll throw to the wrong base and not catch the runner that is far enough away to actually make the steal. Good stuff.   The emphasis is still firmly on batting and pitching -- the heart and soul of baseball. Most play can be done with a single thumb, as you choose pitches from a directional menu and position your throw. Batting is streamlined so you don't have to attempt to accurately line up the bat with the ball, but instead concentrate on swinging at the right pitches and at the right time. You are also given three types of swings, and if you can match up a solid power hit with a burning heater, the results are spectacular. But MLB 2006 also hands over most of the fielding controls to the player, too. You can use a quick turbo boost to really chase down a ball as it soars into the outfield.   The AI in MLB 2006 also seems improved, as the computer was very adept at matching my play style by the end of a game. If I was repeatedly going for power hits (I like high scoring ball games), it would lay off the heaters and try to burn me with trickier pitches. It was happy to throw balls in hopes of fooling me into bad swings, or even walking a player just to get a big hitter off the plate. The computer was good at stealing and batting, too, but not uncannily so. I've played my fair share of mobile sports games that felt like filthy cheaters -- not so with MLB 2006.   As mentioned, the game looks and sounds dynamite. Your mileage may vary, depending on your handset -- but the game play should scale just fine. MLB 2006 makes use of a full license, including all teams (including All-Star), uniforms, and player stats. There are only two stadiums, but the time of day does change to make things looks a little different during the course of a season. Crowd noise really gooses the action, too, especially if you manage to pull off an amazing play.  JAMDAT Sports MLB 2006 is the first baseballer out of the dugout for 2006, and it fires a direct shot across the bow of Gameloft's Jeter franchise. The enhancements really helped fine tune an already good game, such as the color-coded diamonds -- which, is actually my favorite improvement. The production values are excellent as well, such as the commentary that doesn't repeat itself too much. Without a firm date on Gameloft's Jeter, I can't really size up the two leading contenders for this season, but I can say that nobody who downloads MLB 2006 will be disappointed. This is a great ball game.", "date": "Mar 31, 2006"}