{"name": "Ghost Recon Advanced Warfighter", "name_review": "Tom Clancy's Ghost Recon Advanced Warfighter", "ref": "https://www.ign.com/articles/2006/03/31/tom-clancys-ghost-recon-advanced-warfighter-2", "text": "The Ghost Recon series has long been a favorite for tactical gamers. With its wide-open environments and quick kills, it takes plenty of teamwork, planning and heads-up play in order to succeed. Tom Clancy's Ghost Recon Advanced Warfighter recently hit the Xbox 360 to much critical acclaim, and while the standard Xbox port doesn't live up to its big brother standards, at least it's a capable game.   GRAW on the PS2 is anything but capable. Practically the only decent element brought over from the Xbox 360 version is the game's storyline, where mission objectives in the PS2 version closely mimic the 360's mission structure. Just about everything else has changed, however, and all of it is extremely poor.   Some changes are fine, like the fact that it's an entirely first-person experience with no 3rd person option, and you only ever have one other soldier under your control at any time. For the PS2 audience, this works well. What doesn't work well is every single aspect of the game's mechanics. From the control to the animations to the AI to the difficulty to whatever else you can think of, the PS2 version of GRAW fails in almost every single way. It's no wonder that there are no team credits in the back of the manual, because I sure as hell wouldn't want my name associated with this title.    For starters, the control scheme only sort of supports analog control. I'm not talking about movement speed here, which really is only either walk or run with no variations therein, but rather your aiming and movement controls. Moving either stick to the side and pushing up slightly might, and I stress might, result in a slight upwards creep in direction. In most cases however, your controls feel like an eight-way movement scheme. In other words, the controls usually limit you to up, down, left, right and any of the diagonals in-between. Movement and aiming simply feel downright awkward. It's amazing that a full-priced game like this would have this sort of problem in this day and age.   The animations for soldiers are pretty horrendous. The biggest problem is that they only seem to contain a few keyframes for each animation, and there isn't any sort of interpolation happening here. When a soldier is killed, he'll jump between a few falling poses until he hits the ground. If you remember what the death animations in Wolfenstein 3D looked like, simply pretend the soldiers were 3D instead of 2D sprites and you'll have a dead-on idea of what's going on here. Movement is the same with soldiers jumping between running poses as they blip along the street.   Not only are their animations terrible, but the soldiers are dumb as carrots. In one instance, I was on a rooftop and noticed a soldier run out from behind an alleyway so I put a bullet in his head. Then his friend runs out, turns and runs directly over the guy's body. Another shot and he was down. Then another guy ran out, then another, then another, then another, all to the exact same spot. Here's the end-result:     Your single squad mate isn't nearly as bad with regards to either AI or animation, though he still has problems. There are times where you'll target an object and want him to either use or destroy it, but he'll simply walk up and crouch near it. You'll have to call him back to you and then pop out a few grenades of your own in order to take out the target, or repeatedly send him to a machinegun and then call him back again until he decides to finally pick up the machinegun.    The level design doesn't help these problems at all. The environments are fairly small when compared to past Ghost Recon games, so in order to compensate for what could be a short play time through each area you'll find that you need to run back and forth from one side of the level to the other to complete all of the missions. If objectives were set up realistically and with care this might make sense, but much of it seems forced and so backtracking time and time again simply becomes tedious.   Navigating sections of certain levels is badly hampered by the game's inept visuals. Not only are the textures bland and blurry, but some areas contain no shading whatsoever. At one point in the game, it looked as if I was stuck in a reasonably small area without any way out, simply because I couldn't spot a ladder up against a wall since it used the same texture as said wall and had no shadows. It's never good for a game to look bad, but when it actually hinders your ability to progress or clearly find your next goal or objective, this is a very bad thing.     Being as the soldiers are pretty dumb and without any real shooting skills, GRAW on the PS2 is actually a really easy game for most of the way through. Using night-vision points out soldiers so much that you can see them a mile away, and even if you're not using it to your advantage, the AI is such a poor shot that it's easy to take cover and pick them off. More than anything else though, it's your squad mate that makes things entirely simple. The guy is practically invincible and he'll go anywhere you command, so if a tank is rolling down the street, you can send him right out in front of it and let him kill everyone without taking a single round of fire yourself. He's also a really good shot, so he can clear a street full of soldiers in a matter of seconds without your help.   Lastly, GRAW supports eight players for online gaming, which oddly is quite different than the single-player game in a few key ways. For one, you don't actually see your weapon and it employs the shrinking/expanding aiming reticule that many Tom Clancy games feature. It also changes the config setup some, such as how L1 brings up the map online whereas L1 crouches and Select brings up the map when you're offline. These changes are fine, but the otherwise poor mechanics of the game really can't save the online experience. It is the most rewarding part of the game, but it's still not really any good.Tom Clancy's Ghost Recon Advanced Warfighter is a very bad game on the PlayStation 2. It's terrible from a technical standpoint, and nothing else about its design really brings it out of the gutter. It's a shame that Ubisoft used the same name and cover as the other versions of this piss poor game, all of which are leagues better than the PS2 variant.", "date": "Mar 31, 2006"}