{"name": "Viking", "name_review": "Viking: Battle for Asgard Review", "ref": "https://www.ign.com/articles/2008/03/24/viking-battle-for-asgard-review", "text": "No game is perfect. Some have iffy controls, others have lame stories, and a few just have weak enemies, but even with these natural foibles, glitches and hang-ups, a videogame can transcend its limitations and be heralded as a title where the sum is greater than the parts.   That isn't the case with Viking: Battle for Asgard.   Set in the time when the Norse Gods ruled and people hid gold in glowing urns for some inexplicable reason, Viking, the latest from SEGA and Creative Assembly, tosses you into the massive boots of Skarin, a shirtless warrior who packs a sword and battleaxe. The game opens with Skarin mortally wounded and about to take a one-way trip to Valhalla, but Freya -- Odin's daughter -- steps in to save the Schwarzenegger-like brute as long as he pledges allegiance to her and promises to go after Hel, queen of the Underworld. Skarin agrees, gets this glowing amulet from Freya, and we're off!    Now, taking on the queen of the damned isn't a one-man gig. The problem is, Hel's Legion -- an army of blue-skinned, undead bad guys -- is roaming the countryside and has imprisoned the very Vikings who would be willing to fight alongside Skarin. This means that the majority of your time in Viking is spent scouring the mountain tops and grassy plains looking for men who are usually locked in giant ribcage prisons or tethered to skull poles. Find the camps, kill the Legion, and free the men. From there, the troops usually give you some task to complete such as gathering a healing honey or eliminating a traitor, and once the odd job is complete, they join your team.    See, you're freeing all of these soldiers for the massive battles that Viking revolves around. When you tap Select and bring up your map, you'll find it covered with various icons indicating enemy encampments, friendly bases and more. Of the enemy kind, you'll see some that have conditions -- free X number of troops, find the battle horn, etc. -- that must be met before you can complete the task. Usually, these are the massive battles that act as a middle and end to the level.   Once you meet the battle conditions, you can select the icon on the map and jump straight into the war. Here's where all of the troops you've saved march into battle with you. If you haven't seen these skirmishes in action, they can be pretty impressive. Each one starts with a cutscene depicting a sea of your men marching toward a sea of enemies. Dragons fly overhead, Shaman are casting ominous spells in the distance, and giants wait at the ready. When the scene ends, you're thrust into the battle the imagery just set up. You and hundreds of your men move towards hundreds of enemies.    Although there's no way to control what your men are doing, they're generally pretty good about following you and helping the best they can -- that is by beating the living hell out of all the blue-skinned freaks that get in their way. While your boys on the ground tend to the Legion horde, you're pretty much on your own as far as ending the battle. Each scenario has win conditions such as eliminating two of the three Shamans or taking care of a few giants. Once you've completed the tasks, your troops can move deeper into the base, you'll get a new set of objectives, and the beat goes on. In the end, you have to call your Shaman to the base's heart and have her switch it to good.   But he had a family! And just like that, I've explained Viking. Crisscrossing the map as you free troops and take on the occasional task that ends with you freeing troops is what this game is all about. The troop gathering and massive battles take place on three maps that feature towering mountains for you to figure out how to climb, flowing streams and plenty of red hot lava. When you enter bad guy turf, the sky will darken and rain will fall, and once you've liberated the space from evil's grasp, the sun pops out and the birds begin to sing.   If it sounds like a shallow experience well, it kind of is a shallow experience, but that doesn't mean it's not fun. On the surface, fighting camp after camp of evil monsters sounds a repetitive bore -- and it is toward the end -- but Viking actually did do a good job of keeping me entertained. Aside from the different ranks of beast each map dot holds -- there are archers, swordsmen, wooden shields, steel shields, double-sword wielders, and more -- there's the constant question of how to infiltrate their ranks. In the beginning, it's easy (just run in there and hack away with the weak strike button before letting off a heavy attack), but by the third island, I found myself standing back and scoping out all of the different entry points and options.   One base had my men and the aforementioned ribcage structure in the middle of the encampment. After a while of watching troop patterns and locations, I crept up on the base -- Skarin drops to a tip-toe crouch when he can see enemies but they haven't seen him -- and took out the one guard at the southeast entrance. After that, I waited for a patrol to pass, ran into the camp, freed my men, and let them help me with the murder of every creature in the place.   Now, if there were just a few of the low-level Legion in there, I probably would've run in and just waxed them all without worrying. If there were some monsters off in the distance, I would've had to have been careful that a horn blower wasn't hanging near the prisoners -- if he sees me before I get the chance to kill him, he can alert every enemy nearby to come kick my ass. These little touches of stealth, problem solving and planning are a nice touch that actually keeps the hack-and-slash gameplay from getting too stale  at least for a while.     Want to know what else helps? Insane levels of violence. We're talking Rob Zombie levels here. Remember how I said I iced that lonely guard a few paragraphs back? That was a lot cooler than I initially let on. As you run around Midgard and gather gold, you can take it and buy new moves from this Viking ghost. One of those moves allows for instant kills if you sneak up on a foe. You'll be creeping up, square will appear above his head, you'll tap the button, and Skarin will cut the bastard in half with one strike.    Blood will gush everywhere and entrails will be visible.   These bloody, grotesque deaths aren't limited to stealth kills. Once you've whittled away the life -- and usually an arm -- of an opponent, square will pop up over the bad guy. Tap it and Skarin will launch into a slow-motion dismembering attack that will spray red goo everywhere. He'll lop off their heads, cut them in half remove their limbs, and more.   It's awesome, and the finishers usually give off more magic-meter filling red orbs than the normal kill would've.    Sadly though, fun tidbits get lost in a sea of mediocrity when it comes to Viking. To begin with, the game can get extremely frustrating -- and I'm talking beyond the fact that you're just alternating between two attack buttons for the entire thing. There's a mission early on in your quest when you have to sneak into an enemy's base and power a sacred stone at their portal. The way the task is set up, you have to crawl into the camp and walk around the entire perimeter to get from Point A to Point B. If you're spotted, there are way too many people to fight and survive so you must run. However, there's no run button, so Skarin just jogs at his normal pace while enemies leap and stab him in the back, which completely halts your getaway. When you get to the energy your stone needs, you have to tap the circle button to power up, however the bad guys who were chasing you are now on top of you and each time one of their blows connects, you stop powering up the stone.   Grr.   Of course, if I thought that was bad, the assault on Hel's fortress showed that I hadn't seen anything yet. With the final big battle behind me, I was now sent out on my own to best the queen once and for all. However, first I had to climb a seemingly never-ending staircase that was filled with enemies. Did I mention that Viking's combat is incredibly hit-or-miss when combatants are going at it on different levels?   Argh.   Once I wasted all of my health potions and throwing axes on the villains who insisted on blocking everything, I climbed into the final battle with Hel. Now, for the few of you who don't become incredibly bored with Viking and actually make it to the end, I won't ruin the final boss fight for you, but I will tell you that not only is it absurd and anti-climatic but it is also one of the most annoying fights I've had in quite sometime. When you're waiting and waiting and waiting to move to the next area, you'll see what I mean.   The story of Skarin seems like it could've been an interesting one, but you'll never get it from Viking. The game opens with some colorful artwork and an over-the-top voiceover that works, but the story is quickly forgotten. Skarin never really speaks and just turns into Freya's errand boy. Toward the end, there's some info announced about Skarin's past, but he doesn't even react to the news and we have no idea why this would matter or who the players are. In fact, the only person I ever felt like I knew a lot about was Drakan, Hel's harbinger. We get a nifty little bit of VO and artwork exploring his love for Freya and his turn to the dark side, which made me feel for the character. It's a shame that care was never given to any of the characters that mattered.   For Midgard! Another huge drawback of the game is sound. Your entire time in Viking is spent traversing this open world, but the place seems dead. Ambient noise seems limited to Skarin's footsteps and the pitter-patter of raindrops, but even those can only be heard when the volume is cranked up on your TV. There were times when Skarin would cut someone down and there'd be no noise, times when a cutscene would play and in-game action would return with no sound, and when you release a group of troops, they give off a pitiful cry of celebration. There's no option to raise or lower the individual volume levels for music and special effects; there's just one ~volume~ setting that governs both poorly.   Still, the biggest drawback to Viking has to be the slow down when it comes to massive battles. Way back when we saw this game in Germany, the creators pitched Viking as being all about those massive battles I spent a few paragraphs talking about a while ago. Sadly, when you get to those parts in the game, the framerate drops and the action chugs along. It's not unplayable, just extremely disappointing. By the time you get to these wars -- my game was fine until I got to the first big battle of the second map -- you'll be quite familiar with how Skarin and company are supposed to move and act. So, when you get to watch a cutscene setting up the huge attack and are then greeted by Skarin slowly running into the fray as everything around him acts slower as well, you'll be pretty let down.   When it comes to graphics, Viking continues its standard of being a mixed bag. At times, the game looks great as Skarin slices enemies into lunch bag-sized pieces or runs through the grassy environments collecting gold, which he can exchange for health bar upgrades or fire bombs, but then there are the times when those grass textures will pop-in as the camera pans, when the dragons you command show up and look like cardboard, when you realize the game's using the same handful of NPCs for your men over and over, when you'll get caught in a wall or forced through a closed door, when Skarin will catch the light off of his amulet and look like a jaggy, washed-out mess, and the list goes on.    For the fanboys out there, comparing the PlayStation 3 version of Viking to the 360 version will only fuel the ever-raging fire. The slow-down is a bit worse on the PS3 but still present on the 360, and the issues with graphics remain but are lessened on the Microsoft console thanks to a better use of light and color.Short and sweet: Viking could've been great. The massive battles are a neat idea, the world can seem huge, and while simplistic, the hack-and-slash gameplay is fun for a while. Sadly, the problems in the game make sure that none of those good things can standout too proudly. The battles stumble thanks to chug, the worlds get repetitive, and when you're not really interested in the story or your ultimate goal, hack-and-slash gets on your nerves no matter how many times you cut a guy in two.There's still content here to like and enjoy, but I'd suggest sifting through it on the weekend as a rental.", "date": "Mar 24, 2008"}