{"name": "Tomb Raider: Legend", "name_review": "Tomb Raider: Legend", "ref": "https://www.ign.com/articles/2006/04/05/tomb-raider-legend-8", "text": "Nearly 10 years ago a little-known British developer crafted a title whose impact on the videogame world would be massive and permanent. Tomb Raider starring Lara Croft graced game systems in November 1996. Within a year, the sexy, smart and sassy heroine would go on to become world-famous for her voluptuous build, can-do attitude, and endless mass market appeal. Along with Shigeru Miyamoto's brilliant Super Mario 64, the first Tomb Raider illuminated new corridors in 3D game development, showing fresh possibilities in character and game design, 3D control, and camera work.    A lot has happened since the heady days of Core Design and Eidos Entertainment's first big splash. It's been nearly a decade. Lara's popularity has continued to thrive well into this century, especially with two movies starring Angelina Jolie, but though she remained a cultural icon to the masses, her games went down the toilet. After Tomb Raider 2, fans got five progressively worse sequels, the last of which was so second-rate that Eidos canned Core Design from its own series.   Enter Crystal Dynamics, the Menlo Park, Ca. developer best known for its gothic action-adventure game, Legacy of Kain. Crystal D spent more than a year researching the Tomb Raider series before it actually started the design proper, digging up the essentials to figure out what people loved so much about the originals and how to return to that point. Among other beneficial moves, original designer and animator Toby Gard was retained as a consultant. And the team's research pointed to a few things: people love exploring enormous exotic locales, they love great stories, and they want the freedom of making an acrobatic character move nimbly and athletically. That's exactly what we get with Tomb Raider: Legend. Crystal D's fresh approach, erudite design and execution, and its focus on good controls, smart puzzles, and competent combat, do the trick. They've resurrected an icon and a legacy from its tumultuous past by making the best and most definitive Tomb Raider yet.   Uncover new details at King Arthur's tomb. Slated for PC, PS2, Xbox and Xbox 360 (with a PSP release in May), the game starts with a focused thematic storyline that carries all the way to its final moments. In one of the first of many flashback moments, Lara and her mum begin the game traveling in a small airplane. Suddenly an engine catches on fire and they have to crash land. The two make it through the crash unharmed, but they find themselves in an ancient land with strange iconography and mystical architecture. Lara activates an ancient artifact and her mother is sucked into a magic vortex that pretty much ends Lara's childhood on the spot. The game proper starts soon thereafter in modern times in Bolivia with Lara Croft climbing cliff sides, a little reminiscent but a lot less vain than Tom Cruise's intro to Mission Impossible 2.   The narrative proceeds through in-game dialog, cutscenes, and flashback sequences, both watchable and playable. Just like in Resident Evil 4 (or Diehard Arcade if you want to get technical), many cutscenes demand quick interactions to keep Lara alive, and the extra effort pays off. It's clear Crystal D has done its homework. The story unfolds at a healthy pace, the dialog is extremely well handled, and while there are some obvious videogame archetypes, the enemies aren't terribly comic or over-exaggerated. The dialog is crisp and nicely edited. Lara is witty, and then it's back to the action. But Crystal D does develop Lara's character. You do get the feeling that she has a past that drives and haunts her, and she shows some real emotion. As Lara says to an engineer friend, she is in the business of digging up things. That's what this narrative does well. Crystal D builds her character and makes you care for Lara. Considering the history of the series, that's a daunting task.    The funny thing about Tomb Raider: Legend is how much has changed, yet remained the same. Crystal D made distinct changes to the game's every aspect, yet Legend is still very much a Tomb Raider action-adventure title. The core evolution to the once diminished series is how Lara controls. Moving Lara around environments is not an issue any longer. She is not tied to an invisible grid. There are no rigid means to make short jumps and or three-step rules to make a long jump. With the exception of gravity, she's free. Particular changes to her means of locomotion are all in the details, however, and these improvements make this adventure game worth your while. Lara can still jump, swim, walk and run, climb on poles, ladders, ropes, cliff sides, and she can shimmy and vault. When shimmying across a cliffside or climbing up a mountain, for example, by pressing a single button Lara can double time it across the object. This is pulled off by rhythmically pushing the button to her motion. Seems simple enough, but it actually speeds up the game's pace, an idea the previous six games could've used. While clinging to a cliffside, she can jump backward or aim at a 45-degree angle. This addition was in Tomb Raider: Angel of Darkness, but here it actually works smoothly and without frustration.   Little flourishes create a sense of experimentation and playfulness in Legend. Lara pulls off a beautiful swan dive from a 20-story African cliff into a massive lake. By pressing and holding a button while grabbing a cliffside, Lara can transform a normal jump into a silky smooth back-bend to a perfect landing. If you time it right, she executes a series of back flips and summersaults into a mid-air summersault finish. She feels nimble and athletic, easy and actually fun to manipulate. Not such a hard concept for most people to grasp, but for this series, control has been a bane. The swimming mechanics are smooth and likeable too. Mind you, Tomb Raider: Legend isn't as artistically stylistic or as mechanically high-end as Prince of Persia: Sands of Time, but overall, Lara's fluidity and dexterous nature are of high caliber.    Combat was also once a thorn in Tomb Raider's side, but not any more. Lara doesn't control that much differently, strangely, but many improvements have been handled with skill and attention so that combat isn't arduous. Lara's been given more moves, she animates very well, and she is quick to respond at all times. You'll still control her from a third-person perspective, she still has auto-target lock-on aim and, when in combat, simultaneously jumping and shooting are a must. But that's about it. Crystal D grafted on a free-range shot, which is slow and still targets to the chest, but it aims the gun at anybody, any object, at any time. You'll also find a little bullet time going on. When in punching range, Lara can jump off an enemy's chest or head, enter into ~focus~ mode, and spring behind them and shoot -- all in one swift set of motions. (This works especially well with guards wielding shields.)      There is more. Her multi-purpose grappling hook hauls enemies into her clutches. She also has a slide attack, which can send enemies into a nice juggle; and she can hit and kick, too. On the weapons front, Lara can wield two weapons and grenades simultaneously, and her trademark pistols never run out of bullets. On the consoles, switching weapons is as simple as pressing down on the D-pad, and grenades are handled with the shoulder/bumper buttons. The grenades mechanic is weak and those hot potatoes will bounce like Mexican jumping beans (often returning to you).  By the way, the D-pad also activates her PLS (personal light source) fashioned on her chest, refills the health meter, and pulls up a slick little set of binoculars, which come in handy when confronted by a tough puzzle. All of her weapons and tools are a single button press away, streamlining the action and stepping up the game's pace. Thank God for Crystal D.   You'll actually feel good about getting into a fight now. After you play through the built-in training session a gang of thugs immediately ambushes you. It's all good. Crystal D loads the environments with interactive obstacles ranging from exploding barrels to breakable cliffsides, loose rocks, zip lines, and other things. Gone is the clunky stealth mode from Angel of Darkness, the run and walk buttons, and the inane, awkward, and painful fighting and shooting schemes. Crystal has made Tomb Raider a competent, fun-to-play action-adventure game. They didn't reinvent the wheel, but Tomb Raider is functional and exciting on many levels.   Defeating bosses like these should be familiar to Legacy of Kain fans. Too bad the animal fights are still retarded. Wild dogs and lion fights seem to be just like they were before. It takes like 5-7 shots to kill one of these things. On that same subject (on things that the team might want to do away with in the future), Lara still rides a handful of vehicles. The main new vehicle is a motorcycle, which Lara will mount twice in the game. The motorcycle riding is simple, arcade-style stuff. It serves more to break up the action than to provide much of a thrill. The cycle segments are OK, but their addition isn't worthy enough or distinct enough to get terribly excited about.   Speaking of old ideas, the Croft Mansion is back. Instead of a training ground, however, it's Lara's own personal tomb to raid, filled with an array of genius-level puzzles. The mansion is a freestanding home that's meant just for exploration, outside of the story proper. It's filled with collectibles, secrets and hidden stuff. In fact, the Mansion is my favorite level of them all. Overall, there are eight huge missions that take place in Bolivia, Kazakhstan, Africa, England, and the Himalayas, each mission mixing indoor and outdoor environments.     TR: Legend is primary 70 percent adventure and 30 percent action, in that order. In every level, you'll find that getting from point A to point B isn't like crossing the street to get a gallon of milk. It's an act of life or death and requires acrobatic heroism of the highest order. But hey, it's a videogame, not real life. Helping you cross terrain and attack enemies is the grappling hook. This new tool works nicely into Lara's repertoire, breaking up basic jumps, flips, and pole spins. It also works into boss fights (of which there are five). Every step of the way, you'll encounter puzzles of some magnitude. The puzzles range from simple to moderately difficult, but thankfully there is no trace of the annoying Tomb Raider 3-style cross-the-country-for-one-tiny-hard-to-see-item-then-return-to-another-country-to-unlock-a-door-then-return-to-obscure-spot-#876-if-you-can-find-it. Instead, you'll find block and giant ball puzzles. A good bit of physics were added to the puzzle-solving, requiring you to observe your environment and recognize the required objects in it.   Regardless of which system you buy this on, Crystal Dynamics' art direction and design are top notch. The attract cinematic is Bond-like and on target. The menus and interfaces are all sleek, easy, and fast. The game really is attractive on all levels. Obviously, the Xbox 360 and PC versions will shine the brightest. In particular, the Xbox 360 version offers an enormous amount of specialty shaders and lighting techniques that add texture and detail to otherwise normal environments.    You'll see a little bit of aliasing in 480p on any system and occasional PS2 framerate hiccups. On 360, by bumping up the resolution to 720p you eliminate that issue. On 360 in 720p, you'll also get to appreciate the particles in the air, the atmosphere, the water, and the lighting at their full potential. Crank the res to 1080i and the effects are even greater, but the framerate drops a touch. But the PS2 and Xbox visuals shouldn't be ignored by any means. The PS2 version especially looks good for the machine's capabilities. The water effects, large, well-detailed level, explosions, and the clarity of all the objects, enemies, and creatures are all high.Though it's still tough to believe, Eidos' changing of the guard was the right one to make. Over the years Tomb Raider had become a regular industry joke, and TR: Angel of Darkness was the epitome of Core's unfortunate demise. Tomb Raider: Legend, on the other hand, is an example of focused design, priorities, and good mechanics winning out over fancy cutscenes (though Legend has its share of those too). If you've been pining for a good adventure, Tomb Raider: Legend is waiting for you. The cliffhanger story is well put together. The action is simple and effective. The controls not only work, they're fun. And Crystal D has developed a bunch of great new locales filled with imaginative monsters, beasts, and bad guys to slaughter. Best of all, the sense of discovery and adventure is captured with a fresh sensibility.", "date": "Apr 5, 2006"}