{"name": "Commandos Strike Force", "name_review": "Commandos Strike Force", "ref": "https://www.ign.com/articles/2006/04/06/commandos-strike-force-2", "text": "I recently asked a lead programmer at Blizzard why games keep requiring larger and larger development teams, larger budgets, and longer creation time, and he said it was because the industry was obsessed with topping itself. This also creates a chokepoint where only a certain threshold of money will push you through and keep the gamer's attention. So what is a PC-centric, strategy-focused action game supposed to do to stay current and profitable, besides merely getting released on multiple platforms? Well, instead of calling it quits, Pyro Studios has  taken a pretty big risk by moving to first-person action and largely doing away with the often mind-bending difficulty of previous entries in the Commandos series. Where previously it required painstaking timing, patience and accuracy, Strike Force is much more forgiving. But as you might imagine, that doesn't necessarily make for a better experience. But the reduced difficulty tends to make the game more accessible than anything else. And Strike Force still offers some intense challenges.     The newest entry in the series pares things down to the sniper, Green Beret, and spy. Each guy has proficiency with different types of weapons and tactical choices. The sniper, for example, can brave even freezing water, whereas the spy will freeze to death in quick order. The Green Beret can also carry multiple rifles and dual wield pistols. However, he can't throw his knife like the sniper, or wear enemy uniforms like the spy. Some decisions, like multiple rifles, make sense. Others, like swimming in cold water, don't as much. But as you go through the missions, which are largely solo or requiring limited input from one of the parties, you'll come to appreciate their specific skill sets, although there are some quirks.   While the spy is generally satisfying to play, here is where the game's more lax attitude can end up making things too easy. You'll be eliminating targets primarily by garroting them, which counts as a silent kill, albeit a gurgly one. However, if you draw your sidearm or assault rifle, your disguise disappears, and every enemy nearby will start shooting at you, even if all you've done is draw your weapon. In large, multi-stage missions, the spy will often discard his disguise after or during a cutscene. Don't ask me why, but at least there's usually another Nazi wandering around nearby. It can be a hassle, because the guards' suspicion is gauged according to the military rank of your disguise.     Enemies of equal rank will be suspicious of you, and you'll have to get out of sight quickly before they raise the alarm. Anyone a rank below you will ignore you unless you stand right in front of them for several seconds. A timer will tick above their heads, and if they decide they don't recognize you, that somehow means you're an enemy who must be killed right then and there. Also, if you hide for long enough, the guards will eventually forget about you, despite the fact that you've killed someone who had been standing right next to them. I don't know about you, but that would keep me kind of edgy, and I would feel the need to tell someone else that my guard buddy just died and the killer had disappeared. So by and large, the spy missions feel a little ~gamey~ in that they stick to somewhat tired stealth genre conventions. The enemies short attention span makes things a little too easy, yet someone a rank above you will recognize that you're an enemy immediately, which is usually bad news and doesn't make a whole lot of sense unless you're in an isolated location where the enemy should know what all their people look like.   Also, when you do make a mistake and cause the enemies to recognize you and take action, you're not really in that bad of a situation. In fact, you can play it like a typical shooter, just moving from target to target, aiming carefully and staying low. The ~spy~ character can be just as deadly as the Green Beret, once provided with an easily obtainable assault rifle. Also, characters can always swap with a weapon on the ground, giving one a rather large supply of ammunition. Except for one sniper mission where, all of a sudden, you can't grab anyone's rifle, save for a single scoped rifle tucked away in the corner of the map.    Thankfully, the sniper missions are more interesting, although there are fewer of them. The one-shot kills feel a little cheesy sometimes, but the ragdolls and puffs of blood contact make each hit surprisingly satisfying. In fact, some of these Nazis go flying like they've been clotheslined by a lead pipe, when in fact the impact force of a rifle round, while powerful, doesn't spread in a way that pushes a person's body back. It's a very narrow cone, and what the victim typically does is just fall down and bleed to death. It's too bad to see crappy Hollywood conventions creeping into video games, but in a game that evokes so much Guns of Navarone, Great Escape, and Kelley's Heroes, I guess this is to be expected. And aside from the sidearms, most of the weapons in the game have a hefty, menacing feel to them. Not to the degree of Black, but it approaches that. The Springfield rifle has a lot of kick and only one zoom level, so it feels authentic and properly beefy. The weapon models also look nicely accurate, although I'm no WWII history buff.     And speaking of visuals, this is perhaps the game's weakest aspect. They're trying to do a lot more than what they have the resources for; an engine that looks a step or two behind the original Call of Duty can only handle so much ambition. There isn't a lot of room for facial animation during the many cutscenes, nor does character animation give them much room for emoting. Vehicle physics are also pretty rudimentary. However, when the game finds an intense groove of action, the visual shortcomings take a backseat to the gameplay. It's too bad that Strike Force is rarely as intense as its WWII action subgenre brethren. There comes a point where you must defend a snowy French town from a German counterattack that's coming from the other side of a river, and that was downright electric. Cascading challenges, dramatic music, an avalanche of enemies from multiple directions, mortar fire, tanks, APCs and constant movement required by the player to keep a handle on the multiple tasks the game throws at you: scouts spotting for the mortars, enemies taking side routes, and the beefy vehicles that will shrug off mere bullet shells. In fact, so intense and long was this mission that everything else before and after felt like a dry run for the real game. Like the films Strike Force evokes, it has moments of quiet and moments of war-torn madness, where perhaps a steady flow of gunfire and explosions would have served it better, even if it came at the cost of feeling like a Call of Duty wannabe.   Right after that explosive mission, it's back to business as usual: creeping through the shadows and using guile and long range to defeat the enemy, instead of sheer brute force. Unfortunately, Strike Force doesn't execute here nearly as well as previous Commandos, which is ironic since that's been the series' bread and butter from the beginning. Maybe it has something to do with the move to first-person, but I think it's really about the much more limited role-toggling. You'll pretty much never have more than two of the three commandos at your disposal, and the bulk of the game will be covered with only one guy. And it's typically the spy with his odd mix of ease and gamey frustrations. At least the game sounds good. All the voice acting is great, and the music is occasionally thrilling, although it sometimes swells dramatically when nothing is really going on.    With the ~next-gen~ games clocking in at $50 and up, Strike Force rolls in at $29.99 for the PC, which in my opinion is just about the right asking price for a game that can't consistently distinguish itself with the excellence and challenge we've come to know from the series. And it should run quite well on a midrange computer, since it's not technologically demanding. I'd say that fans of the series ought to check this one out, but those of us who've gotten spoiled by Brothers in Arms and Call of Duty will only see glimpses of that intensity and cinema.", "date": "Apr 6, 2006"}