{"name": "Monster 4X4 World Circuit", "name_review": "Monster Truck 4x4 World Circuit", "ref": "https://www.ign.com/articles/2006/04/07/monster-truck-4x4-world-circuit", "text": "Not even close.   Monster 4x4 World Circuit is an arcade monster truck racer, but it also revolves around performing stunts. Monster truck stunts. Ramping your monster truck off jumps and doing 360s, backflips and other physically impossible maneuvers. To be fair, a ludicrous concept doesn't sink a game outright. Hell, look at Mario. He's the most ridiculous character ever, and the concepts of his stages and feats he performs rarely make any shred of sense. It isn't the concept behind Monster 4x4 that makes it a pain to play, nor is it any specific technical issue. Rather, the game suffers from being consistently boring.   The reasons Monster 4x4 will kill your consciousness faster than a quart of NyQuil is multilayered. The game has few modes of play. A single race mode is dwarfed by the more significant World Circuit, which takes you across monster truck tracks at Mount Rushmore, Athens, Sydney and a variety of other unlikely locations. You'll be able to select between fictional trucks like the Predator, E-Racer, and Vanguard, all of which can get their stats boosted by winning races. Sounds pretty cool, right? Turns out it's not.    Like so many of Monster 4x4's features, the upgradeable statistics mean too little in the grand scheme of things, as the difference between the starting level and maxed-out isn't as pronounced as it should have been. As long as you keep your monster truck in the middle of the road, you're likely to win the race. While finding shortcuts, maxing stats and effectively managing nitros certainly helps, neglecting them won't kill your chances at finishing in good position.   You'll encounter three modes in the World Circuit. Normal mode has tricks, power-ups, and traps, Pure Racing doesn't, and Duel is like normal mode with one opponent instead of five. While the fiery barrels, flamethrowers and speed boosters help to add a little variety, Monster 4x4 struggles to amount to more than a game where hitting the accelerate button wins the race. Also included in Normal and Duel is a trick system that takes five minutes to learn and five minutes to master. When you're approaching a jump, you hold down the right trigger to load a trick. Then, when about to fly off the jump you hold one direction on the left analog stick and release, making your truck do a trick. It's about as simple as a trick system can get, and it's just as boring at the six-minute mark. After an even longer stretch of time, it's painful.    Tricks, however, are necessary for races, as in Normal and Duel they give you nitros. Once you accumulate five, you're able to pull off a super nitro which zooms you along for longer periods of time than the standard version. Actually, zoom isn't an accurate description. The sense of speed in this game verges on a Sunday bike ride through the park with your grandparents, even while using nitros. Since Pure Racing mode gives you none of the trick or speed extras, you can only imagine how insufferably boring it is to play.   Perhaps if there were more to controlling your truck, this game would have been better. As it is, all you need to do is point your truck where you want it to go and hold accelerate. Not a sign of a good racing game. On top of that, tracks are generally wide so there's little penalty for veering too far in one direction. As a result of their width, you might also occasionally find yourself heading in the wrong direction, particularly on the Giza track. The only control issue that's a decent challenge is trying to hit all the powerups that either spring traps on opponents, raise new jump ramps, or open up shortcuts. While your control may be overly simplistic, some of the A.I. drivers seem to have a really hard time with it. During races we saw opponents ram straight into walls without the hint of intent to turn. Though they use nitros on a regular basis and follow shortcuts, the A.I. opponents seem generally lazy, taking broad, serpentine routes around tracks.     As dull as this game is to control, it's even less interesting to listen to. Though at first you may laugh at its hyperbolically generic guitar riffs, they quickly get tiresome. There's a surprising option to build a custom soundtrack, but you'd be way better off breaking your speakers. Especially hilarious is the inclusion of Track 11 from Nightwish, which is the aural equivalent of a polar bear in Tahiti. Races don't sound any better. You'll hear forgettable plinks and blings when picking up power-ups. Monster 4x4's gigantic rigs purr like kittens on morphine. Also, when successfully completing a jump, you'll hear a high-pitched guitar wail. Somehow this was the most appropriate of the game's sound effects, but it was still annoying.   The graphics prove much better than the sound. Actually, the visuals are the best part of the game. Sun flares peek over distant ridges from time to time, trucks animate well, you'll see water droplets fly onto and drip down the screen, and the tracks are populated with a surprising amount of detail. Framerates also remain stable as well, even with multiple opponents bouncing around you, kicking up dirt, nitro dust and sparks. Truck models have a decent variety, but could have definitely used some more extensive customization options. As it is there's only a limited amount of paint colors and decals you can slap on. Despite being Monster 4x4's standout feature, its graphical strength remains largely average in the grand scope of the Xbox library.    Aside from the world tour and single race mode, you can also play four-player offline split screen. While racing you get the same kind of gameplay from single player. Should you check out the mini-games, which include barrel battles and monster truck soccer, you might be briefly entertained by their novelty. The appeal is fleeting, however, once you realize there's little-to-no depth or engaging strategy.   Perhaps the most aggravating aspect of Monster 4x4 is that more objects can't be destroyed. If you're controlling a monster truck, you expect to blow stuff up. As it is, the most significant things you'll break apart are bits of wooden scaffolding and shacks. Why aren't tracks absolutely covered in debris? Why can't the monster trucks attack each other outside of knocking flaming barrels? Why was this game made in the first place?  Trying to answer these mind-boggling questions is an exercise in mental masochism you can altogether avoid by leaving this one on store shelves.Monster 4x4 has an interesting concept, but fails to amount to anything worth playing. If there was a better sense of speed, more destructive elements and a deeper control system along with a multitude of other improvements, it might turn into something fun. Sure there's multiplayer, but it's just as boring and confusing as the solo play. Save your money, this one's better used as a coffee table coaster.", "date": "Apr 7, 2006"}