{"name": "Rainbow Six Critical Hour", "name_review": "Rainbow Six: Critical Hour", "ref": "https://www.ign.com/articles/2006/04/11/rainbow-six-critical-hour", "text": "Milking the license. That's what we call it when a publisher releases mediocre sequels or expansion packs simply to get new content on the market without investing much time or money into a new game. Hey, it makes perfect economic sense and some gamers are going to enjoy Rainbow Six: Critical Hour, which re-creates seven missions from the first batch of Rainbow Six and Rouge Spear titles using the same technology found in Lockdown, the last R6 title, which was released in September.   On this batch of old missions, however, you will suit up the current Rainbow team of Ding Chavez, Dieter Weber, Louis Loiselle, and Eddie Price. Critical Hour is meant to act as a passing of the torch from John Clark, the previous head of Team Rainbow, to Ding and the current crew. More than a nostalgic blast to the past, however, Critical Hour is a simple meshing of old PC code with Lockdown code, resulting in a passable title that will be enjoyed most by tactical-shooter fans for the intense, strategic gameplay. Those who have played through the outstanding Rainbow Six 3 and Black Arrow will find Critical Hour to be a bland expansion pack hampered by ho-hum graphics, sound, and AI.   The good news is that Critical Hour is still a Rainbow Six title, filled with the trademark close-quarter combat and intense firefights. There's no medical kits or power-ups like those found in arcade shooters; just bullets and death. In fact, you'll die a lot if you don't peek around corners, use your squad effectively and practice methodical room-clearing strategy.    Hit me, I'm open! Controlling your squad is simple, using the same point-and-click method that Lockdown employs. Simply aim your reticule at a door and press A to have your team open the door. Point at a corner to have them scout. Point at a location to have your team move, etcetera, etcetera. The interface and style of play is similar to the SWAT series in which you order your squad to clear rooms using either the shotgun and frag or gas grenades, although the control is nowhere nearly as refined as SWAT.   The highlights of the gameplay come when you order your team to go through one door and start clearing a room as you sneak through another door and take out the terrorist unawares. The gun fights are fast and intense and you or your squad mates can be snuffed out with one well-placed bullet. To kill terrorists, sometimes you don't even need to shoot them. The aim-assist is a bit too friendly, and shots that are clearly off the mark will sometimes take out a bad guy, no questions asked. We're all for a tactical advantage, but we like to earn our keep as well.     The problem with Critical Hour isn't really the gameplay, although there are cases of enemy AI that are downright silly. Sometimes you'll shoot an enemy in the face from distance and he won't even react. Other times they run around in the open firing like madmen instead of taking cover like any reasonable terrorist not doped up on PCP would do. The problem with Critical Hour is that it never really answers the all-important question: Why should we care?    The graphics are bland, to say the least. The trip to Venice, one of the world's most beautiful cities, is as visually stimulating as a visit to a post office in Bakersfield. The character models are rough and the textures are pixilated. Explosions don't rattle your cage or put the fear of God in you. Instead, your grenades offer about as much impact as a Fourth of July bottle-rocket.    The fearsome foursome strikes again. The sound plays into this as well, as booming explosion and gunfire, the kind we find in games like Black, can really pull you into a shooter. Other than the decent voice acting from your squad, the sound too suffers from the same general malaise as the rest of the game.   Split-screen co-op play is supported as well as online multiplayer with up to 16 players featuring standard R6 fare like team survival and retrieval. There are a few new modes, such as free-for-all and assassin. In the new assassin mode, one player is designated as the target and your team has to eliminate him for success. Persistent elite creation (P.E.C.) returns from Lockdown, for better or worse. With the P.E.C., you are able to build the attributes of your online character. In most of the games we played, however, we were stuck with a bunch of ornery teens that demanded that we, on the opposite team, remain at our spawn point and allow them to shoot us in the face so they could level-up. After several rounds, this got annoying, and I shot those little punks in the face and quit to another game, but far too many kids care only about leveling up than saving the free-world.Rainbow Six: Critical Hour wasn't a bad idea and it's not a bad game. But it's not good. Had Ubisoft incorporated any kind of real story into the game, other than the ~look back~ concept, we may have cared. Had there been immersive visuals and sound effects that drew us deep into the action, we may have cared. It's hard to recommend Critical Hour to old gamers familiar with the stellar R6: 3 and Black Arrow, and it's hard to recommend Critical Hour to those new to R6 because they can start with those titles as well. Fans will be satisfied with the intense, close-quarter shooting that R6 is famous for, but mediocre graphics, sound and presentation hold Critical Hour back. It's not a bad game, but it's not the way we would have liked to see the franchise bid farewell to the current generation of consoles, and in the end it's a forgettable title that gives you a reason to rent instead of a reason to care.", "date": "Apr 11, 2006"}