{"name": "Hollywood Squares: Hip Hop Edition", "name_review": "Hollywood Squares Hip Hop Edition", "ref": "https://www.ign.com/articles/2006/04/11/hollywood-squares-hip-hop-edition", "text": "Hollywood Squares was a wonderful relic of the sorta-celebrity era, the days that also brought the deliciously campy Match Game show to the small screen. Sonic Branding has taken this popular license and rechristened it Hip Hop Edition, filling the squares not with C-list celebs, but with some of the bigger names in rap and hip hop, including Bizarre, Method Man, and Trina. Even Isaac Hayes gets in on the act.   The game unfolds exactly like you would expect it to. You answer pop culture related questions to claim the squares as your own. The ultimate goal is to get three in a row, exactly like Tic-Tac-Toe. The questions are mostly related to the hip hop scene, with some looks into TV and sports, such as the NBA. If you have a passing knowledge of the hip hop world, you'll get through several rounds of Hollywood Squares just fine.   After winning a few matches, you are entered into a speed round, where you have to answer a series of nine questions in just twenty seconds. The reward for breezing through this successfully is cash. At the end of an entire game, your final cash total can be posted on a leaderboard for all of the world to see.   Since Hollywood Squares licenses the actual likenesses of stars, making these personalities recognizable is incredibly important. While I wouldn't know Trina from a hole in the ground, Isaac Hayes and Bizarre were instantly recognized. The portraits have little animation, which is too bad, but the sound clips from each celeb help make up the difference.  Sonic's Hollywood Square Hip Hop Edition is actually a pretty smart way to give the license relevance. A lot of hip hop fans will appreciate the subject matter of the questions as well as seeing some of their fave personalities on the smallest screen. The actual game play is pretty throwaway -- but, then again, the original show was highly disposable TV, too.", "date": "Apr 11, 2006"}