{"name": "Odama", "name_review": "Odama", "ref": "https://www.ign.com/articles/2006/04/11/odama", "text": "Nintendo has in the past profited by taking a complicated gameplay mechanic and simplifying it for the masses. The company's original GameCube franchise, Pikmin, was largely a success because it transformed the complex, formerly mouse-and-keyboard-centric real-time strategy genre into something that console players could appreciate. Pikmin succeeded on multiple levels, though. The game merged RTS fundamentals with basic action title maneuverability, enabling gamers to become a member of the alien army they commanded. The setup not only worked, but was considered by most game critics to be a triumph - one that incidentally later inspired another acclaimed GCN effort: Battalion Wars.  Odama, from development studio Vivarium (best known for Seaman on Dreamcast) and Nintendo, is something of an enigma both in concept and in execution. The title's premise usually effects the same response, which is, simply, ~huh?~ It's not surprising. After all, the game marries the core mechanics of pinball with real-time strategy elements and spins everything to a backdrop involving medieval Japan. A giant metal ball, the Odama, rolls through and over mountainous regions, destroying structures and flattening soldiers. That's right huh? And if it didn't sound strange enough already, Vivarium has packed the title with a GameCube microphone that players use to command their armies.  The project is out there, to be sure, but it's also fresh and in many ways innovative. In an industry where every big game seems to be a copy of another, Odama is like nothing else before it and that alone is appealing, particularly for players growing steadily more indifferent to the norm.  Odama has its moments. Vivarium has created some clever, challenging levels that will really put the multi-tasking abilities of players to the test, and as a result several of the stages are both entertaining and rewarding. The title is also moody and occasionally humorous, due primarily to some great Japanese voice acting and some witty localized soldier dialogue. However, when the novelty of the different play style wears thin - and it does - gamers will find a title that, while unique, is largely unpolished, occasionally broken, and at the end of the day, relatively short.  The games industry has come a long way since the era of Dreamcast and a talking aquarium creature named Seaman. Developer Vivarium, however, has not - at least not technically speaking. Despite the fact that it arrives late in the GameCube's life-cycle, Odama looks visually unfit for Nintendo's current generation console. We're not kidding.   The game starts off well with some woodblock-style paintings that tell the story of the battles to follow. Players control Kagetora, the leader of the Japanese Ninten Bell army during the year 1539. The Ninten Bell, which follows the doctrine of Ninten-do (or ~Way of the Heavenly Duty,~) is progressing forward through the Japanese region in an attempt to conquer the forces of Karasuma Genshin, who betrayed Kagetora's father. What the Ninten Bell lacks in manpower it makes up with the use of its Odama, which it regularly rolls into the opposition. The storyline comes to life thanks to the superb voice acting of Hideji Otaki, who narrates the tale in Japanese with a raspy, moody voice.  But when the story telling ends and the game begins, players are bombarded by graphics that in their shiniest, brightest moments could only be described as out of date. Blurry textures blanket level terrains, regularly showing seams - a common trait of amateur PlayStation 1 software. Meanwhile, pathetically low-polygon models, from buildings and structures to the troops themselves, fill the landscapes. We're really not exaggerating or erring on the dramatic side, either. When the camera zooms closer to the environment, it seems to us that we could literally count the polygons constructing some of the on-screen characters, which is downright laughable.     We can understand Vivarium's decision in this regard. After all, lower-polygon characters means more troops can frequent the screen at any given moment, and to the game's credit it does spit out hordes of soldiers onto the battlefield. But so did Pikmin, and Nintendo's tiny alien helpers looked significantly more detailed up close than the best modeled enemy boss in Odama.  Although Nintendo itself constantly champions simplistic game design, Odama is in contrast anything but. The title, in fact, takes the simplest game in the world, pinball, and complicates everything - to the point, to be sure, where we can safely recommend that younger players steer clear of the experience. Odama turns medieval Japan into a giant pinball arena, transforming landscapes into pathways and structures into bumpers, but that's only the beginning. In addition to subtly tilting the screen left and right to direct the giant ball, players must also manage troops, give verbal commands, divide rations, and utilize power-ups in order to advance. There's a lot of multi-tasking involved and we're not going to lie: the game is at times difficult, frustrating, and even maddening.       It's also fun. The concept is initially surreal and daunting, but once gamers become familiar with the basics, learn how to give verbal commands to troops using the GCN microphone, and master the intricacies of moving the ball through the environments, the gameplay mechanics start to make sense. Vivarium has developed some pretty smart levels that complement the ball physics and challenge players to use all of their resources if they are to have any hope of moving forward.  There are different goals per level, but the main objective in each one is to command the Ninten Bell army to march through a gate located on one side of the level. This is a task that is much easier said than done. In some cases, gamers will need to shoot their Odama directly into the forces of the enemy, running down opposing troops in order to clear a path for their own. In other cases, they might need to simultaneously ping their ball around a level while directing their forces to rally on an enemy general. And as the levels progress, there are more objectives and more multi-tasking. Later in the game, the Ninten Bell army must conquer three sides of a mountain, and therefore players will need to shoot their Odama around the hill, managing all angles. It's intense, to say the least.  Odama is, nevertheless, one of those unfortunate games whose concepts are greater than their executions. The title has all the right ingredients for what should be an excellent outing, but the experience is marred by technical shortcomings and a general lack of polish. In addition to under-whelming graphics, the title has physics and collision detection issues. In some cases, we noticed that our Odama should have smashed into an enemy general, but instead passed right through or over him. In other cases, characters glitched into objects or structures. More troublesome, though, is that the microphone-enabled voice commands aren't always recognized. We found that we sometimes had to repeat ourselves two or three times before our commands were accepted. Finally, gamers use a D-pad-controlled cursor to highlight spots to direct their troops and - easily worst of all - the battlefield occasionally becomes so crowded that the cursor disappears under the armies, making it impossible to see where forces are being directed.  Vivarium's game is difficult while it lasts, but it doesn't last long. The truth of the matter is that players will rarely beat the title's levels on their first attempt. In one or two cases, we played through stages more than a dozen times before advancing. That said, Odama is not a long affair. With only about a dozen levels, it's over pretty quickly, especially after players learn the basics, which is a disappointment.Like Donkey Kong Jungle Beat, Odama is something completely different. Never before have we seen microphone-enhanced pinball on ancient Japanese battlefields, and somehow I doubt that we'll ever see it again. For people looking for something truly unique, Odama has its appeal. The title's pinball mechanics are clever, incorporating environments and challenging players to multi-task in order to advance. There are definitely some engaging scenarios in place.But just because Odama is different does not mean that it's also exceptional. It's not. Any aspirations the game may have held for greatness are obliterated by outdated graphics and sometimes-clunky execution, with drawbacks ranging from an unnecessary sluggish framerate to collision detection glitches, occasionally lacking microphone voice recognition and stupidly inputted cursor commands. And with only a dozen levels, we're not entirely sure which ends more abruptly: the novelty or the game itself.For all of its shortcomings, Odama is still a game that has its moments and therefore it's easily recommended as a rental. But only hardcore fans need pick this one up for their collection.", "date": "Apr 11, 2006"}