{"name": "Kao the Kangaroo Round 2", "name_review": "Kao Challengers", "ref": "https://www.ign.com/articles/2006/04/12/kao-challengers", "text": "Let's face it: there haven't really been a lot of platformers on the PSP; with the exception of Ape Escape: On the Loose and Daxter, these kinds of titles haven't really been released on Sony's portable system. Trying to correct this drought on the PSP is Kao Challengers (a port of Atari's console game Kao the Kangaroo Round 2) that was originally released in Europe in 2004. However, the translation hasn't exactly been kind to Kao or his friends, leaving much to be desired of the marsupial.   The story behind Kao Challengers is, presumably, a continuation from the original console game, although it makes no connection or allusion to the previous story.  Players are introduced to the hero by his friend Parrot, who happens to find Kao imprisoned on a ship.  After his rescue, Kao finds out that his various animal friends are being kidnapped by an evil Hunter and they need his help before they're harmed.  Unfortunately, Kao needs to collect 3,000 coins before he can confront the Hunter and put an end to his evil plans.    Kao has a number of moves at his disposal that he can use to force the minions of the Hunter to let his friends go.  For the most part, he relies on his agility and physical skills to defeat his enemies.  Kao can use his punching glove clad hands to beat opponents into submission, or he can use his tail attack to whip enemies.  To try to take out a number of opponents in an area, he can perform the standard ~butt smash~ move, and he'll even be able to roll himself into a ball and barrel his way through foes.  Later on, he'll acquire boomerangs to take out enemies from a distance as well as objects to throw at puzzles and other switches.  There will also be stages where Kao winds up piloting a vehicle or moving around his environment in a number of different ways, such as a snowboard, a motorboat or flying on the back of one of his friends.   Kao also discovers a lot of items that he can use in the course of his search for coins.  Crystals allow him to access a number of bonus missions found in the Dark Docks, which happens to be the hub level that he ventures from.  Many of these are tame time wasters, such as jumping rope or hacking trees along a path, and don't wind up affecting gameplay at all.  Other items, such as Stars, improve Kao's skills, so he can jump higher and land with more force than he ever could, for example.  He'll also be able to use a flying helmet to propel him over gaps, and even liberal use of a continue bell that lets him return to that spot whenever he loses his life.    Fortunately, you won't have to worry about the game ending because you die a lot; however, you will find yourself frustrated because of the amount of dying you'll do.  This isn't to say that the game is hard -- far from it.  In fact, the game can sometimes be incredibly easy, to the point where most kids and adults (particularly platforming veterans) will feel like the game is holding their hand.  And no, there is no adjustable difficulty setting.  The primary reason why you'll die so many times is because the camera is so incredibly bad.  Although you can move the camera around thanks to the directional buttons, there are numerous moments where the game invalidates the camera control because it wants to frame the action the way it wants to be seen.    Unfortunately, some of these angles are extreme zoom outs to show the scale of the environment, which can cause you to lose where Kao is on the screen.  This might've been fine in the console version when the game action was displayed on a TV screen, but on the smaller PSP screen, it's inexcusable.  In fact, it can sometimes cause a certain amount of eye strain trying to follow what's going on thanks to the abysmal camera work, and you'll probably need to take a few moments every now and then to let your eyes recover from the game.   The camera can also help contribute to one of the other problems that crops up within certain sections of the game: the controls can be horrible.  For the most part, you'll be able to control yourself on foot fairly well.  Kao doesn't usually have problems -- he'll even wind up grabbing onto ledges if he's going to fall off of a platform to save himself.  The problems can arise whenever the camera decides to choose an odd angle, because you'll find accurately making jumps and moving through the environment becomes much harder than it needs to be (if it doesn't decide to swing its view through the level design and show a blue screen for a couple of seconds).  In fact, you may find that some of your controls are reversed as the camera decides for you that the game will be shown a certain way, particularly during some ~action sequences.~    If only these sequences were interesting or innovative.  Kao manages to steal sequences from just about every other platformer in gaming, without making them interesting in the least bit.  You have the generic fire, ice and water levels, along with an aerial stage that you need to collect objects to stay aloft.  You're usually chased by unstoppable characters or adventure in meaningless races, collecting objects and avoiding obstacles.  Unfortunately, if you've played a Crash Bandicoot, Jak or Ratchet title (amongst a myriad of other platformers), you've experienced every single facet of what Kao Challengers has to offer.   In fact, while there are a few sections that add a bit of pressure, such as platforms falling almost as soon as you jump on them, it doesn't feel like anything new -- hell, it even feels a little cheap because of how quickly it's skewed against you, making it more of a chore to get through than a reasonable gameplay element.  What's more, the included vehicular elements are really bad.  I cite the underwater sequences as the primary culprit of this, because the swimming and controlling of torpedoes is so painfully bad that you'll have to replay it over and over again to even be competent at maneuvering through each level.    Fortunately, Kao Challengers offers multiplayer, unlike its console counterpart.  You're given the choice between racing through various maps and fighting in Deathmatch games or mild variants of this mode.  For instance, the Chicken Master gives points to the player who wears the chicken head for the longest amount of time, while Weapon Master forces you to collect coins to give you ammo for your selected weapon.  It's a creative idea for multiplayer, but it doesn't really do much to extend the longevity of this game.  It can be hard to port a game from a console over to the portable space; it can be harder still if the game has been released years ago and is just making its appearance on a new system.  In this age of Director's Cuts and double dips for titles, taking a two year old title and leaving what appears to be inherent flaws in the game design is indefensible.  Plus, considering that it is a game that literally steals its control scheme and source material from other titles yet implements virtually nothing particularly well, this is a game that you'll never return to after you've played through it once.", "date": "Apr 12, 2006"}