{"name": "Daemonica", "name_review": "Daemonica", "ref": "https://www.ign.com/articles/2006/04/13/daemonica", "text": "Although real-time strategy, shooters and MMOs have come to define the PC platform, I still have a place in my heart for those adventure games of yore, particularly the LucasArts franchises like Indiana Jones and Monkey Island. With a few exceptions, the big bucks have moved on to other genres, though, so those who still have a hankering for combining items in their inventory and figuring out puzzles have had to brave some lower production values, and Daemonica is no exception. This isn't the game you get to show off your latest hardware; it's a game for those who may be tired of the same old adventure formula. Unfortunately, while Daemonica inserts some fresh ideas, it's a too clunky in some key areas to get an unqualified recommendation from even an adventure fan.   Although the art style and camera behavior strongly recalls Diablo, this is far more of an adventure than an RPG. In fact, since it takes place in one town, it's probably more of a murder mystery than a proper adventure, the latter of which typically involves adventuring. You may only get in half a dozen fights through the course of the 15 or so hours it takes to get to the end. Most of what you'll do is have lots of conversations, gather herbs, and figure out some puzzles. It's more like a game of Clue than an adventure, but this certainly has its appeals.     True to its apparent budget limitations, all of your convos will be text instead of spoken dialog. This isn't necessarily a bad thing, of course -- but there is, honestly, a lot of reading to do, so much that it tends to bog down the flow of the game. Then there are the intermissions where the main character, Nicholas Farepoynte, has a spoken monologue describing some key actions, in place of scripting the activity to be seen on-screen. The quality of the writing is generally solid, but Farepoynt's role as a Medieval investigator with some unusual occult powers is at odds with the actor's rough Cockney accent. His voice fits his appearance -- that of a tattooed, hooded brigand -- but his occupation and conversational acumen indicate a more ~refined~ voice. It's no game breaker, but it's still a little jarring when he goes into one of his Story Time moments.    Lastly, in regards to dialog, the conversation trees are awkward, which is too bad since the game revolves around talking to people. When you reach the end of a tree, there's often an ~end dialog~ option instead of a ~back~ function. So you have to start over again, click through the stuff you've already read, and then get to the question you didn't cover yet. Meanwhile, the camera is fixed in a relatively distant isometric perspective, and there aren't any dialog animations, so talking with people feels a little static. On the bright side, I thought the music was surprisingly good and varied, particularly given the apparent budgetary constraints.   Although the art style recalls Diablo, it's done in fully rotateable 3D, although holding down the middle mouse button to rotate can take some getting used to. You can use the arrow keys instead, but I've been a WASD gamer for so long that it feels like trying to write my signature left-handed. You also can't remap any of the keys, but the placements are already largely intuitive, and you'll rarely encounter a moment where the correct key press at the correct time is the difference between life and death.   No, Daemonica can be played at a leisurely pace. In fact, you may have to take your time with it, as certain story elements require you to gather scattered resources. Unfortunately, the resources don't reappear after a certain amount of time. The only way to get them to come back is to advance the story to another of its five acts. It's entirely possible to use too many plants for healing potions and not have enough stuff left over for ~Soulgreep,~ which you use to temporarily pass into the afterlife and talk to dead people. You can save your game pretty much anywhere at any time, using as many slots as you want, and the process is fast, and it doesn't take much time to retrace your steps if you have to, but perhaps it would have been better to simply let the plants regrow after a certain amount of time or a certain amount of player usage. Because you don't know that you've run out of resources until it's too late.Nothing in Daemonica stands out as particularly weak, but aside from the main character traversing into the land of the dead to talk to murder victims, there's little of particular note. Although it has fewer bugs than most games with multi-million dollar budgets and quality assurance armies, the ~spark~ of the game is difficult to dig out of the layers of mid-level production values and relatively slow pacing. Adventure fans looking for a change from the norm would probably be better served with Indigo Prophecy or the upcoming Dreamfall.", "date": "Apr 13, 2006"}