{"name": "WordKing Poker", "name_review": "WordKing Poker", "ref": "https://www.ign.com/articles/2006/04/25/wordking-poker", "text": "There is one genre that reigns supreme on mobile: poker. Puzzle games aren't far behind, and wordie games, a sub-set of those puzzlers, are still wildly popular. A combination of these two categories ought to be an unstoppable juggernaught of mobile entertainment, and that's a pretty apt description of Digital Chocolate's WordKing Poker. If you savor the English language and play a decent hand of poker, this is easily your next download.   Combining Scrabble and poker is actually easier than I imagined it might be. Replace cards with letter tiles, each with a varying value (the lesser-used the letter, the more it is worth), but maintain the most basic rule sets of poker variations. For example, in the Texas Hold'em style, the flop contains the most basic vowels. You must use your hand of letter tiles to assemble the trickiest, most complex word to win the round -- the more esoteric, the better. And the computer has access to a pretty heavy dictionary, so you better bring your A-game if you want to compete in single-player games.   While this is happening, you go through the other poker motions, such as betting. The other game styles, 5 Card and 7 Card, also vigorously adhere to the rules of those games, making WordKing an easy transition for poker fans curious to try a refreshing take on a very crowded (and occasionally stale) category.   WordKing Poker offers multiplayer on the same handset, you just pass the phone around. Online multiplayer would have been good fun, though. Not necessarily real-time, but sort of bouncing the game back and forth between opponents like an email game of Scrabble.   As with most Digital Chocolate games, WordKing Poker looks fantastic. The screen is very clean, but quite pleasing with its attention to detail. The green felt poker table, the gilded rings, the wooden tile cards -- all contribute to a smart package.  I could actually sit here and heap a major stream of praise on WordKing Poker, but a simple round or two with the game for yourself speaks volumes. If you love word games like I do, this is a must-have. The computer AI can be merciless, but not frustratingly so. You just need to develop a sharp eye and a sharper tongue to compete. Wordies, unite and download.", "date": "Apr 25, 2006"}