{"name": "Guilty Gear Dust Strikers", "name_review": "Guilty Gear Dust Strikers", "ref": "https://www.ign.com/articles/2006/04/26/guilty-gear-dust-strikers", "text": "While the DS hardware opens infinite possibilities for franchises both new and old, there's a bit of a catch to the amount of innovation it harbors.  We've all seen the system take both the Japanese and American markets by storm with Nintendogs, Electroplankton and Brain Training.  Each of these products was inspired directly from the DS hardware.  That is, they're experiences that feel most at home with touch interface, dual screen presentation and microphone input.  Aside from a few major titles, most franchises must adapt from their original form into the DS style.  Games like Animal Crossing, Mario Kart, Metroid Prime Hunters and Castlevania show us perfect examples of classic products that are treated to a DS design revival.  There are, however, games like Guilty Gear Dust Strikers, which for one reason or another fail to make the conversion to the DS platform.  While the issue here isn't a lack of hardware to support the system, Guilty Gear Dust Strikers proves to be an example of how change isn't always a good thing, as the classic fighter has gone through an undesirable evolution on Nintendo's latest handheld.     So if the DS is a system that is supposed to inspire innovation, where did Guilty Gear DS go wrong?  Simply put, the original concept was faulty, forcing designers to work with a broken formula that had very little potential for success from the start.  Rather than keeping the style of Guilty Gear as it was - a beautiful two-player fighter - the design was altered, turning it into a four-player party battle game a la Super Smash Bros. Melee or Jump Superstars, using the bottom screen to lengthen the playfield and add a very simplistic power-up ability to incorporate touch-interface.  The Guilty Gear franchise has always been a little off, but it was solid from top to bottom.  The gameplay is crisp, character designs are amazing and animations are some of the best in the business, so when Majesco hit us with a totally new design we weren't that surprised.  After all, if designers want to have a little fun with their product, DS is the place to do it.  The basic flat-level design was taken out, adding the height of two screens.  Combo battle was reduced, making each character focused on a few different specials and simple combos, and the battle was switched from it's original Street Fighter form to a full on battle royal.  The pieces fit, but the problem was execution.   It's a given that ARC System Works knows what they're doing when it comes to the classic fighting genre.  Hell they've released over 20 Guilty Gear titles in America alone, so they're no stranger to the age-old way of the arcade.  Unfortunately, their design just doesn't translate well to the DS system, and the reasons for this sub-par transition are everywhere.  For starters, the design calls for smaller characters.  If there are going to be four fighters dashing around two different screens, they have to be smaller.  Unfortunately, the character designs don't carry over as well as they could, and animation frames had to be cut to save cart space.  Since the character art is considerably smaller, much of the beauty and style of the game is lost during the actual fights, which will be a letdown to any Guilty Gear fanatic.  An attempt was made in the interface and transitional screens, but in the end the lack of the true Guilty Gear style will hurt the experience for most diehard players.  Although we do have to say the audio presentation is right on par with the parent versions, offering the all-too-memorable guitar riffs and character voices, just as it should.      In addition, player control has been dumbed down to fit the style of gameplay.  For starters, each character has far less attacks.  There's one main button for light attack, one for heavy and another for the dust strike, which is essentially a smash attack.  The final face button is reserved for all supers, much like Super Smash Bros, and is used by simply pressing a direction combined with the button press.  Jumping has been mapped to the up arrow on the d-pad, much like traditional fighters.  It's a bit odd, however, since jumping will move players from one level of the arena to the next.  There's no ability to quick-maneuver over a rival fighter, or hop backwards to evade light attacks, resulting in far less strategy when compared to the one-on-one battles of the original.  Players will essentially jump to the desired height in the arena and attack their desired target with either dashing or projectile attacks.  The gameplay has been severely sacrificed.   In fact, not only have character controls been limited, they've also been taken out of their original formula, adding all new issues to deal with.  When creating a 2D fighter centered around two main fighters, the characters are always facing each other.  When a player jumps over his opponent, the characters will reposition themselves on the fly, maintaining eye contact.  In Guilty Gear DS, however, there's no orientation done on the fly.  If players need to jump to the next highest level and turn to face an opposite opponent, the execution will take some time.  Rather than having a character change directions automatically, designers had to account for players that want to continue facing their opponent while fading backwards.     Since there's no easy way to determine if you're attacking a new foe behind you or simply making a parry away from your current opponent, they require the player to tap the opposite direction before the character will turn around.  What this means, however, is that you could be attacked from behind, fall down, and rise back to your feet still facing the opposite direction of your opponent.  There's no changing orientation while on the ground or blocking, so there will be times when you see an attack coming but have no way to defend it in time.   Above all other gripes, however, is the general feel of the characters while in motion.  2D fighters have a certain feel to them.  On the opposite side of the spectrum, Super Smash Bros. has a different but equally familiar touch.  Rather than truly committing to one or the other, Guilty Gear DS is stuck in limbo between the two.  It doesn't have the flow and strategy of the original fighter, and it lacks the tight controls and balance of a multiplayer fighter.  It's as if the designers wanted to change the game this time around, but decided to only go half way while doing so, and it simply doesn't work.  The orientation issues, jump system and combos add up to an unpolished feel that will undoubtedly have fans wishing designers would have stuck to what they know best.  It's one thing to create a franchise and have it be sub-par, but it's a far more painful experience to hurt an existing product that has been tried and true for generations in the attempt to fix a design that wasn't broken in the first place.   As a way to add extra replay value to the pack, Guilty Gear DS also offers a handful of mini-games into the mix.  These can all be accessed from the main menu, and are supposed to be a chance for players to kick back and enjoy alternative gameplay between fights.  Unfortunately, they are amazingly basic and add nothing to the overall production.  Most of the games are made up of assets from background and character sprites, and the games control on a very basic level.  In fact, the pool mini-game is so sloppy that players often won't be able to see the number on the balls, making the game amazingly frustrating.  There are a few that are slightly entertaining, such as the swordplay game, but they'll only add a few minutes of replay value to an altogether disappointing experience.  In addition, the ability to create your own fighter is also included, as players can assign special moves and combos to a robot fighter, which can then be accessed in the character select screens.  While this does help to add a bit to the lasting appeal, parts for your Robo Ky fighter can only be unlocked by beating the mini-games.    We have to give the crew over at ARC System Works some credit.  Rather than simply bringing their tried and true method over to the DS, adding in a lame use for the 2nd screen, they took a chance.  Guilty Gear DS is an all new vision of the franchise, and while it doesnt have the solid gameplay or flow of the original, its great to see developers take a chance.  Unfortunately, fans will want to pass this one up, as more things were added to the fix-it list than were taken out.  The gameplay is sloppy and basic, the characters suffer from less of an animation budget on the smaller system, and the overall feel just isnt worthy of the Guilty Gear name.  Theres a bit of fun to be had on the most basic of levels, but the overall strategy is far too small.  Players will inevitably resort to button mashing, which is a far cry from the complexity of the Guilty Gear franchise.  A similar approach is going to be taken for the PSP version, adding all new gameplay to try and win over the handheld crowd.  With luck this will be a better transition, as Guilty Gear Dust Strikers isnt worth the cash.  Heres hoping for a traditional sequel.", "date": "Apr 26, 2006"}