{"name": "Texas Hold 'em: Poker Pack", "name_review": "Texas Hold 'Em: Poker Pack", "ref": "https://www.ign.com/articles/2006/05/02/texas-hold-em-poker-pack", "text": "At this point, a Texas Hold 'Em game released on the Nintendo DS will really have to dazzle us to justify its existence on the shelves. After all, in the system's year and a half, there have been at least three independent releases that enable players to compete in some poker - more specifically, Texas Hold 'Em poker. Offering one more isn't going to get noticed without a special hook, and the only thing this game gives players is a smaller price tag. You definitely get what you pay for: everything else about this game -- visuals, music, pacingeven standard Poker rules - is handled incredibly sloppily, not even reaching the quality of some free downloadable PC poker games.   Webfoot Technologies is perhaps best known for several of the Dragon Ball Z games that hit the Game Boy Advance. Texas Hold 'Em: Poker Pack is the company's premiere jump into the Nintendo DS market, but it lacks so much of an impact it barely even registers on the meter.   There's so much wrong with this game that we'll eliminate the nit-picks and go right into the meat of the production. First of all, Texas Hold 'Em: Poker Pack lacks any sort of tournament structure or even a full-on single player competition mode, instead simply giving players a basic menu system to create a game. This gives personal customization, sure, but it also removes any sort of personality in the game's presentation. The game's also missing multiple player profiles, so player tracking is simply attached to the cartridge instead of the variety of players that might want to jump in and play some cards.   And then you get into the game itself. Playable, yes. The game uses the DS screen for all player interaction, and the AI at least follows some of the acceptable rules of folding or bluffing. But visually, the game's an absolute mess - clunky animation, poorly drawn sprites, awful character models. The audio doesn't fare any better, with some of the most unpleasant background tunes heard yet on the Nintendo DS - at least the sound quality of the play-by-play announcer is somewhat cleaner than the music is. The game's pacing is incredibly chunky due to poor user interface that's really difficult to follow, and in some cases it doesn't follow standard poker etiquette: the player that's left in the hand that didn't fold will automatically show his hand. Wrong, and very bad for poker, since this reveals to everyone if that player was bluffing or not.   It's not a complete failure, though. The game does a couple things right, namely offering a variety of card games outside of Texas Hold 'Em, from hearts to blackjack to euchre, but they're all handled in the same cruddy cards engine. There's also statistics tracking, but as mentioned above, the game lacks player profiles, so the statistics tracking's attached to every game that's played on the cart and doesn't record player-specific hands.  Admittedly, the Nintendo DS doesn't have one real clearcut winner in the world of Poker, but Summitsoft's offering isn't even a contender. Its AI is competent for single player, but it lacks any sort of presentation to give players a reason to play, and what it does offer is slapped together so sloppily it feels like it's the Nintendo DS equivalent of shareware.", "date": "May 2, 2006"}