{"name": "DDR", "name_review": "Dance Dance Revolution", "ref": "https://www.ign.com/articles/2006/05/03/dance-dance-revolution", "text": "Konami's Dance Dance Revolution franchise is enjoying another crest of success due to a group of doctors and exercise experts hailing the game's health advantages. Naturally, the mobile version of the game cannot offer any of the same benefits, save for making your thumbs a little more nimble. And that's the mobile edition's failing - the whole point of the game is that you interact with it via your whole body. Just tapping your thumbs all over the number pad isn't nearly as much fun - although, it is something of a challenge.   Dance Dance Revolution contains a few songs - none particularly memorable, unlike the console and arcade games - as well as a few backgrounds that can be switched in and out. Just like the console game, arrows pointing the four cardinal directions scroll up the screen. You have to press 2, 4, 6, and 8 in sync with the arrows as they reach the top of the screen. Easy songs give you ample chance to practice some finger dancing, but when you juice it up to harder difficulties, the game can be pretty merciless. And it crosses into the un-fun category, in my opinion.   I tested Dance Dance Revolution on a Sony Ericsson 710. The game screen is clean - I had no problem seeing the arrows and following the patterns. The music, while not especially interesting, was loud and clear. And, most importantly, the input detection - or whatever you want to call it - was right on. Very responsive.  I love Dance Dance Revolution for my PS2 and Xbox. I consider myself a fan of the franchise, but this mobile edition did nothing for me. Much like Capcoms Street Fighter II for mobile, there is a certain level of expectation and disconnect between the source material everybody loves and the mobile edition which really alters the game play. The control is responsive and the game totally competent, but still... pass.", "date": "May 3, 2006"}