{"name": "Halo 2", "name_review": "Halo 2 Original Soundtrack Volume Two", "ref": "https://www.ign.com/articles/2006/05/05/halo-2-original-soundtrack-volume-two", "text": "What hope has this alliance  If we cannot conquer  Doubt of faith not each other--  If our belief should falter?   But put an ear to the stones  Of this Holy City  Inside Their voices echo still:  ~Seven rings being the Journey!~   So reads the excerpt from the Ratification Parley, High Council of Concordance reprinted on the inside sleeve of the booklet accompanying Halo 2 Original Soundtrack Volume Two. The somewhat heavy-handed, neo-poeticism of the excerpt lays the foundation for the aural mood that is transmitted on this new release of music from the popular first person shooter. Whereas Volume One included rock tracks from Incubus, this time around the listener is treated to 12 selections of pure instrumental score.    Considering that each of the included tracks  is at the shortest 2-minutes and 36-seconds and at the longest 11-minutes and 28-seconds, this is much more like a full-blooded score than a soundtrack, the songs unfolding like epic expanses of a greater piece and never sounding like quick dash cues used for rapid fire cut-scenes. The lead-off number, ~Prologue~ is broken into three unified mini-movements (this is more or less the modus operandi for each of the 12 main songs, many being broken into three, four or five parts) There's ~Rising,~ ~Cloistered Expectancy,~ and ~Weight of Failure.~ Since the segments all run together to create a cohesive whole, you'll have to rely on your sense for drama to actually figure out which portion of each track corresponds to which title. Thankfully, the sonic emotions that composers O'Donnell and Salvatori employ are pretty direct.  ~Prologue~ flows with a certain detached beauty, a Van Halen-esque/Satriani-inclined rock guitar riff sucking you in before it dissipates into serenely melancholic orchestration.   The segue between songs is so fluid that you'll hardly notice when ~Cairo Suite: 1. Cold Blue Light II. Waking Spartan III. Jeweled Hull  IV. Chill Exposure~ has begun and the ~Prologue~ has ended. Kudos to O'Donnell and Salvatori for rendering an almost completely immersive aural experience that will please hardcore fans of the game and also work as nice modern symphonic music for those who could care less about intergalactic battles and first person mayhem. Clocking in at 9:43, ~Cairo Suite~ is the second longest movement on the soundtrack, one that flows from serious down-tempo lushness to airy elements of ethereal wash and even tidbits of electronic ambient toneology that elicit an overwhelming sense of tranquility.    A slight sense of unease seeps through on ~Mombasa Suite: I. Metropole  II. Broken Gates  III. Encounter~ fluttering between a light hearted feeling of new discovery and dusk drenched undercurrents of malevolence. Things kick into slightly mid-tempo gear when pounding syncopation and floating electronic ebbs and flows creep into the mix. It eventually downgrades to naturalistic percussion that lends an earthy vibe to the affair. Sadly this atmosphere is destroyed on the somewhat bombastic crunch and circumstance of ~Unyielding,~ one of the few single movement tracks on the album. Driven by piano and antagonistic guitar, it more than lives up to its namesake. At the same time, however, it seems at odds with the previous styles that have been rendered on the soundtrack, sounding a bit like cheesy mid-'80s Euro-trash prog metal.   Thankfully ~Mausoleum Suite: 1. Destroyer's Invocation  II. Falling Up  III. Infected  IV. Shudder~ returns to the hypnotically mysterious and haunting thematics that have been propelling the soundtrack into the realms of near-cinematic brilliance. Mixing atonal clashes of sound with sweeping orchestral passages, this suite is evocative and mesmerizing, even when it changes gears mid-way into electronic burble and pong (the use of a wailing wall of dead voices only adds to the overwhelming sense of death and decay).   The album's second stand alone track, ~Unforgotten~ is standard melodramatic film score material that seems a better fit in a chick flick or during some soap key moment unveiling sequence rather than for an intergalactic shoot 'em up. ~Delta Halo Suite: I.  Penance II. Wage  III. Leonides  IV. Dust and Bones~ returns to the eeriness with Trappist monk-styled chanting that leads into clanking electro-percussion. Everything is grand until a decidedly '80s New Wave sensibility infiltrates the proceedings and pulls everything into a time warp induced nose dive. In fact the early parts of the suite exemplify the glaring contrast of much of the music on the soundtrack: it's either tossing off creatively inspiring rifts on traditional orchestration or serving up downright cheesy takes on archaic forms of modern music. The latter part of the suite is all robust and intimidating, which is cool indeed.    ~Sacred Icon Suite: I. Cortege  II. Opening Volley  III. Veins Of Stone~ is appropriately eerie and here the inclusion of futuristic electronic burble and boink works to great effect. True to form, however, just as O'Donnell and Salvatori have set up a wonderful intersection of traditional orchestral score and electronic wonderment, they dash it all against the rocks with the masturbatory guitar theatrics of ~Reclaimer,~ the third and final stand alone track on the album. Again the searing Euro-trash prog metal elements surface their ugly head and blow the fuse of your imagination.   The final three suites--~High Charity Suite: I.  Rue and Woe  II. Respite  III. Antediluvia  IV. Pursuide of Truth~; ~Finale: I. Great Journey  II. Thermopolis~; ~Epilogue: I. Beholden  II. Road to Voi  III. Subsume~  again provide beguiling examples of lush orchestration and intriguing electronic interaction, with the slight exception of the Kraft coated faux jazz swerve that melts into the ~Epilogue~ without warning.   For the most part Halo 2 Original Soundtrack Volume Two is a successful example of how videogame music, especially for epic games, has risen from the depths of 6-bit plinking into the realm of serious composition. There's still a few glitches, most notably when O'Donnell and Salvatori let their obvious infatuation with glaring hair metal and early '80s electronic trappings get the better of them. When they manage to keep those urges under wraps, however, this soundtrack yields some genuinely engaging orchestral implementation.   Definitely Download:  1.~Mambasa Suite~  2.~Sacred Icon Suite~  3.~High Charity Suite~", "date": "May 5, 2006"}