{"name": "Over the Hedge", "name_review": "Over the Hedge", "ref": "https://www.ign.com/articles/2006/05/05/over-the-hedge-7", "text": "If you put Solid Snake, the Prince of Persia and Lara Croft in a raccoon, turtle, and squirrel suit, you'd get the Nintendo DS version of Over the Hedge. For a game that's based upon what's assumed is a kid's license is a surprisingly impressive and fulfilling action adventure that's not the standard fare for the dual-screen handheld. It also pushes some clever Nintendo DS functionality and looks really great on the handheld. The license is sure to scare people away, but let it be said: if you're a true gamer, give these little furry guys a spin on the portable.   It should be noted that Over the Hedge on the Nintendo DS is completely separate from the console versions hitting at the same time. Instead of the fur-flying action that's been put in the GameCube, PS2, and Xbox versions of the Dreamworks CG film, Vicarious Visions has instead constructed a completely original adventure that utilizes the Nintendo DS system's strengths for a unique experience.   The DS game is clearly inspired by the likes of Metal Gear Solid and Tomb Raider - but instead of a specially trained secret agent or a top-heavy archeologist, you've got the abilities of RJ the raccoon, Verne the turtle and Hammy the squirrel to sneak into suburbia and save their little patch of the neighborhood before it's turned into a swimming pool. Each mission requires players to retrieve specific items that will help the forest inhabitants stop the demolition from happening. Some missions are solo outings, while others are a bit more demanding and require two characters to work together in an almost Lost Vikings sort of way - switching back and forth between the two critters is as simple as tapping an icon on the corner of the touch screen.   Even though much of the gameplay's derived from other games, it's the situation and setting that makes Over the Hedge feel different and unique, and ultimately is lot of fun to play. The guys are barely a foot tall, so the human world is a literal platform puzzle to explore - players will have to climb countertops and entertainment centers, leap across strategically placed stools, chairs and tables. The house is littered with items that'll help the three complete their mission, but players will have to figure a way around the scattered hazards -- dizzying air fresheners, dart-spewing lawn gnomes, spinning plastic flamingos, and, more significantly, dogs, cats and humans --  in order to reach conveniently placed triggers that can deactivate harmful traps that block the way.   Over the Hedge has a stealth element that's similar to the Metal Gear Solid series. Players must avoid being seen so that they can get through each of their missions - the patrolling dogs, cats and humans can certainly do critters a bit of harm, so there's a lot of careful planning involved in successfully completing a round. It's the stealth element where the Nintendo DS system's second screen comes into play. While the action takes place in a third-person over-the-shoulder camera perspective on the top screen, the lower screen provides a top-down view of the same area. On this display, players can see the vision cone of any of the patrolling hazards, a handy ability since this is integral to not being seen. And since the lower screen's the touch screen, the designers use it to control targeting objects and hazards; if you want to attack someone or something with an object, just tap on it and a cursor will surround it. When it turns green, it's in range to be hit. It's a very helpful control mechanism that works well for this kind of careful game design.   What's most impressive about Over the Hedge is that the game isn't just a great looking game, it's a great looking game that's running its smooth, detailed 3D engine across both screens for more than just a gimmick. 3D running on both the upper and lower screen isn't a new technique, as games like Mario Kart have done this for its double-height pre-race cinematics. But Over the Hedge is running two completely different perspectives of the same environment, with visual detail that's close to (if not better than) Super Mario 64 DS running at a smooth 30 frames per second rate. There are occasional visual glitches and pops during the action, but nothing alarming or too distracting from the rest of the experience.   There are some quirks still in the game that bring down the game's polish. Some thrown items that are supposed to land on their target miss for unseen reasons. Players also can't look up or down in the first-person perspective, which is a little more awkward because the game's behind-the-character view is purposely angled upward to give players a scope that these critters are a little on the short side - so when players are up high on a bookshelf, not having the ability to look down on the environment is a little clunky.   Even with the slight hitches in the fun, it's clear that, even with a kids-franchise brand attached to it, Over the Hedge received a huge development focus. It's not a cookie cutter design by any means - the game had a whole lot of love and creativity poured into it. The game even features a decent amount of original full-motion video to introduce the game's situation using rendered animation. This presentation's a little bit of a tease, though, because after the first two videos the game disappointingly reverts back to the familiar and handheld-friendly text-based cutscenes to tell the rest of the story.  Just because its based on a family-friendly animated flick doesnt matter  Over the Hedge surprises with some really creative DS technology and game design that feels completely unique to the handheld library. And even if it seems like its focused on the kids market, this game is also pretty challenging with a decent length that encourages replaying and exploring the levels multiple times. Dont let a fear of the furry get in the way of you enjoying a game thats definitely one of the Nintendo DS systems more impressive titles this year.", "date": "May 5, 2006"}