{"name": "Field Commander", "name_review": "Field Commander", "ref": "https://www.ign.com/articles/2006/05/20/field-commander", "text": "First, a word on universal dweeb fantasies. Most gamers have had one at some point or another; like flying an X-Wing or walking into a blind supermodel convention. One of these fantasies, controlling a wicked-cool army, ranks as one of the highest. Just look at Command and Conquer for the PC, or Advance Wars for the GBA; wildly different titles that appeal to the same kind of fantasy. And now, Field Commander does the same on Sony's handheld.  It took a while, but PSP fans finally have a turn-based strategy game that uses almost everything the little system has to offer. And, for those who care, it's the first game to do so that ties in semi-realistic military-type units. You can choose everything from tanks and helicopters, to grunts and special operatives. The game's narrative, too, deals strictly with militaristic tales of sabotage and terrorism. You simply won't find elves or fairies anywhere near this game. And there's a great chance that a ton of people prefer it that way.    For those who want to know a little more about the story, keeping reading for a brief recap: Field Commander takes place in the future, at a time when well-funded criminal organizations have declared war on the world's governments. You've been recruited by the Advanced Tactical Legion for Allied Security (ATLAS) to safeguard the world from terrorism, black market trading and, of course, global domination. As a new field commander for ATLAS, you'll score technology and vehicles from 50 nations, not to mention legions of highly-trained operatives; they're all yours to do with as you will. Of course, the governments who fund your activities won't admit it, and they distance themselves from ATLAS through the media and press.  So that's the backdrop. But it all boils down to you and your many divisions beating the snot out of high-tech terrorists. And Field Commander definitely gives you the means to do so. The game offers more than 30 units, ranging from submarines and tanks to stealth fighters and utility helicopters. Not a bad menu, especially considering that each plays differently. No unit feels copied from another or in any way interchangeable. If you pit the wrong unit against an enemy, you may as well kiss it goodbye. Unless, of course, you bring considerable backup. And that's a totally viable strategy in certain instances. That's another story. Point being, the design and implementation of each unit makes sense within the gameworld.     As in any strategy game, success lies in how well you deploy units on the battlefield. It's no different here. It's a small field, but you'll still need to contend with varied terrain, the fog of war and, of course, enemy units. And don't forget finances. You earn cash by the number of buildings you capture, so you best secure a bunch. Each of these elements carries the same level of importance and detail as in bigger (read: console and PC native) strategy games. For instance, every unit has its own movement and vision ranges, fuel consumption and cost of production. Certain vehicles can carry troops, while others can only shoot either ground or air targets. It's a good mix of elements. It definitely dispels any notion that Field Commander isn't a serious strategy title.   On top of this, you can also command various divisions. Each has its own back story, as well as its own special attributes. As a member of ATLAS, you control The Regulars, the first division ever formed under ATLAS. Its benefits include extra power for its units when dealing with tough enemies. The Long Shots, on the other hand, benefit from advanced movement (twice the range of normal units) for vehicles and enhanced movement for ground troops as well. On the opposite side of ATLAS are the Shadow Nations. Some of its divisions include the Black Bears, who boast increased damage, and the Butchers, who can send their units anywhere on the map without incurring penalties.      For a game with as much depth as Field Commander, it certainly doesn't take long to get into the swing of things. First, a separate tutorial teaches the basics of warfare in land, sea and air scenarios. Each of these does a great job too, and they all feature full voice over narration. Even when you start the single-player campaign, certain officers will offer hints and strategy if it looks like you need it bad enough. Plus, actually moving units across the game grid isn't complicated at all. You just select the unit you want, trace its path with the analog stick, and then select its action; attack, wait, or what have you.  The rest is pure strategy. Mission objectives range from rescuing kidnapped scientists to capturing specific strips of territory. It's all very Command and Conquer-like. It would have been nice to score a little more variety in what you actually have to do to complete objectives, but it usually boils down to capturing and destroying things. Yes, that's how real wars usually pan out. And yes, it's still fun and rewarding, but variety never hurts. Usually, the more you can do the better. Having said that, there's a definite effort made to keep things fresh during Field Commander's 30-mission single-player campaign.    And should you get bored of that, you can always dive into one of Field Commander's many network modes. SOE simply nailed it when it came to multiplayer. First, hot swap mode lets you trade a single PSP back and forth between a friend. It's only for two players, but it works just fine. That's the most basic versus option. You can also play head-to-head battles over a local wireless connection. This too is somewhat basic considering most PSP offerings make use of the system's Wi-Fi functionality. But then SOE went all out and included infrastructure mode. Here, you can enter a virtual lobby, meet up with friends or random folk, and play. You can join or host a game. If you're hosting, you can set parameters such as terrain, time limit and win conditions.    Finally, there's Transmit mode, which is basically play-by-email. One player hosts a game and makes a move, and then it's up to the other player to keep it going. Think of it as a leisurely game of chess. A battle can last anywhere from an afternoon to several weeks. It all depends on when you have time to make your move. This, along with the aforementioned modes, pushes Field Commander ahead of most other handheld multiplayer titles. Sure, turn-based strategy isn't for everyone, but there's no denying the appeal in sweeping network options. Plus, you also score leaderboard rankings and an online command center, which lets you upload and rank custom created missions. Now that's tasty.    Field Commander will most certainly appeal to strategy fans. Beyond that, it offers enough depth and flexibility to warrant a look from any serious gamer. It blends an engrossing single-player campaign with great production values and a robust set of multiplayer options. In terms of performance, it chugs a little here and there, but that hardly gets in the way.", "date": "May 20, 2006"}