{"name": "Uno", "name_review": "Uno", "ref": "https://www.ign.com/articles/2006/05/22/uno", "text": "The next generation of gaming has definitely arrived. Uno is on the Xbox Live Arcade. It's the same card game you may have played as a kid, only now with the added convenience of finding opponents online. Also, there's full support for voice chat in each four player game, as well as built-in support for the yet unreleased Xbox 360 camera. Imagine the possibilities. Four Xbox 360 users staring at each other. Or, as is most likely to happen, four users making the most obscene gestures possible. Hopefully someone gets some artistic ideas and points the camera at something other than themselves or their extended middle finger.   Enough about the future. As the game stands, it's actually the most social experience you can play on the Xbox Live Arcade. It's not like you need to concentrate on lining up a headshot or listening for footsteps, you're just tossing cards into the center pile. With such a de-emphasis on gameplay, Uno opens up opportunities for players to talk about the game or whatever else. In terms of gameplay itself, Uno is easy to understand, customize, and use.   Foiled The goal of the game is to get down to one card, call ~Uno,~ and then get rid of it, netting you points based on whatever totals your opponents have left in their hands. Each card in the game is numbered and shaded one of four colors, and special cards exist as well. You'll find some that force opponents to add cards to their hands, skip turns, and reverse the order of play. Also mixed into the deck are cards that can switch the color suit in play and even do that on top of forcing more cards to be picked up. The game makes cards eligible for play easy to see by highlighting them in your hand.   Twists occur in the form of challenges, which can be issued at specific points. If a person gets down to one card in their hand and neglects to hit X to call ~Uno,~ any other player can challenge them by pressing Y. If a challenge is issued before Uno is called, the forgetful player with one card is given two more. A challenge can also be issued when a wild draw four card is dropped to check for bluffing. The bluffing option can also be toggled on or off, along with other game rules like how many cards you need to pick up should you be unable to make a play.   Though you can play offline in single player modes, it's way better to play online since conversations with computer opponents aren't that interesting. Offline you'll get two modes, either solo play against three opponents or partner play. Both online and offline modes give you the option to tweak game rules. For online games, there's a nice player replacement function that keeps games going even while people are dropping in and out. You'll also find content expansions on the Marketplace with new skins, music, and game rules.   This could eventually get ugly. Even though it's a fun, social game to play online, it's still Uno. In other words, if you hated Uno the card game, you're going to hate Uno the Xbox Live Arcade game. Assuming you like Uno, know that with the camera on the way, Uno's social aspect will only increase. Uno's statistic tracking and online leaderboards add surprising depth to this package. Plus, it's only 400 Microsoft Points.", "date": "May 22, 2006"}