{"name": "WRC", "name_review": "WRC: FIA World Rally Championship", "ref": "https://www.ign.com/articles/2006/05/24/wrc-fia-world-rally-championship", "text": "There's certainly no shortage of racing titles on the PSP - the genre may in fact be the strongest on the system. While there have been plenty of street racers to hit the system, rally racing really hasn't gotten any love. Namco Bandai has changed that with the release of WRC: FIA World Rally Championship, but unfortunately it doesn't quite cross the finish line unscathed. There aren't any crippling problems per se, but there are enough flaws to where you'll want to consider exactly how much you really need portable rally racing.   The imperfect design decisions are apparent right from the start, as you'll notice as you go to pick the vehicle that you'll take through the game's main Championship mode. You begin by choosing a manufacturer and then the model (rather than simultaneously), but the curious part is that while each car has separate stats, they aren't very well defined. For instance, every starting car has a top speed of ~220+ kph~ and will accelerate from 0-160kph in ~ 8 seconds~. The only real difference between any of these cars at the start, at least stat-wise that you can see, is torque.    Once in the driver's seat, it's apparent that the vehicles' controls don't quite feel right - the driving sensation reminded us more of a high-powered go-kart or an RC car. That's not to say that the game isn't fast, as that's not a problem at all, but the cars control and handle more like an old-school racer from our 16-bit days than the more realistic models we're accustomed to. They're rather touchy, possibly due in part to the PSP's analog stick (or nub), and they also don't feel like they have a ton of weight to them. Sure, you slide plenty enough around turns, but accelerating, decelerating and turning simply feel very arcadey, but not necessarily in a good way.   The courses themselves, which are said to be modeled after real-world rally courses, are extremely brutal, not necessarily by overall design, but because of how the game's physics manage your car on the track. It's rather easy to flip your car over as there are small pieces of land that jut out into the courses almost everywhere, and hitting any of these acts like a miniature ramp.   What certainly doesn't help is that your navigator (the guy that calls out upcoming turns) is only somewhat helpful. He calls out every tiny turn, even if the road is almost completely straight, so many times it's hard to tell exactly which turn he's talking about. On top of this, he seems to call out turns simply based on a predefined (and never-changing) distance, irregardless of speed. So if you're taking a really tight chicane rather slowly, everything's fine, but if you're speeding along at 200kmph he'll often call out sharp turns way too late.    Another issue with the races is that you begin each and every outing at a major disadvantage. Rather than being solely time-based, as rally racing should be, you actually need to beat the ghost cars of the other racers on the track, most all of which start out way ahead of you. You always begin in the last third of the pack, so even if you're able to overtake first you likely won't be able to until very late in the race. It very much feels like an uphill battle rather than a fair race, and it makes racing on anything but the Novice difficulty a trial in frustration.   But while WRC does certainly have its fair share of problems, it also has quite a few redeeming values. For one, even though the cars don't feel like real rally cars and the physics can make navigating the tracks difficult at times, the game can still be a decent bit of fun. The controls are responsive and the game is fairly fast, so even though you're always trying to come from behind and you might flip your car or whatnot every now and then, it can still be fun to race.   The game also sports some pretty nice visuals. Your car will accrue dirt and grime over the course of a race, and running into things will bend and rip parts from your vehicle. Trackside detail is pretty good with tons of foliage, bystanders and random bits of scenery filler, though some of the actual track detail itself can be rather low-poly at times, which is possibly part of the ~insta-ramp~ problem.WRC: FIA World Rally Championship has a few nice bits about it, but these are largely outweighed by its negatives. It can be fun to drive and the game looks nice, but you're also playing catch-up rather than fairly racing against time, it's easy to hit a small piece of land and flip or spin your car and your navigator is only of modest help. Rally racing fans may find something to like here, but more generalized racing fans should look elsewhere.", "date": "May 24, 2006"}