{"name": "Army Men: Major Malfunction", "name_review": "Army Men - Major Malfunction", "ref": "https://www.ign.com/articles/2006/05/25/army-men-major-malfunction", "text": "Global Star Software is not having a good week at IGN. Charles Onyett just reviewed Classified: The Sentinel Crisis, a terrible first-person shooter that takes the dubious honor of receiving the lowest score for an Xbox game in 2006. And today, I have the pleasure of reviewing Army Men - Major Malfunction, a third-person muddled by terrible controls and camera work. Will the latest in the Army Men franchise replace The Sentinel Crisis as the worst Xbox game of the year after only one day? No! Despite terrible gameplay and sound, the graphics of Major Malfunction aren't completely awful and, at one time, we used to enjoy those Army Men titles.    The hook in this game is definitely not the story. An evil toy force named Major Malfunction has taken over the house, and it's up to you and an array of different weapons like flame-throwers and assault rifles -- some with power-up secondary fire modes -- to dispatch the enemy force. So, yeah, there's no real story here.   Guns don't kill toys; Toys kill toys. The graphics in Major Malfunction are the bright spot in this title, but that may only be because they are in stark contrast to the other terrible elements of the game. There's a bit of ~Honey, I Shrunk The Kids~ here as you, a lowly private in the Army Men force, work your way through various rooms in the house, fighting killer toys while using cereal boxes as cover. One of my favorite levels is fighting your way through the kitchen after a children's Halloween party. You'll jump over plates of Halloween cake and banners that decorate the room and use a grappling hook to traverse kitchen drawers and counters. We got a kick out of that because we're big fans of the Giant Land in Super Mario Bros. 3. There are plenty of animation hiccups and clipping issues. Your private is able to jump at ledges and hoist himself up, but a lot of the times half of his body ends up disappearing into the object before reappearing at the top.    Major Malfunction suffers in the control department. There are a few decent touches, like having the ability to lock on, strafe enemies and roll in four directions to evade enemy fire. Unfortunately, there is no way to manually aim without using the lock on mechanism with the right trigger. On a lot of the enemy toys, there are weak spots that you need to hit. Without being able to manually aim, you need to run directly in front of these weak spots and then pull the right trigger. Hopefully you lock on. Sadly, there's no way to change targets while locking on -- you need to let go of the right trigger and try again. Most of the time, however, you'll end up locking on to the same target over and over again, making you want to go play Sentinel Crisis, God forbid.     The camera is equally bad. Moving right on the right analog stick will move the camera left, which is immediately counterintuitive, but thankfully there is an option to switch this. Still, there are more than enough times where the camera is stuck behind an object or refuses to move in the direction you want and you're stuck with an awkward angle.    The sound in Major Malfunction is forgettable, suffering from terribly repetitive sound effects. There is a bit of muffled voice acting in exchanges between the private and Sergeant, and it's laughable. It sounds like Charlie Brown's parents being smothered by a pillow and, while not as cute as The Sims, you'll have a good reason to chuckle the first few times you hear it. After that, you'll want to turn it off.   Run if you want to live. The level design isn't particularly clever, but it is mildly enjoyable to run through a giant house. Still, the short levels and stupid enemy toys combine for terribly repetitive gameplay as you'll basically shoot enemies, do a bit of platforming, shoot some more stupid toys and then the level ends. Queue Charlie Brown's parents, a simple mission briefing, a load screen and then do it all again, 30 times.  We like Army Men as much as the next guy, which is probably not that much, really. The concept of little plastic man fighting giant toys in a huge, oversized house is sound and brings to mind battle scenes in Pixar's Toy Story. But poor presentation, the lack of any multiplayer modes, repetitive gameplay and frustrating controls doom Major Malfunction from the very start. Little kiddies may enjoy the game, and you may enjoy the $15 price tag, but don't buy this game to tide you over until Gears of War. In fact, don't buy this game to tide you over until anything.", "date": "May 25, 2006"}