{"name": "Beavis & Butt-Head: Bunghole in One", "name_review": "Beavis and Butt-Head: Bunghole in One", "ref": "https://www.ign.com/articles/1999/02/02/beavis-and-butt-head-bunghole-in-one", "text": "The two puerile hornitos are back on the PC, lending their names and voices to Beavis and Butt-head: Bunghole in One.  While Bunghole in One may turn up some mighty freaky subjects on an Internet search engine, this title from GT Interactive is nothing but a harmless miniature golf game ... if you consider hitting balls with a steel putter harmless.  I'm not even going to touch that one.  When the game begins you're presented with the opening sequence directly from the show, complete with voice-over and bluesy guitar track.  You probably already know the routine. ~Beavis and Butt-head are not role-models.  They're not even human.  They're cartoons.~ And so on.  Take this warning to heart kids. After the opener, you're presented with a camera fly-by of the entire course and simple menu system with few options to choose from.  This is miniature golf, only miniature golf, and nothing but miniature golf.  Don't expect anything more.     About the only option you really need to be concerned with is the how many people are playing.  You can choose from 1-4 players, with everyone putting on the same computer.  It's simple and to the point. Obviously you can opt to play as either Beavis or Butt-head, but you can also choose from Tom Anderson, Mr. Van Driessen, Principle McVicker, or 'Cool Guy' Todd.  Unfortunately, for those of you unfamiliar with the series, there's absolutely no description of these characters either in the game or the manual.  Not that there's any difference in their play styles, but you'll have no background on who they are if you just pick up the game without knowing anything about the show.    After you pick your player, it's off to the course. You'll make your way through a variety of odd holes influenced by the show, including Beavis and Butt-head's living room, Todd's garage, Mr. Anderson's backyard, and Burger World.  The back of the box promises ~18 gut-busting, hilarious holes~ of mini golf.  Well, I wouldn't really describe them as gut-busting.  I didn't fall out of my chair laughing each time a new fly-by of a hole popped up (it's just miniature golf after all), but the holes are fairly well designed and offer a challenge to the beginning player.  Scratch that ... they offer one hell of a challenge.  I shot a 71 over on my first 18 holes.  Ok, I don't claim to be the world's greatest mini golfer, but 71 over is just ridiculous.  While some of the difficulty can be blamed on the wonky control system (it's a lot like a pinball machine plunger ... pull back and let 'er rip), much of the problem lies with hole design.  There are lots of hazards on each hole, ranging from water to mines.  Unfortunately, many of these hazards look like secret holes so you don't know what to avoid and what to shoot for until you play each hole, so the course becomes much easier after you play it a second time.  I improved my score from 71 over to 23 over (ok, so 23 over still isn't that great, but I guarantee you any golfer that shaved 48 strokes off his game after one try on a course would be happier than Bozo after he won the lottery).  I can understand that the course designers wanted to add some playability to this title, but a better way of doing it would have been to add additional courses rather than making the only course incredibly difficult.  Like the cartoon, Beavis and Butt-head: Bunghole in One is a game that relies on sound bites more than visual expertise.  The holes themselves are fairly sparse and the graphics aren't all that great, but the voice-overs are well done and generally humorous.  Unfortunately, the characters repeat themselves way too much and there's only so many times I can listen to Butt-head saying, ~Your balls are filthy~ without feeling thousands of braincells simultaneously evacuating my head ... and everybody knows that beer is a much more enjoyable way to do that.     When it comes down to it, there's just not that much here.  Sure, Bunghole in One offers quite a challenge for beginning players, but the novelty of Beavis and Butt-head wear off way to quickly to make this one much fun.  And I don't even think diehard fans of the show will get much out of this one.  -- Tal Blevins", "date": "Feb 2, 1999"}