{"name": "The Hustle", "name_review": "The Hustle: Detroit Streets", "ref": "https://www.ign.com/articles/2006/05/26/the-hustle-detroit-streets", "text": "I've said it before and I'll say it again -- I love pool. I don't play it as much as I used to these days, but when I do, it's still thrilling. The playing field is constantly changing as balls knock into one another and create interesting gameplay opportunities. So when I saw The Hustle: Detroit Streets was made for consoles, my interest was perked, again. A fully-realized video game about pool sounded exciting when it came out on PSP, and it still does. Unfortunately, the game is rather lackluster, even though it's made for consoles this time around.   The story of The Hustle is still the same for the most part. You're basically that of a down-and-out pool hustler who's trying to find his way back to notoriety. It's something like the movie Rounders, except there's no John Malkovich. There is in fact a card game you can play and gamble in as a kind of mini-game for the rare moments you get tired of pool (as if that's even possible). There's poker, blackjack, roulette and slots throughout the various venues you visit. But the main game of The Hustle is to play pool games with menacing people and take their money.   Although I heard this was the same game as the PSP version, I was still hoping that maybe the creative would innovate a little bit. I wanted a ~hustle~ element to the game play of The Hustle. But alas, you still simply make bets and try your best to win -- pretty straightforward. There are indeed tons of different pool games to play: 8 ball, 9 ball, 6 ball, 10 ball, 3 ball, Straight Pool, Bank Pool, Rotation Pool, Bowliards, and Snooker. With that in mind, the game is pool simulation. But the fact that you're betting money gives The Hustle its distinguishing features.   Characters will challenge you to various games of pool for different amounts of money. You basically work your way up the ranks this way, taking the games you want to play, and winning them. Eventually you'll meet actual boss characters. You might encounter shady undesirable likes Aleya, Steele, and Chief. But you've got to have enough cash and respect to take on these sharks. If you beat them you get to move on to other venues.   The game play mechanics still function the same way. By taking the easy meter-tapping approach that games like Hot Shots have incorporated for some time now, pulling off a shot in The Hustle isn't hard at all. One option allows you to gauge the power of your shot by dialing it up or down. The strength is indicated by a meter on the left of the screen. Next to that meter is another meter with a little marker sliding up and down. In the middle is a white zone. The idea is to tap the A button the moment that marker slides over the white zone. Accomplishing this determines the accuracy of the shot you're taking. The other option is called Instant Shot, and it allows you to use the right thumbstick. You pull back on it to determine the power, and move it forward at the instant the marker moves over the white zone.   There are two bars at the bottom of the screen for each person playing. The red one is called the Intimidation Bar. This meter basically shows how scared or confident the players are. As players sink shots, their intimidation decreases, and as they miss, it increases. The more intimidated someone is, the faster their marker will move in the Accuracy meter, making it harder to nail shots. This element nicely simulates the psychological game of pool, and I can still appreciate it.   The green bar gauges intuition. As players make shots, the instincts of that character grows. The trickier the shot is, the more intuition is gained. You can then spend this intuition juice on special shooting options like Aftertouch and Dead Eye. Aftertouch allows you to control the spin of the cue ball after you've hit it, and thus control its path a bit. This hot little feature gives those who want to master the virtual game of pool the tools to do so. You can make some pretty crafty shots this way.   If you're in a tough spot and need a little help, you can call on Dead Eye using your intuition juice. He's a sort of a Mr. Miyagi of pool, except he looks more like Sean Connery. You simply pause the game and select Dead Eye, and this mysterious character will show you how to make complicated shots. You even get an opportunity to practice the shot before you go back to real game. This is simply a cool way of giving beginners in-game tutorials. Plus, it's fun watching Dead Eye make those spectacular shots.   Thankfully, the transitions between the in-game animations have improved, so I don't have to turn them off in order to enjoy the game. I actually like watching them now because they really help build the atmosphere. If you're still bothered by the animations, you can turn them off. They do get a bit clumsy at times when you see characters walking into one another. The game does move a bit faster without them in there, but the user gets a much drier game.   Somehow, the music isn't as nerve-racking as it was on PSP. It also helps that you can upload your own custom soundtrack in this version of the game. But the crowd outbursts are still obnoxious. Throughout the game, people in the crowd will yet out things to throw you off like, ~Are you holding the stick right?~ and my most hated, ~THIS IS BULLSH**!~ I'll give them the fact that there's nothing quiet about pool. But anyone yelling like the way the people in the crowd are in The Hustle would get their ass whooped. As with the PSP version, this still doesn't add anything especially challenging to the game you're playing, except for maybe challenging your resistance to throw your controller through the TV.   You can take the hustle online if single player gets lonely. The Character Edit feature lets you customize your character to look as grimy, or unthreatening, as you want them to look. Everything from their gender to their facial expression is within the player's control. There will even be opportunities to unlock various clothing items. It's neat to have this option and makes the game a bit more wild.   The Xbox version makes use of Xbox Live and you can do voice chat with the headset. There's also a High-Def output setting in 480p. So that gives the Xbox version of the title a slight advantage over the PS2 version. The Hustle was an interesting experiment on PSP and still feels stuck in the experimental phase. The character models are ok looking, but not great for PS2 standards. They look even worse when theyre walking through one another. But The Hustle still has plenty of great ingredients to work with. I would definitely like to see a next-gen attempt at this franchise. The game itself is solid enough. The screws just need tightening. The cutscenes look pretty amateur. Overall slicker presentation could make this game really worth playing the next time out.", "date": "May 26, 2006"}