{"name": "Dino Master", "name_review": "Dino Master", "ref": "https://www.ign.com/articles/2006/05/27/dino-master", "text": "Dino Master is one of the most misleading games in the history of the Nintendo DS. By the box art and the description on the back of the case you'd think you'd be getting this exciting Jurassic Park-inspired paleontology-meets-DNA engineering-meets-cockfighting, with a little Pokemon mixed in for good measure. But no - Dino Master isn't much more than a horrible, sloppy remake of the classic Taito arcade game Qix with a crude and sloppy rock-papers-scissors multiplayer mode thrown in. It's not a disappointment that the game doesn't meet the expectations laid out by the game's box - Dino Master is just a terrible game on its own, no matter how it's been packaged.   It's not uncommon to play current games that lift inspiration from past games developed by other companies. In the case of Dino Master, Taito's taken its own old-school game Qix - a quirky and stylized ~draw lines~ action design - and, for whatever reason, wrapped it around a theme where you're a paleontologist digging up creatures of the past. It really makes no sense in the context it's been placed, because the game never explains the gameplay right from the start -- players are expected to work their way through the action levels with absolutely no instruction or training beyond what's in the instruction booklet.    So here's the game in the nutshell: using the stylus, players drag a vehicle around the perimeter of a playfield that's more than a few screens tall and wide. By drawing lines within the playing field and connecting them to the borders, players ~dig up~ those marked squares and claim the ground as their own. Claiming enough percentage of the playing field will move players onto the next round, but to do this they'll have to avoid getting hit by the enemies bouncing around the danger area. As long as the player's on the hard edges of the field they can't be harmed - only by wandering into the playfield can they get hit. If an enemy touches the line drawn by the player, it'll send a shockwave towards the player - if he can't complete the square in time, the player's dead.    The original idea in its original Qix form was a great and challenging pick-up-and-play design. It would have probably worked for the Nintendo DS but the designers absolutely ruined it by requiring stylus control. Players actually have to drag their on-screen player around to draw the lines, but since the line can only be drawn at 90 degree angles and, more importantly, at the speed of which the character can move (it's not a direct draw game like Kirby Canvas Curse or Pac-Pix), it feels unbelievably disjointed to play. The on-screen personal will sputter along and get tangled up simply because the player's stylus is moving too fast or not straight enough on the touch screen. A classic game is completely wrecked because of the insistence of touch-screen control - other than some stray touch-screen attacks incorporated in the design, there's no reason why the designers couldn't just go with traditional D-pad control. They should have, and that's the bottom line.   Now, to keep player's interest, the designers throw in a ~gotta catch 'em all~ element: dinosaur bones. You'll find massive fossils by claiming the areas on the playing field, and if you secure all the land that the fossil's spread along, and complete the level, you'll ~own~ that fossil. Your performance in the arcade game will also reward you special abilities that can be used in this dinosaur collection mode. Sounds promising so far.   Taking these bones into the Dino Rebuild mode will, essentially, pull a Jurassic Park on these guys and bring back the specific dinosaur to life. Some dinosaurs are rare, some are common, and any dinosaur you snag and revive will be written to the game's ~pokedex~ so you can track your progress and collection. And what's more, these dinosaurs can then be used in battle! Sounds pretty sweet, right? Dino vs. Dino action is what this game promises, and over the DS system's wireless functionality.   But then you actually get into the Dino Battle mode, and then you realize what a waste it all is. It's a glorified roshambo, where players simply choose an attack zone on the opponent's dinosaur, and a defense zone on their own - occasionally using some power-ups snagged in the arcade mode to spice things up a bit. Bigger dinos are stronger but have way more zones to attack, so there is a little strategy involved - but it's mostly a luck-of-the-draw thing. And not very compelling considering the art style - dinosaurs don't even animate, they just slide around as cutouts on the dual screen displays.   In fact, almost all of Dino Master can be considered ~ugly.~ The terrible looking background graphics in the arcade mode are totally overstated and not needed, filling the playfield with non-interactive structures, lakes, rivers, trees. They look like they're hazards that are meant to get in your way, but in reality they're just there to fill in the blank spaces. The audio fares just a tad better than the visuals, but there's nothing here that you'll notice as catchy or headphones-worthy.  Anyone who thinks that any game coming out of Japan is a golden treat should go ahead and pick up Dino Master to squash that mentality right now. Western developers aren't the only game builders guilty of creating crappy videogames, and Dino Master is absolute proof of this. A classic arcade game is absolutely destroyed by horrendously clunky and totally unnecessary touch screen controls, and no amount of Pokemon-style collection can save it.", "date": "May 27, 2006"}