{"name": "A Bug's Life", "name_review": "A Bug's Life", "ref": "https://www.ign.com/articles/2000/02/09/a-bugs-life", "text": "A Bug's Life may have succeeded in theaters, but THQ should have done a few things more to make the interactive version at least better than average.  Thanks to Pixar, the movie was full of lovable characters and brilliant computer graphics.  What about the Game Boy game?  It's nothing more than a basic platformer minus the fun. Features: Based on the Disney film Nine levels Password feature For Game Boy and Game Boy Color    A Bug's Life follows the same basic plot as the movie.  As the small ant Flik, you are encouraged to leave your colony for spilling a bowl of grain.  You go to the City to find some large bugs for protection against Hopper, a grasshopper who is using his minions to take food from your colony.  Instead of warriors, you hire circus bugs and attempt to free your colony from Hopper and his gang.  As you start a new adventure, you're off to collect items for your Harvesting Machine.  The first level is as easy as they come, and the way the game functions is like any other platformer.  Jump with A, attack with B; it's not complicated.  Dangers that get in your way here are bees, grasshoppers, and worms, along with water, none which are too perilous if you watch your way.  The only other basic enemy you'll encounter later in the game is a wasp -- there isn't a lot of variety.  To defeat an enemy, you have to fire berries from your reserve.  Sometimes berries are scarce, but they fall from certain trees throughout the stage and game.  Like any other side-scrolling action game, A Bug's Life has items which replenish lost health and which give you ammunition.  A health berry restores life, a bean gives you 3 berries, and a raspberry does both.  Other than the common recovery/ammo items, things you will collect are pieces to the Harvesting Machine and pieces to the Mechanical Bird.  Unfortunately, there is no way for you to get an extra Flik at all, neither through collecting points nor finding objects.  This is an action game, isn't it?  A Bug's Life is ho-hum and boring.  If you've picked up a Game Boy, you've been here and you've done that.  THQ didn't go out of its way to bring the best, and it shows through disappointing levels and uninspired design.  Most stages are similar in composition and style, and even when there is a change of pace, it's not enough to save it from feeling undesirable to play.  For example, Level 6 has you flying on Dim, a big beetle.  It's different in comparison to the normal ~find these items and get to the end~ feel, but it just doesn't do enough.  The Bonus Stage is another attempt to help ease the dullness, but it doesn't do very well.  If you've collected all of the pieces to Flik's Harvesting Machine, you are able to play the harvesting game at the end of the first level.  Here, you move back and forth through the grain, ~mowing~ it with your device until either time runs out, you hit a bee or worm, or the entire crop is gone.  The more you harvest, the bigger bonus you get.  Once the bonus round is over, it's time to move on to the next level where more tediousness awaits.  Aside from the menus, which look nice, the graphics are plain and dull.  There are leaves and grass around, but unless it's an obstacle like a rock or water, there's not much to see.  A Bug's Life could have made better use of the Game Boy Color palette, but just turns out looking uninteresting.  At least THQ Tiertex included some FMVs of their logos; they're the best-looking parts of the game.  The music and sound effects are likewise drab, and don't give much of an overall pleasant atmosphere.   All in all, this game is short and repetitive.  What is there to say about it that is good?  Not a thing I can think of, and shame on you for it, THQ.  The creatively-challenged designers didn't do a great job, and it amounts to an unappealing experience.  Nearly every part of this game is borrowed from another and pieced together just to make a Disney-licensed title.  In addition, completing your objectives is monotonous and unsatisfying -- the only real break you'll get from this game is by turning it off.  Final jurisdiction:  Below average.", "date": "Feb 9, 2000"}