{"name": "Shadowgrounds", "name_review": "Shadowgrounds", "ref": "https://www.ign.com/articles/2006/05/30/shadowgrounds", "text": "Although innovation is certainly a good thing, there's a lot to be said for familiarity. ~Different~ doesn't necessarily mean ~better.~ Shadowgrounds takes a page from Smash TV, offering an overhead view of explosive chaos. But the game also draws from films like Aliens, Event Horizon, and even Independence Day. Also the cutscenes are a little rough around the edges technologically, but the camera work and soundtrack overcome lumpy budgetary concerns to create something that's better than you'd expect.   Even if you've somehow not seen the aforementioned films, you probably know their stories by osmosis at this point. A distant human outpost experiences some technical difficulties that rapidly escalate into alien invasion, and it's your job to try and stem the tide before it reaches Earth. This requires repairing satellite dishes, putting power plants back online, rescuing civilians, and reading lots of PDAs and computer monitors. And killing the crap out of any beastie who gets in your way.     So in this sense, it's more than just a mindless blow-em-up carnival ride. There's actually a logical progression that leads you from one location to another, and an increasing importance to your mission. Besides the main character, however, the voice acting isn't that great. Tyler, with his wry swagger in the face of mortal danger, sounds eerily like Bruce Campbell. It's too bad that the other characters do a lot more chattering than him. On the other hand, conversations are delivered in occasional chunks of exposition, and the sound design otherwise shines.   I know music taste is relative, but I thought the scoring here was quite good. Shadowgrounds benefits from excellent ambient sound and music, beast noises, and weapon sounds. In the key battles, the music kicks into high-energy, chunky guitar rock. When you're wandering your way down the dimly-lit halls of an abandoned research station, and your flashlight and the lightning outside are scattering freakish, intermittent shadows, it's a sad, orchestral theme. The music doesn't change dynamically, but I thought it was quite good. All the creature types have distinct idle noises -- growling, snarling, screeching, ragged breathing -- so you can hear them around the corner or in the shadows. It's too bad that they generally look like something straight out of a Giger painting, because that's been done and done again. But at least there's variety, and tactical adjustments have to be made as the game progresses, and things get pretty complex when you face blends of different kinds of creatures.     And you have a varied arsenal to deal with those varied threats. Shadowgrounds features ten weapons, from a surprisingly powerful and useful pistol to a grenade launcher, flamethrower, minigun, and more conventional weapons. Each weapon has three upgrade slots, but they don't just make the weapon do more damage. In fact, each weapon has upgrades that complement its specific capabilities. Your shotgun can have its reload time decreased, and you can mod it to fire a burst of shells in one click. The latter is an alt fire, which you use simply by hitting the right-click button instead of the left click. Every weapon has a powerful alt-fire, but that mode also uses a lot more ammunition.     The minigun can have its spin-up time halved, and you can make it fire heated plasma instead of rounds, doubling its damage. Earn these upgrades by getting upgrade parts, a currency of sorts that's randomly dropped by the beasties you kill. The costs generally ramp up with each new weapon, so you may find yourself wondering if you should increase the size of your pistol mag by a third, or hang on to those parts in case a really cool weapon comes along. Either way, though, parts will be widely available on medium difficulty, so it becomes more a matter of what upgrades you want first, rather than choosing just a few weapons to beef up. Creatures don't respawn, but they drop the parts fairly often. Unfortunately, the cutscene script will often kick in before you can collect all the parts.   Speaking of respawning, you'll be given five lives per level, with no auto-saves or manual saves. For the most part, I found this manageable, since you're resurrected right nearby where you died, but it would be nice to bookmark my progress before a big encounter, of which there are many. The game will throw some pretty difficult enemies at you near the end, in large numbers, and the last fight is particularly difficult if you haven't stocked up on ammo for your heavy weapons.     I was able to go through most of the game by switching between the assault rifle, laser rifle, and sometimes shotgun, but each weapon is handy for certain situations. The grenade launcher is great for clusters of enemies, especially when you mod the grenades to break into clusters, and a couple of the other weapons are downright punishing. You'll be able to walk around with a Quake-sized armory on your back, and a stockpile of ammo for each weapon -- this is not survival horror. At the same time, though, since enemies and supplies don't respawn, you have a limited amount of punishment you can dish out -- and take.   While Shadowgrounds has some great atmosphere, thanks to both a great sound palette and good-looking engine (that runs smoothly even when cranked up), it's often too easy for its own good. The approach of the game feels suited to survival, but the gameplay itself is more Smash TV than anything else. Once you get into the groove and start understanding how the game thinks, it becomes pretty easy to keep your distance from the enemy, avoid ambushes, and use cover to minimize exposure to just about anything. There are also enough upgrade parts in the game to drastically improve pretty much every weapon you'll get your hands on, which reduces the appeal of replayability. There's co-op for up to four players, but it doesn't work over a network. Instead, you play on the same computer, with one player using the keyboard and mouse while the others use gamepads. While this is better than sharing the keyboard, it seems counter-intuitive for a game with Steam distribution.     Shadowgrounds is one of those games you should play with headphones, at night, to get the full effect. In the right atmosphere, its lighting, sounds, and combat are satisfying, even though the creatures and setting aren't very original and voice acting is generally flat. Perhaps if it had exchanged my piles of ammo for save points, the challenge meter could have stayed consistently high. Instead, after a few hours, combat becomes repetitive, once you get in that groove. I would say that it's best suited to short play sessions, but the lack of save points, even hard-coded quicksave locations, puts a nix on that.   The experience just isn't deep enough to sit down for as long as the game's mechanics require you to, nor is its story especially well-told. The twist at the end is a refreshing touch, but the game's budget can't really allow for a compelling script with satisfying resolution. Shadowground's biggest weakness is that there's a lot of story, but we've heard most of it before in one sci-fi flick or another, and the voice acting (besides the main character) and animation just aren't up to the task. Shadowgrounds is an ambitious work and admirable accomplishment for a small developer, but it's not as rewarding as it could have been.  The experience just isn't deep enough to sit down for as long as the game's mechanics require you to, nor is its story especially well-told. The twist at the end is a refreshing touch, but the game's budget can't really allow for a compelling script with satisfying resolution. Shadowground's biggest weakness is that there's a lot of story, but we've heard most of it before in one sci-fi flick or another, and the voice acting (besides the main character) and animation just aren't up to the task. Shadowgrounds is an ambitious work and admirable accomplishment for a small developer, but it's not as rewarding as it could have been.", "date": "May 30, 2006"}