{"name": "Kao the Kangaroo Round 2", "name_review": "Kao the Kangaroo Round 2", "ref": "https://www.ign.com/articles/2006/05/31/kao-the-kangaroo-round-2", "text": "When looking at the gaming industry at a glance, there are a few franchises that make up the bulk of top-tier classics.  Names like Mario, Zelda, Kirby and Metroid come to mind from Nintendo, and games like Ratchet and Clank, Jak and Daxter and Sly Cooper follow suit on PlayStation 2.  Aside from the big league licenses, however, there seem to be a never-ending stream of under-card characters as well.  Licenses like Tak, Ty the Tasmanian Tiger, Spyro and Kao are just a small list of original properties that aren't quite high enough on the list to play with the big boys, but still attempt to deliver a fresh take on licensed gaming.     Kao the Kangaroo Round 2 takes a ton of classic gameplay methods, mixes them into its own design and attempts to deliver an entertaining package at a budget price.  Though it serves up a huge variety of platforming gameplay, the budget feel of the overall product won't end with just the price tag, as Kao the Kangaroo Round 2 lacks the refined control and polish of better attempts in its class.   The premise for Kao the Kangaroo Round 2 is amazingly simple.  Kao's friends are being captured by the evil hunter Barnaba, so with the aid of his allies Parrot and Firefly, Kao must explore multiple worlds in an attempt to set his friends free.  The story is basic, focusing mainly on Kao's progress as he collects 3,000 coins to bribe the doorman of Barnaba's fortress and eventually take the evil hunter down.  It's a bit odd, but like all platformers the story takes second seat to the action.  Players will control Kao, traveling from level to level in a semi-open-ended world.  Each area has multiple collectable items which will be needed to gain access to later levels, as well as power-up Kao with added abilities.  The entire game has a very simple core design that we've seen countless times, as players will collect crystals which unlock new doors to varying worlds.  The more crystals you find, the farther you progress.    Even though the 3D platformer genre may be done to death over the years, we've still got a soft spot in our collection for countless hop and pop games.  They may be a dime a dozen, but every once in a while a game like Daxter for PSP or Pac-Man World 2 comes around and manages to impress us all over again.  In fact, the design of Kao the Kangaroo is actually quite ambitious, as players will travel through a ton of different worlds, upgrading their character's skills, and traverse through a ton of different gameplay styles.  In just a matter of minutes we were doing basic platforming, sliding down slippery slopes, dashing away from a ravenous bear in Crash Bandicoot style levels, and herding badgers into their caves in mini-game fashion.  Gameplay is varied and, while hardly fresh, sometimes fun.    Variety isn't everything, however, as Kao lacks the polish that is needed to really be recommended as a solid platformer, even at the $19.99 price point.  There are a ton of odd gameplay elements, such as poor collision detection on the environments and enemies, somewhat cheap enemy attacks and an overall unbalanced damage system.  Since Kao is a children's game the designers opted to give the player infinite lives, but some of the areas are far too hard for the younger audience in the core design.  When navigating some rapids in one level, for example, half of our life bar was depleted for hitting the embankment once, which is extremely harsh.  There are also numerous areas that require perfectly timed double-jumps or amazingly fast reflexes to take out enemies which seem overly difficult for the game's target audience.  Boss battles can be a bit complex as well, and the overall feeling of the game is just far too rushed. The result is an ambitious budget title that lacks the necessary polish and balance of a top-tier product.          Aside from an overall lack of finality, Kao the Kangaroo Round 2 is also hurt by the simple fact that we've already seen every style of gameplay it showcases.  The design offers a ton of different scenarios but they're all the same rehashed mechanics found in countless other games.  The entire production screams ~generic budget title~ in nearly every way.  Players can jump, double-jump and butt-stomp just like any other game with no serious gameplay overhaul.  Levels include a water area, forest area, spooky dark area and ice area, littered with environment-specific enemies and tasks which resemble nearly every other platformer before it.  We understand that there's only so much you can do with a budget license, but the combination of generic play areas mixed with the same stagnant gameplay makes Kao the Kangaroo Round 2 a title that will easily get lost on store shelves, rather than standing out as a must-have 3D platformer.   In fact, the overall generic feeling Kao provides seems to encompass every part of its production.  Character designs are extremely bland, inspired from multiple franchises over the years with very little artistic flair added from the norm.  The level design is hit and miss, offering entertaining concepts one minute teamed with overused gameplay the next.  The audio production is generic and lackluster, using audio tracks and sound effects that scream budget production.  The visual experience is quite average as well, as models and textures have a dated look for its respective systems.  Anyone looking to experience widescreen, progressive scan or Dolby Pro Logic II will be let down as well, as Kao delivers only a straightforward adventure without all the bells and whistles of others in its genre.    Kao the Kangaroo 2 combines the same generic gameplay weve seen time and time again and delivers it at a budget price during the tail-end of this generation of consoles. While the design was obviously geared towards kids, Kao still lacks the necessary polish to be recommended, even at its price, and the overall difficulty may prove it to be a bit too harsh for its audience. The characters and environments are amazingly generic as well and the graphical and audio production is simply average. It may ask a significantly smaller price than many of the other games on the shelves, but players interested in an addictively entertaining platformer would be better suited to pick up something like Super Mario Sunshine or Jak and Daxter, as they deliver some of the strongest pure 3D platforming this generation.", "date": "May 31, 2006"}