{"name": "Monster Hunter Freedom", "name_review": "Monster Hunter Freedom", "ref": "https://www.ign.com/articles/2006/05/31/monster-hunter-freedom", "text": "The Monster Hunter series appeals to a very specific gamer. It's not your typical role-playing game with plot twists and a bunch of complex characters. It trades almost all of that for an experience aimed exclusively at collectors. And that's precisely what made the first few titles in the franchise, Monster Hunter and Monster Hunter G, so popular. It catered to this niche of virtual treasure hunters in a way that few games had before it.   Monster Hunter Freedom is the first game in the series to hit the PSP. And just like its predecessors, it shoots for a decidedly niche approach to the RPG genre. It swaps dramatic story arcs and characters for a no-nonsense hunter who wants nothing more than to be the best in the world. There's no serious love triangle or universal threat. Instead, it's just you, your gear and hordes of beasts on your 'to do' list. Freedom literally has only two kinds of beasts: the kind you've slain and the type waiting for you to slay them.    You start the game in typical RPG fashion. No, you don't have amnesia, but you do wake up in a quaint village and talk to the village elder before starting your journey. This preliminary conversation doesn't take very long, thankfully, and you don't need to wait long before leaving the village. Still, you need to get your bearings and locate the many shops and merchants scattered about your hometown. Also, you need to run back to your humble abode to gather your weapons and armor before accepting your very first quest.   Quests in Freedom split into two categories. The first, and coolest, are hunting quests. These have you roam the countryside in search of specific beasts to kill. And while running around butchering animals may sound simple and straightforward, it actually forms a bulk of the depth in the game. Fans of the console games will definitely appreciate the flexibility in Freedom's hunting system. It's practically identical in terms of what it lets you do. This isn't a stripped down version of Monster Hunter for consoles.   It's the real deal. But it's still not perfect. Freedom suffers from lengthy load times and very long quests, which simply shouldn't exist in a handheld title. And yes, just like in previous versions, the game tends to move slowly. This includes the way characters walk and run, and also how they attack. More importantly, this pacing permeates most of the quests as well. It's just not a fast moving game, and that's ok. In short, it's Monster Hunter...portable.     Fans already know what to expect. You head off in search of specific beasts and slay them. That's the gist of it. And at first, that's about all there is to it. Play a while, though, and you quickly find out there's plenty foresight and strategy needed to bring down the game's toughest creatures. Sure, you need the right equipment (weapons and armor) but you will also need to learn the behavioral subtleties of each species, as well. And sometimes that's not even enough. That's when you take what you know about an animal's behavior, your skill with weapons, and then throw in traps.    These vary in complexity, and some honestly seem quite simple, but it does lend the game a sense of depth that it just wouldn't have otherwise. It actually feels like hunting, in other words. And since you will spend most of your time doing it, then, that's none too shabby. Some of the later quests do feel a tad ridiculous, in terms of difficulty. Along the same lines, certain hunting quests just take far too long to complete. It's possible to spend a good half hour or more (sometimes a lot more) on a single quest and bite the dust within inches of victory. It's simply painful.       In addition to hunting quests, you can also partake in 'gathering' quests. These have you collect specific items such as animal meat or eggs and then bring them back to base camp. Unlike hunting, the gathering quests take a while to pick up steam. First, they lack the intrinsic coolness associated with hunting, and they just take too long to complete. Or rather, many of them suffer from languid pacing. Looking for stuff for the sake of looking for stuff just isn't that exciting. It's not terrible, and there's nothing particularly broken with the system, but it's just a tad on the boring side of things.   Should you tire of questing, you can always turn to one of the many peripheral activities in Freedom. First, you can head to a special part of the village (run by cats, actually) and try your hand at farming. You can purchase a variety of items to plant from the village store, or find them out in the field. Either way, you hand them over to one of the cats and they make sure it gets all the attention it needs. You can then come back and harvest healing herbs, or whatever else you had growing.    You can also head to the same part of the village and gather minerals from a nearby hill. This is just as helpful as farming, and veterans know the extra loot you earn from these simple activities can prove vital during an especially long quest. But there's another thing you can do, and that's fishing. Like the other side 'jobs', it's simple but can prove useful if you keep at it. None of them provides the excitement of a true mini-game, but each definitely has its place. Plus, it's a safe bet the people who will buy this game will spend plenty of time mining, fishing and farming to score those needed items, anyway.   Freedom has even more cats than those mentioned above. And these aren't out in the field; they actually invade your house. Specifically, they invade your kitchen. After spending a good amount of time with Freedom, you get the opportunity to hire cats to cook for you. Freedom has a lot of them, too, and each specializes in different dishes. Depending on what meal they cook, you could end up with a variety of effects such as increased health or power. What's more, certain cats even offer insider information on the happenings of the village and gameworld. This entire aspect of Freedom falls under the 'non-essential' category, but it serves as an incentive. For some cosmic reason, you find yourself wanting these damn cats simply so they can cook those attribute-changing meals.    Naturally, one of the best aspects in Freedom is multiplayer. Hunting alone is fine, but it simply doesn't compare to hunting in packs. You can form hunting parties of up to four people and go on multiplayer-specific quests. You can play most of the single-player missions with friends, fortunately, so multiplayer never feels limited or constrictive. What makes the whole thing work as well as it does, beyond the actual hunting aspect, is how streamlined and immersive it feels. You don't just sign on as a blank avatar and join a list of other players. You actually walk into a gathering hall and meet your fellow hunters, then get your quest from a guild representative. Your party can even sit at a table and do nothing. Yes, it's a small thing that online PC games have been doing for years, but that's just not the case on handhelds and it's nice to see it in Freedom.   Monster Hunter Freedom delivers what fans want in a portable game. Its not a perfect translation, as it suffers from overly long load times and quests, but these issues dont ruin the experience. And while its unfortunate that Freedom shipped without an online mode, the single-player campaign and multiplayer mode have enough content to produce more than 100 hours of gameplay. Its one of the longest, most involved titles on the system.", "date": "May 31, 2006"}