{"name": "All-Star Baseball 2000", "name_review": "All-Star Baseball 2000", "ref": "https://www.ign.com/articles/2000/02/09/all-star-baseball-2000", "text": "Baseball in gaming has seen a decline in the last few years, losing popularity to action-packed sports such as football and basketball. It's such a slow game in real life, how are gamers going to have fun with it on their consoles, much less on their portables? Realtime Associates and Acclaim decided to take a swing at it with All-Star Baseball 2000. Features: Season and Playoff Modes Full MLB and MLBPA Licenses Homerun Derby Password Save Only for Game Boy Color    With All-Star Baseball 2000, Realtime Associates decided to take the tried-and-true engine of Frank Thomas' Big Hurt Baseball of 1995 and make it the latest baseball sim for the Game Boy Color. I didn't know how well a five-year-old engine would hold up, but it surprisingly played well and easy, making it more accessible to the casual or skeptical baseball fan. The pitching is simplistic by having the gamer choose where he wants the ball to go, what kind of pitch to throw, and how fast is should be thrown. Also, there's an option to have automatic or manual fielding, allowing you to either decide to catch hit balls yourself or let the computer field the players automatically.  Graphically, it lacks in comparison to Nintendo's own Ken Griffey Jr.'s Slugfest, with tinier, less detailed sprites and fewer colors. The stadium and field aren't very impressive either, with solid green grass and the lack of dirt on the base lines. I don't want to be a nit pick, but for some reason, Realtime Associates got the idea that every Major League Baseball player is black; I know for a fact that Greg Maddux is white. Character animations aren't the best at times, reminding you that you are playing with a five-year-old engine. There appears to be no transition between running to the foul line and the dive for the ball.  Despite those flaws, the game plays well. You're given many modes of play ranging from an exhibition to a full season to the coveted Home Run Derby. If you find your swing is sub-par, work on it with some batting practice or if you feel the yearning for a high-scoring challenge, play an All-Star game. All-Star Baseball 2000's interface in the game is very informative displaying the pitcher's ERA, the score, inning, and batting stats for the batter. It really tries hard to be an informative baseball game and I think accomplishes it quite well.  What probably hurts this game most is the batting. It is rather tough to hit a ball and not have it either fly foul or into the glove of a baseman. Even in the Home Run Derby, I averaged two homers out of ten pitches. It would be my guess that Realtime knew that something was awry with the batting and that's why they gave us a batting practice mode. Improving the sound would've helped this one a bit, with more variety in stadium music and sounds that occur during the game like the crack of a bat. Although baseball isn't my cup of tea, All-Star Baseball 2000 isn't really that bad of a game. If Realtime worked a bit harder on balancing the batting aspect and touching up on the visuals, they would've had a solid baseball simulation. Still yet, it is the best choice for the Game Boy Color but certainly does have a long way to go to oust the reigning portable champ, Baseball Stars for the NeoGeo Pocket Color.", "date": "Feb 9, 2000"}