{"name": "Tokyo Xtreme Racer DRIFT", "name_review": "Tokyo Xtreme Racer DRIFT", "ref": "https://www.ign.com/articles/2006/06/01/tokyo-xtreme-racer-drift", "text": "Drift racing seems to be the new ~thing~ these days, which makes sense as it's an evolution of the always-hot customization scene. Rather than gunning strictly for time, style actually plays the largest part in drift racing with drivers attempting to have their cars careen wildly around corners. To quote the poetic and upcoming The Fast and the Furious: Tokyo Drift, ~If you're not out of control, you're not in control.~ True dat.   The latest racer to attempt and thrust gamers into the world of drift racing is Tokyo Xtreme Racer DRIFT. The game's incredibly fortuitous storyline takes place in the year 20XX where, after having shut them down some time ago for no apparent reason, the government re-opens the mountainside streets to promote drift racing in order to save the floundering economy. Makes perfect sense to us.    Though its storyline sounds like the perfect setup to a fantastic drift racer, the problem is that the actual driving and, more importantly, drifting itself is no good whatsoever. We're a little hesitant to call it terrible, but it certainly doesn't meet the definition of good. The main problem is that the cars are almost always in one of three states: stuck firmly to the road, braking with the foot pedal and sliding a tad, or breaking with the emergency brake and sliding a lot. There isn't a whole lot of subtlety therein, and that's exactly what drifting is all about. Drifting is unfortunately absolutely necessary however, even in straight-up racing as the turning radius of every car in the game resembles that of a yacht.   Another problem that directly ties into this is that the vehicles are quite slow. Cars simply don't feel anywhere near as powerful as they should, and drifting requires speed, so it can be hard to get up to speed for a stylish turn. While at the start you might think it's simply because you can only afford a piss-poor car to begin your career with, but even stepping up to an NSX or something similar provides very little boost in performance. There's actually a decent, if simplistically presented, series of upgrades that you can make, but those too prove little help on the road.   While many of the game's challenges revolve around scoring points while drifting, you only gain points for doing so in pre-designated, marked turns. Unfortunately, there are plenty of turns in the game that won't reward you with points for drifting through them, which makes the game feel more like a trick checkpoint system rather than a real drifting racer. It also isn't very forgiving, so if you even as much as give a wall the tiniest tap ever, you'll lose points for the entire marked turn and you can't add any on even before the turn ends. Something else that seriously hurts this is that you're penalized for driving backwards, which sounds fine when you think about it, but if you happen to take a turn a little too sharply and wind up pointing directly at a wall, you'll need to back up a bit in order to straighten out. You'll start losing points almost immediately, and it isn't a small penalty in the least. To say it's infuriating would be an understatement.    The game's progression system sounds reasonable, though it doesn't wind up making a whole lot of sense in the end. During the day you're able to compete in a handful of events, and it's up to you to allocate your few daytime races best. Winning these will earn you credits for upgrades and new rides, and finishing enough events at each level will open the next level for higher rewards. When you shift to night, you're then able to head to a parking lot and compete against other racers. Beating them will eventually unlock new areas or cars for purchase, and some will gamble things like money or parts with you.   The problem here is that, aside from the game's highly imperfect driving system (which makes taking any race seriously an act of futility), the game is so separated between daytime and night that it winds up feeling disjointed. You need to use day races to earn money and upgrade your car, for whatever nearly unnoticeable improvement that gives you, and then turn to night to race against other drivers. It's also somewhat confusing, as there's no clear goal ahead of you even though you know you need to beat these racers in order to unlock more tracks and such. Nearly every car is a rival, and race types aren't predefined so you don't really know what you're getting into, so it's hard to say, ~I want to open this track, so I need to beat this and that driver.~ You're basically just racing to race, and if something opens up, so be it. With how the game is structured and no joy coming from the driving itself, it almost seems pointless.Tokyo Xtreme Racer DRIFT is a poor game through and through. Its driving mechanic fails in most every way, and being that it's centered around your ability to properly drift, the game simply doesn't work very well. Combined with a disjointed, somewhat confusing and seemingly pointless progression system, there's not anything here for anyone other than die-hard Genki fans.", "date": "Jun 1, 2006"}