{"name": "Gallop Racer 2006", "name_review": "Gallop Racer 2006", "ref": "https://www.ign.com/articles/2006/06/01/gallop-racer-2006", "text": "Tecmo gambled on bringing the Gallop Racer series over to North America from Japan -- where horse racing is wildly popular. One could argue that the sport of horse racing is to Japan what football is to America... and the Gallop Racer series is their Madden. It is the definitive choice among horse racing sim fans.   Fans of the series know that the last installment to reach US shores, Gallop Racer 2004, was a very Jockey-centric game. Playing as a jockey who rode for owners rather than being a jockey, owner, and breeder in one was the big change in 2004's redesign and many of the fans of the series (including me) felt limited by this change.    Gallop Racer 2006 moves away from putting you in the role of the jockey and has put the focus on the horseflesh. What makes this quadruped cannonballing sim so addictive is the depth of gameplay. In a car racing game like Gran Turismo where the Nissan Skyline r33 v-spec is the fastest you might not be able to win a race with it if you don't know how to handle it or if you decide to enter the wrong race with it. The same is true of Gallop Racer. You can save up and buy the most expensive horse, but enter it in the wrong races, ride it incorrectly, and manage it improperly and you will fail. This is where the steep learning curve of the game will put casual gamers off... but if you were a casual gamer you wouldn't be playing this, would you?   Winning takes studying the stats of each horse and matching its strengths and weaknesses with your own, maximizing and managing your ponies through careful selection of races and expert treatment on the track and off. There is a great deal of fun to be had here for the gamer that enjoys micromanagement and stat tracking. The game is built beautifully, so that even if you're riding a lower ranked hoofer against top tier trotters if you're skilled enough you can beat them.     You can own up to 100 horses in your stable which the game calls ~My Horses.~ Like the other Gallop Racers in 2006 breeding is a big part of what makes this game incredibly deep, involved, and admittedly addictive. Gallop Racer provides a rich, detailed lineage and pedigree specialized to each horse so I was able to select a stud that would complement the traits my winning mare, Onomatopoeia would bequeath to the foal. Thusly, after a glorious, romantic coupling a sassy bay colt was born. I dubbed him Afterbirth and guided him into winners' circles galore. This unlocked the ~Fields of Legend~ mode where the Dream Series and Dream Cup await the dedicated Gallop Racer. It's a grueling seven-race championship series that only the top horses and riders can race.    There is also a Simulation mode, which is new to the series that allows you to edit and change the tracks and horses. A versus mode allows you to race against a second player, and a free mode that allows you to race without all the fussing with all the details of horse breeding and ownership.    All of these modes also allow for betting on the races - which adds another legitimately addictive element to the gameplay. It's also a great way to increase your bank, to buy more ponies, to win more races... See the pattern here?   For good or for bad Tecmo has enhanced the ~hidden ability~ feature of the series. As a reward for excellent riding you'll get a super burst of speed, or other fantastic powers (so says legend but, I never saw anything but speed) during the race. This gives the racing a very arcade-y element that I wasn't a huge fan of. It feels like an attempt to make the game more appealing to the casual gamer, which is pointless, because the biggest draw or flaw of the Gallop Racer series is that it is not for the casual gamer. You will not simply pick up this game and play it.    Even so, Tecmo has divided the game up into different areas perhaps as another way of making the game more accessible to the possible casual gamers or first-timers, but it makes the whole thing feel a bit split-up. The game feels portioned off instead of being one whole racing, breeding, managing, betting experience. Gallop Racer demands a great deal of sitting down with the instructions, visiting with other fans on message boards, and good old fashioned tinker-and-trying to figure out all the particulars of this pony. Despite this, it's still a surprising amount of fun.For fans of horses, racing, stats, or high functioning autistics this title stocks plenty to do. Tack on decent graphics and challenging (but not impossible) learning curve and you've got one satisfying niche title and a surprisingly great and wicked way to get your pony fix. Yes, we're totally serious.", "date": "Jun 1, 2006"}