{"name": "Puzzle Challenge", "name_review": "Puzzle Challenge: Crosswords and More!", "ref": "https://www.ign.com/articles/2006/06/05/puzzle-challenge-crosswords-and-more", "text": "You know that a system is nearing the end of its life cycle when games that you never even thought would be released for the platform actually are. Crave Entertainment's Puzzle Challenge: Crosswords and More! is one such title. It's a game that, three years ago, most would have figured to be a halfway-decent Wal-Mart PC budget disc that may or may not have been an ideal pick-up for their grandmothers. But lo and behold, here it is for the PlayStation 2 and Portable in 2006, and it's not quite as decent as we would have liked. Then again, it isn't as bad as its graphics would lead you to believe either.   What about those graphics anyway? In the simplest of terms, they're pretty damned terrible. Low-res, lacking in artistic inspiration, and pretty repetitive, the visuals equate to little more than a digital representation of a puzzle book that you'd find in a local supermarket. Sure, there are unlockable wallpapers and the occasional 3D trophy to celebrate your accomplishments, but they're definitely not appealing. The game's sound doesn't fare much better either, but in its defense, it does offer a few tolerable space age and Japanese-sounding tunes that serve as some sort of distraction beyond the cornea-scratching opticals -- so at least that's something.    But let's be fair. Puzzle Challenge isn't meant to be a presentational tour de force anyway; it's supposed to be a fun little videogame version of the pen and paper brainteasers that we've been enjoying for almost a hundred years now. And to its credit, there are a good number of options for users to throw their minds at: Multiple crossword games, British-style Cryptic Clues, numeric Codebreakers, classic Wordsearches, KrissKross contests, Number Jigs, and Backwords jumbles have all been included. Another nice touch is that developer Supersonic has also incorporated a large number of puzzles for each mode and there are more than 1000 individual challenges in all... though several do share similar words or solutions.   For the most part, the analog stick and shoulder buttons work as you'd expect them to when navigating the various puzzle boards. However, I did find the stick's responsiveness to be a bit on the twitchy side, particularly when doing wordsearches. This overly-sensitive reaction to my thumb movements often resulted in several selection reattempts, and when navigating the bigger puzzles this constant redux gets a little frustrating. The remaining puzzle types suffer from similar oversensitive and clumsy handling on their grids as well, and that little hindrance regularly cost me time-based score bonuses.There's honestly little to scrutinize about Puzzle Challenge: Crosswords and More! without overanalyzing it. It's ugly, it sounds bad, and it has twitchy analog control, but somehow those weaknesses don't hurt it as much as it would in other titles. After all, with more than 1000 different brainteasers spread throughout multiple game types, there is some genuine enjoyment to be found here (dare I say addictive in some instances?). The rub is, you'll probably have to be actively searching for this kind of thing to find it -- and with paperbacks with this stuff regularly available in grocery stores for five bucks each, there may not be too many of you.", "date": "Jun 5, 2006"}