{"name": "Desperados 2: Cooper's Revenge", "name_review": "Desperados 2: Cooper's Revenge", "ref": "https://www.ign.com/articles/2006/06/08/desperados-2-coopers-revenge", "text": "It's rare that quirky, original games sell well enough to merit a sequel. Meanwhile, we're forced to endure an endless parade of World War 2 shooters and elf-on-orc strategy games. That's why we were so pleased when Spellbound announced they were working on a follow-up to their Commandos-goes-Wild-West tactical game Desperados: Wanted Dead or Alive. We still have fond memories of that game, both because of the intriguing tactical puzzles and the rarely seen Western setting.  Desperados 2: Cooper's Revenge improves on the original by offering up full 3D graphics and an optional 3rd person perspective. Unfortunately, the new title suffers from a number of frustrating interface problems and some truly unimpressive AI. The basic western setting is still as strong as ever, thankfully, but the overall mission design isn't quite as impressive as it was in the original.   The story here is a bit jumbled. Told through a series of awkward and grainy still shots, the main thrust of the plot is that Cooper's brother has been killed (we think) and he's out to find out what happened and get a little revenge. While that's fine as far as it goes, the story seems kind of incidental to the action within the missions. There are also plenty of odd diversions that seem to come out of nowhere. We're supposed to be tracking down my brother's killer so we're taking the time to escort a wagon train of settlers through a narrow pass filled with hostile natives?  As before John Cooper will have a team of oddball characters to help him through each obstacle presented before him. Doc's a fine pistol shot and can heal other characters but he also acts as the team's sniper and can toss gas bombs that incapacitate enemies. Sanchez's shotgun is deadly but he can also drop bottles of tequila on the ground that will attract enemies and cause them to fight each other. Sadly, Mia and her pet monkey Mr. Leone from the first game seem to be on vacation this time around.   While all of the characters have their own unique ways of circumventing or otherwise disposing of enemies, we wish there were more interesting interactions between the powers. Using Kate's seduction power to lure enemies into the woods where John knocks them out and Sam ties them up tends to get a little monotonous. While Kate's power is the most interesting from a standpoint of puzzle solving, her lack of combat skills makes her a hard character to play solo.  In missions where you control lots of characters, you're better off just using a couple of them at a time and leaving the rest in a good hiding spot. While there's strength in numbers, your own team members just aren't bright enough to defend themselves. You can record specific actions for them, of course, and set them to go off on a pre-arranged signal but you can't set general orders for them to fire at will. In missions where your whole team is besieged by numerous attackers, you'll find yourself instructing everyone to lie low while you take one character out to attack the enemies. At least your heroes reload their weapons on their own now, which wasn't the case in the original game.  Enemy AI is pretty sorry too which is a big shock to us. The AI in the first Desperados was pretty hip to your standard tricks. This time around, you can usually take out an enemy without anyone nearby taking any notice. While we're willing to accept some of these limitations for the sake of a good game experience, it just seems wrong that you can gun an enemy down and his friends twenty feet away take no notice of it.      Getting through a mission becomes less about inventive problem solving and more about managing vision cones and patrol routines. Send Kate out, seduce an enemy, walk into the woods and have someone punch him out. It's a foolproof strategy that taxes your patience more than your imagination.  That's not to say that the game is easy. Though you'll blow through certain parts of certain missions with relative ease, the game requires quite a bit of trial and error before you stumble upon a solution that works for you. We usually expect a bit of that in this style of game but Desperados 2 seems weighted a bit too much towards ~error~ for our tastes.  In some cases, it's an error of judgment. While it's unquestionably aggravating, it feels fair because the game has presented a problem that you still need to solve. In other cases, however, it's an error caused by the awkward interface. These types of errors are much harder to forgive because it feels like the designers are setting you up. For instance, the concept of the quick draw is essential to Old West tradition but it takes characters seemingly forever to draw their guns and ready them. You'll also find that, while Doc can easily climb a ladder while holding his briefcase, he finds it nearly impossible to open a door while holding a gun. To be fair, there is a key command to work around this last problem but it's not clearly labeled.   The game defaults to a familiar top-down perspective but you're also free to drop down to an over the shoulder view of whichever character you happen to be controlling. This third person view lets you approach the game more like a shooter than a strategy game and it works well for certain encounters, in what it adds to both the mechanics and the atmosphere. Getting the hero's perspective on the battle makes things seem much more exciting and gives you a much better sense of who is and who isn't behind cover. Unfortunately, the controls are a little stiff and the brief moment it takes your character to respond to your keystrokes could mean the difference between life and death.  The missions themselves are typical matinee fare: protect a wagon train of settlers, escape from a military prison, sneak up and eavesdrop on a bandit camp, and so forth. Though the game gives you the freedom to get through the mission anyway you choose (and there are usually two or more avenues of approach for each objective), there are a few maddening missions where you're supposed to avoid detection. Your own play style will dictate how you handle each encounter but this is still a very combat oriented game full of shootouts and knife throwing.   Provided you have a machine powerful enough to run them, the 3D visuals are very well done. With a gig of RAM and a 256MB Radeon card, we still experienced some slowdown in the most crowded of the levels, but there are a number of graphics options here that you can use to optimize the game's performance.  You'll definitely want to see everything the game offers. While we're not talking Half-Life 2 or Oblivion here, the environments in Desperados 2 are definitely convincing. Log cabins hidden behind leafy trees, plank bridges lying over crystal clear rivers, massive dusty forts out on the arid plains -- Desperados 2 knows how to bring a location to life both in terms of detail and overall atmosphere.  The only real weak spot in the game's visual presentation is the monotonous enemy models. For whatever reason, it seems like there are only two types of soldiers, two types of banditos, two types of native Americans, two types of settlers, etc. Contrasted with the highly detailed hero models, the rest of the game's inhabitants look far too generic.  Sound is an entirely different matter. The game's audio effects are barely able to support the visuals and the voice acting is definitely off. Doc's incessant growl alone begs you to turn off your speakers. Still, they provide some sort of support for the action so, as long as you're not trying too hard to pay attention to them, they won't distract you from the action.There just aren't enough Commandos-style games around these days for fans to be picky, and Desperados 2 offers a compelling Old West setting that feels remarkably fresh beside the glut of World War 2 and fantasy settings we normally see. Still, when you consider all the frustrations that come with it, it's a half-hearted recommendation at best, particularly when the original Desperados was so much more satisfying. The clumsy control scheme and passive AI are the two biggest frustrations we had with the sequel and while they weren't enough to completely kill the magic of the setting, they came damn close.", "date": "Jun 8, 2006"}