{"name": "AND 1 Streetball", "name_review": "AND 1 Streetball", "ref": "https://www.ign.com/articles/2006/06/09/and-1-streetball", "text": "It's impressive to see someone who's mastered a skill at work: it's even more astounding when you see these experts perform seemingly impossible feats with their talents. The And 1 tour features the fast-paced steps and mesmerizing hand skills of the best players from America's streetball courts.  An urban hip-hop infused evolution of the Harlem Globetrotters, And 1 often comes down to the one-on-one breakdown between players, with flashy tricks and a focus on embarrassing your opponent.  Sounds like a good concept for a game, right?  Unfortunately, And 1 Streetball's horrible control scheme, visual glitches and other issues remove most, if not all of the dynamic play that makes the And 1 Mixtapes or live tour so enthralling.   At its core, And 1 Streetball comes with a basic number of game modes.  The main focus is the And 1 Mixtape Tour.  Following a character that you create, the Mixtape Tour takes you around the country to different cities as you try to become the latest And 1 member.  Each city has three elements to it -- first is an Open Run which pits the best amateurs against each other for the chance to move on to the next round.  Next are the side games, which are akin to tutorial refreshers that also help move the ~story~ along.  While you'll have a primary goal of being first to 11 points or beating another team before time runs out, you'll also have side goals that have to be accomplished before you can move on with the story.  These include alley-ooping to yourself or blocking a set amount of shots.  Finally there is the Main Run, where the selected amateurs from a court face off against an And 1 squad with the best players moving on to the next spot on the tour.     5-on-5 battle Successfully completing the stages in a city will earn you additional money that you can use to upgrade your stats or get tattoos, as well as new movesets, clothes and movies of the And 1 ballers in action.  The most disappointing facet of the story mode is that it's practically the same from start to finish.  Each city will stagger a side goal between the Open and Main Runs, which comes across more like busy work to stretch out a short ~career mode~.  There's almost no point to doing these games, nor is there a reason to be forced to do side goals to continue (that's the reason why they're considered ~side goals~ in the first place).   Aside from the main mode, there's the option to play half-court or full-court pick up games with more than 60 available ballers in the game.  Most of these guys excel at different things based on their position, such as their ball handling or their jumping abilities, and you'll be able to decide everything from the time of day and points scored to win to the number of players in the game (from 1-on-1 to a full 5-on-5 match).   You'll also be given the chance to choose from any one of the various Streetball ~Meccas,~ like Mosswood, The Rucker and Venice Beach.  Finally, there's the chance to practice at the And 1 training facility or get tutored by Rafer Alston, the legendary streetballer known as Skip to My Lou.   It's a bird, Professor!  And 1's Tutorial mode walks you through the basics of the game, along with introducing you to its multi-tiered ~I ball~ trick system.  Based on whether you're moving with the ball or not, you can pull off a number of trick moves designed to confuse, fake out or humiliate a defender.  Ostensibly, you perform what's called a Level 1 ~setup dribble~, designed to prep your opponent for the next step, the flashier Level 2 ~showboat move~.  Here, your player pulls off some fast-paced spin, dribble or other feat with the ball to lose their opponent.  Finally, the Level 3 ~anklebreaker~ is used to trip up an opposing player, making them fall to the ground as you rush past them.  While you can technically pull off any one of these leveled moves at any time, it's supposed to be much easier to chain them together, making their chance for success increase with each step.    Each trick that you pull off earns you (and your squad if you're not playing one on one) varying amounts of respect points from the crowd watching you ball.  The crowd wants to be entertained, so you have to vary up the kinds and the levels of tricks you do to get them on your side.  You also have to score at the end of a cycle of tricks to gain these points and fill up the ~crowd meter~: having the ball stolen, blocked or passing it to the other team quickly erases all of the points you'd get from your showboating skills.  Once the crowd meter is full, you receive a ~Mic Chekka~ mic, which can be redeemed to either set your team On Fire or perform a Breakdown move.  Catching On Fire (which is wholly derived from NBA Jam) boosts the stats of your squad, letting them hit shots more accurately, grab more rebounds and run just a bit faster than before.  A Breakdown move, by contrast, can only be triggered when players are in specific areas of the court, but it gives them an unstoppable score that's worth 3 points in half court games or five points in full-court matches, which is a slight modification from NBA Street.    This might seem straightforward, until you start trying to accurately pull off the trick that you want.  Unlike other sports titles that place tricks on the shoulder buttons or triggers as modifiers of your moves, And 1 Streetball focuses upon the Right analog or thumbstick as the initiator of Level 1 moves.  You point it in any one of eight directions and it's supposed to pull off a trick.  If you are starting to branch your combo into its corresponding Level 2 move, you then need to include the Left analog stick (which is primarily used for movement), pointing it in a direction as well.  Finally, to reach Level 3, you have to include both thumbsticks and a right shoulder button or trigger to pull off the move.  Needless to say, the inaccuracy of the analog sticks being recognized at the same time with button presses results in players disregarding your ~commands~ entirely or simply spinning in a circle because they can't figure out what to do.   Cover me if you can, big man! But wait, there's more!  There also happens to be a specific time limit imposed on your characters to pull off a trick or chain them together: only problem is, this isn't cleanly handled or specified between ball handling animations or at the start of a combo.  Inevitably, you'll try to pull off a combo, only to find that your players can't or won't do the move you want.  While the option to modify your Breakdown moves or combos are available to created characters, it doesn't manage to affect how poorly the game recognizes the trick commands.  Apart from the poor controls, there's no reason why Breakdown moves or catching players on fire needs to be included in the game.  None of the players have fifty-foot verticals, nor do they leave smoke trails when they jump, so to find these items feels unnecessary and a cheap theft of a better-handled game mechanic from other titles.   It also doesn't help that you'll discover a large number of gameplay problems, such as collision detection issues with both the ball and other players, as you're playing the game.  And 1 Streetball is so locked into running animations for moves that a defender can literally be on top of a loose ball from a poorly timed trick and the rock will pass through him like he wasn't there.  Driving around said defender can also result in either a similar pass through him as if he's a ghost, or getting hung on an invisible corner of the opposing character model and stuttering your way across the court.   Apart from the spectral nature of some players there are the supernatural shooting and defending glitches in the game.  For instance, I don't know how you can face the down court basket and perform a jump shot animation towards that end of the court, yet the ball arcs backwards over your athlete's head and lands in the up court basket.  Similarly, I don't understand how a defender, seemingly locked in a box out animation, can strip and recover a ball from the opposing team coming up the court.  Or why someone standing still will automatically fall over during an anklebreaker move.  There are so many problems I can barely list all of them, but problems like these plague just about every single match of And 1 streetball, whether you're online or not (although online appears to be lag free until you start trying to pull tricks off).   Trying to fake out a Rookie. It's also interesting that a tour that focuses on trash talk and embarrassing players has audio that is so average.  Duke Tango, whose entire job is to call the action and talk smack, is incredibly repetitive.  Even worse, if you pull off, say, The Professor's no look pass, he'll call your player The Professor, even if that isn't the person with the ball.  You've also got generic comments like, ~Step off the court~ and ~What's my name~ from the athletes, which also get old rather quickly.  In fact, the only plus comes from the soundtrack from DJ Green Lantern, who has a good mix of rap tunes.  This is easily one of the weakest basketball games to have come out in a while, primarily thanks to its idiotic control scheme.  Having more than 130 moves is a good idea, but if the game won't recognize what you're telling players to do because moves are tied to the analog sticks, it doesn't matter.  Similarly, the number of visual and gameplay glitches makes the game feel somewhat rushed and unpolished.  If you need your streetball fix, you might want to consider tracking down the actual And 1 Mixtapes before stepping onto this buggy court.", "date": "Jun 9, 2006"}