{"name": "Superman Returns [Mobile]", "name_review": "Superman Returns Mobile Game Review", "ref": "https://www.ign.com/articles/2006/06/09/superman-returns-3", "text": "What's that downloaded onto your phone? Is it a bird? Is it a plane? Or just another summer movie tie-in game seeking to ride a tidal wave of hype to stellar sales before word gets out that the game is pretty average -- at best? Sadly, we're talking about the latter here, as Superman Returns isn't worth leaping a tall building to get your thumb on.   Superman Returns, developed by Silverbirch Studios, begins with an interesting intrigue. Rather than just follow the movie plot beat for beat, it veers off right after the space shuttle incident you've seen in the film trailers and settles into what a day in the life of the world's greatest superhero must be like. This kind of open-ended approach worked well for the first hour or two of Activision's Spider-Man games, before you were asked to save the 18th guy hanging off the side of a building. On the smaller screen, in a game with limited scope, this kind of repetition sets in much faster.   Supes must run around the city, helping citizens in trouble and averting one disaster after another. One moment you're stopping a runaway train, the next you're punching meteors out of the sky. Then you're lifting a car. Then you're punching away rubble. But you're not really going anywhere. Superman starts to seem like an alien errand boy after a while as you realize that Metropolis is the unluckiest city on the planet.   The game is plagued by some very float-y control. I understand that since Superman does indeed float, this might seem like a logical design choice. But flying around with any real degree of precision is as difficult as stopping a runaway locomotive... when your name isn't Kal-El. This is especially noticeable in events like the meteor shower where you are told where the rocks are coming from via a system of small (too small) arrows. Lining Superman up underneath the meteors so he can slow their descent is an exercise in frustration, because if you are off even two pixels of a bulging bicep, the rock plummets right past Supes and hits the ground for an approval penalty. (The citizens of Metropolis, having not seen you for five years, need some convincing that you are indeed the messiah, er -- guardian superhero.)   Superman has his trademark superpowers in this game, such as heat vision and super breath. You'll be called upon for these talents throughout the game. For example, you may need to use x-ray vision to spot a bomb inside mailboxes. You cycle through these powers with a number key, but the only indication of the currently selected power is a small S icon in the upper right corner. It's really small and out of the way, drawing your eyes off the action. And the only differentiation between your powers is the color of the S. Yes, cell phone screens have limited real estate, but the icon for superpowers definitely deserves more than the peanut gallery.   I downloaded Superman returns on an LG VX8000. The level of detail in the characters and background shows that somebody is paying attention to the way Gameloft does things. These sprites are large, full of color, and have good animation. The game opens with the Superman theme, and I admit that I have a hard time hearing that music and not smiling.  Superman Returns doesn't work because the design concept is maybe a little too big for the platform. I like having a sandbox-esque superhero game, but the number of locations is really limited and it stunts the sense of progress and achievement. The flying controls are too loose. And, as mentioned, the superpower indicator is way too small. On the plus side, though, the game looks good. But appearances aren't enough this late in the mobile scene. Pass.", "date": "Jun 9, 2006"}