{"name": "MotoGP 2006", "name_review": "MotoGP 06", "ref": "https://www.ign.com/articles/2006/06/09/motogp-06", "text": "Rubber. To answer our own question, MotoGP 06 burns rubber, or whatever other racing  clich you want to insert here that signifies that Climax's new, next-generation superbike racer is an impressive entry into the genre on the Xbox 360. With superb control, great visuals and impressive sound, MotoGP 06 burns rubber, it takes the checkered flag and it pops a major wheelie. As the officially licensed game of the MotoGP circuit, MotoGP 06 does a lot of things right. For those of you who have never seen a MotoGP race, hit up Google for a video-search and witness for yourself one of the hairiest racing spectacles on the planet. Seriously, these riders are nuts. Then, if you boot up your Xbox 360, you'll notice that Climax's game looks, feels and plays almost exactly like a real-life race, minus the broken bones and shattered spines. In fact, if you squint your eyes a bit, you probably can't tell if MotoGP 06 is a videogame or the real thing -- that's how good it looks.But, as the officially licensed game of the MotoGP circuit, Climax could have gone a bit deeper. The game modes, Grand Prix and Extreme 600, 1000 and 1200, are each simply a string of races, back to back, where you earn points or money and progress through the rankings. It's a good thing the game plays so well because at times it feels like you are just progressing from race to race. MotoGP 06 doesn't make an effort to capture any of the rivalries or team control of the GP circuit like we've seen in EA's NASCAR franchise, and it would have been nice to be pulled further into a sport most Americans are unfamiliar with. While technically MotoGP is a beauty, the title lacks a bit of personality. Wheelie if you so desire. That's not to say there's not a lot to do here. In the single player game, you'll start out on the GP circuit and take on either the 2005 or 2006 season, which is basically a different order to the tracks you race. GP tracks are replicas of the officially licensed tracks and require quite a bit of finesse on the brakes. Burnout fans beware -- the MotoGP franchise is simulation racing at its finest. You'll get an accurate feeling of weight from each bike and you'll need to hit the back brake-- with a touch of front brake-- quite often in order to succeed. There's no turbo boost or anything fancy, just pure racing.After you finish a GP season, you'll unlock the Extreme mode which features 17 fictional tracks based on real-life locations. You'll weave through the rolling hills and vineyards of Tuscany and ancient castles of the Czech Republic, for instance. These tracks are faster and more ~arcadey~ than the real-life GP tracks. The Extreme bikes feel as if you have a bit more control heading into sharp turns. Whereas in GP if you take a turn too sharply your bike will slide from right under you, you may be able to get away with it in Extreme mode. After you earn enough money in the 600cc Extreme mode, you'll earn enough money to buy a 1000cc bike, and then, down the line, enough to buy a 1200cc bike. Before each race, you have the option of running a practice lap or a qualifying run to familiarize yourself with the course and earn decent starting position. If you're like me, however, you jump right into the race and go for the money and points.There is a series of basic tutorials for new players, a nice touch since the learning curve for MotoGP is steeper than other racing games. For one, you're riding motorcycles here, and Climax has always made a strong point of making these bikes feel like bikes as opposed to cars with two wheels. Indeed, racing here is much different than, say, PGR3 with the dual-braking system and a very-noticable traction system. Climax also included several challenges, which are little minigames like finishing a certain section of a track in a specified time or holding a wheelie for hundreds of feet.     It's strange that the Extreme mode is locked at first since it's much easier and a more natural place to start your career than the simulation Grand Prix. Maybe in 07 Climax will have you create a rider, start out in the ~minor-league~ Extreme circuits and work yourself up to an official GP team as you go for the title. There is a hefty bit of personalization with your rider in MotoGP 06. As in GP3, you're able to design your own logos and choose the colors of your leathers, helmet and bike. You can also upgrade your ride with parts in Extreme mode, as well as tweak everything from your suspension to brakes to the length of the bike itself. You can hit the practice track and change these on the fly, and you'll be amazed at how easily you can feel the difference from one scheme to the next.Visually, MotoGP is one of the best-looking games on the Xbox 360, though not without a few problems. The riders, bikes and tracks look amazing in high-definition. Different surfaces absorb and reflect light as they would in real life, so the glint of the sun will shine on your helmet while being completely absorbed by black, rubber tires. The surfaces look particularly beautiful, and I found myself pausing every now and then to take a glance at cracks in the asphalt, blades of grass or the gorgeous clouds in the sky. I'll go ahead and say it right now -- MotoGP 06 has the best clouds I've ever seen! Occasionally you'll notice some pop-in with bushes in the distance, and far-away objects don't look nearly as good as the riders or the track close-up. Of course, that's because the beauty of everything up close puts into stark contrast anything that doesn't look amazing. In all, MotoGP 06 is gorgeous, just like its predecessor, but not perfect.The soundtrack is an adequate blend of techno tunes that is thankfully limited to menu screens by default. On the track, each class of bike sounds different from each other, the results of a sound engineer in England recording several different bikes while fully revved, idle and everywhere in between. While superbike laymen may not even notice, fans of the series will hear a big difference from GP3 to MotoGP 06. That there's some good-lookin' tarmac. The Xbox Live demo for MotoGP 06 has been available for some time now. The demo performed adequately -- there are many instances of lag, in our experience. In our Xbox Live sessions in the office, however, MotoGP played particularly well, albeit on our T3 connection with only two human-controlled players. The online options, while basic, get the job done as you can jump from your friends list and leaderboards right into ranked races on either GP or Extreme tracks. The most fun we had is trying to create the most ridiculous looking rider and bike and carry it over onto Xbox Live.MotoGP 06 is a high-definition port of MotoGP 3, tweaked for online play on the Xbox 360. Visually, the game looks stunning, especially in HD, and the sound of the bikes is authentic -- just ask Climax's sound engineer. The gameplay is still the heart and soul of this franchise, no matter how good it looks. Taking corners at break-neck speeds, always risking life and limb for just an extra tenth of a second off your time is exhilarating. Because of this challenge, the appeal of the game lasts much longer as you always strive for a personal best time. Combine that with trying to top your friends' best times and you have a racer that will keep you coming back for more months down the road. While we would have liked to see more personality of the GP circuit and a few more gamemodes than what we saw in the previous installment of the franchise, MotoGP 06 remains a very impressive title on the Xbox 360.", "date": "Jun 9, 2006"}