{"name": "MLB 2K6", "name_review": "MLB 2K6", "ref": "https://www.ign.com/articles/2006/06/14/mlb-2k6", "text": "It's a few months late, but the GameCube version of MLB 2K6 has finally arrived. The delay in the development cycle for the Cube probably occurred for a few reason. The team wanted to focus on the PS2 and Xbox versions those console owners as there are more consoles around. Secondly, 2K6 was making a next-generation debut on the Xbox 360 and a handheld debut on the PSP. So now, finally, the team was able to scrape some code together and release the GameCube version. How's it do?   Well, other than a few minor visual differences, MLB 2K6 on the Cube is basically the same game as what we've played on the Xbox and PS2, and continues to utilize the Inside Edge scouting system, the Swing Stick and the Payoff Pitching mechanic.   2K6 is kind of like the old Yankee-great Whitey Ford, notorious for the movement on his pitches. The hall-of-famer was said to use his wedding ring in between throws to scuff up the ball, resulting in all sorts of unnatural action. MLB 2K6 is the same way: it's a game that lacks polish and occasionally does some questionable things, but in the end, it is still a strike.     You'll get a lot more than hot and cold zones with Inside Edge. 2K6 really shines with the new Inside Edge scouting system, which we've already covered extensively in our preview articles. Basically, you can purchase scouting reports of opposing teams from Inside Edge, the professional scouting service that compiles mountains of data on tendencies, hot and cold zones, strengths, and weaknesses. There is so much data on individual players that it probably violates a few privacy laws.    Without the Inside Edge, you approach hitters and pitchers the same way you did before. If you've scouted a pitcher, however, you'll know what pitch he is most likely to throw and in what location. All of this changes based on the count, the stance of the batter and their own histories against each other. On the mound, your catcher will actually ask for a specific pitch and give you a target location, in or out of the strike zone. This changes based on the count and the situation as well, as your catcher will have no problem calling for balls as you pitch around someone like, say, Vladimir Guerrero.    The Inside Edge adds to what is already very good presentation in a baseball title, and the feature is so cool you'll wonder why it was never a part of videogames before. Heck, it was way back in 1988 when Kirk Gibson said after the World Series that Dodgers scout Mel Didier told him that Dennis Eckersley, on a 3-2 count, against a left-handed hitter, almost always throws a backdoor slider. That's what Inside Edge can do for you. Using the Edge and the Hitter's Eye, where you guess the upcoming pitch location, can be the difference between rounding the bases or returning to the dugout.    As analog control is so en vogue these days, 2K6 introduces the Swing Stick, a fun new mechanic that improves upon button-controlled hitting in every way. Similar to EA's Load and Fire batting system in MVP, you pull the right analog stick down to load your swing. You need to time the step just as the pitcher is about to release the pitch in order to maximize power and balance. If you let up on the stick, you'll perform a contact swing. Fire the stick all the way up to unleash a power swing and hit a dinger that flies 537 feet (our longest HR).      Pitching is another bright spot of 2K6. Kush introduced a new Payoff Pitching system that adds yet another dimension to pitching control. Basically, during big counts, an aiming reticule appears and the catcher calls for a pitch. If you hit the target, you'll get an attribute boost for the rest of the game, and if you miss, you'll take a small ratings hit. Kush got the idea for Payoff Pitching while watching the Brewers' Ben Sheets in 2004 when he struck out 18 against the Braves. The producer remembers watching Sheets actually improve over the course of the game, just like Roger Clemens can sharpen his splitter down the stretch. That's what Payoff Pitching is trying to capture.   Depending on the pitcher, the controller will also shake during tense situations, like with RISP late in a ballgame. Johan Santana might not feel a thing, but any shaky pitcher will definitely feel the pressure. Heck, my controller almost broke in half when I was using Byung-Hyun Kim.   Alright, so hitting and pitching work, and they work well. Unfortunately, 2K6 falters significantly in baserunning and fielding. Let's start with baserunning. When you hit a ball with no one on base, there's a nice camera angle that swings behind the baserunner so you see the field almost through his eyes. This is especially cool when you decide to stretch a single into a double and round first base. You also get a good angle to set up a directional slide, mapped to the right analog stick. Nice.   Just a bit early. The problem with baserunning is in the sprint mechanic. By mashing one of the face buttons, you can cause a baserunner to sprint, which 2K says adds an extra layer of control. In a way, it does, and it is fun to dig out of the box on ground balls and try to beat out the throw.    However, one could argue that baseball players sprint out of the box anyway, so there should be no need to mash a button. Instead, speed is one of those things that should be based on attributes, not the speed of your thumbs. True, the players still have speed attributes in 2K6 but if you don't use the sprint button, your players appear to loaf it. Ball players, attitude problems aside, don't loaf it to first base, period. Secondly, the mechanic just doesn't work with multiple runners on base because you can only choose one to sprint. So what you have is one guy hustling his butt off and the other baserunners jogging around, and you'll swear at the screen when one of the loafers is tagged out. The sprint is a good idea in theory and addresses an aspect of videogame baseball that we haven't yet controlled. Perhaps limiting the sprint to the batter would have been a good idea as you increase acceleration, but applying it to all baserunners makes the entire process frustrating.   Fielding and baserunning are both tied into a new physics engine that 2K has dubbed Pure Motion Physics. When changing directions, you'll feel it immediately, and you probably won't like it. Players now are very weighty and changing directions takes a lot of effort. On the base paths at full speed, that's understandable. But even at slow speeds it takes a while to change direction. In the outfield, this proves to be a bigger problem. When tracking fly balls, you'll sometimes need to make a slight change of direction. Instead of just curving your run, you now plant your foot and make a slow, sharp cut. When this happens, you'll most likely miss a catch you otherwise would have made.     2K also mapped dives to the right analog stick, but the maneuver itself is very unintuitive. When you flip the stick, there is a slight delay, then the player takes a quick stutter step, and then he dives. You'll have to flip the stick a lot earlier than you are used to in order to make a diving catch, and it takes a very long time to get used to. In the infield, throwing animations take a bit of time so players seem like they don't get the ball out of their gloves fast enough. Fielding animations look nice but sometimes you'll feel locked into an animation you don't want, especially on easy ground balls -- instead of charging forward and picking it up easy rollers, sometimes players will stop and wait for the ball. Unfortunately, the baserunner is already safe at first.   You've often heard quality ballplayers described as ~five-tool players.~ Those are the guys that do everything well. In baseball videogames, there are five tools as well: hitting, pitching, baserunning, fielding and computer AI. Baseball is a thinking man's game, and if the AI makes mistakes, like throwing to the wrong bag, then the entire game suffers. While usually solid, there are enough cases of AI-error to warrant mention in 2K6. The first comes from a hard-core baseball fan and might not mean much to anyone else. Top of the first, leadoff hitter Adam Kennedy comes to the plate. I miss my pitches and throw three straight balls. It's 3 balls and no strikes so I throw a fastball over the middle of the plate. Now, in real life, every third base coach in America would have issued the take sign by now. It's the first hitter of the game and it's a leadoff man's job to get on base. He's probably the most important factor in scoring a run in the first inning. There's no way he swings on 3-0, not in Little League, not in college and definitely not in the bigs. Kennedy swung anyway.    Ask him if he likes playing third? While capturing video footage today the AI made another Little League mistake. White Sox at Cubs, men on first and second, no outs. Soft line drive to second base. Second baseman makes a nice over-the-shoulder catch. The baserunners tag, but the second baseman throws to first anyway, even though both runners are standing safely on base. The first baseman drops the ball and it rolls toward the dugout. The pitcher sprints after it. The first baseman sprints after it. Even the catcher sprints after it. The third baseman looks idly by while my baserunner rounds third and heads home, which no one is covering. Score one for the Cubbies. Check out the video link below for in-game footage.   In terms of game modes, 2K6 already had a deep franchise mode and it has improved even further with the dynamic player morale system. Everything from a player's contract to his spot in the order to his performance on the field factors into his morale, which factors into a player's ratings. You'll see happy players with boosts of five points while moody players suffer. As a manager, it's your duty to handle all those egos and you can call team meetings to improve morale. On the field, you'll be prompted to argue calls every now and then, depending on how aggressive your manager is. You can button mash to raise his temper, and there's a little meter with some safe zones on it. If you hit the safe zone, you're manager has inspired his team and it receives a morale boost for the next inning. If you miss the zone, you get tossed and the CPU-controlled assistant coaches will be in charge of player substitutions -- a great touch.   There's also a GM Career mode, which is the same as Franchise except you have some extra GM goals to accomplish, like turning a profit, getting rid of problem players and signing stud free agents. The World Baseball Classic is included as well and you can replay the historic tournament with licensed logos and uniforms, although only MLB stadiums are included. Sorry Tokyo Dome fans. For some reason, you can't play with the international teams in exhibition play. That's too bad because it would have been rad to see the Yankees matched up against Team Japan.     Visually, 2K6 is not as sharp as it has been in years past. The graphics are decent but there are a few issues that keep the title from being a great looking baseball title. The default camera angle is pulled back a little too much, so pitchers appear far enough away that you can't recognize them, not even the Big Unit. The player models aren't as sharp as those in MVP 2005; the stars are reproduced well enough, but there are a lot of generic white guys in turtle necks with medium-length sideburns. There are also several hiccups in the game during cutscenes, especially when you call in pitchers from the pen, but nothing that takes away from the gameplay.    Jon Miller and Joe Morgan return in the booth and do a fine job, the best of any duo in videogame baseball, hands down. Their banter is so natural you'll feel like you're listening to an ESPN Sunday Night Baseball broadcast. They've included mail from fans with questions like, ~What makes a knuckleball move the way it does?~ Jeanne Zelasko and Steve Physioc introduce each game during loading screens and the two obviously recorded a ton of information on each team, including each team in the WBC. There are occasional problems, however. Although it couldn't have been Miller's fault, in Franchise he's too often said that A-Rod hasn't hit any homers or recorded any RBIs in 2005. For some reason, Miller's voice program is not recognizing the 2005 stats, so you'll hear plenty of, ~He didn't hit any homeruns last year.~   World Baseball Classic... check. We really enjoyed playing online in the office. 2K Sports always shines here as it usually has the most robust online options, including leagues and tournaments.  The WBC is not available for online play, but we had an enjoyable time with the pros. During development, cutscenes were causing a bit of a problem and they were eliminated, so no player intros or strikeout animations are included. Instead, the next batter simply flashes on screen, ready to swing away. In one sequence, Xbox editor Charles Onyett hit a deep fly to left field and my outfielder leaped up at the wall to go for the grab. The ball dropped and the screen immediately flashed to the next batter, so we had no idea, without looking at the scoreboard, if the ball was a home run or not.   The Skybox and the Virtual Identity Profile return. The Skybox is similar to the Crib in NBA 2K6 and is a showroom for unlockable items. It includes air hockey, which we love. You can also download your friends' VIPs to see their tendencies, strengths and weaknesses -- think of it as your own, personal Inside Edge.  MLB 2K6 is a game of nice touches, but it's still only a three-tool player. You'll love gripping and ripping with the Swing Stick, and the new pitching system is enjoyable thanks to pressure situations and payoff pitches. Inside Edge is the most significant addition to the game, and we hope to see scouting play a part in the genre in the future. But control problems with baserunning and fielding, along with a lack of general polish, keep 2K6 from being the great game it's trying to be. It's a smart game off the field with the Inside Edge and intelligent franchise mode but, in the end, MLB 2K6 is a decent baseball title and a strong base to move forward with the MLB license.", "date": "Jun 14, 2006"}