{"name": "Luxor", "name_review": "Luxor", "ref": "https://www.ign.com/articles/2006/06/15/luxor", "text": "One of the biggest problems with casual games is that there are simply too many imitators clouding the water -- it's sometimes hard to spot the true innovators and give credit where real credit is due. A few weeks back, I called out Blaze's Da Vinci Code Helix for being too similar to Zuma. (Which, in turn, is quite similar to Puzz Loop.) After spending a considerable amount of time with Luxor, I see its real inspiration. And it's interesting to see just how clever this iteration on the ~match three colored balls~ formula is, and why these few successful formulas spawn so many imitators.   Luxor is a mixture of Arkanoid and Puzz Loop, where you have a bat that picks up power-ups -- such as fireballs, a precision shot spotlight, and lightning blasts -- and fires colored spheres into a snaking line of multi-colored balls. Match three or more and that part of the chain vanishes, sometimes temporarily halting the progression of the ~snake,~ depending on how large of a hole you can make in the middle of it. If you manage to cause chain reactions, you can send the snake reeling backwards, giving yourself extra time to eliminate the remainder of the balls before they sink into a pyramid and end the round.   According to RealArcade, Luxor was the #1 online game of 2005. And after just a few minutes, I started to see why it was (or at least one of the contenders, as I know marketing claims can be a little fuzzy with their math). The game's simple hook soon gives way to some ingenious puzzle design, which is one reason why I think imitators have failed to match the game's greatness. Helix, for example, may have nailed the Da Vinci Code theme (quite well, too), but the care in crafting the puzzles just wasn't there. The expanded playing field in Luxor, complete with some devilishly complicated twists and turns, offers far more challenge and is one reason why people return to this game again and again.   Luxor toughens things up even further by pushing out the chains to phases. Just as you get a handle on the first piece of the snake, another segment creeps out and divides your attention. If you fail to eliminate either complete segment, you'll soon spot a third, which makes things even more harried. More power-ups help manage these ever-growing challenges, such as a slowdown bonus or a ~wildcard~ ball that completes any duo of like-colored balls it ends up next to.   I downloaded the game on an LG VX8000 which features a bright, large screen. The game field spans more than the width of the screen, which can make things difficult if you leave any part of the snake out of sight for too long. I mentioned in my review of Lumines Mobile that I appreciated Gameloft confining the action to just the screen you see, but with the hellzapoppin visuals, your eyes needed the respite. Luxor's slightly slower pace (at least, until the balls get close to the tomb, and then you start sweating) and more static color scheme offsets the extended play field.   Leaving the debate of who did what first aside for the moment, Luxor is a clever game loaded with challenge and content. As you advance along the map screen, which charts the puzzles you've completed, you get a sense of progress. Now, I recognize that Luxor is not the most original creation in games -- a sensitive topic amongst casual game developers. It pulls elements of other successes into its net and offers some nice twists, though, and I can see why it has such a massive fan base. In fact, that base just grew by one.", "date": "Jun 15, 2006"}