{"name": "Pirates of the Caribbean 2", "name_review": "Pirates of the Caribbean: Dead Man's Chest", "ref": "https://www.ign.com/articles/2006/06/16/pirates-of-the-caribbean-dead-mans-chest-3", "text": "This summer, mDisney is flanking Pirates of the Caribbean: Dead Man's Chest with two mobile games. One is a cross-carrier multiplayer sea battle game that shows enormous promise. The other is a more traditional action game centered around the story of Jack Sparrow and his problems with the devilish Davy Jones.   As I have not seen the movie yet, I am unsure if mentioning about specific locations or plot points would spoil any surprises in store for theater audiences -- and I know people are sensitive to that. (I revealed a pretty big spoiler in a review once and received some stinging responses.) I tried to be a little vague about specific scenery in my Superman Returns review for the same reason. I pointed out Metropolis since everybody that knows word one about the Superman Mythos can take a pretty educated guess that the city will figure heavily into the movie. So, needless to say, Jack Sparrow visits towns, islands, ships, and forts -- all drawn quite nicely from an isometric angle.   Much of the game takes place on-foot, with Jack squaring off against government troops and bloodthirsty pirates. There is some collecting to do during these scenes, such as kicking open crates to pick up gold. (You use this gold to upgrade your pirate ship.) But the majority of your time is spent fighting, either with sword or pistol. Jack can run up on enemies and poke them with his sword for quick kills, but from time to time, you must engage in protracted sword fights. You get a warning before these start, and then have to input number sequences quickly to execute your lunges and parries. You can screw up a few times without concern, but as the number sequences get longer and more complex, the need for accuracy each time increases.   Jack also has other context-sensitive moves at his disposal. If there are pirates rushing you, you can kick barrels and boxes at them. Surrounded? Press the action key near a flagpole and you'll swing around it, kicking everybody in the face. If you can get a troop between you and a well, you can kick them right into it. There's more, too, and little touches like these are welcome sights. They keep the action moving. My only complaint is that occasionally you perform the contextual actions inadvertently. I was just trying to kick open a box to get gold, but because the box was close to a set of gallows, I kept jumping up and swinging on the rope.   Jack's adventure also takes place on the high seas in a series of engaging ship battles that bodes well for the upcoming multiplayer game. You steer the ship either with the directional pad or number keys (use the numbers for better control), trying to get alongside enemy vessels and launch cannonball volleys. You have cannons on each side of your ship that work independently of each other, so you need to circle around in order to use the two sets. It takes a few moments for your men to load the canons (they are on auto-load, no additional keystroke needed) and you can monitor their progress with two meters that appear on each side of the bottom of the screen. These sequences reminded me a little of the great ship battles in Sid Meier's Pirates! on the PC and Xbox. They are short, but well-executed and I always looked forward to the next one. (If you complete the game, you'll see a lot more of them, too.)   One thing I need to mention, though, is that Pirates locked up on me twice -- once during the tutorial level and once during regular action. Each time I had to quit out, but at least not hard-boot the handset.   I played Dead Man's Chest on the LG VX8000. The game looks really nice, with detailed and colorful locations. The characters are good-sized, and when you initiate conversation, portraits appear in the lower corner to show who is talking. The Sparrow portrait looks pretty close to the real deal, but likely not enough to pay a licensing fee. The ships in the sea battles also look good, as well as when you watch Sparrow sail to his next destination in tiny cutscenes.  Pirates of the Caribbean: Dead Man's Chest is a good little action game for fans looking the buckle swashes via the thumb. The sea battles are fun to play and the on-foot action scenes are brisk. The contextual moves are very cool and I hope to see these idea used in more mobile actioners. As far as action genre movie tie-ins go, this is definitely one of the better ones I have played in a little while thanks to good control and some very smart design choices. Recommended.", "date": "Jun 16, 2006"}