{"name": "NFL Head Coach", "name_review": "NFL Head Coach", "ref": "https://www.ign.com/articles/2006/06/20/nfl-head-coach-2", "text": "~In great attempts it is glorious even to fail.~   Those are the words of the immortal Vince Lombardi, and though they were said years ago, they apply today to NFL Head Coach, a new kind of football game that EA had hoped would capture the life and work of today's professional coaches. And in bringing to life the first-ever ~football role-playing game,~ if you will, developer Tiburon did make a great attempt, that much is certain. Guiding a coach through the trials and tribulations of a career, a season, even a single day is fun, and for that much EA created an enjoyable game for the hardcore football fan, the kind of fan that lives and dies in Madden NFL's Franchise mode. But with a quirky interface, at times questionable computer AI and a few missing features we would have liked to see, NFL Head Coach just scratches the surface on the kind of game it could have been.   The most inspirational loading screens ever? Of course, this is the first year of the franchise (EA has not yet announced a sequel) and if Tiburon has shown a penchant for anything in the past, it's improvement. To that point, Lombard said this: ~The greatest accomplishment is not in never falling, but in rising again after you fall.~   We Have Atmosphere   The first things you'll notice about NFL Head Coach are some excellent presentation touches. You can deck your coach out in licensed NFL gear. Load screens feature a ~Landry-list~ of famous quotes from legendary coaches. Of course, there's Lombardi with things like,~ If you aren't fired with enthusiasm, you will be fired with enthusiasm.~ Then there's the now-senile John Madden, apparently the Yogi Berra of coaches, with ~Winning is a great deodorant.~   The soundtrack is straight out of NFL Films, which stirs the emotions of every football fan the nation over. Even Steve Sabol makes an appearance, as he and Trey Wingo of ESPN's NFL Live basically host your coaching career though a series of cutscenes. Wingo will handle individual season feats, while Sabol will record in NFL films your great career milestones. On PS2 and Xbox, you can even call plays into the headset. You can even import your coach into Madden. While hardly necessary, these are nice thoughts that count. EA really puts to work its NFL License in Head Coach, and with Madden and NFL Street, the company now has every genre of videogame football covered.   Where the presentation falters is in a quirky user-interface that takes some get used to. As a coach, you are a task master. And you better be because every activity in NFL Coach is broken down into tasks, from basic office hours to the NFL Draft to the Super Bowl. You'll go from meetings with your coaches where you discuss possible starters for next week. You'll go over your opponent's scouting report with the team scout. You'll choose between a variety of contact and non-contact practices. You'll sign and trade players. Everything is a task.    EA is putting the NFL license to work in Head Coach. On your calendar, many of these tasks can be swapped out. Others, like the Super Bowl, are penciled in. A very annoying problem is office hours, in which you really don't do much except sit there. Want to get on the phone and sign another corner? Sorry, you have to wait for the Sign Players task. Want to scribble out a play on a napkin after lunch? Sorry, you have to be in the Play Designer task. Want to change shirts? Sorry, there's a task for that too. This wouldn't be such a big deal if the majority of your office hours weren't mandatory and impossible to swap out. If I'm sitting in my office and I want to deal Ricky Williams, change polo shirts or order Chinese food, there's no reason why I shouldn't be able to.    There's an adjustment period, to be sure, but after a season you'll get used to swapping out tasks and planning ahead. Eventually, you learn to work around and then within the task system, but it's definitely a pain at first.   Also, all work and no play makes Jack Del Rio a dull boy. EA manages to capture the hectic life of a coach while he's on the clock, but it would have been nice to get a girlfriend, buy a motorcycle or spend hours on the golf course like a real coach. Madden and NCAA Football do a nice job of this with Superstar and Campus Legend modes, respectively, and a similar mode would have added a lot of character and some humor to this very serious position.    No Time For Disneyland   The bulk of NFL Head Coach is to be found in the deep, immersive single-player career mode. It's the day after your big Super Bowl win as a coordinator for the Steelers, and you are primed for your first head coach position. You'll start out by creating a coach, choosing a favorite team and going though a quick interview process that sets your coaching attributes (motivator or strategist, for example). Then you'll field a number of offers from your favorite team and a few others, as well as an outline of team goals the owner will expect you to meet. If you're the hapless 49ers, the goals may be to win a few games and throw one TD pass with Alex Smith as quarterback. If you're the Patriots or Steelers, the No. 1 goal is to just win baby.    From there on out, your life is your calendar. Each day several tasks are scheduled, such as the annual coaches meeting when you decide if your staff is a good fit for your team. Translation, you can fire whoever you want. The next task will be to fill any empty coaching spots. Then it's a bit of downtime in the life of a coach as your main priority is to resign players, sign key free agents and scout the incoming draft class. Thankfully, EA included a list of goals for each period of the season as a handy roadmap for success, be it resigning a full back or filling out your playbook or hiring an offensive line coach. When you look at the broad scope of NFL Head Coach, the game could be a bit intimidating to all but the most hardcore football fans. While the task system is annoying at first, it's clearly EA's attempt to simplify and organize your daily routine. In combination with the goal system, the game eventually becomes accessible as you take an entire career, quite literally, one step at a time.    The ESPN presence grows. ESPN's Mel Kiper hosts the NFL Draft and you'll feel like you're right there in Radio City Music Hall as you and your scout talk about which player to take next as that big clock ticks down. It's a shame there's not a virtual Paul Tagliabue to call out the top picks like Bush, Young and Leinart, but there's always next year. One of the nice touches we haven't seen in Madden, for instance, is that the incoming draft class is actually made up of the real class of 2006 since they are technically out of college football. So if you want Reggie Bush in your backfield, make a play for him. Controlling the Chiefs, I happily traded away Priest Holmes and a draft pick to get Bush in my lineup next to Larry Johnson. Watch out AFC West!   And so the years pass. Off-season, draft, training camp, preseason, regular season, postseason and all over again. Like any good head coach, you'll find a routine for yourself and your team and be following each team goal and winning ball games, you'll move up the coaching ladder, unlocking bigger and better offices and eventually be named to the Hall of Legends. The ultimate goal is to surpass the great Don Shula as the greatest NFL Coach of all time.   On The Field   Traditional Madden gamers will be turned off at first because there's no hit stick or turbo button. The only thing you'll affect on the field is the camera angle. You are an NFL Coach, and that means calling the plays, setting strategy and motivating your players. EA could have ruined this game by making you feel like a spectator on the sideline. But with a clock that never stops and several risk/reward decisions you have to make constantly, EA got this right.   So you call a pass play. But only minutes earlier, your defense got burned for a long score. After you call the play, you can turn your back on the action and have a little chat with your defense. Not enough push from the defensive line? Use some aggressive motivation to get in your players' heads. DB got burned off the line? Open up the strategy option and tell him to play loose for either the next play, next drive or the entire game.    The motivation and strategy both have their ups and downs. For motivation, players will react either positively or negatively to the criticism. The problem is there's no way to tell how your players are going to react. As a coach, you know your players and the best way to motivate each one, in general. It would have been nice to have some kind of meter to know that if I give Trent Green an earful, he's not going to crawl into a shell and throw three picks the rest of the game, as he likes to do in my saved Career.    See the field from the sidelines or the blimp. Setting strategy tends to work well, although you will always have the feeling that the players' actions are out of your hands. Of course, that's how a coach must feel anyway. I would have liked players with a better awareness rating to play a lot smarter and not rely on coaching strategy to make the right play. The computer AI seems to have a lot of problems recognizing the clock. If I call a deep pass while trailing in the fourth quarter, I want my QB to throw for the sidelines and I want my receivers to get out of bounds. I shouldn't have to tell them that. Overall, however, the players do an adequate job of listening to your calls, although there is one minor bug. For whatever reason, I have never completed a halfback screen pass. Every time my quarterback either throws to a receiver, takes a sack or decides to scramble.  I ran a screen 10 times in a game and the QB never threw it once. I'm confused.     We're Talking About Practice   Ask any coach and they'll tell you that games are won and lost on the practice field, and NFL Head Coach does a great job of representing this in-game. In fact, it's the title's biggest strength. There are usually two practices scheduled a day (you can swap these out to sign players or for some other task, of course). You have a choice for contact or non-contact, one-on-one drills or drills with the entire team. There is risk and reward for each decision you make here. If you go with a one-on-one, you can better prepare the individual players in the drill, but the focus is only on a few players. In team drills, individuals receive less of a boost but the team becomes more proficient in individual plays. Run enough reps of a play and it eventually becomes a money-play, the kind of play that you go to when you need yards. On the flip side, if you run a play that you have never run in practice, there is a chance of a missed block, a receiver running the wrong route, Alex Smith throwing a pick -- you see where we're going.    You'll have more office hours than a college professor. The ultimate goal is to have your players healthy (chance of injury in contact drills but less of a ratings boost), and to have a nice stack of money plays in the bank. Like a good coach, you'll know when your team is ready after a good week of practice, and EA nailed this aspect of the game.   NFL.com   Online play is decent, but trimmed down from the in-game options in the single player game. Gone is the ability to call audibles or change a strategy of the players on the field. You can still motivate your players and change strategy for players on the sidelines or during stoppages of play, but audibles feel strangely absent here, especially on defense. In videogame football, we have a habit of calling plays based purely on situation. Without the ability to call an audible, if you call field-goal block on fourth and long and the opposition decides to go for it, then they are going to score every time as you can't shift your defenders back into position. On defense, it's a must to wait for the offense to call a play, at which point a formation indicator will appear. While trimmed down, the game did perform well online and we didn't have any problems connecting or with slow-down.   Getting to the end of this hall is harder than you think. NFL Head Coach does a lot of things right, and EA should be commended for its creativity and trying to cater to hardcore simulation fans. Then again, Head Coach does a lot of things wrong. Coordinators will recommend you to take a knee in the closing moments of a half even if you are losing and on your opponent's side of the field. Thankfully you don't have to call that play, but to cater to the hardcore fan you have to get all the little things right. As it stands, NFL Head Coach will appeal to die-hard fantasy football fanatics and Madden franchise mode junkies, and to little else. Still, that's all EA ever wanted.", "date": "Jun 20, 2006"}