{"name": "Rush for Berlin", "name_review": "Rush for Berlin", "ref": "https://www.ign.com/articles/2006/06/26/rush-for-berlin", "text": "If you're anything like me, you've just about had your fill of World War 2 games. Though we've come a long way since Close Combat and Medal of Honor, it seems that there's hardly any surprise or satisfaction left in sending waves of tanks through the Ardennes or throwing the Germans back at Stalingrad. With so many titles in the market, the first question to confront most gamers is whether or not we even need another game that lets us refight the Battle of the Bulge or the Battle for Berlin.  Thankfully, Stormregion's Rush for Berlin offers an encouraging answer to the question. No, you won't see anything particularly new here; the basic mechanics and the mission design are as well worn as a favorite t-shirt or a jazzy ii-V7-I turnaround. What you will find are a handful of interesting if minor additions and a compelling ~what if?~ campaign for the Germans. If you've already had your fill of Panzers and paratroopers, Rush for Berlin won't rekindle your interest in the setting, but if you still find yourself attracted to the units and combat of the period, Rush for Berlin offers a polished though predictable experience.   Past the needlessly thorough tutorial (which, thank god, is entirely optional for those to whom dragging a selection box is by now second nature) the game presents the player with four different campaigns. At the start you'll only have access to two, those for the Soviets and the Western Allies. While you'll travel the same paths as many others before you, from Bastogne to the Brandenburg Gate, the journey is relatively pleasant thanks to the game's refined mechanics and polished presentation. Still, even a coordinated Katyusha attack loses some of its luster after about the hundredth time you've seen it. Frequent and well-produced cutscenes at least offer a compelling context to the fighting.  Things start to get more interesting once you've completed those two campaigns and unlocked the German campaign. Postulating Hitler's death in 1944, this new campaign sees the German war machine make use of a variety of advanced technologies and designs that German scientists were working on during the war, like super heavy Maus tanks, Me 262 jet fighters and V2 rockets. These cutting edge technologies will be put to use to stop the enemies who are closing in on Berlin from both sides. Compared to the predictability of the other two campaigns, the German missions come as, in their words, eine angenehme berraschung.   As you play through the game, you'll also unlock missions in a small French campaign that focuses on the activities of the French Resistance. After the dramatic action of the German campaign, these French missions seem a little flat. They're certainly challenging --- just try taking on a company of tanks armed only with a few sticks of dynamite -- but they don't quite live up to the excitement set by the earlier missions.  Most missions come with a variety of progressive objectives so you'll need to be ready to shift gears at a moment's notice to take on new challenges. A variety of optional and secret objectives are present as well, which gives you the opportunity to approach the mission the way you want. Deciding whether or not to assault an optional objective really brings out the general in us.  In Sevastopol, for instance, defense guns harass your forces right from the start. You can opt to stay out of their range, but that limits your mobility and your access to other objectives. You can race through the fire but that might find you running headlong into a prepared enemy position. Or you could send forces to take out the gun crews, hoping not to lose more men than you're saving by silencing the guns. At that point, you'll also have to consider whether or not to have your own men operate the guns. They can wreak havoc on the enemy but that also means that the soldiers will be too far from the rest of your forces to take advantage of new opportunities.      By far, one of the most interesting concepts (and sadly underused) is the concept of time as a manageable resource. In fact, the designers might have made this component of gameplay clearer if they had named the game Race for Berlin. While time is obviously a resource in every real-time strategy game (it's in the name of the genre, after all), time plays a unique role in Rush for Berlin.  Each mission has a projected time limit, shown by a sliding bar at the top of the screen. If you're ahead of the clock, a slider moves to the green side of the bar. If you're falling behind, the slider moves to the red side. If you wind up finishing earlier than expected, that extra time is carried over to your next mission. If you finish late, the extra time is deducted from the next mission.   You can spend these time units to bring new reinforcements to the battle but you'll have to make careful selection because you'll have to be able to use these new units to complete your objectives more quickly. There are some opportunities in some missions to extend your time, either by capturing certain objectives or denying certain others to your enemy. All in all, it's a really intriguing concept but I wish that it played more of a role in the overall campaign.    In addition to the single player options, you'll theoretically be able to take the game online in a variety of modes. We say ~theoretically~ because there's a serious lack of players online. Should you know someone who wants to play, you're likely to enjoy the challenge. In addition to the regular modes we've all come to expect, Rush for Berlin offers up two new twists. The first, Rush mode, has the players racing around the map to secure victory objectives. Points are scored for each objective and the game ends at a preset time or point limit.   More interesting is Risk mode. (For the record, the name of these modes are actually acronyms, but I refuse to type R.I.S.K. because a) it's dumb and b) they had to spell ~combat~ with a ~k~ in order to make the acronym work.) Anyway, Risk mode gives each player three different objectives. No one knows what the other players' objectives are, so it's a race to see who can complete them first. A neat message system broadcasts your activities to all the other players so they have a chance to figure out your goals and stop you.  The units should be more than familiar to anyone who's played World War 2 games before. T-34 tanks, snipers, 88mm guns and all the other usual suspects are here. Your own infantry can be put to use as crews for vehicles or large guns. Medics and supply trucks handle your repair duties but you'll also be able to make use of field hospitals and depots scattered around the map. Though there's no base building, you will have the opportunity to capture certain barracks and factories that can be used to bring new units onto the field. Rush for Berlin also makes use of certain officer units that serve as the heroes of the game, with special abilities and bonuses for nearby troops.  All units can gain experience through combat and rise through a number of levels of effectiveness. For basic units, this just means they'll be a bit tougher overall. Officers, on the other hand, gain new abilities at each level. The Russian Commissar begins with the ability to raise the morale of nearby troops. At higher levels he can steal resources from captured buildings and even drop propaganda leaflets to demoralize the enemy. While the abilities seem a bit like super powers, they're all plausible enough within the context of the game world.      It is a game after all, so strict realism doesn't necessarily apply. You can see that in the reduced ranges for vision and weapons. Still, the game does make a point of at least attempting to get across the idea of reality. There are no sophisticated armor penetration models, for instance, but tanks will generally be weaker in the rear than in the front. These little touches are enough to satisfy the hardcore types but not so esoteric to turn off more casual gamers.  The AI is a bit hit or miss with us. On the one hand, the enemy seems relatively aware of what your weak spots are. He'll hit you when you least suspect it and he's likely to take out your medics and supply trucks first before moving on to your combat units. Still, enemies also like to stand around in groups while you pick off other enemies who are standing relatively close by. The designers have made it a little tougher on the player by hiding snipers in forests and AT guns in alleys, but the patrols follow a predictable pattern and, as long as you're leading with your scouts, you should be able to fight on your own terms.   I've always been a fan of the Gepard engine and it certainly looks great in Rush for Berlin. There are loads of details all over the map, from the colorful flowers in the shade of the forests to the fiery piles of rubble in the bombed out cities. There are loads of varied locations here and each benefits from the artists' attention. Some are, of course, a little too cluttered, but I'd rather see too many details than too few.  Effects also add a lot of atmosphere. Different times of day and different weather conditions can really color a battle and lend it a unique aspect. When the shells start flying and the whole world begins exploding, you'll really begin to appreciate the work that went into the game's visuals. It doesn't appear that everything is as dynamically destructible as in games like Company of Heroes but that doesn't mean that combat won't destroy the buildings and forests around you.   My first complaint about the visuals is that the infantry models are incredibly generic, particularly given what we're seeing with Faces of War and Company of Heroes. I don't expect pockets and insignia at this scale but the units could stand a little more detail. My second complaint is that the game's framerate too frequently drops to slideshow speeds. While it doesn't happen enough to interfere with the gameplay, the instant you have a few dozen units and a handful of explosions, things get bogged down. God help you if it's also raining.  Finally, the game's sound supports the action wonderfully. The native language voiceovers are convincing and lack the tongue-in-cheek tone that so often plagues games in this genre. Sound effects add a layer of believability to the game, adding a sense of weight and firmness to the action. As exciting as the World War 2 setting is, it's getting harder and harder to feel much enthusiasm for these games. Some titles can get by offering up a look at a neglected theater. Still others can offer imaginative gameplay innovations. Rush for Berlin does neither of these. What gets it by is its highly polished presentation and a refinement of the tried and true mechanics that we've seen in countless other games. Whether or not that's enough to catch your interest depends on your ability to submerge yourself in the tactical battles of World War 2 in Europe. The speculative German campaign definitely opens things up a bit but you'll have to finish the two more conventional campaigns first.For players who are new to the genre or the setting, Rush for Berlin is certainly a good place to start. If cost is a factor, those players may be better off digging through the bins looking for cheap copies of Stormregion's earlier Codename Panzers games. They're no less inventive and, in my opinion, a bit more exciting.", "date": "Jun 26, 2006"}