{"name": "Micro Machines 4", "name_review": "Micro Machines V4 Review", "ref": "https://www.ign.com/articles/2006/06/26/micro-machines-v4-review-2", "text": "Developer Supersonic Software may not hold as much weight with gamers as Criterion and Polyphony Digital do, but the UK-based studio certainly has experience with the racing genre. Mashed, Dare Devil Derby, and Antz are just a few of the driving games that the team has assembled over the years, but the best known of the bunch has to be Micro Machines -- a licensed speedster that follows miniature vehicles as they race across everyday objects and places like pool tables and kitchen sinks.   The latest installment in the series, Micro Machines V4, is definitely the strongest version to come along since the franchise debuted on the NES almost 20 years ago. A solidly-designed title aimed at young children and inexperienced gamers, V4 is a nice, entry-level piece of software that offers just enough challenge and variety for juveniles without the inevitable frustrations and complications found in most of today's racers.    Proof of this simplicity can be found the moment you first play it. Drivers will either accelerate or brake and using the right combination of both allows them to drift around hairpin turns or difficult obstacles. That's about all you'll ever need to know. A good 90% of the time, these are the only skills that players are required to use -- that is, judging when to start their drifting techniques and understanding when it's a good idea to go full throttle and when it isn't.   Occasionally, players might also have use for weapons, of which there are more than 20 to choose from. Chargeable plasma beams, machine guns, heat-seeking rockets, giant hammers, electro-shockers, and a number of other cool little power-ups definitely get drivers out of a bind when they need them. Of course, the trade-off is that using a weapon slows down the speed of your vehicle considerably (especially the charge-type attacks), and because there are few power-ups found on the courses anyway, the game doesn't really encourage their use unless absolutely necessary. As I said, 90% of the time Micro Machines is all about racing (as it should be).     Luckily, the tracks that players can explore are actually quite imaginative. That's the benefit that playing as the world's smallest cars affords you: it turns everyday locations into interesting exercises in maneuverability. Beaches, desktops, kitchens, toy cities, train sets, and a number of other familiar but fun courses are yours to be discovered. Supersonic has even utilized the Havok physics engine to get the most out of the cars and barriers that surround you. Granted, it's not the best use of the engine that we've seen (objects react great, cars... not so much), but it does a bit of something.   Fortunately or unfortunately the 40+ racetracks are all too short for their own good. This is great news for the children that the game is designed for (you know, with their short attention spans and all), but for tried and true driving nuts that like to test their chops on harrowing courses, it's over far too quickly. On paper these petite tracks may seem to be offset by the sheer number of available driveways, but in practice you'll see the real story -- that many of them are just different versions of the same area with almost no shortcuts or hidden areas to speak of.    Adults or experienced gear heads should also take note that Micro Machines V4 provides almost no challenge for those whose age is double digits. Again, this is obviously because the game is tailored towards your children or younger siblings rather than you, but even by those standards it's still a bit easy. The only real difficulty that most players will encounter is in the beginning before they've unlocked better car types. But after less than an hour of playing, most gamers should have enough vehicles to choose from that it will make the subsequent collection of other cars a breeze. Oh, and by the way, the sheer number of cars that players can find here is amazing -- there are almost 750 different vehicles in 25 different classes to choose from. Granted, the vast majority of them are near-identical other than their aesthetics, but still... collectors will probably get a bit addicted.   Naturally, one of the biggest questions that people will have once they discover that the game is available for both the PlayStation 2 and PSP is, ~what are the differences between them?~ Honestly, there are very few. Both versions of the game are almost identical... other than a few cosmetic variations (mainly the camera, it's farther back on PSP) and one unique feature for each game. On the PSP, this unique extra is Wi-Fi Ad Hoc multiplayer (Surprised? Me neither); on the PS2, it's a cool little track editor that allows players to customize their own routes through existing courses. Oh, and if you own both versions of the game, there is connectivity between the PSP and PS2 that will get you a couple of cool little bonuses.    If there's one area where Micro Machines really disappoints, though, it would have to be with its presentation. Though it does looks somewhat better than its console counterpart because of the smaller screen, the visuals are still nothing to write home about and possess little-to-no animation or flare. The audio and menus fare much worse, however, and offer barely-there sound effects and a slip-shod interface that would have been questionable in the early PS One days. Load times from menu to menu are a little on the long side too -- with some waits on the PSP version taking as long as 25-35 seconds depending on the request.Micro Machines V4 is a surprisingly deep little racer that, while not without its problems, offers quite a decent trip down a virtual racetrack. But keep in mind, if you're a hardcore driving nut then you should probably lower the score below a good one to two points... as this game isn't really made with you in mind. Who it is made for, however, is an adolescent player who recognizes the toy line, is altogether new to gaming, or likes to keep their racing nice and simple. If that sounds like you or someone you know, then you may want to raise that score a point or two instead.", "date": "Jun 26, 2006"}