{"name": "Crusty Demons", "name_review": "Crusty Demons Review", "ref": "https://www.ign.com/articles/2006/06/26/crusty-demons-review", "text": "Crusty Demons: Freestyle Moto X is one of those games that, after playing, makes you want to punch the floor. There are a few elements in this game that make it mindlessly addicting. With more work and better features, this could actually have been a good game. As it stands, however, the most entertaining parts of Crusty Demons have little to do with the actual game. It isn't that fun to play if you're trying to complete objectives, unlock bikes, levels, and extras, and finish the story. If you're more willing to sit for hours catapulting your rider off his bike and giggling as his face splatters against the ground, then you might actually want to play this.   Tied to a DVD series featuring freestyle motocross, Crusty Demons takes a few liberties to make the video game version more interesting. Making a deal with Satan to become immortal is a good example. Though all the real life selectable bikers like Seth Enslow, Dan Pastor, Kenny Bartram, and Ronnie Faisst can't die, they can get hurt. If Crusty Demons can be used as a learning tool for anything, it's that signing away your soul to the devil is never a good idea. After getting contractually bamboozled, you have to do Satan's bidding to reclaim your soul. Logically, this means you have to do bike stunts at five stunt courses in cities around the world. Starting in New York, you'll move on to Cancun, Amsterdam, Rio, Tokyo, and finally a race in Arizona.   It's good! Before setting out you'll need to pick a rider and a bike. Each have their own ratings, and they do make a difference. More bikes are unlocked as you beat levels and objectives, with better speed, wheelie, stoppie, nitro burn, and other statistics. Rider statistics don't come into play until you launch off your bike. As you float towards your impending squishy end, the air control, flight, smashability, and trick skill of your driver will definitely affect how much you're able to accomplish without your bike. It's too bad browsing the bike selection screen is riddled with aggravating loads. Otherwise the pool of bikes may have been fun to browse.   Trying to describe the good and bad of Crusty Demons requires two separate blocks of criticism. First there's the actual game. This includes each level's objectives, missions, and alternate vehicles. Imagine each playable locale in Crusty Demons as a Tony Hawk style level. Ramps are placed everywhere, quests are given by NPCs standing around, and plenty of extra items litter the level. Each level also has a few secrets for those willing to search. Even so, none of the levels outside of Cancun are well designed. Many areas feature seemingly random ramp placement, and in many areas you just won't understand the point of being there. Each level gives you a ton of different objectives to complete. NPC quests are the main thrust, but plenty of extras like biggest crash score, longest blood streak, most airtime, and lots of level specific events like riding on top of a train in Amsterdam exist. Completing these objectives unlock extra pictures, videos, bikes, and eventually the next level.   Cannonball (in Ron Burgundy voice). Before progressing to the next level, however, you need to participate in a race. Against five opponents, a first place finish is required to actually open up the next stage. Simply put, these races are terrible. It's not that the race concept is poor, it's just that the controls are way too touchy. Crashes occur far too frequently, setting you back to a near insurmountable degree. Making it through certain sections of a race, specifically the rooftop race after the Amsterdam trick stage, seem like more a product of luck than skill. Shortcuts are accessible in each race to more easily put you ahead of your opponents, but the threat of crashing is so large it's generally a bad idea to try and use them.   Control issues that make races so frustrating bleed into the trick levels as well, and an easily confused camera makes its presence known as well. Tricks can be pulled off with the X and Y buttons. Wheelies and stoppies help to string them together, but the trick system doesn't really require any intricate inputs to get high scores. All that's needed is to launch your biker into the air, hit a trick button or two, spin, land, and repeat. What is welcome are a few special abilities, like the option to hold brake and gas to charge up a bike's speed for an explosive start. Sharp turns are possible as well. When crashing, there's a convenient reset button that puts you back where you were before the disaster. Nitro boosts which can be accumulated by pulling off tricks help increase the amount of air you can achieve.   The button layout sometimes gets in the way of performing your desired moves. Instead of mapping accelerate to the R trigger, it's the A button. This causes problems if you're accelerating and try to hit the white button to initiate a super nitro. It also results in numerous accidental rider launches by making it way too easy to mistakenly hit the black button. As fun as crashing is, it gets really annoying if you're actually trying to complete a mission. Knocking even the smallest part of your bike against the environment will make you crash. A number of alternative modes of transportation exist as well, which you'll need to complete many of the NPC missions. These include dune buggies, lawn mowers, and mini 4x4s. Though it's initially hilarious to zoom around in tiny cars, your level of frustration will quickly rise as you begin to understand how horribly they control. The turning on most alternative vehicles is so touchy, it'll take an inordinate amount of time to complete missions even though you know exactly what to do.     Missions have a decent amount of variety. One Cancun mission challenges players to launch themselves and their bikes into a set of oversized bowling pins. Another tasks players with hitting pimps with a car. Another has players throwing their bodies through windows to catch prostitutes in the act of cheating their pimps. While the concepts are certainly refreshingly different, the missions aren't that fun to do. The prostitute mission, for instance, took over an hour to complete since trying to successfully position yourself and maintain the proper speed is so difficult. Other missions, like the parrot guy lawnmower mission in Rio is a giant pain, even though the concept is solid. The mission requires you to drag around a parrot guy and smash him into objects. Hitting 20 completes the mission. Trying to actually control the lawn mower you're riding on without ending up in flames is a tremendous exercise of patience. You'd basically need to be Mother Teresa to stay calm. As frustrating as some of the missions are, the races are even worse.   The control issues really destroy any sort of entertainment that could be gleaned from the actual game. However, if you decide not to play the game, it suddenly becomes substantially more enjoyable. This leads into the second part of the Crusty Demons analysis, the aspect of ejecting off your bike. At any time during play it's possible to go flying off your bike by pressing the black button. While tumbling through the air, you can speed up and slow down time with the R and L triggers, do body tricks like ~the bird~ and ~the bomb,~ and upon impact break all your limbs for points. The amount of points gained during a crash gives you turbo, so there actually is a reason to crash outside of laughing your ass off. If only this game incorporated its body ejection system more into the central gameplay, it could have been much better.   The unholy house bitch. Ejecting yourself off bikes strictly for personal entertainment turns out to be really fun. Since the rider screams in slow motion, falls insane distances, and smashes into objects and environments to a satisfyingly sickening degree, it's easy to spend hours just ramming into walls on purpose. Sure, it's stupid, but it's undeniably entertaining. The rag doll model isn't that great, and it would have been nice to see more detailed damage on the character model after they break their neck, arms, and legs in one fall. What limbs are actually broken at a fall's end seems random. After taking a 100 foot fall and landing directly on your face, it's reasonable to assume a neck snap will ensue, not a leg fracture. The tricks you can pull off during midair flight should also be more responsive. As it is, it takes nearly half the fall to initiate a midair trick, making midair combos nearly impossible.   Graphics are far from terrible. The framerate moves along swiftly, there are a few nice lighting effects, and the tremendously over the top blood effects are an asset. The drawback is that most of every level consists of boring brown and grey textures. Once in a while you'll come across some reflective ground, but otherwise levels are way too similar. Amsterdam and Tokyo, for instance, look very much alike, though the neon lights in each are arranged in different patterns. Sound is definitely better, with a very listenable soundtrack, hilarious voice clips which can't really be printed here, and an excellent squishy sound effect for when you pulverize yourself against objects.   Not Satan's best day. Assuming you can convince anyone else to check out Crusty Demons, there are a number of multiplayer modes. Modes include racing, trying for high trick totals, and accurate crashing. Just because you're playing against others doesn't mean the controls get any better, unfortunately. The multiplayer modes are plagued by the same issues and the single player, and therefore isn't all that fun to play through. If you want to play multiplayer, it's a much better ideas to jump into the story mode and pass the controller around the room, assuming anyone wants to actually take it. For obsessive freaks, Crusty Demons also gives you the option to freeride any course in the game, using any of the vehicles you've unlocked along the way. A Tony Hawk two minute mode is also available, and attempting its unique challenges is just as annoying as in the story mode.The best part about Crusty Demons is its sense of humor. It realizes it's a game that doesn't make any sense. This accounts for prostitute missions, the drunk girl roundup in Tokyo, and the pimp hitting mission in New York. Too bad the missions are so aggravating to play. Wanton self-destruction turns out to be this title's most entertaining aspect, but is so separated from the main gameplay you don't really achieve anything by continuously ruining your body. It is, however, a great outlet for letting off steam after several hours trying to complete a mission and not even coming close. If you're the kind of person that enjoys totally mindless, idiotic entertainment, you may actually like this game. Well, not the game, but the various ways it allows you to annihilate yourself. If you're looking for tight controls, smart level design, and a deep, rewarding trick system, you should definitely look elsewhere. Despite the amount of profanity the in-game characters spew, the level toilet talk that will erupt from your mouth while trying to play will surely eclipse it.", "date": "Jun 26, 2006"}