{"name": "Moon Patrol EX", "name_review": "Moon Patrol EX", "ref": "https://www.ign.com/articles/2006/06/29/moon-patrol-ex", "text": "Just porting over the classic arcade game Moon Patrol and calling it a day would have been enough for a lot of publishers -- and they'd likely be rewarded for just those efforts. But Bandai and developer Brizo Interactive have gone a step further -- entering Namco territory -- to also offer an Arranged mode that updates Moon Patrol with new wheels, new enemies, and a fresh coat of paint. The two games are too similar to really call Moon Patrol EX a two-fer, but it's definitely a rich package for 80s arcade aficionados.   The old Moon Patrol follows the exploits of a lunar rover that must blast through obstacles and aliens, all while jumping over perilous pits on the jagged surface. Crawling from one checkpoint to another, you have to balance speed and control, as you can often get tripped up in sequences that have multiple targets as well as required jumps. Those are what keep the quarters sliding into the machine, and they are just as maddening here, too. I don't have access to an arcade unit to compare the two right now, but vague memories of ship patterns and pit locations seemed to serve me quite well in the first few stages.   The Arranged mode -- which gives Moon patrol the EX suffix -- offers up three different moon buggies, each with special advantages and shortcomings. You have the balanced original kart, but there's also a slow-moving rover that can absorb a hit and a buggy that moves faster, which can be both a curse and blessing in certain hairy situations. After selecting your rover, you can choose from three shot patterns, such as a rapid-fire sky cannon or a 45-degree blaster that helps with stopping enemies before they get too close.   The Arranged mode features new visuals for the rovers and backdrops, but these flashier pixels don't have a real effect on game play -- it's just a little nicer to look at. Imagine the original Moon patrol, but updates for the NES era. The theme, which I could hum right now for a nickel, is also present, sounding catchier than ever.  Moon Patrol EX is a sweet recreation of the arcade classic that swallowed a lot of coins and sold quite well on the Atari 2600 and 5200. It's good to see it in fighting shape on mobile, and sporting a new look for gamers that like their classics with graphics upgrades. While Moon Patrol EX doesn't reinvent any wheels or advance the ball, it's still a great play for nostalgic gamers that remember arcades when they were still dark rooms lit up only by the blue glow of cabinet monitors and not the ~family fun center~ monstrosities they've become today.", "date": "Jun 29, 2006"}