{"name": "TNN Outdoor Fishing Championship", "name_review": "TNN Outdoor Fishing Championship", "ref": "https://www.ign.com/articles/2000/02/11/tnn-outdoor-fishing-championship", "text": "Add one more fishing game to the Game Boy Color with TNN Outdoors Fishing Championship.  With Zebco Fishing out the door, ASC Games has a little competition to go up against. Although  Fishing Championship isn't a horrible game, it isn't quite up to par.  What you'll get here is a basic, simple experience that's slighly amusing but quickly runs dry.  Despite dozens of different playable locations and fish, there is more that could have been done to make it better.  Features 6 stages 32 kinds of fish 9 bait types Free-Fishing Mode, Tournament Mode, or 2 Player Battle For Game Boy or Game Boy Color  TNN Outdoors Fishing Champ claims to be the ~biggest fishing experience for the Game Boy system~ right on the back of its box.  There's a ring of truth to this because there are plenty of spots for you to visit.  Unfortunately, none are too exciting.  Each area has its own geography, but most are drab and have boring objectives. In the Tournament Mode, your female partner lists what you must do at the beginning of each level.  She briefly instructs you to catch a certain number of specific fish and then lets you go to it.  After she finishes speaking, you search for fish while moving around in your boat until some appear on your handy radar.  Your boat, by the way, is incredibly annoying to control.  Turning is tedious and moving is slow, especially during the early stages.  It is a ridiculously pointless problem that should have been addressed. Once fish show on your radar, it's time to go and reel some in.  By choosing ~CAST~ from your menu, you enter the fishing mode.  Here, you aim your rod and cast your line with as much or as little power as you want.  Naturally, the more power you use, the farther your line travels.  When your lure is in the water, attract the fish by slowly reeling inwards.  If the vibrations are noticed, a fish may decide to bite, and that's when you reel with all your might to collect your prize. Different lures and baits attract different fish.  For example, something like a ~worm~ has low appeal to fish, but is sturdy and solid once it is bitten.  A spinner bait is an all-around great lure, and not only is very attractive but is also one of the strongest available.  For fishing in weeds, something like the grub is ideal.  Its performance there is much better compared to a minnow, which is pathetic for catching fish anywhere but normal water.  Each has its own particular use. TNN Outdoors Fishing Champ runs out of fun quickly.  Although entertaining at first, its average gameplay wanes after a short while.  The cute personality of the Tournament Mode is an obvious attempt to spruce up boring gameplay, but your female partner only feels like an excuse to introduce each stage.  In this mode, you are only allowed to fish at the current stage, and it is very bland because you are limited by both where you can fish and what you can do.  The Free Fishing Mode is slightly more entertaining, because you can fish at any one of the six stages: White Beach, Sky Bay, Blue Lake, Green River, Stone Lake, and Twin Lake.  Unlike the Tournament Mode, you are free to come and go at any one of these places and do whatever you like.  The problem here, though, is that it's still not too much fun.  Catching fish can be trying and is always tiresome.  To satisfy multiplayer urges, ASC included a 2 Player Battle.  In this, two people link up and fish for one game hour.  The goal here is to catch more fish than your opponent and see whose total weighs more at the end of the match.  As you win versus the other player, your Win Rate increases.  If your WR is high in contrast to your opponent's, your boat size is larger.  Its proportions depend completely on the percentage of wins you have. TNN Outdoors Fishing Champ isn't terrible, but it just isn't very good.  Low variety and an overall interactive encounter that fails to fascinate plagues what could have been a game with lasting fun.  Sure, there are lots of different fish to catch, but they don't keep me from yawning.  Out of the two fishing games that have been recently released, I recommend Zebco Fishing.  It has quite a bit to boast over this.", "date": "Feb 11, 2000"}