{"name": "Super KO Boxing", "name_review": "Super KO Boxing", "ref": "https://www.ign.com/articles/2006/07/10/super-ko-boxing", "text": "Every mobile maker right now is busy staking out territory in the increasingly competitive wireless game landscape -- and with Super KO Boxing, Glu Mobile stakes out serious real estate. Super KO Boxing is almost a reverse prism, drawing in such diverse categories such as sports, casual, and hardcore action and then releasing a white-hot, laser focused game that truly defines what mobile is truly all about: accessible fun for everyone. Sports fans, you will not find a better boxing game. Twitch gamers, many rounds of fist-flying action awaits you. And if you're a casual gamer, fatigued by the multitude of me-too puzzlers and card games, Super KO Boxing is the perfect alternative.   Super KO Boxing is the spiritual successor to the classic Nintendo franchise Punch-Out! -- a popular series that has inexplicably withered on the vine. You are a promising up-and-comer in this bizarro boxing federation, filled with colorful characters like military macho man Major Pain, French mime Pierre, and the Woody Allen-esque Punisher. In lightning-fast rounds, you have to pummel these pugilists to earn belts and take on weight-class champs.   The game delivers on personality. Every fighter is a Saturday morning cartoon, such as the silly 15 Cent, a riff on 50 that cannot keep his pants up. Tiki Tam is an islander that throws his weight around. Each fighter has unique animations -- nothing is generic or repurposed. And this goes a long way not only to deliver round after round of eye candy, but also keep game play fresh. Each opponent has special moves and tics that reveal their game plan -- kind of like boss battles from the 8- and 16-bit generation. For example, when Tiki Tam's mask starts rotating, you better be ready to dodge a smashing blow if you don't have a super punch saved up to knock him on his grass skirt.   Old-school sensibilities like this will endear Super KO to hardcore gamers, but the casual fans will find the simple control scheme a dream. The game offers only two punches -- high and low. Learning to use these punches (mapped to 2 and 5, or up and down on the thumbpad) in devastating combos delivers big results without thumb-numbing effort. The first few rounds, in fact, pretty much are designed to let you get used to dishing out damage before forcing you to start using the one-button guard technique or ducking from side to side to avoid incoming blows.   As you successfully dodge and jab, a super punch meter along the bottom of the screen fills. There are three levels to this meter, and at the fullest, you can execute three punch that flatten your opponent like a steamroller. To maximize the effectiveness of the punch, deliver it when you see your opponent off-guard. Look for those telltale animations and whomp them with a blow that will put them on the mat, no matter how much stamina they have left. The super punch meter is a fluid creation, though. If you fill it up, you can't slough off and wait for an opportunity. Sloppy swings or taking a punch chip away at the meter -- and when you finally have the opening you need, the super punch is no longer there.   If you are knocked out, you must rhythmically tap an action button with the ref's count to regain your composure. Should you drop a competitor, you can regain lost stamina by doing the same while they scrape themselves off the mat.   As you work your way up in rankings, you unlock fighters to spar with in an arcade-style Versus mode. Endurance mode pits you against a never-ending stream of boxers, challenging you to stay in the ring as long as possible without getting knocked out. Challenge mode lays out specific requirements spread across three different difficulty levels, such as beating an opponent without blocking or using a super punch. After plowing through the championship, this is where the game offers extra play value.   Super KO Boxing is easily the best-looking game Glu has ever released -- it easily sidles into Game Boy Advance territory with large, detailed boxer sprites. The level of animation is fantastic, with hundreds of frames to capture every swing, hit, and taunt. There are over a dozen fighters -- none of them are a dud. They are all equally silly, from easy targets like Pierre to the roid-ragin' Ivan that's an obvious goof on Drago from Rocky IV. (~I will break you.~)   The audio is also quite good, with digitized speech to chronicle the action. Chirping birdies accompany each boxer as they struggle to their feet. Punches to the face land with brutal thuds.  Super KO Boxing is Glu's defining game, much like Digital Chocolate's Tower Bloxx and I-play's Skipping Stone. Glu has always been an accomplished mobile maker, but Super KO Boxing is a line in the sand, daring other publishers to cross. Everything about Super KO Boxing is done with great skill, from the gorgeous animation and fun character design, to the controls that make the game accessible to casual gamers that may otherwise shy from a sports/fighting title. The game is a little pricey, but still an exceptional value for the amount of replay within. This is a must-download. Now.", "date": "Jul 10, 2006"}