{"name": "MTX: Mototrax", "name_review": "MTX: Mototrax Review", "ref": "https://www.ign.com/articles/2006/07/11/mtx-mototrax-review", "text": "Fans of the Motocross scene usually find themselves with few choices when it comes to videogames. The situation gets worse when it comes to portable games. So that's why it's refreshing to see a game like MTX: Mototrax ship for the PSP. It takes the best aspects of the sport and shrinks them to portable form. Even better, it delivers the same kind of gameplay seen in the console version of Mototrax.  Having said that, the two versions have their differences. The console iteration obviously wins in the graphics department, which includes texture work, rider animation and the like. Not that the handheld one looks terrible, because it really doesn't, but it just doesn't look as refined. Along the same lines, actual gameplay takes a few hits as well. Mototrax is definitely still the same game, and it includes a good deal of variety, but its performance suffers a bit in the translation.    The biggest difference is in how the game feels. Yes, it sounds a little iffy, but game enthusiasts usually can't tell whether a vehicle (plane, boat or otherwise) handles properly. All one can say is that it's off. The best analogy, at least in this case, would be that of a plastic toy rider. It feels as though you're racing a puny little figure and not a 175-pound guy atop an even heavier motorbike. That aside, it's easy to navigate jumps, tricks and turns. Best of all, the strategy behind actual dirt racing hasn't been left out. You still need to master the whoops section of every track and maximize every jump.   Like the original, the handheld version splits into various different modes. The most in-depth is Mototrax Career. You first create a character from a basic template. The game lets you define everything from hair style and goggles to your riding uniform and preference in street clothes. Afterward, you find yourself as a new recruit on a fledgling team of riders. Depending on how you do, either you will gain your team fame or popularity or you won't. You can track your progress and scan for race opportunities using a PDA. This also lets you check for emails and the like, all of which helps to personalize the experience.    Once you gain a little skill, certain companies will come long and offer sponsorship opportunities. This, of course, earns you coin which you can use to score new gar like helmets. Overall, it's a satisfying mode, though it has its quirks. Most of these have to do with the way motorcycles handle, though, and not so much the particulars of player advancement. In the end, Career mode lends structure and momentum to the game, more so than in other modes, but don't mistake it for an epic tale with characters and subplots. It's all dirt racing action, which is all fans of the genre probably want, anyway.    In addition to career, you can jump into Exhibition. This mode actually subdivides into Free Ride, Freestyle and Ghost Mode. Free Ride lets you pair a bike with a rider and then head off to race. You can pick any track, so long as it's unclocked, and ride to your heart's content. Freestyle grants even more freedom and lets you practice tricks and other moves. This way you can master specific moves without having to disgrace yourself in career mode. Finally, Ghost lets you race against yourself and hone the important skills like landing, jumping and making those crazy turns.  Motocross includes support for four-player wireless over a local connection. There's no infrastructure mode, for those of you who wanted to race online, but the wi-fi mode definitely alleviates the pain. You can race custom tracks or one from career mode, plus you can toggle collisions on or off and decide race length, etc. As far as custom tracks go, you make your own in a mode called Dirt Wurx USA. It lets you customize everything from the severity of the terrain and turns, to the amount of obstacles and visual detail make it into a given track  MTX Mototrax offers a pretty decent ride through the world of dirt racing. It offers just about everything fans of the sport could want, including a good selection of tracks and a variety of game modes. It's a little rough around the edges, both in the visuals and gameplay department, but these hiccups hardly get in the way of the game. Plus, the bundled track creator and multiplayer modes will keep the race going for a good while.", "date": "Jul 11, 2006"}