{"name": "Hummer Badlands", "name_review": "Hummer Badlands Review", "ref": "https://www.ign.com/articles/2006/07/11/hummer-badlands-review", "text": "The High Mobility Multipurpose Wheeled Vehicle is a badass machine. Currently an invaluable tool in Iraq for American military forces, the Humvee serves as troop transports, ambulances and surface-to-air missile platforms. Stateside, its civilian cousin, the Hummer, is enjoyed by environment-be-damned celebrities and hip-hop artists as a symbol of rough and rugged cool. So why then is Hummer Badlands, the officially-licensed Hummer racing game such a low-budget drag?    Indeed, there is a lot you could do with an officially licensed Hummer game and the developers over at Eutechnyx seem to realize this. There's Extreme Off-Road mode where you guide your H1, H2 or H3 over logs, boulders and through rivers. There's a Time-Attack mode, a Championship circuit mode -- everything but a Hunt Iraqi Insurgents mode. Unfortunately, each of these modes is so shallow and poorly implemented that only hardcore Hummer fans will take any enjoyment out of it.   Visually, the vehicles themselves look fine, but that may because they are in contrast against the bland environments. The Hummers each seem to be authentic, shiny recreations of their real-life counterparts. While there are several different Hummers to choose from, they are still broken up into only three categories -- H1, H2 and H3. As such, the differences between Hummers are only cosmetic -- all the H1s feel like the other H1s, and so on. Still, there are some entertaining options like the Patriot, a hulking H1 emblazoned with a giant bald eagle.     There are only five different courses, although there are different routes to take within the different kinds of events. But the lack of scenery definitely hurts. The courses are purely fictional and you'll drive through California, Peru, Colorado, Arizona and New York. The visuals on each are a mixed bag. Backgrounds in the distance are a picturesque blend of mountainside and hot-air balloons and ancient pyramids. All of this is ruined by the foliage that rivals Konami's NES classic Contra for best two-dimensional plant-life. If you want to get a closer look, go ahead and drive right through the trees; they won't stop you thanks to a complete lack of collision detection near the edges of the tracks.    The biggest downfall comes in the driving gameplay itself. Quite simply, this is not how Hummers feel. If you take a sharp U-turn at 80 mph, you are going to flip over and over, ruining your custom light kit and probably your entire life. Not so in Hummer Badlands. Here, you can fly around the course with ease, bumps in the road barely having any effect at all. I've been in a Hummer and hit a bump at nine mph and thought it was a rough ride. This combines for an all-too easy experience -- you'll find bigger challenges driving to work.   The sound is a forgettable rock soundtrack that is better muted after a few moments. Hummer Badlands screams at you to boot up a custom soundtrack. An over-the-top announcer screams out every single option you select, including, ~SINGLE PLAYER!~ and ~OPTIONS!~ This guy is better suited for SUNDAY SUNDAY SUNDAY monster truck circuits than videogames.    There is no online play, but there is a split-screen multiplayer with a few basic game modes that will leave you reaching for the nearest copy of Burnout Revenge. If you do convince a friend to play, there's a basic race, Pursuit race and Tug-of-War in which you attempt to tow you opponent across a set line (boring.)Hardcore Hummer fans or owners will like seeing taking control of their favorite rides. Racing fans, however, will not enjoy the weak competition, shallow game modes and lackluster graphics and sound. We like the idea of customizing Hummers and racing them around exotic locales -- we just wish Eutechnyx liked that too.", "date": "Jul 11, 2006"}