{"name": "Dragon Ball Advanced Adventure", "name_review": "Dragon Ball Advanced Adventure", "ref": "https://www.ign.com/articles/2006/07/15/dragon-ball-advanced-adventure", "text": "When DS Lite manages to sell over 600,000 copies across the United States during its first month of release, it's hard as a handheld gamer to think about anything other than a sleek white design, touch screen and beautiful backlit display.  It just so happens though, that June wasn't just an awesome month for DS, as GBA loyalists are treated to a healthy dose of Dragon Ball goodness as well.  Released by Atari, Dragon Ball Advanced Adventure follows the classic anime tale of Goku and friends as they travel the world looking for the mystical ~Dragon Balls.~  In a story that parallels the series that started it all, players have a chance to dash through side-scrolling levels full of classic combat, or take on other Dragon Ball characters in furious one-on-one battles.  Though the game doesn't quite have the impact as Treasure's Astro Boy, also for the Game Boy Advance, it does climb the ranks as one of the best Dragon Ball titles on the system, and an awesome all-around package for 2D traditionalists.   In classic Dragon Ball fashion, Dragon Ball Advanced Adventure is built around the series hero Goku, following the most powerful fighter in the world during his adventures on Earth.  The series originally started in 1984, and has since become one of the most popular (and longest running) anime series in the world.  Advanced Adventure follows young Guko in his earlier year, allowing players to experience the young Saiyan's origin tale.  Every supporting character you'd expect makes an appearance, starting with Bulma and Krillin and eventually incorporating Jackie Chun, Mercenary Tao, Gohan, Tien and various other enemies and allies.  If it's in the original story, it's most likely in the game.  The entire presentation is carried out in classic Dragon Ball fashion, displaying impressive hand-drawn art, great animated effects, and tons of seizure-inducing goodness along with tons of art from the series itself.  The main storytelling is delivered through storyboards and overworld maps, as well as various training mini-games and in-game tutorials.        When looking at the gameplay offered in Dragon Ball Advanced Adventure, we were honestly surprised at the amount of content included.  The bulk of the playtime will be spent in the game's Story Mode, which follows the tale of Goku by making use of side-scrolling beat-'em-up levels, mini-games and brutal one-on-one battles all in a complete semi-linear package.  In the side-scrolling levels (the bulk of the game) players can make use of a ton of different moves, including ground combos, air combos, various super moves and dash attacks.  Of course it's in every way a generic beat-'em-up adventure, but now days a straight forward attempt at classic gaming is pretty few and far between, so getting a game that does it right is still cause for celebration.  In fact, if Dragon Ball Advanced Adventure was simply a solid side-scroller we would have still given it a pretty strong recommendation.  As it turns out, however, there's more to the package than first perceived.     Banpresto, the developer, didn't seem to be content with simply delivering one gameplay element, and opted to add one-on-one battles to the mix.  During the story mode, players will collect various items that open up new areas to previous levels, power up Goku, unlock mini-games or actually add characters and arenas to the one-on-one mode of the game.  In this separate game mechanic, players take control of either Goku, Krillin, Jackie Chun, Mercenary Tao, Gohan, or Tien (as well as a special unlockable character) and do battle.  The astonishing aspect of the battles, however, is that new animation, audio, gameplay elements, move sets and specials are incorporated.  A ton of the original assets used in the classic game are kept, but the overall production is actually added to in order to create a self-contained fighting game within the main product.     In fact, though the game isn't perfect (combos often are too powerful, so getting the first hit can result in an early victory or defeat at times) it still squeezes in complex elements such as a compounding super move bar (levels one through four unleashing different attacks), guard breakers (combos that pound through a blocking fighter) and even counter-attacks into the mix.  Each of the characters are unlocked throughout the main mode though, so players looking to make the one-on-one experience their priority will still have to rip through the main game to get the most out of it.  Still, with the amount of options it offers it's very worth the time.  Not only can one-on-one battles be played over multiplayer via the GBA link cable, each character can be set to one of four power levels to even the playfield as well.  Team that with multiple arenas, new moves (multiple finishers for each character) and ~Time Limit~ options and you've got some serious replay value that, quite frankly, wasn't needed to make a solid game in the first place.  It is obvious that some serious effort went into Dragon Ball Advanced Adventure, and it's great to see developers still attempting to give players their money's worth even in the dwindling GBA market.    Dragon Ball Advanced Adventure isnt a perfect game.  In fact, unless youre a huge fan of the series theres really nothing new and amazing in the product for you.  For anyone who watched the show (or is a huge classic gamer) theres a ton of solid gameplay to be had, however.  The main story mode is comprised of various gameplay elements, and even offers a totally separate one-on-one mode as incentive to finish the adventure.  It isnt one key area that makes Dragon Ball a success, its simply the fact that the entire game is sound in its design, and theres a lot here.  As game progression continues, each level can be replayed with new additions (such as the Nimbus cloud, which lets you fly and participate in air attacks), and the promise of a second game mode with link play support is a huge reward.  The audio presentation is above average and offers a few bits of recorded voice for each character, and the graphical production features some awesome character design and animation.  Dragon Ball Advanced Adventure is simply a traditionally-rooted game that offers a ton of classic gameplay and variety to its fan base, and its a success because of it.  Plain and simple.", "date": "Jul 15, 2006"}