{"name": "Extreme PaintBrawl 2", "name_review": "Extreme PaintBrawl 2", "ref": "https://www.ign.com/articles/2000/02/11/extreme-paintbrawl-2", "text": "When Extreme PaintBrawl found its way into the IGN compound last year a huge crowd formed around my desk to see just how bad gaming can get.  The developers actually admitted they didn't have time to code any AI, so instead of being a cohesive paint-flinging squad, your team members would simply run in a straight line into the nearest wall and do the moonwalk while you were quickly picked off by dead-eye enemies.  Extreme PaintBrawl had the office laughing for weeks (actually only minutes because the game CD was quickly destroyed), so you can imagine everyone's excitement when we saw Extreme PaintBrawl 2 in our local EB earlier this year.  Apparently it's been out for a while, but it was buried so deep in the bargain bin that we somehow overlooked it ... until now.  After unwrapping the box (which looks almost identical to the original PaintBrawl -- except for the big ~2~ tacked under the name), we pretty much got what we suspected ... a logical sequel to the game that received the lowest score ever on IGNPC.  With Extreme PaintBrawl 2, Head Games proves that you can put shellac on %$&# ... but it will still just be glistening %$&#. This self-described ~sequel to the number one selling paintball game~ (What's the competition? Animaniacs Splat Ball?) is about as bad as they come.  While Extreme PaintBrawl 2 is a slight improvement over the original, that's not saying much.  The biggest problem with Extreme PaintBrawl  namely the mind-blowingly poor AI (or lack of any AI at all)  is still apparent in this sequel.  There's been hardly any improvement in the AI whatsoever.  As a matter of fact, I'm going to go as far to say that the program utilizes AS -- Artificial Stupidity.  Even though you can now issue simple commands like defend, assault, and follow to your teammates, your computer-controlled buddies still run straight into the wall and get stuck in the environment.  This is simply ridiculous, even for a $20 title.  The graphics and level design in Extreme PaintBrawl 2 aren't much better.  Character models are blocky and jagged, the low-res textures are grainy and blink in and out when you get close, and level layout is bland and uninspired.  My mom could do better than this.  Another nice graphical touch (if you could only hear the sarcasm in my voice ...) is the solid sky texture that hangs about 20 feet above your shooter's head on the outdoor levels.  You can actually look up, take aim, and paint the sky red to your heart's content.  It's just embarrassing that computer technology has progressed as far as it has, yet we still have new releases like this in the bargain bin.  There is one good thing I can say about Extreme PaintBrawl 2: it doesn't cause cancer, bursitis, or scurvy -- at least according to the Surgeon General.  What it does cause, though, is a fierce case of extreme nausea.  It's games like this that make perfectly good game journalists want to quit their jobs and find a new career in the exciting toll booth tending industry.  Avoid this game at all costs, even if you find it for 99 cents at a yard sale.  Extreme PaintBrawl 2 really put the ~pain~ back in paintball, and when they use the number 2, they really mean it.  -- Tal Blevins", "date": "Feb 11, 2000"}