{"name": "Spin Blocks 360", "name_review": "Spin Blocks 360", "ref": "https://www.ign.com/articles/2006/07/17/spin-blocks-360", "text": "Next to card games, the puzzler category is the most crowded in mobile -- and it's starting to take quite a bit of freshness and innovation to stand out from the horde. After all, how many variations of Luxor can you play -- or does mobile even really need? Centerscore's Spin Blocks 360 is a solid attempt to push the ~match blocks~ formula in another direction. As you clear certain symbols, the playing field rotates, requiring you to physically spin the phone not unlike Wario Ware Twisted for the Game Boy Advance. It's a novel approach that definitely sets the game apart from its block-busting brethren, but it also makes the game a little less accessible than, say, Zuma.   But not every game needs to be accessible -- there's certainly room in mobile for a hardcore puzzle game, and that's a good way to describe Spin Blocks 360. Not only must you manage a different way of matching blocks -- you must clear debris by placement patterns, not color -- but the constant screen rotation makes the game decidedly frantic, especially once the playing field fills up.   To clear blocks, you move a two-by-two matrix around the screen, rotating individual blocks in an attempt to match the patterns as indicated by arrows. You have a set number of block rotations before another set of bricks drop into the playing field. If you clear out a specific block, the entire screen performs a ninety-degree rotation, and you must switch the phone position in order to keep playing with the screen looking ~correct.~ The controls orient along with the screen, too, so at least you don't have to re-think thumb placement on the fly, too.   Spin Blocks 360 is a difficult game. Centerscore designed the first few puzzles wisely, allowing you a fair chance to acquaint yourself with the game concepts. However, when you wade into the thick of the game, things get tough and I can see some of the not-so-tough going the opposite direction. So, the game isn't for everyone -- that's hardly a crime. But if you aren't looking for a real challenge, consider other puzzlers.   Centerscore includes a link to a server where you can upload high scores and download new puzzles. The latter is a good value addition to the game. In these particular puzzles, you have only a select few moves to clear the screen -- and these can be wicked. They offer a good alternative to the regular game, so maybe you cans witch back and forth between the modes to preserve some freshness in each.  Spin Blocks 360 is a good, original puzzler. The game is difficult, so if you you're looking for a cakewalk, hit up something easy-cheesy like Hollywood Hangman. Centerscore touches on the strengths of the mobile platform -- a small, compact complete system with controls and screen on one unit -- and uses that to create a fairly new experience with the rotating screen. It's worth a serious look for hardcore puzzle game fans.", "date": "Jul 17, 2006"}