{"name": "Tekken: Dark Resurrection", "name_review": "Tekken: Dark Resurrection Review", "ref": "https://www.ign.com/articles/2006/07/20/tekken-dark-resurrection-review", "text": "Tekken: Dark Resurrection is the best PSP fighter released for the system. It blows its competition right out of the water and everything about the title, from its graphics to its mini-games to its multiplayer options, are exactly what the PlayStation Portable needs. But let's take that one step further -- Namco Bandai's Dark Resurrection is also the best arcade port available for Sony's miniature platform thus far, and even more impressively, one of the PSP's most outstanding pieces of software for any genre. Yes, it's that good.   Of course, the key to Tekken's high quality has its roots in the basics. Built as an upgrade to last year's superb arcade / PS2 slugger, Tekken 5, Dark Resurrection originally began as a coin-op enhancement that added new customizable items, characters, environments, and other cool goodies. The PSP version is a near-flawless recreation of that with the typical Namco home-port overload treatment. Regardless, even if the game was nothing more than a direct translation of the stand-up unit, the amount of extra content here would be sizeable. There are new ranks, new moves, new music, small interface enhancements, every character is available from the start... you name it, it's probably in here.    Keep in mind, that Resurrection's inherent extras aren't necessarily what allows it to stand out. First and foremost, it's the engine and its mechanics which promote player skill, strategy, and fast reflexes -- that's what makes the game what it is. You can have bonus content all day and all night, but if the core experience is weak, then so too is your game. That's not the case with Tekken 5.2, as all 30-plus characters have the potential and ability to become destructive human wrecking machines. Sure, you'll probably get whipped by high-tier Steve or Bryan users all day long, but put in enough practice, and eventually you'll be able to hold your own with fighters like Kuma, Lei, and Xiaoyu. Not only is this encouragement to learn the ins and outs of a character highly rewarding and time-consuming, but it can also be pretty damned funny. Just whip a Devil Jin player with Panda and you'll see what I mean.   Because of its very nature, the ability to play against another human being makes or breaks a game like this and Tekken: Dark Resurrection passes that test easily. In multiple ways, Resurrection caters itself towards player-versus-player confrontations with ad hoc versus modes, game sharing via one UMD, and the ability to face ~virtual~ opponents with the Ghost feature. In fact, the Ghost option is probably the PSP's most interesting new addition -- giving players the ability to record themselves fighting, upload that representation, and offer it for download to others. Once downloaded, people all over the world can then battle against the recorded version of your character and vice-versa. It's an extremely fascinating concept and a great way to see how you match up against other players. But don't fret, if you'd prefer to see your rating in a more traditional sense, Tekken has that too -- complete leaderboards for a variety of subjects.    The good news behind these multiplayer additions is that there are very few technical problems with them. When fighting head-to-head, lag is almost a non-issue and other than the occasional pause here and there (it appears to be random), most ad hoc connections stay consistent (for both two-player options, be it Game Share and Direct UMD vs. UMD). Strangely, the random pause did occur more often when using two copies of the game as opposed to using one, but the lag happens so infrequently that isn't really worth worrying about. Load times are also completely tolerable.   What makes Tekken so appealing, though, is that battling it out against another human player isn't all there is to do. There is a diverse lineup of cool mini-games to access as well, be it Tekken Bowling (brought back from the Tekken Tag days), Gold Rush (an easy way to earn money), and the excellent Dojo Mode. Dojo is of particular note because, like Tekken 5's PS2 arcade feature before, it allows you to fight opponents of varying skill levels and abilities. What's more, Dojo Mode is where you'll be able to unlock of the game's hidden goodies -- items, movies, etc. Good times!    Another element of Tekken: Dark Resurrection that deserves mentioning is its visuals. The game is absolutely beautiful and is easily on par with other high-end graphical treats like Daxter and Syphon Filter. Why? To begin, the character models look fantastic (as do their animations). Plus, with the large number of outfit possibilities made possible with the character modifier, their diversity is incredibly high.  Moreover, battles run at a slick 60 frames per second with a drop down to 30 during cutscenes and let's not forget about those backgrounds -- the level of detail and artistic beauty found in all 19 stages beats anything you'll find in other PSP fighting games, and to be honest, in most PS2 fighters as well.   Despite all this graphic goodness, though, it still isn't perfect. Because the PSP screen's refresh rate isn't quite fast enough to keep up with the faster fighters, there is a bizarre ~ghosting~ effect that rears its head every now and again. The infamous ~jaggies~ make appearances as well, and while they're more pronounced that the PS2's version of Tekken 5, they're still better than Tekken Tag's. Occasional animation hiccups occur here and there too, but they appear at such an infrequent rate, it doesn't take much away from the final package.    One problem that isn't as easily dismissible, however, is the learning curve created by the PSP hardware itself. Not a fault of the game, but more of a circumstance, the PlayStation Portable's directional pad makes it difficult to pull off moves that arcade and PS2 veterans might otherwise have no problem with. Luckily, it only takes a few hours of practice before the subtle adjustments you'll have to make to be more proficient becomes second nature. Just don't expect to be a ~Master of the Diagonals~ right off the bat.   The amazing thing is, that other than few problems addressed above, it's hard to find further fault with Dark Resurrection. In addition to everything that's been mentioned before, there are a number of other cool enhancements best left for you to discover and there's even a cool tutorial mode that boots up the first time the game is turned on to familiarize newbies with how everything works. That's being thorough folks.Tekken: Dark Resurrection is serious business. It does absolutely everything well and offers a number of options we wish were in last year's PlayStation 2 version of Tekken 5. New modes, new characters (the slow-but-powerful Dragunov and the speedier mash-friendly Lili), incredible graphics, and plenty of other add-ons not only make Tekken a fantastic fighting experience, but one hell of a great PSP game as well.", "date": "Jul 20, 2006"}