{"name": "Monster House", "name_review": "Monster House Review", "ref": "https://www.ign.com/articles/2006/07/20/monster-house-review-3", "text": "See, there's this house across the street that's eating neighborhood people and their toys. How can this house be defeated? By recruiting the help of three young heroes and blasting away at its interior with some supersoaker blasters, that's how. The Nintendo DS version of the CG movie's a clever take on the ~run in one direction, shoot in the other~ gameplay introduced by the classic Robotron arcade game. The problem is, the action's incredibly repetitive and the pacing is far too abrupt, and it lacks that same arcade-style presentation that makes similar games like Robotron, Smash TV and Total Carnage appealing to play even years after their heyday.    Monster House forgoes any sort of film exposition, trimming the first act of the movie entirely and plopping gamers directly inside the house. It's instant action right from the get-go, as you'll choose one of three characters to try and defeat each room in the house. Each character has his or her own attributes, but their main action's the same: blasting with a water gun in any direction from a top-down perspective. By combining the D-pad with the touch screen and stylus, you can move in one direction and fire in another. This comes in handy due to the simple fact that the house is throwing all sorts of haunted goodies at you: chairs, books, dishes. But for some reason, they don't take to the water you're blasting, so let 'er rip.   Because of the independent ~run and fire~ control, the game feels a heck of a lot like arcade shooters of classics' past, like Robotron and Smash TV, and much more recently, the Xbox 360 classic, Geometry Wars. In fact, Monster House is closer to the latter thanks to the touch screen's ability to allow for subtle, ~any direction~ analog control for the water blasts. The game's dual d-pad/stylus control does put a little cramp in the hands after an extended period, so keep that in mind because it will take several hours to get through the dozens of rooms in this haunted house.   The problem is, this is all it is. It's just a basic level progression with very few surprises. Other than the addition of a few new enemies later in the game, Monster House is the same thing over, and over, and over. Items are never ~hidden~ and are always in the same place, so the game lacks any sort of exploration or discovery. Levels also tend to drag on far too long with some unnecessary vacant points between enemy ambushes. The biggest issue in Monster House is definitely its pacing - because the designers insist on telling the movie's story after nearly every room, Monster House loses any potential arcade feel. There's really no reason for the game to stop the action after every level, and in fact it would have been a far more energetic and frantic game without the unnecessary text-based cutscenes. They bring the game to a screeching halt instead of driving the action forward.    Another problem is the fact that there's very little reason to play through the game again. Any room can be replayed, but without any encouragement - like, say, a high-score - this ability is ultimately useless and pointless. And there's also a missed opportunity: no multiplayer co-op. With multiple characters to play as well as wide-open environments to run through, this would have been a great two-player shooter along the lines of Smash TV. But instead, it's just a straightforward single-player progression with almost no replay value to keep the player's interest once the house is defeated.   It's a shame, too, because Monster House has a lot going for it in its visuals. It's all in 3D and running at a slick 30 frames per second, though when there's a huge assortment of haunted objects and large spray blasts to keep track of, the game chugs a bit with some old-school style slowdown. Admittedly the game looks far better in the action bits than the cutscenes due to some really horrible character renderings being shown in a close-up, which is more ammunition towards the fact that the designers should have left them out of the game entirely.  At the very least the game shows that the Robotron design can work with the DS system's touch screen -- there just needs to be a more competent production to exploit it. Had the designers focused more on the action instead of recreating the film's storyline, Monster House on the DS would have ended up a far superior product. Instead, the game doesn't borrow enough from the games it's lifting its ideas from - it's got the graphics engine and the control down, but what it needs is the quick pace and aggressive action to give Monster House that addictive element that made those similar games so classic.", "date": "Jul 20, 2006"}