{"name": "Ultimate Board Game Collection", "name_review": "Ultimate Board Game Collection Review", "ref": "https://www.ign.com/articles/2006/07/26/ultimate-board-game-collection-review-3", "text": "Trying to be so many things at once, Ultimate Board Games Collection fails at nearly all of them. With only one or two exceptions, there is little that this collection provides for those looking for a quick board game fix. Time and time again I kept thinking to myself that these games were more fun than this collection makes them out to be. And that's actually true since the digital gameplay gets lost in translation here. With clumsy interfaces and slow pacing, this is an incentive to become a gaming Luddite and simply buy a 7-in-1 board at the local store for the same price.   Since the PS2 can provide a 3D environment with ease, the developers decided to render everything out and, in turn, made it harder to see what's going on. Does Parcheesi get better with a 3D board and playing pieces that slowly walk about? Do the extra animations force you to gape in awe of the PS2's power to reinvigorate a modified version of Chutes and Ladders (here called Snakes and Ladders)? Does the ability to see a domino board from any angle make it easier to plan your next move? Well, no, nope, and not at all. There are a couple of extra graphical flourishes that help out, but they're lost amidst the rest of the mistakes here.    The problem that's repeated over and over throughout the 20 different games in this collection is that it takes too long to play (each one becoming tedious as a result). Starting up dominoes requires you to select the dominoes one by one, taking turns with the computer. But if the tiles are supposed to be random (and random will always be random) then just let the computer select the seven dominoes for each player and get on with the game. The extra realism doesn't do a thing to help out. Seeing a pair of dice bounce around the table doesn't give the visceral thrill of throwing real dice, it just makes you wish the same animation would hurry the hell up.   The only occasion where the animation comes in handy is in the game of Naval Battle (i.e. Battleship). Setting up the ships is nice and easy and the board is a pleasantly wavy area of water. Firing off shots will create splashes for a miss and a fiery explosion for a hit. Finishing off a whole ship will start a brief chain of fire to indicate that a ship's been sunk. But since the effect is ever so brief, it's easy to miss and afterwards there isn't any notification that a piece is no longer on the water. All of this can lead to plenty of extra shots that didn't need to be fired in the first place and it becomes a big waste of time. Keep in mind... this is one of the better games in here. In fact, it's one of the best, a thrilling example!   The other problem here is that many of the games are simply hard to see or to figure out. Little-to-no effort was made towards making the menus easy to use or the backgrounds work with the action. The backdrop makes Quattro, a modified Connect Four, difficult to see, and the far-off view in Shanghai means that you'll spend half the game squinting to see what the images are on the individual tiles. The only time that a game gets started off right and keeps up the pace is the ancient Egyptian game of Mancala. No fancy camera moves and the animations are taken care of quickly and efficiently. You can get in, play a game, and get out without any hassle. Add that to Naval Battle and you almost have a double feature here.Instead of a compilation of good times, Ultimate Board Game Collection is a horrifying pile of examples of why some developers should spend their time focusing on gameplay instead of showing off their environments. With just a couple of games worth recommending here this is simply not worth your time or money.", "date": "Jul 26, 2006"}