{"name": "FlatOut 2", "name_review": "FlatOut 2 Review", "ref": "https://www.ign.com/articles/2006/08/03/flatout-2-review", "text": "Though its roots were PC-based, Bugbear Entertainment's first foray into the world of console games was quite a solid effort, and more importantly, something rather unique. The original FlatOut was released just over a year ago and featured a driving and simulation system that heavily relied on physics. This meant that nearly every object in the world was destructible, including real-time deformation of your car, though the not-quite-perfected physics-based gameplay meant that the actual driving mechanics were a little touchy and unforgiving at times.   Bugbear has now followed up with FlatOut 2, a game that betters the original in almost every way imaginable and most certainly with regards to its handling and physics system. While many of the changes will likely come off as being subtle or evolutionary rather than revolutionary, the end result is that the game is a great deal more refined and fun than the original.    One of the biggest improvements in FlatOut 2 is that vehicles handle a whole lot better than they did previously. Rather than sliding all over the road like a Chihuahua on ice, the cars handle quite well and you always feel in control. The game is certainly arcade-centric in almost every aspect of its design, but the game's handling does lean a tad towards the simulation side of racing in that you'll have to carefully manage how much gas you apply at any time. It's a great mix that makes the game feel much different than something like Burnout while still maintaining a nice feeling of chaotic competition.   Another nice improvement is that rather than racing against a field of nameless drivers, FlatOut 2 pits you against a group of seven other competitors out for blood. They're fairly generic to be honest, but after a handful of races and looks at the leader board you'll come to know them all by name and curse them when they knock you out. According to the splash screens during loads, each one is said to have a unique driving style and personality, though you don't really get a sense of this during any given race. What does work, however, is that they always use the same vehicle for each class of car, making them easy to spot in the midst of a race. The result is that when you're in the fifth race of a cup and you're a point behind in the standings, you'll immediately recognize who you need to beat (or knock out) in order to stand on the highest step of the winner's podium.    The other really cool part about the other racers this time out is that they get vengeful. Everyone starts out calm and collected, but if you start pushing other racers around and attempting to knock them off the track, they'll turn around and do the same to you. This applies to each and every racer, so you'll constantly see one computer opponent trying to knock another one out.   What this boils down to is that races become flat-out battles (pun not intended). Cars will constantly smack into each other more and more as a race goes on. It's extremely common to find yourself (or any other car for that matter) move from last to first to last to first and so on before a race finally finishes. That doesn't mean that it's a total lottery drawing of whether or not you'll be able to win as skillful driving will almost always net you a finish in the top three, but it does mean that races never get boring.   This is easily FlatOut 2's greatest strength - the races are just pure fun. With the number of things crashing down around you at essentially all times and your opponents constantly battling you and each other for placement, there's always something crazy and chaotic happening on-screen. The game may not be as fast or deep as some of its top-tiered competitors, but Bugbear has done a fine job at bottling chaos into a racer.    One of the original FlatOut's main weaknesses was that its track design wasn't all that impressionable. Sure, there were some pretty cool segments here and there, but just a year later it's hard to remember any specific tracks or sections from the game. FlatOut 2 does make some pretty good strides to fix this, though we still wouldn't call any of these raceways ~classics~.   One improvement in this area is that rather than relying on woods, more woods or a rural town setting, FlatOut 2 features tracks based in not only woodlands but full cities, fields, canals and more. While one track may be rather open and inviting with huge turns and soft wooden fences to keep you on the track, the next might have you hopping on rooftops, through store windows and into the sides of buildings. It's a nice mix of track designs that keep you on your toes from race to race, though we're still wondering if we'll remember what any of these tracks look like a year from now. Still, it's a definite improvement over the first game and even if they're still rather generic in terms of look and feel, there are some really cool sections throughout the game.    FlatOut 2 has a somewhat open career path in that while you still need to unlock races in a largely sequential order, you can jump to any of the three cars classes provided that you own a car in said class. This means that you can skip from the beginning Derby class and head to the third Street class without ever having picked up a car of the Race variety. You're always presented with a series of cups that you can choose from, each generally containing between three and five races, but you'll have to complete a set of cups in order to unlock the next set, making your progression still somewhat linear. The car upgrade system is almost exactly the same as last time out where you're able to buy various parts to enhance your car's performance - pretty simple but cool stuff.   One of the most popular and certainly original aspects of the first FlatOut was its stunt mini-games, affectionately called the Ragdoll Olympics, where you hurled your driver out of your vehicle and at some sort of goal or target. This time out the count has been doubled from six to a full dozen games, each varying quite a bit from the next. One of the most-wanted features after last time out was the ability to hold a marathon of events rather than skipping from single event to single event, and Bugbear has delivered. Whether online or off, you're able to set up a multiplayer sequences of mini-games and track points from one game to the next. It makes for a pretty damn awesome party game.   Speaking of online games, FlatOut 2 has a fairly robust and full-featured online setup. Featuring ranked matches, the ability to set up tournaments that include any mix of game types (race, derby or stunt) and more, everything plays quite smoothly online. As fun as it is to race against the crazy computer AI, it's even more fun to race against live humans (of course) and Bugbear has done a great job of blowing out FlatOut 2's online features about as much as you could hope for. Really the only thing missing is full-on racing leagues - maybe we'll see that next time out.    Like its predecessor, one of the game's most impressive aspects is its visuals. Most everything on the track is destructible and cars dynamically deform when smacked. Tracks are literally littered with bits of debris, poles, boxes, podiums and more to add plenty of visual and destructive flair, and there's no lack of foliage in the outdoor areas. This truly is a great looking title, and we can't wait to see what Bugbear is capable of when it makes the next-gen leap on consoles and subsequently takes the PC to the next level as well.FlatOut 2 is one hell of a fun racing game. Sure, many of its elements feel a tad generic, like the track and character design, but what it really comes down to is the racing itself and Bugbear has done a great job at drawing a line between control and complete chaos. Definitely give this one a try if you're into racing games whatsoever.", "date": "Aug 3, 2006"}