{"name": "Galaga", "name_review": "Galaga", "ref": "https://www.ign.com/articles/2006/08/04/galaga", "text": "Namco Networks continues to mine is enviable back catalog for its expanding mobile empire. The latest is a re-release of Galaga, which has already seen play on hundreds of thousands of mobile screens. The new twist to the classic space shooter, though, is a pioneering effort in mobile: micro-payments. For an extra 25 cents per play, Namco will automatically start you off in dual fighter mode, which lets you double your firepower without the hassle of coordinating the whole tractor beam maneuver with the top row of space bugs.   If you like Galaga, you'll be pleased with this edition -- it's a much better arcade port than some of Namco's earlier efforts, like Galaxian. The pacing feels just right -- no slowdown or jittery controls. Fans can leap right in and get to work, blasting aliens that use the same patterns as they did in the old arcade cabinet. (And new cabinets, too, since Namco's well-orchestrated arcade renaissance has been putting this game back into strong circulation.)   This new Galaga is an exclusive on Sprint right now, so it employs the Game Lobby feature set -- leader board, community link, etc. What I'm incredibly curious to follow, though, is the micro-payment conversion rates. How many mobile gamers are willing to purchase the download, but then pony up the extra quarter for dual fighter mode each time they play? Personally, I think the price is just too steep. Four dual fighter plays equals a dollar -- that adds up after a while. A nickel seems like a fairer price if Namco is expecting you to pay full price for the download.  Whether you opt to use the micro-payment feature or not, you're getting a great mobile port of the classic shooter that influenced an entire industry. The graphics are right on, the enemy patterns are all in place -- fans will feel right at home. The dual fighter buy-in is an interesting wrinkle, though, as it does make the game easier from the get-go and it is fun to use. But to charge an extra quarter per use? That really tempers my enthusiasm for the future of micro-payments.", "date": "Aug 4, 2006"}