{"name": "Battle B-Daman", "name_review": "Battle B-Daman Review", "ref": "https://www.ign.com/articles/2006/08/12/battle-b-daman-review", "text": "Anyone remember that kick-ass game called Crossfire back in the late 80's, early 90's that let kids fire tiny ball-bearings at each other without fear of parental beatings?  If so, you'll remember scrambling to pick up as many rounds as you could, dropping them awkwardly into your tiny red pistol, and shooting the heck out of the little pucks that sat between you and your rival.  Well when it comes to toys, products are often gone but not forgotten, as everything seems to get its chance at a revival.  A new Ninja Turtles show is already a few seasons in, Transformers is coming back to the big screen, and Pokemon has a new big-eyed, loud-mouthed competitor that takes the world of Crossfire to a whole new level.  Battle B-Daman for Game Boy Advance takes inspiration from the show, combining an over-dramatic attitude with the all-too-common Americ-anime presentation.  Setting itself apart from the licensed competition, however, B-Daman makes a few odd (but interesting) design decisions, including uncommon presentation and a real-time battle system that's a bit shallow, but still pretty entertaining for what it is.  Just keep in mind you're playing an action role-playing game based on tiny marble-shooting robots   While the game really won't do much for anyone that isn't a fan of the television show, B-Daman does make a few design choices that are pretty interesting, and actually took us by surprise.  On the surface, B-Daman looks like any other ~I want to be the best~ rip-off out there, as it features a young boy from some no-name town, out to prove to the word that he's the best Pokemon, Beyblade, B-Daman, or Yu-Gi-Oh! Player out there.  And wouldn't ya know it, the only way he's going to do that is by traveling the world and customizing his B-Daman to wage war against other B-Daman players.  Developers throw a curveball with B-Daman, however, as the entire game is done with storyboards and a ton of hand-drawn art, rather than using tilesets to make levels and an over-world like almost every other RPG out there.     All navigation in the game is done with character portraits, area backgrounds, and pop-up menus, so rather than actually controlling the character, players will select areas to automatically move to.  Moving from Main Street A over to B-Daman Coliseum, for example, will simply fade out the current background, bring up a new one, and change the people listed in the ~Talk~ and ~Battle~ menus.  It can be a bit confusing to navigate an entire game via menus, but once you're used to it the design proves to be quick for progressing the story.  Simply move to a new area, talk to everyone, and battle.     And battle you do, over and over again until you've had enough.  Since the core of B-Daman is all about doing battle with their super-deformed robo-men, the action is where most of the effort was put on the development side.  There are two modes of fighting in B-Daman, allowing for both direct-hit battles, which use life bars to determine the winner, and B-Daman Invasion, which is the current-day evolution of what crossfire was, using marbles to shoot a floating puck into the opponents side.  In order to give the battles the most action-oriented feel possible, the fights are displayed in near first-person view, showing only a wireframe of your own B-daman.  Players can slide their robot left or right, and have a bit of room to move forward and backwards as well (though that movement is very limited).     Using L and R, players can rotate their B-Daman slightly, allowing them to perform bank-shots off walls, or simply fire at opponents without being directly in front of them.  Add in a main shooting button and a combination for super-attacks (each using the B button and d-pad direction), and you've got the basics nailed.  The gameplay is actually much faster than we anticipated, and has players constantly parrying enemy attacks and trying to lead with their own shots, all the while moving from area to area to collect more B-Daman balls.  Depending on the robot's stats, only a few pellets can be held at a time, and everything from shot speed and power to actual mobility and durability is determined with new B-Daman parts.   Even though the battles are technically solid, the overall gameplay is only going to last as long as you can handle the hook of the game.  We went through thousands of battles for this review, and we can honestly tell you that we had enough after the first hundred or so.  Designers attempt to add to the challenge by changing the arenas, adding environmental effects such as wind and ice to change how the game is played, but when it all boils down to it, you're still just shooting glowing balls.  The customization, acting as the other huge drive in the game, is pretty deep, including just under 300 parts to use as you wish.  Each part changes attributes in good and bad ways, so you'll have to decide what to sacrifice in order to excel in other areas.  We did have a huge gripe with the parts store, however, as it didn't allow us to equip items as we were shopping, so it was tough to tell exactly how our unit was being effected from part to part.  Allowing for a ~purchase and equip~ button would have really helped the user interface, and since the majority of the game is spent either battling or tweaking your B-Daman, it gets in the way.     And while the presentation was solid, allowing for a ton of on-screen time for characters and actual show art, the lack of animation in the game is simply stunning.  B-Daman characters slide back and forth, and the only real animation that happens in the game is found in the scaling balls and pucks.  Special attacks are visually simple, and there's really no reason a game like this couldn't be adapted for cell phones in its current state.  There are a good chunk of visual effects, such as lightning bolts or fire overlays, but as a whole the game is very light on true animation, and we would have loved to see more.  On the audio side, B-Daman includes a few voiceovers, having characters shout and cheer (in Japanese, oddly enough, as this show is simply crazy), though it's still very light as well.  The overall sound direction isn't bad by any means, it just doesn't go above and beyond aside from a few hoots and hollers.    When it comes down to selecting B-Daman over any of the other recently released titles for GBA, theres really no reason to compromise.  With games like Summon Knight: Swordcraft Story, or even Super Robot Taisen (if youre into the whole robo-customization thing), B-Daman just doesnt hold its own as much as wed hoped.  There are still some awesome battles, and the customization is pretty strong, but the overarching gameplay will draw thin eventually, and when it does, be it after a few dozen or a few hundred face-offs, theres nothing more to see.  If youre crazy for B-Daman its a fine choice to accompany the show.  If not, take a pass on this one.", "date": "Aug 12, 2006"}