{"name": "Deep Labyrinth", "name_review": "Deep Labyrinth Review", "ref": "https://www.ign.com/articles/2006/08/16/deep-labyrinth-review", "text": "At its very core, the Nintendo DS is a system that embraces creativity and flexibility over pure horsepower and technical prowess.  With games like Animal Crossing, Nintendogs, Electroplankton, and Brain Age, Nintendo continues to show the world why this two-screened handheld with the comparable power of a N64 is more than just a gimmick (as critics hesitantly claimed in 2004), and more of an immersive gaming experience than a showcase of raw technicality.  With DS, Nintendo has given developers a power that can't be found on any other gaming platform in the world.  Whether teams use it in the right way, however, is entirely up to them.  When Deep Labyrinth found its way into our system a few weeks ago, we were intrigued at its design, as the dungeon-crawling role-playing game dared to no only deliver a fully 3D experience, but also one that was almost entirely touch based.  Now that we've had a chance to go the distance with the design, we've found that while Deep Labyrinth has some seriously hindering flaws, it's still a game that, if nothing else, manages to bring an entirely unique experience to this equally unique platform.   Taking a relatively generic (but stylized nonetheless) approach to the classic RPG formula, Deep Labyrinth has players taking the role of a young boy who, depending on which quest is selected, must embark on a journey into an alternate world in a quest to save a loved one.  The gameplay is comprised of level-to-level exploration, as the protagonist explores the mystery of the maze-like labyrinth.  Much like any other true dungeon crawler (meaning the game is more about fighting and exploration than storytelling), Deep Labyrinth focuses on finding and upgrading items, learning spells, and above all else, leveling up.  In order to showcase this otherwise plain design, developer Interactive Brains has decided to show the world through first-person exploration, allowing users to navigate the dungeon's mysterious halls directly through the eyes of the main character in gameplay strikingly similar to a toned down version of Oblivion for Xbox 360.     All attacks, defense, and spell maneuvers are handled directly on the touch screen, using the stylus to draw casting symbols or swipe a sword in the intended angle and direction.  While the feat is technically impressive, using all 3D modeled characters and environments, the overall control suffers a bit, as stylus recognition and overall control is hurt.  Since all movement is handled on the d-pad, player controls have a bit of a tank feeling, as there's no easy way to move with analog precision or strafe.  A design using a main action button and stylus control for aiming (much like Metroid Hunters) would have actually been an advantage here, though in its current design Deep Labyrinth plays more like a GBA first-person game, giving off the same feeling as a ray-casting engine rather than full 3D movement.  Movement and turning just doesn't translate well on the same d-pad, and it's a bit of a letdown.     Along those same lines, stylus control for doing battle and using spells is a love/hate relationship.  On one hand, giving players the ability to attack and defend with added precision is a great advantage, allowing a more free-form feel to the combat.  Unfortunately, the stylus recognition for sword battles isn't quite tight enough, and the included ~lock-on~ system, used as a makeshift form of Z-targeting, just isn't reliable enough.  Oftentimes during battle we'd pull away from the targeted monster, or simply lose the lock-on ability for apparently no reason.  This is a minor issue, but since lock-on battle actually changes how the control is used (as left and right are used for strafing around the target, rather than turning), it can get in the way.  On the other hand, basic battle can be done simply by tapping the screen for a generic sword swipe, and we actually found that worked far better than dealing with the lock-on ability.  Magic casting is also pretty rewarding, as players can call up the magic input on the fly, enter in the spell using the stylus (while moving with the d-pad), and simply press the ~attack~ button when the target is in range.  The main problem with the touch/d-pad control is just an overall lack of polish, and will have a varying impact on players depending on how much they can/can't tolerate rough control.  It doesn't kill the game, but it does make it a bit less enjoyable, and could really turn players off from what is otherwise a pretty strong design.   Aside from the basic combat, Deep Labyrinth is basically a run-of-the-mill exploration game.  Players will move from level to level in the dungeon, fighting bosses, solving basic puzzles, defeating baddies and upgrading weapons.  As an added touch to the design, the game actually levels your character based on what items you're using most, so if you chose to play the entire game with a blade, so be it.  If, on the other hand, you love fire spells, expect to deal a hell of a lot of damage in the later hours of the game.  The only other downside to the design is that it's relatively basic and repetitive, as players will go from level to level, finding new spells that open new doors, leading to bigger bosses and more experience.  Hardcore RPG fans won't have a problem with the game's pacing, but anyone stumbling into the game without knowing exactly what they're getting may find themselves a bit let down at its formulaic progression.   Even still, the game's technical achievement is pretty impressive, as some of the character models are pretty complicated for the DS hardware.  The game still has a bit of a low-poly look to it, though many of the textures and main characters still have a pretty strong visual design.  You won't be finding anything on par with games like Mario Basketball 3-on-3 or Final Fantasy III, but it isn't rough on the eyes either, and the overall look is still above average as a whole.  On the audio side, the game works with a few strong orchestral pieces, blended in with some simply average audio effects.  A little more attention to auditory presentation would have been nice, but it's still a fairly strong attempt.  In addition, the game has a beautiful fully-animated intro, which is an awesome addition to what could otherwise be considered a very average presentation.     As an added bonus to the game, Interactive Brains has actually included a whole second adventure to the Deep Labyrinth package.  Since the series has been around for quite some time in Japan, Deep Labyrinth has gotten some serious star treatment when coming to the States.  For beginners to the series (or more casual RPG players in general), a starting quest can be played, which is geared towards a younger crowd with a more bright and cheery style.  This mode will have the main character Shawn aided by his dog, and allows for a ton of friendly characters to give aid to the player in nearly any situation.  On the opposite side of the spectrum, however, the second mode, entitled Wandering Soul, is taken from the original Deep Labyrinth cell phone game in Japan, and features a far more mature story line, and audio/visual presentation, mixed with entirely different monsters, bosses, and dungeons.  Rather than simply making an easy and difficult mode, Deep Labyrinth actually includes two very different games, and nobody can complain about that.    In the end, Deep Labyrinth is going to be a love it or hate it experience for tons of players.  If youre thrown off easily from somewhat clunky controls and repetitive exploration, you may want to pass this one up for a more modernized RPG.  For role-playing fanatics, however, Deep Labyrinth offers some awesome diversity in level-up strategies and a story mode thats still very satisfying if you have the stamina for it.  For anyone that thinks Deep Labyrinth looks like the perfect DS companion, we encourage you to chase this one down, rather than being discouraged by the overall score.  For anyone else, though, the amount of flaws could seriously outweigh the rewards, making this a game that should be passed up.  If theres any way to rent this one, we suggest doing it, as Deep Labyrinth will either suck you in, or force you out, which is one of the primary reasons we simply cant fully recommend the game.  The control is a bit too clunky (especially when trying to move and turn at the same time), the stylus input isnt as tight as it could be, but the overall RPG experience is there.  Purchase at your own risk.", "date": "Aug 16, 2006"}