{"name": "Ant Bully", "name_review": "The Ant Bully Review", "ref": "https://www.ign.com/articles/2006/08/17/the-ant-bully-review-2", "text": "When it comes to games based on kid's movies, the default design seems to be bare bones platformer. So we're intrigued when a developer tries something different with their licensed game. Unfortunately, different isn't always better, and A2M's shrunk down version of the Ant Bully for the GBA is much like the movie itself; littered with bugs.   Players take the roll of Lucas ~The Destroyer~ after he's been shrunk down by a colony of ants. Lucas must prove himself by helping the colony with increasingly dangerous tasks that seem far beyond the realm of possibility for a little kid. Only by proving himself to be an ant can Lucas be returned to his normal size. In his ant-sized state, Lucas has increased strength and ant telepathy that he uses to order around other ants to do his bidding.   It feels like the team at A2M didn't quite know how to make a game for children. This coming from the people that made some pretty solid kid's license titles like the Kim Possible series is disappointing. There are two things players do a whole lot of in the Ant Bully: read, and complete chores for other people. When we were kids, reading and chores were nowhere near the top of our list of things to do. In fact, video games were an escape from those things!   The Ant Bully has far too many cutscenes that are just one textbox after another. The characters will just stop and players are forced to wait while they have conversations. If the game cut to a scene with more detailed pictures of the characters, it would make a world of difference. As they stand, the in game sprites of the ants all look nearly the same. And since it doesn't indicate which ant sprite is speaking, players better memorize their names pretty quick.   At the end of these conversations, players are given a task to complete. It's usually just walking across the maze like level to talk to some other ant. Here's where the majority of the gameplay comes in. Much of the Ant Bully is a Zelda like adventure, where players will make their way through the giant backyard. There is very little combat, just the occasional pillbug, or spider to hit with a stick. There are however plenty of puzzles to solve, though the puzzles do not offer much variety. There are two basic puzzles: crossing a chasm, and opening a path. Players solve these puzzles by either pushing a rock, or telling an ant to stand in a certain spot. In the first mission alone players use nearly ever combination of puzzle solving techniques. In the later levels the puzzles do not get more complicated, they just get longer. The game quickly becomes tedious as players are forced to push rocks and make ants stand still dozens of times, just to go talk to someone.    Guiding the ants around becomes frustrating, since they cannot do a lot of things. They have random lines that they can't cross since it's not their territory (they're the only ant colony in the yard, everything is their territory!). They also will not enter any area that has enemies (even though they're carrying spears). As soon as you tell the ants to do something, they are automatically unselected and will stop following you. The gameplay really suffers when the player has to go back and reselect all his ants to get them to follow him again, making the game feel more like a babysitting job than a video game.   As if the game wasn't slow paced enough, the game suffers from some major slowdown issues. During the few turret levels, the framerate drops to a crawl, making what is supposed to be one of the most exciting moments of the game become a frustrating ordeal. The framerate suffers whenever there are multiple characters on the screen, and sometimes for no reason whatsoever. In levels with a lot of rocks to push, having the game slow down really drags out an already too long mission. In addition, there a few glitches that affect the enjoyment of the game. In a particular mission, Lucas has to cross narrow pathways over bottomless pits, while avoiding falling rock. If the player does get hit by the falling rock, they'll lose some health and be knocked off the platform, losing more health. Then you reappear on the platform, right under the rock again. The process repeats until the player dies and has to start the level over. Little things like this are bound to make a generation of kids suffering from ADD to quickly toss this game aside.   There are a couple boss battles randomly thrown into the game and while they carry the hope of varied gameplay and some action, both of them prove too difficult to really be suitable for a game for kids this young. Despite the over explanation of every mission players are sent on, the boss battles are thrown at them without a word. It takes a few deaths to even figure out what to do, let alone succeed.   The game is not all bad though, and does have a few things going for it. The world itself is fairly large and gives the players a good feel of being any sized. Obligatory giant quarters or soda cans litter the ground, and pebbles and cracks in the ground become huge obstacles for the player. The colors are bright and lively, and changes as the player enters different parts of the yard. The scene will shift from day to dusk to night according to where Lucas is wandering. Each section has its own music as well, matching with the feel of each environment.  The Ant Bully is a title that is striving to be something bigger than it is. It took a different route from the average license title and gave us something different. It did a lot of different things, but unfortunately it did most of them wrong. Ant Bully is not the kind of game that kids are going to be able to pick up and play on a long car trip to Grandmas house. And honestly, thats really what a licensed GBA game is good for. People drawn to the appeal of an adventure game involving being shrunk to the size of a bug have a much better option: The Legend of Zelda: The Minish Cap.", "date": "Aug 17, 2006"}