{"name": "Barnyard", "name_review": "Barnyard Review", "ref": "https://www.ign.com/articles/2006/08/17/barnyard-review-2", "text": "THQ is no stranger to Nickelodeon titles. In fact if you think up a Nick show, chances are THQ made a game for it. Naturally with the release of Nickelodeon's new film, Barnyard, THQ has stepped up to the plate to make another GBA title for the kids to enjoy. While it may seem weird that all the male cows in the game have udders that shoot milk, that will soon be forgotten amidst the ups and down of this mixed title.   Unlike most license games, players don't actually play as any of the main characters from the movie. Instead they create their own cow character and enter the farm as a new member of the herd. There are four types of cows to choose from, and each cow comes in three colors, giving players a small sense of customization with their game. Players will have to earn the respect of the various inhabitants by completing quests and playing minigames, while following a loose version of the movie's plot.   The farm that players will be running around in is pretty big, especially for a handheld title. The game is pretty free roaming, letting players pick what they want to do and when they want to do it.   In order to prove their worth as a member of the farm, players will accept tasks from the animals around the farm. Most of these are pretty basic fetch quests that take about a minute to do. As players complete these quests, more areas of the farm open up. Each day progresses by a timer, and the number of quests players complete is up to them. Players have the option of going to sleep at any time after 5 p.m. and can start again the next day at 5 a.m. At 2 a.m. players go to sleep automatically, so the few tasks that need to be completed within that day have to be done by then or the player loses out on getting the money. Some of the mission progress the story along, while others are just side quests. The main mission that players need to complete to keep the story going is shown in the Mission Screen in the pause menu. Since the farm is pretty big, this is a good way to keep kids from getting lost and wandering around aimlessly.   Earning money allows players to buy upgrades for their barn. Decorations can be purchased to make the nightly barn parties more festive. It's not necessary by any means, but adds a level of customization and accomplishment to an otherwise completely linear game.   Occasionally an animal will challenge you to beat their score at a game or to do a chore around the farm within a certain time. This is where the game shines. There are over 15 minigames to play, and all of them track your high score. Many of the games are chores around the farm like sorting fruit, fixing fence posts, and keeping gophers away from the vegetable patch. There are also a number of recreational games like bicycle races, bowling, billiards, and whack-a-raccoon (like whack-a-mole but with you guessed it, raccoons). There's even a Frogger style lily pad dash game. The difficulty for these games is going to be far too easy for anyone over 12 years old. They do get progressively harder, but it's obvious that the design is for young kids to be able to enjoy. Many of the minigames can be purchased for the barn. The basement can become an arcade of sorts, offering players the chance to play a variety of games without having to run all over the farm.   In addition to earning money for completing tasks, players can also earn upgrades to their character. Running speed, life, and udders can all be upgraded and will help in the later levels when players have to fend off evil raccoons and hungry coyotes using nothing but the milk that comes from their biologically impossible cow boobs.   Using the udders as weapons is as hard to control as it is ridiculous. Players have to use an awkward rotation system to line up an arrow at the enemy. The shot often misses since by the time the milk projectile goes flying, the quick moving enemies have dodged it. It's much easier to just run past the enemies, and in some of the later timed missions, players will need to if they expect to complete it on time. Luckily there are very few missions that even require players to enter areas with enemies, since trying to fight them off is a futile attempt.   Each character doesn't get much screen time, and due to the minimal number of cut scenes, very little development. Having to deliver love notes to pretty girl chickens is weird when players have no clue who either of the characters are. It seems expected that people playing this game have seen the movie, and really that is not an unfair assumption. However a few more cut scenes would have been nice, especially since the ones it does provide are pretty funny (and occasionally sad).  Barnyard is a kids game, plain and simple. Even for fans of the movie, this game is going to be just a little too basic. However, for kids looking for a fairly free roaming game that offers a variety of minigames, Barnyard is a good choice. Just dont expect it to last too long. Its not perfect by any means, but what can you expect from a game that cant tell the difference between a boy cow and a girl cow?", "date": "Aug 17, 2006"}